{
  "positive": [
    {
      "review": "This game gives me heavy OG DOOM vibes, especially the final sequence of the game...for those of you who played OG DOOM, you'll know -exactly- what I'm talking about.\r\n\r\nTime for the good, the bad, and the ugly.\r\n\r\nThe Good:\r\n\r\nYou piece the story of the game together gradually, and it's done without cutscenes or dramatic flair...it feels organic, and follows a logical sequence of events.  The gameplay mechanics are insanely fun, and by the time you get far enough into a mission you really start to feel like a badass.  The fact that there are persistent upgrades means that you have a reason to switch to harder difficulties and do more, because you won't be at a crippling disadvantage.  The gameplay is extremely well balanced, and it was easy to tell the team cared a -lot- about their product.  \r\n\r\nAnd for what voice actors there are, you guys did -awesome-.  \r\n\r\nThe Bad:\r\n\r\nA bit colorful considering the situation going on, and the music fits but can be a bit repetitive.  Still, if these are the worst points of the game, this is nothing to worry about.\r\n\r\nThe Ugly:\r\n\r\nSometimes when you enter a level section for the first time, you can get basically insta-nuked in the first room.  Annoying.\r\n\r\nAll in all, I HIGHLY recommend this game, and supporting further projects by the people who made this.   The Co-op play is just the chef's kiss on top of an already excellent title.  AAA fun without the the AAA price.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Absolute masterpiece from gun handling to the story. I was skeptical about the price and how much content there is but this game has been made with so much love its absolutely worth it full price.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Definitely my favorite roguelike game I have played so far. The reason why is because it is so accessible to someone like me who gets frustrated easily within games of this genre. The ez mode is very easy for the most part, besides some of the bosses & challenge missions. Every few rooms has a save point for you to save & exit, allowing you to continue your run without having to finish it in one sitting. The builds allow you to do become truly powerful & using the full-auto weaponss like smgs & miniguns feel extremely satisfying. \n\nHighly recommended for any shooter fan.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Its an FPS rogue-like with meta progression.\nIf thats your jam you'll like this game.\n\nThe game is also broken into a bunch of shorter/smaller acts and challenges.\nSo each run is like 30-45min so dying and going back to the start isnt quite as bad as when the games are much longer.\n\nThings also differ from other rogue likes in the sense that its tactically-fast, in the sense that you get stealth at the start of each \"room\" that you have to clear so you can scope out what your enemies are, where they are placed and plan out your attack, where you want to start from - what is the priority target you want to kill first etc. Whats in each room largely stays the same but the shapes/layout/spawn locations vary, so theres a lot of variety.\n\nI also almost exclusively played coop and its really fun, its also the only time you can combine elements to create some super wild combo's, like someone can go freeze to CC lock everything while someone else goes tendrils to tie the room together and then someone has a crit sniper to explode the tethered enemies all at once. Its a good time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "very fun for those who enjoy the fps roguelike genre!!!!! very satisfying and very fun!!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game is really nice to play in co-op mode with my husband, it's very intuitive and actually quite relaxing, even it's a shooter, main bosses are beatable if you do the right teamwork, and we didn't struggle too much with them. We still didn't finish it, but as for now we had so much fun together and it definitely left very nice memories for me, so I do recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you like fast paced shooters this is the game for you. If you like games you can beat with no effort look else where.  This game is intense especially on the harder setting and the bosses are hard to defeat especially if playing this solo. The Devs (Prophecy Games) are top notch. Errors, bugs and glitches are fixed quickly also they listen to us the players bout concerns we may have with some badies being a lil to OP or seem broken with there mechanics. This is a game you will easily get your money worth out of.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So far this scratched my itch to have a simple, straight forward FPS game that just feels good to play. Enough options to provide variety for runs, simple enough to not be annoying. It doesn't make you feel like you need to go 100 miles per hour, but is setup so if you want to speed through runs, you absolutely can.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "DeadZone: Rogue is a toughest son of a bitch i have never played. Having died at the boss, after 40 mins of hard gameplay and effors, it made me crazy at the beggining, but, dude... After many tries, when you kill the motherfucker, and complete the zone, you feel as good as hell. Almost that good as this game is.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A PVE FPS Roguelike that actually has fun perks, weapons and gunplay with a good gameplay loop and overall system.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is great when you just wanna switch your brain off and have fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game, one of the best fps rogue games on the market right up there with Gunfire Reborn. The co-op experience is barely functional but it can work on a good day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I could play this for years, gunplay is great, movement is solid, and the type of guns and abilities you gain throughout the run make it satisfying. Buy this if you have extra cash laying around, you and your two friends will have a blast",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I game that was released on my birthday so I gave it a try and it’s turns out it’s one of the most enjoyable games that I have played with my wife, so it does make it a bit more special than other games I played",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good and fun FPS-rougelike.\r\nA little confusing on what to do though in terms of objectives.\r\nOh well - things to shoot!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really great game with short but good story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game for the price, eagerly awaiting the next DLC\n\nFor the devs, if you read this:\nThe meta-progression is nice, it is what keeps games alive, but this game desperately needs deeper and more choice oriented perks. You can max out everything with no branching of skill trees and no synergistic interactions, which means every build becomes largely the same concept with a slight elemental twist. I think anyone who has played the game a fair bit will agree when we say that going a little more in depth with progression and build variance would be an absolutely massive step to making this game contend with the big roguelikes. We crave buildcrafting.\n\nAdditionally, some better replayability would also be much appreciated. The endless modes kinda just become the same wave over and over with little to no changes roughly 30 minutes into a run. Something like additional enemy modifiers synergizing with floor/room modifiers could do wonders on creating more unique interactions.\n\nI know these critiques might SEEM like the game isn't worth getting, but in reality it is. At a minimum you should be able to get 30+ hours of really satisfying and fun gunplay and movement, so at it's relatively low price it is 100% worth the grab.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great little FPS game.\nWhile the game does have a story and scatters around information and lore for your collection, the focus is on the gameplay.\nGameplay is rogue-lite progression and adding additional complexity and synergy in each chapter (zone) of the game that stair steps both complexity, RNG options, and powerscaling.\n\nIt has coop up to 3 players. Enemies scale quatity and stats per player. Scaling is pretty decent in that more players doesn't guarentee more success but a full party will usually soar past the scaling level if the players start getting good synergies in their builds and support eachother with weapon & armor swaps.\n\nThis game is worth it at the MSRP price point and we need more games of this quality at this price point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the finest rogue-like experiences out there, packed with an incredible amount of content to unlock and a deep meta-progression system that keeps you coming back for more. Every run feels rewarding, and the long-term progression adds real depth to the gameplay. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good, buy game, fun game, run well, game do good, fun progression, need 4 player, one friend left out, no fun for friend, good game, buy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite co-op games to play with friends! This game is 100% worth playing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Rogue-likes ive ever played, dangerously addictive and somewhat challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play a lot of roguelikes and roguelites, and all I can say is if you're thinking about grabbing this game just get it already. Worth full price and then some. I have already accumulated over 24 hours of non AFK time on here and cannot put it down any time soon. Builds feel amazing and aren't underwhelming like some other rogues. If you're a synergy freak they have that in spades.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a pretty good indie game. Amazing soundtrack. Beautiful graphics. Very fun gunplay. The build system. The overall atmosphere and gameplay is awesome 🔥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun run and gun, a great game with friends, with enough run types/difficulties to play for awhile. The builds can get really outta hand and it feels great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first we pirated the game but then the online version doesnt work. But the game was on sale so we bought it here. Would pirate again 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic and very satisfying game, and the difficulty is perfectly balanced, which is much appreciated :D\n\nThe weapon mechanics and synergies are excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game better with friends but epic solo shenanigans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very solid rogue-like with VERY satisfying gunplay. The different upgrade paths offer unique builds for a ton of replayability, and accomplishing missions on higher difficulties for the gun skins is really fun because some of them look awesome. Cyberpunk aesthetic and music really tie the whole thing together though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unexpectedly the most fun game I've played this year. Looking forward to the expansions!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun and reasonably priced.\n\n\n I hope Killing Floor learns from you in terms of design and pricing.💕",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m writing this review as someone who has played through the entire campaign (all 3 zones) and all specialty missions on normal. It feels like an early 2000’s game that you look forward to playing while drinking a liter of Mountain Dew. Roguelites are amongst my favorite genre and I rarely play them in an FPS style. This game scratches an itch I didn’t know I had. I have so much motivation to play though the higher difficulties because of the build variety. Let me try an augment with this perk, or this item with that elemental. If you love the word “proc,” you’ll see it plastered all over your screen as you decide which buffs are best suited for the moment. Gun play is fantastic. You’ll end up having favorite weapons but ALL weapons feel fine on your hunt for the best. If you like colors and particle effects, hop on board and play this game into oblivion. 10/10 IDGAF I want more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game for the most part. really enjoyable. gunplay to builds are really interesting and different every run (for about 50+ runs). concept was different unlike other fps rouge likes. 100% was 1 of the most annoying to do compared to others games. wouldve been better with friends maybe but still enjoyable for the 30 hours spent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly cant say much other than   love this game and the true rogue lite elements that apply to it. most games have the \"rogue lite\" or \"rogue like\" tag that are not at all in the category. this game hits the nail on the head",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and simple. Not very story rich but gameplay is solid and guns are fun to use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good with friends or solo, and i hope we keep getting new content i can play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, excellent experience with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun roguelike shooter that leans into custom builds each run. It does have some performance issues that could probably be improved, but overall plays great. Devs are adding more content after launch which is a good sign. Its worth a try if these kinds of games are up your alley.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool variety of builds, fast paced and fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Found this game through social media many moons ago, and have played it quite a bit. I have played it not only solo but with friends and I gotta say it is a nice take on an FPS with Roguelike elements that change your runs and how completely game breaking you can be. I can't wait for more content and more Story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for the price. Nightmare difficulties give a real challenge!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really fun little roguelite shooter, definitely recommend if you're into either genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neat deployment of roguelike elements in an FPS environment. Wish the FPS was a little busier but still very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, solid, fast gameplay with a great leveling system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deadzone: Rogue was worth the wait. It has an addictive gameplay loop that will keep you coming back even after you die again and again, and there’s always something new to upgrade or check out with every attempt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun and easy to get into. It's perfect to play while listening to audible as the focus is more on gaming than story. Not to knock the story but I enjoyed this primarily based on gameplay. I fully recommend this to any fan of fps and rouge-likes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is a equivalent  as a good sexual good time release, solo or coop but just as specific reference better with friends or sometimes strangers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much Defo worth buying it for myself and my friend! you should try it sometime if you are reading this and haven't",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am honestly blown away with how fun this game is, there's so many different ways you can play and it truly doesn't feel like there is a \"Right\" way to play.\n\nOver all amazing game, and i can't wait for the new zone to come out in January",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game. Hopefully there's more in the works as well! By far one of my favorite roguelike/roguelight games I've played in a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and somewhat challenging on higher difficulty levels roguelike",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun, Lots of guns and things to shoot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly just a blast to play. There's a ton of ways to build your character each run, guns feel great and have really good sfx and feedback to them. I wish there was more to this game, more content, skills etc, but that's only because I enjoy it so much. It already has more than enough content to stand on its own and if you just want to shoot stuff without the burden of multiplayer or a campaign, this is the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun rooty shooty, just there were more guns.\r\nI really like guns.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been great to play and when it starts to get 'boring' or repetitive, the devs update with new and interesting things. \n\nGreat rogue type and even better that you can play with your friends. I absolutely love the extra spicy add-ons when you get into level 2 and 3. Do wish you could slide or run and slide though! \n\nRecommend this game if you like to play alone, with friends or with randos - its good in everyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was hard at first for me to look at or get into, but after a few fixes and come Extra love from the Dev's I am kinda Really unable to stop playing it!!\n\nCheck it out for your self.. I Recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic Game just sit back, blast, and give the plant a pet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! No matter how many times I've failed a level, there's that need to try again, until I get it right. Lots of perk and augment options to try out different play styles and some might even surprise you. And when those builds practically build themselves *chefs kiss*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, feels good to play, fun with friends, it seems unfair at times (Some enemies hitting through walls), but besides a select few cases it's mostly a \"Skill Issue\" on my behalf. \n\nThere are a couple bugs that could end runs and sometimes connection can be questionable (Could also be one of my friends is basically another country away), but besides that I can't wait to see the new updates to the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mc sounds like Sam Fisher, power ups are fun, number goes up, tons of fun coop, reminds me of old school coop horde games. I love that it's straightforward and to the point, no micro transactions. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game but gets boring when you've unlocked everything in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great FPS roguelike that I find more enjoyable to play with another friend but you don't have to. After about 40-50 hours if you are playing on a harder difficulty then you will have cycled through most of the unique builds. That being said I'm still enjoying it as you can see to the number of hours in this game which will only go up in time. There are a few difficulties in this game I reccomend playing on 'hard' for your first playthrough of the mission or else the game will be to easy. Currently at the time of this review there are 3 zones which each zone has a group of missions to complete and the devs plan on adding zone 4 in the near future and hopefully even more in the later future. This is one of my favorite roguelikes even though I wish there was even more roguelikeness but we always wish for more even with near perfect games like Elden Ring. If your still on the fence about whether to get this game or not then wait for a dicounted price. That's all and I hope you enjoy this game if you decide to purchase it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game with lots of variety in how you want to build during a run and also really fun to play with friends. The story is also interesting and leaves me excited to see the future updates and contents that are going to come in the future! One thing I would love to see added in the future is our stats during runs (like what our crit percent is, damage amp, etc.) as that doesn't exist yet, but it not being in doesn't hinder enjoyment, just would be a fun thing to see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, lots of fun and so far only played solo.\n\nWould like to see some more information while in game though, like current crit chance/proc chance % and damage with the different elements/abilities. Basically information on all your current stats as you power up throughout a run. Also some basic information on certain things. Like weak spots i know are generally any part of the enemy that glows red but this gets a bit more vague when dealing with melee abilities.\n\nI would normally assume that a weak spot would also include melee attacks from behind and most certainly from stealth but here i'm not so sure.\n\nGames only been out a few months so hopefully the devs pick up on feed back and ideas get reviewed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very solid roguelite fps. Gunplay and general gameplay loop is great. As a hardcore gamer I'd say the game lacks a bit of rng and difficulty for its genre but it's worth playing no matter what.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The end game feels good. Zone 3 feels like a true rogue-type game as you plan your build. Not saying the other parts are bad, but it's hard to go back once you're in the end game. The RNG can feel bad at times, but it's tolerable since most perks feel equally powered.\n\nDon't be afraid to change your build on the fly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for something different and a really good story, this game is the one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its diffrent, its quick, its fun with mates probaly one of my favs of the year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good feeling roguelite game with interesting upgrades. Though the whole ship being almost all metal corridors is a little disorientating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deadzone Rogue is a roguelike game. Adventure solo or co-op squad up to 3 players to conquer the ship. We can adjust each stage for each mission. The game is super fun i played solo and squad but in squad offers a challenging experience and difficulties in game. I have enjoyed this game and completed with my friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game, always a different play style with each run and the difficulty progression is actually present if your looking for a tougher challenge. fantastic game plan to play this a lot in my down time for its smooth gun play and ability to never have the same play style twice in a row.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looter shooter that has some fun scaling and enough difficulty to make you keep coming back. Felt like a nice PVE blend of Doom and Quake/Unreal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10, but addictive and worth buying and playing for a few days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My experience as a solo player...  Deadzone Rogue can be a really fun experience with the right build, but it really depends on the rolls you get in the higher tier difficulties.  It can almost feels rigged at times.  Like if the game wants you dead, you die and vice versa.  Some of the rooms feel like they're made specifically for coop play because playing them solo feels unbalanced at times especially when you get really far in a run only to be annihilated within a second of firing your weapon due to the amount of enemies/damage dealt in a close proximity.  The game is super fun though and offers a challenging experience on the Expert and Nightmare Difficulties.  The weapon variety is awesome and offers you a variety of options/play styles ranging from melee, grenade, sniper quick-scoping, semi-auto, burst, and fully auto sub/assault/light machine guns.  Match your weapons, health/armor, and perks in the right way, you will shred your enemies most of the time unless you encounter a crazy/unfair room as I mentioned earlier. If you like run and gun games that require some thought and strategy, then this is a must have in your collection.  Or if you want an aim trainer that requires fast movement, reaction time, target switching, light tracking, and fires back, this is a solid game for that.  For me, this game is an 8/10 as it stands.  With the right balancing, it can easily be a 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun shooter to relax with, things can get fast paced but over all it's got a relaxed arcadey feel to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A simplistic fps roguelike that is worth the price, kinda.\n\nI say kinda cause there are better fps roguelike's out there, and I can't see you put in 100+ hours unless you want to 100% the game and is struggling to achieve it.\n\nHowever, it is still a fun game and a good pick up. Nothing wrong with a game being a 30-50 hour long. Not every game should be 100+ hours. 30+ is a good number. This is a fun filler game. Something you play while waiting for friends to come online or a new patch to drop for your favourite game or something to play to distract yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant roguelike, lots of fun on your own or in a small team. Many variations in levels and enemy types to keep things interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Co-op, Quick Gameplay, Nice time for breaks in between.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for the price, kept my friends and I occupied for quite a while. I hope they add more content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd highly recomend this game if you're looking for something that you can just sit and mindlessly play for hours with freinds or even if you wanna just chill shoot robots and stack up perks to be able to do 25k damage per shot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent gun play and replay ability. Can't wait for future updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun from a Roguelike point of view. There are some aspects that make it too easy while other aspects that make it too hard. The game doesn't feel like it scales well with multiplayer. With 3 people, I can easily beat hard difficulties in Zone 3. With 1 person, it feels considerably more difficult to beat hard on some challenges. I know some will say \"you problem\" but at 50 hours with different types of gaming on this (solo, duo, and trio) and I felt like there was a major difference.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wicked fun - Some rooms are a pain on the graphics card but a wonderful game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm 60+ hours into Deadzone Rogue.  I highly recommend it.  It's an amazing game, well worth the money.  It looks great, runs great, its well put together, and varies between \"easy\" and \"instant death,\" but in a good way, often because you chose the wrong gear for the challenge.  It's highly replayable and I'm looking forward to the Chapter 4 DLC.  As someone who purchased during early access, each zone is well thought out and varied in terms of mobs and difficulty.  Truly, a stupendous game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mostly like it - sometimes balance is really bad, but often its engaging. Need to play on kb+mouse though, because in comparison it feels really bad on controller, (IMO).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This feels like someone designed a game intentionally to ruin my life specifically.\nWould recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is *FANTASTIC*! ( If the coop server didn't crash as much or you could continue where you left off )\n\nVery addictive gameplay, great coop action, shallow story but we come for the gunplay - not the soap opera.\nHighly recommend it - if they can fix the coop server crashing/disconnect problems. And don't want you to think it's crashing constantly; It's not. It's just consistent. Try to do a long mission? There's a good chance 80% of the way through, you'll crash. Playing with friends and have a kick-ass build? Guess what? The game's going to crash soon. I really feels like the more fun you're having, the higher the chance of the game disconnecting the parties.\n\nI hope they fix the server disconnect problems when playing coop, because this game has real potential. And while they're at it? A way to continue where you left off would be wonderful. And at least soften the blow from the disconnects until that's wrangled under control.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game. 10/10. \nIts like Doom meets a Hades style temple run game. Mixed with FPS, boons, buffs, and builds.. This is it.\nFun arcade style game, low commitment, easy to just go burn a few minutes or a few hours.\nHad a blast playing with friends, and an actually affordable game.\n\nThanks devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the past bit, my friends have been playing this game so I got curious. Over the past couple of days, I have been playing this game a lot. Since I have bad internet, I've been playing basically only in singleplayer. I LOVE THIS GAME! The enemy designs are cool, the weapons are cool, I love the Meta Progression in the game. While sometimes clunky, the movement is nice. I'm excited to see any updates/DLC and I hope to 100% this game at some point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with smooth gameplay and lots of replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool rogue-like option, lots of replayability, but its mostly playing the same levels on harder difficulties, which gets very overwhelming very fast. Definitely worth the price and easy to be entertained for 10+ hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Short game, worth it on sale, glad to come back when the new update comes out, glad it has optional coop, I like coop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun as hell, love the ability to play with friends and the constant challenge of having to either take the things that work with my current idea for a build, or take the tempting new item and hope I can make it work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best game I ever played, if you like First Person Shooter, of course.\nExcellent gunplay, in my opinion, and 3 difficulty levels.\nIt's a Rogue-Lite title but there also a story if you want to dig.\nI enjoy it with a controller. and it's very good.\nI recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill game with amazing gunplay/feel. On normal it can get quite easy if you build something that works in an OP way, which isn't necessarily a bad thing as you can still die if you make mistakes or rush in too fast. It took about 20 hours for me to finish the main campaign and about half of the challenge missions (on normal.) I'm still gonna keep playing to unlock stuff, and also for the fun of it as the gunplay is very satisfying and buttery smooth. I would highly recommend it if you're looking for a game to turn your brain off and enjoy a fun FPS that looks/feels great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i pirated this game a week ago, paycheck hit i had to buy the deluxe. Deadzone Rogue is the most innovative shooter I've played in years!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was looking for a shooter and this was recommended by steam. Love putting the time into trying new builds and elemental combos. Movement feels smooth and can get quite swift, aiming is crisp and spray patterns are learnable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely fun and challenging! the weapons and bosses and graphics are insane. Totally recommend this game. Worth your money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely fun and responsive gunplay that you can tailor to become extremely difficult if you so desire. The sounds and the guns and the enemy design are very doom inspired and I personally find playing endlessly satisfying. The control over the builds you can make, whilst not really changing what you'll be doing which is always shooting enemies and shooting them in their weakspots (the only exception I could think of is buffing your melee damage), is still enjoyable enough. It's fun click on the items that increase your damage. I haven't yet felt like the decisions I've been making have been difficult, as in there's never been nuance between the options I have where it feels like if I had superior knowledge on how the game works I'd be able to squeeze some extra value of the choice, it's always felt relatively straightforward what the best option is. Maybe that's enjoyable to some however, which is perfectly valid, and there is always a chance that as I continue along my journey to beating every mission on Nightmare I would appreciate the gun/perk/item system more. \r\n\r\nI wouldn't play this game for the story, I think it was very simple, but yet the main character's voice actor really allowed me to enjoy hearing his lines over and over, and I sympathised with him. Overall the story/setting allowed for an in universe reason why enemies got harder as the game progressed, allowed for organic moments where you could be tutorialised for something or another, and never really was in the way.\r\n\r\nI hope more game devs take notes of Deadzone Rogue, because I suddenly find myself wanting to play more roguelike FPSes. 10/10 experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a great game, just finished the newest zone and definitely would recommend for those who like rogue lites, or FPS with a challenge. It can be too hard sometimes but lower the difficulty and keep trying. It's coop so you can play with friends or singleplayer offline. It's a good game to get some music going and just rock. It's great",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game is fun , but literally the servers crash in gauntlet. The game can't seem to keep up with the damage and it consistently crashes, bugs out or otherwise stops working. I enjoying playing the game but I'm stop gapped not by skill , but by bad net code or poor servers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Crashes literally every time I try to launch it. Worked flawlessly during early access and for a couple weeks afterwards. No word from devs on what's going on or why. Do not buy this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "There are two words that come to mind when I think of this game: competent, and brain-dead. The game feels well put together and is decent fun at first, but quickly devolves into monotony and tedium.\n\nOn the positive side, the gunplay is good fun. Guns themselves are a bit standard but feel punchy and responsive. Run-to-run upgrades, particularly the elements, are pretty interesting. Synergies introduced later offer good reasons to be selective with your items and aim for particular loadouts. There are a handful of fun challenge levels too, particularly the one where you use the spear melee weapon for the whole run.\n\nUnfortunately, there are far more negatives. For starters, this game is extremely bland. Visual style and environments are drab, enemy designs feel stock-standard by-and-large, guns don't offer any interesting gameplay quirks, affixes are basic and just contribute to a \"numbers go up\" mentality, item portraits are too visually identical, weapon skins are just palette swaps most of which are not impressive, and the plot is boring and barely noticeable. Bosses are completely forgettable and offer no real challenge. Most of your runs are going to just blend together in your mind because there is genuinely nothing that stands out enough between them. Sure, there are difficulty settings for harder missions, but if your standard difficulty isn't engaging, multiplying some numbers isn't going to fix that.\n\nEvery single upgrade in the meta-progression tree has it's own currency which makes the menus a cluttered nightmare, but you earn everything passively so you are basically just clicking buttons until your currency runs out, completely canceling out any complexities. My buddy and I had completely upgraded everything by the time we finished the available missions, and honestly, we didn't really notice much change to game from this. And for some baffling reason, the new systems that they have added in later zones of the game have not been retroactively worked into previous ones, making zone 3 feel like a far more complete game experience, and zone 1 feel like an empty beta build. Also, the game tries to inject comedy and intrigue through logs and character quips, but the writing is terrible and the vocal performance from the main character is the epitome of mediocre. \n\nIf you are looking for a way to kill some time with a friend, then this game will give you that, but it's never going to be more than just that: killing time. Like I said, it is certainly competent, but there are so many other roguelikes, even ones that play very similar to this one, that will respect your time so much more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is a ton of fun for the most part with a wide variety of viable build paths and playstyles. Some of the nightmare content needs a balance pass, but still very enjoyable for the most part.\n\nLately however (since the latest patch as far as I can tell), the game will disconnect from the server after playing for about an hour for no discernable reason and completely refuse to reconnect until the game is restarted. If you're playing strictly solo, it's not a big deal, but it completely breaks a multiplayer run. It's not specific to my internet connection either, because the exact same thing happens when I play from other locations with my laptop, and with all of my friends scattered around the country no matter who is hosting. The game didn't have the disconnection issue at all until somewhat recently despite always having sub-par netcode. The slowly ballooning latency could be suffered enough to still enjoy the game, but the server drops completely kill the experience.\n\nIf the devs can get the multiplayer connection issues sorted out, I'll change the review back to positive. Until then however, don't waste your time if you plan on playing with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game worked for 3 hours. Then the following day decided to crash each time I launched the drop. There is a 5 min video of a number of steps to 'possibly' fix it... I did half of this and lost my patience. Uninstalling product that was, but isn't working anymore. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought this game reminded me of Global Agenda a little, and then I realised that this is made by ex Hi-Rez Devs, so... I guess it makes sense!\n\nI am a bit split on this one tbh. The gunplay feels fun enough, the upgrades you get are okay. It doesn't look too special and it feels like they just used the same models over and over with different colours. It makes sense with the setting, but given that this is essentially an asset flip from a failed game it also cheapens the experience a bit. Had I not realised this maybe my opinion might have been a little different.\n\nThe trouble though is that, for a game that you repeat a lot, this makes it feel stale because there isn't really variance between runs. The power ups you get somehow don't really change what you are doing too much. Sometimes you'll run around aiming down sights, sometimes you will use hip fire for most of the run.\n\nAlthough I mentioned the gunplay feels good enough, I should stress I didn't say \"great\" because of the sound design. I feel the sounds are part of what makes the illusion of firing a weapon on a monitor feel fantastic, and it falls short here. But things like recoil and how weapons handle feel good.\n\nI feel this is like one of those snacks that you know are not very healthy, but you like them when you eat them; at the same time you will not make them your main meal.\n\nFor now this is a thumbs down. If I end up wanting to play it more, then I guess it did its job and will change it to positive. I really need a neutral rating!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spend two hours to get to level 30 then the boss wont spawn. This happened 2 times, the 3rd time the boss   is just sitting in the corner taking no damage and not moving. The game will not save your progress so the only thing to do is start the whole run over.  What a piece of crap!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rudimentary, very sadly boring and uninspired, the voice acting is solid, the loop is moderately okay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not work correctly on linux using Fullscreen mode - mouse goes out of game window and game window loses focus which means you lose control in the game and might get killed. This issue is the reason of all my deaths in this game lol. In addition, playing this game some popups appear out of nowhere which also causes the same issues. I have no idea what is happening with this game, but this is the first game that works so bad on linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is laggy and controls freeze up, very frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most anti gamer roguelike ive played... i thought rushing to the end to get everything unlocked would be the thing to do, but the game is like well you unlocked everything but you cant use any of it unless you are on the level where it was unlocked.... the game is mind boggling why i spent hours unlocking perks, full synergy builds, and items, but they do not let me use the items in the beginning, which is why i even rushed to the end.... game is very mediocre and the rng for getting a good synergy is like 1 in 5 games... i got tired of the repetitive levels and felt like all i ever got with cryo or the pulse missles, then they would give me guns ive started the game with, even though i supposedly unlocked over 8 guns.... for all the roguelikes to come out around this time, this was by far the worst of them all!\n\nplus why call it a dlc when it was suppose to be part of the game.... what a joke of an update!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i suck at this game so it is bad,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games horribly unbalanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Контент для VK play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UPDATE!!!! PLEASE READ!!!!\n\nThe original review was my legit take but now I am leaving a negative review!  Why?  A known save glitch that deletes all progress is still happening as my twenty plus hour save…poof, gone…just unbelievable that this has been known about for months and still has not been ameliorated.  I do not know if I can change my review back to a positive after this because I cannot get my ******** twenty hours back.  Further, don’t want to start again in case the save issue occurs.  Completely ruins what has otherwise been a good experience.  \n\n\n———————————————————————\n\nOriginal Review\n\n\nFrom what I understand, this is a reskin of an extraction shooter made by the company that abandoned Tribes.  Nevertheless, I have no ties to that game nor the company so, with that out of the way, I will give my objective opinion.\n\nThis is a rogue lite.  It is not a very deep rogue lite, but it still scratches that itch.  The gunplay is solid, reminds me of MW3 (2011).  The music is decent, if not forgettable house techno music.  The perks are somewhat interesting as they help with progress but you will end up using the same beneficial ones over and over again.  The same strategy applies to every run.  I use the same guns every run.  But for me, that is okay.  I enjoy knowing what to expect.  There is a quiet comfort, almost like your favorite snack that gets boring after awhile, however, you still enjoy it even though it does not have the same impact it initially had.  That is this game.  It does not do anything exceptionally but what it does, is very good, good enough for a mindless shooter that turns my mind off for the time I play it.  Money well spent for that feature.  Also, runs very well on Steam Deck, this is surprising considering Unreal Engine struggles on the platform.  Kudos for achieving that.  \n\nNow, the caveats.  First, the level design is blah.  From bland colored environments to neon saturated hallways that feel like a big closet, I find them forgettable and almost ai generated.  Second, that voice actor is horrible.  I have gotten used to his dry, almost redneck type voice, but his delivery is awkward and he really has nothing of interest to say.  The story is “yawn”, you are out in space, stranded on a military ship and have no idea “yawn” of your origins or how you got there…”yawn”…Shoot your way through to find out why and how you got here and what happened to the passengers….zzzzzz….”snoring”…Oh Androids have taken over with some bio freaks…oh man, that is elementary writing.  Just cringe.  Also, back to the voice acting…The main character is awful but so are all the other characters whose “logs” you pick up.  I believe I would be a better voice actor.  These people are not even trying.  No inflection.  No emphasis, just blah.  Makes me think that (along with the levels) this may be AI as well.  \n\nOverall, and taking all of these things into consideration, I have still enjoyed my time with this game.  It is a solid shooter that allows me to shut off my mind for my 45 to 90 minute runs.  No story or character investment.  Just solid shooting.  So yes, I would recommend.  Do not expect much in return though.  Look at it as a couple nights of cheap entertainment - or a case of beer.  Enjoyable but forgettable (I believe that is the theme of this review: good but not memorable).  If this team refined some of the aforementioned flaws, this could be a superior roguelite.  6/10: Good!  -LoA-",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not terrible, it's just... bland. And repetitive. What is here is alright, there's just too little of all of it and it gets repetitive very very quickly. Each time you play, it goes one of two ways: you end up hugely overpowered or the enemies end up ridiculously tanky and annoying. Just not a lot of meat on these bones.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Before the 1.0 release of this game. The difficulty on nightmare was quite challenging. Like I'd die a good amount of times, but eventually I could get through even on single player.\nNow, after the 1.0 release, The difficulty on nightmare is ridiculous now. Even with a full squad of three players, getting decent weapons, and even good perks. The types of enemies the come out seem way to difficult for that point in the rounds that you barely have any gear. The amount of enemies is high, but tolerable unless they're all spread out and hitting you from all angles to where you can't get any environmental cover.\nSome enemies are also unbalanced I feel. The smaller flying bugs have way too much health. Most flying enemies are also hyper accurate even though they also have height advantage to shoot you over cover. With the deadshot eyes also hitting too hard for being so accurate and getting to fire off multiple shots even though their bipedal counterpart only gets to fire off one very accurate, very fast, very very heavy hitting shot.\nThe orange walking flame thrower spiders also are and unbalanced combination of too fast movement speed, too hard hitting, too rapidly hitting.\n\nA majority of this unbalance almost absolutely pushes you into taking a crowd control element. Ice for Freeze, Void to maybe get roots, or Psionic slam. Chose fire, you're screwed. Lighting? maybe you'll get stuns, but they're unreliable. Even the void singularity and root isn't that powerful. And don't get me started on the freaking black hole spiders. The other spiders suicide bomb after being triggered, but the void spiders AOE is so big that you commonly get yo-yoed around and try to dash, but can't escape the area of effect. Which on nightmare is basically a death sentence if you didn't kill those things far enough away from you to not get sucked in.\n\nAlso, the whole ghost thing in zone three is nifty, but ultimately the bane of existence for splash damage users. Kill too many ghosts at once? you're probably gonna be able to dodge one then get hit and killed by the rest as their charges are staggered directly to your location. Plus the huge sword beam attacks go through walls, which is hard, but manageable when shoved in some of the tight quarters of zone 3.\n\nAnother big thing I feel makes nightmare unbalanced is it feels like the enemies back in zone one have been tweaked up as if you're suppose to have the additional power of superior items and synergies. And zone 2 feels like you would need the synergies to make things more manageable.\n\nA lot of this could be tapered out and made more manageable if we had extra levels of basic upgrades to keep upgrading even if the costs start get a bit steep. I have rough 70,000 tech and nothing to spend it on. I've maxed out all the base upgrades and superior items. A core mechanic to rouge like games is having a lot of upgrades to buy to make the following runs just a little bit easier each time. After about 20 hours of gameplay, I've had all base perks maxed out and most of the superior items that I go for on multiple different build ideas maxed out. At about 30 hours even after the update. I had all the extra base upgrades maxed out and the rest of all the superior items maxed out. The only reason I keep playing is trying to beat levels on nightmare. Which I've had to rebeat several because after the update, my progress on those levels were deleted.\n\nOverall it's a good game until you reach expert solo or nightmare even with 3 people. The balance of too many factors, just makes the game unbeatable unless you're an absolute sweat player on solo with great loot and perk rolls. And with more people it is still incredibly easy to get yourself killed or do something that causes your team mate to be suddenly overwhelmed and killed.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not a bad game, but very shallow and simple game resulting in few choices worth making for a rogue like.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Pros\n- exotic weapons \n- some items have pretty nice synergy but for the most part just end up being % damage buffs at the end of the day\n- upgrades are plentiful so you can buildcraft a lot more unlike most roguelikes\n- side missions are mostly unique and pretty enjoyable to play\n\nCons\n- AI generated icons for majority of the upgrades (gross)\n- enemies are pretty generic\n- gunplay is very mediocre\n- dropped items and damage numbers are very obstructive\n- the game doesn't do much that other roguelikes don't already do or are doing better\n- early game missions are very anti buildmaking because they're shorter length, you have less options as everything is locked behind later missions, and you have either no rerolls or very few rerolls\n- bosses are basically nothing with a very boring attack pattern\n- some elements feel like bloat and only exist to pad out the upgrades (void/plasma)\n- metagame upgrades consist of extremely boring +X% upgrades that only exist to exist rather than provide meaningful changes to gameplay\n- main character is horrendously written and has some of the worst lines of dialogue I've heard in any form of media, had to turn off dialogue audio just to not close the game\n- very few good upgrades which just results in you running the same couple of perks every run. upgrades like the grenade or melee related ones are entirely useless when in comparison to just running the same elemental/gun/health upgrades every time\n- majority of buffs in the game have a very abnoxious limit to them rather than having lesser effects. main examples I can think of are any expended ammo related buffs\n\noverall the game is an okay roguelike to turn your brain off but with other actually good (and AI-less) alternatives it's not worth buying",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I would love to write a 5 star review. Unfortunately i am one of a number of users affected by repeated progress loss. Steam shows I have 34 hours of play, I have played through it multiple times, but if i load the game now all my progress is gone. I attempted to contact support via email and steam discussion and got no response",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you enjoy deep, well-crafted, repeatable roguelites then this is not the game for you. The perk system is poorly designed and does not provide much variety between runs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is a ton of fun for the most part with a wide variety of viable build paths and playstyles. Some of the nightmare content needs a balance pass, but still very enjoyable for the most part.\n\nLately however (since the latest patch as far as I can tell), the game will disconnect from the server after playing for about an hour for no discernable reason and completely refuse to reconnect until the game is restarted. If you're playing strictly solo, it's not a big deal, but it completely breaks a multiplayer run. It's not specific to my internet connection either, because the exact same thing happens when I play from other locations with my laptop, and with all of my friends scattered around the country no matter who is hosting. The game didn't have the disconnection issue at all until somewhat recently despite always having sub-par netcode. The slowly ballooning latency could be suffered enough to still enjoy the game, but the server drops completely kill the experience.\n\nIf the devs can get the multiplayer connection issues sorted out, I'll change the review back to positive. Until then however, don't waste your time if you plan on playing with friends.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very boring, repetitive, and generic. Weapons, enemies, level design, audio.... all of it is sub par. Is this an asset store reskin? Expected a whole lot more from a this franchise and price point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WARNING FOR POTENTIAL STEAM DECK PLAYERS:\n\nThere is a known bug affecting steam deck (and apparently some other) players wherein all of your progress can be randomly/arbitrarily deleted from the cloud. The devs claim this problem is \"on their radar\", but until it is confirmed fixed, I'd keep my distance.\n\nA shame too, as it's a damn fun game otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes literally every time I try to launch it. Worked flawlessly during early access and for a couple weeks afterwards. No word from devs on what's going on or why. Do not buy this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Super sick game until 1.0 dropped. New enemies are incredibly annoying by design, as if the devs couldn't figure out new mechanics and had to force variety in subpar ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The more I play this game, the less I like it.  The levels, enemies, and builds are repetitive.  Only a small handful of builds are truly viable (lightning, cryo (for some missions), melee).  Everything else is -meh- at best, and absolutely useless at worst.\n\nThe difficulty scaling is poor.  Enemies don't get smarter, they just go from tickling you to now removing 90% of your shield and health in one shot.  This isn't so bad on some missions, but eventually you reach levels where there are a dozen or two enemies that can shoot through walls, all able to insta-gib you unless you get lucky with a FEW defensive perks, and even then - it just delays the death by a few seconds, if not a fraction of a second.\n\nSome of the enemy designs are just.. so poorly thought out, and end up being more annoying than anything.\n\nI'm dropping this game for now.  It pales in comparison to others of the genre - Gunfire Reborn, Risk of Rain 2, etc.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun , but literally the servers crash in gauntlet. The game can't seem to keep up with the damage and it consistently crashes, bugs out or otherwise stops working. I enjoying playing the game but I'm stop gapped not by skill , but by bad net code or poor servers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "While much of the game can be fun it has elements that eliminate much of the enjoyment, whoever had the idea of single hit kill enemies was possibly brain dead. Adding that to this style of game greatly diminishes the concept of the flowing reward system of getting stronger during each run. In terms of elements there are many that make it a reasonably fun game however the \"wave based defense\" missions also eliminate my ability to recommend this to others coupled with the extremely limited nature of any fun one could have in this due to the sluggish addition of levels, vapid story, and duke nukem level of brick personality protagonist and it's just a better skip to find something more worth your time and money. Were it not directly suggested by someone else I wouldn't have gotten it and were it not for others wanting to play it I'd have uninstalled it by now. Even for quick enjoyment there are cheaper games that do what Deadzone Rogue does but better with more meat and a better progression system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It refunded the game after about two hours. Don't get me wrong: weapons felt great, roguelike elements like upgrading a character and gear during a run was nice. The whole short term gameloop checked all the right boxes. And the game runs really really well. But make no mistake: it just blends to very established genres together in a very competent way: first person shooters and rogue lites. But it delievers nothing new in neither  of them.\n\nThat in itself wouldn't be a problem but beyond that short gameplay loop the game had nothing interesting to offer and felt servicable at best: the levels are bleak and blend, as much as the ai is stale. On my 2nd run I found a Sniping Rifle, with which I could pick up every enemy one by one, with almost no dangger at all until I hit a difficulty peak at Level 20 in Zone 1. I am NOT that good of a player. The game is just that easy.\n\nUp until that point every room had they same greyish boring tone with very little variation. And a different neon light source, is not enough to make a difference. Deadzone feels like moving from one uninteresting box to another, and that is simply not enough to keep my interest. I know it is an unfair sentimatn, but  at some pointt I thought the game looks like a tech demo, while in gameplay it certainly isn't.\n\nThat way I didn't see myself playing the game more than 4h. I feel like I have seen everything or at least it is very predictable already and research in reviews and such, reflect that sentiment.\n\nHowever make no mistake. This is one of the cases, in which simply giving a positive or negative rating is not enough. \n\nIf the gameplay loop is enough to keep you interested, this game delivers in the best way possible. It is so well done, that it hurts to give a negative rating. And I hope we get sth. new from this dev in the future.\nBut when you want more meat, when it comes to level design and presentation, I'd pass on this one. \n\nFora a Multiplayer I'd pick sth else, because I feel this game doesn't have enough staying power to be played more than two evenings or so. That's ok with titles that only cost around 7 € like lethal company, repo or peak, which almost always have the same fate of being played for about two weeks and then nobody is interested anymore. But for 25 bucks that's too short. I am certain someone will deliver a similar game in the future, because deadzone has certainly shown, that there is plenty of room for a game like this. \n\nAs a singleplayer game Witchfire is the better choice right now. It is the same genre as a roguelite fps, but the setting is more interesting, gunplay is on point and the levels are beautifull, and have so much to tell, that the exploration is a huge and fun aspect of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really tried to play this game, but I was forced to refund it with nearly an hour of tracked running time and 0 seconds of actual playing time.\nIt's DirectX12. This game supports only DX12, and if there is only a single graphics API you support, then it'd be Vulkan. Okay, maybe DX11 if you are willing to bite the compatibility bullet. DX12 only? Yeah...that is asking for trouble, and I spent days troubleshooting including a full DDU reinstall and multiple drivers, with a fairly standard W10+RX 5700 XT setup, but no.\n(Note, this is the first game in a decade that I straight up didn't get to play at all, it's a complete outlier.)\n\nThe game might be amazing but if it's unplayable due to poor technical choices, what can I say. So be warned, if your system already had beef with DX12, maybe don't bother until the devs get around to addressing the situation.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has some amazing gunplay, but that is all it has going for it.\nThe level design is the definition of bare minimum; just a bunch of flat, empty rooms connected with narrow hallways. Easily the weakest aspect of the game.\n\nThe gameplay loop consists of replaying the same stages on incrementing difficulties, but the difficulty balancing rapidly goes from satisfying to tedious. You don't have to play for long to reach the point where your character instantly combusts from an enemy breathing on you too hard. Mix this with the level design and half the perks being so laughably bad you'll never want to use them, and the game gets very stale very quick.\n\nThere are some really questionable enemy design choices in Act 3. Spamming half a dozen copies of an enemy in a 5x6 room that can make multiple invincible clones, fill the room with projectiles, and shoot through walls is a bit ridiculous.\n\nThere's not enough meta progression, and it honestly feels like such an after thought. There's ten's of hours of content but you'll have all your passive perks maxed out within the first 10 hours, and the buffs you get from them are so negligible on higher difficulties. \n\nThe missions where you're forced to use a single weapon get repetitive very quickly. Finishing these missions reward you by permanently unlocking the weapon, but 2/3 of the missions restrict you to using one weapon, so it's a pretty lacklustre reward.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am very conflicted about this game. Years ago I purchased a game called Starsiege Deadzone, because it looked like a really funny battle royal/ extraction shooter set in space. I had so much fun playing it and occasionally missed it after the playtests, but never checked in on it. Going through my steam library recently I noticed this game, which I had no recollection of. As soon as I booted it up I realized this is what the devs turned starsiege deadzone into, and its honestly pretty disappointing. This game, in a vacuum, is fun, but when I am playing it all I can think about is how much more fun I had playing Starsiege. This game should have been a spin off of starsiege for those who don't want a pvp game but still enjoy the other aspects, it should not have completely replaced it. \n\nSo basically if you want to play a FPS space roguelike, I highly recommend this game, but as someone who paid for a pvp extraction shooter and instead got a roguelike, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are two words that come to mind when I think of this game: competent, and brain-dead. The game feels well put together and is decent fun at first, but quickly devolves into monotony and tedium.\n\nOn the positive side, the gunplay is good fun. Guns themselves are a bit standard but feel punchy and responsive. Run-to-run upgrades, particularly the elements, are pretty interesting. Synergies introduced later offer good reasons to be selective with your items and aim for particular loadouts. There are a handful of fun challenge levels too, particularly the one where you use the spear melee weapon for the whole run.\n\nUnfortunately, there are far more negatives. For starters, this game is extremely bland. Visual style and environments are drab, enemy designs feel stock-standard by-and-large, guns don't offer any interesting gameplay quirks, affixes are basic and just contribute to a \"numbers go up\" mentality, item portraits are too visually identical, weapon skins are just palette swaps most of which are not impressive, and the plot is boring and barely noticeable. Bosses are completely forgettable and offer no real challenge. Most of your runs are going to just blend together in your mind because there is genuinely nothing that stands out enough between them. Sure, there are difficulty settings for harder missions, but if your standard difficulty isn't engaging, multiplying some numbers isn't going to fix that.\n\nEvery single upgrade in the meta-progression tree has it's own currency which makes the menus a cluttered nightmare, but you earn everything passively so you are basically just clicking buttons until your currency runs out, completely canceling out any complexities. My buddy and I had completely upgraded everything by the time we finished the available missions, and honestly, we didn't really notice much change to game from this. And for some baffling reason, the new systems that they have added in later zones of the game have not been retroactively worked into previous ones, making zone 3 feel like a far more complete game experience, and zone 1 feel like an empty beta build. Also, the game tries to inject comedy and intrigue through logs and character quips, but the writing is terrible and the vocal performance from the main character is the epitome of mediocre. \n\nIf you are looking for a way to kill some time with a friend, then this game will give you that, but it's never going to be more than just that: killing time. Like I said, it is certainly competent, but there are so many other roguelikes, even ones that play very similar to this one, that will respect your time so much more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've only played for 9 hours, but I can't recommend this game. It's very visually appealing and the sounds are \"crunchy\" and \"reward-center-stimulating\" but the loop is very repetitive, almost no real difference between the zones or enemies and the multiplayer doesn't scale. The weapon mods are cool and somewhat intuitive, and zone 3 is pretty fun. I probably would have enjoyed it more if it was cheaper or if more content was released for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is unplayable in its current state. Online play hasn't worked in over a month and the game crashes so often it's impossible to finish a single mission. I haven't reached sector 10 in over a month due to incessant crashing. If you crash, you can't continue where you left off unless it's online and you're in someone else's game. The developers are talking about adding another zone instead of making the game playable as it is. You've been warned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game worked for 3 hours. Then the following day decided to crash each time I launched the drop. There is a 5 min video of a number of steps to 'possibly' fix it... I did half of this and lost my patience. Uninstalling product that was, but isn't working anymore. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought this game reminded me of Global Agenda a little, and then I realised that this is made by ex Hi-Rez Devs, so... I guess it makes sense!\n\nI am a bit split on this one tbh. The gunplay feels fun enough, the upgrades you get are okay. It doesn't look too special and it feels like they just used the same models over and over with different colours. It makes sense with the setting, but given that this is essentially an asset flip from a failed game it also cheapens the experience a bit. Had I not realised this maybe my opinion might have been a little different.\n\nThe trouble though is that, for a game that you repeat a lot, this makes it feel stale because there isn't really variance between runs. The power ups you get somehow don't really change what you are doing too much. Sometimes you'll run around aiming down sights, sometimes you will use hip fire for most of the run.\n\nAlthough I mentioned the gunplay feels good enough, I should stress I didn't say \"great\" because of the sound design. I feel the sounds are part of what makes the illusion of firing a weapon on a monitor feel fantastic, and it falls short here. But things like recoil and how weapons handle feel good.\n\nI feel this is like one of those snacks that you know are not very healthy, but you like them when you eat them; at the same time you will not make them your main meal.\n\nFor now this is a thumbs down. If I end up wanting to play it more, then I guess it did its job and will change it to positive. I really need a neutral rating!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spend two hours to get to level 30 then the boss wont spawn. This happened 2 times, the 3rd time the boss   is just sitting in the corner taking no damage and not moving. The game will not save your progress so the only thing to do is start the whole run over.  What a piece of crap!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rudimentary, very sadly boring and uninspired, the voice acting is solid, the loop is moderately okay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not work correctly on linux using Fullscreen mode - mouse goes out of game window and game window loses focus which means you lose control in the game and might get killed. This issue is the reason of all my deaths in this game lol. In addition, playing this game some popups appear out of nowhere which also causes the same issues. I have no idea what is happening with this game, but this is the first game that works so bad on linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is laggy and controls freeze up, very frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most anti gamer roguelike ive played... i thought rushing to the end to get everything unlocked would be the thing to do, but the game is like well you unlocked everything but you cant use any of it unless you are on the level where it was unlocked.... the game is mind boggling why i spent hours unlocking perks, full synergy builds, and items, but they do not let me use the items in the beginning, which is why i even rushed to the end.... game is very mediocre and the rng for getting a good synergy is like 1 in 5 games... i got tired of the repetitive levels and felt like all i ever got with cryo or the pulse missles, then they would give me guns ive started the game with, even though i supposedly unlocked over 8 guns.... for all the roguelikes to come out around this time, this was by far the worst of them all!\n\nplus why call it a dlc when it was suppose to be part of the game.... what a joke of an update!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i suck at this game so it is bad,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games horribly unbalanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Контент для VK play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UPDATE!!!! PLEASE READ!!!!\n\nThe original review was my legit take but now I am leaving a negative review!  Why?  A known save glitch that deletes all progress is still happening as my twenty plus hour save…poof, gone…just unbelievable that this has been known about for months and still has not been ameliorated.  I do not know if I can change my review back to a positive after this because I cannot get my ******** twenty hours back.  Further, don’t want to start again in case the save issue occurs.  Completely ruins what has otherwise been a good experience.  \n\n\n———————————————————————\n\nOriginal Review\n\n\nFrom what I understand, this is a reskin of an extraction shooter made by the company that abandoned Tribes.  Nevertheless, I have no ties to that game nor the company so, with that out of the way, I will give my objective opinion.\n\nThis is a rogue lite.  It is not a very deep rogue lite, but it still scratches that itch.  The gunplay is solid, reminds me of MW3 (2011).  The music is decent, if not forgettable house techno music.  The perks are somewhat interesting as they help with progress but you will end up using the same beneficial ones over and over again.  The same strategy applies to every run.  I use the same guns every run.  But for me, that is okay.  I enjoy knowing what to expect.  There is a quiet comfort, almost like your favorite snack that gets boring after awhile, however, you still enjoy it even though it does not have the same impact it initially had.  That is this game.  It does not do anything exceptionally but what it does, is very good, good enough for a mindless shooter that turns my mind off for the time I play it.  Money well spent for that feature.  Also, runs very well on Steam Deck, this is surprising considering Unreal Engine struggles on the platform.  Kudos for achieving that.  \n\nNow, the caveats.  First, the level design is blah.  From bland colored environments to neon saturated hallways that feel like a big closet, I find them forgettable and almost ai generated.  Second, that voice actor is horrible.  I have gotten used to his dry, almost redneck type voice, but his delivery is awkward and he really has nothing of interest to say.  The story is “yawn”, you are out in space, stranded on a military ship and have no idea “yawn” of your origins or how you got there…”yawn”…Shoot your way through to find out why and how you got here and what happened to the passengers….zzzzzz….”snoring”…Oh Androids have taken over with some bio freaks…oh man, that is elementary writing.  Just cringe.  Also, back to the voice acting…The main character is awful but so are all the other characters whose “logs” you pick up.  I believe I would be a better voice actor.  These people are not even trying.  No inflection.  No emphasis, just blah.  Makes me think that (along with the levels) this may be AI as well.  \n\nOverall, and taking all of these things into consideration, I have still enjoyed my time with this game.  It is a solid shooter that allows me to shut off my mind for my 45 to 90 minute runs.  No story or character investment.  Just solid shooting.  So yes, I would recommend.  Do not expect much in return though.  Look at it as a couple nights of cheap entertainment - or a case of beer.  Enjoyable but forgettable (I believe that is the theme of this review: good but not memorable).  If this team refined some of the aforementioned flaws, this could be a superior roguelite.  6/10: Good!  -LoA-",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not terrible, it's just... bland. And repetitive. What is here is alright, there's just too little of all of it and it gets repetitive very very quickly. Each time you play, it goes one of two ways: you end up hugely overpowered or the enemies end up ridiculously tanky and annoying. Just not a lot of meat on these bones.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Before the 1.0 release of this game. The difficulty on nightmare was quite challenging. Like I'd die a good amount of times, but eventually I could get through even on single player.\nNow, after the 1.0 release, The difficulty on nightmare is ridiculous now. Even with a full squad of three players, getting decent weapons, and even good perks. The types of enemies the come out seem way to difficult for that point in the rounds that you barely have any gear. The amount of enemies is high, but tolerable unless they're all spread out and hitting you from all angles to where you can't get any environmental cover.\nSome enemies are also unbalanced I feel. The smaller flying bugs have way too much health. Most flying enemies are also hyper accurate even though they also have height advantage to shoot you over cover. With the deadshot eyes also hitting too hard for being so accurate and getting to fire off multiple shots even though their bipedal counterpart only gets to fire off one very accurate, very fast, very very heavy hitting shot.\nThe orange walking flame thrower spiders also are and unbalanced combination of too fast movement speed, too hard hitting, too rapidly hitting.\n\nA majority of this unbalance almost absolutely pushes you into taking a crowd control element. Ice for Freeze, Void to maybe get roots, or Psionic slam. Chose fire, you're screwed. Lighting? maybe you'll get stuns, but they're unreliable. Even the void singularity and root isn't that powerful. And don't get me started on the freaking black hole spiders. The other spiders suicide bomb after being triggered, but the void spiders AOE is so big that you commonly get yo-yoed around and try to dash, but can't escape the area of effect. Which on nightmare is basically a death sentence if you didn't kill those things far enough away from you to not get sucked in.\n\nAlso, the whole ghost thing in zone three is nifty, but ultimately the bane of existence for splash damage users. Kill too many ghosts at once? you're probably gonna be able to dodge one then get hit and killed by the rest as their charges are staggered directly to your location. Plus the huge sword beam attacks go through walls, which is hard, but manageable when shoved in some of the tight quarters of zone 3.\n\nAnother big thing I feel makes nightmare unbalanced is it feels like the enemies back in zone one have been tweaked up as if you're suppose to have the additional power of superior items and synergies. And zone 2 feels like you would need the synergies to make things more manageable.\n\nA lot of this could be tapered out and made more manageable if we had extra levels of basic upgrades to keep upgrading even if the costs start get a bit steep. I have rough 70,000 tech and nothing to spend it on. I've maxed out all the base upgrades and superior items. A core mechanic to rouge like games is having a lot of upgrades to buy to make the following runs just a little bit easier each time. After about 20 hours of gameplay, I've had all base perks maxed out and most of the superior items that I go for on multiple different build ideas maxed out. At about 30 hours even after the update. I had all the extra base upgrades maxed out and the rest of all the superior items maxed out. The only reason I keep playing is trying to beat levels on nightmare. Which I've had to rebeat several because after the update, my progress on those levels were deleted.\n\nOverall it's a good game until you reach expert solo or nightmare even with 3 people. The balance of too many factors, just makes the game unbeatable unless you're an absolute sweat player on solo with great loot and perk rolls. And with more people it is still incredibly easy to get yourself killed or do something that causes your team mate to be suddenly overwhelmed and killed.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not a bad game, but very shallow and simple game resulting in few choices worth making for a rogue like.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Pros\n- exotic weapons \n- some items have pretty nice synergy but for the most part just end up being % damage buffs at the end of the day\n- upgrades are plentiful so you can buildcraft a lot more unlike most roguelikes\n- side missions are mostly unique and pretty enjoyable to play\n\nCons\n- AI generated icons for majority of the upgrades (gross)\n- enemies are pretty generic\n- gunplay is very mediocre\n- dropped items and damage numbers are very obstructive\n- the game doesn't do much that other roguelikes don't already do or are doing better\n- early game missions are very anti buildmaking because they're shorter length, you have less options as everything is locked behind later missions, and you have either no rerolls or very few rerolls\n- bosses are basically nothing with a very boring attack pattern\n- some elements feel like bloat and only exist to pad out the upgrades (void/plasma)\n- metagame upgrades consist of extremely boring +X% upgrades that only exist to exist rather than provide meaningful changes to gameplay\n- main character is horrendously written and has some of the worst lines of dialogue I've heard in any form of media, had to turn off dialogue audio just to not close the game\n- very few good upgrades which just results in you running the same couple of perks every run. upgrades like the grenade or melee related ones are entirely useless when in comparison to just running the same elemental/gun/health upgrades every time\n- majority of buffs in the game have a very abnoxious limit to them rather than having lesser effects. main examples I can think of are any expended ammo related buffs\n\noverall the game is an okay roguelike to turn your brain off but with other actually good (and AI-less) alternatives it's not worth buying",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I would love to write a 5 star review. Unfortunately i am one of a number of users affected by repeated progress loss. Steam shows I have 34 hours of play, I have played through it multiple times, but if i load the game now all my progress is gone. I attempted to contact support via email and steam discussion and got no response",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you enjoy deep, well-crafted, repeatable roguelites then this is not the game for you. The perk system is poorly designed and does not provide much variety between runs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is a ton of fun for the most part with a wide variety of viable build paths and playstyles. Some of the nightmare content needs a balance pass, but still very enjoyable for the most part.\n\nLately however (since the latest patch as far as I can tell), the game will disconnect from the server after playing for about an hour for no discernable reason and completely refuse to reconnect until the game is restarted. If you're playing strictly solo, it's not a big deal, but it completely breaks a multiplayer run. It's not specific to my internet connection either, because the exact same thing happens when I play from other locations with my laptop, and with all of my friends scattered around the country no matter who is hosting. The game didn't have the disconnection issue at all until somewhat recently despite always having sub-par netcode. The slowly ballooning latency could be suffered enough to still enjoy the game, but the server drops completely kill the experience.\n\nIf the devs can get the multiplayer connection issues sorted out, I'll change the review back to positive. Until then however, don't waste your time if you plan on playing with friends.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very boring, repetitive, and generic. Weapons, enemies, level design, audio.... all of it is sub par. Is this an asset store reskin? Expected a whole lot more from a this franchise and price point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WARNING FOR POTENTIAL STEAM DECK PLAYERS:\n\nThere is a known bug affecting steam deck (and apparently some other) players wherein all of your progress can be randomly/arbitrarily deleted from the cloud. The devs claim this problem is \"on their radar\", but until it is confirmed fixed, I'd keep my distance.\n\nA shame too, as it's a damn fun game otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes literally every time I try to launch it. Worked flawlessly during early access and for a couple weeks afterwards. No word from devs on what's going on or why. Do not buy this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Super sick game until 1.0 dropped. New enemies are incredibly annoying by design, as if the devs couldn't figure out new mechanics and had to force variety in subpar ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The more I play this game, the less I like it.  The levels, enemies, and builds are repetitive.  Only a small handful of builds are truly viable (lightning, cryo (for some missions), melee).  Everything else is -meh- at best, and absolutely useless at worst.\n\nThe difficulty scaling is poor.  Enemies don't get smarter, they just go from tickling you to now removing 90% of your shield and health in one shot.  This isn't so bad on some missions, but eventually you reach levels where there are a dozen or two enemies that can shoot through walls, all able to insta-gib you unless you get lucky with a FEW defensive perks, and even then - it just delays the death by a few seconds, if not a fraction of a second.\n\nSome of the enemy designs are just.. so poorly thought out, and end up being more annoying than anything.\n\nI'm dropping this game for now.  It pales in comparison to others of the genre - Gunfire Reborn, Risk of Rain 2, etc.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun , but literally the servers crash in gauntlet. The game can't seem to keep up with the damage and it consistently crashes, bugs out or otherwise stops working. I enjoying playing the game but I'm stop gapped not by skill , but by bad net code or poor servers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "While much of the game can be fun it has elements that eliminate much of the enjoyment, whoever had the idea of single hit kill enemies was possibly brain dead. Adding that to this style of game greatly diminishes the concept of the flowing reward system of getting stronger during each run. In terms of elements there are many that make it a reasonably fun game however the \"wave based defense\" missions also eliminate my ability to recommend this to others coupled with the extremely limited nature of any fun one could have in this due to the sluggish addition of levels, vapid story, and duke nukem level of brick personality protagonist and it's just a better skip to find something more worth your time and money. Were it not directly suggested by someone else I wouldn't have gotten it and were it not for others wanting to play it I'd have uninstalled it by now. Even for quick enjoyment there are cheaper games that do what Deadzone Rogue does but better with more meat and a better progression system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It refunded the game after about two hours. Don't get me wrong: weapons felt great, roguelike elements like upgrading a character and gear during a run was nice. The whole short term gameloop checked all the right boxes. And the game runs really really well. But make no mistake: it just blends to very established genres together in a very competent way: first person shooters and rogue lites. But it delievers nothing new in neither  of them.\n\nThat in itself wouldn't be a problem but beyond that short gameplay loop the game had nothing interesting to offer and felt servicable at best: the levels are bleak and blend, as much as the ai is stale. On my 2nd run I found a Sniping Rifle, with which I could pick up every enemy one by one, with almost no dangger at all until I hit a difficulty peak at Level 20 in Zone 1. I am NOT that good of a player. The game is just that easy.\n\nUp until that point every room had they same greyish boring tone with very little variation. And a different neon light source, is not enough to make a difference. Deadzone feels like moving from one uninteresting box to another, and that is simply not enough to keep my interest. I know it is an unfair sentimatn, but  at some pointt I thought the game looks like a tech demo, while in gameplay it certainly isn't.\n\nThat way I didn't see myself playing the game more than 4h. I feel like I have seen everything or at least it is very predictable already and research in reviews and such, reflect that sentiment.\n\nHowever make no mistake. This is one of the cases, in which simply giving a positive or negative rating is not enough. \n\nIf the gameplay loop is enough to keep you interested, this game delivers in the best way possible. It is so well done, that it hurts to give a negative rating. And I hope we get sth. new from this dev in the future.\nBut when you want more meat, when it comes to level design and presentation, I'd pass on this one. \n\nFora a Multiplayer I'd pick sth else, because I feel this game doesn't have enough staying power to be played more than two evenings or so. That's ok with titles that only cost around 7 € like lethal company, repo or peak, which almost always have the same fate of being played for about two weeks and then nobody is interested anymore. But for 25 bucks that's too short. I am certain someone will deliver a similar game in the future, because deadzone has certainly shown, that there is plenty of room for a game like this. \n\nAs a singleplayer game Witchfire is the better choice right now. It is the same genre as a roguelite fps, but the setting is more interesting, gunplay is on point and the levels are beautifull, and have so much to tell, that the exploration is a huge and fun aspect of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really tried to play this game, but I was forced to refund it with nearly an hour of tracked running time and 0 seconds of actual playing time.\nIt's DirectX12. This game supports only DX12, and if there is only a single graphics API you support, then it'd be Vulkan. Okay, maybe DX11 if you are willing to bite the compatibility bullet. DX12 only? Yeah...that is asking for trouble, and I spent days troubleshooting including a full DDU reinstall and multiple drivers, with a fairly standard W10+RX 5700 XT setup, but no.\n(Note, this is the first game in a decade that I straight up didn't get to play at all, it's a complete outlier.)\n\nThe game might be amazing but if it's unplayable due to poor technical choices, what can I say. So be warned, if your system already had beef with DX12, maybe don't bother until the devs get around to addressing the situation.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has some amazing gunplay, but that is all it has going for it.\nThe level design is the definition of bare minimum; just a bunch of flat, empty rooms connected with narrow hallways. Easily the weakest aspect of the game.\n\nThe gameplay loop consists of replaying the same stages on incrementing difficulties, but the difficulty balancing rapidly goes from satisfying to tedious. You don't have to play for long to reach the point where your character instantly combusts from an enemy breathing on you too hard. Mix this with the level design and half the perks being so laughably bad you'll never want to use them, and the game gets very stale very quick.\n\nThere are some really questionable enemy design choices in Act 3. Spamming half a dozen copies of an enemy in a 5x6 room that can make multiple invincible clones, fill the room with projectiles, and shoot through walls is a bit ridiculous.\n\nThere's not enough meta progression, and it honestly feels like such an after thought. There's ten's of hours of content but you'll have all your passive perks maxed out within the first 10 hours, and the buffs you get from them are so negligible on higher difficulties. \n\nThe missions where you're forced to use a single weapon get repetitive very quickly. Finishing these missions reward you by permanently unlocking the weapon, but 2/3 of the missions restrict you to using one weapon, so it's a pretty lacklustre reward.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am very conflicted about this game. Years ago I purchased a game called Starsiege Deadzone, because it looked like a really funny battle royal/ extraction shooter set in space. I had so much fun playing it and occasionally missed it after the playtests, but never checked in on it. Going through my steam library recently I noticed this game, which I had no recollection of. As soon as I booted it up I realized this is what the devs turned starsiege deadzone into, and its honestly pretty disappointing. This game, in a vacuum, is fun, but when I am playing it all I can think about is how much more fun I had playing Starsiege. This game should have been a spin off of starsiege for those who don't want a pvp game but still enjoy the other aspects, it should not have completely replaced it. \n\nSo basically if you want to play a FPS space roguelike, I highly recommend this game, but as someone who paid for a pvp extraction shooter and instead got a roguelike, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are two words that come to mind when I think of this game: competent, and brain-dead. The game feels well put together and is decent fun at first, but quickly devolves into monotony and tedium.\n\nOn the positive side, the gunplay is good fun. Guns themselves are a bit standard but feel punchy and responsive. Run-to-run upgrades, particularly the elements, are pretty interesting. Synergies introduced later offer good reasons to be selective with your items and aim for particular loadouts. There are a handful of fun challenge levels too, particularly the one where you use the spear melee weapon for the whole run.\n\nUnfortunately, there are far more negatives. For starters, this game is extremely bland. Visual style and environments are drab, enemy designs feel stock-standard by-and-large, guns don't offer any interesting gameplay quirks, affixes are basic and just contribute to a \"numbers go up\" mentality, item portraits are too visually identical, weapon skins are just palette swaps most of which are not impressive, and the plot is boring and barely noticeable. Bosses are completely forgettable and offer no real challenge. Most of your runs are going to just blend together in your mind because there is genuinely nothing that stands out enough between them. Sure, there are difficulty settings for harder missions, but if your standard difficulty isn't engaging, multiplying some numbers isn't going to fix that.\n\nEvery single upgrade in the meta-progression tree has it's own currency which makes the menus a cluttered nightmare, but you earn everything passively so you are basically just clicking buttons until your currency runs out, completely canceling out any complexities. My buddy and I had completely upgraded everything by the time we finished the available missions, and honestly, we didn't really notice much change to game from this. And for some baffling reason, the new systems that they have added in later zones of the game have not been retroactively worked into previous ones, making zone 3 feel like a far more complete game experience, and zone 1 feel like an empty beta build. Also, the game tries to inject comedy and intrigue through logs and character quips, but the writing is terrible and the vocal performance from the main character is the epitome of mediocre. \n\nIf you are looking for a way to kill some time with a friend, then this game will give you that, but it's never going to be more than just that: killing time. Like I said, it is certainly competent, but there are so many other roguelikes, even ones that play very similar to this one, that will respect your time so much more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've only played for 9 hours, but I can't recommend this game. It's very visually appealing and the sounds are \"crunchy\" and \"reward-center-stimulating\" but the loop is very repetitive, almost no real difference between the zones or enemies and the multiplayer doesn't scale. The weapon mods are cool and somewhat intuitive, and zone 3 is pretty fun. I probably would have enjoyed it more if it was cheaper or if more content was released for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is unplayable in its current state. Online play hasn't worked in over a month and the game crashes so often it's impossible to finish a single mission. I haven't reached sector 10 in over a month due to incessant crashing. If you crash, you can't continue where you left off unless it's online and you're in someone else's game. The developers are talking about adding another zone instead of making the game playable as it is. You've been warned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game worked for 3 hours. Then the following day decided to crash each time I launched the drop. There is a 5 min video of a number of steps to 'possibly' fix it... I did half of this and lost my patience. Uninstalling product that was, but isn't working anymore. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought this game reminded me of Global Agenda a little, and then I realised that this is made by ex Hi-Rez Devs, so... I guess it makes sense!\n\nI am a bit split on this one tbh. The gunplay feels fun enough, the upgrades you get are okay. It doesn't look too special and it feels like they just used the same models over and over with different colours. It makes sense with the setting, but given that this is essentially an asset flip from a failed game it also cheapens the experience a bit. Had I not realised this maybe my opinion might have been a little different.\n\nThe trouble though is that, for a game that you repeat a lot, this makes it feel stale because there isn't really variance between runs. The power ups you get somehow don't really change what you are doing too much. Sometimes you'll run around aiming down sights, sometimes you will use hip fire for most of the run.\n\nAlthough I mentioned the gunplay feels good enough, I should stress I didn't say \"great\" because of the sound design. I feel the sounds are part of what makes the illusion of firing a weapon on a monitor feel fantastic, and it falls short here. But things like recoil and how weapons handle feel good.\n\nI feel this is like one of those snacks that you know are not very healthy, but you like them when you eat them; at the same time you will not make them your main meal.\n\nFor now this is a thumbs down. If I end up wanting to play it more, then I guess it did its job and will change it to positive. I really need a neutral rating!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spend two hours to get to level 30 then the boss wont spawn. This happened 2 times, the 3rd time the boss   is just sitting in the corner taking no damage and not moving. The game will not save your progress so the only thing to do is start the whole run over.  What a piece of crap!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rudimentary, very sadly boring and uninspired, the voice acting is solid, the loop is moderately okay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not work correctly on linux using Fullscreen mode - mouse goes out of game window and game window loses focus which means you lose control in the game and might get killed. This issue is the reason of all my deaths in this game lol. In addition, playing this game some popups appear out of nowhere which also causes the same issues. I have no idea what is happening with this game, but this is the first game that works so bad on linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is laggy and controls freeze up, very frustrating",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most anti gamer roguelike ive played... i thought rushing to the end to get everything unlocked would be the thing to do, but the game is like well you unlocked everything but you cant use any of it unless you are on the level where it was unlocked.... the game is mind boggling why i spent hours unlocking perks, full synergy builds, and items, but they do not let me use the items in the beginning, which is why i even rushed to the end.... game is very mediocre and the rng for getting a good synergy is like 1 in 5 games... i got tired of the repetitive levels and felt like all i ever got with cryo or the pulse missles, then they would give me guns ive started the game with, even though i supposedly unlocked over 8 guns.... for all the roguelikes to come out around this time, this was by far the worst of them all!\n\nplus why call it a dlc when it was suppose to be part of the game.... what a joke of an update!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i suck at this game so it is bad,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games horribly unbalanced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Контент для VK play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UPDATE!!!! PLEASE READ!!!!\n\nThe original review was my legit take but now I am leaving a negative review!  Why?  A known save glitch that deletes all progress is still happening as my twenty plus hour save…poof, gone…just unbelievable that this has been known about for months and still has not been ameliorated.  I do not know if I can change my review back to a positive after this because I cannot get my ******** twenty hours back.  Further, don’t want to start again in case the save issue occurs.  Completely ruins what has otherwise been a good experience.  \n\n\n———————————————————————\n\nOriginal Review\n\n\nFrom what I understand, this is a reskin of an extraction shooter made by the company that abandoned Tribes.  Nevertheless, I have no ties to that game nor the company so, with that out of the way, I will give my objective opinion.\n\nThis is a rogue lite.  It is not a very deep rogue lite, but it still scratches that itch.  The gunplay is solid, reminds me of MW3 (2011).  The music is decent, if not forgettable house techno music.  The perks are somewhat interesting as they help with progress but you will end up using the same beneficial ones over and over again.  The same strategy applies to every run.  I use the same guns every run.  But for me, that is okay.  I enjoy knowing what to expect.  There is a quiet comfort, almost like your favorite snack that gets boring after awhile, however, you still enjoy it even though it does not have the same impact it initially had.  That is this game.  It does not do anything exceptionally but what it does, is very good, good enough for a mindless shooter that turns my mind off for the time I play it.  Money well spent for that feature.  Also, runs very well on Steam Deck, this is surprising considering Unreal Engine struggles on the platform.  Kudos for achieving that.  \n\nNow, the caveats.  First, the level design is blah.  From bland colored environments to neon saturated hallways that feel like a big closet, I find them forgettable and almost ai generated.  Second, that voice actor is horrible.  I have gotten used to his dry, almost redneck type voice, but his delivery is awkward and he really has nothing of interest to say.  The story is “yawn”, you are out in space, stranded on a military ship and have no idea “yawn” of your origins or how you got there…”yawn”…Shoot your way through to find out why and how you got here and what happened to the passengers….zzzzzz….”snoring”…Oh Androids have taken over with some bio freaks…oh man, that is elementary writing.  Just cringe.  Also, back to the voice acting…The main character is awful but so are all the other characters whose “logs” you pick up.  I believe I would be a better voice actor.  These people are not even trying.  No inflection.  No emphasis, just blah.  Makes me think that (along with the levels) this may be AI as well.  \n\nOverall, and taking all of these things into consideration, I have still enjoyed my time with this game.  It is a solid shooter that allows me to shut off my mind for my 45 to 90 minute runs.  No story or character investment.  Just solid shooting.  So yes, I would recommend.  Do not expect much in return though.  Look at it as a couple nights of cheap entertainment - or a case of beer.  Enjoyable but forgettable (I believe that is the theme of this review: good but not memorable).  If this team refined some of the aforementioned flaws, this could be a superior roguelite.  6/10: Good!  -LoA-",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not terrible, it's just... bland. And repetitive. What is here is alright, there's just too little of all of it and it gets repetitive very very quickly. Each time you play, it goes one of two ways: you end up hugely overpowered or the enemies end up ridiculously tanky and annoying. Just not a lot of meat on these bones.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Before the 1.0 release of this game. The difficulty on nightmare was quite challenging. Like I'd die a good amount of times, but eventually I could get through even on single player.\nNow, after the 1.0 release, The difficulty on nightmare is ridiculous now. Even with a full squad of three players, getting decent weapons, and even good perks. The types of enemies the come out seem way to difficult for that point in the rounds that you barely have any gear. The amount of enemies is high, but tolerable unless they're all spread out and hitting you from all angles to where you can't get any environmental cover.\nSome enemies are also unbalanced I feel. The smaller flying bugs have way too much health. Most flying enemies are also hyper accurate even though they also have height advantage to shoot you over cover. With the deadshot eyes also hitting too hard for being so accurate and getting to fire off multiple shots even though their bipedal counterpart only gets to fire off one very accurate, very fast, very very heavy hitting shot.\nThe orange walking flame thrower spiders also are and unbalanced combination of too fast movement speed, too hard hitting, too rapidly hitting.\n\nA majority of this unbalance almost absolutely pushes you into taking a crowd control element. Ice for Freeze, Void to maybe get roots, or Psionic slam. Chose fire, you're screwed. Lighting? maybe you'll get stuns, but they're unreliable. Even the void singularity and root isn't that powerful. And don't get me started on the freaking black hole spiders. The other spiders suicide bomb after being triggered, but the void spiders AOE is so big that you commonly get yo-yoed around and try to dash, but can't escape the area of effect. Which on nightmare is basically a death sentence if you didn't kill those things far enough away from you to not get sucked in.\n\nAlso, the whole ghost thing in zone three is nifty, but ultimately the bane of existence for splash damage users. Kill too many ghosts at once? you're probably gonna be able to dodge one then get hit and killed by the rest as their charges are staggered directly to your location. Plus the huge sword beam attacks go through walls, which is hard, but manageable when shoved in some of the tight quarters of zone 3.\n\nAnother big thing I feel makes nightmare unbalanced is it feels like the enemies back in zone one have been tweaked up as if you're suppose to have the additional power of superior items and synergies. And zone 2 feels like you would need the synergies to make things more manageable.\n\nA lot of this could be tapered out and made more manageable if we had extra levels of basic upgrades to keep upgrading even if the costs start get a bit steep. I have rough 70,000 tech and nothing to spend it on. I've maxed out all the base upgrades and superior items. A core mechanic to rouge like games is having a lot of upgrades to buy to make the following runs just a little bit easier each time. After about 20 hours of gameplay, I've had all base perks maxed out and most of the superior items that I go for on multiple different build ideas maxed out. At about 30 hours even after the update. I had all the extra base upgrades maxed out and the rest of all the superior items maxed out. The only reason I keep playing is trying to beat levels on nightmare. Which I've had to rebeat several because after the update, my progress on those levels were deleted.\n\nOverall it's a good game until you reach expert solo or nightmare even with 3 people. The balance of too many factors, just makes the game unbeatable unless you're an absolute sweat player on solo with great loot and perk rolls. And with more people it is still incredibly easy to get yourself killed or do something that causes your team mate to be suddenly overwhelmed and killed.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not a bad game, but very shallow and simple game resulting in few choices worth making for a rogue like.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Pros\n- exotic weapons \n- some items have pretty nice synergy but for the most part just end up being % damage buffs at the end of the day\n- upgrades are plentiful so you can buildcraft a lot more unlike most roguelikes\n- side missions are mostly unique and pretty enjoyable to play\n\nCons\n- AI generated icons for majority of the upgrades (gross)\n- enemies are pretty generic\n- gunplay is very mediocre\n- dropped items and damage numbers are very obstructive\n- the game doesn't do much that other roguelikes don't already do or are doing better\n- early game missions are very anti buildmaking because they're shorter length, you have less options as everything is locked behind later missions, and you have either no rerolls or very few rerolls\n- bosses are basically nothing with a very boring attack pattern\n- some elements feel like bloat and only exist to pad out the upgrades (void/plasma)\n- metagame upgrades consist of extremely boring +X% upgrades that only exist to exist rather than provide meaningful changes to gameplay\n- main character is horrendously written and has some of the worst lines of dialogue I've heard in any form of media, had to turn off dialogue audio just to not close the game\n- very few good upgrades which just results in you running the same couple of perks every run. upgrades like the grenade or melee related ones are entirely useless when in comparison to just running the same elemental/gun/health upgrades every time\n- majority of buffs in the game have a very abnoxious limit to them rather than having lesser effects. main examples I can think of are any expended ammo related buffs\n\noverall the game is an okay roguelike to turn your brain off but with other actually good (and AI-less) alternatives it's not worth buying",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I would love to write a 5 star review. Unfortunately i am one of a number of users affected by repeated progress loss. Steam shows I have 34 hours of play, I have played through it multiple times, but if i load the game now all my progress is gone. I attempted to contact support via email and steam discussion and got no response",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you enjoy deep, well-crafted, repeatable roguelites then this is not the game for you. The perk system is poorly designed and does not provide much variety between runs.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is a ton of fun for the most part with a wide variety of viable build paths and playstyles. Some of the nightmare content needs a balance pass, but still very enjoyable for the most part.\n\nLately however (since the latest patch as far as I can tell), the game will disconnect from the server after playing for about an hour for no discernable reason and completely refuse to reconnect until the game is restarted. If you're playing strictly solo, it's not a big deal, but it completely breaks a multiplayer run. It's not specific to my internet connection either, because the exact same thing happens when I play from other locations with my laptop, and with all of my friends scattered around the country no matter who is hosting. The game didn't have the disconnection issue at all until somewhat recently despite always having sub-par netcode. The slowly ballooning latency could be suffered enough to still enjoy the game, but the server drops completely kill the experience.\n\nIf the devs can get the multiplayer connection issues sorted out, I'll change the review back to positive. Until then however, don't waste your time if you plan on playing with friends.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very boring, repetitive, and generic. Weapons, enemies, level design, audio.... all of it is sub par. Is this an asset store reskin? Expected a whole lot more from a this franchise and price point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WARNING FOR POTENTIAL STEAM DECK PLAYERS:\n\nThere is a known bug affecting steam deck (and apparently some other) players wherein all of your progress can be randomly/arbitrarily deleted from the cloud. The devs claim this problem is \"on their radar\", but until it is confirmed fixed, I'd keep my distance.\n\nA shame too, as it's a damn fun game otherwise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes literally every time I try to launch it. Worked flawlessly during early access and for a couple weeks afterwards. No word from devs on what's going on or why. Do not buy this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Super sick game until 1.0 dropped. New enemies are incredibly annoying by design, as if the devs couldn't figure out new mechanics and had to force variety in subpar ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The more I play this game, the less I like it.  The levels, enemies, and builds are repetitive.  Only a small handful of builds are truly viable (lightning, cryo (for some missions), melee).  Everything else is -meh- at best, and absolutely useless at worst.\n\nThe difficulty scaling is poor.  Enemies don't get smarter, they just go from tickling you to now removing 90% of your shield and health in one shot.  This isn't so bad on some missions, but eventually you reach levels where there are a dozen or two enemies that can shoot through walls, all able to insta-gib you unless you get lucky with a FEW defensive perks, and even then - it just delays the death by a few seconds, if not a fraction of a second.\n\nSome of the enemy designs are just.. so poorly thought out, and end up being more annoying than anything.\n\nI'm dropping this game for now.  It pales in comparison to others of the genre - Gunfire Reborn, Risk of Rain 2, etc.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun , but literally the servers crash in gauntlet. The game can't seem to keep up with the damage and it consistently crashes, bugs out or otherwise stops working. I enjoying playing the game but I'm stop gapped not by skill , but by bad net code or poor servers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "While much of the game can be fun it has elements that eliminate much of the enjoyment, whoever had the idea of single hit kill enemies was possibly brain dead. Adding that to this style of game greatly diminishes the concept of the flowing reward system of getting stronger during each run. In terms of elements there are many that make it a reasonably fun game however the \"wave based defense\" missions also eliminate my ability to recommend this to others coupled with the extremely limited nature of any fun one could have in this due to the sluggish addition of levels, vapid story, and duke nukem level of brick personality protagonist and it's just a better skip to find something more worth your time and money. Were it not directly suggested by someone else I wouldn't have gotten it and were it not for others wanting to play it I'd have uninstalled it by now. Even for quick enjoyment there are cheaper games that do what Deadzone Rogue does but better with more meat and a better progression system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It refunded the game after about two hours. Don't get me wrong: weapons felt great, roguelike elements like upgrading a character and gear during a run was nice. The whole short term gameloop checked all the right boxes. And the game runs really really well. But make no mistake: it just blends to very established genres together in a very competent way: first person shooters and rogue lites. But it delievers nothing new in neither  of them.\n\nThat in itself wouldn't be a problem but beyond that short gameplay loop the game had nothing interesting to offer and felt servicable at best: the levels are bleak and blend, as much as the ai is stale. On my 2nd run I found a Sniping Rifle, with which I could pick up every enemy one by one, with almost no dangger at all until I hit a difficulty peak at Level 20 in Zone 1. I am NOT that good of a player. The game is just that easy.\n\nUp until that point every room had they same greyish boring tone with very little variation. And a different neon light source, is not enough to make a difference. Deadzone feels like moving from one uninteresting box to another, and that is simply not enough to keep my interest. I know it is an unfair sentimatn, but  at some pointt I thought the game looks like a tech demo, while in gameplay it certainly isn't.\n\nThat way I didn't see myself playing the game more than 4h. I feel like I have seen everything or at least it is very predictable already and research in reviews and such, reflect that sentiment.\n\nHowever make no mistake. This is one of the cases, in which simply giving a positive or negative rating is not enough. \n\nIf the gameplay loop is enough to keep you interested, this game delivers in the best way possible. It is so well done, that it hurts to give a negative rating. And I hope we get sth. new from this dev in the future.\nBut when you want more meat, when it comes to level design and presentation, I'd pass on this one. \n\nFora a Multiplayer I'd pick sth else, because I feel this game doesn't have enough staying power to be played more than two evenings or so. That's ok with titles that only cost around 7 € like lethal company, repo or peak, which almost always have the same fate of being played for about two weeks and then nobody is interested anymore. But for 25 bucks that's too short. I am certain someone will deliver a similar game in the future, because deadzone has certainly shown, that there is plenty of room for a game like this. \n\nAs a singleplayer game Witchfire is the better choice right now. It is the same genre as a roguelite fps, but the setting is more interesting, gunplay is on point and the levels are beautifull, and have so much to tell, that the exploration is a huge and fun aspect of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really tried to play this game, but I was forced to refund it with nearly an hour of tracked running time and 0 seconds of actual playing time.\nIt's DirectX12. This game supports only DX12, and if there is only a single graphics API you support, then it'd be Vulkan. Okay, maybe DX11 if you are willing to bite the compatibility bullet. DX12 only? Yeah...that is asking for trouble, and I spent days troubleshooting including a full DDU reinstall and multiple drivers, with a fairly standard W10+RX 5700 XT setup, but no.\n(Note, this is the first game in a decade that I straight up didn't get to play at all, it's a complete outlier.)\n\nThe game might be amazing but if it's unplayable due to poor technical choices, what can I say. So be warned, if your system already had beef with DX12, maybe don't bother until the devs get around to addressing the situation.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has some amazing gunplay, but that is all it has going for it.\nThe level design is the definition of bare minimum; just a bunch of flat, empty rooms connected with narrow hallways. Easily the weakest aspect of the game.\n\nThe gameplay loop consists of replaying the same stages on incrementing difficulties, but the difficulty balancing rapidly goes from satisfying to tedious. You don't have to play for long to reach the point where your character instantly combusts from an enemy breathing on you too hard. Mix this with the level design and half the perks being so laughably bad you'll never want to use them, and the game gets very stale very quick.\n\nThere are some really questionable enemy design choices in Act 3. Spamming half a dozen copies of an enemy in a 5x6 room that can make multiple invincible clones, fill the room with projectiles, and shoot through walls is a bit ridiculous.\n\nThere's not enough meta progression, and it honestly feels like such an after thought. There's ten's of hours of content but you'll have all your passive perks maxed out within the first 10 hours, and the buffs you get from them are so negligible on higher difficulties. \n\nThe missions where you're forced to use a single weapon get repetitive very quickly. Finishing these missions reward you by permanently unlocking the weapon, but 2/3 of the missions restrict you to using one weapon, so it's a pretty lacklustre reward.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am very conflicted about this game. Years ago I purchased a game called Starsiege Deadzone, because it looked like a really funny battle royal/ extraction shooter set in space. I had so much fun playing it and occasionally missed it after the playtests, but never checked in on it. Going through my steam library recently I noticed this game, which I had no recollection of. As soon as I booted it up I realized this is what the devs turned starsiege deadzone into, and its honestly pretty disappointing. This game, in a vacuum, is fun, but when I am playing it all I can think about is how much more fun I had playing Starsiege. This game should have been a spin off of starsiege for those who don't want a pvp game but still enjoy the other aspects, it should not have completely replaced it. \n\nSo basically if you want to play a FPS space roguelike, I highly recommend this game, but as someone who paid for a pvp extraction shooter and instead got a roguelike, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}