{
  "positive": [
    {
      "review": "[If they release the game without unnecessary DRM and don’t require the Ubisoft Launcher at any point, we’ll gladly buy it.]\n\nI've played this game non stop ever since the demo came out, and can't get enough of it. It builds on top of the best that this genre has to offer, while also bringing in new game concepts, unique factions and so many quality of life improvements, and it's only in a demo as of now.\nWhether you play it against the AI or PvP, the game offers various game modes, from quick games when you only have half a hour and just want to scratch that itch and squeeze in one or two games, to the good old faithful staples that everyone who played this series for the last 30 years enjoyed so much.\nI can't remember the last time I was so excited for a game and can't wait for the full release.\n\nWe are in 2025 and look at this , a game is releasing a free demo for us to try . And it's not locked under a paywall , its not only tutorial . You get to enjoy the game and have a good taste of works this incredible people are doing .\n\n10/10 from me , and i know a lot more will come .\n\nif your passing by you can pet this cat.\n정말 위대합니다, 선생!!\n内容很新颖 和电影 移动迷宫 很像，demo体量算不错了，\n　　　　 　 　 _ _\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 122
    },
    {
      "review": "positives:\n-music\n-map generator- You select template instead of map. And then it's generated so you never play same map twice.\n-unexpectedly factions look balanced\n-interesting system of creature upgrade/ spell upgrade, you need new resource which cannot be traded, nice.\n\nnegatives:\n-There are a hell of bugs in the Demo version. I hope everything will be fixed in regular version.\n-Lack of hotkeys.\n-Visually overloaded maps, it's difficult to find a particular resource or even an enemy hero. Also they are overloaded with resources and facilities... it would be better to cut facilities and to make more nature instead. Really at any day (even 1st day) you may visit 20+ facilities...\n-AI is very poor. Even with max difficulty level every map is easy winnable with any hero.\n-Too much perks. Like perk, anti perk, anti anti perk etc. I don't believe someone will be  able to manage all these things. I would prefer more simple engine and much better UI, and of course less bugs.\n\nI'm not happy with this demo. Now waiting for release.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Tried the demo — and I have to say, it left a good impression. No technical issues spotted, and the gameplay feels well-designed and efficient. Wishing the developers continued success and inspiration in further improving the game! ⚔️✨👍",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Actually feels like it can stand next to HOMM3 and HOMM5 as equals. \nI'm positevly surprised, as I expected it to be just a cheap knockoff, a way to milk money from nostalgia but no. It's actually a pretty good game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game has a lot of promise and content for a demo, few things need tuning but pretty solid game so far. I can not wait for the game to release!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Heroes of Might & Magic: Olden Era[/h1]  \n[b]— the game that boldly asks the question:[/b]  \n[h3]“What if we made a faithful HoMM experience… but sprinkled some charming chaos on top?”[/h3]\n\nLet me start by saying: I’ve played every Heroes game.  \nGood old times before Ubisoft discovered how to spell [b]“microtransaction”[/b] in some of their games like Assassin’s Creed.\n\nAnd this demo?  \n[b][i]Surprisingly good.[/i][/b]  \nLike “wow, someone actually cares about the series” good.  \nLike [b]HOTA-good[/b].  \n\nWhich is exactly why the tiny bugs feel like that one relative who shows up uninvited to family dinner — annoying, but you kind of just live with them.\n\n[quote][b]Pros:[/b][/quote]\n[olist]  \n[*][b]Beautiful nostalgia hit straight into the bloodstream.[/b]  \n[*][b]Combat that actually feels like HOMM3.[/b]  \n[*][b]Music that whispers sweet 1999 into your ears.[/b]  \n[*][b]Gameplay so classic I considered turning my old CRT monitor back on.[/b]  \n[/olist]\n\n[quote][b]Cons:[/b][/quote]\n[olist]  \n[*]A few bugs that politely remind you “this is a demo, relax.”  \n[*]AI that occasionally takes a coffee break before its turn.  \n[*]My 3070 Ti trying to become a vacuum cleaner or a Falcon 9.  \n[/olist]\n\n[b]Final Verdict:[/b]  \nA promising, nostalgic, surprisingly polished love-letter to Heroes — lightly seasoned with small bugs doing their best to cosplay as “features.”  \nIf this is just the demo, the full game might actually resurrect the franchise.  \nOr at least show Ubisoft that good games are still a thing.\n\n[h1]9/10 — Would absolutely lose another few hundred hours to this.[/h1]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely love it. Best Heroes Of Might and Magic version since 3. I only hope they will add the ability to make custom maps. That would make it a 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To keep it in short: for those who expect the old HoMM gameplay: it is not exactly that but it's close enough and enjoyable in my opinion who were into HoMM 3 and 5. There many new things to uncover which takes time, but I think old players could enjoy this. The low poly visuals were something I had to get used to, but even that it's fine.\nFor new players the game might seems difficult or hard to play, but once you get the hang of it and give it some time, it can be enjoyable.\n\nAlthough it would be good to see all of the hotkeys in the game, finally to see underground maps and not just only overworld, bit more option to manage your army and split your stacks, not just make one stacks and halve them and the game better communicate the objective for certain maps, but maybe that's my problem. However some of the more serious issues is the focus system, because it's not that useful in most battles and you are really dependent on wood and stones most of the time, and later on the new resource type, and if you can't find these you won't be able to do anything noteable.\n\nStill, I'm looking forward to the game but hopefully somethings will get address when the game comes out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Feels like modern HOMM3. The art style feels different but it works and I personnally like it. Enjoying the demo so far, definitely excited to try the whole game once it releases.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The new law point system , dual creature upgrade choices, hero skill subset abilities and the two legendary master skills give this game a level of customization and synergy that I never thought possible in a heroes of might and magic game. Very fun and limitless potential. I hope they fix bugs, improve UI and make the game even better than the demo. One bug I reported was when you are choosing one of the 3 random artifacts from an adventure map pickup, you can't check your hero artifact inventory to see what slots your hero already has artifacts for. It would be helpful to know this when making a choice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wow. This is a fully-featured demo done right. I love the extensions of strategy here over the past Heroes games, and while it might make it harder for me, it's as engaging as the classics and arguably done better than other iterations of similar games in this modern era. With the easy bug reporting icon, I feel compelled to assist the developers correct some minor issues with spelling, grammar, and gameplay. Well done dev teams on your dedicated efforts and I look forward to buying it when it's properly released.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily the longest demo I played in my entire life.\n\nOverall 7.5/10, I consider homm3 to be one of my best ongoing game. I play not purely for its game play but for its theme, music and the capability for imagination. as if I'm opening the Wardrobe to Narnia, that kind of escapism. \n\nNow Olden Era, all in all is not a bad game and devs have done great to keeping it close to Homm3. But it still lacks the weirdness and ambitious presentation in its music and design. It's too cartoony, curvy on its object design. I rather a serious theme that further demonstrating each faction's personalities. \n\nThe music has always been my favourite thing in Homm3. And in Olden era, they've done a tremendous job. I see some of its soundtrack were inspired from previous game like Homm5. I didn't like how the Hive theme is going, however. The trailer version is good as it is. \n\nAll in all, the thing I most look forward is to get my hands on its template editor in order to experience more variation of terrains like the sea and can't wait to see passionate fans creating insane map like \"Devil in the details\".",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't get the negative reviews, as someone who's played every HOMM game, this feels like a great squeal to HOMM 3 and very happy to see it come to life.  Yeah it needs polish, (it's not even released yet) but good developers get feedback to make the product better and this game has all the signs of that. Can't wait to get back into the game when I have more time!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily the most generous demo I've ever seen. I already sank dozens of hours into it and I can see myself playing many more until the full game comes out. As for the game itself, it's pretty much the perfect blend of HoMM 3 and HoMM 5, with enough new stuff thrown into the mix to stand on its own as a very solid entry in the series. The demo alone is better than any HoMM games we've had in nearly two decades. Can't wait to see what the final product will look like",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I used to own Heroes of Might and Magic IV back when I was a kid. I played it a bit with a friend of mine, a friend who really liked it, but I was never that much into it. So many years later, it’s still the same, not my cup of tea, although I do love strategy and fantasy games. I can totally see why many people love it though, starting with the art, which I find beautiful, as well as the music and the animations. And just because it’s not for me doesn’t mean I can’t like or recommend it, because that’s the great thing about Steam Next Fest, trying games you’d usually never think of trying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super solid demo worth a try to get a feel for if you will like the full game or not. I am personally kinda hype for the Full release and the return to classic heroes form with this new installment.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love it.  Magic has returned.  Played HOMM 3 far too much, even to this day, but that is over now as i will get HOMM Olden Era on release.  Maybe even delete HOMM 3 from my laptop....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good. \nHonestly really good, i can't wait to see the other factions and mod compatibility for modders. This game is going to have nice future..\n\nBut for gods sake... Change the name of the game a bit.......",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This very much feels like someone decided to take a modern spin on HoMM3.\n\nGame is fairly approachable overall, it feels familiar to anyone who played the old games but with enough new stuff borrowed from other games or brand-new to keep it fresh. Seems there is more of a focus on secondary resources than raw gold economy, alternate upgrades from H5 are back and it's free to switch between the two. Heroes' secondary skills at ranks 2 and 3 allow you to pick between one of three extra effects to learn, and there is also a \"law\" system that is essentially just kingdom XP that allows you to buy skills that affect your entire kingdom's economy, growth or combat on a global level.\nThe hero portrait art also looks very detailed and diverse overall, while a lot of the designs could be called slightly generic, no two heroes seemingly look anything alike.\n\nMy only real complaint is the UI takes a little bit to get used to overall (might need a slight redesign) and the loading times need to be optimized more.\nLooking forward to what the full release will be like!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After a quick check, I can gladly say we are finally getting the Might&Magic game we've been waiting for. \nAll the designed creatures so far in HMM series were great, once more there are many new creatures and heroes with intriguing designs as expected. \nMost of them resemble the old ones, it'd be very charming if they add their stories with new campaigns for us to explore once more; sailing to the new chapters as we remember the past.\nI loved there are many upgrade systems that we can specialize our gameplays with; new skill-tree and artifact upgrade system are delicious.\nI can not ignore how magnificent the musics are, I love how they stick with the same brilliant composer.\nOn the other hand, the main problem this series have always had is very obvious; presentation. It takes some time to get used to graphics, even as someone who is familiar with the games, I found the environment pretty lousy. In my opinion it should not be too hard to distinguish units/constructions/items we see on the map; it just unnecessarily drains your energy.\nAnimations, in-faction views are delightful. The issue is when you are looking at the map.\n\nI am genuinely excited to see what we will have once the game arrives. Lots of love and hex from your local necromancer!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Отличное переосмысление легендарных 3х героев. Играю даже в демо с огромным удовольствием. Куча новых механик, при этом все довольно понятно и интуитивно. Ждём релиз",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best HOMM game since three. No contest. No need to rush finishing development it, if its like this demo its worth the wait.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like it. This version of Heroes is tons of fun. I wish they added Stronghold cuz I always played Crag Hack with behemoths in Heroes 3 but this is a highly polished version of Heroes 3 basically.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Looks very promising! Will be waiting for updates. The only thing that was annoying, it is UI. It is too ugly and doesn't fit into overall concept with magic and mystical beasts. UI should represent the game genre and match it, but current UI is totally out of it. Maybe only specific UI, like magic book, which has that spirit, but it also can have some improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is simply amazing! In my opinion, this is the best turn-based strategy game of all time, on par with the third game. This sequel is heads and shoulders above all previous games in the series. Thank you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a rough start playing this demo with tons of nostalgia expectations putting a lot of friction on my wanted experience. But I powered through and gave it a go. \n\nNow, after 30+ hours, I got to say the game offers something really special. A pleasant combination of nostalgia + new stuff that fit well into the game. \nThe demo still has bugs and bunch of UX conventions that need to be fixed and super polished. But I had tons of fun regardless. \n\nLong story short, this is the ONLY Heroes of Might and Magic that doesn't make me instantly install Heroes 3 or 5. \nThank you for that from the bottom of my heart, and see you on the release.  <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It looks good on the surface, but the amount of \"tasks\" i.e. actual stuff to do on the map is fairly limited.\n\nIn addition, the difficulty level is scaled way way down in the demo, so it is an easy breeze. Same goes for ressource quantities.\n\nI would rate it as standard - neutral that is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This IP has been through a lot. From the highest of highs with Heroes of Might and Magic III to the hell that was Heroes VI. The studio Unfrozen has taken up a mantle that once seemed impossible to get right yet they did it. In fact, they got it more right than ever before.\n\nOlden Era has revived the IP. This is, without a doubt, the best modern Heroes of Might and Magic game we could have hoped for. Here are the reasons this game is amazing and why anyone should try it:\n\nPros\n• Feels like home\n\nThis looks and feels exactly like how a modern take on HoMM should feel. Anyone who has played a HoMM game will instantly know what to do the moment they load in. You have your faction, your hero(es), your units and now you decide what to do with them. The team absolutely nailed the classic HoMM feeling.\n\n• Distinct personalities\n\nA major gripe I always had with HoMM III was how ugly some heroes were. Some looked so weird that it took away from the joy of playing them. Olden Era fixes this. Heroes here are cool, unique, stylish, strange, charming there’s something for everyone.\nWant cool guys? Ister, Leon, or Bulwark are there.\nWant something pretty? Funerella, Motley, or Zenith.\nNeed a weirdo? Sunny Rauktol, Iron Master, or Lia.\nThey nailed hero personality and identity.\n\n• Useful units\n\nIn HoMM III every faction has at least one unit you never use, sometimes two or three. Zombies, dwarves, dendroid are never used.\nIn Olden Era, while some units are certainly better than others, none feel useless.\nThere’s a real argument for rushing Dread Knights in Necro, going all-in on Inquisitors, or just running around with Black Dragons.\nMost units have abilities that add depth to combat, and some even help you outside of battle. Fights are now the most interesting they’ve ever been in the series.\n\n• Two upgrades. Duh!\n\nHow HoMM VI and VII didn’t include two upgrades per creature is beyond me, especially when the feature already existed in HoMM V.\nThis single feature makes every unit 10x more interesting.\nSome upgrade paths change roles entirely (like ranged vs. melee), while others offer meaningful stat and ability differences. It gives you real strategic choice and yes, it makes a huge difference.\n\n• Modern options\n\nA modern HoMM game should come with modern features.\nLove the classic “many heroes, explore everything, chain armies around the map” style? It’s here.\nPrefer a faster, single-hero mode where death = game over? You can pick it.\nWant to draft units, items, and abilities and just fight? Click the button.\nThree unique modes, all instantly accessible. No lobby searching, no DMing randoms. Just play.\n\nCons:\n\nThe Cavalier unit is… very ugly, haha. The upgrades look great, but the base Cavalier could really use a redesign.\n\nThat’s it.\n\nI’ve seen the negative comments: “It looks ugly,” “mobile graphics,” “I can’t tell what’s what.”\nArt style is subjective you’ll either let it grow on you or you won’t.\nBut to the people complaining that they can’t tell which units are ranged on the map or that ore looks like mushrooms(???):\nCome on. You had no idea what anything was in HoMM III the first time you booted it up 25 years ago. Don’t pretend you instantly recognized a random swamp as a Hydra dwelling, or knew Medusa Queens were ranged the first time you saw them.\nJust like back then, familiarity takes time. Let it breathe.\n\nUI improvements, unit backgrounds, Temple unique skill and Necromany those things are already confirmed as being changed, so I’m not counting them as negatives. The IP is in good hands with Unfrozen. Give them room to work.\n\nEverything I’ve said comes from the demo and playtest. Nothing more, nothing less. The game will release in Early Access and stay there for at least a year before 1.0 drops. This will give Unfronze all the time they need to make sure this game stays around for many many years!\n\nThis is the revival the series deserved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a bit skeptical about this game, but after playing the demo, I am pleasantly surprised.\n\nImpressions beforehand:\n- units look uninspiring\n- the art style is too smooth, a bit phone gamey\n- overall felt like the game is just trying to cash in on nostalgia\n\nBut afterwards, I am strongly considering getting the game on release.\n\nIs it perfect? No, of course not. But I feel it's a solid contender among \"Games like Heroes 3\". Variety is the spice of life and all.\n\nScattered thoughts after the demo:\nGood:\n- Some units can still be uninspiring initially, but overall they are growing on me, as I come to remember which are which. I appreciate that there are no units like the peasants or zombies from Heroes 5 that just feel kinda... lame?\n- I like the idea of the new factions. The Hive is an insect hive mind (haven't had a chance to play yet), and the Schism are cultists summoning horrors from the frigid wastes, which tickles my Lovecraft bone.\n- I like that they took the idea of skill synergies from Heroes 5, but kept it simple. You get skills (basic, advanced, expert), and on advanced and expert you get to select a subskill. Some subskills get their bonuses enhanced if you have another skill (or for some magic skills - just more schools of magic), and that's it. Simple, easy to refer to.\n- The game has a cozy vibe while playing it. Subjective, but it was easy to spend time here.\n- The law system is pretty cool. Each faction can accumulate specific bonuses over time - unit generation, strength, certain spell power. I like the customization.\n- Movement is simplified. No more movement based on your slowest unit. No movement for picking up resources. I like it, but opinions can vary.\n\nNeutral:\n- I have no idea where the balance is in this game. Necromancy seems a bit underwhelming? Somehow I feel that the Nightshade school of magic does, too? But maybe I just haven't used it right. I don't really plan on playing MP, but still.\n\nBad?\n- Alchemical dust (extra material used for upgrading artifacts and creating some buildings) seems a bit restrictive at times, as it blocks unit creation.\n- Not a fan of the way you find the grail. Cool idea in concept, but the AI will never manage it, and you kinda have to cheese it.\n- Are the hero portraits AI art? They kinda have that vibe. Kinda sucks to suspect that everywhere now, but if so - ew.\n- AI is better, but it still needs work. If hexed with twilight (can't use ranged attacks), enemies just stand still. AI launches suicidal attacks against you. PLEASE DEVS I hope you program in that AI uses surrender/flee mechanic. Hell, make it a checkbox. I want the AI to be a challenge.\n\nAll in all, good job. It does feel like the people who made this game loved the previous ones, and had a good vision",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's demo so you know that many things in the game need to be fixed, but so far it's a very good game. I'm looking forward to a full version of the game, I'm going to buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had played mainly Heroes 3 and 5 in casual singleplayer (campaigns, maps).\nBased on this demo, Olden Era is going to be exactly what I wanted!\n\nThe demo itself is great in terms of quality and its unlimited playtime.\nMy complaints are mostly about small topics (like buttons telling you what they are upon mouse-over).\nAnd personally, I don't like the current Temple's (Haven's) faction skill.\n\nMost importantly though, the magic (and might) is there.\nI never pre-order but this game will get my money at the first opportunity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It looks and feels great. They truly seem to have captured the magic of HoMAM III. I feel like this is going to be the first truly worthy sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it but I have to restart often if/when playing on a 16 GB RAM system. It seems to leak a bit over time (after some loading, restarting etc).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just the demo alone brings back all good memories. Great game so far even just for a demo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking forward to the full release. If you’re looking for a modernized HOMM3 game then this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay i want this game ...remember me for past good times when i was a kid and i play this HMM III in 2001 or 2002...and i learn this game without to know ENG at that time....is was very hard first week but in time i undestand the game and mechs.I was only 12 years old....\nAbout the game is in beta and is look very good....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After some tweaking is it could become superb!\n\n+ Beautifull graphics\n+ Great attention to details\n+ Insane Art work\n- Slow build up: homm7 you encouter enemy much quicker, now it feels like a grind without any clue, feels pointless to continue.\n- Neutrals dont stack, makes it halfway in the game boring.\n- Too much economics: reduce amount of castles, every castle feels like an extra chore.\n\nAfter some time of playing you get the choices that are made by the game creators. Therefore, give it some time.  \n\nSuggestion: Keep the great homm3 stuff, add it with some homm7 interactiveness with enemy players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far, its a really chill game. I used to play the old HOMM for hours and much of what I enjoyed has returned with a facelift. Run around, gain XP, grow your army, and go raid a castle, repeat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying this, it goes back to the feel of Heroes 3 with some modern QoL updates.  I hope they do extensive campaigns with special heroes like H3 but the demo definitely scratches the itch for now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great installment in the series with many nods back to the older games.\n\nWhen watching some gameplay, the art-style seemed a bit off. However, once you have put in some hours, you start to appreciate the new art style and the commonly mentioned issues about the art-style (busy, blending, mobile-like) start to go away.\n\nThere are definitely some major bugs that do require fixing, some critical QoL changes that need to be implemented and AI must greatly improve. \n\nHowever, even with the current shortcomings, the game is already loads of fun to play. Looking forward to the full release and hopefully the campaign will be a challenging but satisfying playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brings me back to my old days in middle school when playing III - and even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game so far. Looking forward to the full release.\nThese Devs have got a lot of things right, loads of fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is amazing I love it so much, its like a combination of might and magic 3 and 5. The new law system is pretty cool and enjoyable, I do however wish that the clashing of gold sound was in the game whenever you purchased something, ironically enough its weird to have it missing. Also looking at the playable factions on the list for release I wish the had more of the classic factions like inferno and academy. Also I haven't noticed a menu to pick weather to start with gold, random resource or artifact at the start of the game. The only other thing I can say is I wish there was troop transport from outer dwellings, other than that this game is a blast from the past and I'm super excited for the full release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game looks promising, especially for a demo.  I like the classic factions more than the new one (Schism), though that might just be my bias.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally a new HoMM game since HoMM3 (HoMM4 was more like a spinoff and the V and beyond are shit).\n\nTrue HoMM4 I would say.\n\n\nPros(+):\n\n- Great graphics.\n\n- Finally feels more like HoMM than all this shit that was released after HoMM3.\n\n- New mechanics\n\n- Went over my expectations by a lot. But well... Ubisoft hang that bar so low...\n\n\nNeutral(+/-):\n\n- Law system. Kinda feels Civilization-like because of it and I'm not sure what I feel about it. In classic HoMM it didnt really matter which castle you chose as your starting one - you could play any. Here however... it kinda matters, because the law skilltree you get depends on the starting castle(faction) you chose.\nI like it for the favour of more meaningful choices, but I kinda dislike it for the fact that it kinda forces you to play the strategy you chose early on...\n\n- AI in the battle - sometimes it plays smarter (ignoring obvious baits) than the one in HoMM3 but sometimes... its way more stupid - e.g: ignoring taunt till it passes or ignoring twilight(?) (forgetfulness) till it passes.\n\n- Spells are usually more balanced (though the masterful variants are kinda OP) as in HoMM3. However the levelling system and the masterful variants... idk, mixed feelings.\n\n\nBad(-):\n\n- VERY BAD GAME BALANCE - which will probably be a killer for this game. I can't see people playing competitively with that many broken mechanics. And since this game has A LOT more mechanics than HoMM3 then amount of combinations is enormous and it is a balancing hell.\n\n- Planned path of heroes do not save between turns (weird, it should be super easy to implement...)\n\n- Every unit has a lot of abilities (passive/active) so it kinda feels more like Age of Wonders 3 than classic HoMM - it sounds good on the paper, but it just make it a lot harder to learn the game and a bit more tiring/slower to play it.\n\n- Bugs - like duplicating units at chimerologist, endless levelups with some artifact or picking more than 8 skills (idk if its bug or poorly implemented feature) - but no crashes from what I've seen so far.\n\n- AI on the overworld does not pose any challenge even on biggest map and highest difficulty. I think AI in HotA plays better than this one.\n\n- Hero subclass. This requires you to pick 5 predetermined skills (which you didnt really want to pick) in order to receive a game-breaking or useless (depending on hero class) ability. But lets say you go for this subclass that makes all spells cost no mana(game breaking), right? Yeah, well, now you have 4/5 of those skills? Great. Welcome to 8th pick of skill. Oh, you didnt have enough faith in RNGods? Sorry, but you are stuck with useless skills and broken hero which will never get a subclass.\n\n- SERIOUSLY - did someone from the Unfrozen team played Necropolis in HoMM3 and went like \"man, this castle is way too weak, lets buff it in our game!\"!?!?!?!? WHAT THE FK, BRO!?\nNecropolis is even STRONGER than in HoMM3, like holy fk, what is wrong with you!?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, definitely compares favorably to my favorite entries in the franchise like 2,3, and 5.  Game feels well balanced for a demo.  I don't love the art style all that much (prefer the H3 style) but otherwise lots to like with this entry to the series and I'm excited for the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put a little over 100 hours into this demo. Setting aside any goodwill earned by the fact that the company actually released a demo with a ton of content, the game is shaping up to be the best entry since HOMM III. Deceptively deep while still intuitive, the tactical combat and map control elements still work extremely well together to create a satisfying, multifaceted strategy. Of course, this is a demo and there are still some balance issues that are frustrating/insanely fun to exploit, but that's pretty much a tradition for HOMM games and may be more of a feature than something that needs to be corrected. \n\nIf you like the HOMM series and haven't downloaded this, do it now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very promising and have potential. I dont remember when i sink in to the demo version for 24h.\nFor Now --- 6-7 / 10  POSSIBLY 9-9.5 If not stuff mentioned below.\nIt might be the menu music, brings back the spirit of old h3 theme. Great ! :)\nBut there are also my 2 concerns are: \n1 - interface is biggest flaw in this game, not intuitive at all.\na). preview of upgraded units is a HUGE pain, to compare it would be much better if we had some kind of toogle for stats preview not only on unit portrait mouse hover when i want to compare or check unit stats i need to go back and forth to some units.\nb) Bug while moving map with rmb.\nc). Working of ESC button it should work more like \"go back button\" or close current window instead of opening menu (for that just double esc click would be more justified)  its super anyoing when you want to close spellbook or hero preview/unit preview and you have to aim in super small icons automaticly i reach out for esc like in other games.\nd).  Also Unit fraction background, its so hard to determine units with those small portraits adding fractions colors or images would add nice touch like in old perfect h3 single color its missleading e). also user interface scale would be nice !  on ultrawide its pain\n2 - More customization of map preview i mean highlighting interactive objects adjusting highlight of them more to your own desire and intencity of map grid color to your own desire would improve map clarity a ton. For now great there is an option for that, but for many tastes its \"too bright\"/\"too intrusive\" adjusting brightnes/color of it would be great. At the end separation of sounds volume for fights world map or towns. I remember there was one song that drive me crazy but other ones i enjoyed alot and mute for one specific aspect of a game  would keep me in the game for another 3h :D (fights/map/town etc.)\nI love the option for diffrent map fog of war the burning  manuscript ? Briliant ! Super nice.\nNot enough fractions 2 more would be sufficient on the top of already presented 6 .\nOther ones are my own pref so i wont mention them too specific not sure if they wuld be good feedback.\nI would like to know the price of olden era and cant wait for full release and campaign :)\n\nPS: DONT MAKE IT LOOK TOO MOBILE its Terrible idea. Leveling for TOTAL random skill is absurd not good for pvp rng in strategic games yyyy OK?! NO ! at least too much of it. I would like to build heroes more consciously.\nAlso fight balance and unit speed value is meh more variety for speed and bigger battle field would add tactic to the game for now it feels like straight forward CHARGE ! h3 resolved that one much better olden era feels like clicker to me in that regard idk why.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so good to finally see a new entry to what HOMM was always supposed to be.\n\nSure, it is riding on that nostalgia high of HOMM III, adding what also made V great in my opinion. But I think it's of very bad faith to say that this is a bad HOMM game. It's the most well-made \"back to the basics\" game I've seen in a long time, and the things it adds - tech tree, character classes or a stronger gimmick for each faction for example - feel extremely welcome in a franchise I've always felt struggle with its systems.\n\nHOMM is a game like chess, in a way. Its core concept is so solid that changing it too much reduces its quality, and doing the same thing can get boring to many people. Olden Era (OE if I reference it again) goes in directions that feel both fresh and obvious to me. Games feel engaging and rewarding, combat is back to being hexagonal boards, skills cater more towards long term progression as they also provide new passives you can pick when upgrading them, and heroes have skills of choice depending on who they are and how you want to build them. Of course, randomization is part of the mix, so getting a perfect combo of the skills you want can be tricky, but I don't mind.\n\nIf you've played HOMM as a kid, like many of us did with our parents or siblings, or if you're new to the genre, give this demo a go. I think it's the long awaited return of an absolute classic of PC gaming, that can be loved by honestly anyone who loved fantasy, strategy games and great music.\n\nSidenote : I'm part of the group that LOVES how OE looks, people talking about \"mobile game looks\" are totally out of touch in my opinion. Both because mobile games can now look insanely good, and also because that's the most lazy form of criticism you can make.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This demo is very good. Easily the best homm game since 3. My largest complaint is that the ui needs some upgrading. Hopefully it has a good campaign as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far so good has alot of similar feel to older Homm games with better build as to ther other newer Homm games (not that they were bad just not as great as the classics 2-3) hoping to see more races on the official release. \n\n-i feel like the magic system is better yet still the same and more balanced.\n-multiple unit upgrades is cool and to be able to change them once upgraded for different battles.\n    do wish their was some that didnt have that option or some with 3 or more upgrades like upgraded then \n    upgraded again but thats just me.\n-different areas having effects is cool hope there is a way to highlight the pros/cons in the future\n-the demo has alot to offer if you like these kind of games even if i wished for a 3 or more player solo hero map.\n\ndemo has be great looking forward to the official release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed the tutorial level quite a bit and the game felt very reminiscent of the older HoMM games. Sounds cues and special effects around the map are very well done and I liked the graphics on the map. The 3D creatures were fine but I found the city interface a bit cumbersome. Overall, excited for the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the thing that made HOMM3 so freaking awesome, along with the game itself, soudntrack etc etc, was the artwork! the way you clicked on an unit and it was displayed on the middle of your screen, it looked like you were looking at D&D cards in your hands. the background of the cities was beautiful to look at. and that's what missing here. don't get me wrong, I like this new design, but it is missing that artwork style that HOMM3 had.  here, the units window is too small, the cities look too far away etc.etc.  I had to move closer to my screen to see the difference between unites during the game. in HOMM3 I could be layed back in my chair and just chill while playing. \ni don't know, maybe I am getting to old and my eyes don't work anymore, but that is my main problem with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as an OLD HOMM player, this brought so much memories back, and i wish all factions are back, i'm really excited and happy with this masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would like to write more extensive review, but for now I can only say, that it was an amazing HOMM experience to play this demo. I already have more hours in it than in HOMM 6 and 7 together. I am sure there will be a lot of improvements and changes from now on, but I only wanted to note that the demo seems not to be optimized for  an ultrawide screen. It works mostly well, but every now and then the overlays are not reaching to the edge of the screen and it breaks the UI. Never the less the game is as it is a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The demo looks promising for the game's release. The old mechanics blend well with the new ones.\n\nAt first, I also found the graphics strange, but I quickly got used to them. Even on the highest difficulty setting, the AI isn't up to par, as you have a lot of mobility that it doesn't use.\n\nI'm looking forward to improvements to the user interface and AI, as well as bug fixes, so I can try the demo again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is prety good..combination of HEROES 3 and 4....with graphics\nRuns preety smoth  10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am super hopeful for this! A return back to how I remember Heroes of Might and Magic series being. Taking the good bits of 3, some from 5, then putting in some modern QoL stuff and the end result is a very snappy and satisfying game to play.\n\nMy primary gripes with the demo atm is the lack of tooltips explaining just some basic elements of your UI. Well, that and the fact that there's a lack of options in the map sizes. My preferred method of play is single hero, but it would be nice to have smaller maps available as I believe you can only pick L or XL, which are waaaaay too big for just 1v1. But overall, lets be fair, these are relatively minor issues. I love the gameplay and am 100% getting this game when it releases next year!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy it very much, from graphics to mechanics and atmosphere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely huge fan of the Heroes Of Might And Magic games.\nPlayed this demo and i loved it. For sure it is early to tell  because of some fixes that needs to be fixed but it is a huge upgrade from the previews.\nLooking forward to get it when it will be released.\nThey added a lot of mechanics and polished a lot everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Demo was pretty good! Game has a lot of potential and I'll be buying the full version when it comes out. Much closer to HoMM3 than HoMM5, and a lot of options for multiplayer in the full game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This really recaptures my nostalgia and love for Heroes 2, but especially 3. This can finally, finally do the franchise justice. For the first time in a quarter century. The devs got my hopes up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1 million wishlists baby, lets go!!!\n\nIt doesn't even feel right calling this a demo, has more content than most full games.\n\nCan't wait for the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AI map generator needs A LOT of work. I hope the devs include a lot of well-crafted custom maps. I also hope the devs include a very large campaign.\n\nI think the visuals are ok; somewhere between H5 and H6. I like the additional customization for heroes, units, etc... I do not like the new resource that you can't get anywhere; that needs to go.\n\nUltimately, the new resource needs to go. Other than that, just some balancing work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pleasant surprise for sure, definitely worth trying out this demo. Of course it's not a finished product, but already plays like a solid game. You can easily spend a few dozen hours with this. I believe the developers will learn a great deal by listening to the feedback. Performance is good, runs even on very week hardware. The UI is not bad but it needs some polishing for sure. I'd say the game is beginner friendly for the most part, but some aspects of the game are not well explained/shown currently. \nI'm not a big fan of the generic cartoonish art style but it functions well for the most part. The 2D illustrations look nice. But overall the visuals feel disjointed, like a clash of different styles, like it lacks art direction. Above all, please get rid of the intro cinematic which almost put me off from trying the game. It looks like a cheap mobile game ad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love HoMM, and spend over 2 decades playinng it regularly. This game is worthy addition to the series, but there are some things that can be improved. In my opinion multiple heroes strategy is overpowerd in Olden Era. Ability to give them 1 unit and explore the fog of war is very strong alone. Information about enemy movement, or location of important buildings is very precious. But now Heores can alsko take control of sawmills and stone mines, because they are often unguarded. And on top of that they can somehow steal loot from the monsters, this should trigger the fight. Second point is that there are no caravans. This only makes the game less fun. HoMM is about big battles and building your city, not micro menaging every little thing. This only gets worse after gaining control of multiple castles, and further pushes multiple heroes strategy. There ale arso some small things, like cities should have level indicator next to city icon on the side of the screen. Some buildings sholud be locked behind certain city level required, rushing high level units makes 1-3 level units feel worthless quickly, in H5 they were main part of first 1-2 weeks. Rushing economy also feels easy, especially with supporting laws. There are a bit too many buildings \"win battle to win something\", they are god for exploration, but after that are useless. Focus mechanic during battle is great addition, but spliting 3 archers in 3 units should not generate 3 focus points. Only 1 focus point should be generated by 1 unit type, no matter how many units it is splitted to. I am focusing on the negatives here, but since this is demo, this might be the most valuable feedback to creators. Olden Era is a good game right now, dont get me wrong. It looks great, music is very thematic, and battles are pleasant to play. 8/10 Would certainly recomend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all this is the largest demo I've ever played. The amount of content in the demo ensures serious replay value and I would gladly pay for it as is.\n\nAt first glance the game might look (to some) cheap and like a mobile game, but I personally love the graphics. The game has a good balance between old and new with many mechanics, creatures and objectives familiar to those who have played previous games with emphasis on HoMM3.\n\nKeep in mind that the pros/cons are of the demo!\n\nPros:\n* The game doesn't feel like a ripoff/remake\n* Interesting mechanics/progression that adds depth to the game\n* Game modes to fit various players (regular, single hero and arena)\n* Many QoL features (alt to highlight steps and objectives and such)\n* Improved combat AI from HoMM3 (less easy to predict)\n\nCons:\n* A few gamebreaking bugs that requires reload/game restart\n* Many minor bugs (conflicting information displayed, pathing bugs that causes extra move-points)\n* Lack of polish in some areas (some mechanics of the game feels almost hidden, notifications for plague week etc)\n\nMix:\n* Some elements/builds seem over powered (this isn't necessarily a bad thing)\n* The amount of mechanics was overwhelming at the start (but not to bad after a while)\n\nOverall I think this is an awesome demo but need some polishing before release, but I will gladly pay AAA price for this game because you can feel that a lot of love and thought has gone into the making this game. For me it feels like a second wind (pun intended) for this series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game looks very promising. I like the different game modes, especially the single hero mode if you want to play a shorter game. I can't wait to play the remaining two factions that are currently missing. I recommend the game to long-time HoMM (Heroes of Might and Magic) players and all new players who enjoy strategy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is looking fantastic, a great modernization of the classic heroes experience. The dev team has put a lot of love into this project, and is very receptive of fan feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best turn-based strategy came to come out in many years, and also the best Heroes game since Heroes 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(DEMO REVIEW)\n\nThis game, even tho it is a demo is a very nice and pretty game that kinda mimics the good parts of Heroes of Might and Magic 3, but ofc it falls short on a couple of creature comforts.\n\nThe law point system is either very nice or very annoying, depending on if you feel like a purist, or wants some new game mechanics.\nThe factions/towns are very well laid out and the creatures are very pretty animated.\nAlthough, i feel like the double upgrades are unnecessary and just feels confusing, especially when you want to buy said creatures and not the non-upgraded (Your choise resets after you load a save)\n\nThere are ALOT of things that could be so much better, and creature comforts that needs implementing (For the devs, check out the HMM3 Horn of the abyss mod and you can notice all the nice to haves mechanics)\nBut i really love to play this and THANK you developers for making a free and expansive demo that is geniually very nicely done. You do have a big legacy to live up to, but you have created something very promising <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the throwback to the older style in this series, but I really do feel like there's a lot of balance work to do. \n\nI'd love to see hero stats impact the battle a bit more. It felt like hero atk/def didn't significantly impact army damage. It almost felt like focusing on casting was a necessity for even melee specialized heroes. It would also be kind of neat to be able to set a \"goal\" for your hero to learn a specific skill on leveling up that would raise the probability of it appearing so that you can plan a little bit better, but that's wishful thinking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game seems to have potential, it just has to be polished a bit:\n1.the units in battle have to be scaled to be a bit larger, you can barely see any detail on them.\n2.when exploring make the resources / mines / monsters to fight / etc.. more bright and easier to spot, you can barely see anything on the map clear.\nFix that and make and dethrone H3. \nGood luck! I have faith in you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had fun playing demo. Still has some minor issues, but in general all new mechanics seem like a great addition to the game.\nCan't wait to play the full game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game! If you're a fan of the Heroes of Might and Magic III, you're probably going to love this one too.\n\nI love the art style, the gameplay, the music, and the variety of heroes to pick from. But most of all, I love the spell system—it's a huge upgrade compared to the original H3!\n\nI haven't seen the campaign or the full release yet, but from what I've seen so far, I am pleasantly surprised. Looking forward to the full release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is great -- but when you play the 1 hero mode, the death of a hero shouldn't end the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Things I like:\n+ Art Style is lovely and appropriate for the game's core fantasy\n+ The music for each faction's cities mostly does a good job of expressing that faction's fantasy; this feels most true for Temple, Schism and Necropolis, but less so for Dungeon\n\nThings I don't like / need improvement:\n- There are too many ugly / disgusting-looking heroes. I mostly don't feel like playing with Dungeon, Schism or Necropolis because most of their heroes are ugly. This is my biggest issue with the game right now.\n- Magic system feels confusing. I feel like I don't have a good grasp of which spells I can learn, which ones I can't, which spells my Mage Guilds have unlocked, or what level those spells are at.\n- The Alchemical Dust resource economy doesn't feel right. If I want to upgrade all of my creature dwellings at each city I need boatloads of Alchemical Dust, but it feels very hard to accumulate.\n- Battle victory screens should display Law Points gained alongside hero exp gained\n\nFinally, one point that requires more space than a bullet point, which is the PvE metagame. Ranged units are immensely powerful against neutral armies, because you can kill them without losing any of your own units; melee-heavy armies suffer increasing attrition, whereas ranged-heavy armies remain mostly intact. Temple excels thanks to its Crossbowmen, Lightweavers and Angels, whereas Dungeon, Schism and Necropolis struggle with melee-heavy armies. I know that Necropolis' Necromancy and Schism's Communion mechanics are meant to make up for this, but playing with melee-heavy armies still doesn't feel good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an old fan of Heroes of Might and Magic, having played the demo which is quite good.\n Im looking forward to when the game will be released. {was sposed to have been this year, ah well :(  }\nI have fond memories of Heroes Might and Magic 3 because back in the day of the ever fast pentium ( which were a couple of years out from the dos load up} the graphics and sound card back then were quite solid and good, as was the game play.\nH&H have come a long way and still producing a great all time favorite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow, I am excited.  HMM3 was my all time favourite but I didn't really get into the ones after that.  But this one, boy, I am a happy gal, its just like HMM3 but better.  The art, the music, the quick load times, the battles, the depth of game play.  I can't wait to buy it.  It feels \"magic\" and has all of the special ingredients that make me want to keep playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good! Just the right mix of H3 and H5. The Demo is great, probably one of the best demos I've played, contains plenty of content to test the game thoroughly. I'll get it on release on this alone. I like the Art, and the music is like H5's, you can tell Romero is there with all the Dies Irae :D\n\nThings i miss:\n- Mod Support would keep alive the game for years to come\n- Factions are pretty good, but as far as I can tell there are no plans for Inferno & Academy/Tower, which are pretty much staples of the saga. I'd like those, but it may be much to ask. So, refer to 1 for modded inclusions.\n- Custom Random map generation\n- I liked full rotation maps from H5 and their cinematic feel but that's just me. i like current state of things.\n\nThings that need to be fixed:\n- AI is inconsistent, sometimes great, sometimes sudoku's into enemies.\n--> I would suggest enabling AI personalities, and adding sliders for handicap and other things like that.\nNote: I don't mean difficulty here. The game is not difficult, just has to be played right. The AI is just very inconsistent, specially in the lower half of the gaussian (AI killing itself on 200% difficulty is unacceptable, but having it be very competent is not an issue).\n- Clicking is inconsistent. If you click in the 3D model of an entity (buildings and cities specially) it should place your target at exactly the entrance. \n\nBalance wise: I wouldn't care too much. The game will be broken either way, just like the rest of the Heroes' games. These can be fine tuned later, or even through point 1 (mod support).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome! Good old HoMam 3 with many new features and improvements. Already the demo was a full fledged game for me (I dont care for multiplayer) and I am enjoying it immensely, so I dont see why I should buy the full game :-D. Just kidding, the moment it gets released I buy and play.\n\nTrue, there are balancing issues, some skills/spells are OP, some are useless, there are exploitable situations too. I could also moan about the lack of ingredient that is needed for units upgrade and few other minor things that I dislike, but it is nothing that couldnt be easily fixed by devs or just accept it if they decide to keep as it is. The rest of the game is well worth the play already in the demo version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOMM Olden Era > H5 > H3. HOMM Olden Era It has all the aspects of the previous Heroes game, but this time it's more specific and detailed, and most importantly, it's made in a simple, clear way and has a vision. Furthermore, the development of hero skills, armies, cities, and the economy are all very well-constructed. Congratulations on HOMM's success this time, Olden Era FTW.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best demo ive played in my entire life. Cant wait for the early access. Keep going Hooded Knights.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A worthy continuation of the classic with interesting and pleasant improvements + promising co-op <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Fog of War\" refers to the incalculable complexities of combat—it is not unexplored and beclouded areas of a map; that is just fog. \"Fog of War\" should instead be a mechanic representing the limitless events possible in warfare.\n\n[b][i]\"War is the realm of uncertainty; three quarters of the factors on which action in war is based are wrapped in a fog of greater or lesser uncertainty.\"[/i] — Carl von Clausewitz[/b]\n\nThe game demo is great, just like [i]Heroes of Might and Magic III[/i] except the hero portraits are animesque.  It has that \"just one more turn\" feel and makes me want to play the originals.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wow, wasnt expecting much but this is good, true to form i would say.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Plagued with bugs. But even then - an awesome game! A TON of potential!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One should always be patient to see the extent of the developers' ambition, vision and ability to deliver with the fully realized version of the game. That being said, it definitely seems to be a promising and worthy spiritual successor to the legendary 3rd game of the series. - 9 / 10 - Highly Recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had so much fun playing it that I can't believe I spent almost 20 hours on a demo :v\nCan't wait for the full release back to my childhood!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excited for the full release! The devs have put a lot into this and as a loyal HoMM 3 fan, I think it has solid potential and I had a lot of fun playing the demo. Thanks for the free demo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Might and Magic for years, and finally they have created a brand new version that exceeds in every aspect. \n\nI cant wait for more updates and polish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best HOMM 3 remake I`ve seen so far! HOMM 3 is by far the best in the series, so great work! Cant wait for the real deal...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing the demo, my hopes are higher than snoop dogg on an average day... loved it! \ncan't wait for the release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played through the demo.. I have lots of hours in HOMM3 / 3.5. That is a high bar to clear for a well-designed game. \nSome thoughts with experience from HOMM3\n1) Olden era has multiple creature upgrade options. These add some versatility to play-style, but since you can only fit 7 stacks in an army, there is no value in having both. I don't see that getting much play. Lots of extra design for little benefit.\n2) The magic system - not only do you have to buy mage guilds, but you then have to buy and upgrade specific spells which are also resource intensive.  That makes magic-focused heroes and build much harder to make workable.\n3) Alchemical dust. A critical resource that is hard to get. Why not make it like others? It is tedious to go try to track it down on the map.\n4) I like the interaction with skills, where you get a benefit if you have some other skill. It seems like most of the skills are workable, which fixes an issue in HOMM3 which had useless skills.\n5) The graphics are great. I especially like the build tree which clearly shows connections between buildings.\n6) Please keep campaign mode! I like PvE. \n\nSome thoughts specific to the demo:\nIn high level play, you generally have 1-3 support heroes for your main hero. The support heroes are there to shuttle troops, collect resources and flag mines/creature dwellings. You are limited to 1 hero in one play style the demo, which slows the game down considerably. It also means you can't really try out creature from the new towns you've conquered. Try the other version.\n\nLooking forward to trying the full game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will I buy it, yes, when it's on a good sale. \nIs it worth full price? I don't think so. I don't have much hope for \"big\" (as in more than few friends) studio titles anymore. If there was no AI slop, I would grab it the moment it showed up, but this is a nostalgia cashgrab, chokefull of AI slop trained of fanfiction (It shows!) \nWas there anyone knowing the source material? Actual ARTISTS? WRITERS? Anyone willing to actually check what the hell a program barfed for the prompt? \nThis is full of AI generated content.\nEven the first loading screen has mistakes no artist would make. Not in such big title.\n\nDungeon's heroes can't decide if they are from Underdark, Morrowind or who knows where else. Clearly someone put some prompts working in other stories, and chose what looked cool but together it has no soul, no coherence. Animations for moving units are plastic, you don't feel anything. No weight, no agility, no power.\n\nAvailable Maps are like old school auto generated ones that just put some Poi around a city for player and filled the rest with terrain, there is nothing worth to explore, no soul, no story. Towns are placed without rhyme or reason, resources and units are just chaos, and loot's just placed everywhere. Let's wait for Campaign and MapEditor. Here's to hope the actual humans will create something worth playing.\n\nDoes it seems like I'm bitter? You bet I am. I loved Homm3, M&M8 Day of the Destroyer is my favourite game (I still play them!) and now I get them together but as a souless mismatched frankenstein carcass, AI washed to the point if there was no nametag added I would not recognize it. \nThe longer I play the more bored and disappointed I become a pity since there are many great ideas here, like Alchemical Dust or Faction Laws or how a Hero can act in combat. The Hive and even Vori Elves may pass if they show us how they got so corrupted. There is potential! \nPlease, Unfrozen, prove me wrong, make a good game. This is possibly last chance for Jadame to see a light of day before corporations'll burry it forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1][b][i]\"HOMM: Olden Era Demo\"[/i][/b][/h1]\n[h2][u]Overview[/u][/h2]\nI'm not a huge fan of the HOMM series, but the demo was extremely interesting to learn. And the initial tutorial pointed out the main mechanics and allowed me to recall others that can be controlled during the game.\nThis game feels like a remake of the third legendary part of Heroes of Might & Magic, in addition to some mods for new creatures and factions. Familiar objects, units and music - allow you to recall some memories from the past, which will further absorb you in to the game.\nDespite the lack of a campaign, multiplayer mode and a limited list of factions - in all other respects the game offers a full arsenal to try out - and that's cool.\nAs for the full release of the game - I'll have to wait a few years for the price to drop a bit :)\n[h2][u]Pros:[/u][/h2]\n[list]\n[*]Low PC requirements for a comfortable game, which will allow you to run it on most systems.\n[*]Three main game modes, which I only watched on YouTube, namely: Arena or as it is called in the community \"Luck Test\" (where we choose a hero, his talents, artifacts and army), Classic (I think the name speaks for itself) and my favorite - OutCast (Controlling only one hero throughout the entire game).\n[*]Wide variability in building your army. By gaining 2nd level for each unit, you can choose a certain specialization for your style of play.\n[*]Beautiful game design. Cities, map, units, artifacts - everything looks cool.\n[*]Additional characteristics to second-level and third-level talents. Which add even more variability in hero builds. My favorite was: \"You get a concentration charge when your units attack\" and \"You get a concentration charge when your units take damage\". A very cool combination that allows your units to almost constantly use active abilities.\n[*]A wide list of spells that I never learned in 15 hours, as I only used some of them. In the tutorial, there was an opportunity to gain an advantage in battle only due to spells and correct positioning, but in practice in a match - I never tried it.\n[*]The section of laws, which gives the opportunity to strengthen your faction, both economically and militarily.\n[*]The generation and position of items are sometimes hidden. Yes, you can press \"Alt\" and see all the active points, but it is quite interesting to study each fragment visually on your own.\n[/list]\n[h2][u]Cons:[/u][/h2]\n[list]\n[*]During battle, the hero's banner overlaps the display of the received damage for the unit in the upper corner of the field.\n[*]The menu for viewing equipped artifacts does not have a filter by sets. When you have a bunch of artifacts, you have to check the description of each individual artifact to make sure: \"Does it fit for set or not?\".\n[*]While the hero is moving along the route, you cannot use the right mouse button to view the map at the same time. The hero will simply stop.\n[*]Some spells and units do not have sound effects. That's what this demo is for - to fix all this.\n[*]The middle and late part of each match turns into a \"snowball\". And you are actually just collecting resources and strengthening your army, while the AI quickly calculates the outcome of each match (usually in our favor). In my opinion, it would be nice to have the need to enter the battle in manual mode in some cases.\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Добавьте генератор рандомных карт и в нее будут играть бесконечно)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very reminiscient of Heroes of might and magic III. if you loved that you'll love this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome Demo! Looking forward to support and get EA on this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just hope the campagin will be good and please add caravans from HOMM 5",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "First off I'm not recommending this demo at this time but I am still excited for the game and have a love of Heroes.\n\nI love we get an early access demo, I want this to be the best Heroes game ever but for that to happen I feel this is still a long ways off.\n\nVisuals\n- Low Poly 3D art style (think WoW Graphics) isn't a great fit for HOMM.  While it was done with care, it doesn't feel very well defined to me, it lacks that richness of detail and precision that really pulls me in.\nLet me show examples, with Dragons!  (clicking the links breaks them but copying them works)\n\nHOMM 3: https://static.wikia.nocookie.net/mightandmagic/images/f/f1/Blackdrg.gif/revision/latest?cb=20150211071110&path-prefix=en\nHOMM 4: https://static.wikia.nocookie.net/mightandmagic/images/8/8a/Megadragon.gif/revision/latest?cb=20140813174953&path-prefix=en\nHOMM5: https://static.wikia.nocookie.net/mightandmagic/images/6/68/BlackDragonH5.png/revision/latest?cb=20190429235046&path-prefix=en\nHOMM6: I refuse to give any credit to a game that had shark guards\nHOMM7: https://static.wikia.nocookie.net/mightandmagic/images/8/82/H7_red_dragon_model.jpg/revision/latest?cb=20170209154820&path-prefix=en\nOlden Era: https://heroes3wog.net/wp-content/uploads/2025/03/homm_olden_era_ashen_dragon.jpg\n\nTo me olden era is the most blocky of all of these with the least definition on scales.  I realize 3D has its own styles and benefits but it feels like this is made for mobile game screens, not for looking at in a close up.  So while the visuals of this game are occasionally striking it just feels like it stats to fall apart under close examination to me.\n\nFantasy is in my view, epic, rich, detailed.  At least the kinds I like, and what I liked in Heroes.  Like think Keith Parkinson or Todd Lockwood or Michael Whelan.  The Olden Era style seems more like a cross between that and like, Digimon to me.  It's just too simplified and toy ready.\n\nSounds\nThe music so far has not been memorable.  HOMM4 dirt theme and town music blew me away and still does.  I can't even remember the music after a session so far.\n\nThe sound effects are still missing because early access demo.\n\nVideos\nThe intro seems poor quality even by mobile game standards.  The shading is very strong but it doesn't hide the underlying work seems blocky and ill defined.  The first thing I felt when booting it up is yikes this is still really unpolished.  Not really how you want to start people off.  The aesthetics are also not very epic to me.  See the first section.\n\nI know I'm just being overly critical but aesthetics of this game feel unpolished to me.  There's still time.\n\n\nTownscreens and UI\nOverall the towns do look rich and pretty tho it can be hard to tell what is the structure and what isn't.  The structures used to pop and be very obvious.  Without the great soundtracks they also are missing a lot.\n\nOne peeve is, why does every unit box have some solid color background that seems ripped out of WoW design I do not know but it doesn't really make me feel like I'm playing a Heroes game.\n\nI haven't found the UI to be too bad to be honest other than aesthetics, though the small circle menu on units is not that great to interact with.  It's not obvious what each thing does and it feels crammed.  Nothing wrong with a text menu or dialogue box really.\n\n\nHeroes\nThe heroes are pretty central to the game.  I don't really feel like I connect with any of the heroes and the portraits seem to remind me of like, Age of Wonders or something, they are almost painted but not precise, and there's all sorts of things wrong with their structure.  It doesn't feel that epic to me basically.\n\nToo the heroes personality is \"Grow more crossbow men per week\".  Like give us a blurb of their story or history.  Give us a reason to root for them.  After I play the game to death crossbowman growth might be the only thing I care about but when I'm getting into the game that is far from the only thing I care about who are these heroes why are they here what do they fight for, what is their story.  Other heroes games gave that upfront.\n\nI just really didn't like or connect with any of them which is a big worry for a game called Heroes of Might and Magic.  Even being generic is less bad than this because it's familiar.  There wasn't even the go to of elegant lady or big strong guy.  Everything seems twisted somehow.  Maybe to keep it interesting?  But if everything is twisted that just makes everything the same doesn't it.  I really liked some of the heroes in IV, and in VII.  They were cool.  I haven't felt that about these yet.\n\n\nGameplay\nI've played about 3 games so far and I can say some of the things I like are there and sometimes the spark is there.  However a lot of the units have grayed out abilities which is just confusing.  I'm sure I can figure it out but this is first impressions.\n\nI like the focus on the combat though that is how heroes should be.  It's not just a game about the big map.  Speaking of maps the default ones we got for 2 player was not really that good to tell us how the game would normally play out.  You get multiple towns right off the bat, you get tons of units right off the bat, you get multiple recruitment dwellings, money comes in fast and you build fast.  Theres basically no friction or worries.  And it becomes kind of a pain to manage all that.  I had my fun on custom maps and stuff back in the day and I can say I prefer the slowed down default pacing of heroes at least as a starting point.  It makes decisions matter more and makes losing a single unit be felt.  So give us a traditional 2 player heroes map to test on please?\n\nBuying the spells is an interesting concept, but it will lead to flat games and meta spells just being what people go to and a flow charted gameplay.  Which is not great.  The randomness of spells made it a gamble to take a caster.  You might not get what you hope for.  You  might have to adapt and make the best of spells that aren't your favorites.  But you could always rely on might you know.  That was baked in.  It was healthy for the game in my view.\n\nThe artifact dust is meh to me, like, this has good intent but upgrading certain artifacts and the spell buying seems to miss the benefit of not always getting what you want.  Having a flow chart game is not that great.  It hollows the creativity aspect and adaption which is a lot of the interesting part.  People will be posting optimized path to get the best spell and artifact combos in any map and it will be all you play against.\n\nLastly, the spark is still not there like I don't feel that one more turn magic.  I think it's a combination of things.  The music missing definitely hurts, but so does having a hero to believe in.  The aesthetics are a constant drain on my enthusiasm too.  On the gameplay mechanics, I'm just not sure yet.  So I just haven't put a ton more time into it yet.  \n\nI am excited for the game to fully release and keeping close eyes on it I really hope this feedback helps you guys out, bringing the game back from the dead is a miracle and I'm super hopeful it will bring heroes back into my life.  I'll say this if your save system works you're already miles above Heroes VII in functionality.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Ten minutes was enough. The visuals are so dull and bland that I simply have no desire to continue playing. The units are \"yet another random fantasy unit.\" The cities are \"yet another generic fantasy city.\" Everything is dull, standard, and lacking any imagination or talent. For contrast, I looked at Heroes 2 and Heroes 3. Both games still leave this piece of junk with no chance in terms of visual expression. It's made without the slightest spark and, as many have already mentioned, feels more like another mobile hack.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h3] Demo-review: [/h3] \n\nI really want to like it, I do. But I just ... can't. \n\nI realise it's still a WIP, but oh my will they need to fix a lot for me to fall in love with it. \n\nDisclaimers out of the way first: I've played HoMM III since it released in the late 90'es and I still play it on GoG with the expansions and fan-mod (HotA). I love it. I think it's an amazing game and the attempts at making follow ups have failed in my opinion. The least dreadful (still just my personal opinion) was 5, but oh man, the loading times on that thing made me rage quit more times than I'm proud of. Also, I don't play on higher difficulties. There, I said it. Don't judge, I'm not judging you on your cravings for nightmare difficulties.\n\nSo. OIden Era. Hmm. I was excited by the promise of a Random Map Generator and sweet words of returning to the old. To be clear, I've seen a few bugs, but I'm not going to judge a pre-release on bugs,.\n\n[b]The Pros: [/b]\n- The demo is a very good size and includes both tutorials and free play. Respect!\n- Buildings, landmarks etc. are recognisable from the old games, with a slight twist. For an old fart like me, that means a less steep learning curve ;-)\n- I'm okay with the graphics overall, they're slightly cartoon-y, like WoW or Guild Wars. \n- It's an attempt at making a new HoMM-game and that's plus in my book.\n\n[b]The Cons:[/b]\n- As others have noted, it can be a bit challenging to see what's landscape and what's something you can visit. To further the complication here, the mouse symbols are offset, so if you want to know if an object can be interacted with, you need to mouse-over UNDERNEATH it. At first I thought people were over-reacting a bit, but honestly, it can get pretty annoying.\n- It feels .... sluggish. Not just the load times, which would have been a stretch even back in the 90'es, but the gameplay just feels ... sluggish. I'm sorry that I can't describe it any better, it's just everything from the way you move to the way you fight, almost feels like there's a tiny little delay on everything, making it feel rather slow.\n- Tutorial's great! - and horrible at the same time. No idea how they pulled that off. I'm sure you've seen people take a swing at the tutorial and I have to somewhat agree. It's certainly the first time I've needed a tutorial for the tutorial. What's there is good, but I feel there are areas missing.\n- Something about the upgrading of creatures bugs me like crazy. You cannot simply BUY an upgraded troop. You have to buy the basic (and make room for them) and THEN you can upgrade them. Separately. When you upgrade, there are TWO versions, but you have to upgrade to a set one first and THEN potentially change the upgrade. The \"overview\" of the two types is .... lacking, in my opinion. I might be missing something obvious, but I have to sit and mouse over the abilities etc. and then compare that with the numbers-comparison in the middle. I always feel a bit unsure what I chose and there is very little visible difference between the types. \n- As things are right now, whenever you send your hero somewhere, the path will be wiped between turns, so you need to remember where you were going. Needless to say I'm pretty sh*t at that....\n- Others have also mentioned alchemical dust. Considering how immensely important it is, this is one where I feel the tutorial was useless, as it just went through how you can use it for upgrades and probably mentions offhand that you can get it in different ways. I should probably revisit that part of the tutorial 🙄\n- I somehow feel like I'm missing .... hmmm.... not sure what the word it. Knowledge, information, overviews? Like, when I go to build my town, for some reason it's just not transparent to me how my troops will be or what the progress of my build is. Everything in the build path is twisting and turning and it just seems a bit muddled to me. I also really miss an overview of my creatures, including upgrades.\n- AI opponent: something is rotten in the state of Jadame. I had my two towns, emptied the dwellings every week etc., and suddenly my opponent popped through to portal and absolutely wiped the floor with me. I'd hardly had any losses at all, so how the heck it could have such a large army is beyond me. \n\n\n[b]The verdict: [/b]\nLook, I've only played for about 12 hours and I'm sure some of this is just a matter of a learning curve. But one of the elements I like about a game like HoMM III is that it's easy to learn, hard to master. This seems needlessly complex from the get-go and I confess I'm not the fastest at picking that up, so I'm definitely biased. The loading times are hard to forgive, period. But mostly, my review is basically triggered by the fact that every time I've played this, I've quit in some form of all-round frustration and then played a map of HoMM III / HotA instead.\nI don't know how much feedback the devs have gotten, but it's probably a lot. I am definitely following this, because I do feel that there is potential here, I just think they might be .... overthinking it. I love that they're trying and I really hope this grow into something better in time. I also respect their decision to move the launch. So I'm rooting for you, guys, even though I can't recommend this in its current state.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h1]Listen, this is a good game, but I have a lot of questions about graphics and units.[/h1] UI is somehow very good, but battle graphics are... Just bad. Redo them pls. \n\nAnd what's wrong with the creature names? Like \"bloated\" Arbitrators? And what's wrong with the lineup itself, why it literally has nothing to deal with the faction and why it consists of unknown game-invented creatures that makes the player feel lost? Like why a ctulthu-inspired Schism has only 2 actual lovecraftian-related units?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overloaded with weird mechanics that add nothing to the gameplay. Just boring..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had a problem how to review this demo as Olden Era is still in development and there is no Steam's neutral review option.\nWhile I enjoyed OE I am a singleplayer gamer first, so I decided to give \"not recommended\" review.\n\nFirst pros:\n+ It's not \"a mobile\" game, no matter what some desprate \"fans\" would want to you belive. It's fully HoMM game with its spirit. Sure, it's not HoMM3 game and hopefully will never be, as trying to emulate third part of franchise was never a successful idea.\n\n+ I liked it. There still is \"one more turn\" feeling from the demo. Heroes development is a much improvement from H3's times but still need a lot of work.\n\n+ Town screens have some issues but overall are beautiful and \"live\". You can see citizens moving around cities, something which was missing since HoMM1.\n\n+ Alternative creature upgrades. Just like in last previous games, you can choose one of two alternatives and change them during gameplay.\n\n+ Lots of spells and magic in the demo seems overpowered. They're not balanced yet and I find it's a good thing as nerfing things to the ground in search of mythical \"balance\" always leads to a game being boring.\n\n+ New magic system. While you still get random spells in magic guilds, now you can pay to research/unlock missing ones. You can also can upgrade spells by using resources or by building more guilds (each additional doubled spell count as another spell's level).\n\n+ Combat seems to be fun and units have a lot of nice and useful abilities. Same for each factions.\n\n+ Lots of artifacts which can be upgraded to be even more powerful, althrough you won't have much resources to do that in short games/on a small maps.\n\n+ Demo is very easly moddable and I guess the game will stay the same.\n\n\nNow cons:\n-  While there is \"one more turn\" syndrome, the game becomes boring very quickly. You test each faction, most of heroes, alternative upgrades, spells, etc. but after that, Olden Era doesn't have anything to hold you for any longer. Sure, it's a demo and not a full game but nevertheless you get bored very quickly.\n\n- Maps. There are not maps per se but random templates focused on PvP aspect of game. They fail for singleplayers as while there have plenty places to visit with your heroes, their main focus is to destroy enemies ASAP. Each starting zone in a template is also a mirror of enemy's starting zone, so you know what to except. You also start with additional neutral (mostly) non-protected city or two in your zone, plenty of mines and creature dwellings, and lots and lot of resources to level up your city and army very quickly. That's very PvP mindset and there is no time to explore whole map unless you really want and prelong the game just to do this.\n\n- While factions have unique units and mechanics, you play them as for now nearly the same. Sure, first week may be a little different but after that? Just gather your troops and roll out, crashing every enemy under feet of your army.\n\n- Battles. Current autobattles are quicker and you lost less troops as the game can't calculate real losses and just make the number up. AI is still not good and only win if the player don't rush at it as it can then enmasse more creatures from external dwellings and castles.\n\n- Lots of spell but not all are useful. Damage spells become less revelant as the game progress and overall they are weak. You also need to upgrade them to get their fully potential. While it's better than having \"x magic\" skill which makes a low level spell a mass version, it's still IMO inferior to magic system from HoMM2 and HoMM4, where mass spells were higher tier magic.\n\n- Too many artifacts. Most of them are worthless (common and rare categories) and you don't have resources to upgrade them as you need these resources to ugrade buildings in your cities. Artifact sets are also underwelming and not worth to complete.\n\n- Faction Law system. Basically a very limited research \"tree\" which you unlock with battles and town buildings. There is no relation between perks, so you only needd to unlock new level to be able to buy next perks. You can't buy them all so in the end you would always choose (nearly) the same laws. Laws UI is too small and ugly.\n\n- Skills and heroes specializations. Some are overpowered, other not worth to bother. There are five sub-skills for each skill but you can only choose two and sometimes the choice is so obvious, you just wonder, how this even passed during game desing?\n\n- Tragic UI. Too small and hard to read icons, icon colors that look nearly the same, buttons placed all around screen instead in one place, lack of information when you point mouse curson on it, lack of R-click options for many, many things, etc.\n\n- Adventure Map readability. It's hard to tell which object is a map decoration and which is visitable. There are also resources you just can't notice because RNG placed them behind some rock or tree. There is an ALT key to highlight them but if you need to press a special key to see a map object, then something is wrong with your design.\n\n- Creature and heroes design and portraits. It's hard to tell, which alternative upgrade you will fight and it was initially hard to tell, which creature you are buying. Fortunately devs changed a little that but the problem still exists. There is also a problem with portraits. Heroes portraits are hand-drawned (sometimes good, sometimes bad) but creature portraits are 3D in-game miniatures which IMO look worse. I think this clash of different graphic styles is the main reason why Olden Era is called \"a mobile game\". This and UI.\n\n- PvP focus. It's clear to me this game is first and mostly focused on PvP games. Map templates instead of Random Generated Maps or scenarioes designed by humans/devs (althrough devs promised these features will be in final game), game mods for PvP players, game focus on combat and not enough of map exploration, heroes development, economy, etc., all these just point that devs focused on PvP aspect of HoMM games, especially HoMM3.\n\n- Some red flags from devs behavior.\nEarly access was postponed IIRC twice and as for time of this review doesn't have a date.\nThere is also a case of devs calling themselves \"true fans\" - if you are a fan, you don't need to reasure yourself that you are \"true\" fan (do you need a certificate for this?).\nI find also strange that for \"true\" fans devs sometimes behave like they didn't play other games than H2-3 and 5.\nIt's personal opinion but I have a feeling that Olden Era started on backbone of H7 and went from there to build its own self. It's nothing wrong in but many \"new\" features of OE were already present in H7 or even earlier but Unfrozen somehow \"forgets\" to aknowledge this.\nOn the other hand, Unfrozen really \"hears\" the fandom and make lots of changes so it's not that bad but nevertheless red flags are here and can't be ignore.\nThe last of red flags is that Might and Magic franchise is owned by Ubisoft and while I have some doubts in Unfrozen, I have many, many more doubts in Ubisoft and I fear they can screw the game just before the release (like introducing a DRM) and devs would have nothing to say in that case.\n\nOverall I'm not against Olden Era and will see, how it would be developed futher but I don't recommend to pre-order or buy it in first day. Just wait and see.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The demo it is very buggy at the current stage.\nNot recomnend at all.\n\nTry demo and i stuck on infinity loading when i attack to an enemy castle and ofc cannot progress finish the map.\nGeneral the game is not give the old good vipe. Music especially it is very generic and bad.\n\nIn the end game has allot to improve before it is playable, expect demo is old version of it...!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game takes inspiration from Heroes 5, and includes many changes introduced by it, but fails to bring the most important change: unit action rate (which was tracked in Heroes 5 by initiative). In this game units take turns acting, so a zombie acts as often as a dragon.\n\nSome good features kept or introduced:\n\nUnits have two upgrades.\nHero skills have specialisations.\nHeroes themselves can reach one of two potential masteries.\nItems can be part of sets.\nHexagonal tiles in combat.\nMany creatures have usable abilities.\nBesides upgrading towns, players can also upgrade the realm. Some of these upgrades are shallow, but others can be game changers (for example, the ability to construct two buildings per turn)\nCastle fortification upgrades can also specialise.\nItems can be upgrades.\nThe graphical engine is really good.\nI liked the draft hero build and follow up battle mode.\n\nSome awful features, besides the lack of HMM5 initiative driven action rate:\n\nThe resource system was simplified, which is a trend in the age of games targeting the common denominator.\nCombat maps are tiny.\nIn-combat tactical deployment is basic. Changes don't save between fights.\nCreature dwelling units can not be recruited inside towns, like in HMM5.\nFaction differences are token at best. Nothing like HMM5. The system could not have been made more shallow if the developers tried.\nThe art design suffers from a \"samey\" look for units, compounded by units having mostly the same size and the same narrow colour pallet...\nThe art design suffers from a bland colour pallet. This applies to the world and combat maps. Things blend in and tracking what can be interacted visually is exhausting. One has to keep Alt pressed at all time to highlight interactibles.\nCombat unit abilities use a shared resource pool and have obnoxious cooldowns. Truly shameful compared to HMM5.\nHero skill specialisation are bland, shallow or both. Again, nothing like HMM5. The system was clearly an attempt at simplifying role playing and hero growth down to the mobile audience common denominator level.\nSpells are bland or just awful, again nothing like HMM5 or even Heroes 3.\n\nThere were other features I liked or disliked, but these were minor.\n\nAt this stage, it is unlikely that changes will occur to the more critical issues shown above, hence why I do not recommend the game. Play the superior Heroes 5 Tribes of the East instead...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Instead of Evolution, and improving the already good aspects of Heroes, there is just so much that is literally driving me insane. It is the convenience features, like being able to see initiative numbers in battle, right on top of the units, so you have to click like a slave, open each unit to check per hand, so you know that your Haste spell will or will not push your unit in front of the other in battle. \n\nAlchemy Dust idea... I absolutely HATE as resource, it just makes the game longer overall before you can even upgrade anything. The Focus points are a completely retarded mechanics... To even cast a unit spell, you really have to think about what you may cast, cause you probably won't get to cast a 2nd Focus spell. \n\nI am trying to log back in, only to get simply annoyed by how stupid some changes to the game are... Town Portal at lvl 4 Magic Tower and level 9 Hero, after this being pretty much a basic spell in H7. The game simply feels like a  unnecessary Grind... The gfx are solid, even tho the visibility could be better...  the usage of \"inspection unit window\" is strange, huge spaces are occupied by miniature units as far as sizes. The wanna be freedom you are believed you have, building a char, is restricting via. skills you either have to take for your subclass, or not, and miss out... \n\nAt this point of time, I can say I HATE this version of the game. I really tried hard to like this, it is just not for me. Sadly if Steam or Ubisoft connect would run H7, I would play that instead... I could probably write an essay about what is wrong with Olden Era, doubt anyone would read it anyway...\n\nTher game is MEH at best in its current state and by the time it may be fixed, I doubt I will want to log back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a very hard NO for me to give because I really want for this game to succeed and bring back HoMM to modern age gaming, and thats why I'm not recommending, because I think they are on the wrong track on so much of it, clinging to the standards of a long forgotten era...\n\nI know that it is a Demo and the game will still enter early access before a full realese, but I post this with focus on the TRACK they are in, that I'm not totaly into it...\n\nFirst, the good:\n\n- Game is beautifull, loved the art, it is really something they achieved here, the animations, the map, the spells, the units, really nice looking and RPGyish, I could apreciate some units animations forever, the hero portraits, and the cities.... God, every time I open a City interface I stare at it for 4-5 minutes before doing what I was to do, It really distracts you, thats really something!!\n\n- There are lots of spells and skills to master and the hero specialization seems interesting, the magic schools and spells are great and I liked the Mage Guild mechanics with the Alchemical Dust. but it still needs more... maybe uniqueness for each hero, I don't really know what to point here, but it is on the right track\n\n- Factions have their unique atmosphere with their cities and units in their terrain with unique PoI for each, I practicaly said that on point 1 but it really needs mentioning again, very well done.\n\nNow the bad:\n\n- There is too much POIs and yet too little... It transforms the exploration into a Slog Grind. example: there are regions with unique dwellings for hiring units that improve growth in cities as well, like the quiet pavillion for hiring ghosts or Crypts and Graves for skelletons. But there are a LOT of them, like..4 for skelletons, 4 for ghosts, 2 for Hounds, 1 for liches in 1 city region, if you get 2 cities, be prepare to plan circuits to recruit troops from 15-20 of them every week, not even 2 Idle Heroes could do all of them in one week... And that goes for every other PoI too, too many of the samey collectables that restock weekly, too many of the samey XP gaining, Skill gaining, etc. Make them fewer and more impactfull each ASAP, or one game could take dozen hours of uninteresting exploration even before encountering the first player/AI... I want to be for the most part of the game battling units and not recruiting them...\n\n- Give us some unit type specialization layer in the game. I'm not even talking about artificial caps that divide the community, but make it possible to exchange growth of some units for others or that only some of them could be upgraded per city, or exalted in that city (e.g. Only Skelletons and Liches can be upgraded in this city, this is the SEKLLETON CITY) This would give great strategy replayability to the game, with the same faction I could build it around 3-4 units, or even all in in one or 2. Let's think, why cant I build 7 Skelleton Crypts in a city instead of building the dwelling for each one of the faction's 7 units?? I know some heroes have unit specialization and thats nice, then let us compound on that with the city builder layer! Today it is very similar to HOMM dullness -> To get the most growth of everything as soon as possible, put them in a single army and steamroll the way to the victory hoping your enemy lost more units and recruited less than you, cuz if not you already lost and don't know it....\n\n - Factions are bland... I know I said they were atmospheric and unique in their way, and they are! Visually.... Atmospherically.... Now Mechanicaly?? They are not! Each one play exactly like the other apart for the type of damage they do. Start a game with one faction, recruit one of every unit, contemplate their pretty animations and some unique abilities and thats it...you see all that was to see for it, lets try the next one, after the 4 there is little incentive to play again (or even to finish the 3 other matches that no one could end because all the time was spent recruiting units in 20 dwellings untill one got done with it... Give us some different buildings that do different stuff, there are only 1 of the kind and not even for every faction, and it introduces a dull system of passing a day for gaining skills... When I saw \"Well of Souls\" to be built in the Necopolis city I got hyped \"Now that will be interesting\".... It turns out it just refill bypassing heroes mana...\n\nI think that the most of it. I reaaaaally want to change this review and buy the game at full price if it turns out to be great in the release, this game has the potential of an ERA to spiritually restore the Legacy of HOMM. I loved Unfrozen's IRATUS game and know the capacity of the developer behind Olden Era, so yes I'm requesting more, because I know the master piece this game can be",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overcomplicated in a bad way. HMM3 was a legend because of predictability and strategy.  This one unfortunately has so many uneven ways that make it random.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This review is in English and Slovak language:\nTáto recenzia je v Anglickom a Slovenskom jazyku:\n\nAfter a very short period of enthusiasm for the new Heroes of Might and Magic, I'm currently disappointed. So far, it just feels like a graphically improved old game with a map blown up to enormous proportions. I hope that changes soon.\n\nPo veľmi krátkom nadšení pre nové Heroes of Might and Magic, prichádza momentálne sklamnie. Zatiaľ mi to pripadá len ako graficky vylepšená stará hra, ktorej nafúkli mapu do obrovských rozmerov. Dúfam, že sa to čoskoro zmení.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had fun, a simple classic TBS.  Which I cannot recommend atm.  3 game breaking bugs I have uncovered.  1st hero leveling option page where you select attribute or skill.  2nd casting id npc spells when no fow left. finally a magicall item called ''golden goose egg'' Leveling that item high will break & all of these bugs either freeze / corrupts that instance and you will have to load an earlier save or restart game.  Hopefully they will fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I couldn´t get past my first game. Everything looks like an updated heroes 3, but carries pretty much every single problem newer heroes had and adds a bit of it´s own. It´s grindy and yet with little to now feel of reward, AI cheats even worse than in Heroes 4 and while the various abilites are cool concept, most of them turns out to be meh at best. And necromancy sucks so much it´s pretty much useless. Shame, I was hoping for a proper new heroes but this is not it for me. \nI guess if you enjoyed the later installments of the franchise you might enjoy the game, but to me it´s pretending to be something it definitely is not.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Inferior to HOMM3 and even inferior to Kings Bounty: The Legend. Fewer castles, fewer biomes, too many menus, too many buttons, overcomplicated and not very good UI and bad performance. Sorry",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do you take an almost 30 year old game and throw it on its head? Twice my main party was stuck inside my keep and i could not get out. I just cannot even begin to state how cringe i feel about this games re-release.\n\nThis is like messing up tetris, it takes a ton of skill to be able to pull that off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2nd mission of the tutorial. told to go down the road and fight the enemy hero and use the teleporter. The road is blocked by trees. Neither of my heroes can interact with the trees and move forward...\n\nI just don't understand what they want me to do.\n\nMusic is fun. Game play reminds me of HoMM3. But if you can't code a tutorial to teach me your game why should I trust ya",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have recently been playing a lot of HOMAM 7 and I was excited to see this new game coming out.  But after trying the demo I can say that I probably won't be playing it.  The Elves have lost their own faction.  The hero skill tree leads you blindly by the nose and leaves no room for creativity and methodical planning.  Although the artwork is slightly nicer, it's clearly overly embellished.  It looks like all of the interests have gone in reverse from the original concepts that made the game great.  \n\nThe struggles of the game's continued success before now were not due to the marginal differences that it seems this new development is focusing on.  The struggles of the game were because of how methodical you would have to be, and how long a game could take... and how crappy it is to play against a computer because the computer would be using data that it shouldn't rightfully have access to.  For example.  A computer would know the second you take your main force off your base, despite having never ventured over to your base.  Purely Enraging Design.  \n\nIt's pretty sad to see to see games being made by people who have no heart to even play them...  Because they make drab games. \n\nWhat this game needed was more race specific factions.  The more the better.  Orcs, Elves, Undead, Goblins, Angels, Demons, Humans, Halflings, Drakonids, Avians And perhaps a race that lets you mix and match character types from each of the others.  But God forbid you all figure out objective game-balance theory. \n\nThe game also needed to Trivialize the other heroes, and make their routines designated and automated so that people aren't wasting time trying to think from the perspective of multiple heroes, anything over 2 is too much for the common person imo.  \n\nFor example, one hero is the resource runner, and will run it automatically until every resources in a DESIGNATED AREA is claimed.  Even allowing those heroes to explore the FOG of war for you in an automated fashion.  \n\nI think it would be wise to make a few archetypal hero roles, two of which are actively played by the player and control army forces, and the rest should be mostly automated.  The Militant, the Governor, The Economist, the Diplomat, and \"Priest\" class (which would probably be rebranded per faction group.)  The priest would bless the troops with magical armors, and attack buffs specific to the tree of magic that the player would ideally get to freely choose from.  \n\nPeople should be able to choose which 2 of these 5 to lead their armies, and heroes should be capped at 5 total from up to 20 or more per faction.  (These hero types need to cover a variety of personality types so that people have characters that they can self identify with)   Only 2 Heroes should be designated as fully playable and the other's appear under their specific roles only.  Like a priest to appear and apply a special blessing to the troops, etc.  The three non-fully played heroes take on a more simplified position but still HIGHLY SIGNIFICANT in terms of buffs, economics, and diplomacy.  And diplomacy should be reworked to allow the diplomat to speak on behalf of the army forces, without requiring them on their person.  And so much more.  Diplomats could at first have to travel in a special carriage, and maybe be escorted by the troops manually for safety, and maybe later on through upgrades get special flights to designations via Gryphon or Dragon-back. \n\nThis is just off the cuff here.  I'm gonna go back to HOMAM 7 until the absolutely despicable tactics of your AI systems frustrate me to the bitter end of my enjoyment of living out the themes that resonate with me there.  Which wouldn't be a problem if the development studio had figured out a way to make the game play a bit more quickly so that the PvP against other people wouldn't be so intolerably slow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am writing this review as a massive HOMM3 fan, so perhaps it is doomed to be a bit biased from the very beginning. The game has generated a lot of hype recently and I do love the way they are promoting it, especially in terms of their YouTube channel. I do think that the creators have very big shoes to fill when creating a game for this franchise: it is very hard to encompass all the good things about the previous games while still trying to make it feel new, exciting and unique.\n\nGraphics and UI\nI did not like the style at the start at all, but it has grown on me a little bit… I do have to agree with a lot of other gamers and say that it does look a bit “mobilesque”. The graphics on the world screen seem too rich and detailed at times and I know it sounds silly but it just feels overwhelming at times. HOMM3 had that “dark” feel to it that kind of made the game more serious. This one feels like it was designed for children. For me, it’s sometimes extremely hard to distinguish interactable objects from the background and I find that I would miss certain objects as they blend too much into the background. I never had that problem with any of the previous HOMM games. I would like to see a lot more sharpness in the design in this regard.\n\nTowns\nThis is quite a disappointment for me in general as all towns sort of feel the same, just different colour pallets. In general, I think a lot of buildings look like figurines from some table top game, just looks fake and out of proportions. Towns also lack sharpness, I feel I’m not able to distinguish if a building is a dwelling or if its just background. Some dwellings have extremely poor designs as well, for example the Dungeon dragons live in some sort of a temple (?) that looks way too small to even house a single dragon… Why not have giant caves in the back that you could zoom into and have them flying there in the background? I know it may seem too similar to other HOMM games but I think that would be hundred times better than the current tiny temple. For me, all towns just feel a bit cluttered and lack that grandeur that we all love from the earlier games.\n\nHeroes\nI would like to start by saying that I do like the variety of heroes and portrait designs that they have at the moment. Hero backgrounds are missing but I do feel like this is something that will come out eventually when the game is released as it’s probably one of the last things on the developers to-do-list (fair enough but I am hoping for decent stories and detailed backgrounds so we can fall in love with these heroes!). However, some heroes are clearly stronger than others and I feel like there’s a lot of imbalance currently. For example some heroes start with very powerful spells, while others have more limited abilities that may only be useful at the start or end-game. I think the worst part for me is the ones that specialise in units: at the moment, all heroes have the same stats and growth for the unit that they specialise in, e.g. the hero with Skeleton specialisation adds the same growth (+2) as the hero who specialises in Dread Knights (+2). Moreover, both of these heroes boost their specialised units stats by the same amounts, i.e. 1 speed, 1 initiative, 20% health and 1 attack/defence for every 3 hero levels. I think it needs a bit of balancing, especially for the growth part as +2 Skeletons/week surely does not equal +2 Dread Knights/week?\nAnother imbalance lies with the town specific hero abilities I think – while I love the fact that heroes have a unique skill depending on their faction, I do not think that they are quite right at the moment. For example, Temple faction gets Ascension, which grants benefits whenever one of your stacks die. So in order to get a benefit, one or more of your stacks need to be completely wiped out first. If the stack does not die, no benefit. In reality, you will be forced to manage your units in a way so you have a lot of 1-unit-stacks so that you can maximise this skill. Might work well at the beginning of a game, but I am not sure how well this might go at late game. Sounds like a lot of micromanagement for me… Other factions seem to have a lot more straight-forward passive abilities, that don’t really require you to do anything major, really.\n\nUnits\nVisually, in general, I think a lot of units lack sharpness. A lot of them seem very detailed but it’s actually impossible to see all that detail in reality. What I mean by this is resolution and details seem out of proportions. For example, the Cavalry unit in the Temple faction looks like a cheap plastic figurine. Extremely poor design. It makes me not want to even recruit them, I can’t stand the current design! Other units, however, are quite well designed, like the Vampires or Angels. Sentinels of Glory though, seriously, what is that design? They have wings growing out of their hips it seems? No. In general, very hit and miss in terms of unit design.\nAnother thing I don’t like about the units is that the upgrades lack uniqueness in most cases. This game allows for two different upgrades for each unit but for some units it really doesn’t matter which upgrade you take, your choice will not have a big impact whatsoever. I think this is a missed opportunity really as they could have done something similar to HOMM4 where the choice of your upgrade was permanent and so it did really have a massive impact on your play style. At the very least, they could have made upgrades more different in terms making units melee/ranged, spell caster/ranged/melee, tank/assassin and so on. At the moment, most of the upgrades just feel very similar and boring, why even bother with two different upgrades in this case?\nUnit abilities and the Focus mechanic, in my opinion, is a complete mess at the moment. While I do think the Focus mechanic is interesting, some units abilities are clearly better than others, so you will end up never using them, e.g. lower tier units versus high tier units. I think some Focus abilities should just be remade into passive abilities/spells to be honest.\n\nMage guild/magic\nWhile I do like the current system overall, I think it has its weaknesses. For instance, spells can be unlocked for resources, which is fine, but the problem for me is that some spells are clearly stronger than others, so players will only unlock the main meta ones in reality. The randomness that came with the mage guild is something that provided that excitement I think in the previous games; in this one it just seems a bit too easy and too accessible. I miss the unpredictability!\n\nLast thing I want to mention is something that I absolutely hate in the current version of the game, the Alchemical Dust. This is a super annoying resource that you can only find on the map, trade via a special building using your precious resources or gain by disenchanting artifacts. I played many maps at this stage and I never seem to have enough of this material, which is very frustrating, as this resource is required for certain town upgrades and also spell/artifact upgrades. I do honestly believe that exists only to add that “grind” factor to the game to make it more difficult and never ending. It’s a completely unnecessary aspect in my opinion. Either make it more abundant, especially in late games, or make it more precious to acquire but only needed for artifact upgrading. Also, some artifacts seem like they can be upgraded an unlimited amount of time, something I do not approve of. I like games to have finality, some sort of framework. Designing something to have no end I think only creates that unlimited grind possibility, something which I am not here for to be honest.\n\nIn general, I think it’s a very good attempt at a HOMM game but I do think it still needs a lot of work regarding different aspects of it. I have approx. 30 hours played at the moment and I am already bored. Will I buy the full version when it comes out? I honestly don’t know, perhaps when it’s on sale...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It looks pretty and has familiar mechanics, but there is not much substance in the demo. The tactical combat is slow. Map locations that have already been completed aren't obvious at a glance and cause clutter. Conversely map locations that are beneficial to visit again are not flagged so there is lots of clicking around to check status. There aren't any meaningful trade-offs or strategy in the city upgrades. A lot of the mechanics around unit types and magics are rendered irrelevant  because you can just create huge unit stacks. Upgrade/downgrade of units for different attributes is interesting but kind of annoying since you can accidentally downgrade when you didn't mean to and the unit level art is not always obvious at glace as to the good-better-best rank of the unit etc. etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay feels like total war's campaign map on a phone, the audio sounds like a generic MMORPG kit, but the art style is okay. Just feel a 'why bother' moment with the learning curve. Not for me",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know its Work in Progress but ... they should change direction of some critical parts in order for this game not to be a mess !\n1.  Units/ Creatures: \nfor now I gonna take 1 faction as example. In necropolis vampire lords are strongest unit ? they always were lesser tier behind liches. Bone Dragons were exchanged for lesser undead Pets ... what the hell ?!?\nWrights looks pathetic bland copy paste from heroes 5, Zombies looks boring as hell... i want real scary zombies, not this high fantasy variation !\n2. Theres too much points of interest on map ! im talking about places where you win battles and get prices, this just chokes pacing and makes game stale, in h3 your motivation was to get resources silos, get artifacts, become stronger while capturing dwellings, collecting chests, and rush to enemy with what you build. It was perfect pacing, now with dozen of point of interest it takes 10x more of your time. You could say i just could ignore it and rush it, but i cant because enemies are too strong, so u are dependended on this waste of time... Solution ? make enemy creatures weaker, remove tons of unnecesery dwellings, points of interest which just waste your time and space in map, fill it with more trees, decore and treasure guarded by enemy.\n3. Make maps smaller !\non h3 i like to play small maps because it takes small amount of my time and i like the rush but here... these maps are like 3x larger .. easy fix, just rename map size and add smaller size\n4. city interface is uninspired and too simplistic ... and i just hate alternative upgrades for units.. it waste your decision time and is very unnecesery . if you could choose skin for your units like in Starcraft 2 that would be quite fun actually and if game was successfull it would be fun part to unlock them or do microtransactions\n5. graphics. i know its work in progress.. but as for know im not much intrigued by design... especially for necropolis zombies, wights.. Design looks too much cartoony, has too much lighting, like for little kids playing mobile games... common !!!!!! just look at glorious models of heroes 2.3. they were simple yes, but looked great. Songs of conquest did it way better, but overall i dislike their too much pixelated design.. but yet they did serious artistic interpretation and its shows.\nPS I wish you well but if you really want success and applease the fans, you should not make these things half assed and need serious consideration in mentioned sections. I love that you brought music back, original resources (thou i should say i dislike new added resource which is distracting), i love how you made map interface, little animations, fog of war ... but i feel its just gonna be rushed half ass game as usual in heroes franchise and gonna go back to play h3 instead unless there gonna be big changes..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2025 HoMM3 remake-trying-to-be-standalone game:\n* generic mobile game aesthetics: ✅\n* uninspired, flat and hard-to-distinguish-one-from-another 3D gfx: ✅\n* flat and generic UI that's barely legible, hard to use and that doesn't even have all the functionalities present in HotA and has usability problems (hard-to-click hotspots, icons too small etc.): ✅\n* abysmal loading times: ✅\n* unneeded additions and complications like more buildings generating income in cities, double-upgrade system (that either allows two same-y upgrades so it doesn't matter which one you choose or one OP and one lame upgrade so you always select the same), new resources that are just a chore to mana, more complex hero skills that still provide nothing, more skills on units which you'll ignore since you auto-combat, swinging town view making you seasick etc.: ✅\n* preserving all the things that should rightfully die like once-a-week-visit-me-please hotspots forcing the player to have a horde of purely logistic heroes yet providing no way to mitigate hero movement micromanagement with no complex planning/preview options, rushing being the only reasonable option in most cases etc.: ✅\n* huge resource hog burning my laptop even on vsynced 30-FPS cap and lowest details, even though gfx looks crappy and illegible anyway: ✅\n* stock and forgettable music: ✅\n* unneeded random renames of same-y stuff like some buildings and units: ✅\n* hard to learn but easy to master: ✅\n* almost complete loss of the original vibe and neatness: ✅\n\nAnd yeah, it's somewhat playable, like a poor clone done by people who SEEN HoMM3, but never actually PLAYED it, neither casually nor as a pro. I'd give it a 5/10 by itself, maybe 6/10 due to nostalgia. I'm not a fan of Songs of Conquest, they do have a lot of problems, true, but they DIDN'T have access to HoMM IP, and actually managed to have a couple of fun inventions instead. Here, you have somethings that is just not able to hold a candle to HoMM3, especially in the HotA era.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not think it is worth buying judging the state of current demo. However, most of the issues I see are fixable. If there would be good progress, I would change my review.\n\nSome details:\n- Gameplay is nice, it is mostly borrowed from 6 and 7, excpept for hero leveling, which is similar to 5\n- Graphics are horrible, this is on the level of mobile cash grabs\n- One of the worst UIs I have seen in last decade\n- No optimization whatsoever. With graphics on level of heroes 5 it consumes similar amount of resources to a large scale total war battle",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a long-time HOMM fan, playing Olden Era just makes me wanna play Heroes 3 or Heroes 5. So yeah, personally I consider that a failure.\nToo many resources everywhere (easily fixable I guess) ; but more importantly I dislike the graphics, too cartoony/mobile and therefore un-immersive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As someone who has played HOMM 1-7 and completed the campaigns in every game, I will recommend everyone to skip this one. Not only is it a major step backward in terms of graphics and music accompaniment, but the NPC players are given massive advantages over human players to the point of making it a giant waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of shiny things to collect, but the challenge curve is terrible. You'll maybe have a few actually interesting battles in the first week, after that you just auto-resolve everything and mindlessly hover up the loot while you wait for your cities to produce enough troops to take on the AI player's stack of doom.\n\nI tried cranking up the difficulty but it barely seemed to affect this tedious dynamic. So once I played a few games and saw most of the shiny things once, my motivation to keep on playing simply tanked.\n\nMaybe the series changed, maybe I did. If nostalgia is your thing, your mileage may vary. I'd rather spend my time and money somewhere else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Olden Era - is not a HEROES of M&M and not a numbered part. This is hybrid of Kings Bounty: Legend (2008) and Heros 5 + Hota (fan mod for Heroes 3). Unfrozen trying to trick fans by name of Heroes, but its not in one pixel! Its quality of mobile game, maded by AI. I was waiting fot this game and were ready to forgive a many things, but this is a disaster. \n- You can found in internet a greatet AI work, with Heroes: each creature has own separate world, hundreds of points of interest, touthands of details, every fold is visible, colossal cityes, million houses, - which together create a world of high fantasy in 8k resolution. True fans  draw a masterpieces in 100 times better, than AI \"created\" here. Fans expect classic and new-generation mechanics for battles, large action scenes by one click, battle magic and exploding catapults, units falling from walls, like in Lord of the Rings, etc. All this in free access so it is possible to create a \"World of Might and Magic.\" But nothin of this you will found in Olden Era. \n- PHILAN SYKES created iconic style of Heroes 3, genius artist, who influence on fantasy genre, video games, and mass culture. Nothing impress me more in my life. She was inspired art of Boris Vallejo, Rowena Morril, and other fantasy artisian. This is immortal style of book illustrations and oldfashion movies and iconoc RPG from 90-2000s. This is epic, and true spirit of high fantasy: its exclusive, pretentious, tedious, overly perfect. Unfortuntleu, Its a terrible shame in history of video games, that Heroes was really worked hard only one time, in 1998. Since then, last 30 years, no one tried to reach same highest quality. Maybe someone don't notice, but every sequels aren't Heroes 3, no matter what typed on a poster. Unfortunately, this happens to many series, that makes fans yearning.\n- Only Heroes 3 I can call the bible of turn-based RTS/RPG. This has simple 2D images, but so profound meaning - its unimaginable! Secret is not in form, but in imagination.\n- Heroes 3 was made in USA, by american way. It's a myth from an american sight, and there's a special logic. It's also a direct continue of Might and Magic rpg series. Unfortunately, New World Computing sold the rights to Ubisoft - that was one of the biggest mistake in videogame history. European companies are famous for making low quality games (which called \"European trash\"). That's why all other Heroes sequels has nothing similar to original. Hundreds of studios tried to compete with Heroes 3 and failed, because fans has zero interest! Who could only think, to give rights to someone else from a far? For series the best way is return back home. \n- Main question: would I play a game that doesn't have same illustration style from Heroes 3? NO! Am I interested in cybersport? NO! Do i need silly numbers and competitions in a scenario fantasy game? NO! What do everyone need? Heroes 3 and only Heroes 3.\n- Olden Era looks awful. The visuals are disgusting. Units are identical. Interface is confusing. The models look like porcelain, everything is so silly, thick, and murky. I recognize a lousy quality of models from Heroes 5 (2006). Style of castles, units, heroes is annoying. Everything in the scene is gather in one jumbled mess. I can't figure out what I'm seeing on the screen. This isn't a Heroes 3 illustrations. It's a mobile heresy.\n- Battles have maded shorter in favor of session games. The map's usable area were made smaller and there's nothing to explore. The game quickly pushes you to follow paths up to the enemy, like on branch of tree, but it doesn't work. There are 9x10 hexes, but not 9x15 as it was. Battles are faster and silly, and less tactically profound, similar to Songs of Conquest. It's very primitive, not progressive or modern.\n- Heroes is only scenario maps game. Medium maps is fine for session match. There is no point to make whole game \"сuted\". There is other way to make XL map faster to \"session standard\". Forget about cybersport - this will never be in Heroes. Hota is fan mod; aren't game designers. Mirror maps like Jebus Cross are disgusting. Heroes is game about fun matches with 1-5 friends, where the main focus is adventure and exploring, and balance is complete chaos.\nVERDICT \n- Game can best be described by characters' portraits - it's trash, garbage, disgusting, cheap, 0/10. This isn't Heroes! I played it a couple of times and turned it off, without finishing it.Prediction: a fail at test stage. Solution: cancel project and re-work everything from zero in the style of Heroes 3.\n- Unfrozen fans of Hota mod, but they aren't RTS/RPG gamers; they don't understand the story of Might and Magic, and other RPG. Developers should played Heroes 30 years ago to grown enough to make a sequel. Unfrozen's Director Denis Fedorov claims, that his favourite game is Kings Bounty, and Heroes is similar to it. But its not. He dislikes high fantasy style and like fairy tale style of Kings Bounty. Artistian trick everyone and sell his art in minimalism style, that has nothing similar. This all a disaster. \n- For some reason, Unfrozen keeps using name of \"Heroes\" - it's wrong. Change it to King Bounty and everrything will be fine. Unfrozen is trying to made a money out of mobile game, and bought mobile engine from Asian studios. Ubisoft should hire a true fans, who able to made a same high quality sequel, as original Heroes 3.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit demo, no explanation of anything what so ever. you would think they would want to tell you how to play the game but nope. dont even get very good tool tips. based on this demo this game is going to bomb on release. no reason to create a demo and not tell people how to play it......here ya go figure it out on your own cause were to lazy to tell you how its intended to be played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are terrible.  I have all graphics settings \"High\" (GeForce 2070), but everything looks fuzzy on my 27\" monitor at default res(1920x1080). I can't tell what some many of the icons are on the world map. The battle map is equally \"fuzzy\", as if the units are pixelated. Maybe the devs didn't consider some of us still have old PCs.\n\nCombat is typical HOMM, with very little tactics.  I was really hoping they would make combat more engaging, but it's really not. I've played many, many strategy games since HOMM was king and the combat was far more engaging.  HOMM combat is now too simplistic and boring.  There's no elevation, cover, etc.\n\nIn it's current state I doubt I'll buy it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't like it ... they said it will be more like the old HoMM3/4 which I loved to much but the demo was so confusing, I couldn't handle the GUI at all.\nKinda dissapointed\n\nMany ppl seem to say its like HoMM5 which I for one didn't like ... I started with HoMM (1) and played almost all following ones especially 3 which I played for probably 8 years but everything after 4 was just bad for me and even 4 wasn't as good as 3 even though it was almost the same ^^V",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute dumpster fire. The whole idea of HOMM was strategic planning and development. WTF is this random shit??? You get random skills, random team, no synergy, no logic, nothing. The you put against AI with fukin 5times stronger army that sherds you in 3 rounds. WTF?? fk this useless remake, I hoped it wont be garbage, but what a disappointment",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Feels a little weird considering the older games to this now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Looks good but not a fan of the new mechanics..big meh for me and i played the hell out of HMM 3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not even close to HOM3. Too modernized",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i get a black screen when trying to enter town :( cant play anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "id is a feather signature log\n\nmeh...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thanks for the demo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you know and love Heroes of Might and Magic 3, prepare to be very disappointed:\n\n- Unity engine garbage : first playthrough = first full Windows crash. 100% GPU usage most of the time for quite simple needs. Had to hard reboot computer on a stable and good PC (no potato).\n- Cartoon / childish graphic style, nothing similar to Homm3\n- Map: Far less detailed, beautiful, and vibrant\n- Units are ugly and very generic (barebone cell-shading)\n\nFinal recommendation: Avoid it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BRING BACK OG HEROES 3 STYLE\nno that mobile verision\n\nhttps://www.youtube.com/watch?v=GCZ-bbXSFFE&t=503s",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm not sure how to feel about this game. There is solid core there but it feels like everytime the game tries something it falls short. Feels chaotic and like the devs are more like a hydra where one head works on it's taks and doesn't even know what the other heads do.\n\nUI is a mess of a design, whether the hero portait is blocking info when attacking a unit beneath it or the abundance of huge buttons which somehow look very same aside from the middle icon making it not very clear and cluttered. Unit UI is also somewhat hard to read. The icons are much less clear compared to Heroes 3 and especially Heroes 4 where specific abilities were clear to undestand from a single look and very clear and to the point descriptions.\n\nUnits are a mixed bag. On one hand some designs are genuinely impresive: Dungeon dragons, medusae or hydras are a treat while the infiltrators and dancers feel lackluster. Also the fact that they are genuinely small compared to the map the fine details are lost. Heroes 2 to 4 had very detailed and clear unit designs and even now Heroes 3 and (I can't believe I'm saying this) Heroes 4 had very much more recognisible AND detailed units since they were bigger and much more prominent on the map. Olden Era units look tiny and somewhat less recognisible, their details are hardly recognisible and all work put into their design is mostly wasted.\n\nTowns look nice but feel like devs couldn't decide between clasic 2D of older Heroes and rotating 3D of Heroes 5 making result that feels less than either option taken to fullest. Towns also are less seamless than in other Heroes. Then building up your town was more like a puzzle being completed, the architecture blending with the town theme and idea behind it. In Olden Era it looks like a backround that has building added on to it. Though it must be said that the art of the backround art of the towns is FANTASTIC (dragons flying in the Dungeon being a massive cavern, Schism having huge tentacles waving around and ennerving fading light).\n\nSound feels like an afterthough with how genuinely little there is of it or how implementing is sounds more like an afterthought at the end of development checklist: often walking sounds doesn't match the unit moving, hero's heroic strike sounds cut (if at all) rather than cool or with any weight behind it and attack sounds lack ANY of the quality and how they had real punch behind them that Heroes 2-4 used to have (you could hear how hard the golems from Heroes 3 and 4 hit the enemy, the specific sound of different dragon breath attacks, etc.). Also quite a few sounds from Heroes 3 are used (next day, picking up specific items, ..) while somehow muted which is actualy impressive making once iconic sounds blander.\n\nMusic is the biggest dissapointment in the game. Any battle music that used to pump you up like in Heroes 2-3 or super memorable battle themes from Heroes 4 or FACTION specific like in Heroes 5 is gone. All there is is a battle theme that the best one can say about \"it exists\", town themes also fall GREATLY from the quality of ALL Heroes games since if anything all Heroes can say is that they had great town themes, some more than others of course but the quality WAS there. And there is 0 reason for it since Maestro Paul Anthony Romero, the composer behind every Heroes game, and Heroes Orchestra are confirmed to be the people making music for this game. We can only pray to all gods of Enroth, Axeoth and Ashan that this is only placeholder music.\n\nMap is a mixed bag. On one hand is DOES look pretty, lifting the fog of war looks very impressive (like creating a map in real time) and the land are joy to look at. On the other hand recources, creatures, places of interest much less pop out especially like in Heroes 3, where from ONE look you knew what it is and what is does. Also something missing is Artefacts/Moster Banks/Dwellings flavour texts like \"You smell sulfur and hear rustling of scales of gigantinc bodies, dragons guard this place. The battle will be harsh but the rewards will certaintly worth the risk. If we prevail\" or something like how your hero obtained the artefact. A missed opportunity but certainly can be implemented later.\n\nHeroes. They went the safe route like in older Heroes. Every hero sits on their faction mount and aside from portait looks the same. A bit missed opportunity to have monster or unique heroes like in Heroes 5 (Agrael) or Heroes 6/7 (angel hero, minotaur hero), to have a little more than just one and the same. Safe is a bit bland choice.\nHero skills are fine for the moment but their \"if you have X skill\" have potencial to be restrictive. I feel like what they were going for was much better done with sub abilities in Heroes 4.\n\nNew mechanics imo are a nice addition that so far have potencial to make this game unique. Laws, while bit bland at the moment, can always be tweaked to make them important in specific situations or make faction mechanics all the more impactful. Spell upgrading has potencial for true innovation: make upgraded spell unique, like adding new effects, buffs also debuffing enemies, damage spells causing DoT or roots, mind control/ berserk could infect units attacked. Spells could also backfire on the casters army if the enemy can exploit dangerous effects and rush into opposing army and cause collateral.\nFocus is at this point a bad mechanic for the single fact that it's shared recourse: you won't use hero attack (so hero returns more to Heroes 2-3 casting only role rather than improved participation in the battle like in Heroes 4-7) and any unit focus ability that isn't the best, and since higher tiers have better focus abilities, most lower tier units won't ever use their focus abilities so there is little point of them having them mid to late game.\n\nI understand this is a demo for Early Access only but it really shows it. The game HAS solic core, the work done DOES show and the devs are clearly invested making a great game. It only flops on it's face when it all comes together when all the ideas that sound good on paper are impelented.\nHex grid and one grid creatures = tiny creatures losing all the charm and detail Heroes 2-3 had or the feel like their focus abilitiesscale and larger room for detail Heroes 4-7 had.\nVery detailed and colorfull map = interactible objects get lost\nSpecial focus unit abilities = resource for them is shared to most won't ever be used (or hero attacks)\nBranching evolution = only small differences (in Heroes 4 it was important choice which unit dwelling to build and Heroes 5 could change unit whole purpose: Archangel/Seraph - Defensive healer 50-50 dmg/High offensive caster 25-75 dmg, or Black/Red dragon - Magic immunity vs no retaliation)\n\nIt feels like a mash of Heroes 3 and 5 but without what made them great. Like a dish made from ingredients from both versions without considering what made the original so good and if the flavors will work together. There is clear passion and idea behind the game but it's clear that this is just a demo for EA. The bare bones we have are not enough to hook me in.\n\nIf this game wasn't Heroes of Might and Magic I would call it a decent enough game. But it is Heroes game and it has great competetion: Heroes 3 as the best in the series for most people, Heroes 4 as the unique one with it's own charm and magic only it can provide, and Heroes 5 as perhaps the most complex and expansive one. Each of these has stood the test of time and each bring something to the table the others can't: Heroes 3 it's design, campains and quality (also some of the best mods and Horn of the Abyss being so good that GoG put it on their store for free as unofficial fan expansion to great customer reception), Heroes 4 with unique battle mechanics and heroes being front and center, Heroes 5 with it's depth of skills and units. \n\nOn it's own Olden Era is a  good game with solid foundations. as a Heroes game I feel no reason to pick it over older Heroes.",
      "voted_up": false,
      "votes_helpful": 167
    },
    {
      "review": "Do not get me wrong, game is not bad, but there are a lot things to improve to make it great :)\n\ncity screen following cursor is annoying,\nmap is hard to read, I cant tell reliably what is an obstacle,\nit's unclear which objects are interactable unless I hold highlight button,\nobjects on map overlaps and hides behind,\nI feel cursor is not selecting spot where it points,\nthere is no \"continue movement\" on subsequent days,\nresources income should be constantly visible on the top bar,\nI cant tell by the portrait which unit is it,\nI cant access spellbook from hero screen,\ncity building screen closes when I select anther city,\n\"astrologers proclaim\" disappears too fast, if you blinked, you missed it,\nlaw points growth is unclear,\non map, any kind of log would be handy",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "It is a decent foundation.. It is pretty much Heroes of Might and Magic 5, with a touch of Heroes 3's art style and game design decisions being mixed in, there IS potential.\n\nThe good: \n1. The art style for the resources and environment somewhat copy Heroes 3 and 5 - it's not ugly and it has its charm.\n2. The potential balance for this game seems pretty solid - no mass slow, no mass haste, armaggeddon can be nullified rather easily and it doesn't deal enough damage to 1 shot everything. Cities with walls feel like fortresses that can deal more damage than ever (you can literally take down 2 dragons each turn and the walls aren't that easy to destroy). Spells are strong, but there's a balance.\n3. The law leveling system gives a bit of gameplay variety.\n4. The units are somewhat decently designed and each race has its charm.\n5. The demo is kinda nice, access to full cities and 5 full maps with the tutorial. \n6. The turn times for opponents are short at release! This is a huge deal for a heroes game!\n\nThe bad.\n1. The UI and UX aren't good. Upgrading is tedious, you have to go into the upgrade menu separately to upgrade for who knows what reason. The City upgrade system is ugly, while it is functional with lines between buildings to indicate what needs what, it looks messy. Clicking on minions has like an number of small buttons that don't do much (I was looking for an upgrade button but couldn't find it, even though the unit has like 5-6 different buttons to split the stack whenever you click on it). It also lacks the option to choose enemy castles on maps (likely will be fixed in the full version) nor see the single map information.\n2. The art style is lacking contrast - all the buildings in the overworld look indistinquishable from each other, it all blends together into a mess, which is especially annoying because you have to pick up units from the dwellings every week and interact with the overworld (you will get used to it, but it isn't as easy to distinguish as Heroes 2, 3, 4, 5). For example, the stables in the overworld looks like a farmhouse, and you will only notice the horses in the farmhouse once you zoom in. The city art is also kinda meh, there are some buildings that will stand out, while others (for example the dreadknight building for necromancers, which is a T6 building) that pretty much blends into the cityscape\n3. The focus on dwellings - if you had a Caravan type of building that transported the units from the dwellings each week, it'd be fine, but with the current balance you WILL be lacking in unit production due to the lack of a castle/well that increases unit production, so the game is balanced on getting tons of dwellings (depending on the map), gathering up an army and increasing your army production in the town to build your armies (law system leveling & dwellings together with getting other cities of the same type). Cycling through dwellings each week is tedious and busywork, it would be nice to have more units produced in the city, with a smaller focus on outside dwellings. The overworld's lack of contrasting buildings and a coherent world style adds to this frustration.\n4. The AI is broken - I've by now played a total of 3 single player maps on Normal, 3rd highest difficulty and 2nd highest difficulty. The AI has been broken at least 2 of the 3 games. By the 2nd month some enemies still haven't taken the towns that are in their vicinity. They have 1 big hero that they run around with and once they lose it it's GG. They sometimes leave their cities (that I previously noted are crazy strong at defending) with their main hero to attack your vastly superior army (that even the auto battle might win with only minor losses) the decision making is poop on the AI. They often leave cities empty (when even a small defense can deal some damage if they have the walls. Also it feels like on higher difficulties the AI gets a BIT (?) better as the last game I had at the 2nd highest difficulty, the enemies somehow managed to get together a really strong army (far stronger than me), but due to them not upgrading their 20 cave dragons (?) and in general attacking my main army in the city, where even the auto battle gave me the victory, made me scratch my head.\n5. The grail fight seems way overtuned (tho not sure if it might be my lack of experience, but I'm more experienced than 90% of the playerbase...) It is an interesting decision to have a dwelling/fight for the grail, but it's basically a fight where the game looks at your army, doubles its size, gives the enemy your hero's spells, increases the enemy hero's stats to be higher than yours, and says \"go ahead, give it a shot\". It might be possible to abuse the AI in some ways to win that fight (maybe make it use bad spells, bad units, etc) but making you try to cheese the fight defeats this purpose. You could literally just make it a mirror match without big buffs and it'd still be a decent (reasonable) challenge for most players... Not to mention losing half or even most of your main army for the grail is a joke of a decision - no one would think it'd be worth the struggle.\n6. The soundtrack is extremely unnoticeable. No emotions nor feelings were evoked with the songs. The city themes in each past classic Heroes game have been major pieces of music that have told you the race's story (or fit in with the vibe of the town at the very least), but in this one, it's just \"meh\".\n\nDue to the AI issues, the art style and UI issues, I cannot give it a purchase recommendation. I recommend everyone to TRY this demo and for my initial impressions, this game did exceed my low expectations, but it's not one which I would currently play over Heroes 2, 3, 4 or 5. This game will need a lot more love and development time before I'd be able to say that it's at the same level as any of the other good Heroes games.\n\nAs a Heroes of Might and Magic game I think it's a 7/10 with potential - but if your previous games were 9/10's and 10/10's, it needs to do a bit better. \n\n\nEdit: Also this game WILL NEED online multiplayer lobbies to work as a new competitive Heroes game with something akin to the Warcraft 3/Starcraft 2 online lobbies with chatrooms, ranks, custom games, etc - just having mediocre multiplayer system will not work for this title.. Finally, a GOOD random map generator, needs to be present, because that's where most of the replayability comes from. These things are a must for a modern Heroes game, or else why did you put that much effort into balance if you don't want to make this into a multiplayer game? Also, constantly visiting creature dwellings each week will be crazy annoying in a multiplayer setting.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "So far it feels odd. Like on one hand it had potential to be a good HOMM game but on the other the stuff they have added just feels weaker. The alchemical dust locking off some of your best units unless you trash artifacts is kind of a pain as well as the fact the UI doesnt make it clear where to do it. It also just has really unclear UI all over, you'd think with a new HOMM title to maybe put on portraits or a roman numeral or a border or anything to show a tier 1 unit vs a tier 5 unit at a glance. Sure its easy to know the big angel is a high tier unit but the middling ranges is harder to identify. Another UI issue is just the map itself its hard to tell what is something to grab, whats an obstacle blocking a path and just so much more minor issues. \n\nIt has potential perhaps if its still worked on and feedback is heard to fix UI and perhaps AI or this dust system but for now it just feels a bit too clunky with the new despite the solid older fondation it rests on.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I dont wanna say it but I have to say that this feels mobile, when it comes to graphics when it comes to units clashing at each other... it's just cheap, not terrible but I just can't look at units and all other stuff with such minimalistic details and lacking Sound Effects. \n\nI like changes to the heroes talents that even if you advance one you have mutliple options. Same thing about map variations and game mods, they did homework on what made Heroes 3 multiplayer work. Soundtrack seems in good place, castles are ok. UI is a bit confusing and not informative but it works.\n\nSelling point will be different for most players but for me feeling of the units and their details are very important. I just had this neutral vibe all the time with my short playtime.",
      "voted_up": false,
      "votes_helpful": 101
    },
    {
      "review": "Mechanically it gets a lot of things right, but stylistically it is unfortunately very \"mobile\". \n\nAnd that's actually my 2nd biggest gripe with the demo so far. It looks absolutely terrible, with the hero designs and game visuals being anything BUT a call to the Olden Era. They were probably trying to blend old aesthetic with a faux-retro look, and coming out with something akin to a higher-res Warcraft 3 aesthetic. What actually came out is a game looking like a 2015 mobile game. \n\nBut otherwise it's same old HoMM. The devs played it safe with the mechanics and the differences seem to be carefully selected to not throw people off who look for a classic HoMM experience. And it connects right to the old Might&Magic lore as well; which is nice fanservice, and is another checkmark of \"getting it right\" for hardcore fans. \n\nThe reason why I'm deciding against it, is because much like modern copycats of HoMM, Songs of Conquest for example, it just clings too much to a 20year old formula without even trying to advance it. Meaning, that this just plays like an ugly version of HoMM3 with some minor gameplay changes. \n\nAnd if you're still just gonna make the same game over and over again, then I might as well just play that same game, but not butt ugly and not looking like a clash royale cousin.",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "I really wanted to love this game. I really did. But I can't.\n\nI will start with the bad:\n\n- Dynamic view of the cities shouldn't exist, or at least it shouldn't be the default. Gives me vertigo, not sure about other people. Good that there's a setting to switch to static (classic), but dynamic definitely shouldn't be the default. I've never even conceived of such mechanic.\n\n- I don't know what can be done here, but the way things look on the map is very confusing at the moment. It's hard to tell what you can interact with and what not. Practical example: in the tutorial you have to get a certain amount of gold to advance in the level, and you can't attack the creature that follows unless you collect all the gold (because the area is grayed out intentionally and won't uncover). The problem I encountered was spending 5 minutes to find the last gold in that area, as everything is yellow and it was very hard to pinpoint. This is not the only occurrence when I couldn't find something, but it's a good example.\n\n- The difficulty level is atrocious even on Easy. I am nowhere near a beginner in Heroes of Might and Magic, but I played the first map, Crossroads, moved pretty fast through the first area, not to mentioned build in the most effective manner inside the castle, and as soon as I reached enemy heroes (Week 3 or so) they had double my skill points (6 Attack vs 12 Attack and so on) and triple my army size. It's obvious there's an imbalance in difficulty because the creatures are all fleeing (Easy fights), but the enemy heroes destroy you instantly and you have no chance. Not to mention I conquered all their castles and they had Tier 3 dwellings at best. It's unexplainable how the AI main hero gets such a huge army with virtually no creature dwellings.\n\n- The mouse acts strangely sometimes. The cursor remains the same even if the object or entity you are gliding over can be interacted with.\n\n- Same with clicks. You click on something that can be interacted with, it doesn't work, you have to move the mouse away and move it back to be able to click. Sometimes you have to click away another area before you are able to click the desired one, and you can accidentally move your hero in the wrong direction, losing movement. I found this happens more often if you play on a laptop with a touch-pad (not sure if it's related), but it doesn't manifest exclusively there. It does on my desktop with a regular mouse as well.\n\n- The hero path painted toward his destination once you click on it is sometimes hard to distinguish among the environment. Color palette should be different and the contour should be better, like in Heroes 2 and 3. A hard green (reachable this turn) and a hard brown/grey (unreachable this turn), very distinguishable from the map, would be recommended. With a contour and/or shadow drop under it. Also a number telling you in how many turns you can reach - like in the classics. We don't need the red on the attack area, we already know when we want to attack something that we're gonna attack it.\n\n- If you click on an unreachable destination, you can't resume movement the next turn. You have to click on it again.\n\n- Another complaint which I don't know if will lead to any change: the spell system is really bad. I hoped I would see something along the lines of Heroes 2/3/4, but instead it was completely redesigned and makes it look more like a mobile game than classic Heroes. Has a more casual feel. That can be said about the graphics in general, but I can get over that if the other issues are fixed.\n\n- I get random CTDs under Windows 11. Not sure why. Under Linux it works, but only if you use Proton 10 beta as compatibility.\n\n- The idea that you need a special type of resource (Alchemic Dust) to upgrade creature dwellings, a resource that is difficultly obtainable, is really restrictive. I would completely remove that from the game. I have buildings I wasn't able to upgrade for the lack of this resource, which was introduced with this new mechanic. They are nowhere on the map. That's... not normal and is by far the biggest problem with the game.\n\nI will add more if I find more, but other than that I am happy that:\n- We have a new Heroes.\n- It ditched the atrocious re-branding of VI and VII and we're back to \"Heroes of Might and Magic\".\n- Looks diverse in content and gameplay.\n\nFor now, the biggest turnoff is the insane difficulty even on Easy. If they fix that, it's at least playable. But the game still has many flaws. Hopefully it will look better when it launches.\n\nUntil then, it's back to the basics. Heroes 2/3/4.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Well,,,\n\nThat's not it. Everything is incredibly uninspired, all the units, all the building, everything is... just a \"HOMM from Temu\" level of game or smth.\n\nMusic is meh, visuals are meh, no distinct style, no interesting art direction, everything is shiny but soulless.\n\nI guess this is what happens when great passion isn't backed up by talent. \n\nThe game looked much better on youtube. For $10 bucks I might give it another try, not a dollar more.\n\nP.S. Many other modern \"inspired by HOMM\" games do it better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it's a grind fest. The developers over complicated the game to the point where it becomes too boring. The troops have abilities, and that should be a plus. And yet, you can barely use some of them before the fight ends. The new focus mechanic is bad. Adding the new resource alchemist dust is annoying. Upgrading spells and artifacts. Everything seems to require extra grind.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "[h3]A weird amalgamation of older greater titles sprinkled with some odd choices and lazy generated maps to make a toothless cryptid of nostalgia. [/h3]\nJust to give some context, I adore the early Heroes of Might and Magic (HoMM) games, and I have spent countless hours of my most formative years taking turns in a dark dungeon moving my little hero on the world map dreaming of strange places filled with monsters, loot and magical opposition. I grew up with HOMM being the perfect game for a hotseat game on the side of hanging out with friends and loved ones. My absolute favourite is HoMM 3 that, in my humble opinion, really nailed the balance between exploration, looting and clever turn based combat. Sure some spells and factions were arguably better than others, but in the end you came for the experience, not the perfectly balanced utopia that has ruined so many games as of late. First and foremost, HoMM: Olden Era is more or less Heroes 3, with some added bits and pieces from later incarnations, and you instantly feel at home in the murky dungeons and sprawling landscapes filled with leprechauns, windmills and castles. However, since I started playing plenty of things kept nagging at me, so here is an easily digestible list of things I liked, felt “meh” over, and actively disliked..\n\n[h3]The likes![/h3]\n[olist]\n    [*][b]The tried and tested formula:[/b] As I already stated, this is more or less the formula from HoMM 3. Pick a town, hire some heroes, build up an empire through exploration, expansion and conquest. You instantly get the hang of it if you are a returning player, and this is, and will always be, a great game play loop for all generations!\n\n    [*][b]The music:[/b] I am a soundtrack enjoyer, and with Paul Anthony Romero back onboard the music is a heroesque as it has always been. This made me happy since it was his music that really encapsulated the setting for me. The music (so far) have been great and really works wonder in elevating the theme. Oh, and to be fair, the other composer is Cris Velasco of Mass Effect and God of War fame, credit where credits due.\n\n    [*][b]The flow of battle:[/b] The turnbased combat is as good as it always was, and the addition of a few skillsets that makes the position even more important really elevated the sense of tactical combat, there are more depths to master here and I am sure it will be even more finetuned at launch. \n[/olist]\n\n[h3]The “meh”![/h3]\n[olist]\n    [*][b]The amount of troop-types:[/b] This might be a me problem, but the addition of extra differentiation in unit-types really bothers me for multiple reasons. It makes diplomacy so much worse. “Oh you triggered a diplomatic victory? Hope you have at least 3 free spaces in your army to slot in all the variations of hell-hounds you just acquired..” Also, the cities are always cluttered with various units as it is, so I much preferred the old baseline/improved style, but here your mileage may vary…\n\n    [*][b]The elves(alvar):[/b] I will admit I am not up to date on the lore as of late, but in this particular game I feel the same oversaturation of elves in the factions I had in HoMM5. Dungeon lost harpies and evil eyes and got two generic looking humanoids? Sure they are less sexy this time around and I have a love for elves, but that only goes so far. And yes I know the lore around the evil eyes, I just miss my floating brainstems…\n\n    [*][b]The curse of sameness:[/b] Now this is a truly mixed bag. On the overworld map I love parts of it, but some stuff is just bleeding together into a formless mass of background noise… I can't tell how many times I missed an artifact or a pile of treasure because it was slightly obscured by a small mountain. And when it comes to all the monsters, it is even more confusing, but I assume that will be something you get used to.\n\n [*][b]The laws:[/b] I really see the potential to this system, even if it is more or less a tech-tree in disguise. My only problem with it is that it feels, as of now, rather min-maxy. Some choices are simply just better then the others and I found myself more or less focusing on the same laws each and every game despite the other variables. But it has potential!\n[/olist]\n\n[h3]The dislike![/h3]\n[olist]\n    [*][b]Schism (The faction):[/b] This might be the most generic and boring take on a new faction I could have come up with in a HoMM game, period. Take a bunch of weird elves, add a few tentacles and eyes. Yea, allright, is that it? Lazy design and even though I am a fan of cosmic horror it could have been so much more interesting than tentacles and sleeping gods.   \n\n    [*][b]The new grail-system:[/b] I hate it, truly. You have to cheese it since the opposing force is just your army + extra all. I personally actually like the old puzzle system with the monoliths since it gave an extra layer to the exploration. Was it perfect? No, but it is far better than this.\n\n    [*][b]A “mobile game” port?:[/b] I know this is a recurring complaint, and I thought it looked alright before I played the game properly. Now 10 hours later I can only chime in with the same sinking feeling. The graphics do not have the same crisp and clear details of the older titles, and some of the interfaces are just horrible. The whole thing looks like it could be downloaded on a random app-store and you are almost waiting for the microtransactions to pop up demanding cash to press the “end turn” button..\n\n    [*][b]The alchemical dust:[/b] I really did not like the addition of another resource that either forces you to destroy artifacts or be lucky enough to have a hut close by to forge dust from the other rare resources. Not a fan of this extra layer of scarcity modulated by luck and/or the faction you choose to play as...\n[/olist]\n\n[b]Conclusion:[/b] Now this is a demo, and a lot of these complaints might be void in the near future. I did not even comment on the randomly generated maps or the AI in this game since it feels moot point in a demo, but I really hope they step up their game with a bunch of carefully curated maps to enjoy in single players. However I have a sinking feeling that this will be another near miss in the HoMM-franchise, and while playing I kept coming back to the lingering thought, “Why am I not just playing HoMM3?”. I see the love the devs are pouring into this game however and I have a feeling they will do their utmost to make this the best game they can. Will it be enough? Hopefully. \n\nNow I might never get the crystalline tesseract entity faction I long for, but maybe the dungeon will still be saved in the end? Time will tell, but for now I will stay on the side of caution and keep on recommending HoMM 3 over this tarnished copy.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "I want this to be good as much as any Heroes 3 fan.\nHowever I will never like it unless the CLARITY will be in focus.\nThe fights look horrible. It's all a mess. The figure details are too high and they use the same color palette and shading levels as the backgrounds. Making everything melt together. And it's hard with a quick glance to see what is going on, which units are which.\nYou should not need to color highlight the hex the unit is standing on for this to be clear \"is it friendly or foe?\"\n\nThe in-town graphics are also confusing. It's a bit hard to see what are buildings and what are background. Even tho, it is beautiful.\nThe town \"tech-tree\" is quite a mess. It could be organized better so you see which branches lead to what.\nAnd different color portraits around the upgrades/buildings (for example, all unit producing buildings have an orange portrait in the city tech tree)\n\nWhat happened to large units taking up two squares btw?\nI will be updating this review when I find more things to add.\n\nUPDATE: 2025-10-20\nI have played the game a lot more now. It's really great, but I am really feeling I need to push my thoughts forward :)\nSo here I have some updates I notice whilst playing that I personally find important.\n\n1. When you're in a Town, having the building Tech tree open, I Think you should be able to click on the list of your Towns in the right side of the screen, to automatically switch to that town's build Tech tree. Making a huge QOL improvement when you are cycling Towns, checking what is built and what isn't. \nAnd, the minimap should correctly show which Town you're currently inside by moving the \"minimap screen view border\" accordingly.\n\n2. Whilst viewing units, comparing upgrade vs un-upgraded stats, you should be able to see ALL 3 versions, with all stats viewable right away.\n\n3. Just want to drive home the Point that the unit models in general have way too much details. I find it confusing, even after multiple hours of examining and getting familiar with the different Castles, to see exactly which models is what, especially in the thumbnails. The thumbnails of units/Resources etc are way too detailed, making it all blend together (I keep thinking ORE is a Picture of mushrooms)\n\n4. The \"3D effect\" whilst in Town make me feel a bit sea-sick. can it be turned off?\n\n5. The flags on the map, representing who owns what mines, Towns, etc, are extremely hard to SEE. Also the minimap in general is a bit hard to see where heroes and mines are (etc), again the solution is likely just more simple SHAPEs, that you can spot faster and that you can even see in the corner of your Eye, so you don't need to look directly at Everything you want to see.\nSometimes the flags are even hidden by terrain (trees etc.)\n\n6. \"Right-clicking\" should de-select whatever you have selected for QOL reasons. In battle, for example, I click to make my hero attack, or if I select a spell, if you could just right click to stop forcing you to pick a target to attack that'd be great (you can do this, just not whilst also right clicking above an enemy unit, which feels weird). Also, not having to push escape to de-select or \"go back\" in menues would feel nice.\n\n7. It would feel good to get some info of enemy units on the map before fighting them. HOTA have \"level 1 melee unit\" or \"level 6 ranged unit\" so you get some info what unit you are considering fighting or not.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "Has potential but could be better. It's just okay so far.\n\nUI is not great, lacks a lot of QoL features and in general isn't great at conveying information to the player; some features that were there 26 years ago are inexplicably missing (shouldn't new stuff be better) - I recall in Heroes 3, in battle, you could for instance easily identify what are the stats of a unit because a unit card would show up, as well as the buffs affecting them at the moment... missing here. It's even hard to tell how damaged the walls are in sieges.\n\nFights generally get resolved very quickly, magic doesn't feel very impactful even when you have a shitton of spellpower; it's hard to distinguish units especially between upgrade variants. In general the visuals are all very bland and shit looks the same\n\nAlso I don't like the fact that you have to pick 5 skills to get an upgraded class - feels very restrictive and i'm not sure it's guaranteed to even get the right skills on levelup, so you might end up picking suboptimal shit and end up with 4/5. Feels bad man. Yeah you could be unlucky in heroes 3 too, but it wouldn't gimp you out of a better class. I think the Heroes 4 system was better tbh (maybe the only thing that game did right).\n\nOnly played Schism so far, but from having captured another town it doesn't seem like there's a lot of difference between factions tbh.\n\nThe magic system seems overcooked with spending resources to upgrade spells rather than relying purely on a skill to get higher levels. Magic however like I said isn't great..\n\nAlso, Fortress or its reimagined version is missing so it's an automatic negative in my book for that. I need me some swamps",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Unfortunately I am not a fan of the cartoonish style, HOMM3 had a more adult-oriented design with a real heroic-fantasy feeling. Yes, it doesn't have to be HOMM3 but I am sure that a more serious design would have been better and appreciated.\n\nEven if I know that none will be able to do as good as Romero's music, it could have been better.\n\nHere I see a kind of fortnite/warcraft version of Heroes. Those are monsters, not kawai cosplay.\n\nWell, this is just my opinion, man, if the younger generation prefer that, who am I to judge.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "First off I'm not recommending this demo at this time but I am still excited for the game and have a love of Heroes.\n\nI love we get an early access demo, I want this to be the best Heroes game ever but for that to happen I feel this is still a long ways off.\n\nVisuals\n- Low Poly 3D art style (think WoW Graphics) isn't a great fit for HOMM.  While it was done with care, it doesn't feel very well defined to me, it lacks that richness of detail and precision that really pulls me in.\nLet me show examples, with Dragons!  (clicking the links breaks them but copying them works)\n\nHOMM 3: https://static.wikia.nocookie.net/mightandmagic/images/f/f1/Blackdrg.gif/revision/latest?cb=20150211071110&path-prefix=en\nHOMM 4: https://static.wikia.nocookie.net/mightandmagic/images/8/8a/Megadragon.gif/revision/latest?cb=20140813174953&path-prefix=en\nHOMM5: https://static.wikia.nocookie.net/mightandmagic/images/6/68/BlackDragonH5.png/revision/latest?cb=20190429235046&path-prefix=en\nHOMM6: I refuse to give any credit to a game that had shark guards\nHOMM7: https://static.wikia.nocookie.net/mightandmagic/images/8/82/H7_red_dragon_model.jpg/revision/latest?cb=20170209154820&path-prefix=en\nOlden Era: https://heroes3wog.net/wp-content/uploads/2025/03/homm_olden_era_ashen_dragon.jpg\n\nTo me olden era is the most blocky of all of these with the least definition on scales.  I realize 3D has its own styles and benefits but it feels like this is made for mobile game screens, not for looking at in a close up.  So while the visuals of this game are occasionally striking it just feels like it stats to fall apart under close examination to me.\n\nFantasy is in my view, epic, rich, detailed.  At least the kinds I like, and what I liked in Heroes.  Like think Keith Parkinson or Todd Lockwood or Michael Whelan.  The Olden Era style seems more like a cross between that and like, Digimon to me.  It's just too simplified and toy ready.\n\nSounds\nThe music so far has not been memorable.  HOMM4 dirt theme and town music blew me away and still does.  I can't even remember the music after a session so far.\n\nThe sound effects are still missing because early access demo.\n\nVideos\nThe intro seems poor quality even by mobile game standards.  The shading is very strong but it doesn't hide the underlying work seems blocky and ill defined.  The first thing I felt when booting it up is yikes this is still really unpolished.  Not really how you want to start people off.  The aesthetics are also not very epic to me.  See the first section.\n\nI know I'm just being overly critical but aesthetics of this game feel unpolished to me.  There's still time.\n\n\nTownscreens and UI\nOverall the towns do look rich and pretty tho it can be hard to tell what is the structure and what isn't.  The structures used to pop and be very obvious.  Without the great soundtracks they also are missing a lot.\n\nOne peeve is, why does every unit box have some solid color background that seems ripped out of WoW design I do not know but it doesn't really make me feel like I'm playing a Heroes game.\n\nI haven't found the UI to be too bad to be honest other than aesthetics, though the small circle menu on units is not that great to interact with.  It's not obvious what each thing does and it feels crammed.  Nothing wrong with a text menu or dialogue box really.\n\n\nHeroes\nThe heroes are pretty central to the game.  I don't really feel like I connect with any of the heroes and the portraits seem to remind me of like, Age of Wonders or something, they are almost painted but not precise, and there's all sorts of things wrong with their structure.  It doesn't feel that epic to me basically.\n\nToo the heroes personality is \"Grow more crossbow men per week\".  Like give us a blurb of their story or history.  Give us a reason to root for them.  After I play the game to death crossbowman growth might be the only thing I care about but when I'm getting into the game that is far from the only thing I care about who are these heroes why are they here what do they fight for, what is their story.  Other heroes games gave that upfront.\n\nI just really didn't like or connect with any of them which is a big worry for a game called Heroes of Might and Magic.  Even being generic is less bad than this because it's familiar.  There wasn't even the go to of elegant lady or big strong guy.  Everything seems twisted somehow.  Maybe to keep it interesting?  But if everything is twisted that just makes everything the same doesn't it.  I really liked some of the heroes in IV, and in VII.  They were cool.  I haven't felt that about these yet.\n\n\nGameplay\nI've played about 3 games so far and I can say some of the things I like are there and sometimes the spark is there.  However a lot of the units have grayed out abilities which is just confusing.  I'm sure I can figure it out but this is first impressions.\n\nI like the focus on the combat though that is how heroes should be.  It's not just a game about the big map.  Speaking of maps the default ones we got for 2 player was not really that good to tell us how the game would normally play out.  You get multiple towns right off the bat, you get tons of units right off the bat, you get multiple recruitment dwellings, money comes in fast and you build fast.  Theres basically no friction or worries.  And it becomes kind of a pain to manage all that.  I had my fun on custom maps and stuff back in the day and I can say I prefer the slowed down default pacing of heroes at least as a starting point.  It makes decisions matter more and makes losing a single unit be felt.  So give us a traditional 2 player heroes map to test on please?\n\nBuying the spells is an interesting concept, but it will lead to flat games and meta spells just being what people go to and a flow charted gameplay.  Which is not great.  The randomness of spells made it a gamble to take a caster.  You might not get what you hope for.  You  might have to adapt and make the best of spells that aren't your favorites.  But you could always rely on might you know.  That was baked in.  It was healthy for the game in my view.\n\nThe artifact dust is meh to me, like, this has good intent but upgrading certain artifacts and the spell buying seems to miss the benefit of not always getting what you want.  Having a flow chart game is not that great.  It hollows the creativity aspect and adaption which is a lot of the interesting part.  People will be posting optimized path to get the best spell and artifact combos in any map and it will be all you play against.\n\nLastly, the spark is still not there like I don't feel that one more turn magic.  I think it's a combination of things.  The music missing definitely hurts, but so does having a hero to believe in.  The aesthetics are a constant drain on my enthusiasm too.  On the gameplay mechanics, I'm just not sure yet.  So I just haven't put a ton more time into it yet.  \n\nI am excited for the game to fully release and keeping close eyes on it I really hope this feedback helps you guys out, bringing the game back from the dead is a miracle and I'm super hopeful it will bring heroes back into my life.  I'll say this if your save system works you're already miles above Heroes VII in functionality.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This is a demo review.\n\nHas promise, but the current look and feel of it is incredibly off.\n\npros:\n- All the good stuff from HoMM 3. You can skip the tutorial and just jump in if you are familiar with that game, this one will feel like a skin or a mod.\n- Some interesting twists on mechanics, which do seem enriching the formula without feeling gimmicky. Stuff like sub-skills, making leveling more interesting, or alternative upgrades for units which give you more stuff to play with and make some choices.\n\ncons:\n- It looks and feels like an iPad game. I half expect someone to sell me exp boost after the fight finishes. The graphics are sloppy and \"mobile\". Units and buildings lack character, objects blend in their surroundings. The aesthetic just feels plastic and cheap. Town screen is not up to the game's standard.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "Got mixed feelings about this demo. On the one hand,\n+ the authors' intent is clear and well-intended: they gathered best parts of different HoMM games and mixed them into one, with the prevailing amount of ideas taken from the third, most popular game. There is branching of unit evolutions from the 4th, hero support on the battlefield from the 5th, but the majority of Olden Era strongly resembles the third instalment. These elements seem to work well together;\n+ there are also new factions, which is always exciting, especially the Schism. Who doesn't want to reminisce about good old days of In the Wake of Gods;\n+ there is a couple of new peculiar mechanics, for example, faction laws, that can enhance your playthroughs and make them more unique, and a new game mode, Arena;\n+ the demo itself is very solid, there are few bugs;\n+ creature and town designs put a new spin on the old visuals.\n\nHowever, there are points I can't ignore:\n - as I was playing it I couldn't help but think: if so much has been borrowed from the third game, what's the point of making Olden Era at all? Sure, there are a few new ideas as well as additions from other instalments, but from what I've seen so far, this game is about 85% Heroes of Might and Magic 3, down to the sound effects! I guess taking any other road would most likely lead to a failure: make a unique game distinct from previous instalments, and fans will eat you alive; make more of the same and become the FIFA of turn-based strategies. HoMM 3 surely is a timeless masterpiece but, alas, you can't earn on it again;\n- which brings up another point: I find the design direction chosen for this game to be very... Warcrafty? Mobile game-like? It's really cartoony and doesn't help set the game apart from any other mobile fantasy game. There is nostalgia for old RPGs at the moment, so Unfrozen could capitalise on it by just polishing up the HoMM 3 graphics (since it's halfway there anyway) instead of giving it a completely forgettable look;\n - not a single music track left an impression on me;\n - the UI in this game is abysmal. I'm no connoisseur but I misclicked on things on multiple occasions, had to guess functions of a few unlabelled or tiny buttons, spent some time looking for the hero and castle icons (!) when I just started playing. The interface elements are too spread out, and (this is hopefully just a demo nitpick and it will be changed later on) their design is often bare-bone;\n- I had trouble interacting with objects on the map, since you need to click on the specific part of it to interact, as well as with units on the battlefield if they stand in a tight vertical formation, there is simply not enough vertical space for them. Also, a lot of pickups on the map are obscured by other map objects;\n- the randomly generated maps seem to love the treasure troves, there are simply too many of them;\n- what is the point of alchemical dust? In my playthroughs its only role was to hinder my progress;\n- why does the vampire unit from Necropolis look so much like Hordak from She-Ra and the Princesses of Power??\n\nOverall, at the moment I'm not too sure about Olden Era, and in my eyes it loses in comparison with the game it is trying to imitate, Heroes of Might and Magic 3. But that's one of the purposes of a demo, to gauge audience's reaction and report on progress. Good luck Unfrozen!",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "They tried something new with the design and I have to say - a game called 'olden era' with a kinda mobile style like this.. I think that's not what people who played games like HoMM 2 or 3 wanted to see.\n\nArt Design:\nSome aspects of the game feel like a f2p mobile game - too many things fancy, over the top, many units just overdesigned to no end and it hurts my heart and eyes to see it becoming like this mess - especially the hero portraits look like straight out of an AI-image generator.\n\nUI:\nThe UI is very clean and loveley made, quite a treat to look at.\n\nCities:\nThe cities look beautiful as a scenery, but very forgetable and some buildings are just something in a mass of something. Especially in undead and dungeon-cities. Like the Minotaur-Building is looking almost the same as other filler buildings around. If you take a look at HoMM 2 for example, there you have one green maze when you build minotaurs. that's it, no other mazes, no other green stuff. This is the maze, there are Minotaurs coming from. Here, you have so many doric style buildings, that you can't really tell at first sight. Of course neither have olden aera started this nor is this a problem since you now have 2-3 ways to recruit your units, so this is rather a nitpick.\n\nI like that you have multiple (fast) ways to buy units by the way, or to upgrade the units to 1 out of 2 advanced versions and the building tree looks clear.\n\nAnother little annoyance is the hammer icon for cities in the world view, which shows when you can build somthing in your town, but when you go into your almost maxed out city, you have still nothing new to build (I blame the artifact building that might cause this, since sometimes this was the only building left to build in the town which I couldn't since I haven't got the artifact)\n\nFaction Perk System:\nThe law point system with the faction skill tree where you unlock upgrades for your adventure, ressource generation and creature-tiers is a nice idea, but this one-time-ressources feel a bit lackluster compared to creature- and adventure-booster - and mind that you can't have it all.. The creature boni from these options feel mandatory, some give more health, some more damage and overall more recruitment per week. Additionally, it boosts only the creatures of your faction, which is fine, if all your towns are convertable to your faction, which is currently not the case.\n\nAuto resolve:\nI appreciate a fair auto-resolve system, but in fact, I often get way better result with auto-result than playing them manually = auto-resolving almost every battle, rushing through the whole map without doing a single battle sometimes. Of course it would be quite tideous to do every no-brainer battle for yourself with the same result, but playing battles manually, as it currently is, feel like a disadvantage to me, though it should be the core of the game. A hard miss, but I undestand that this is hard to balance. If it's too good, you don't do battles, if it's too bad, nobody will use it ever.\n\nArmy Size:\nAs in other newer HoMM-Titles, you can only have an army of 7 creatures, what makes it a bit of a pain in one-hero mode, where you may find base creatures in creature generators, but can't take them with you because you have your full city roster with you, all upgraded to the improved tier -> it would be nice to upgrade creature generators to select advanced units from there or how about extending the unit space to something like 10 - then you can also do more unit splits.\n\nMovement:\nThe movement on the world feels kinda clunky. when I try to go a place, which is guarded by creatures, it just doesn't let me create a path to it- so I have to find all the creatures in the way blocking the path to get them out of the way. This could be improved to show me a path and let me go through all the battles. What I also do miss is an auto-move button. The set hero path vanishes when you unselect your hero as well.\n\nPicking up items or ressources on the ground feels also kinda odd - first, ressources sometimes blend in very well in the washed out art style of other stuff, so it is sometimes easy to miss things visually. Additionally, you have to click on the -ground- of the object. so if the object is a bit higher than that one hex field they are placed at, you sometimes missclick to the space behind it instead of recognizing where my focus is. I mean, I get it, somehow you have to be able to move behind objects, but it really feels more an issue in this game than in previous ones - maybe it's that the world objects are a bit bigger than the Homm games I played, so missclicks thend to happen more often - would be really interesting if other testers feel this issue as well.\n\nUnit Design:\nMany units are just plain overdesigned to indistinctiveness and, sorry, mobile-game-sillyness.\n\nOne example is the Cavalry of the Temple line-up - the unit looks very silly, even almost goofy with all the wings and feathers on the knights armour, the lance looks like a soulless, random, oversized mobile game 'artifact weapon' instead of a lance and the unit proportions are completely off, rather looking like a Cosplayer on a Pony than a veteran battle hardened knight on a warhorse. Things like this add up and of course this is not the game, where the unit fancyness started, and it might sound a bit unfair to compare the artstyle of  the early titles like HoMM 2 from 1996 with todays style, but that's kind the point still: in earlier titles, the unit-design was -very- clean, clear and distinctive - maybe also because they had to be, but this game here feels like a mushy mess of indistinctiveness - washed out, fancy, sometimes unrealistic proportions, oversized items and especially weapons, too many extras and stuff. I am aware, that some people prefer this style over simplicity and clear art, but for me, it just doesn't look well like this. Especially advanced units portait differences are sometimes super minimal - hard to distinct.\n\nArtifacts and Sets:\nMany artefacts are a part of a set, which makes it interesting to collect more pieces. (in the end you pick up everything anyway, so it might also just be luck to get a set together or you try to trade it in at an artifact trader if you are really after it.\n\nMissing stuff:\nI really miss the town conversion feature in the demo. I want to win with my chosen faction, not being lucky or not to have more cities of my faction than my opponend does, basically determining if I can win as a high-stack-army or not by having more weekly unit production of my faction for my main hero or not.\n\nFocus System and Creature Skills:\nI don't like this system - it takes some time in battle until you have enough points to do something with your units, and then they are often already dead, decimated or the battle is over. Using units special abilities should be detached from this system - try cooldowns instead?, especially since this system is also connected with hero attacks, plus you are super limited with focus points maximum (I think it was 4 points).\n\nHeroes:\nThe Heroes Magic and Hero attacks feel very lackluster - killing some few units with your hero attacks (which cost focus which your creatures need to to use their abilities) compared to killing hundreds with your units with just one attack just doesn't really scale well at the moment. getting +5 more damage when a single unit model has 100 or more hitpoints is quite a miss, even when multiplied in some ways with formulas I am not aware of.\n\nOverall, the game has quite some improvements to previous titles, the QoL is good, but the art style really kills it for me, though the UI looks really clear and the battles are enjoyable. \n\nQuite some game systems just doesn't work well for me (law points, battle focus points, spell-scaling, alchemical dust ressource [to build/upgrade high tier buildings, to upgrade artifacts and to unlock new spells], mobile game unit design, ai-generator-like hero portraits)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I could played only 30 minutes and for it's really enough to realize: it's not HoMM what I'm looking for.\nThis game is simply boring and seems developers doesn't  know why people love this game series so much. I see lots of detailes used from HoMM3 but guys, let's just be honest: behind all vfx effects and fancy UI there is no sinergy beetween music, animation, units design and gameplay systems.\n\nGame units looks boring. I tried Nekropol, one of the most epic fraction and I was upset. No decadent charm, vampires look like floating pieces of tapestry. No soul, no emotions, nothing. \n\nBuilding system in skill-tree style? Well it's not bad but it's barely fits the sreen. I don't want to see so detailed info about all upgrades and no hierarchy between upcoming upgrades and wayfar updates doesn't help at all. Further more sometimes I felt confused: did I build it or not? UI indication not clear enough.\nOn the main screen highlights for building barely visible. So many details but quite complicated to focus on functional buildings.\n\nAnd the most frustrating moment: game based on battles with might and magic simply suggest me accept variable automatic battle results and move forward. \nI can write even more, but I'm pretty sure many people could or already did it better. \n\nAll I would like to say: It's boring, it's suffering from many details without clear UI support while object indicated, bad hierarchy of game features, no soul for units and heroes we used ti play. Look like mobile game, but no more.\n\nSorry, won't buy this one.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The endeavor of the developers to create a worthy successor of the previous games is definitely recognizable,  still there are some major and minor points which need improvement. \n      Generally I like the artwork, (like portrays of the heroes, the town screens) and fantasy like visualization, but at more points the game shall improve. In my opinion the biggest problem that many units in the game are tentacled (octopus like), which is disturbing after a while, and makes them hardly distinguishable. Understandable that Schism and insects based Inferno units are like these by definition, still I am missing the good old vibe and setting the game should transfer. These two factions are making one third of all units which is way too much. It feels like Zerg faction would be involved into the game, which I would not expect in a Heroes game. In previous games we were having mythological connection at lot of creatures, which was providing a good atmosphere and some kind of base setting of the game. Here this is missing unfortunately. Making here a finetunning could help a lot. Subsequently here a small list of some smaller details collected during the play:\n      \n    • On campaign map: \n        ◦ missclick happens often, as by clicking on the upper half of the unit, the next tile being above the unit is recognized. Hero moves above (behind) the target.\n        ◦ indication how many turns until hero reaches target would be helpful\n        ◦ too much one time usable buildings (disturbing after a while)\n        ◦ mines unsharp, improve visibility\n    • magic description table: should be more ergonomic, magic description on the top of the table, upgrade cost to the bottom\n    • economy overview screen not found! (where amount of mines and all castles with garisoned units visible) Should be implemented!\n    • Improve hero properties screen: make the window bigger, improve the visibility of the icons, heroes’ skills should be better visible \n    • Hero unit exchange screen: make it more ergonomic, units exchange shall be more to the middle of the screen, not at the bottom\n    • when hero gains knowledge the icon appearing on the map is too small\n    • skill icons hardly distinguishable\n    • battle screen: \n        ◦  skip and defend button size should be increased (maybe place them on better spot)\n        ◦ schism generally units very bad visibility (eg. tier6 and tier4 units look way too similar on the battlefield)\n        ◦ sword, signalizing attack direction, too dark and  hardly visible\n        ◦ arrow, signalizing shoot, is too thin and hardly visible\n    • town screen: if moving from one town to another within the town screen, the minimap does not follow the movement, which would be helpful for orientation, (when having multiple towns from same faction",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "First of all for a demo the game looks really good and overall i enjoyed playing it. The reason i currently can't recommand the game is mostly a balance issue. For experience refrences I played HoMM3 + HotA about 2000 hours.\n\n[h3] Pro's [/h3][list]\n[*]feels like an upgraded HoMM3 overall\n[*]the UI looks good and feels clean\n[*]I love the new law system for more customization\n[*]advanced and expert skills have subskills to enhance your playstyle\n[*]you can choose out of 2 different upgraded creatures for each tier (I really like the idea)\n[*]good animations\n[*]great music as always\n[*]interesting unique buildings\n[*]nteresting spells\n[*]nitiative and speed are two different stats\n[*]arena mode[/list]\n\n[h3] Con's [/h3]\n[list]\n[*]the buildings of each town are very similair (meaning only 1-2 unique buildings per faction)^\n[*]hitting the hit box of your city to enter with the hero is unusally hard\n[*]the battle and map speed is ajustable but its pretty hidden under advanced settings\n[*]the dwellings are hard to see -> the alt button helps but a higher contrast overall would be nice\n[*]you can choose out of 2 different upgraded creatures for each tier. The upgrade system is awful. You should add that if you upgrade a creature it automaticly upgrades into the chosen creature on the bottom right in the capital view. Also I ran into a lot of frustration because many of the upgraded creatures are just reskins hard to differentiate from each other. \nAnother problem is that you don't really have a choice wich to choose. For example who would pick Skeleton Warriors before Skeleton Archers? The idea of a deeper or customizable playstyle is really good. But the execution feels poorly.\n[*]arena mode is way to easy\n[*]having 5 specific skills give you HUGE benefits for your hero (like your troops all do max damage while enemy always do min damage). It feels bad if you are stuck on 4 skills and doesnt find the last one to get to that benefit. Also it limits your decission making drasticly.\n[*]needs more hotkeys like HotA (recruit all units, move all units from one slot to another, map hotkeys,...)\n[*]if you press enter in the city you can accidently end your turn\n[*][u]my biggest con overall is game balance:[/u]\n[olist]\n[*]Heroes of MIGHT and magic. Magic spells feel really weak. The utility ones are great but you dont have a good option for damage spells. Therefore playing a Magic Hero feels pretty underwhelming and gets crushed by Might heroes. Compared to HoMM3 it feels that you get a lot more creatures (-health) overall, but in contrast a Armageddon with 40 spell power does like 500 damage and kills 2-3 Tier 7 units while having 30 in your team? Non playable\n[*]Archers Archers and long range. Each faction in the demo has at least 2 archers and if they have just 2 archers there are 1-2 long range creatures or creatures  that dont provoke retilation. Game design wise I find that really hard to balance. Retilation was a huge part in HoMM 3 (not as huge as haste and slow though) but it's a fuindamental game  design that is missing. Solving the expert slow/haste problem is great but giving nearly everyone range attacks lacks interaction and stratical thinking. Just pew pew everything before it can reach you. Pretty boring that leads to not playing the game in the long run.\n[*]Necropolis.... Necromancy was such an overwhelming skill in HoMM3 that is was banned in every tournament. In HotA they nerved the skill in its raw numbers but its still amazingly good. You could just raise Skeletons there (with the exeption of the Cloak of the Undead Item wich rases up to Liches if you got Expert Necromancy). Here you get units of every single Tier depending on your overall killed units, wich leads to utter dominance. Having 600 Skeleton Archers and 200 Wraiths on the third week may feel good but is everything else then balanced. Necropolis would be hard banned from each tournament in its current state.[/olist][/list]\n\nI hope the game gets the time to fix the issues it currently has. It has great potential to be succesfull like HoMM3. I really like the direction that the game is going and I'm looking forward to maybe another demo and upcoming patchnotes!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Arena is fun. But strategic map gameplay feels off. Like too much is free, stacks are not balanced well. Map is overloaded with visitable objects too much. Needs s lot of polish and tweaking. Putting not recommended for now.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "People already mentioned these so I just summarize:\nLooks like a cool game, under bad UI and other issues, such as very odd camera mainly when zoom in-out, city screen is moving annoyingly (but why?), map is hard to read, UI feels \"too much\" and like a colorful mess.\n\nSadly I can't enjoy the game, because I am getting seasick from the colorful oddly moving map (I zoom a lot in and out normally) and I didn't have these issues in 3-6, while everything seems too… noisy. \n\nSo for me thumbs down, but I really wanted to play it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "soooooooo, its need lots of improvements.... It’s not a bad game, but it’s nowhere near the HoMM3 experience. The gameplay just feels sluggish, the maps are cramped (which I hope a map generator will eventually fix). A “large” map now feels like what used to be a medium, and the “extra large” is basically the old large.\n\nBut that’s not even the biggest problem — it’s that there are plenty of good ideas that just didn’t land well.\n\nFor example, the two-tier unit upgrade system: you have a base unit, and then at the second stage you can choose between two different evolutions — meaning you have to decide which direction to go. That part would actually be great: having to make a choice between, say, a level 2 archer who shoots twice, or one who deals full damage at any range. (That idea was originally from Disciples.)\n\nBut here’s the problem — there’s no final decision. You can freely retrain units back and forth anytime, and it’s completely free. So the choice has no real tactical or strategic weight. Sure, in PvP it adds some flexibility, but only until people figure out what the meta is.\n\nThen there’s the build tree, showing what buildings lead to what upgrades. That’s fine, it existed before too, but in the old games, for example, a level 2 town required four basic structures. Now, a level 2 town only needs one. There are only three town levels now instead of four, and the “capital” level — the old Capitol — is gone completely.\n\nAnd then there are those classic, frustrating issues — like the auto-combat system, which is completely incapable of making real tactical decisions. It just charges face-first into the enemy, losing ridiculous amounts of units in fights you could’ve easily won without losing a single one.\nMeanwhile, the enemy AI somehow plays perfectly — no matter what army it has, it always makes the right moves. AI vs AI(neutral) battles always end the same way: the AI wins, losing only a handful of troops.\n\nSo the game basically creates “challenge” by giving the AI unfair advantages, rather than through smart design. Sure, that might be acceptable on higher difficulties — but even on EASY mode, the AI is noticeably overpowered.\nWhile you have to pick up every single resource on the map just to keep your economy running, the AI doesn’t gather anything at all and still manages to progress faster than you within a single week.\n\nThe new “Alchemist Powder” resource is another huge problem — if you can’t collect enough, it can completely cripple your progress by week three. You can be completely locked out of upgrading or build, while the AI somehow fully upgrades its towns in two weeks without any visible source of that resource.\n\nSo yes — the game feels unfair, and very obviously so. It’s a really bad design choice. If you can’t make a good AI, don’t just give it ridiculous hidden bonuses and call that “challenge.”\nI honestly wonder if this is what they’re planning for the final release — because if so, it’s going to be another failure in the HoMM legacy.\n\nThey did improve the visuals since the closed beta — I’ll give them that. It no longer looks like some dark fantasy mobile game.\nBut now there’s a new issue: so many interactable objects just blend into the environment so much that you can easily walk right past them without even noticing. Unless you keep spamming the ALT key constantly, you’ll just stroll right by something important — even an actual lumber mill.\n\nAnd speaking of mines — why, on one of the maps, did I only find stone and wood? What kind of map design is that supposed to be?\nIt’s ridiculous that you’re expected to build an entire economy out of just two resources. You’re forced to rely on trading — but the marketplace runs on a 300% exchange rate, meaning you trade 3 wood for 1 mercury.\nOnly after you build six towns (and therefore six marketplaces) do you finally reach a 1:1 ratio — so basically, gathering what you need for higher-tier buildings becomes pure suffering.\n\nAnd of course, the AI has no such problem.\nSome faction buildings now automatically produce their specific resources — but only just enough to buy your units, not to actually progress comfortably.\nIn older games, those were optional buildings; now they’re mandatory, because you can’t get enough materials from the map itself.\n\nAlso, about the resources — the AI doesn’t even bother reclaiming mines you take from it (I wonder why?).\nIn older Heroes games, that was one of the first things the AI did: cut off your resource income to slow you down.\nNow, if it can’t win a direct fight, it just runs away from you — but if it can’t win and still sees a town, it suicidally attacks it anyway.\nI can’t even tell if that’s a bug or some kind of “AI pressure” mechanic gone wrong.\n\nAnd then there’s the fortress design — the tower system is completely broken.\nYou read the descriptions once, and boom, you already know the meta.\nFirst level: exits.\nSecond level: +150% damage.\nThird level: two shots from the main tower.\nThat’s it. With this setup you deal 150% damage and get four total shots — all other combinations are pointless and not worth using.\n\nfor me if the homm 3 is the best with 10/10(with vcmi is 11/10 :) ) \n\nthis game is just 6/10\n\nim hope they will change a LOOOOTS of things\n\n\nAnd I almost forgot — when you try to recruit a new hero, the game tells you absolutely nothing about them.\nYou don’t know what their skills are, what abilities they have, or even what units they start with — let alone which faction they belong to.\nSure, after a few hours of gameplay you might start to recognize them by their portraits, but early on it’s just pure guesswork.\nHow is anyone supposed to make a meaningful decision like that?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I think I should start with a disclaimer: I've played every HoMM game, starting with the very first one when I was a kid. This is probably pretty obvious, as it would be very difficult to rate the game without playing whole series.\n\nIn my opinion, HoMM 3 is a game that should be pre-installed on every PC, like Klondike Solitaire or Minesweeper. But Olden Age has major problems, and the reason is not that it's \"not like Heroes 3.\"\n\nThe series is objectively dead: Ubisoft, after acquiring the rights to the game, tried several times to restore it to its former glory. Clash of Heroes and Dark Messiah are excellent games in the Might and Magic universe, in my opinion, but overall, Heroes 5 is considered the last good numbered game.\n\nCan Olden Age be considered a worthy continuation of the series?\nAbsolutely not, at least for now. For me it feels like a concept of a soft, save try to reboot the series. A chance to find out what players want in a new big-budget game and evaluate whether it's worth the effort and expense.\n\nI'm confused by the fact that the developer in charge of the development is not very experienced (as far as I see, Unfrozen only have one game in their portfolio - Iratus), whether they can make not just a good game, but also a good game in a place where Ubisoft-led studios have failed remains to be seen.\n\nI can note for myself that the game is trying too hard to be like Heroes 3 and 5 (75%/25%). I won't even describe the lack of some gameplay features, it's still a demo after all. Perhaps if we support their efforts now, we'll get something more in the future, but in recent years, players have increasingly been disappointed by the trust they place in developers and publishers.\n\nI can see the developers' enthusiasm, their desire to create something new in the genre and the series as a whole, but desire and zeal alone aren't enough, and experience and skill are apparently lacking, because my main complaint isn't so much with the gameplay itself as with the gameplay decisions.\n\nWhile playing, I couldn't shake the persistent feeling that I was playing a PC port of a mobile game – weak, blurry graphics, poor animations, a terrible user interface, strange button placement, drawn-out battles, weak unit design, and the choice of in-game castles.\n\nIt's funny, but in this sense, Songs of Conquest or Age of Wonders 4 feels more like a proper sequel to HoMM than Olden Era itself. That's why I think the developers made the right decision by delaying the Early Access release. Heroes has a unique and dedicated community, which is why it's a very easy-going crowd that will settle for anything, but I think the series deserves a better approach, so please take criticism, improve, and refine the game, work with it as long as it needs to make a good game. Remember that BG3 showed everybody that devs, who were in close contact with the audience, managed to create an excellent and highly replayable game that players wanted.\n\nI really don't want to see another Heroes VI disaster, not again.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Ten minutes was enough. The visuals are so dull and bland that I simply have no desire to continue playing. The units are \"yet another random fantasy unit.\" The cities are \"yet another generic fantasy city.\" Everything is dull, standard, and lacking any imagination or talent. For contrast, I looked at Heroes 2 and Heroes 3. Both games still leave this piece of junk with no chance in terms of visual expression. It's made without the slightest spark and, as many have already mentioned, feels more like another mobile hack.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The demo is not bad, but its lacking alot of default features. Graphics are nice, but it doesnt feel as good as homm3, I'm missing the total overview of the game (its all hidden behind graphics). I did encounter some small bugs, like trying to enter the main city, trying to enter/step on some buildings in the map that did trigger. I also hate the resources on the top, just put it on the bottom like all the good homm games.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I so much wanted to like this game, and I have given it so many shots. For now I cannot recommend this game, but there is also so much potential. I will give a step-by-step breakdown and feedback here in hopes that it is picked up and hopefully used to make this the awesome game it deserves to be. That is also what a demo is for, right? To collect feedback. So get yourself a warm drink, and here we go!\n\nWhen you first start the game, you see an opening video. Elves fighting humans, and later necromancers showing up. This intro immediately got me into a bad mood for the game. No story, just violence. Why do elves fight humans, aren’t they supposed to be allies, why is this, nothing is explained. The strength of some HOMM games is the stories, the lore, the exploration, the adventure. Why are these factions at war, what drives the heroes to discover this magical world. This intro video gives me nothing, just cheap violence. An intro video is there to set the tone of the game. Even HOMM3 did this better! A masterful example is Red Alert 3 or Witcher 3.\n\nThen you get to the opening screen. It's alright, all the right buttons are there - which is already an achievement for games these days. The background image is alright, though what you could really improve is music. Add a banger of a soundtrack here, something iconic that you keep humming throughout the day. Like -again- Red Alert 3, HOMM3, and some other games. Music really matters for the experience and the vibes you get while playing.\n\nThe menus to set up the game and to choose your hero are fine for now. Perhaps in the future they can add more options to tweak settings and map generation options.\n\nWhen starting the game, there is a lot of loading time, I really hope this is shortened in the end product.\n\nThen, when the game starts, the first impression is good: it looks and feels like a Heroes game. So well done! :)\n\nWhen playing though -!and this is my most important critique!- it feels more like a bunch of chores and management that you have to do than actually a fun magical exploration, adventure and combat game. \n\nThere are too many things you need to do each turn. And the loading time between turns, even if you have not discovered the enemy, is just way too long.  With old heroes games I always liked the early and mid game, while the end game, especially on big maps, felt like a chore. Just mopping up, no big fights or anything. But this game at this stage feels like a chore from the start. That is too bad. Having to visit fewer buildings in a small space would be a step up, also making a strong endgame- for example with a capital city being extra hard to conquer due to extra defences; that could help. Plus perhaps if you conquer the capital, all other towns of that faction turn over to you. Making it more high-risk-high-reward to try to take. \n\nOverall the cities look beautiful. However the city building is tiring, with a spreadsheet of buildings right in your face and the multiple clicks you need to open the building spreadsheet of the next town. This really needs to be more streamlined. Make it like HOMM3 in terms of reducing the number of building tiles and reusing the same tile for upgraded buildings. This improves the oversight tha the player has over the game.\n\nThe laws system is a nice addition in my opinion, but not something that I want to check every day. It gets me out of the game. Maybe new laws could be introduced once a week, on day 7, based on the points you have collected throughout the week? \n\nThe map design I have serious problems with; there are so many things to visit in your starting terrain, so many resources to collect, so much time spent running back and forth before you can break out and start your adventure. Really the strength of some heroes games is the feeling of exploration and the excitement of finding a dragon Utopia or a Crystal Dragon dwelling, or discovering that you can fight a bunch of titans to pick up Angel Wings. So far I did not have much of that excitement in this game. This requires good map templates, clear structures with distinct functions or rewards. Also I doubt a bit if its a good choice to have multiple starting towns of the same faction in the same starting terrain. On the one hand it's great for unit growth, on the other hand building up the same town multiple times at the beginning of the game is kinda boring. Perhaps you can add a feature that you can build the same building in all towns at the same time, for a discount if you build multiple at the same time or something. \n\n-> also a fun idea I recommend is, what if you conquer an enemy town of another faction, and the terrain of that faction slowly changes to your own native terrain. For example green fields slowly turning into snow if that was the starting terrain of your faction. Showing the lands you have conquered slowly changing to your rule and eventually also giving you its terrain bonuses. This could be a great feature!\n\nThe factions: Overall the different factions have cool towns. So again well done! However the units I have problems with. In general it is difficult to see what a unit does, how strong it is and if it has a ranged attack. This makes it hard to judge which fights to take. I mean if the jellyfish-looking unit is blue it shoots and if it's green or red it doesn’t. This makes no sense... Make it clearer! Also the human lvl 1 swordsman looks real strong, but turns out to be a lvl 1 trash unit. Come on, it has nice armour and a cool helmet, just to be a trash unit. Too bad, so sad. At least in HOMM3 you had pikemen and swordsmen clearly being as strong as they looked! And in general the units of the human faction are looking so bad! The \"mighty\" knights ride on ponies; what is this knight with a book and a mace, it looks ridiculous; the angels are meh; and what does this sorcerer lady do in this faction, this unit doesn’t fit with the style of the rest of the faction! Might be better to place her with the elves for example. The units of the other factions are also often weirdly designed. As others said, like your run-of-the-mill mobile game. Here, improvements would be had at this stage, but it is also where it is most necessary. Heroes games have rich lore and distinct units. Make them look serious and cool. Not whatever this is. Heroes 3 and 5 did much better.\n\nThen the magic... it feels off and hard to follow; with spells that you can upgrade - but how does this combine with magic schools, spell power, mage guild level and wisdom. Its just messy...\n\nThe battles also could use improvement. The hex grid is great, but so sad that you don’t have those corners on the map like in HOMM3 where you could stand with a shooter protected by just 2 other units. Now it's harder to protect ranged units in from melee units... Overall the maps have too little terrain features to make battles feel different. The tactics option at the beginning of a fight should have an option to turn it off. In general it takes too many clicks in this game to do things. Tone those down and streamline them. The battles are alright all in all, not super exciting and a bit frustrating because of the difficulty identifying units and what they do…\n\nThe heroes look cool, that’s nice. They could perhaps be a bit more distinct per faction, but overall I'm not complaining.\n\nAlso how about getting the grail? It must be in there somewhere, but I feel I have missed it completely every time... are there hints? \n\nAnd then the music. It's all right. I hoped for more memorable music, more bangers. But perhaps we still get those in the main game. I also really hope the campaign has a good story (and not just destroy this conquer that).\n\nAnyhow, I could say more, but this is it for now. I really hope this becomes a good game: the basics are there, but also big improvements are needed. The development team seems very passionate so I hope they make it work. Good luck!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "[h1]Totally not impressed.[/h1] \nI played for less than a week in the first free scenario, and quit. It is just boring, sorry. And it looks pretty meh, too.\n\nAs a Russian, I am a big fan of the HoMM series. I played HoMM3 for lots of hours, I played Homm4, Homm5 a little, tried 6 and 7, and other HoMM-like titles. I have some experience on the matter, believe me. So this one... to me, it feels totally bland. A mindless copying of the basic HoMM mechanics with a lot unnecessary complications. Like a very expensive fan mod without any ambition to it, to make a picture for you.\n\nGoing into details, there are three things that I dislike in particular.\n\n[h3]1. UI.[/h3]\nIt looks almost like Homm5 from 2007. So many shinies! So many circles! So many progress bars, large explaining icons, and the worst of all, the animated 'things' that appear on mouse hover! For god's sake! it feels like you've had a student who just learned this trick and puts it wherever possible. The second worst thing is that no one seemingly put a thought to actual UI design. Why are creature stats shown in a row, not in a column? Do you really think it is easier to compare two creatures that way? (Not even talking about hovering to see the stats here!) Why can't I right-click a camp on the map to see the menu of creatures to hover them and see what they are?.. We get calculated results of an attack, but the cost of spells must be calulated manually (as \"40 plus 10 for each magic power\". Why?..\n\nTL;DR\" Everything is too cluttered, but gives too little info at a glance, and hurts the readability with shinies and animations.\n\n[h3]2. Unnecessary complications. [/h3]\nI understand that you wanted to 'add something' But as a result, we've got a lot of new systems on top of what's already there. Learning spells one by one! Really? For how many days should my hero sit in a castle to learn everything? A month? Upgrading spells! Spell learning resource! 'Law' resource! Alternate creature upgrades! That can be changed back! Additional alternate attacks! Stances! \n\nTL;DR: Lots of things that only adds costs in cognitive load and time consumed, but gives no reward.\n\n[h3]3. Graphics.[/h3]\nSeriously, this feels mobile, overall. Lots of bright high-contrast well-detailed stuff, but at the same time all of this blends together, nothing that should stands out. Treasures are the same as terrain or monsters, terrain is the same as dwellings. The map all looks pretty monotonous. The city inside is pretty-ish, but also monotonous and hard to navigate in 3D. (this here is also part of UI, it's called diegetic UI). Shadows exist separately from the creature models. Luminous elements do not illuminate world around. Don't know what else to mention here... \n\nTL;DR: It's all feels so... flat and artificial! And it must feel living, and nature-like!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game is on the right track but it's still a long way from where I feel a proper successor to HOMM should be in 2025.\n\nThere are many good ideas presented in the demo and it's obvious that the devs are drawing from the best aspects of previous HOMM games, in terms of strategy it's on par with the others apart from maybe 5, but there are many things that need to be polished:\n\n- AI needs to be balanced, it swings seemingly arbitrarily from very easy to very hard no matter the actual difficulty setting.\n- Sounds seem to be missing for many units and UI buttons, making feedback for somethings feel really empty.\n- UI is generally really oddly placed, from the turn track to the buttons for waiting/passing.\n- resource distribution feels really weird, as you are often left with far too much wood and ore and are seemingly always choked by how much alchemical dust you have.\n- Spells, while plentiful and interesting in theory, feel far too weak.\n\nOn top of this the game doesn't really strive to do more than simply be a rehash of previous HOMM games, it takes ideas but never pushes them further or elevates them in a new and meaningful way which just makes me want to go play HOMM3 or HOMM5 instead.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's a decent Heroes game, quite playable on small maps.\nThere are some flaws but for the biggest fun killers are two things:\n- no grand battles\n- new mechanics kill each other\n\nNo grand battles:\nAfter one in-game month level 10 hero with 500 units just autowins everything on the map with zero losses. You just get overpowered with nothing to challenge you. By the time you get tier 5 spell you are already unbeatable and it has no use. Maybe I'm spoiled by playing H3 WoG where you can enable stronger neutrals with growing overtime but I remember fighting 30-50 tier 3 level 7 units, being a challenge even for level 20 hero. Or maybe it's because here neutrals don't have strong passive/active abilities...\n\nNew mechanics kill each other\nCLASS. You can get an upgraded class by drafting 5 specific skills. You have 8 slots, hero usually starts with 2 skills, one of them is not class-based, so you need to draft 4 specific skills into 6 slots so there is low probability you you get such a chance. Also this means that you can only get 2 non-class-based skills which really breaks the idea of skill synergies.\nFOCUS. Unit abilities consume focus points, so if you want to use them you need hero skills that generate more focus or decide which of them not to use or choose unit upgrades that don't have abilities. You can't just have 1 jinn that automatically give haste to another unit, because you may be unable to generate enough focus or you may have better abilities to use. There are units that can increase others speed and initiative, but it's most advantageous at the start of the battle when you don't have a focus point. What's worse some hero abilities use focus, as necromancer you can revive some units but it costs 3 focus points meaning that you have to forget about unit abilities, and even so if you have 3 unit stacks and fight one strong stack you won't generate enough focus before battle ends and can't cover significant losses.\n\nAdd here some other minor issues:\nMagic feels underwhelming. Tier 1 lvl 1 spells feel useless, they just give +-10% unit damage or 1 speed. In H3 you could bless your lvl1 units to deal max damage instead of 1-3 range which is effectively +50% damage. And maxing corresponding hero skill spell school would allow you to use it on all units. And there bonuses for 1-2 round duration felt very good, especially on knight-type heroes with low magic power. But here... you need to upgrade specific spell using resource that is required for unlocking level 7 units, and there are some other things making good usage of magic so costly that it takes so much time to get enough upgrades that they are totally useless by that time.\nClunky UI for unit upgrade of hero visiting the city, or hiring units of same upgrade type that hero has without stationing hero in the city and back which costs movement points.\nHard to distinguish units that stay behind other units and have their model fully overlapped so sometimes you have to manually inspect several stacks to know what you're fighting.\nAnd lots of other minor issues.\n\nOverall it's a good start, the game seems fun and balanced enough on extra small maps where it takes less than a month until the final battle. But for something more complex it needs a lot of core mechanics to be completely reworked. And it needs a lot of quality of life updates.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h3] Demo-review: [/h3] \n\nI really want to like it, I do. But I just ... can't. \n\nI realise it's still a WIP, but oh my will they need to fix a lot for me to fall in love with it. \n\nDisclaimers out of the way first: I've played HoMM III since it released in the late 90'es and I still play it on GoG with the expansions and fan-mod (HotA). I love it. I think it's an amazing game and the attempts at making follow ups have failed in my opinion. The least dreadful (still just my personal opinion) was 5, but oh man, the loading times on that thing made me rage quit more times than I'm proud of. Also, I don't play on higher difficulties. There, I said it. Don't judge, I'm not judging you on your cravings for nightmare difficulties.\n\nSo. OIden Era. Hmm. I was excited by the promise of a Random Map Generator and sweet words of returning to the old. To be clear, I've seen a few bugs, but I'm not going to judge a pre-release on bugs,.\n\n[b]The Pros: [/b]\n- The demo is a very good size and includes both tutorials and free play. Respect!\n- Buildings, landmarks etc. are recognisable from the old games, with a slight twist. For an old fart like me, that means a less steep learning curve ;-)\n- I'm okay with the graphics overall, they're slightly cartoon-y, like WoW or Guild Wars. \n- It's an attempt at making a new HoMM-game and that's plus in my book.\n\n[b]The Cons:[/b]\n- As others have noted, it can be a bit challenging to see what's landscape and what's something you can visit. To further the complication here, the mouse symbols are offset, so if you want to know if an object can be interacted with, you need to mouse-over UNDERNEATH it. At first I thought people were over-reacting a bit, but honestly, it can get pretty annoying.\n- It feels .... sluggish. Not just the load times, which would have been a stretch even back in the 90'es, but the gameplay just feels ... sluggish. I'm sorry that I can't describe it any better, it's just everything from the way you move to the way you fight, almost feels like there's a tiny little delay on everything, making it feel rather slow.\n- Tutorial's great! - and horrible at the same time. No idea how they pulled that off. I'm sure you've seen people take a swing at the tutorial and I have to somewhat agree. It's certainly the first time I've needed a tutorial for the tutorial. What's there is good, but I feel there are areas missing.\n- Something about the upgrading of creatures bugs me like crazy. You cannot simply BUY an upgraded troop. You have to buy the basic (and make room for them) and THEN you can upgrade them. Separately. When you upgrade, there are TWO versions, but you have to upgrade to a set one first and THEN potentially change the upgrade. The \"overview\" of the two types is .... lacking, in my opinion. I might be missing something obvious, but I have to sit and mouse over the abilities etc. and then compare that with the numbers-comparison in the middle. I always feel a bit unsure what I chose and there is very little visible difference between the types. \n- As things are right now, whenever you send your hero somewhere, the path will be wiped between turns, so you need to remember where you were going. Needless to say I'm pretty sh*t at that....\n- Others have also mentioned alchemical dust. Considering how immensely important it is, this is one where I feel the tutorial was useless, as it just went through how you can use it for upgrades and probably mentions offhand that you can get it in different ways. I should probably revisit that part of the tutorial 🙄\n- I somehow feel like I'm missing .... hmmm.... not sure what the word it. Knowledge, information, overviews? Like, when I go to build my town, for some reason it's just not transparent to me how my troops will be or what the progress of my build is. Everything in the build path is twisting and turning and it just seems a bit muddled to me. I also really miss an overview of my creatures, including upgrades.\n- AI opponent: something is rotten in the state of Jadame. I had my two towns, emptied the dwellings every week etc., and suddenly my opponent popped through to portal and absolutely wiped the floor with me. I'd hardly had any losses at all, so how the heck it could have such a large army is beyond me. \n\n\n[b]The verdict: [/b]\nLook, I've only played for about 12 hours and I'm sure some of this is just a matter of a learning curve. But one of the elements I like about a game like HoMM III is that it's easy to learn, hard to master. This seems needlessly complex from the get-go and I confess I'm not the fastest at picking that up, so I'm definitely biased. The loading times are hard to forgive, period. But mostly, my review is basically triggered by the fact that every time I've played this, I've quit in some form of all-round frustration and then played a map of HoMM III / HotA instead.\nI don't know how much feedback the devs have gotten, but it's probably a lot. I am definitely following this, because I do feel that there is potential here, I just think they might be .... overthinking it. I love that they're trying and I really hope this grow into something better in time. I also respect their decision to move the launch. So I'm rooting for you, guys, even though I can't recommend this in its current state.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h1]Listen, this is a good game, but I have a lot of questions about graphics and units.[/h1] UI is somehow very good, but battle graphics are... Just bad. Redo them pls. \n\nAnd what's wrong with the creature names? Like \"bloated\" Arbitrators? And what's wrong with the lineup itself, why it literally has nothing to deal with the faction and why it consists of unknown game-invented creatures that makes the player feel lost? Like why a ctulthu-inspired Schism has only 2 actual lovecraftian-related units?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overloaded with weird mechanics that add nothing to the gameplay. Just boring..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had a problem how to review this demo as Olden Era is still in development and there is no Steam's neutral review option.\nWhile I enjoyed OE I am a singleplayer gamer first, so I decided to give \"not recommended\" review.\n\nFirst pros:\n+ It's not \"a mobile\" game, no matter what some desprate \"fans\" would want to you belive. It's fully HoMM game with its spirit. Sure, it's not HoMM3 game and hopefully will never be, as trying to emulate third part of franchise was never a successful idea.\n\n+ I liked it. There still is \"one more turn\" feeling from the demo. Heroes development is a much improvement from H3's times but still need a lot of work.\n\n+ Town screens have some issues but overall are beautiful and \"live\". You can see citizens moving around cities, something which was missing since HoMM1.\n\n+ Alternative creature upgrades. Just like in last previous games, you can choose one of two alternatives and change them during gameplay.\n\n+ Lots of spells and magic in the demo seems overpowered. They're not balanced yet and I find it's a good thing as nerfing things to the ground in search of mythical \"balance\" always leads to a game being boring.\n\n+ New magic system. While you still get random spells in magic guilds, now you can pay to research/unlock missing ones. You can also can upgrade spells by using resources or by building more guilds (each additional doubled spell count as another spell's level).\n\n+ Combat seems to be fun and units have a lot of nice and useful abilities. Same for each factions.\n\n+ Lots of artifacts which can be upgraded to be even more powerful, althrough you won't have much resources to do that in short games/on a small maps.\n\n+ Demo is very easly moddable and I guess the game will stay the same.\n\n\nNow cons:\n-  While there is \"one more turn\" syndrome, the game becomes boring very quickly. You test each faction, most of heroes, alternative upgrades, spells, etc. but after that, Olden Era doesn't have anything to hold you for any longer. Sure, it's a demo and not a full game but nevertheless you get bored very quickly.\n\n- Maps. There are not maps per se but random templates focused on PvP aspect of game. They fail for singleplayers as while there have plenty places to visit with your heroes, their main focus is to destroy enemies ASAP. Each starting zone in a template is also a mirror of enemy's starting zone, so you know what to except. You also start with additional neutral (mostly) non-protected city or two in your zone, plenty of mines and creature dwellings, and lots and lot of resources to level up your city and army very quickly. That's very PvP mindset and there is no time to explore whole map unless you really want and prelong the game just to do this.\n\n- While factions have unique units and mechanics, you play them as for now nearly the same. Sure, first week may be a little different but after that? Just gather your troops and roll out, crashing every enemy under feet of your army.\n\n- Battles. Current autobattles are quicker and you lost less troops as the game can't calculate real losses and just make the number up. AI is still not good and only win if the player don't rush at it as it can then enmasse more creatures from external dwellings and castles.\n\n- Lots of spell but not all are useful. Damage spells become less revelant as the game progress and overall they are weak. You also need to upgrade them to get their fully potential. While it's better than having \"x magic\" skill which makes a low level spell a mass version, it's still IMO inferior to magic system from HoMM2 and HoMM4, where mass spells were higher tier magic.\n\n- Too many artifacts. Most of them are worthless (common and rare categories) and you don't have resources to upgrade them as you need these resources to ugrade buildings in your cities. Artifact sets are also underwelming and not worth to complete.\n\n- Faction Law system. Basically a very limited research \"tree\" which you unlock with battles and town buildings. There is no relation between perks, so you only needd to unlock new level to be able to buy next perks. You can't buy them all so in the end you would always choose (nearly) the same laws. Laws UI is too small and ugly.\n\n- Skills and heroes specializations. Some are overpowered, other not worth to bother. There are five sub-skills for each skill but you can only choose two and sometimes the choice is so obvious, you just wonder, how this even passed during game desing?\n\n- Tragic UI. Too small and hard to read icons, icon colors that look nearly the same, buttons placed all around screen instead in one place, lack of information when you point mouse curson on it, lack of R-click options for many, many things, etc.\n\n- Adventure Map readability. It's hard to tell which object is a map decoration and which is visitable. There are also resources you just can't notice because RNG placed them behind some rock or tree. There is an ALT key to highlight them but if you need to press a special key to see a map object, then something is wrong with your design.\n\n- Creature and heroes design and portraits. It's hard to tell, which alternative upgrade you will fight and it was initially hard to tell, which creature you are buying. Fortunately devs changed a little that but the problem still exists. There is also a problem with portraits. Heroes portraits are hand-drawned (sometimes good, sometimes bad) but creature portraits are 3D in-game miniatures which IMO look worse. I think this clash of different graphic styles is the main reason why Olden Era is called \"a mobile game\". This and UI.\n\n- PvP focus. It's clear to me this game is first and mostly focused on PvP games. Map templates instead of Random Generated Maps or scenarioes designed by humans/devs (althrough devs promised these features will be in final game), game mods for PvP players, game focus on combat and not enough of map exploration, heroes development, economy, etc., all these just point that devs focused on PvP aspect of HoMM games, especially HoMM3.\n\n- Some red flags from devs behavior.\nEarly access was postponed IIRC twice and as for time of this review doesn't have a date.\nThere is also a case of devs calling themselves \"true fans\" - if you are a fan, you don't need to reasure yourself that you are \"true\" fan (do you need a certificate for this?).\nI find also strange that for \"true\" fans devs sometimes behave like they didn't play other games than H2-3 and 5.\nIt's personal opinion but I have a feeling that Olden Era started on backbone of H7 and went from there to build its own self. It's nothing wrong in but many \"new\" features of OE were already present in H7 or even earlier but Unfrozen somehow \"forgets\" to aknowledge this.\nOn the other hand, Unfrozen really \"hears\" the fandom and make lots of changes so it's not that bad but nevertheless red flags are here and can't be ignore.\nThe last of red flags is that Might and Magic franchise is owned by Ubisoft and while I have some doubts in Unfrozen, I have many, many more doubts in Ubisoft and I fear they can screw the game just before the release (like introducing a DRM) and devs would have nothing to say in that case.\n\nOverall I'm not against Olden Era and will see, how it would be developed futher but I don't recommend to pre-order or buy it in first day. Just wait and see.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The demo it is very buggy at the current stage.\nNot recomnend at all.\n\nTry demo and i stuck on infinity loading when i attack to an enemy castle and ofc cannot progress finish the map.\nGeneral the game is not give the old good vipe. Music especially it is very generic and bad.\n\nIn the end game has allot to improve before it is playable, expect demo is old version of it...!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game takes inspiration from Heroes 5, and includes many changes introduced by it, but fails to bring the most important change: unit action rate (which was tracked in Heroes 5 by initiative). In this game units take turns acting, so a zombie acts as often as a dragon.\n\nSome good features kept or introduced:\n\nUnits have two upgrades.\nHero skills have specialisations.\nHeroes themselves can reach one of two potential masteries.\nItems can be part of sets.\nHexagonal tiles in combat.\nMany creatures have usable abilities.\nBesides upgrading towns, players can also upgrade the realm. Some of these upgrades are shallow, but others can be game changers (for example, the ability to construct two buildings per turn)\nCastle fortification upgrades can also specialise.\nItems can be upgrades.\nThe graphical engine is really good.\nI liked the draft hero build and follow up battle mode.\n\nSome awful features, besides the lack of HMM5 initiative driven action rate:\n\nThe resource system was simplified, which is a trend in the age of games targeting the common denominator.\nCombat maps are tiny.\nIn-combat tactical deployment is basic. Changes don't save between fights.\nCreature dwelling units can not be recruited inside towns, like in HMM5.\nFaction differences are token at best. Nothing like HMM5. The system could not have been made more shallow if the developers tried.\nThe art design suffers from a \"samey\" look for units, compounded by units having mostly the same size and the same narrow colour pallet...\nThe art design suffers from a bland colour pallet. This applies to the world and combat maps. Things blend in and tracking what can be interacted visually is exhausting. One has to keep Alt pressed at all time to highlight interactibles.\nCombat unit abilities use a shared resource pool and have obnoxious cooldowns. Truly shameful compared to HMM5.\nHero skill specialisation are bland, shallow or both. Again, nothing like HMM5. The system was clearly an attempt at simplifying role playing and hero growth down to the mobile audience common denominator level.\nSpells are bland or just awful, again nothing like HMM5 or even Heroes 3.\n\nThere were other features I liked or disliked, but these were minor.\n\nAt this stage, it is unlikely that changes will occur to the more critical issues shown above, hence why I do not recommend the game. Play the superior Heroes 5 Tribes of the East instead...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Instead of Evolution, and improving the already good aspects of Heroes, there is just so much that is literally driving me insane. It is the convenience features, like being able to see initiative numbers in battle, right on top of the units, so you have to click like a slave, open each unit to check per hand, so you know that your Haste spell will or will not push your unit in front of the other in battle. \n\nAlchemy Dust idea... I absolutely HATE as resource, it just makes the game longer overall before you can even upgrade anything. The Focus points are a completely retarded mechanics... To even cast a unit spell, you really have to think about what you may cast, cause you probably won't get to cast a 2nd Focus spell. \n\nI am trying to log back in, only to get simply annoyed by how stupid some changes to the game are... Town Portal at lvl 4 Magic Tower and level 9 Hero, after this being pretty much a basic spell in H7. The game simply feels like a  unnecessary Grind... The gfx are solid, even tho the visibility could be better...  the usage of \"inspection unit window\" is strange, huge spaces are occupied by miniature units as far as sizes. The wanna be freedom you are believed you have, building a char, is restricting via. skills you either have to take for your subclass, or not, and miss out... \n\nAt this point of time, I can say I HATE this version of the game. I really tried hard to like this, it is just not for me. Sadly if Steam or Ubisoft connect would run H7, I would play that instead... I could probably write an essay about what is wrong with Olden Era, doubt anyone would read it anyway...\n\nTher game is MEH at best in its current state and by the time it may be fixed, I doubt I will want to log back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a very hard NO for me to give because I really want for this game to succeed and bring back HoMM to modern age gaming, and thats why I'm not recommending, because I think they are on the wrong track on so much of it, clinging to the standards of a long forgotten era...\n\nI know that it is a Demo and the game will still enter early access before a full realese, but I post this with focus on the TRACK they are in, that I'm not totaly into it...\n\nFirst, the good:\n\n- Game is beautifull, loved the art, it is really something they achieved here, the animations, the map, the spells, the units, really nice looking and RPGyish, I could apreciate some units animations forever, the hero portraits, and the cities.... God, every time I open a City interface I stare at it for 4-5 minutes before doing what I was to do, It really distracts you, thats really something!!\n\n- There are lots of spells and skills to master and the hero specialization seems interesting, the magic schools and spells are great and I liked the Mage Guild mechanics with the Alchemical Dust. but it still needs more... maybe uniqueness for each hero, I don't really know what to point here, but it is on the right track\n\n- Factions have their unique atmosphere with their cities and units in their terrain with unique PoI for each, I practicaly said that on point 1 but it really needs mentioning again, very well done.\n\nNow the bad:\n\n- There is too much POIs and yet too little... It transforms the exploration into a Slog Grind. example: there are regions with unique dwellings for hiring units that improve growth in cities as well, like the quiet pavillion for hiring ghosts or Crypts and Graves for skelletons. But there are a LOT of them, like..4 for skelletons, 4 for ghosts, 2 for Hounds, 1 for liches in 1 city region, if you get 2 cities, be prepare to plan circuits to recruit troops from 15-20 of them every week, not even 2 Idle Heroes could do all of them in one week... And that goes for every other PoI too, too many of the samey collectables that restock weekly, too many of the samey XP gaining, Skill gaining, etc. Make them fewer and more impactfull each ASAP, or one game could take dozen hours of uninteresting exploration even before encountering the first player/AI... I want to be for the most part of the game battling units and not recruiting them...\n\n- Give us some unit type specialization layer in the game. I'm not even talking about artificial caps that divide the community, but make it possible to exchange growth of some units for others or that only some of them could be upgraded per city, or exalted in that city (e.g. Only Skelletons and Liches can be upgraded in this city, this is the SEKLLETON CITY) This would give great strategy replayability to the game, with the same faction I could build it around 3-4 units, or even all in in one or 2. Let's think, why cant I build 7 Skelleton Crypts in a city instead of building the dwelling for each one of the faction's 7 units?? I know some heroes have unit specialization and thats nice, then let us compound on that with the city builder layer! Today it is very similar to HOMM dullness -> To get the most growth of everything as soon as possible, put them in a single army and steamroll the way to the victory hoping your enemy lost more units and recruited less than you, cuz if not you already lost and don't know it....\n\n - Factions are bland... I know I said they were atmospheric and unique in their way, and they are! Visually.... Atmospherically.... Now Mechanicaly?? They are not! Each one play exactly like the other apart for the type of damage they do. Start a game with one faction, recruit one of every unit, contemplate their pretty animations and some unique abilities and thats it...you see all that was to see for it, lets try the next one, after the 4 there is little incentive to play again (or even to finish the 3 other matches that no one could end because all the time was spent recruiting units in 20 dwellings untill one got done with it... Give us some different buildings that do different stuff, there are only 1 of the kind and not even for every faction, and it introduces a dull system of passing a day for gaining skills... When I saw \"Well of Souls\" to be built in the Necopolis city I got hyped \"Now that will be interesting\".... It turns out it just refill bypassing heroes mana...\n\nI think that the most of it. I reaaaaally want to change this review and buy the game at full price if it turns out to be great in the release, this game has the potential of an ERA to spiritually restore the Legacy of HOMM. I loved Unfrozen's IRATUS game and know the capacity of the developer behind Olden Era, so yes I'm requesting more, because I know the master piece this game can be",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overcomplicated in a bad way. HMM3 was a legend because of predictability and strategy.  This one unfortunately has so many uneven ways that make it random.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This review is in English and Slovak language:\nTáto recenzia je v Anglickom a Slovenskom jazyku:\n\nAfter a very short period of enthusiasm for the new Heroes of Might and Magic, I'm currently disappointed. So far, it just feels like a graphically improved old game with a map blown up to enormous proportions. I hope that changes soon.\n\nPo veľmi krátkom nadšení pre nové Heroes of Might and Magic, prichádza momentálne sklamnie. Zatiaľ mi to pripadá len ako graficky vylepšená stará hra, ktorej nafúkli mapu do obrovských rozmerov. Dúfam, že sa to čoskoro zmení.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had fun, a simple classic TBS.  Which I cannot recommend atm.  3 game breaking bugs I have uncovered.  1st hero leveling option page where you select attribute or skill.  2nd casting id npc spells when no fow left. finally a magicall item called ''golden goose egg'' Leveling that item high will break & all of these bugs either freeze / corrupts that instance and you will have to load an earlier save or restart game.  Hopefully they will fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I couldn´t get past my first game. Everything looks like an updated heroes 3, but carries pretty much every single problem newer heroes had and adds a bit of it´s own. It´s grindy and yet with little to now feel of reward, AI cheats even worse than in Heroes 4 and while the various abilites are cool concept, most of them turns out to be meh at best. And necromancy sucks so much it´s pretty much useless. Shame, I was hoping for a proper new heroes but this is not it for me. \nI guess if you enjoyed the later installments of the franchise you might enjoy the game, but to me it´s pretending to be something it definitely is not.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Inferior to HOMM3 and even inferior to Kings Bounty: The Legend. Fewer castles, fewer biomes, too many menus, too many buttons, overcomplicated and not very good UI and bad performance. Sorry",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How do you take an almost 30 year old game and throw it on its head? Twice my main party was stuck inside my keep and i could not get out. I just cannot even begin to state how cringe i feel about this games re-release.\n\nThis is like messing up tetris, it takes a ton of skill to be able to pull that off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2nd mission of the tutorial. told to go down the road and fight the enemy hero and use the teleporter. The road is blocked by trees. Neither of my heroes can interact with the trees and move forward...\n\nI just don't understand what they want me to do.\n\nMusic is fun. Game play reminds me of HoMM3. But if you can't code a tutorial to teach me your game why should I trust ya",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have recently been playing a lot of HOMAM 7 and I was excited to see this new game coming out.  But after trying the demo I can say that I probably won't be playing it.  The Elves have lost their own faction.  The hero skill tree leads you blindly by the nose and leaves no room for creativity and methodical planning.  Although the artwork is slightly nicer, it's clearly overly embellished.  It looks like all of the interests have gone in reverse from the original concepts that made the game great.  \n\nThe struggles of the game's continued success before now were not due to the marginal differences that it seems this new development is focusing on.  The struggles of the game were because of how methodical you would have to be, and how long a game could take... and how crappy it is to play against a computer because the computer would be using data that it shouldn't rightfully have access to.  For example.  A computer would know the second you take your main force off your base, despite having never ventured over to your base.  Purely Enraging Design.  \n\nIt's pretty sad to see to see games being made by people who have no heart to even play them...  Because they make drab games. \n\nWhat this game needed was more race specific factions.  The more the better.  Orcs, Elves, Undead, Goblins, Angels, Demons, Humans, Halflings, Drakonids, Avians And perhaps a race that lets you mix and match character types from each of the others.  But God forbid you all figure out objective game-balance theory. \n\nThe game also needed to Trivialize the other heroes, and make their routines designated and automated so that people aren't wasting time trying to think from the perspective of multiple heroes, anything over 2 is too much for the common person imo.  \n\nFor example, one hero is the resource runner, and will run it automatically until every resources in a DESIGNATED AREA is claimed.  Even allowing those heroes to explore the FOG of war for you in an automated fashion.  \n\nI think it would be wise to make a few archetypal hero roles, two of which are actively played by the player and control army forces, and the rest should be mostly automated.  The Militant, the Governor, The Economist, the Diplomat, and \"Priest\" class (which would probably be rebranded per faction group.)  The priest would bless the troops with magical armors, and attack buffs specific to the tree of magic that the player would ideally get to freely choose from.  \n\nPeople should be able to choose which 2 of these 5 to lead their armies, and heroes should be capped at 5 total from up to 20 or more per faction.  (These hero types need to cover a variety of personality types so that people have characters that they can self identify with)   Only 2 Heroes should be designated as fully playable and the other's appear under their specific roles only.  Like a priest to appear and apply a special blessing to the troops, etc.  The three non-fully played heroes take on a more simplified position but still HIGHLY SIGNIFICANT in terms of buffs, economics, and diplomacy.  And diplomacy should be reworked to allow the diplomat to speak on behalf of the army forces, without requiring them on their person.  And so much more.  Diplomats could at first have to travel in a special carriage, and maybe be escorted by the troops manually for safety, and maybe later on through upgrades get special flights to designations via Gryphon or Dragon-back. \n\nThis is just off the cuff here.  I'm gonna go back to HOMAM 7 until the absolutely despicable tactics of your AI systems frustrate me to the bitter end of my enjoyment of living out the themes that resonate with me there.  Which wouldn't be a problem if the development studio had figured out a way to make the game play a bit more quickly so that the PvP against other people wouldn't be so intolerably slow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am writing this review as a massive HOMM3 fan, so perhaps it is doomed to be a bit biased from the very beginning. The game has generated a lot of hype recently and I do love the way they are promoting it, especially in terms of their YouTube channel. I do think that the creators have very big shoes to fill when creating a game for this franchise: it is very hard to encompass all the good things about the previous games while still trying to make it feel new, exciting and unique.\n\nGraphics and UI\nI did not like the style at the start at all, but it has grown on me a little bit… I do have to agree with a lot of other gamers and say that it does look a bit “mobilesque”. The graphics on the world screen seem too rich and detailed at times and I know it sounds silly but it just feels overwhelming at times. HOMM3 had that “dark” feel to it that kind of made the game more serious. This one feels like it was designed for children. For me, it’s sometimes extremely hard to distinguish interactable objects from the background and I find that I would miss certain objects as they blend too much into the background. I never had that problem with any of the previous HOMM games. I would like to see a lot more sharpness in the design in this regard.\n\nTowns\nThis is quite a disappointment for me in general as all towns sort of feel the same, just different colour pallets. In general, I think a lot of buildings look like figurines from some table top game, just looks fake and out of proportions. Towns also lack sharpness, I feel I’m not able to distinguish if a building is a dwelling or if its just background. Some dwellings have extremely poor designs as well, for example the Dungeon dragons live in some sort of a temple (?) that looks way too small to even house a single dragon… Why not have giant caves in the back that you could zoom into and have them flying there in the background? I know it may seem too similar to other HOMM games but I think that would be hundred times better than the current tiny temple. For me, all towns just feel a bit cluttered and lack that grandeur that we all love from the earlier games.\n\nHeroes\nI would like to start by saying that I do like the variety of heroes and portrait designs that they have at the moment. Hero backgrounds are missing but I do feel like this is something that will come out eventually when the game is released as it’s probably one of the last things on the developers to-do-list (fair enough but I am hoping for decent stories and detailed backgrounds so we can fall in love with these heroes!). However, some heroes are clearly stronger than others and I feel like there’s a lot of imbalance currently. For example some heroes start with very powerful spells, while others have more limited abilities that may only be useful at the start or end-game. I think the worst part for me is the ones that specialise in units: at the moment, all heroes have the same stats and growth for the unit that they specialise in, e.g. the hero with Skeleton specialisation adds the same growth (+2) as the hero who specialises in Dread Knights (+2). Moreover, both of these heroes boost their specialised units stats by the same amounts, i.e. 1 speed, 1 initiative, 20% health and 1 attack/defence for every 3 hero levels. I think it needs a bit of balancing, especially for the growth part as +2 Skeletons/week surely does not equal +2 Dread Knights/week?\nAnother imbalance lies with the town specific hero abilities I think – while I love the fact that heroes have a unique skill depending on their faction, I do not think that they are quite right at the moment. For example, Temple faction gets Ascension, which grants benefits whenever one of your stacks die. So in order to get a benefit, one or more of your stacks need to be completely wiped out first. If the stack does not die, no benefit. In reality, you will be forced to manage your units in a way so you have a lot of 1-unit-stacks so that you can maximise this skill. Might work well at the beginning of a game, but I am not sure how well this might go at late game. Sounds like a lot of micromanagement for me… Other factions seem to have a lot more straight-forward passive abilities, that don’t really require you to do anything major, really.\n\nUnits\nVisually, in general, I think a lot of units lack sharpness. A lot of them seem very detailed but it’s actually impossible to see all that detail in reality. What I mean by this is resolution and details seem out of proportions. For example, the Cavalry unit in the Temple faction looks like a cheap plastic figurine. Extremely poor design. It makes me not want to even recruit them, I can’t stand the current design! Other units, however, are quite well designed, like the Vampires or Angels. Sentinels of Glory though, seriously, what is that design? They have wings growing out of their hips it seems? No. In general, very hit and miss in terms of unit design.\nAnother thing I don’t like about the units is that the upgrades lack uniqueness in most cases. This game allows for two different upgrades for each unit but for some units it really doesn’t matter which upgrade you take, your choice will not have a big impact whatsoever. I think this is a missed opportunity really as they could have done something similar to HOMM4 where the choice of your upgrade was permanent and so it did really have a massive impact on your play style. At the very least, they could have made upgrades more different in terms making units melee/ranged, spell caster/ranged/melee, tank/assassin and so on. At the moment, most of the upgrades just feel very similar and boring, why even bother with two different upgrades in this case?\nUnit abilities and the Focus mechanic, in my opinion, is a complete mess at the moment. While I do think the Focus mechanic is interesting, some units abilities are clearly better than others, so you will end up never using them, e.g. lower tier units versus high tier units. I think some Focus abilities should just be remade into passive abilities/spells to be honest.\n\nMage guild/magic\nWhile I do like the current system overall, I think it has its weaknesses. For instance, spells can be unlocked for resources, which is fine, but the problem for me is that some spells are clearly stronger than others, so players will only unlock the main meta ones in reality. The randomness that came with the mage guild is something that provided that excitement I think in the previous games; in this one it just seems a bit too easy and too accessible. I miss the unpredictability!\n\nLast thing I want to mention is something that I absolutely hate in the current version of the game, the Alchemical Dust. This is a super annoying resource that you can only find on the map, trade via a special building using your precious resources or gain by disenchanting artifacts. I played many maps at this stage and I never seem to have enough of this material, which is very frustrating, as this resource is required for certain town upgrades and also spell/artifact upgrades. I do honestly believe that exists only to add that “grind” factor to the game to make it more difficult and never ending. It’s a completely unnecessary aspect in my opinion. Either make it more abundant, especially in late games, or make it more precious to acquire but only needed for artifact upgrading. Also, some artifacts seem like they can be upgraded an unlimited amount of time, something I do not approve of. I like games to have finality, some sort of framework. Designing something to have no end I think only creates that unlimited grind possibility, something which I am not here for to be honest.\n\nIn general, I think it’s a very good attempt at a HOMM game but I do think it still needs a lot of work regarding different aspects of it. I have approx. 30 hours played at the moment and I am already bored. Will I buy the full version when it comes out? I honestly don’t know, perhaps when it’s on sale...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It looks pretty and has familiar mechanics, but there is not much substance in the demo. The tactical combat is slow. Map locations that have already been completed aren't obvious at a glance and cause clutter. Conversely map locations that are beneficial to visit again are not flagged so there is lots of clicking around to check status. There aren't any meaningful trade-offs or strategy in the city upgrades. A lot of the mechanics around unit types and magics are rendered irrelevant  because you can just create huge unit stacks. Upgrade/downgrade of units for different attributes is interesting but kind of annoying since you can accidentally downgrade when you didn't mean to and the unit level art is not always obvious at glace as to the good-better-best rank of the unit etc. etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay feels like total war's campaign map on a phone, the audio sounds like a generic MMORPG kit, but the art style is okay. Just feel a 'why bother' moment with the learning curve. Not for me",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know its Work in Progress but ... they should change direction of some critical parts in order for this game not to be a mess !\n1.  Units/ Creatures: \nfor now I gonna take 1 faction as example. In necropolis vampire lords are strongest unit ? they always were lesser tier behind liches. Bone Dragons were exchanged for lesser undead Pets ... what the hell ?!?\nWrights looks pathetic bland copy paste from heroes 5, Zombies looks boring as hell... i want real scary zombies, not this high fantasy variation !\n2. Theres too much points of interest on map ! im talking about places where you win battles and get prices, this just chokes pacing and makes game stale, in h3 your motivation was to get resources silos, get artifacts, become stronger while capturing dwellings, collecting chests, and rush to enemy with what you build. It was perfect pacing, now with dozen of point of interest it takes 10x more of your time. You could say i just could ignore it and rush it, but i cant because enemies are too strong, so u are dependended on this waste of time... Solution ? make enemy creatures weaker, remove tons of unnecesery dwellings, points of interest which just waste your time and space in map, fill it with more trees, decore and treasure guarded by enemy.\n3. Make maps smaller !\non h3 i like to play small maps because it takes small amount of my time and i like the rush but here... these maps are like 3x larger .. easy fix, just rename map size and add smaller size\n4. city interface is uninspired and too simplistic ... and i just hate alternative upgrades for units.. it waste your decision time and is very unnecesery . if you could choose skin for your units like in Starcraft 2 that would be quite fun actually and if game was successfull it would be fun part to unlock them or do microtransactions\n5. graphics. i know its work in progress.. but as for know im not much intrigued by design... especially for necropolis zombies, wights.. Design looks too much cartoony, has too much lighting, like for little kids playing mobile games... common !!!!!! just look at glorious models of heroes 2.3. they were simple yes, but looked great. Songs of conquest did it way better, but overall i dislike their too much pixelated design.. but yet they did serious artistic interpretation and its shows.\nPS I wish you well but if you really want success and applease the fans, you should not make these things half assed and need serious consideration in mentioned sections. I love that you brought music back, original resources (thou i should say i dislike new added resource which is distracting), i love how you made map interface, little animations, fog of war ... but i feel its just gonna be rushed half ass game as usual in heroes franchise and gonna go back to play h3 instead unless there gonna be big changes..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2025 HoMM3 remake-trying-to-be-standalone game:\n* generic mobile game aesthetics: ✅\n* uninspired, flat and hard-to-distinguish-one-from-another 3D gfx: ✅\n* flat and generic UI that's barely legible, hard to use and that doesn't even have all the functionalities present in HotA and has usability problems (hard-to-click hotspots, icons too small etc.): ✅\n* abysmal loading times: ✅\n* unneeded additions and complications like more buildings generating income in cities, double-upgrade system (that either allows two same-y upgrades so it doesn't matter which one you choose or one OP and one lame upgrade so you always select the same), new resources that are just a chore to mana, more complex hero skills that still provide nothing, more skills on units which you'll ignore since you auto-combat, swinging town view making you seasick etc.: ✅\n* preserving all the things that should rightfully die like once-a-week-visit-me-please hotspots forcing the player to have a horde of purely logistic heroes yet providing no way to mitigate hero movement micromanagement with no complex planning/preview options, rushing being the only reasonable option in most cases etc.: ✅\n* huge resource hog burning my laptop even on vsynced 30-FPS cap and lowest details, even though gfx looks crappy and illegible anyway: ✅\n* stock and forgettable music: ✅\n* unneeded random renames of same-y stuff like some buildings and units: ✅\n* hard to learn but easy to master: ✅\n* almost complete loss of the original vibe and neatness: ✅\n\nAnd yeah, it's somewhat playable, like a poor clone done by people who SEEN HoMM3, but never actually PLAYED it, neither casually nor as a pro. I'd give it a 5/10 by itself, maybe 6/10 due to nostalgia. I'm not a fan of Songs of Conquest, they do have a lot of problems, true, but they DIDN'T have access to HoMM IP, and actually managed to have a couple of fun inventions instead. Here, you have somethings that is just not able to hold a candle to HoMM3, especially in the HotA era.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not think it is worth buying judging the state of current demo. However, most of the issues I see are fixable. If there would be good progress, I would change my review.\n\nSome details:\n- Gameplay is nice, it is mostly borrowed from 6 and 7, excpept for hero leveling, which is similar to 5\n- Graphics are horrible, this is on the level of mobile cash grabs\n- One of the worst UIs I have seen in last decade\n- No optimization whatsoever. With graphics on level of heroes 5 it consumes similar amount of resources to a large scale total war battle",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As a long-time HOMM fan, playing Olden Era just makes me wanna play Heroes 3 or Heroes 5. So yeah, personally I consider that a failure.\nToo many resources everywhere (easily fixable I guess) ; but more importantly I dislike the graphics, too cartoony/mobile and therefore un-immersive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As someone who has played HOMM 1-7 and completed the campaigns in every game, I will recommend everyone to skip this one. Not only is it a major step backward in terms of graphics and music accompaniment, but the NPC players are given massive advantages over human players to the point of making it a giant waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of shiny things to collect, but the challenge curve is terrible. You'll maybe have a few actually interesting battles in the first week, after that you just auto-resolve everything and mindlessly hover up the loot while you wait for your cities to produce enough troops to take on the AI player's stack of doom.\n\nI tried cranking up the difficulty but it barely seemed to affect this tedious dynamic. So once I played a few games and saw most of the shiny things once, my motivation to keep on playing simply tanked.\n\nMaybe the series changed, maybe I did. If nostalgia is your thing, your mileage may vary. I'd rather spend my time and money somewhere else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Olden Era - is not a HEROES of M&M and not a numbered part. This is hybrid of Kings Bounty: Legend (2008) and Heros 5 + Hota (fan mod for Heroes 3). Unfrozen trying to trick fans by name of Heroes, but its not in one pixel! Its quality of mobile game, maded by AI. I was waiting fot this game and were ready to forgive a many things, but this is a disaster. \n- You can found in internet a greatet AI work, with Heroes: each creature has own separate world, hundreds of points of interest, touthands of details, every fold is visible, colossal cityes, million houses, - which together create a world of high fantasy in 8k resolution. True fans  draw a masterpieces in 100 times better, than AI \"created\" here. Fans expect classic and new-generation mechanics for battles, large action scenes by one click, battle magic and exploding catapults, units falling from walls, like in Lord of the Rings, etc. All this in free access so it is possible to create a \"World of Might and Magic.\" But nothin of this you will found in Olden Era. \n- PHILAN SYKES created iconic style of Heroes 3, genius artist, who influence on fantasy genre, video games, and mass culture. Nothing impress me more in my life. She was inspired art of Boris Vallejo, Rowena Morril, and other fantasy artisian. This is immortal style of book illustrations and oldfashion movies and iconoc RPG from 90-2000s. This is epic, and true spirit of high fantasy: its exclusive, pretentious, tedious, overly perfect. Unfortuntleu, Its a terrible shame in history of video games, that Heroes was really worked hard only one time, in 1998. Since then, last 30 years, no one tried to reach same highest quality. Maybe someone don't notice, but every sequels aren't Heroes 3, no matter what typed on a poster. Unfortunately, this happens to many series, that makes fans yearning.\n- Only Heroes 3 I can call the bible of turn-based RTS/RPG. This has simple 2D images, but so profound meaning - its unimaginable! Secret is not in form, but in imagination.\n- Heroes 3 was made in USA, by american way. It's a myth from an american sight, and there's a special logic. It's also a direct continue of Might and Magic rpg series. Unfortunately, New World Computing sold the rights to Ubisoft - that was one of the biggest mistake in videogame history. European companies are famous for making low quality games (which called \"European trash\"). That's why all other Heroes sequels has nothing similar to original. Hundreds of studios tried to compete with Heroes 3 and failed, because fans has zero interest! Who could only think, to give rights to someone else from a far? For series the best way is return back home. \n- Main question: would I play a game that doesn't have same illustration style from Heroes 3? NO! Am I interested in cybersport? NO! Do i need silly numbers and competitions in a scenario fantasy game? NO! What do everyone need? Heroes 3 and only Heroes 3.\n- Olden Era looks awful. The visuals are disgusting. Units are identical. Interface is confusing. The models look like porcelain, everything is so silly, thick, and murky. I recognize a lousy quality of models from Heroes 5 (2006). Style of castles, units, heroes is annoying. Everything in the scene is gather in one jumbled mess. I can't figure out what I'm seeing on the screen. This isn't a Heroes 3 illustrations. It's a mobile heresy.\n- Battles have maded shorter in favor of session games. The map's usable area were made smaller and there's nothing to explore. The game quickly pushes you to follow paths up to the enemy, like on branch of tree, but it doesn't work. There are 9x10 hexes, but not 9x15 as it was. Battles are faster and silly, and less tactically profound, similar to Songs of Conquest. It's very primitive, not progressive or modern.\n- Heroes is only scenario maps game. Medium maps is fine for session match. There is no point to make whole game \"сuted\". There is other way to make XL map faster to \"session standard\". Forget about cybersport - this will never be in Heroes. Hota is fan mod; aren't game designers. Mirror maps like Jebus Cross are disgusting. Heroes is game about fun matches with 1-5 friends, where the main focus is adventure and exploring, and balance is complete chaos.\nVERDICT \n- Game can best be described by characters' portraits - it's trash, garbage, disgusting, cheap, 0/10. This isn't Heroes! I played it a couple of times and turned it off, without finishing it.Prediction: a fail at test stage. Solution: cancel project and re-work everything from zero in the style of Heroes 3.\n- Unfrozen fans of Hota mod, but they aren't RTS/RPG gamers; they don't understand the story of Might and Magic, and other RPG. Developers should played Heroes 30 years ago to grown enough to make a sequel. Unfrozen's Director Denis Fedorov claims, that his favourite game is Kings Bounty, and Heroes is similar to it. But its not. He dislikes high fantasy style and like fairy tale style of Kings Bounty. Artistian trick everyone and sell his art in minimalism style, that has nothing similar. This all a disaster. \n- For some reason, Unfrozen keeps using name of \"Heroes\" - it's wrong. Change it to King Bounty and everrything will be fine. Unfrozen is trying to made a money out of mobile game, and bought mobile engine from Asian studios. Ubisoft should hire a true fans, who able to made a same high quality sequel, as original Heroes 3.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit demo, no explanation of anything what so ever. you would think they would want to tell you how to play the game but nope. dont even get very good tool tips. based on this demo this game is going to bomb on release. no reason to create a demo and not tell people how to play it......here ya go figure it out on your own cause were to lazy to tell you how its intended to be played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are terrible.  I have all graphics settings \"High\" (GeForce 2070), but everything looks fuzzy on my 27\" monitor at default res(1920x1080). I can't tell what some many of the icons are on the world map. The battle map is equally \"fuzzy\", as if the units are pixelated. Maybe the devs didn't consider some of us still have old PCs.\n\nCombat is typical HOMM, with very little tactics.  I was really hoping they would make combat more engaging, but it's really not. I've played many, many strategy games since HOMM was king and the combat was far more engaging.  HOMM combat is now too simplistic and boring.  There's no elevation, cover, etc.\n\nIn it's current state I doubt I'll buy it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't like it ... they said it will be more like the old HoMM3/4 which I loved to much but the demo was so confusing, I couldn't handle the GUI at all.\nKinda dissapointed\n\nMany ppl seem to say its like HoMM5 which I for one didn't like ... I started with HoMM (1) and played almost all following ones especially 3 which I played for probably 8 years but everything after 4 was just bad for me and even 4 wasn't as good as 3 even though it was almost the same ^^V",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute dumpster fire. The whole idea of HOMM was strategic planning and development. WTF is this random shit??? You get random skills, random team, no synergy, no logic, nothing. The you put against AI with fukin 5times stronger army that sherds you in 3 rounds. WTF?? fk this useless remake, I hoped it wont be garbage, but what a disappointment",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}