{
  "positive": [
    {
      "review": "Fun game, and very addictive.\r\nI also like how Caseoh came to my new built hotdog stand and stole ALL my hot dogs and ran off. Yeah.... (this really happened) and they were pretty expensive hot dogs!!! And even tho i catched him, i couldnt get my hot dogs back. Oh well.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "love this game. only thing i ask yall fix is the watergun cleaning feature. I realized while playing that my watergun was able to clean chairs, grafitti, etc but after using it for a while i realized that it wasnt giving me and research points like the mop gives you. it still makes the ding noise indicating the object is 100% clean but the research points didnt work. Also idk if it was intentional to make ur character fall EVERY SINGLE TIME you accidentally double jump but its annoying lol. Other than those nitpicky things, this game is so so much fun :3",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I hate my customers.\n\nThey crap in my pool and throw garbage everywhere.\n\nBut hating them makes the game fun, so I would absolutely recommend this game! XD",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game is so fun! The game Mechanics are smooth and the body mechanics on the NCPs and your character are so goofy! All I have to say is BUY IT if you've thinking about it....it is DEFINITELY worth the purchase! Entertainment for hours that is hard to put down!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game is insanely fun. I love that I can paint nearly every surface and item to truly make my park my own. There are so many ways to improve and goals to keep you wanting to play. I feel constantly busy keeping up with my guests even with employees since you are limited on how many you can hire. I do really enjoy that because you don't just inevitably stand back doing nothing which can make some games end up boring when you no longer feel like you need to actively play. 10/10 great game!! I highly recommend it!!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The want and need to progress and do stuff, you are never just standing there bored, always something to do. It's pretty fun.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "1. It is a Simulator Game - It's pretty straightforward as far as the game mechanics go.\r\n\r\n2. It's a fun time-burner and has a decent amount of building/customization.\r\n\r\n3. Take your time and enjoy if you decide to play it for yourself. \r\n\r\nArcade Score - 8/10!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Park builder + biiiig slides + wacky physics + hit-and-run + taser (yes really) + CaseOh (and a truck advertising the park from his own playthrough) = this game.  Well worth the $13 price tag at time of review.  Multiplayer is on the roadmap in the near future too, looking forward to that!\n\nOverall 5-star game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "started playing, got addicted, dude kept pooping in my pools. caseoh pulled up and ate my hotdogs??? w game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's a good game. Has some bugs but nothing gamebreaking (mostly funny).  I enjoyed the game play loop of building up my park and making it nicer and nicer. Some achievements were annoying to get, like clean 500 poop out of pools. It's not hard it just takes awhile. Once you unlock all the research and build the park how you like it there is not much left to do (which is okay while updates roll in). If your looking for quick fun for about 20-25 hours, more if your going for 100%, then I highly recommend it!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Perfect ADHD Simulator, the future promises great upgrades \r\n\r\nIf everything goes according to the Dev's Road-Map, it'll be a very good game to play with friends in the future",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Un juego bastante entretenido y relajante \nPara construir tu parque acuatico",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Waterpark Simulator is a lot of fun BUT it needs 2 more staff slots so you can be able to chill more at some point imo",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I actually found this game through a YouTube channel called CaseOh — I ended up losing hours just watching him play! After that, I knew I had to get it for myself. I’ve been having a blast building my own park and seeing all the creative stuff you can do. It’s one of those games that you just keep coming back to, especially when new updates drop.\r\n\r\nCan’t wait to see where it goes next — Goon Lagoon! 🌊🎢",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Stressful Management, useless staff, ignorant and rude customers. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Saw one episode from Daz Black about this game and I was convinced to buy it and play it. It is really fun! Makes you work for progression too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Waterpark Simulator rolls out the sponge mats and pool noodles for a highly illogical, almost unhinged first-person business simulation sandbox that has all of the chlorine-powered trademarks of a mindlessly entertaining game. I’d like to say that Waterpark Simulator is the illegitimate brain child of House Flipper and Theme Park World, with perhaps an external strand of Rollercoaster Tycoon somewhere in the core DNA. I say that because, despite it having a good selection of buildable components and sandbox features, it brings—no, bathes in chaos, thanks to its inclusion of rag doll physics and a treasure trove of highly unorthodox ride blueprints and attractions. But that’s what makes it fun. Alas, Waterpark Simulator isn’t an authentic sim; it’s anarchy on a waterside. It’s a bit of everything, in that it doesn’t just allow you the freedom to build a park from the ground up, but also participate in its creation and, after so long of dabbling in its waters, witness its eventual downfall as the guests topple and the world falls to pieces. It’s the steps that you take along the way, of course, that make this the unruly build ‘em up the laugh-out-loud experience that it is — and I’m all for it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game lots of different things to do and a good skill tree foe progression.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun and addicting game, however sometimes it could become repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I learned about this game through a youtube video and now I can't stop playing it. I love the flexibility for designing your own park and can't wait to see what more gets added and how crazy it can get! I also think this game will be amazing when multiplayer comes out and I am totally getting it for my friends when it does!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never knew I needed ragdoll physics in a sim game but it turns out we all did. Also I wish I had a watergun to cleanse smelly people in real life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, that was a hell of a lot fun! It is the right amount of fun chaos and constant pressure. One can play as slow or as fast as you like and it is fun to restart in a new playthrough, wich I did not expect.\nGreat game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, some games are grindy and boring after a while, but this game far surpasses a comedic, busy and constantly evolving game with a TON of things to do and change, This is a really neat game. HATS OFF TO THE DEVS! Excellent graphics, albeit a bit janky in terms of people coming out of the pools backwards, and floating over the cement, etc but I think that will all come with time, There is always something to do in this game and the hired help is a huge bonus to keep it from getting grindy. I had a feeling this game was going to be like some other \"simulator and tycoon\" games, but it is HILARIOUS and so much fun! Who doesn't think pushing a panicky chick off the diving board isn't fun?! Kicking someone out for graffiti? Oh heck ya! Some perv taking pics of the girls? Punt that guy right out!! Someone poops in the pool? Catch Mr. Poopmoji and drain the pool, it's all good. Jokes aside though, seriously good game made by some devs with an awesome sense of humor. Keep it coming devs!! Don't have this game yet? GET IT....seriously!! Hurry up hit that button!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waterpark Simulator is one of the best sims I've had the pleasure of playing. I enjoy all the different aspects the game has to offer. From passing out flyers and being a hotdog vendor, to decorating and creating my own set of slides and pools.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game. relaxing yet also stressful in a good way. they even added multiplayer which is even better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an addictive gameplay loop, plenty of laughs, and enough customisation to make every park unique. Can't wait to play this in multiplayer!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had a lot of fun playing this game. It's one that I keep coming back to time and time again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nothing but 10s across the board for this game! Would rec to anyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game makes me feel like a girlboss who gets to beat the crap out of disgusting people and build my own empire. i loves it so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too much water, just like GEN 3.\r\nJokes aside. This game is actually very relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever since I first tried this game, I.. got into it way to quick. It's fun, relaxing, and sometimes stressful! Currently waiting for more updates, but I definitely recommend this game for anyone that wants to just sit back and do.. random waterpark things. And possibly bully employees and customers. :p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is really fun to play when relaxing also it has crashed a lot for me but other than it crashing I've really had fun playing this game especially when the npc's run around and do what ever they want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game. a simulator game that adds enjoyment through more than just the typical game of simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game, good. cant wait to do the new stuff and get the relaxation spa stuff. The only thing thats annoying at all is when you're trying to mop a puddle and its like the npcs are just gravitated towards it xD. and once they slip once while you're mopping then they get up and slip again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its's fun, creative, chaotic, and slightly exhausting, an amazing experience overall, can't stop playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's still a work in progress. It's goofy silly fun, and I love the physics in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun game if you want something to do. I find it relaxing, although you have to put in the work to avoid being too overwhelmed by the amount of tasks needed to increase your park's rank. The developers seem to be keeping on top of the game too, offers fun updates here and there and keeping us in the loop about their future plans / updates for the game too. Overall, I spent a lot of time playing this game, and with some bugs ironed out, I feel it'll be even better. I look forward to what's next for Waterpark Simulator! \r\n\r\nA little hint if you're struggling with getting the poop and flyer achievements: Remove your toilets and have your trash picker ready! Also, avoid putting up too many posters from the store, or people will be interested in going to your park without the flyers, which makes the achievement much slower to get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game so far and im really enjoying it. constant updates in the short while ive been playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this is a great game from the way you get to treat your customers. If they are causing a ruckus or just straight up smelling bad, you can literally taser them for being the way they are. I'm hoping though that there will be a cat shaped pool. pls. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game would reccomend as you get to do alot as such as unlucking new parts and staff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All the satisfaction of punching someone at the water park with none of the jail time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, lots to do, funny moments, great customizations and overall just such a great experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best simulator games out there and its still in early access",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very chill game even in early acess, cant wait for the multiplayer update",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game that is silly yet enjoyable but stressful all at the same time. You can pet the dog.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quite fun, but gets a little hectic if not careful. can be rather funny too if you see the funny aspects of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a charming and very chaotic simulator game. I found myself rebuilding my park several times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to kill some time! Fun and very addictive game with great gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hilariously good fun. The best part is actually getting to beat up naughty customers. Wish I could do that at my retail job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well put together simulator. Lots of things to do. Chill and Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! I first saw it on Caseoh's YT channel then I bought it and played it. I love all the updates and little Easter eggs. My current water park is at 5 stars, after a few more updates I plan on starting a new save.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Took 42 hours of game play to open up the skill tree. Looking forward to how it develops over time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just bought the game 5 hours ago and already have 5 hours invested into the game. only reason for getting off is having to be back awake in 3 hours. The game is absolutely addicting. So much to do so much customization and so far not really buggy at all. really enjoying this game so far. would love to see multiplayer added at some point but for now an amazing single player sim that i can see my self putting a few hundred hours into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me start by saying, you can tell the dev for this game loves what he does. It's a great game that gets way better with each update. Genuinely one of the best simulator games I've played in awhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got this game cuz of Caseoh , played and it was fun, got bored of it after unlocking everything and maxed out everything, and my game starts to lag cuz of the decos in my park \r\n\r\nstill a good game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really fun, hilarious game. hope there are more events and more things to earn in the future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, I really enjoy it and find the mechanics of it fun, not much else to say just a good game that is fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the game is very fun and lowkey a chill vibe. It can be very fun and 100% has its good moment and can be very fun! I would reccomend, however, the game can get pretty stale sometimes, maybe because it hasnt been out for that long but after you reach your 4th star, it gets REALLY repetative and needs some more improvement, but if you like the main gameplay loop then i guess it doesnt matter, the only other thing i hate is that it very clearly uses AI. Im very anti-AI so it was a pretty big disapointment but it does seem to only be used to visusial like posters and the games icon, i dont think and code or models are AI or anything, but it is still a pretty big deal breaker because i would rather have shitty graphucs that are human made rather than AI but its entierely up to you, overall would reccomend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game, can get addictive. lots of customization options...just varied enough to make everyday a little bit different and keep you on your toes...another great simulation game. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun and relaxing a satisfying game that calms you down quicker then anything else its awesome and subscribe to caylus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the ragdoll mechanics, and it s very satisfying to complete the entire park. my only wish is that they eventually have you move into the apartment across the street from your park",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well thought out sim. Simple, but complex. Regular updates keep making it better. Great graphics and a lot of humor. Give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good game with an incredible Gameplay super easy to understand the game. Overall:10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As stressful as this game can get when you don't have a lot of employees, it doesn't get rage-quit worthy levels of stressful and I think that's the perfect amount! I love simulator games and the amount of freedom we have to create and manage our own park is super enjoyable. I love this game so much lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game for when you have nothing to do because you can just sit back and play for hours!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun but it can be whanky at times like when you run and jump over a pool to take a shortcut and your character will land funky and go limp or you try to clean a puddle and you somehow slip on said puddle. Overall the game is entertaining and the big slides do launch guests at times which is quite funny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the new update the graphics suck please take it back to the graphics it was before the update they were sooo much better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This gameis soo fun the physics with the npc's are really funny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% recommend\nthe music gets stuck in your mind\nyou mop the floor\nand mop\nand mop\n... and mop\nyou can have fun with double space\naddicted game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game could use more content: additional attractions, decorations, and more variety in visitor behaviour. However, the developers seem active, and updates show good potential for the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game Is Amazing & i will definitely recommend to friends & other..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable game. Great to jump in for a while and run your own little waterpark. It is early access but so far it is worth the price I paid even if nothing else was done. Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love playing this game for the laughs at the silly game mechanics the immersive feel of creating your very own waterpark. Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To say this is one of the greatest simulator games is an understatement. They knew exactly what we wanted, and delivered it 10 fold. The glitches? Not game breaking, but added to the hilariousness that gave this game charm. I HAD to 100% it to show my appreciation to the game and developers. 10/10 play this game! It's a great experience. \n\nMy only 2 complaints are:\nMaybe add 1 more employee slot to the maximum.\nMaybe make the upgrade that reduces the water puddles, remove them entirely. Because MY GOD are there still SO MANY WATER PUDDLES making everyone slip and file a lawsuit. I can't afford Morgan and Morgan you know... XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and keeps me from getting bored. very affordable and really nice grahpics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alot of things to do and is realy fun and adicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game i also like the fact that they update the game i hope they keep it up but i wish there wasnt a limit on employees, i really dont care for them taking breaks, wish we had security.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game genuinely is on to something. The vibe is real with its wacky physics and its choice of pools & slides along with its soundtrack its a deadly combination for addictive gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perhaps it will be the best water park simulator game! At least from the current perspective, it is!\nI bought it when it was released. At that time, it was not a very complete game and sometimes there were some lags, but it was full of fun, so I played it almost every day for a period of time. Although it can be very busy after having all the employees, everything is very interesting!\nYou can freely choose the color of the decoration, bright or dim, both can be achieved! You can also change the color of beach chairs or even bathrooms!\nI like to control my character to dive on the diving platform (at various heights) and have fun water slides after the water park closes. An interesting point is... I didn't know at the beginning that the exit of the water slide needed to be aligned with the pool, so I was busy using first aid needles to help customers who fell to the ground and got injured for a long time. But I haven't been to a water park or seen it with my own eyes, so forgive me. In this regard, I can even say that I am grateful for this game, which has made my dream of playing in a water park come true?! (Even though it mainly allows me to run a water park)\nPerhaps there will be easier mode settings for this game in the future, as it seems that every day is always busy. Looking forward to more updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoying most of the features. The floppiness of the people does get annoying at times though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 im not even super into sim games but this one i can play all day / over and over just starting new parks XD am so excited for MOREEEE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Today, while I was on a run around my 5-star waterpark on a hectic day cleaning up pools of water and emptying bins while my staff took their breaks, when what did I spy out of the corner of my eye, but a soda-drunk, wobbling their way along a pathway. A soda-drunk. In [i]my[/i] park. How dare they! Full of the righteous fury of waterpark owners everywhere I charged over to them as they were about to hide in one of my top-tier bathrooms and set about giving them a wollop about the head with one giant boxing glove.\nExcept...I'd forgotten I'd just cleared a trash bin, so, instead of a mighty wollop, I weakly threw a bin at them. Shamed, I bent to pick it up and, to my horror, found myself suddenly caught as the door to the bathroom clipped me and dragged me into the bathroom with the soda-drunk.\nI was today years old when I discovered that this game has animations and sound effects for your visitors using the bathrooms, and that they will make full eye-contact with you the whole time, while you clutch your trash-bag to your chest in awkward horror, trapped in the tiny room with them until the animation is complete and the door finally opens to release you and you can flee, your life forever changed.\nIn other news; soda-drunk learns to fly - story at Seven.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love running my waterpark and accidentally hitting people with a mop. \nGood game has huge potential!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games I've ever played I love watching Caylus on Youtube, and now he has a game so go subscribe to Calyus/Infinite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was already really good, and then I heard you added Daz Games, which made it even better. Would 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like I could definitely get addicted to this game and I haven’t played too much. It’s a great tycoon that can be stressful at times but overall it’s pretty great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty fun game and I played becuase of Caseoh streams. It's pretty fun and nice to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to sit back and relax while random events keep you laughing and wondering what's to come next! One of the very few sim games where the devs focus on keeping content updates and including all kinds of wacky and hilarious in game events!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive and feel like there could be more add-ons which could make it even more fun and challenging at the same time. Happy customer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun laid-back game with continuous updates and a backend team who seems to care—noice!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good vibes, and great when you're just trying to chill. Manage your ever-growing collection of cool pools and objects, while busting up hordes of unruly bastards and cheaters with a baseball bat and a stun gun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun and chilled game nice to play after a long day ......super fun to zap people who dont pay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! The gameplay and mechanics are refreshing and the constant support from the developer is top notch :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun, goofy game to chill out and just play, mess around with guests, make crazy death slides or just make the best darn water park around.. or all of it at once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very fun game and I love unlocking new things, there is a thing where you have to catch perverts and I wish it was more easy to do so, but overall I do really love the game, i've only played twice and i have played for nine hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun & relaxing game, can be a bit of a hassle when theres a lot of jobs that require the players attention at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just had one problem with it you had to pay £10 for it which i thought was a bit expensive but other then that i thought it was great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game with an amazing team developing it. It is both relaxing and funny. An enjoyable game. I don't even mind the occasional bug if it does pop up (then gets fixed in the next patch, nice work devs).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A stressfull but really fun simulator. The customisations are diverse and allow a lot of thematic decorations. All in all a great game to waste some time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool simulator game with unbelievable customization features. The game starts off very stressful, but calms down as you unlock upgrades and better staff. It also has a rich personality and its fair share of comedic moments. Also Caseoh reference is great.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "this game don't work is just a black screen and won't load anything but the main menu and can't use antimicroX on this game either",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spend just 5 minutes in the build menu and you'll see how useless the staff members are, the entire park filthy and falling apart despite having 6 staff members.\n\nThis isn't a simulator game where you run a waterpark, it's a game where you are workers, all of them at once. Stop for even just a short while and the entire park is a mess. You'll be running up and down the park the entire day with a mop and hammer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game crashed and was not able to play on a 5080 GPU, Sad I really wanted to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of falling down all the time it was funny at first and got old fast.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun but the money portion needs a bit more balancing. Its almost too easy to make money which makes the game not feel so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 15 hours of gameplay, it becomes very repetitive. You end up constantly cleaning to level up, and your employees are useless even after you level them up. I don't know why it has so many positive reviews; they're probably from people who didn't even play for two hours straight... waterpark simulator or cleaning simulator????",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The grind is just too heavy. Grinding for your first couple of stars is a bit of a hellscape. This is yet another simulation game where you're the owner of a business yet somehow find yourself being the ticket cashier, repairman, janitor, lifeguard, restocker, and food sales employee. Yes, you can hire employees - but does it improve? Yes and no. You get to offload \"some\" of your tasks for small periods of time, but nothing that makes sense for someone who OWNS a waterpark.\n\nI genuinely don't understand what's up with developers making games where the largest forms of simulation you get are doing tasks that you would normally completely offload to management + employees. Nothing relaxing or immersive about being the owner of a literal waterpark yet scrambling to buy lemonade and hotdogs as well as save the lives of random drowning patrons. Why are developers so against high-level automation? IDK but hitting slides with a hammer for hours? Not for me bro.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun for a few hours, then it gets very repetitve and tedious. It makes no sense to lock everything to exp.\n\nI'm playing this game to build beautiful and fun park, but everything is locked behind the research tree, wanna build better pools, slides and beautiful decorations? Better pick up 500 trash to get enough exp for that. Of course, you can also idle and let your staffs to gain (reduced) exp for you, but guess what? You need to manually end and start a day, so you need to come back every 10 minutes anyway. No AFK for you.\n\n\"But aren't those staffs quite incompetent and causes dissatisfaction?\" Good question. There is no reputation system in this game, the only thing that a satisfied customer does is leave you better tip, you can literally taser every single guest and have no lasting consequence.\n\nI don't understand why the devs hate automation so much, there are staffs that can help you, but you can only have a very limited amount of them and they need frequent breaks, and guess how to unlock more slots? You're right: Research tree. Also, the workload of staffs are very imbalanced. There is no reason to spend your precious slots for vendors, restockers and lifeguards since they're basically idle 90% of the time, while even multiple janitors struggle to keep the whole clean. So basically, your roster will be 1 handyman and 1 cashier, the rest of them should be janitors. How could the devs not see these imbalance?\nJob duties-\nCashier: Sell tickets\nVendor: Sell food in ONE stall only, (Just build vending machines)\nRestocker: Restock stalls and vending machines (Just a single left click for the player)\nLifeguard: Save drowning visitors (Just throw a life ring at them by holding right click)\nHandyman: Repair attractions and utilities (Actually quite important)\nJanitor: Clean attractions and utilities, mop up water and vomit (which appears VERY frequently and causes slip), pick up garbage and poop, empty bins (You have dozens of them scattered throughout the park), remove graffiti, filter pool water\n\nLastly, the building aspect sucks. Why do I need to manually dismantle and build everything? Why can't it all be done in the build menu? It's not like this makes the game more realistic, you can break or build a whole pool with 4 hits of your hammer. Also, why can't I upgrade my buildings? For slides and pools that gets bigger the higher the tier, that makes sense. But for toilets, loungers, bins and showers that are the same size regardless of tier, it makes no sense. \n\nTo upgrade a toilet, I need to: \nDismantle it. \nOpen build mode. Realize you can't build it because the you're standing too close (The hitbox is way bigger in build mode). Close build mode. Walk backwards. \nOpen build mode. Put down the blueprint. Close build mode. Walk forward. Actually build it.\nRepeat for all 17 of your buildings.\n\nAnother annoying aspect of the build mode is that it centers on the spot where you close it instead of your character, if you're running around your park building stuff, it'll get very disorientating.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Would not recommend it atm. Really messy and nowhere fun. The workers are nothing more than a nuisance and the fysics of the game are really worthless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glitchy to the point of infuriating. For a game based on quick clicks and movement this doesn't work when I can't even get the screen to hold still",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game don't work is just a black screen and won't load anything but the main menu and can't use antimicroX on this game either",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashed and was not able to play on a 5080 GPU, Sad I really wanted to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played the demo and it was ok.... downloaded the full game and can't progress past the trash tutorial because the game won't register that I've thrown away a bag of trash. I've tried everything. \nWhat a waste money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ive played for 14 hours and when i logged on today i found my game play has been deleted and i have to start a new one... i had worked hard to get to the point i did and now im worried if i start a new one it might do the same thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy and Laggy, especially after most recent update the frames seem to sh*t the bed with more than like 50 guests (consistent across 3 different PCs with varying but faily high end spec)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly, i'm having fun, but it is WAY too glitchy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing about this game is fun. There is so much to clean up it makes the game seem like a janitor simulator. So many puddles, and who slips in a puddle at a water park? Guests seem to be unaware of anything at all times and will walk through a puddle just to slip in it instead of going around when there's lots of room to do so. Super annoying slipping all the time if you happen to have a blue floor like mine and don't see all the puddles which also seem to just randomly pop up, along with dirt? at a waterpark? All the vandals, people taking pictures, other issues means you're always *having* to do something to get them out. Trash randomly getting thrown in the pool and makes it dirty really fast even when the pool it's in is large. If someone craps in the pool, the pool is still used? You can't shut it down to allow the water to \"clear up\". The upgrade tree makes absolutely no sense whatsoever. The park is so small it doesn't feel like a water park, but rather a regular or large sized swimming pool. If you've ever been to an actual waterpark you'll know what I mean. The amount of guests you can have in your \"waterpark\" is limited to 100 so you're VERY limited on growth. Some of us have computers that weren't made in 2000. There is a very limited selection of everything, and you really only have pools, diving boards, and waterslides, and nothing, other than placement, is customizable. The animations are really bad, as expected from early access and will probably (mostly?) get fixed before final release if it makes it that far. Disappointed the focus right now is on content and not fixing the game to make it fun so there's less focus on maintenance. There's so many things that could be taken away from the game, and added to the game to make it more enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "games like this require mods. put your mods on steam workshop so i dont have to spend more time trying to get mods to work through nexus mods then actually playing your game only to have everything not work one morning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says ive played 4 hours, its how long i waited for the game to load, when loaded couldnt do anything without the game having a lag spike and crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game keeps crashing over and over again!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it logged me out and my entire park restarted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "laggy and straight up expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It Sucks Boring Laggy Stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "streamer slop game\n\nyeah no this is just not as good as Forspoken",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY THE HELL IS IT STILL THE HALLOWEEN UPDATE!? AND WHY IS THE TIMER FOR IT GOING UP!?!??!?!?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A 12 year old boy who doesn't enjoy simulator games, made a simulator game. \r\nIf you enjoy regular simulator games, just pass this up. Its not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my pc didn't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dvhcuvvuudhvijdvhfuyhb9uzfpdufhgfghuvhncuvhufusofhdvpfghuhfaug;ggufhdggrhurghfhAUGh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game still needs alot of work,\r\n\r\nhowever it has promise \r\n\r\nI would like to be able to hire security guards and you should be able to hire more than 5 staff after all you need min of 3 just for the drinks/food stalls only leaving 2 spare \r\n\r\ndefo need to be able to hire more staff",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's good fun but until they change this stupid fuckass \"artwork\" for the game and not have this stupid shit-eating grin broccoli-haired dumbass in the art, I'm not recommending it. Commission someone to make the artwork, use an in-game screenshot, but the current art really just pisses me off to look at, and that's not even mentioning the AI aspect. I really hate looking at this stupid fucking broccoli-haired dumb fuck.",
      "voted_up": false,
      "votes_helpful": 287
    },
    {
      "review": "TL;DR - This game keeps you busy by inconveniencing you and not giving you a clear path to make your experience more convenient. Another game to add to the \"made for streamers\" junk pile. Hard pass.\n\nThe game is really fun towards the beginning as you get caught up in the aesthetics of the park and the business of it all. However, it starts to set in that the progression is very slow and the automation is lack luster. The game ultimately devolves into a monotony of chores, like cleaning and repairing. I held on for a while because I was excited to get past the overwhelming manual labor of the game to hiring workers to complete the tasks for me, and I just wanted to focus on the construction of the park. Unfortunately, I found out very quickly that the hired employees, aside from the cashier, do next to nothing to help automate the park. Knowing that the game never truly evolves from manually completing tedious tasks, I ultimately put it down after the 7 hour mark. I am a little disappointed. Just play the ROBLOX version that comes out in a month or so.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Just got the game and i'm having a good time but once i got my park to around 1.5 stars the games performance started to drop drastically with massive lag spikes and stutters. Ill keep playing around with the settings but so far its become unplayable and frustrating.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Its a good game, very buggy and very unoptimized, I constantly experience frame drops when theres more than 5 customers, considering how demanding for attention the park is, just trying to have a workflow is horrible due the constant frame drops.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Several times the game has reset my research points. you play for many shifts in the game and now i cant repair my park, like it didn't breakdown over time, so i can't gain research points. this is a huge no for at this point.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "While the game is fun, it constantly crashed for me. I tried every fix I could online just for it to still crash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really want to like this game and play it but unfortunately I can't even get it to load anymore. I was able to play it for a few hours and from what I played it was a lot of fun and I enjoyed it. However it was freezing pretty often, was stuttery and had some frame rate drops. As of last night the game won't even load up for me, it just crashes over and over. I have an i9 cpu, 4070 gpu and 32gb of ram. \n\nI understand this game is in early access and these things happen, it seems to not be optimized very well in its current state. The game is fun and has a lot of customization and different kinds of slides, pools and so much more. It made me laugh quite a bit and is really funny. As of right now I would recommend waiting for it to be worked on more and optimized a bit better. I'm going to wait and give it more time and then try to play again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've updated my review.  Really like the concept of this game.  The rag doll mechanics are really annoying and the staff are useless and glitchy.  I think this is going to be a great game if they keep working at it.  Just a bit annoying in early access,",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "it's been weeks with on and off lag for me. I tried ignoring it but it's pretty bad. I cant play this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As is, I wouldn't recommend this game. It feels just thrown together, as if its a cash grab just because tycoon simulators seem to be the popular thing right now. The AI pathing is terrible, especially when you get employees. I'm running around trying to clean and maintain everything while the employees I hired do nothing or take AGES (the cashier takes forever to sell just one ticket and he keeps messing up). I feel like I can't do much to progress because the employees don't work and I waste money on them. The use of AI for their art is really stupid, too. Ya'll are going to charge over $10 for a game that doesn't work well passed the second day but can't pay an artist? Okay. Sure.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Dislike the new update for. Peeing in pools is crazy.  Really wish it was leaning more towards realism so I can make a pretty park but there is no way i can make it as dense and filled as i want with minimal employees. Check the pictures in the steam page. tell me that all your staff can keep this clean and you can sit back and watch as your park works perfectly because they can't. I hate running in my park people rag doling 24/7 sucks. I get its part of the charm but its just to annoying. there going for a more \"viral goofy\" feel and its so sad to see another game for waterpark to be made into a viral trend seek fest. Peeing in pool is so stupid if you don't allow staff go and buy the cleaner to automatically clean it. This game is micro manage hell and i was hoping the updates would make it better. it has made it MUCH worse. If the next update does not help with the MAJOR micromanaging issue ill just be forced to drop the game. Once again YouTube and Twitch streamer clout had ruined a game as all their viewers want to see \"haha funny pee in poo in pool is hahahaha\"",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is fun and has a lot of potential but it quickly starts feeling repetitive after a while my biggest issue is with optimization i can run much better looking games on higher frames smoothly but this simple water park simulator struggles unless I drop everything to low graphics and textures it really takes away from the experience it's a good game but it seriously needs better performance optimization.\n\nI will change my review in future if it gets better.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Spend just 5 minutes in the build menu and you'll see how useless the staff members are, the entire park filthy and falling apart despite having 6 staff members.\n\nThis isn't a simulator game where you run a waterpark, it's a game where you are workers, all of them at once. Stop for even just a short while and the entire park is a mess. You'll be running up and down the park the entire day with a mop and hammer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm so torn with this review.. I am having fun, but the Devs are trying everyting to make sure you dont have fun.... Needs way more options to play. I want to hire way more employees but the devs make sure you have to do tedious work forever in this game.. I dont want to have to constantly clean up mop spills at a water park.. Its really rediculous..  I play games to have fun.. Not to take on a second job... The \ndevs want to make sure you play the game the they want and not the way you want.. Like I said,, I am having fun but it makes me more and more not want to come back to it. I dont understand why they would restrict us as much as they do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of falling down all the time it was funny at first and got old fast.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun but the money portion needs a bit more balancing. Its almost too easy to make money which makes the game not feel so difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 15 hours of gameplay, it becomes very repetitive. You end up constantly cleaning to level up, and your employees are useless even after you level them up. I don't know why it has so many positive reviews; they're probably from people who didn't even play for two hours straight... waterpark simulator or cleaning simulator????",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The grind is just too heavy. Grinding for your first couple of stars is a bit of a hellscape. This is yet another simulation game where you're the owner of a business yet somehow find yourself being the ticket cashier, repairman, janitor, lifeguard, restocker, and food sales employee. Yes, you can hire employees - but does it improve? Yes and no. You get to offload \"some\" of your tasks for small periods of time, but nothing that makes sense for someone who OWNS a waterpark.\n\nI genuinely don't understand what's up with developers making games where the largest forms of simulation you get are doing tasks that you would normally completely offload to management + employees. Nothing relaxing or immersive about being the owner of a literal waterpark yet scrambling to buy lemonade and hotdogs as well as save the lives of random drowning patrons. Why are developers so against high-level automation? IDK but hitting slides with a hammer for hours? Not for me bro.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun for a few hours, then it gets very repetitve and tedious. It makes no sense to lock everything to exp.\n\nI'm playing this game to build beautiful and fun park, but everything is locked behind the research tree, wanna build better pools, slides and beautiful decorations? Better pick up 500 trash to get enough exp for that. Of course, you can also idle and let your staffs to gain (reduced) exp for you, but guess what? You need to manually end and start a day, so you need to come back every 10 minutes anyway. No AFK for you.\n\n\"But aren't those staffs quite incompetent and causes dissatisfaction?\" Good question. There is no reputation system in this game, the only thing that a satisfied customer does is leave you better tip, you can literally taser every single guest and have no lasting consequence.\n\nI don't understand why the devs hate automation so much, there are staffs that can help you, but you can only have a very limited amount of them and they need frequent breaks, and guess how to unlock more slots? You're right: Research tree. Also, the workload of staffs are very imbalanced. There is no reason to spend your precious slots for vendors, restockers and lifeguards since they're basically idle 90% of the time, while even multiple janitors struggle to keep the whole clean. So basically, your roster will be 1 handyman and 1 cashier, the rest of them should be janitors. How could the devs not see these imbalance?\nJob duties-\nCashier: Sell tickets\nVendor: Sell food in ONE stall only, (Just build vending machines)\nRestocker: Restock stalls and vending machines (Just a single left click for the player)\nLifeguard: Save drowning visitors (Just throw a life ring at them by holding right click)\nHandyman: Repair attractions and utilities (Actually quite important)\nJanitor: Clean attractions and utilities, mop up water and vomit (which appears VERY frequently and causes slip), pick up garbage and poop, empty bins (You have dozens of them scattered throughout the park), remove graffiti, filter pool water\n\nLastly, the building aspect sucks. Why do I need to manually dismantle and build everything? Why can't it all be done in the build menu? It's not like this makes the game more realistic, you can break or build a whole pool with 4 hits of your hammer. Also, why can't I upgrade my buildings? For slides and pools that gets bigger the higher the tier, that makes sense. But for toilets, loungers, bins and showers that are the same size regardless of tier, it makes no sense. \n\nTo upgrade a toilet, I need to: \nDismantle it. \nOpen build mode. Realize you can't build it because the you're standing too close (The hitbox is way bigger in build mode). Close build mode. Walk backwards. \nOpen build mode. Put down the blueprint. Close build mode. Walk forward. Actually build it.\nRepeat for all 17 of your buildings.\n\nAnother annoying aspect of the build mode is that it centers on the spot where you close it instead of your character, if you're running around your park building stuff, it'll get very disorientating.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Would not recommend it atm. Really messy and nowhere fun. The workers are nothing more than a nuisance and the fysics of the game are really worthless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Glitchy to the point of infuriating. For a game based on quick clicks and movement this doesn't work when I can't even get the screen to hold still",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game don't work is just a black screen and won't load anything but the main menu and can't use antimicroX on this game either",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashed and was not able to play on a 5080 GPU, Sad I really wanted to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played the demo and it was ok.... downloaded the full game and can't progress past the trash tutorial because the game won't register that I've thrown away a bag of trash. I've tried everything. \nWhat a waste money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ive played for 14 hours and when i logged on today i found my game play has been deleted and i have to start a new one... i had worked hard to get to the point i did and now im worried if i start a new one it might do the same thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy and Laggy, especially after most recent update the frames seem to sh*t the bed with more than like 50 guests (consistent across 3 different PCs with varying but faily high end spec)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly, i'm having fun, but it is WAY too glitchy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing about this game is fun. There is so much to clean up it makes the game seem like a janitor simulator. So many puddles, and who slips in a puddle at a water park? Guests seem to be unaware of anything at all times and will walk through a puddle just to slip in it instead of going around when there's lots of room to do so. Super annoying slipping all the time if you happen to have a blue floor like mine and don't see all the puddles which also seem to just randomly pop up, along with dirt? at a waterpark? All the vandals, people taking pictures, other issues means you're always *having* to do something to get them out. Trash randomly getting thrown in the pool and makes it dirty really fast even when the pool it's in is large. If someone craps in the pool, the pool is still used? You can't shut it down to allow the water to \"clear up\". The upgrade tree makes absolutely no sense whatsoever. The park is so small it doesn't feel like a water park, but rather a regular or large sized swimming pool. If you've ever been to an actual waterpark you'll know what I mean. The amount of guests you can have in your \"waterpark\" is limited to 100 so you're VERY limited on growth. Some of us have computers that weren't made in 2000. There is a very limited selection of everything, and you really only have pools, diving boards, and waterslides, and nothing, other than placement, is customizable. The animations are really bad, as expected from early access and will probably (mostly?) get fixed before final release if it makes it that far. Disappointed the focus right now is on content and not fixing the game to make it fun so there's less focus on maintenance. There's so many things that could be taken away from the game, and added to the game to make it more enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "games like this require mods. put your mods on steam workshop so i dont have to spend more time trying to get mods to work through nexus mods then actually playing your game only to have everything not work one morning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says ive played 4 hours, its how long i waited for the game to load, when loaded couldnt do anything without the game having a lag spike and crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game keeps crashing over and over again!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it logged me out and my entire park restarted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "laggy and straight up expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It Sucks Boring Laggy Stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "streamer slop game\n\nyeah no this is just not as good as Forspoken",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY THE HELL IS IT STILL THE HALLOWEEN UPDATE!? AND WHY IS THE TIMER FOR IT GOING UP!?!??!?!?",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}