{
  "positive": [
    {
      "review": "[h2]Desktop Mate[/h2]\n\nIt's a lovely desktop mascot but the DLC's are way too expensive. £11.99 Nope sorry 2B but not today.\nI would recommend Desktop Kanojo there are more character options from well known games and even though desktop kanojo isn't free, it's still less expensive than getting the DLC's on Desktop Mate.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Very smooth and good experience so far. Love that Kasane Teto uses her official Voicepeak TTS program",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's nice for those with a special interest to certain characters, for me it would be Hatsune Miku and Kasane Teto, and it's perfect if I'm just chilling around and want one of the characters to sit along my PC while I do things!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "extremely good tool for keeping the display running when I'm not at the machine. also pretty relieving having something to interact with during long loading screens (the only loading screens my machine is familiar with).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is awesome. I cant wait to get kangel and ame chan but i have a complaint. why are the characters so expensive. 15 bucks for a character is a lot, especially if you buy multiple (which i plan to).i like this but it's too expensive. should be a one time purchase and you get all the characters ir make dlcs cheaper.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For a Teto enthusiast, it’s hard to resist one showing up on the desktop—even if it’s region-locked and pricey. And the same goes for Miku and Needy Girl enthusiasts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this! i got the DLC for KAngel and Ame-chan and i wish it wasn't as much. At least they are cute!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good but the skins are a little overpriced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cuteee!!! i love having k-angel on my screen at all times shes just chillingg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not a bad app per say, its just the dlc is a bit expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good thing. Make the next DLC with Gawr Gura, I don't regret the 130 hours I've played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ever since ive heard about this software ive been so excited to get a laptop and with my recent hyperfixation of Kasane Teto i knew i had to get the dlc of her and absolutely no regrets i could definitely say i recommend desktop mate with no end in site",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent several hours trying to figure out why the program wouldn't even run just to figure out I needed to uninstall Comodo Antivirus and switch back to Avast to make it run.\n\nIn light of how Bill Gates and his merry band of c0(ksuck3rs' poor decisions hope that this program will be able to run natively on Linux someday preferably Debian-based distros in particular since that seems to be what most Linux people use since more and more people are opting out of Windows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best admin. assitant i've ever had. filing taxes or writing letters in the emails. These side bar entertainers are just enough to keep you sane while doing things that are not on your to do ist. Well, not on any list. Who wants to do taxes and ejoy it? Ok, maybe an ambitios auditor.\n\nAnyway, resizing and audio adjustable for space preferances, and the alarms to when uyour phasing into whatever it is you are doing, they are there to snap you out of it ike a share-pop popsicle.\n\nI am Thrasson. And i aproove this msg, and this Desktop Mate (all of them. get all of them. must have alll of themmmmm.....)\n\n\nP.S. Drawbacks - Zero, unless you count not being abe to have al of the mates\" on your screen at once (which woud be SUPER COOL TOO!), . A whole party to yoursef, amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this so much lol but we NEED a free roam feature that you could toggle on and off. If the free roam isnt possible than at least we need to be able to have them holding the bottom of a window or the top of the desktop like how you are able to hold them by the hand!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can have anime tits as my background AND an anime girl in my bottom right corner??!!! \nThis is the future guys!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like Miku and teto roaming around my desktop and I might get 2B next",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "having a mini miku on my screen is so cute XD wish i could have more 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This application has brought me the most spectacular amounts of joy happiness and big booty latinas after downloading this application hella huzz approached my location in vast numbers calling me the torta tickler master",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Why expensive. one star app! *Charecthers cute tho!*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my life got better and better since i start to use this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Продал почку чтобы купить все DLC, 10 хуев мне в жопу из 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You get to play with your waifu on the screen?!?!\nHack Yeah!!! 100/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Make an Adachi Rei dlc and my life is yours infiniteloop.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great way to have a partner on your screen while you work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best app for your background but you need a good PC for comfort use",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING APP YOU CAN INSERT YOUR OWN CHARACTERS ITS AMAZING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bro they should add femboys to or just Astolfo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a fun little companion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "needs more interactions, even if small",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's handy and good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a neat little friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dlc a bit pricey ngl but they got teto",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "anime girl sits in corner of screen,,, w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fifteen dalla down the drain for miku dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game but only with DLC's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent 30$ for the miku skin worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Hatsune Miku",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well i dont really know, good ig?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ame is on my screen. She is like a bug trapped in a jar. 100000/10 i adore my wife ame chan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD and FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very usefull",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is pickle cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just have a little guy this is awsome",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Shut up and take my money",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "teto simulator :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUCKING LOVE TETOES!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Software.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it. Since I miss themes on console. This for me is really good. I can browsing without any distraction and is cute to have a Mate while I am browsing. There no issue in my laptop gaming. Glad this exist. For developers, keep improving and thank you for bring Desktop Mate, so I hope to see more Mate in the future. I am happy :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mac version please!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Real women resent me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "miku on da puter foe today",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cute anime girls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Miku ^o^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "S-She's in my wifi, MIKU IS IN MY WIFI, HELP!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "wth is ts even about vro????????!!?!!!!?!?!?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My wife in my puter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ame-Chan came home",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OMG IT'S MIKU!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "now teto is hiding in my wifi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im thinking miku miku oo ee oo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "miaw rawr, nc. I like miku",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Luka my beloved",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ame chan is life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2b or not 2b",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TETO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "miku",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Miku/Miku",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SOOOOOOOOOOOOO CUTE TRY OTHER DESKTOP MATES NOWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon goon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it installed a bitcoin miner on my device, the character also showed me my ip on screen, it also told me that a hitman from belarus was coming",
      "voted_up": true,
      "votes_helpful": 125
    },
    {
      "review": "little teto on my screen is fine but if you're charging people like $15 for each character they should be able to do more things  such as bop to music or interact with more stuff . Or just simply allow modding smh.",
      "voted_up": true,
      "votes_helpful": 57
    },
    {
      "review": "Its really fun and cool to have someone sit on your desktop. Just 2 issues- The overpriced DLC: I feel like $15 is way too much price it around $10 seemes better ngl. Custom VRM/Modding: Why remove it? It didnt hurt anything but just made it feel less boring after a while.",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "It's pretty cool to use but buying 140$ to unlocked all of these character like.. is that actually worth it?\nheck no, this isn't really worth it at all..\n\nthis really should add more features or just lower every DLC character priced at least.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "Hey there everyone! Before any of yawl start buying this software please look at this review first... First of this software is really dope, you get a cute anime girl on your desktop who is reactive to what you do (Limited tho) and you can put her anywhere in the screen like laying down on top of a tab, hiding on the side of the screen or my favorite just sitting down on the tool bar while the 3D lady lives rent free on the screen of your computer or laptop. While all of this those sound really nice be WARNED because we all know why we are here... Hatsune Miku & Kasane Teto, to of our favorite vocaloid Ladies who tragically are locked up behind $15 Bars, yeah you read that right... For $15 honestly all of us would still pay to get our favorite Vocaloids on our screens (the ones really into the rabbithole like me) but for the common Man or Lady who think this sounds expensive... yeah it is and honestly I agree that paying $15 for a png on your screen should easily access you to disonage for this one move... But it wasn`t always like this, there was a time where this software was really epic, instead of buying Png, you modded it and transfer pngs from the internet to this software, but unfortunatly these greedy goofy aah creators decided to patch the modding and now the only thing you can do is to just pay $15 DLC for a png of a lady who lives rent free on your desktop... so tell me dear reader, is this software really worthy to have? [spoiler] and yeah im sadly a down bad fan that i paid $30 for Migu & Tetas and gave it a positive review, disspointing but atleast now you all know if this Software is worth your time. [/spoiler]\r\n\r\nP.S.~ No it don`t work on the Steam Deck but it will work a bit slowly on the older generation of laptops.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "10/10 would recommend! \nVery Cute seeing my favorite synth V Diva, Kasane Teto, on my desk top. I do think its weird though how she turned to me one time and said that a hitman from Albania was en route to my house, probably just a software glitch.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "it won’t happen but please make a linux version so miku can be on my desktop pretty pretty please i love hatsune miku…\n\noh yeah desktop mate itself is good and really cute from what ive used of it. The characters are a bit overpriced, but they are animated really well.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "[h2]Desktop Mate[/h2]\n\nIt's a lovely desktop mascot but the DLC's are way too expensive. £11.99 Nope sorry 2B but not today.\nI would recommend Desktop Kanojo there are more character options from well known games and even though desktop kanojo isn't free, it's still less expensive than getting the DLC's on Desktop Mate.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "It's fun to mess aorund with or chill with while listening to music or getting some homework done",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I've officially spent one thousand hours with Kasane Teto and let me tell ya!\nIts been beautiful and I've loved every waking moment and seeing that bright smile on that BRATS face\nits put a smile on me and i LOVE it!\nSome days i feel like i have a brain of a bird but then I remember that one song that Teto sang and it reminds me that even though i might feel bad some days shes always here with me to relate and comfort with her presence. Even when turning on my pc i see her show up and greet me and immediately a smile shines down on my face.\nI love her",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Very smooth and good experience so far. Love that Kasane Teto uses her official Voicepeak TTS program",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "its cool if you like to have an anime girl chillin while you game or watch yt or whatever but the cost of the other characters are a bit much.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is awesome. I cant wait to get kangel and ame chan but i have a complaint. why are the characters so expensive. 15 bucks for a character is a lot, especially if you buy multiple (which i plan to).i like this but it's too expensive. should be a one time purchase and you get all the characters ir make dlcs cheaper.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "extremely good tool for keeping the display running when I'm not at the machine. also pretty relieving having something to interact with during long loading screens (the only loading screens my machine is familiar with).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This app is a companion that idles on your monitor. For the past couple of months, I believed we could change the app character by modifying the VRM folder, but that is no longer possible. I believe that the developer had to patch that because they didn't make that game raise its revenue via DLC packs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ts game hella cold i downloaded this and all the huzz at school started showing respect towards me because they know im goated simply due to the status of my ownership of this game, this game is lifechanging, revelating, and even mindboggling, I could confidently say this is the best game, no even app ever concieved onto a computer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its good you have a little anime girl just interracting with you! the only problem is the overpriced dlc, but you only need it if you want it, for me? i want teto but its 15$ but idc, at least i have something its better than nothing",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's nice for those with a special interest to certain characters, for me it would be Hatsune Miku and Kasane Teto, and it's perfect if I'm just chilling around and want one of the characters to sit along my PC while I do things!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Desktop Mate is such an amazing application! I instantly bought it when I noticed Hatsune Miku was available. The DLCs are pretty pricey at $15, but I think it's worth it if you really love a specific character. Now I just have Hatsune Miku sitting on my taskbar, relaxing as I game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "pretty peak application, nothing else to say\r\n\r\n(btw YES you should buy the kasane teto dlc its peak)",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "removing modding capability to be able to make money off the game would be fine if each DLC wasnt 20$+ CAD. putting that off to the side for a sec to talk about the fact that she has not even been released yet, making k-angel and ame-chan two separate character DLC's despite them being the same person, and not just making it a free add on or even having the option to change her appearance is wild to me. having to pay 40$ for the same character in a different outfit is too much.",
      "voted_up": false,
      "votes_helpful": 167
    },
    {
      "review": "got rid of modding support and was forced to constantly downgrade the game to keep what mods i had eventually moved on to another app that is much more friendly towards mods.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "A very good application managed by a very bad company. Many such cases.",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "I recommend using this and then immediately downgrade to an older version because the developers are horrible people and think its justifiable to lock modders out of the community for the sole purpose of selling there own skins for and OUTRAGIOUS amount of money. Like seriously $15 for a character skin, get real!\nJust downgrade your version and mod the game, dont let greedy companies win!",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "what is the point of making this game free? you are selling each model at $15 and removed the ability to mod. this is just something to sit on your display, its so upsetting.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy the DLC slop just because a game is free doesnt mean you should have each CHARACTER be $15 and cancel modding support. Enjoy gooners",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "don't waste time and money with this just get Mate Engine and download your own characters instead of being forced to pay $20 a pop for them and being denied having a character you actually want to use",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "making kangel and ame two separate character DLC even if theyre the same person, and not just making it a free add on or even having the option to change her appearance is just bad. having to pay around 30 euro for a single character w a diff outfit? not to talk about how this barely supports modding when their only good things are expensive DLCS. I only have kangel and ame and i will 100% try and get teto, but jesus christ this company or idk dev is greedy as hell. its buggy sometimes too! and at least add some better features for that much for a single character instead of actual normal devs doing one dlc for around the same price for all new unlockable characters instead of only one :/ like musedash",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cant mod, and additional characters cost roughly $15.00 usd. Absolutely mental.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just buy MateEngine - its 5 dollars, supports modding, and all in all its just infinitely better :)\n\nand if you cant afford it on steam, its also a free download on github (though i do recommend supporting the developer if you can)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A great application managed by a shitty company. The fact they went anti-modding is so sad to see. This app genuinely had so much potential which was all wasted for 15 dollar DLC's. Which to be honest aren't really that great for the money. If you want something like Desktop Mate there are plenty of free alternatives out there that allow or even encourage modding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant mod anymore which was the best part, can only buy $15 models instead",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Lame gimmick and you have to pay $14.99 for each DLC. Not even worth it in the slightest, and the DLC's themselves have very little features besides like two animations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"15 dollars for a model swap?\"\n\"With different animations, Mr. Squidward, with different animations.\"\n\nSeriously, you need to add modding capability back.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a vtuber, it's fun to have myself sitting on my desktop. The reason I got this fun little program in the first place is being able to put my own self in here instead of some stupid thirst trap anime character that looks too young to fantasize about. I mean, if you like it good for you, but it's not for me. So.. knowing I could have myself on desktop is the only reason I got this program.\n\nNow the mods don't work. Now I'm stuck with stupid anime characters.. F.U. developer for ruining something awesome. I don't want your dumbass anime characters.\n\nBring Back Mod Support!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good and fun app but the DLCs are overpriced and needs to be discounted",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A free application only to attract people in order to extract as much money from them as possible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 Doesn't work on Linux\n2 Removed mod support in favor of tons of paid DLC, as opposed to optional donators packages\n3 Bans critics on the community page",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it's really cute. but why dlcs are so expensive ???? and you remove modding and now if i want to change my avi i have to buy your dlcs ?? never. thats not fair",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you don't know what's Desktop Mate, it lets you have a character appear on your screen and do things such as sit on open tabs, peek from the sides of the screen, let you drag them around, etc etc. they even have adorable animations for all of these, which i think is really cool! one issue:\nevery single character costs a LOT of money. yes, every time they release a single character, in order to have them on your screen, you have to pay more than is fair (i think about 17 dollars).\n\nI think everyone should be allowed to have any cute anime girl that they like sit on their screen at all times. Putting a price on that, and having the price be THIS HIGH (considering you want to change it every now and then) is, first of all: \nclearly unethical in general due to it being much more expensive than it should be, and (i'd argue) is probably mostly directed towards users who don't want to find a free, less formal alternative (which i'm sure exists somewhere on the internet, but i absolutely do not blame people who don't want to deal with that headache).\n\nand more importantly, as somewhat of a vocaloid fan myself, and as this game has a lot of vocaloid characters, I think this kind of greedy approach is completely incompatible with the approach i've seen often in the vocaloid fanbase, with people always coming together and accepting each other/putting love into things rather than being focused on the money (at least in my experience). It hurts to see my beloved characters being used for money like this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shitty money hungry devs removed the ability to add mods, enough said",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It is sad that it turned out to be like this. I believed in the program, until it stopped allowing modding. It was very cute, and intuitive. Too bad it became so limited, and more or less, paid, in terms of customization.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible, They went anti modding and added DLC's to characters that 90% of the platform dont want to use, what kind of fucking tactic is that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth it, they literally do NOTHING, they don't walk around, they don't talk except on extremely rare occasions, the DLC characters are so limited this would benefit so much from either mods or a workshop, don't waste your money on the characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "turns out you can't put your own models anymore, the DLC sucks and only got a limited amount of characters\nit was such a good concept but the software is useless now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "me when i have i 12 dollar virtual miku that does nothing and sits on my taskbar\ndlc's should be 2 bucks tops",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You can't mod custom models into it anymore, don't bother installing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "still  crushed that you cant mod it anymore, at least not the new versions wink wink",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS APP IS SH@T MADE MY PC CRASH AND RUN AT LOW STANDERS ITS IS TERRIBLE DO NOT USE SAVE YOURSELF!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make a version for linux\n\nIt's weird with proton",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hi can someone buy me all the dlc im a cute gamer girl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0/10 would not goon again 🥀🥀🥀",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no mod not recomended",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fuck Teto Kasanae",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its impossible to uninstall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pure garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cash grab",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fuck miku",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bruh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]This review was made on 11/15/25, it will be majorly disappointing if none of these suggestions were not implemented since my review, and you likely should not buy this unless I have updated my review saying these features have been implemented, which I will do if the developers do update the software to include my suggestions.[/h1]\n[olist]\n[*][u][b]All these DLC's should be $8 or less, $15, as I and many others in these reviews agree, is too much.[/b][/u]\n\n[*][u][b]BANNING MODDING IS BAD, ALLOW MODDING, OR AT LEAST CREATE AN OFFICIAL STEAM WORKSHOP.[/b][/u]\n\n[*]They should have at minimum [u][b]50 animations[/b][/u] attached to them if not, more, some of these these animations don't have enough variety to make them continually interesting or be worth the $15 pricetag.\n\n[*][u][b]You can only have one character at a time[/b][/u], this is genuinely absurd for the amount of DLC this game has, and [b]you should be able to have clones of your character around your monitor, not just one[/b].\n\n[*]I'm unsure if it's for all of them, but my character, Ame, [b]doesn't have English audio, just Japanese, with no English captions[/b], this is absurd for a $15 product, [b][u]if I don't get English audio, I would at least like there to be captions translating what the Japanese audio is saying.[/u]\n\n[*]Add a toggle in the settings that puts the software on performance mode, and [b]optimizes the application AS MUCH AS POSSIBLE[/b] to not take up resources on the computer.\n\n[*]Make a toggle so that a character can randomly choose to sit between a specified interval and the chance that they'll sit. The characters already randomly do sit, but there is no customization to it, and [b][u]they seem to get back up 10 seconds after they sit, which is too short.[/u]\n\n[*]Character's voicelines get interrupted by other voicelines, either fix this or add a toggle in the settings so that they won't get interrupted by a new voiceline.\n\n[*]These should take inspiration from Shimeji (which are mostly free mind you, and better), I've provided a list below of some features Shimeji do and more, of which this program should also implement these features.\n\n\n\n[h3]There should in general be more features for the (what should be $8) pricetag, more features like:[/h3]\n\n[*][u][b]A toggle to allow characters to freely walk horizontally on your desktop[/b][/u] (they don't do this already somehow, they are [u][b]ABSOLUTELY STATIONARY.[/b][/u])\n\n[*]A toggle to allow characters to walk between your computer monitors.\n\n[*][b]Create a toggle so that characters can play animations to the music or videos that are being played on your PC[/b], a toggle for this specifically would be nice as some people might not want this happening constantly.\n\n[*]Have different moods toggleable in the settings for your characters.\n\n[*]Give each character little infinitely replayable games to interact with involving them, this would be simple, fun, and justify the pricetag.\n\n[*]Make a toggle to turn off interactability that way you can keep it open with games on, this is a product on Steam after all, people are going to be using this while playing games and it's annoying to have to drag a character every time you want to click something behind them.\n\n[*]Create several random animations for the character when an hour passes on the clock, you can even give voicelines to them like \"It's getting late\" with them visually looking bummed out or \"It's too early in the morning for me...\" with them visually looking sleepy.\n\n[*]Make a slider to make the characters semi-transparent, so that people who want to have the character but also see behind them can do so.\n\n[*]There should be a toggle to turn off shadows.\n\n[*]I'm unsure if this is for all the characters, but for my Ame character, if I put her attached to the right side of the screen, she's still visible on my right monitor and completely still, meaning the animation of her on the right side of the monitor doesn't have a looping idle animation when it's off-screen. This should be fixed, and the application should just detect if the application is genuinely off-screen and disable the animation if it is indeed displaying on a different monitor to save on resources.\n\n[*]The alarm sound should start out quiet and gradually get louder, also you should manually have to click the character to stop the alarm.\n[/olist]\n\n[h2]Developers, this should be your checklist on what to change about this software, please, genuinely go through and implement every one of these suggestions, [b]as motivation I will personally gift a DLC to someone if you do, paying you $15. And I'm inclined to ask people to also volunteer in the replies of this review (if you want, obviously you by no means have to) to also volunteer to gift a DLC if you do implement all these changes, that way hypothetically if you do implement everything in this checklist, then 10 people collectively would purchase your product for $150 or more.\n\nThank you for reading my genuine and helpful review including what I personally believe are great suggestions list for this software, and I hope you have a great day.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "removing modding capability to be able to make money off the game would be fine if each DLC wasnt 20$+ CAD. putting that off to the side for a sec to talk about the fact that she has not even been released yet, making k-angel and ame-chan two separate character DLC's despite them being the same person, and not just making it a free add on or even having the option to change her appearance is wild to me. having to pay 40$ for the same character in a different outfit is too much.",
      "voted_up": false,
      "votes_helpful": 194
    },
    {
      "review": "$21cad for a skin? DUde. This isn't fortnite or valorant. it's a desktop pet/timer that doesn't do anything. ew.",
      "voted_up": false,
      "votes_helpful": 173
    },
    {
      "review": "got rid of modding support and was forced to constantly downgrade the game to keep what mods i had eventually moved on to another app that is much more friendly towards mods.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "A very good application managed by a very bad company. Many such cases.",
      "voted_up": false,
      "votes_helpful": 116
    },
    {
      "review": "No custom avatars (officially) and predatory DLCs to unlock a select few other characters",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Should be moddable and single purchase instead of requiring you to purchase simple 3d models for as much as a whole game",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Very sad that you gotta pay 15 bucks for a skin for something you look at for a few minutes during the day, should've just made the game paid with a possibility for modding. L",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "Too Expensive. Base application is fine- $15 per DLC is crazy ridiculous. $134 for all the dlc when not even nintendo is charging that much for base game and dlc just shows how much greed is happening. Also its not even a game, just a relatively basic application. Also look at the reviews about how they treat people that mod, and you see that they put more effort into stopping them than they do into the characters. Characters are technically okay, but the amount of effort being wasted trying to punish people using an application that they paid for is ridiculous.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "most obnoxious way to go about making desktop pets. paying dlc for a simple model swap on my desktop is insane, a workshop, which iirc this used to have, would be much better.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I recommend using this and then immediately downgrade to an older version because the developers are horrible people and think its justifiable to lock modders out of the community for the sole purpose of selling there own skins for and OUTRAGIOUS amount of money. Like seriously $15 for a character skin, get real!\nJust downgrade your version and mod the game, dont let greedy companies win!",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "trash software that steals ideas from other right after they implement it. doesnt allow custom avatars. save yourself the money and headache and just get MateEngine its a million times better and has a workshop and allows custom avis",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Can only be launched via steam, can't be launched independently like wallpaper engine\n\nWill change review if they ever implement this",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "$15 per VRM model + modding support removed, don't support these guys when you have free alternatives like Mate Engine that work just as good and are more respecting of you as a user",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "when it works its really cool. i purchased the Hatsune Miku dlc, and it never works. but if i use the girl that comes with it it works. realy annoying to me",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "removed modding support + pricey ass dlcs BOOOOO just greedy as hell",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "what is the point of making this game free? you are selling each model at $15 and removed the ability to mod. this is just something to sit on your display, its so upsetting.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy the DLC slop just because a game is free doesnt mean you should have each CHARACTER be $15 and cancel modding support. Enjoy gooners",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Developers opted into paid DLC costing in total $231 and blocking mod support. There are better alternatives for the same price as the base game (Free).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't waste time and money with this just get Mate Engine and download your own characters instead of being forced to pay $20 a pop for them and being denied having a character you actually want to use",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I enjoyed it on release, and was excited for upcoming DLCs, until I saw the DLC price... I would gladly pay $30 for the software if it had mod support. Alternatively, I would gladly pay $5 for a DLC character. Sorry though, $15 is too much. That's like 2 big macs bro! Will look into mate engine as mentioned in the other reviews.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "4/10\nPositives ++++ love the poses and how they sit on top of windows and the bottom of my screen\nwhen i had a custom chracter that was mad for use with a VRgame her tail which was curved would come back up onto the screen in a cute way\nthe UI has always been great\n\nThe Meh ==== i never wanted to or planned to use any other model that they or any other company would sell so them selling stuff is of no concern (and custom models usally cost to have made so people pay the modeler for that)\nused to be able to force load the program after each time i swapped out a model so had a bunch of diffrent clone trooper models sitting there(each a mate of mine from online), cant do that sadly anymore \n\nNegitives ---- the shutting down of custom models them selves, can easly justify selling models themselves if they are nice quality and optomised for their own program, have dresses that flow and move ,hair that sways cause the models bones are made to interact with the program. my character had a load including the tail... all not seen by the program... because they weren't designed to which is fine , but i was also happy to just have my gal sitting on my screen and moving every so often. \n\n\nin all i want this to support me having own characters and it just see the basic bones , they can sell their own ones and ip that they get the rights to with the improved features that comes with all the care and design they put into the characters\ntill then i wouldnt recomend it to others i know who want a desktop pal as they like me would want their choice of models be it thier irl boyfrinds character model or a friend they know-- i wouldnt recomend becasue the program is pointless for the people i know who would want a character on their pc screen . i have frineds who just shove a Miku video on when they get the want for seeing her on their screen and have it on a second monitor",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a cute little app, BUT the only way to upload custom avatars as of now is by downgrading the app to an older version that has mod support because they are so focused on making dlc's instead of adding mod support or actually getting the vrm support working that they are apparently \"working\" on it but seem to be putting more effort into the worthless dlc's. If the game was like $5-$10 id happily pay for it if i was able to add my own characters. instead they have focused on the dlc's which almost makes this not even worth using. Its getting old seeing devs like this abusing \"DLC's\" just to make a quick buck.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "making kangel and ame two separate character DLC even if theyre the same person, and not just making it a free add on or even having the option to change her appearance is just bad. having to pay around 30 euro for a single character w a diff outfit? not to talk about how this barely supports modding when their only good things are expensive DLCS. I only have kangel and ame and i will 100% try and get teto, but jesus christ this company or idk dev is greedy as hell. its buggy sometimes too! and at least add some better features for that much for a single character instead of actual normal devs doing one dlc for around the same price for all new unlockable characters instead of only one :/ like musedash",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "extremely limited to like 6 actions, very boring compared to a lot of desktop friend apps, not worth it at all what's no ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant mod, and additional characters cost roughly $15.00 usd. Absolutely mental.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just buy MateEngine - its 5 dollars, supports modding, and all in all its just infinitely better :)\n\nand if you cant afford it on steam, its also a free download on github (though i do recommend supporting the developer if you can)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A great application managed by a shitty company. The fact they went anti-modding is so sad to see. This app genuinely had so much potential which was all wasted for 15 dollar DLC's. Which to be honest aren't really that great for the money. If you want something like Desktop Mate there are plenty of free alternatives out there that allow or even encourage modding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this program but the cost of everything is absolutely insane! like ok, the fact that it costs about $16 to buy a single character is outrageous. Are you actually kidding me? that is such a stupid number to make someone pay for a character that sit's on your screen. When you first load the game you get one option and then the rest is a \"figure it out if you have money\" type of deal. this is no garden of ban ban but my god get your sh*t together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is so fucking stupid. the app is free, shits good over all, but i aint paying fucking 15$ on a fucking virtual anime girl just to sit or stand and look at me in corner of my monitor. if they were around 1$ id buy em all, but i aint paying allat just to buy a fucking hatsune miku with no usage except looking at me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs prevent the program from being modded and force the user to buy DLC to make up for it. When you could still mod this game it was actually pretty good but now that all they're trying to do is shove DLC's in your face and make you pay awful prices for just a model switch it's an awful program.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried my best to give this a chance but kept getting disappointed. no matter what i did the background was always black and never went away. tried watching so many different tutorials to fix it each one different and never got any results",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely horrendous decision to restrict modding and continue to charge $15 per avatar. Go use MateEngine instead! Its free/$6 and lets you mod to your heart's content!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "man fuck these guys. the paywall was ridiculous but the crackdown on modding?? i'm still gonna use it though, as i've put too many hours into making modding work than i care to admit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "go check out amarillos desktop pets, its an upcoming project that will be this but with full vrc model mod support and entirely custom characters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant mod anymore which was the best part, can only buy $15 models instead",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "15 bucks. For a DLC.\n\nWhat the fuck, this is just plain greedy, at MOST, it should be 2 or 3 dollars",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lame gimmick and you have to pay $14.99 for each DLC. Not even worth it in the slightest, and the DLC's themselves have very little features besides like two animations.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nice little desktop buddy, fun to watch and interact with, but forcing me to keep steam open all the time is a hassle.\ni mean, it’s just a desktop mascot, not an online game. there are so many reasons they could implement a proper background (for convenience, better ux, and letting it actually feel like \"our\" mate)\nif they ever do, i’ll happily update my review",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First they remove modding support then they say they're stopping windows 10 support which 30% of steam users still use.\n\nThe lack of care these developers have for their users is horrible. Saying that a custom VRM feature would be added and then never saying anything more and releasing 8 more $20 DLCs just shows how much they care.\n\nUse MateEngine instead, it supports modding and custom VRMs with even more features, it's free and incredibly easy to use. This isn't worth the time of installing and the DLCs are a waste.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why is everything 15 dollars bet i can get something cheaper from a vrchat nsfw avatar creator",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "dude this one is good and not at same time \nbro why all the anime girls dlc and 10.49$ like this is not even fair \nat least make 2 or 3 free for people because i'm not going to pay for each one 10.49$\nand what would be really great and would recommend if the DLCs weren't overpriced and not even fair about it.\nlike come on guys character is 10.49$ ? are you guys insane ?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"15 dollars for a model swap?\"\n\"With different animations, Mr. Squidward, with different animations.\"\n\nSeriously, you need to add modding capability back.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a vtuber, it's fun to have myself sitting on my desktop. The reason I got this fun little program in the first place is being able to put my own self in here instead of some stupid thirst trap anime character that looks too young to fantasize about. I mean, if you like it good for you, but it's not for me. So.. knowing I could have myself on desktop is the only reason I got this program.\n\nNow the mods don't work. Now I'm stuck with stupid anime characters.. F.U. developer for ruining something awesome. I don't want your dumbass anime characters.\n\nBring Back Mod Support!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly not worth it. sure its \"free\" but it has one skin. so if you only want 1 skin then yeah, get it. but if you want miku/teto or something you have to pay 15$!! just get MateEngine its only 5$ and you can have any skin for free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good and fun app but the DLCs are overpriced and needs to be discounted",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A free application only to attract people in order to extract as much money from them as possible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i downloaded because i wanted miku to sit on my other screen while i played games, but you have to buy each character separately, and the game only comes with one character to start. also wont show up in my steam library how do i delete this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MateEngine превосходит по всем фронтам DewktopMate, хоть и является его наследником. О ценах на длс и о убранной возможности загрузки кастом персонажей пожалуй промолчу.\n\nЭх, китайцы. Когда вам уде начнут отправлять промышленный персонаж, а не вы нам?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Since last fewe updates Desktop Mate now has a black screen behind the carachter that messes up my desktop and Apps. Uselessssss!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This used to be a very cool app. greed got the better of them and they kneecapped modding so not only are you stuck to the few overpriced dlc's but now you're locked out of using other models you might have that they don't. Id honestly refund it if i could. I can deal with the rampant bugs and glitches but the removal of modding support is the final straw.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its alright, but what on earth do you mean a simple skin is £12??? stop being money hungry. if you want money so desperately, MAKE THE APP PAYED. am i not allowed to chill with hatsune miku whilst coding? blimey.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fights against modding while releasing extremely expensive DLC. Use MateEngine instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Why on earth would you build an app like this and not support custom characters out of the box? It’s 2025, the VTuber economy is basically printing money, and you could’ve had half the internet eating out of your hand. Instead, they’re seriously asking people to cough up $15 for bargain-bin anime rejects while pushing out patches that feel less like “bug fixes” and more like “active sabotage of anything fun.”\n\nEvery single chance to make DesktopMate into one of those rare, actually-useful programs I’d let autostart with Windows gets gleefully set on fire. It’s like they looked at potential and said, “Nah, let’s just be a worse Clippy with DLC.”",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "it's really cute. but why dlcs are so expensive ???? and you remove modding and now if i want to change my avi i have to buy your dlcs ?? never. thats not fair",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "1 Doesn't work on Linux\n2 Removed mod support in favor of tons of paid DLC, as opposed to optional donators packages\n3 Bans critics on the community page",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very poor in content, lacking in functions, something with terrible optimization",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "7-8 Dollars for 1 dlc??? BRO..... i better buy Beat Saber music pack which is little bit cheaper, and i would enjoy that.... And Why  𝐻𝒶𝓉𝓈𝓊𝓃𝑒 𝑀𝒾𝓀𝓊  is still have not yet been reworked? Look at teto she's got voice and all. And miku? She's got 0 Voice.... Where the voice for Hatsune miku? Alr overall app is Uselles piece of rotten meat. crack the dlc's or just dont install this app to save your mental Health. (𝗡𝗘𝗩𝗘𝗥.𝗧𝗨𝗥𝗡.𝗔𝗟𝗔𝗥𝗠.𝗢𝗡.𝟭𝟬𝟬.𝗩𝗢𝗟𝗨𝗠𝗘....)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DONT WASTE MONEY, THE FEATURES ADVERTISED ONLINE DO NOT EXIST AND FALSE ADVERTISING, YOU WILL BE DECLINED A REFUND THAT YOU ARE LEGALLY ENTITLED TOO",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no custom models allowed and i swear the dlc used to be a reasonable price - they're now aud$24. \r\n\r\nin this economy? \r\n\r\ni'll get my miku elsewhere thank you",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}