{
  "positive": [
    {
      "review": "+One of the most F2P friendly gatcha games there is. Compared to other gacha games it's quite easy to accumulate gems for banner pulls.\nEasily lets you finish dailies quickly and doesn't really force you to play every game mode and you can do resource missions by just doing auto battle.\nQuite good 3D design and the turn based strategy system makes it fun.\n\n-Stories are kinda weak and uninteresting except for some dolls.\n-Most of the game is kinda point and click adventure, you don't really have the chance to walk around the deck of your ship (except for the upcoming deck crew but it will just be an limited area)\n\nI played the first game for maybe an hour but the gameplay and the 2D chibi style wasn't my style, but other users gave me the impression the first game was quite dark and intense at times. Reading some summaries about some characters, plot twists and some war crime stuff dolls and other actors did made it look quite mature and interesting. But for GFL2 it seems a bit of the opposite. Most of the time it seems like the event story is just the character banner is out on some random \"lets go adventure\" quests. Every event story starts and end the same. The commander or already recruited dolls find another doll from the past, they do stuff and defeat some baddies and joins the Commander and his ship.\nThe one event quest I didn't skip was probably Klukai's story event which had full voice acting and even some action-full cutscenes.\nIn addition, GFL2 takes place 10 years after GLF1 so some story elements may be lost in context.\n\nCharacter releases are first released on the Chinese client before they are released on global clients which varies an average of 4 to 8 months. And the lineup is not the same as the Chinese client.\n\nNevertheless, I find myself returning to this game and enjoy the content.\nIf you like Anime gacha games, strategy and guns, do give it a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Honestly im a simple person, i see Boobs, I play.\n\nhonestly only playing it cuz its basically Softcore Hentai. HAVE yall seen the Boob physics,NOW THAT is something to play for.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Please Release Girl Frontline 1 for Malaysia region on Steam, it not available for us Malaysian and i really want to play that game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great X-Com like gameplay. Pretty models at the dorm.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the crew deck update really brings a breath of fresh air into the game. interacting with the characters there is a joy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics and amazing characters. The lore and story of the GFL universe is amazing. Despite the recent gacha skin drama, the game is very F2P friendly and offers a great character building experience. The game follows a pretty straight forward formula when it comes to combat but its enjoyable and fun if you enjoy turned based combat. Would recommend to anyone looking to acquire some gun girl waifus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]DISCLAIMER: I plan on updating this review every year to better reflect the state of the game.[/h1]\r\n[h2]First year overview:[/h2]\r\nFirst year has been rather turbulent, full of ups and downs. This is true for both CN and Global versions and currently developers are planning to synch up both versions, about half+- year remains until that point.\r\nHowever, judging by CN events, this anniversary is the turning point where it gets better. Story development was slow in the 1st year, but now there are no filler events remainning, so we will get to the juicy parts quicker.\r\nMany QoL features from CN also made their way to Global. If you wish to begin playing, now is the good time to start.\r\n[h2]Base game review: (this part won't change, unless major changes were made)[/h2]\r\n[h3]Pros:[/h3]\r\n- Developers are pretty generous with event rewards, i only spent 20-30 dollars in 8 months of playing the game and have 80% of all characters (could've been more if my luck wasn't so bad, ha).\r\n- The game isn't so difficult and you don't need to have a lot of characters with maxxed dupes to clear endgame content, unless you want to seriously compete in leaderboards. Feel free to pull for whoever you like the most. I've heard plenty of horror stories from HSR players about powercreep and very unforgiving endgame without whaling in gacha, rest assured you won't have that here.\r\n- Since this is a sequel, the story and lore are much more developed compared to other gacha games. I highly suggest to play GFL1 or at least read it's story through the wiki if it's not your cup of tea. The protagonist - Commander, is not a blank slate, has a distinc personality and there are no pointless \"dialog options\", which are always just 1)yes and 2)yes, but in other words (looking at you Genshin and WuWa). Narrative is linear, but it allows it to be more fleshed out.\r\nIn my opinion, story and lore the BIGGEST reason to immerse yourself in GLF universe. There is also a single-player spin-off Reverse Collapse: Code name Bakery and another gacha Project Neural Cloud, recommeded as well.\r\n- 3D models are very high quality, even on mid-low settings.\r\n- OST composed by Vanguard Studios. If you know, you know. Superb work as always.\r\n[h3]Cons:[/h3]\r\n- The easy difficulty i mentioned earlier is also a negative. Developers took inspiration from XCOM 2 when designing gameplay, but not enough of the tactical aspect made it's way here.\r\n- Somewhat questionable management decisions. MICA is a bit infamous for their occasional incompetence, but they conduct surveys on a monthly basis and staff members relay suggestions to the developers made by players in the official discord server.\r\nI admit, i'm having trouble naming more cons and you can call me biased in that regard, but i really want you to give this game a chance. No game is perfect of course, but the fact that GFL1 and PNC are still up and running even almost a decade later is proof of their dedication and passion.\r\n[h2]Conclusion:[/h2]\r\nSolid sci-fi novel that sometimes suffers from being a gacha game. Nevertheless, it has a great potential and the setting makes it stand out among it's competitors. I shall stick around and continue to report on what this game has to offer.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Instead of making gacha skins overpriced and giving something like 50~80% of its required resources for free, make it fairly priced and give less free resources. Why? Because once you run out of the free resources you won't have to make a dent in your wallet to purchase it and let's be honest: no way they'll give us enough resources to keep up with the release of skins, so we'll get hit with full prices more often than not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buenos graficos, en comapracion de otros juegos como este no son la gran cosa me me gustan.\r\nbuena jugabiliadad, simple y facil de entender, pero lo que importa es que las chicas estan muy lindas y con eso me basta",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am reviewing it for the Steam reward, but!\n\nI played on the standalone version.\n\nFrom all the gachas available, this one have the best feet so far.\n\nI don't play it anymore because I hate the energy systems there are in gacha games. Forcing you to play daily but for a limited time, unless, of course, you crack your wallet open.\n\nI wish there would be more interactions with the girls.\n\nRecommended because of peak feet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "suprisingly good. for its genre plus its a sequel to previous title. \nstory? what it was about? its definitley there but there's nothing to do unless new chapter drops.\ncharacters? some new and old faces come and return. \n\noverally i'd recommend it when you want to commit warcrimes with your crew but under new management. \ni rate this 416 out of 10 \n(note: thats baisicly foolery than actuall review. might edit this later to make it look like solid review)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice X-Com style gacha game without cheating enemies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly deep, dark and engaging story.\n\nWell developed turn based cameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always trust the plan, no matter how bleak things look.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty friendly gacha in the long run.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I believe in german guns supremacy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Collecting your gun wife, DSR-50",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nep~. nep, nep nep. (HK416 my beloved~. also i play on darkwinter, not here so dont let the 3.6hrs on my profile fool you)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "springfield is kinda cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have you seen just how detailed their FEET are??!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "waifus for everyones liking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lost most of my 50/50 \nI love gambling",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Waifu game i Love",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Voymastina best waifu",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game for real men",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very shit game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "krolik best girl",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "scarring PTSD part 2\n\nnow in 3D!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "there sure is a uh frontline here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buen fan service",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feet Frontline",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The skins are goated tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "waifus with raifus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FunuFUn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gucci",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dauter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IYKYK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pew Pew.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tits",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hmm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Here I will leave the cat,\nfriends who pass by can pet it and give it a thumbs up and awards\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "+One of the most F2P friendly gatcha games there is. Compared to other gacha games it's quite easy to accumulate gems for banner pulls.\nEasily lets you finish dailies quickly and doesn't really force you to play every game mode and you can do resource missions by just doing auto battle.\nQuite good 3D design and the turn based strategy system makes it fun.\n\n-Stories are kinda weak and uninteresting except for some dolls.\n-Most of the game is kinda point and click adventure, you don't really have the chance to walk around the deck of your ship (except for the upcoming deck crew but it will just be an limited area)\n\nI played the first game for maybe an hour but the gameplay and the 2D chibi style wasn't my style, but other users gave me the impression the first game was quite dark and intense at times. Reading some summaries about some characters, plot twists and some war crime stuff dolls and other actors did made it look quite mature and interesting. But for GFL2 it seems a bit of the opposite. Most of the time it seems like the event story is just the character banner is out on some random \"lets go adventure\" quests. Every event story starts and end the same. The commander or already recruited dolls find another doll from the past, they do stuff and defeat some baddies and joins the Commander and his ship.\nThe one event quest I didn't skip was probably Klukai's story event which had full voice acting and even some action-full cutscenes.\nIn addition, GFL2 takes place 10 years after GLF1 so some story elements may be lost in context.\n\nCharacter releases are first released on the Chinese client before they are released on global clients which varies an average of 4 to 8 months. And the lineup is not the same as the Chinese client.\n\nNevertheless, I find myself returning to this game and enjoy the content.\nIf you like Anime gacha games, strategy and guns, do give it a try.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Honestly im a simple person, i see Boobs, I play.\n\nhonestly only playing it cuz its basically Softcore Hentai. HAVE yall seen the Boob physics,NOW THAT is something to play for.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Please Release Girl Frontline 1 for Malaysia region on Steam, it not available for us Malaysian and i really want to play that game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just got Florence, uogh. Very wifey, very gooner. 10/10, would recommend.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's a matter of taste but to me this is the greatest gacha I've ever played. But it is a gacha, with all the issues that come with that.\n\nI find it to be pretty f2p friendly even though I'm not f2p. A lot of the standard \"five stars\" are really good, and their weapons work for a lot of characters so you rarely feel the need to pull for specific weapons. Skins are great, skin gacha is going to suck but it's blown way out of proportion imo. It's a free game at the end of the day.\n\nTo me the real winner is the gameplay style as well as by far the best character design out of any gacha. I'm so bored of the generic fantasy gacha where every character looks the same and they are all filled with asymmetry as if that makes a design interesting (Genshin, WuWa, etc).\n\nThe characters in this game are always top tier (aside from some of the \"four stars\" but who cares about those). Also very few lolis which is a huge plus for me.\n\nAlso the whole gun focus is a nice touch!\n\nRecommended!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great X-Com like gameplay. Pretty models at the dorm.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the crew deck update really brings a breath of fresh air into the game. interacting with the characters there is a joy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics and amazing characters. The lore and story of the GFL universe is amazing. Despite the recent gacha skin drama, the game is very F2P friendly and offers a great character building experience. The game follows a pretty straight forward formula when it comes to combat but its enjoyable and fun if you enjoy turned based combat. Would recommend to anyone looking to acquire some gun girl waifus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My top gacha game right now. I played a handful of gacha games before and this one so far delivers the most on all fronts.\r\n\r\nGameplay i very much enjoy, lots of player expression on each level on how to beat them and approach them.\r\n\r\nGacha wise it's pretty generous. We are getting a lot of resources to pull our dolls.\r\n\r\nMost of the Negative reviews are people complaining about the skin gacha that this version doesn't even have yet. And as far as i remember you could free 2 play get the gacha skin before the banner ended for it.\r\n\r\nDolls are all beautiful. They are all unique in a way. You might like some more than the other thats fine.\r\n\r\nSome dolls are stupid broken gameplay wise, they make challenging content into a no issue.  There are not many dolls like this.\r\n\r\nThe story is by far the best story i read in a gacha game. Feels adult with how they describe events happening during story parts (example like a bullet shattering the skull of a man and blows their brain out) They pretty vividly describe stuff like this.\r\n\r\nIf you want to play a turn based gacha game with animu and guns, 100% give it a shot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "pretty interesting compared to the first game, nice to make the player involved in the actual combat rather than forcing them to watch (although that might just be because they can't make it work on mobile without performance issues)\noh and the animated scenes are also a nice touch\n\none thing I'm confused about are the reviews, some complain about the skins and some about the gameplay\nI think people are forgetting that skins are optional?\n\nmy only issue with this game is the fact getting dolls is pretty luck-dependent since weapons and characters are thrown into the same pool but it doesn't really ruin the game that much since it's not like you need to swap characters every 2 stages just to complete them and it does give you some time to level up your current characters rather than just letting them rot after immediately getting a way better character",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[h1]DISCLAIMER: I plan on updating this review every year to better reflect the state of the game.[/h1]\r\n[h2]First year overview:[/h2]\r\nFirst year has been rather turbulent, full of ups and downs. This is true for both CN and Global versions and currently developers are planning to synch up both versions, about half+- year remains until that point.\r\nHowever, judging by CN events, this anniversary is the turning point where it gets better. Story development was slow in the 1st year, but now there are no filler events remainning, so we will get to the juicy parts quicker.\r\nMany QoL features from CN also made their way to Global. If you wish to begin playing, now is the good time to start.\r\n[h2]Base game review: (this part won't change, unless major changes were made)[/h2]\r\n[h3]Pros:[/h3]\r\n- Developers are pretty generous with event rewards, i only spent 20-30 dollars in 8 months of playing the game and have 80% of all characters (could've been more if my luck wasn't so bad, ha).\r\n- The game isn't so difficult and you don't need to have a lot of characters with maxxed dupes to clear endgame content, unless you want to seriously compete in leaderboards. Feel free to pull for whoever you like the most. I've heard plenty of horror stories from HSR players about powercreep and very unforgiving endgame without whaling in gacha, rest assured you won't have that here.\r\n- Since this is a sequel, the story and lore are much more developed compared to other gacha games. I highly suggest to play GFL1 or at least read it's story through the wiki if it's not your cup of tea. The protagonist - Commander, is not a blank slate, has a distinc personality and there are no pointless \"dialog options\", which are always just 1)yes and 2)yes, but in other words (looking at you Genshin and WuWa). Narrative is linear, but it allows it to be more fleshed out.\r\nIn my opinion, story and lore the BIGGEST reason to immerse yourself in GLF universe. There is also a single-player spin-off Reverse Collapse: Code name Bakery and another gacha Project Neural Cloud, recommeded as well.\r\n- 3D models are very high quality, even on mid-low settings.\r\n- OST composed by Vanguard Studios. If you know, you know. Superb work as always.\r\n[h3]Cons:[/h3]\r\n- The easy difficulty i mentioned earlier is also a negative. Developers took inspiration from XCOM 2 when designing gameplay, but not enough of the tactical aspect made it's way here.\r\n- Somewhat questionable management decisions. MICA is a bit infamous for their occasional incompetence, but they conduct surveys on a monthly basis and staff members relay suggestions to the developers made by players in the official discord server.\r\nI admit, i'm having trouble naming more cons and you can call me biased in that regard, but i really want you to give this game a chance. No game is perfect of course, but the fact that GFL1 and PNC are still up and running even almost a decade later is proof of their dedication and passion.\r\n[h2]Conclusion:[/h2]\r\nSolid sci-fi novel that sometimes suffers from being a gacha game. Nevertheless, it has a great potential and the setting makes it stand out among it's competitors. I shall stick around and continue to report on what this game has to offer.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Girls Frontline story is very mature and serious unlike other gacha games, you have some appeal to fanservice aswell, but the plot of the game is based and dark.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Instead of making gacha skins overpriced and giving something like 50~80% of its required resources for free, make it fairly priced and give less free resources. Why? Because once you run out of the free resources you won't have to make a dent in your wallet to purchase it and let's be honest: no way they'll give us enough resources to keep up with the release of skins, so we'll get hit with full prices more often than not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buenos graficos, en comapracion de otros juegos como este no son la gran cosa me me gustan.\r\nbuena jugabiliadad, simple y facil de entender, pero lo que importa es que las chicas estan muy lindas y con eso me basta",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not predatory monetization scheme, very-quick-to-do dailies, hot tactical dolls. Y'know, the usual...\r\nMight be boring to some if absuing of autoplay, and also due to the gunsmoke being basically the only end game event, but if not for that, it's still a nice timesink.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am reviewing it for the Steam reward, but!\n\nI played on the standalone version.\n\nFrom all the gachas available, this one have the best feet so far.\n\nI don't play it anymore because I hate the energy systems there are in gacha games. Forcing you to play daily but for a limited time, unless, of course, you crack your wallet open.\n\nI wish there would be more interactions with the girls.\n\nRecommended because of peak feet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "suprisingly good. for its genre plus its a sequel to previous title. \nstory? what it was about? its definitley there but there's nothing to do unless new chapter drops.\ncharacters? some new and old faces come and return. \n\noverally i'd recommend it when you want to commit warcrimes with your crew but under new management. \ni rate this 416 out of 10 \n(note: thats baisicly foolery than actuall review. might edit this later to make it look like solid review)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice X-Com style gacha game without cheating enemies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "any game where u could be the only male with bunch of waifus is 10/10! its a dream",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What is Grass? More Than Just the Green Under Your Feet\r\nGrass is a ubiquitous and remarkably diverse group of plants that blankets vast stretches of our planet, from manicured lawns and sprawling savannas to the cereal crops that feed a significant portion of the world's population. Belonging to the Poaceae family, one of the largest and most economically important plant families, grasses are characterized by their relatively simple structure, yet they play a crucial and multifaceted role in both natural ecosystems and human civilization.\r\n\r\nAt its core, grass is a monocotyledonous plant, meaning it begins its life with a single seed leaf. Its structure is elegantly efficient for its primary functions of growth and resilience. Key features include fibrous root systems that anchor the plant and absorb water and nutrients, hollow, jointed stems called culms, and long, narrow leaves with parallel veins that grow from the base of the plant. This basal growth is a key adaptation that allows grasses to withstand grazing and mowing without being destroyed.\r\n\r\nThe diversity within the grass family is staggering, with over 12,000 identified species. This includes the familiar turf grasses that create our lawns and sports fields, the towering bamboo that can form dense forests, and the essential cereal grains such as wheat, rice, corn (maize), barley, and oats. These grains form the cornerstone of global food systems, providing a substantial portion of the calories consumed by humans and livestock.\r\n\r\nEcologically, grasses are indispensable. They are the dominant vegetation in many ecosystems, most notably grasslands, savannas, and prairies, which cover approximately 20% of the Earth's land surface. These ecosystems support a vast array of wildlife, from grazing herbivores like bison and antelope to the predators that depend on them. The extensive root systems of grasses also play a vital role in preventing soil erosion by binding the soil together. Furthermore, through the process of photosynthesis, grasses are significant producers of oxygen and play a crucial part in the global carbon cycle.\r\n\r\nThe economic importance of grasses extends far beyond their role as a food source. They are used for:\r\n\r\nAnimal Fodder: Hay and silage, derived from grasses, are essential feed for livestock.\r\n\r\nBiofuels: Certain grasses, like switchgrass and sugarcane, are being increasingly utilized for the production of ethanol.\r\n\r\nConstruction: Bamboo is a versatile and sustainable building material used in everything from scaffolding to flooring.\r\n\r\nRecreation and Aesthetics: Grasses are cultivated for lawns, parks, and sports fields, providing surfaces for a wide range of activities and enhancing the beauty of our landscapes.\r\n\r\nOther Uses: Grasses are also used in the production of paper, thatch for roofing, and even in some traditional medicines.\r\n\r\nIn essence, grass is a foundational element of our planet's biosphere. Its unassuming appearance belies a remarkable resilience, diversity, and importance that have shaped landscapes, supported civilizations, and continue to be a vital resource for both the natural world and human society.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Surprisingly deep, dark and engaging story.\n\nWell developed turn based cameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always trust the plan, no matter how bleak things look.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have nothing to say about this game...\nDo you want to play? PLAY!\nIf not.. Don't play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Waifus and guns, my life is complete.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun and easy going game. If you like the Anime-show and turn-based this is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game some animations or characters might have a slight sex appeal to them but i can understand that for an anime game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its a pretty friendly gacha in the long run.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I believe in german guns supremacy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Collecting your gun wife, DSR-50",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nep~. nep, nep nep. (HK416 my beloved~. also i play on darkwinter, not here so dont let the 3.6hrs on my profile fool you)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "waiting for the big booby mommy helen so for now im happy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "springfield is kinda cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have you seen just how detailed their FEET are??!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "waifus for everyones liking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lost most of my of my 50/50 \nI love gambling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waifu game i Love",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Voymastina best waifu",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game for real men",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very shit game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "krolik best girl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "scarring PTSD part 2\n\nnow in 3D!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "there sure is a uh frontline here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buen fan service",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feet Frontline",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like klukai",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The skins are goated tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "waifus with raifus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FunuFUn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ST AR-15 when?",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Waifu heaven!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "- First what works\n\nThe base systems, different gameplays and all the 3d models are top notch.\nYou may have a really great time doing some missions (like most of the BRIEF Hunter Assessments).\nThere is a lot of different game modes , a stealth one and a rogue lite one as exemples.\nThe gun customisation systems are really intresting, where you can build your waifu guns on specific stats and make horrifying looking guns for any gun mod enjoyer (looking at forward grip base mosin nagan here)\n\nThe game is fully voiced and that a really good point, with the dorms having like nice interactions with your waifu's.\n\n\n- Now the bad\n\n\n       The story is underwhelming and you are constantly bombarded by facts or past events without any context. As someone who was introduce to GLF world by this game that was really hard not to skip the main story. You know show dont tell.\nIt get a bit intresting around chapter 7 and it made me go play the First game on mobile to know all the past event references that are made. And to have more impact on \"reuniting\" with some dolls. But deamn that is sloppy for few days since the story is bound by your account lvl.\n\n      Gameplay wise you sadly can autoplay close to everything and thats really bad. The entire tactical, positioning and skill gameloop is under exploited just because you can autoplay it. Being the main story , the side quest , the bosses, the other game modes as well, are all meaningless since you literrally dont have to play the game.\n[-This is a genuin advice for the devs heads, please lock the dolls in the main story just like the BRIEF Assessments. By having other dolls you make a story and gameplay dissonance that is close to unbearable. I had to force myself to use the specifics dolls and really had a great time. The levels are design to be done with them. Bringing any other doll just make it a breeze. Then when other dolls are introduce, you can make the player \"feel\" for them before deciding to invest in the gasha, not just for the looks. You can unlock them for the \"Hard\" mode you have on the main story.\n- Lock autoplay as much as you can for the main story, bosses and the Stealth loop. It is more beneficial to have players hook on your game so they can maybe think of having a good skin on their dolls instead of ALT tabbing and go do something else (that curently what i'm doing while writing this review).\n- Use the different gameplays for the main story too. There is a moment in the story where You the player is alone fighting to get through ennemies. Why not use a well crafted Stealth level where you have to solve \"who to kill first puzzles\" and have a model for the commander. (everything is already in game).\nYou have a goldmine of a game and it is skipped by the autoplay\n\n     The Gasha and upgrade system (because yes they are tied).\nHaving your skills being upgraded by droping multiple dooblons of the same character is predatory (gasha it self is) AND you need to drop both the character and the weapon at least 7 times each. And it's not just some dmg numbers tweaks, it is quite literrally the skills , some skills can be done two to three times more in the same turn just because you dropped the character multiple times. \nYou can add up the premium CN server premium (so only real money) gasha with a 200 bucks min pity that might come to the global serv as well and you have a really predatory system to enjoy a game you do not have any incentive to play.\n\n    The Dolls\nThe dolls are literrally gun personified. It has been recently anounced that one of them will be a japanese gun and they gave her something else. No matter what a CN company making a JP gun was bound to be controversial in some way. So the real question is why chosing her instead of any other one of the first Opus that isn't in the game. You got a lot of soviet, European and American gals that could have done it (any one of the AR team, or really recognisable weapons like P90, Famas , a WW2 tube.  Dolls that are already in game, looking at Lena and Reva of task force 404. Or Even brand new one with a sword or a SF one from the first Opus)\n\n\nIn Short, \nGo play the first one for now, dont throw any money at them for now , even if the skins are cool (you'll only see them in the dorms , not in battle since you'll autoplay)\nWait and see.\nThe Potential is Enormous, but it is fumbled 80% of the time",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Great characters, visuals and f2p friendly character gacha\n\nMid story and gameplay, event minigames are a mixed bag but mostly fun\n\nBad business practices like gacha premium skins, overall disconnect between the dev team and the playerbase",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "You need to buy a wedding ring (with real money transaction) to powerup your dolls now, as the mod attachment updated to nerf our dolls to wear only purple attachment (2stat + 1 stat to be unlock ) + 1 gold attachment only.\n\nBefore that, the dolls were able to install few gold attachment (3stat ) .\n\nxdd game, i thought im playing turn based strategy game, but it more looks like to be a game to P2W now. since some of dolls with c6 , enable you to sweep the enemies using auto combat / just 1 shot easily .\n\ni rather play arknight instead of this goodluck.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "While I still enjoy the first game, Exilium simply isn’t to my liking. I’ve played more hours than I’d like to admit, but honestly, it’s not a good game in my opinion.\n\nI eagerly awaited Exilium’s release and played it for a while before realizing all its flaws.\n\nTo begin with, the story feels so weak. The main characters have little relevance, and the plot progresses far too slowly. People argue that the original also took time to develop, but two years after its release we already had Deep Dive and Singularity. Now, many story points lead nowhere, and it’s disappointing how the dark tone of the first game shifted to something forgettable.\n\nThe gameplay, while not perfect in the original either, feels even more repetitive and dull here. At least the first game experimented with different objectives and allowed decisions that led to alternate endings (Continuum Turbulence). Even the pvp is unbalanced, with the same doll teams in every match.\n\nAs for the gacha system, the original is far superior to this one. Resources were easy to obtain, and production results were actually rewarding. Exilium uses the Genshin gacha, where you must grind or pay for collapse pieces on each banner to get what you want and have greater efficiency. You won't get much by playing as f2p. You need to pull duplicates for skills, and even the oath now requires payment unlike the original, which allowed you to get it with gems, which the game frequently gave you but weren't necessary for natural progress either.\n\nFanservice isn’t inherently bad, but here it’s excessive. The constant focus on character attributes, exaggerated jiggle, and foot fetish make it feel annoying. The original also had fanservice skins, yes, but they were 2D skins, much lighter and more irrelevant. It’s annoying to see well developed and impactful characters like 416 or RO, characters who went through a conspiracy, terrorism, a machine rebellion, and had personality problems, now reduced to prostitute skins and jiggle.\n\nIf you’re interested in this game, just skip it and try the original instead. Given how the original story ended, I expected something far better from its sequel. If you still enjoy Exilium that’s fine, but it's definitely not a good sequel.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I'd love to give this game a positive review.\r\n\r\nBut a critical log in bug has occurred to me twice during my time playing, leaving me unable to log into the game for days to weeks. I've never experienced this with any other games, and I've played a lot of Steam gacha games. So the port seem to be terribly poorly maintained and seemingly easily become out of date compared to the server version and phone versions.\r\n\r\nApart from being unable to play, I'd rate the game positively with an interesting strategy gameplay which when short on time can often be automated. (But you have to be overleveled to clear it on auto).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a lottery on the PC, will it start (login) or not... click once on \"start\" and nothing, twice, nothing, 100 times and you get once \"loading server information\" and then nothing. With luck you will login and can play. This game is a phone title of the worst type.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it's advertised as an x-com like game with competent worldbuilding, storytelling with some fanservice on the side.\n\nin reality it's practically a p2w autobattler  attached to a lousy goonslop for \"pepole\" who think PEGI-16-at-best sexualisation for the price of -sometimes multiple- hentai game is the deal of the century",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros: one of the best gacha games in the turn-based strategy genre overall, cool style and design, pleasant graphics and voice acting, good optimization on both PC and mobile devices, dormitory with dolls.\n\nCons: gacha system with skins for premium currency, developers who don't engage in transparent dialogue with the player community, every update is similar to the previous one but with a new character, in one of the latest updates another character progression system was added with quite heavy grind.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is not the way forward, you shouldn't be genshin impact, wth is this anniversary event",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "please I beg of you, just one 416 skin that isn't just progressively showing more skin. redesign is shit, all the redesigns are shit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "man that update for the crew deck makes them look so greedy like damn, you are that desperate?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "$200 for a skin???? with $30 on snowbreak you got a preatty skin + interactive scene, big no this time mica",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "ADD SANGVIS FERRI ADD DESTROYER ADD DREAMER ADD JUDGE",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "snoozefest, why is the story so lousy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "china gets everything a year before anyone else",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "God awful game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too goon for me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "#WTF An internal error has occurred in the compiler.\n1>  (compiler file 'e:\\bt\\278379\\vctools\\compiler\\be\\p2\\main.c[0x10BC4BBF:0x00000009]')",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly this game can be very fun at times, And it has some nice character designs and an interesting story...\n\nSo why the negative review?\nWhile I love the game at heart... I just feel so burnt out over multiple things regarding this game in general...\n\n- Gunsmoke\nIt's a fun gamemode at heart, But it feels really boring once you figure out all the boss mechanics and the best and optimal way to play it. It feels more like a 9/5 obligation to do in a platoon rather than a fun event to compete for high score, and considering the power creep with certain dolls and such it makes this mode either a breeze or a slogfest depending on your units and such...\n\nPreferably I'd love a mode where either the boss is more engaging with randomized patterns or for there to just be a preset team comp auto you can use instead of wasting 5 - 10 mins per run praying that either Auto is good enough or you can figure out how to use said teams (My smooth brain likes simplicity)\n\n- Leveling\nThe grind continues, With the current event they added some kinda flower thing that unlocks at Level 55 per Doll...\nThat system helps with saying yeah lets grind and min max things... but its the Boundary push gamemode that drives me off it, At first It was a fun novelty but I'd honestly prefer something more linear like a boss rush and taking down a few guys rather than trying to avoid battles where I can and stuff... Just feels tedious to go through and I would probably do it if I felt like it was well needed...\n\nAs for basic leveling you have two mission and Neural helix cores that you just farm up using your daily Intelegence points n whatnot...\n\n- Characters\nKlukai is stronk, god forbid what AK-15 is gonna do considering her at V6 is supposedly 3x Klukais in damage output alone... Which is insane to say... only time will tell when CN stuff finally catches up to global...\n\nBut the power creep is real with this game, Either you pickup good characters for end game content or fall behind drastically because you chose Waifu Over Meta... which I dont blame people doing so considering Mica is doing everything they can to farm money out of people...\n\nThe whole Skin Gacha system was a mess on CN, and I really hope that it wont be implemented for global but who knows at this point... It probably will be :/\n\n- Gameplay\nIt's a top down game where you either shoot up a boss and merk them, Take out all the enemies or run away... There is other things you can do but aside from all of that, It's not super engaging once you get powerfull units that will probably breeze through most Story content (That and you can just borrow a friends OP Unit to breeze through it anyway, Defeating any need to grind unless you wanna play end game content or level things up)\n\nAll in all it has fun potential but in short: Powercreep makes this part mostly irrelivent as I can just get my waifu on a bike and run over everything and just win... Thanks Mica... Very cool...\n\n- Is it worth it?\nHonestly, No... After playing this game via launcher for a few hundered hours on there... It just doesn't feel engaging or fun enough to open up and play... The event stories for the past few events just felt lackluster at best and I feel 0 Motivation to even play them.\n\nWhile I love this game and all, and have made many good friends thanks to it. It truly just doesn't feel worth the time invested into it. As at most Im practically gonna need to get V6 Lind just to finish my team comps and retire from the game xD\n\nI wish i could say the game is good but honestly it just isnt... I've sunk way too much time and money tbh into this and all the game has become to me is just a boring chore list to do every day... No Excitement, Just Platoon obligations for me :/\n\nAtleast the girls are nice ig, But my goodness does it become a headache trying to deal with this whole new \"Catch Up\" thing Mica is tryna do... I barely feel like I have the time to fix up my dolls and make them good enough for things while also praying that I can get any new ones I like and however many dupes I need.\n\nFor anyone wanting to play the game F2P: Only pull for Springfield and Vector and just make a basic Hydro Team and Fire team as the rest can be obtained via standard banner and borrowed units when needed ig if you care about meta, Otherwise this game is just something you might touch once in a blue moon then forget about as it's honestly hit or miss regardless..\n\nFor anyone looking to whale at a gacha, This game aint it chief... You're better off spending that money elsewhere or buying some nice games rather than spending it here... \n\nTldr:\nGame: 2/10\nGameplay: 4/10 (Becomes Auto city when u have Op units)\nGacha: 6/10 (Without skin gacha)\nEngagement: 6/10 (End Game Engagement: 2/10)\nStory: 7/10 (Event Stories: 4/10)\nMoney Spent: Probably too much, Forgive me for I have sinned\nWorth it?: No\n\n...i dunno how to compose a review uhhhh, hope this helps anyone reading lol xD\n\n- Edit\nGetting this to run on the steam deck is a nightmare and a half... Dunno why I tried but yeah...",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "As much as i love this game, the recent update (Phase Crash) is the thing that make me quit this game. This game doesn't respect your money, doesn't respect your time, doesn't respect the community.\r\nThe Phase Crash take so much of your time, can't auto play and most importantly it's not even fun, it's feel like a chore that take 3 hour of your life weekly.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "- First what works\n\nThe base systems, different gameplays and all the 3d models are top notch.\nYou may have a really great time doing some missions (like most of the BRIEF Hunter Assessments).\nThere is a lot of different game modes , a stealth one and a rogue lite one as exemples.\nThe gun customisation systems are really intresting, where you can build your waifu guns on specific stats and make horrifying looking guns for any gun mod enjoyer (looking at forward grip base mosin nagan here)\n\nThe game is fully voiced and that a really good point, with the dorms having like nice interactions with your waifu's.\n\n\n- Now the bad\n\n\n       The story is underwhelming and you are constantly bombarded by facts or past events without any context. As someone who was introduce to GLF world by this game that was really hard not to skip the main story. You know show dont tell.\nIt get a bit intresting around chapter 7 and it made me go play the First game on mobile to know all the past event references that are made. And to have more impact on \"reuniting\" with some dolls. But deamn that is sloppy for few days since the story is bound by your account lvl.\n\n      Gameplay wise you sadly can autoplay close to everything and thats really bad. The entire tactical, positioning and skill gameloop is under exploited just because you can autoplay it. Being the main story , the side quest , the bosses, the other game modes as well, are all meaningless since you literrally dont have to play the game.\n[-This is a genuin advice for the devs heads, please lock the dolls in the main story just like the BRIEF Assessments. By having other dolls you make a story and gameplay dissonance that is close to unbearable. I had to force myself to use the specifics dolls and really had a great time. The levels are design to be done with them. Bringing any other doll just make it a breeze. Then when other dolls are introduce, you can make the player \"feel\" for them before deciding to invest in the gasha, not just for the looks. You can unlock them for the \"Hard\" mode you have on the main story.\n- Lock autoplay as much as you can for the main story, bosses and the Stealth loop. It is more beneficial to have players hook on your game so they can maybe think of having a good skin on their dolls instead of ALT tabbing and go do something else (that curently what i'm doing while writing this review).\n- Use the different gameplays for the main story too. There is a moment in the story where You the player is alone fighting to get through ennemies. Why not use a well crafted Stealth level where you have to solve \"who to kill first puzzles\" and have a model for the commander. (everything is already in game).\nYou have a goldmine of a game and it is skipped by the autoplay\n\n     The Gasha and upgrade system (because yes they are tied).\nHaving your skills being upgraded by droping multiple dooblons of the same character is predatory (gasha it self is) AND you need to drop both the character and the weapon at least 7 times each. And it's not just some dmg numbers tweaks, it is quite literrally the skills , some skills can be done two to three times more in the same turn just because you dropped the character multiple times. \nYou can add up the premium CN server premium (so only real money) gasha with a 200 bucks min pity that might come to the global serv as well and you have a really predatory system to enjoy a game you do not have any incentive to play.\n\n    The Dolls\nThe dolls are literrally gun personified. It has been recently anounced that one of them will be a japanese gun and they gave her something else. No matter what a CN company making a JP gun was bound to be controversial in some way. So the real question is why chosing her instead of any other one of the first Opus that isn't in the game. You got a lot of soviet, European and American gals that could have done it (any one of the AR team, or really recognisable weapons like P90, Famas , a WW2 tube.  Dolls that are already in game, looking at Lena and Reva of task force 404. Or Even brand new one with a sword or a SF one from the first Opus)\n\n\nIn Short, \nGo play the first one for now, dont throw any money at them for now , even if the skins are cool (you'll only see them in the dorms , not in battle since you'll autoplay)\nWait and see.\nThe Potential is Enormous, but it is fumbled 80% of the time",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Girls' Frontline 2: Exilium has become a frustrating mess, especially after its recent updates. The gacha system is brutally unforgiving, with a tiny chance to get the best characters and a high pity count that demands a massive investment of time or money. Worse, weapons and characters share the same gacha pool, making meaningful progression entirely dependent on luck rather than strategy. To make matters worse, the latest patches have ruined the gameplay, while new events and characters force you into a tedious grind for minimal rewards. Instead of fixing these core issues, the developers have only doubled down on more monetization, making the game feel like a shallow and expensive cash grab that has completely lost its strategic soul.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "The game models are amazing—probably the best graphics out of any other gacha, and I've tried them all. But the game itself is boring af. From the very beginning, you can just auto everything. Also, rates seem atrocious; you're only going to get blue weapons and a purple trying to pull for a character—a classic Genshin experience. Not worth it, honestly. It's not even a decent gooning game, and it really tries to be just that.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Good idea to have 2 different providers. Can't even transfer progress over here.\n\nThe other steam launcher is locked behind region.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I really like the story of Girls' Frontline in general and had a lot of fun with the first game, but Exilium didn't live up to its predecessor in any way. The gameplay got boring really fast, powercreep couldn't be more in your face if it tried, and the story is so boring I caught myself skipping most event cutscenes after watching the first few of each. I pushed myself to keep playing this game despite its flaws, but there's a limit to how far that will take me.\nI really want GFL2 to be better, I want to enjoy playing it, but until I receive news about changes that would make enjoying it possible, I'm dropping it.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Simply put, I just play this game for the beautiful 3D character models. Some character designs are great, but I can see they are becoming more and more generic down the line.\n\nI play it on auto, even though I'm a fan of XCOM. The daily routine is too long and I have to press the auto button every battle, why can't I set it on default?\n\nBoth the main story and side stories are so long-winded, at some point I just don't care anymore. Just uninspiring generic anime stuff. Now I know every gacha game has reviews online saying they have the best story they have ever come across, they are all either PR crap or written by a 10-year-old.\n\nI didn't play the first game but I read about the \"old character incident\" and thought it was more interesting than the game itself tbh. The developers actually thought it was a good idea to explain \"the dolls have their own life\" while it is at its core a waifu gacha game (I know they want it to be more than that, but let's be real). So dudes invested time and money on the dolls just to be their dad? The audacity lol. What were they thinking?\n\nIt's a shame coz I think the game has good quality on the surface, but it just doesn't have that engaging element to get me really \"playing\" it, other than collecting daily resources and buying skins occasionally. And soon they're gonna gacha the skins too smh. Ironically this time they are on point. They know my pattern: pay for the skins, gacha the dolls with free gems, auto the game to save time so I can play some other games instead.\n\nI want to treat this game more than an electronic bonsai, as the developers put it, but for me the content is just not interesting enough. Another XCOM game drops I'll surely play the heck out of it, but this game I just can't be bothered. If the developers can figure out why and bridge the gap, they can easily take my money. This game looks good but its future doesn't. It's so unplayable on different levels, I just don't understand it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Great characters, visuals and f2p friendly character gacha\n\nMid story and gameplay, event minigames are a mixed bag but mostly fun\n\nBad business practices like gacha premium skins, overall disconnect between the dev team and the playerbase",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Played this game ever since it came out ad I really [b] REALLY [/b] enjoy it and spent more money on it then I dare say [b] JUST [/b] to mainly support the game. [b] BUT [/b] if they think putting gatcha costumes into a game which already heavily runs on gambling for characters and their weapons/upgrades to make them stronger, it's basically just a slap in the face to those who actually [b] CARE [/b] about the game's future. I have no idea who tought [b] 200€ [/b]for a [b] single [/b] costume going to be a [i] good idea [/i] but it shows how much they just don't care about this whole thing.\n\nI want to reach out for every other commander who plays and loves the game to [b] HEAVILY [/b] reconsider if buying costumes in-game right now is such a good idea. CN community doing god's work to pressure them into giving in and so should we support them for their and for our own sake.\n\nI will keep an eye out of the situation with the gacha costume and edit my review and recommendation depending if they going to fix the mess they bough on themself.\n\n[h3][b] Edit: [/b][/h3]\nThe devs changed [i] some [/i] parts that was hated on that latest update but the expensive gatcha comstume going to stay.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "- Rushed events and banners\n- Skins costing 200USD?... Nahh\n- 1 character without copies power creeping the entire game characters.\nUh?\n\nAnd well, this could be more fun if it was a TPS game just like SAO Fatal bullet and openfield/world. (personal preference)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "You need to buy a wedding ring (with real money transaction) to powerup your dolls now, as the mod attachment updated to nerf our dolls to wear only purple attachment (2stat + 1 stat to be unlock ) + 1 gold attachment only.\n\nBefore that, the dolls were able to install few gold attachment (3stat ) .\n\nxdd game, i thought im playing turn based strategy game, but it more looks like to be a game to P2W now. since some of dolls with c6 , enable you to sweep the enemies using auto combat / just 1 shot easily .\n\ni rather play arknight instead of this goodluck.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "While I still enjoy the first game, Exilium simply isn’t to my liking. I’ve played more hours than I’d like to admit, but honestly, it’s not a good game in my opinion.\n\nI eagerly awaited Exilium’s release and played it for a while before realizing all its flaws.\n\nTo begin with, the story feels so weak. The main characters have little relevance, and the plot progresses far too slowly. People argue that the original also took time to develop, but two years after its release we already had Deep Dive and Singularity. Now, many story points lead nowhere, and it’s disappointing how the dark tone of the first game shifted to something forgettable.\n\nThe gameplay, while not perfect in the original either, feels even more repetitive and dull here. At least the first game experimented with different objectives and allowed decisions that led to alternate endings (Continuum Turbulence). Even the pvp is unbalanced, with the same doll teams in every match.\n\nAs for the gacha system, the original is far superior to this one. Resources were easy to obtain, and production results were actually rewarding. Exilium uses the Genshin gacha, where you must grind or pay for collapse pieces on each banner to get what you want and have greater efficiency. You won't get much by playing as f2p. You need to pull duplicates for skills, and even the oath now requires payment unlike the original, which allowed you to get it with gems, which the game frequently gave you but weren't necessary for natural progress either.\n\nFanservice isn’t inherently bad, but here it’s excessive. The constant focus on character attributes, exaggerated jiggle, and foot fetish make it feel annoying. The original also had fanservice skins, yes, but they were 2D skins, much lighter and more irrelevant. It’s annoying to see well developed and impactful characters like 416 or RO, characters who went through a conspiracy, terrorism, a machine rebellion, and had personality problems, now reduced to prostitute skins and jiggle.\n\nIf you’re interested in this game, just skip it and try the original instead. Given how the original story ended, I expected something far better from its sequel. If you still enjoy Exilium that’s fine, but it's definitely not a good sequel.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I'd love to give this game a positive review.\r\n\r\nBut a critical log in bug has occurred to me twice during my time playing, leaving me unable to log into the game for days to weeks. I've never experienced this with any other games, and I've played a lot of Steam gacha games. So the port seem to be terribly poorly maintained and seemingly easily become out of date compared to the server version and phone versions.\r\n\r\nApart from being unable to play, I'd rate the game positively with an interesting strategy gameplay which when short on time can often be automated. (But you have to be overleveled to clear it on auto).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't get past start screen bcs game crashes every time. Tried fixing it by following guides on steam and only wasted my time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Optimization is so bad. Play on mobile or emulator is way smoother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a lottery on the PC, will it start (login) or not... click once on \"start\" and nothing, twice, nothing, 100 times and you get once \"loading server information\" and then nothing. With luck you will login and can play. This game is a phone title of the worst type.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "new player gacha and targeted got mosint nagant (lose 50%). uninstalled. XD",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's the typical mobile waifu game. Great for people who wants to stare at waifus most of the time.\nGameplay wise it's inferior to most turn based games on PC. X-COM, Jagged Alliance, etc all are far more mechanically refined. \n\nIn GFL2 here, the gameplay here is so mind boggling boring that most of the time it involves turning on auto battle and not playing the game, which begs the question why even have a turn based game in the first place. Missions that require some manual control is quite trivial even if I was 2-3 levels below the recommended.\n\nMost of the game modes thus far is tedious, some metal gear solid style of sneaking around is so jarring when the main mechanic of the game is a turn based grid tactics game.\n\nBriefly on monetization, it follows the, quite frankly, toxic gacha style that Hoyo does with ZZZ, etc, where pulling duplicates of a character allows it to unlock unique benefits to their skills, while also having another banner for their unique weapon. I find this disturbingly greedy in my opinion and while in theory adds to the gameplay, it requires some insane luck or real life money. \n\nBack when Halo CE came out where it revolutionizes the first person genre which made many following games adapt it's mechanics, I do not believe following Hoyo's way of handling duplicates does anything to help GFL2. Refer to Cygame's Princess Connect or Nexon's Blue Archive for a better system on handling duplicates.\n\nAll in all, it is a heavily flawed game that is outclassed by almost every other PC turn based grid tactics game. Quite frankly apart from looking at waifus do suggestive poses, I cannot recommend this game to anyone who wants a more compelling turn based game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it's advertised as an x-com like game with competent worldbuilding, storytelling with some fanservice on the side.\n\nin reality it's practically a p2w autobattler  attached to a lousy goonslop for \"pepole\" who think PEGI-16-at-best sexualisation for the price of -sometimes multiple- hentai game is the deal of the century",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't work at all on linux/Steamdeck.\n\nThe first run when it downloads resources will work fine, but after that, if you want it to work without crashing at the start, you'll need to make 3 or 4 tricks (some guy on Reddit gave the instructions, thanks lad) and even after that, it still doesn't work because the \"start\" button doesn't even work!\n\nI'm so glad I didn't had to pay for this...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Forced to play it in german altho I want to play it in english, when I finally can change language, I missed a great part of the story. Missions cost energy that refills over time - this system is outdated, sucks and was never good in any game... also, why the f**k is this game on steam if it requires you to use an account outside of steam like google or facebook. No thanks! Avoid this garbage at all cost.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros: one of the best gacha games in the turn-based strategy genre overall, cool style and design, pleasant graphics and voice acting, good optimization on both PC and mobile devices, dormitory with dolls.\n\nCons: gacha system with skins for premium currency, developers who don't engage in transparent dialogue with the player community, every update is similar to the previous one but with a new character, in one of the latest updates another character progression system was added with quite heavy grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is not the way forward, you shouldn't be genshin impact, wth is this anniversary event",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Easily the worst thing to happen to humanity since WW2.\nOptimization sucks so bad you might as well stick dynamite in an anthill and not cover your ears. They literally scammed their players and lost their trust within like an hour. The odds are so bad and so horrific even I covered my eyes. This is such a sad downfall from the original game I have no words. Just like other gacha game, Mica has become a money-hungry greedy company. Do not support these developers. Play the original game, and don't even waste your time on this disasterous, storyless, horrendous piece of audiovisual media that's even considered a \"game\".",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Opens some custom bs window with google logo and wants me to login into google. Devs, are you high ?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It did not give me the rate up character, horrible gacha. How am I supposed to enjoy the early game by losing the 50/50? Terrible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "please I beg of you, just one 416 skin that isn't just progressively showing more skin. redesign is shit, all the redesigns are shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "man that update for the crew deck makes them look so greedy like damn, you are that desperate?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was fun for the first month but after that it got boaring",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If I had a dollar for every bad decision that the devs did, I would have 4 dollars. Which isn't much, sure, but it's enough for a cup of coffee from Starbucks. \n\nFrom the earlier launch and the Netorare controversy (mainly with the CN player base) \n\nto the newest decision with skin gacha with real money (and horrible pull rates!) for one of the most beloved characters. \n\nIt's bad decisions all around... I know money moves the world but you gotta control your greediness sometimes, this is just crazy and the latest gacha revenue info showing this was the worst performance since launch shows that no player base, not CN, not JP and not EN/Global liked that last decision, crazy stuff, I wouldn't recommend this game because it's blatantly clear that the devs puts greedy and money on top of user satisfaction...",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "force tutorial that suck. stamina that suck too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "$200 for a skin???? with $30 on snowbreak you got a preatty skin + interactive scene, big no this time mica",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game Experience : From lover to Unfaithful.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "ADD SANGVIS FERRI ADD DESTROYER ADD DREAMER ADD JUDGE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "เกมgoon กากด้วย แต่เล่นอยู่ดี",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "snoozefest, why is the story so lousy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "china gets everything a year before anyone else",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Horrible trash. Avoid at all costs",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "God awful game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too goon for me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "#WTF An internal error has occurred in the compiler.\n1>  (compiler file 'e:\\bt\\278379\\vctools\\compiler\\be\\p2\\main.c[0x10BC4BBF:0x00000009]')",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly this game can be very fun at times, And it has some nice character designs and an interesting story...\n\nSo why the negative review?\nWhile I love the game at heart... I just feel so burnt out over multiple things regarding this game in general...\n\n- Gunsmoke\nIt's a fun gamemode at heart, But it feels really boring once you figure out all the boss mechanics and the best and optimal way to play it. It feels more like a 9/5 obligation to do in a platoon rather than a fun event to compete for high score, and considering the power creep with certain dolls and such it makes this mode either a breeze or a slogfest depending on your units and such...\n\nPreferably I'd love a mode where either the boss is more engaging with randomized patterns or for there to just be a preset team comp auto you can use instead of wasting 5 - 10 mins per run praying that either Auto is good enough or you can figure out how to use said teams (My smooth brain likes simplicity)\n\n- Leveling\nThe grind continues, With the current event they added some kinda flower thing that unlocks at Level 55 per Doll...\nThat system helps with saying yeah lets grind and min max things... but its the Boundary push gamemode that drives me off it, At first It was a fun novelty but I'd honestly prefer something more linear like a boss rush and taking down a few guys rather than trying to avoid battles where I can and stuff... Just feels tedious to go through and I would probably do it if I felt like it was well needed...\n\nAs for basic leveling you have two mission and Neural helix cores that you just farm up using your daily Intelegence points n whatnot...\n\n- Characters\nKlukai is stronk, god forbid what AK-15 is gonna do considering her at V6 is supposedly 3x Klukais in damage output alone... Which is insane to say... only time will tell when CN stuff finally catches up to global...\n\nBut the power creep is real with this game, Either you pickup good characters for end game content or fall behind drastically because you chose Waifu Over Meta... which I dont blame people doing so considering Mica is doing everything they can to farm money out of people...\n\nThe whole Skin Gacha system was a mess on CN, and I really hope that it wont be implemented for global but who knows at this point... It probably will be :/\n\n- Gameplay\nIt's a top down game where you either shoot up a boss and merk them, Take out all the enemies or run away... There is other things you can do but aside from all of that, It's not super engaging once you get powerfull units that will probably breeze through most Story content (That and you can just borrow a friends OP Unit to breeze through it anyway, Defeating any need to grind unless you wanna play end game content or level things up)\n\nAll in all it has fun potential but in short: Powercreep makes this part mostly irrelivent as I can just get my waifu on a bike and run over everything and just win... Thanks Mica... Very cool...\n\n- Is it worth it?\nHonestly, No... After playing this game via launcher for a few hundered hours on there... It just doesn't feel engaging or fun enough to open up and play... The event stories for the past few events just felt lackluster at best and I feel 0 Motivation to even play them.\n\nWhile I love this game and all, and have made many good friends thanks to it. It truly just doesn't feel worth the time invested into it. As at most Im practically gonna need to get V6 Lind just to finish my team comps and retire from the game xD\n\nI wish i could say the game is good but honestly it just isnt... I've sunk way too much time and money tbh into this and all the game has become to me is just a boring chore list to do every day... No Excitement, Just Platoon obligations for me :/\n\nAtleast the girls are nice ig, But my goodness does it become a headache trying to deal with this whole new \"Catch Up\" thing Mica is tryna do... I barely feel like I have the time to fix up my dolls and make them good enough for things while also praying that I can get any new ones I like and however many dupes I need.\n\nFor anyone wanting to play the game F2P: Only pull for Springfield and Vector and just make a basic Hydro Team and Fire team as the rest can be obtained via standard banner and borrowed units when needed ig if you care about meta, Otherwise this game is just something you might touch once in a blue moon then forget about as it's honestly hit or miss regardless..\n\nFor anyone looking to whale at a gacha, This game aint it chief... You're better off spending that money elsewhere or buying some nice games rather than spending it here... \n\nTldr:\nGame: 2/10\nGameplay: 4/10 (Becomes Auto city when u have Op units)\nGacha: 6/10 (Without skin gacha)\nEngagement: 6/10 (End Game Engagement: 2/10)\nStory: 7/10 (Event Stories: 4/10)\nMoney Spent: Probably too much, Forgive me for I have sinned\nWorth it?: No\n\n...i dunno how to compose a review uhhhh, hope this helps anyone reading lol xD\n\n- Edit\nGetting this to run on the steam deck is a nightmare and a half... Dunno why I tried but yeah...",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "- First what works\n\nThe base systems, different gameplays and all the 3d models are top notch.\nYou may have a really great time doing some missions (like most of the BRIEF Hunter Assessments).\nThere is a lot of different game modes , a stealth one and a rogue lite one as exemples.\nThe gun customisation systems are really intresting, where you can build your waifu guns on specific stats and make horrifying looking guns for any gun mod enjoyer (looking at forward grip base mosin nagan here)\n\nThe game is fully voiced and that a really good point, with the dorms having like nice interactions with your waifu's.\n\n\n- Now the bad\n\n\n       The story is underwhelming and you are constantly bombarded by facts or past events without any context. As someone who was introduce to GLF world by this game that was really hard not to skip the main story. You know show dont tell.\nIt get a bit intresting around chapter 7 and it made me go play the First game on mobile to know all the past event references that are made. And to have more impact on \"reuniting\" with some dolls. But deamn that is sloppy for few days since the story is bound by your account lvl.\n\n      Gameplay wise you sadly can autoplay close to everything and thats really bad. The entire tactical, positioning and skill gameloop is under exploited just because you can autoplay it. Being the main story , the side quest , the bosses, the other game modes as well, are all meaningless since you literrally dont have to play the game.\n[-This is a genuin advice for the devs heads, please lock the dolls in the main story just like the BRIEF Assessments. By having other dolls you make a story and gameplay dissonance that is close to unbearable. I had to force myself to use the specifics dolls and really had a great time. The levels are design to be done with them. Bringing any other doll just make it a breeze. Then when other dolls are introduce, you can make the player \"feel\" for them before deciding to invest in the gasha, not just for the looks. You can unlock them for the \"Hard\" mode you have on the main story.\n- Lock autoplay as much as you can for the main story, bosses and the Stealth loop. It is more beneficial to have players hook on your game so they can maybe think of having a good skin on their dolls instead of ALT tabbing and go do something else (that curently what i'm doing while writing this review).\n- Use the different gameplays for the main story too. There is a moment in the story where You the player is alone fighting to get through ennemies. Why not use a well crafted Stealth level where you have to solve \"who to kill first puzzles\" and have a model for the commander. (everything is already in game).\nYou have a goldmine of a game and it is skipped by the autoplay\n\n     The Gasha and upgrade system (because yes they are tied).\nHaving your skills being upgraded by droping multiple dooblons of the same character is predatory (gasha it self is) AND you need to drop both the character and the weapon at least 7 times each. And it's not just some dmg numbers tweaks, it is quite literrally the skills , some skills can be done two to three times more in the same turn just because you dropped the character multiple times. \nYou can add up the premium CN server premium (so only real money) gasha with a 200 bucks min pity that might come to the global serv as well and you have a really predatory system to enjoy a game you do not have any incentive to play.\n\n    The Dolls\nThe dolls are literrally gun personified. It has been recently anounced that one of them will be a japanese gun and they gave her something else. No matter what a CN company making a JP gun was bound to be controversial in some way. So the real question is why chosing her instead of any other one of the first Opus that isn't in the game. You got a lot of soviet, European and American gals that could have done it (any one of the AR team, or really recognisable weapons like P90, Famas , a WW2 tube.  Dolls that are already in game, looking at Lena and Reva of task force 404. Or Even brand new one with a sword or a SF one from the first Opus)\n\n\nIn Short, \nGo play the first one for now, dont throw any money at them for now , even if the skins are cool (you'll only see them in the dorms , not in battle since you'll autoplay)\nWait and see.\nThe Potential is Enormous, but it is fumbled 80% of the time",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "As much as i love this game, the recent update (Phase Crash) is the thing that make me quit this game. This game doesn't respect your money, doesn't respect your time, doesn't respect the community.\r\nThe Phase Crash take so much of your time, can't auto play and most importantly it's not even fun, it's feel like a chore that take 3 hour of your life weekly.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "The game models are amazing—probably the best graphics out of any other gacha, and I've tried them all. But the game itself is boring af. From the very beginning, you can just auto everything. Also, rates seem atrocious; you're only going to get blue weapons and a purple trying to pull for a character—a classic Genshin experience. Not worth it, honestly. It's not even a decent gooning game, and it really tries to be just that.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Good idea to have 2 different providers. Can't even transfer progress over here.\n\nThe other steam launcher is locked behind region.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I really like the story of Girls' Frontline in general and had a lot of fun with the first game, but Exilium didn't live up to its predecessor in any way. The gameplay got boring really fast, powercreep couldn't be more in your face if it tried, and the story is so boring I caught myself skipping most event cutscenes after watching the first few of each. I pushed myself to keep playing this game despite its flaws, but there's a limit to how far that will take me.\nI really want GFL2 to be better, I want to enjoy playing it, but until I receive news about changes that would make enjoying it possible, I'm dropping it.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Simply put, I just play this game for the beautiful 3D character models. Some character designs are great, but I can see they are becoming more and more generic down the line.\n\nI play it on auto, even though I'm a fan of XCOM. The daily routine is too long and I have to press the auto button every battle, why can't I set it on default?\n\nBoth the main story and side stories are so long-winded, at some point I just don't care anymore. Just uninspiring generic anime stuff. Now I know every gacha game has reviews online saying they have the best story they have ever come across, they are all either PR crap or written by a 10-year-old.\n\nI didn't play the first game but I read about the \"old character incident\" and thought it was more interesting than the game itself tbh. The developers actually thought it was a good idea to explain \"the dolls have their own life\" while it is at its core a waifu gacha game (I know they want it to be more than that, but let's be real). So dudes invested time and money on the dolls just to be their dad? The audacity lol. What were they thinking?\n\nIt's a shame coz I think the game has good quality on the surface, but it just doesn't have that engaging element to get me really \"playing\" it, other than collecting daily resources and buying skins occasionally. And soon they're gonna gacha the skins too smh. Ironically this time they are on point. They know my pattern: pay for the skins, gacha the dolls with free gems, auto the game to save time so I can play some other games instead.\n\nI want to treat this game more than an electronic bonsai, as the developers put it, but for me the content is just not interesting enough. Another XCOM game drops I'll surely play the heck out of it, but this game I just can't be bothered. If the developers can figure out why and bridge the gap, they can easily take my money. This game looks good but its future doesn't. It's so unplayable on different levels, I just don't understand it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Great characters, visuals and f2p friendly character gacha\n\nMid story and gameplay, event minigames are a mixed bag but mostly fun\n\nBad business practices like gacha premium skins, overall disconnect between the dev team and the playerbase",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Played this game ever since it came out ad I really [b] REALLY [/b] enjoy it and spent more money on it then I dare say [b] JUST [/b] to mainly support the game. [b] BUT [/b] if they think putting gatcha costumes into a game which already heavily runs on gambling for characters and their weapons/upgrades to make them stronger, it's basically just a slap in the face to those who actually [b] CARE [/b] about the game's future. I have no idea who tought [b] 200€ [/b]for a [b] single [/b] costume going to be a [i] good idea [/i] but it shows how much they just don't care about this whole thing.\n\nI want to reach out for every other commander who plays and loves the game to [b] HEAVILY [/b] reconsider if buying costumes in-game right now is such a good idea. CN community doing god's work to pressure them into giving in and so should we support them for their and for our own sake.\n\nI will keep an eye out of the situation with the gacha costume and edit my review and recommendation depending if they going to fix the mess they bough on themself.\n\n[h3][b] Edit: [/b][/h3]\nThe devs changed [i] some [/i] parts that was hated on that latest update but the expensive gatcha comstume going to stay.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "- Rushed events and banners\n- Skins costing 200USD?... Nahh\n- 1 character without copies power creeping the entire game characters.\nUh?\n\nAnd well, this could be more fun if it was a TPS game just like SAO Fatal bullet and openfield/world. (personal preference)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "You need to buy a wedding ring (with real money transaction) to powerup your dolls now, as the mod attachment updated to nerf our dolls to wear only purple attachment (2stat + 1 stat to be unlock ) + 1 gold attachment only.\n\nBefore that, the dolls were able to install few gold attachment (3stat ) .\n\nxdd game, i thought im playing turn based strategy game, but it more looks like to be a game to P2W now. since some of dolls with c6 , enable you to sweep the enemies using auto combat / just 1 shot easily .\n\ni rather play arknight instead of this goodluck.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "While I still enjoy the first game, Exilium simply isn’t to my liking. I’ve played more hours than I’d like to admit, but honestly, it’s not a good game in my opinion.\n\nI eagerly awaited Exilium’s release and played it for a while before realizing all its flaws.\n\nTo begin with, the story feels so weak. The main characters have little relevance, and the plot progresses far too slowly. People argue that the original also took time to develop, but two years after its release we already had Deep Dive and Singularity. Now, many story points lead nowhere, and it’s disappointing how the dark tone of the first game shifted to something forgettable.\n\nThe gameplay, while not perfect in the original either, feels even more repetitive and dull here. At least the first game experimented with different objectives and allowed decisions that led to alternate endings (Continuum Turbulence). Even the pvp is unbalanced, with the same doll teams in every match.\n\nAs for the gacha system, the original is far superior to this one. Resources were easy to obtain, and production results were actually rewarding. Exilium uses the Genshin gacha, where you must grind or pay for collapse pieces on each banner to get what you want and have greater efficiency. You won't get much by playing as f2p. You need to pull duplicates for skills, and even the oath now requires payment unlike the original, which allowed you to get it with gems, which the game frequently gave you but weren't necessary for natural progress either.\n\nFanservice isn’t inherently bad, but here it’s excessive. The constant focus on character attributes, exaggerated jiggle, and foot fetish make it feel annoying. The original also had fanservice skins, yes, but they were 2D skins, much lighter and more irrelevant. It’s annoying to see well developed and impactful characters like 416 or RO, characters who went through a conspiracy, terrorism, a machine rebellion, and had personality problems, now reduced to prostitute skins and jiggle.\n\nIf you’re interested in this game, just skip it and try the original instead. Given how the original story ended, I expected something far better from its sequel. If you still enjoy Exilium that’s fine, but it's definitely not a good sequel.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I'd love to give this game a positive review.\r\n\r\nBut a critical log in bug has occurred to me twice during my time playing, leaving me unable to log into the game for days to weeks. I've never experienced this with any other games, and I've played a lot of Steam gacha games. So the port seem to be terribly poorly maintained and seemingly easily become out of date compared to the server version and phone versions.\r\n\r\nApart from being unable to play, I'd rate the game positively with an interesting strategy gameplay which when short on time can often be automated. (But you have to be overleveled to clear it on auto).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't get past start screen bcs game crashes every time. Tried fixing it by following guides on steam and only wasted my time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "$200 for a skin???? with $30 on snowbreak you got a preatty skin + interactive scene, big no this time mica",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Optimization is so bad. Play on mobile or emulator is way smoother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a lottery on the PC, will it start (login) or not... click once on \"start\" and nothing, twice, nothing, 100 times and you get once \"loading server information\" and then nothing. With luck you will login and can play. This game is a phone title of the worst type.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "new player gacha and targeted got mosint nagant (lose 50%). uninstalled. XD",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's the typical mobile waifu game. Great for people who wants to stare at waifus most of the time.\nGameplay wise it's inferior to most turn based games on PC. X-COM, Jagged Alliance, etc all are far more mechanically refined. \n\nIn GFL2 here, the gameplay here is so mind boggling boring that most of the time it involves turning on auto battle and not playing the game, which begs the question why even have a turn based game in the first place. Missions that require some manual control is quite trivial even if I was 2-3 levels below the recommended.\n\nMost of the game modes thus far is tedious, some metal gear solid style of sneaking around is so jarring when the main mechanic of the game is a turn based grid tactics game.\n\nBriefly on monetization, it follows the, quite frankly, toxic gacha style that Hoyo does with ZZZ, etc, where pulling duplicates of a character allows it to unlock unique benefits to their skills, while also having another banner for their unique weapon. I find this disturbingly greedy in my opinion and while in theory adds to the gameplay, it requires some insane luck or real life money. \n\nBack when Halo CE came out where it revolutionizes the first person genre which made many following games adapt it's mechanics, I do not believe following Hoyo's way of handling duplicates does anything to help GFL2. Refer to Cygame's Princess Connect or Nexon's Blue Archive for a better system on handling duplicates.\n\nAll in all, it is a heavily flawed game that is outclassed by almost every other PC turn based grid tactics game. Quite frankly apart from looking at waifus do suggestive poses, I cannot recommend this game to anyone who wants a more compelling turn based game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it's advertised as an x-com like game with competent worldbuilding, storytelling with some fanservice on the side.\n\nin reality it's practically a p2w autobattler  attached to a lousy goonslop for \"pepole\" who think PEGI-16-at-best sexualisation for the price of -sometimes multiple- hentai game is the deal of the century",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't work at all on linux/Steamdeck.\n\nThe first run when it downloads resources will work fine, but after that, if you want it to work without crashing at the start, you'll need to make 3 or 4 tricks (some guy on Reddit gave the instructions, thanks lad) and even after that, it still doesn't work because the \"start\" button doesn't even work!\n\nI'm so glad I didn't had to pay for this...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Forced to play it in german altho I want to play it in english, when I finally can change language, I missed a great part of the story. Missions cost energy that refills over time - this system is outdated, sucks and was never good in any game... also, why the f**k is this game on steam if it requires you to use an account outside of steam like google or facebook. No thanks! Avoid this garbage at all cost.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is not the way forward, you shouldn't be genshin impact, wth is this anniversary event",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Easily the worst thing to happen to humanity since WW2.\nOptimization sucks so bad you might as well stick dynamite in an anthill and not cover your ears. They literally scammed their players and lost their trust within like an hour. The odds are so bad and so horrific even I covered my eyes. This is such a sad downfall from the original game I have no words. Just like other gacha game, Mica has become a money-hungry greedy company. Do not support these developers. Play the original game, and don't even waste your time on this disasterous, storyless, horrendous piece of audiovisual media that's even considered a \"game\".",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Opens some custom bs window with google logo and wants me to login into google. Devs, are you high ?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It did not give me the rate up character, horrible gacha. How am I supposed to enjoy the early game by losing the 50/50? Terrible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "please I beg of you, just one 416 skin that isn't just progressively showing more skin. redesign is shit, all the redesigns are shit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "man that update for the crew deck makes them look so greedy like damn, you are that desperate?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Was fun for the first month but after that it got boaring",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "If I had a dollar for every bad decision that the devs did, I would have 4 dollars. Which isn't much, sure, but it's enough for a cup of coffee from Starbucks. \n\nFrom the earlier launch and the Netorare controversy (mainly with the CN player base) \n\nto the newest decision with skin gacha with real money (and horrible pull rates!) for one of the most beloved characters. \n\nIt's bad decisions all around... I know money moves the world but you gotta control your greediness sometimes, this is just crazy and the latest gacha revenue info showing this was the worst performance since launch shows that no player base, not CN, not JP and not EN/Global liked that last decision, crazy stuff, I wouldn't recommend this game because it's blatantly clear that the devs puts greedy and money on top of user satisfaction...",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "force tutorial that suck. stamina that suck too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pros: one of the best gacha games in the turn-based strategy genre overall, cool style and design, pleasant graphics and voice acting, good optimization on both PC and mobile devices, dormitory with dolls.\n\nCons: gacha system with skins for premium currency, developers who don't engage in transparent dialogue with the player community, every update is similar to the previous one but with a new character, in one of the latest updates another character progression system was added with quite heavy grind.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game Experience : From lover to Unfaithful.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Won't even let me sign in to play without crashing my PC. how TF am I meant to enjoy this game when I can't even play it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ADD SANGVIS FERRI ADD DESTROYER ADD DREAMER ADD JUDGE",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "เกมgoon กากด้วย แต่เล่นอยู่ดี",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "snoozefest, why is the story so lousy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "china gets everything a year before anyone else",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}