{
  "positive": [
    {
      "review": "Stopped me from gambling in real life, but every time I lose I add a line to my tally. \n\nWhen my tally hits 20 I buy 5 scratch cards.\n\nI'm at 19.\n\nedit: i lost all my money buying scratch cards",
      "voted_up": true,
      "votes_helpful": 77
    },
    {
      "review": "Have you ever seen those videos of grandmas just pressing the slot machine buttons over and over in silence for hours at a time? Have you ever asked yourself, How could they do this for hours? Aren't they bored? Aren't they just tired? Well, this game will make you understand why. Buy it. Play it. Gamble. Alcohol. Your liver will thank you, your mind will be opened. You will reach maximum understanding.\r\n\r\n\r\n... For real though get it, it's really good lmao",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Fortune smiles rarely. Planning smiles back every run.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Was never interested in playing Fruit Machines in my life. This game is amazing, however.  \n\nI felt that I was becoming less and less interested in games because it was like I'd just done it all before. Never going to get that feeling of playing Oblivion for the first time again; GTA Story Mode won't have the same effect it used to have on us. These are experiences we've all had countless times, and furthermore, they have been endlessly copied and re-released, often on a yearly basis. Everyone is doing what is safe and not creative. It becomes incredibly stagnant.\n\nThen come along indie games. Originally stuff like Isaac, Nuclear Throne, Darkest Dungeon, etc. Then Hades happens, and roguelite/indie games get some mainstream spotlight. Everyone is trying to make a game like Hades, and even this space started to stagnate for a moment there.\n\nEnter 2025, the year that broke the mold (again). I've seen so many original ideas this year, maybe something that at a glance you think \"WTF even is that?\" but if you play it, it just makes sense. It takes all of the things that feel great about playing a roguelite but offers a completely new way of delivering it; it's like scooters to spaceships with the variety, too.\n\nSorry, this is less a review of this game specifically and more of a general praise to the indie/roguelite scene for the games on my radar recently, Clover Pit being a front runner for GOTY, personally.\n\nJust play it; if I start to describe the game, I'll just spoil some of it. Best you just experience it for yourself.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "A sinister roguelite where you have to make enough cash to survive every round via gambling on a slot machine. Randomized items and power-ups ensure that the experience is varied whenever you decide to allow yourself to be trapped inside a small room to just eventually get killed anyway. Great morbid atmosphere further amplified by the low tech graphics with a dose of dark humor. CloverPit further proves that in gaming, replayability is king and you never have to spend a lot of money to play the best of games.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Looks simple but still very creative and fun to play!  Many things to unlock as well!\n\nThis game surprised me :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is great it's like buckshot roulette but instead of a shotgun your playing with a slot machine and your opponent isn't a creepy face guy with razor sharp teeth it's your own bad luck, but one thing that is common is a game of life and death do you have what is takes to pay off your debt and see another day or fail and fall straight to your dark shallow grave.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Wake up - Gamble irl\nGet bored - Gamble in CloverPit\nJust absolute cinema.\n\nPs : Only losers quit gambling.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Developed by Panik Arcade and published by Future Friends Games, Clover Pit is a rogue-lite slot machine simulator released at the end of September 2025. \n\nDeceitfully simple, addictingly complex, this game is easy to start, but to learn combinations and mechanics hidden in plain sight takes some time and experimentation.  \n\nThe basic gameplay loop consists of gambling coins in the slot machine to deposit ever increasing amounts in the ATM. Also present in the small dark room with you is a table with trinkets that warp and twist mechanics, such as luck, payout, and even number of spins available, bought with tickets awarded every turn. \n\nSecrets and items can be unlocked by repeated playing sessions, which in turn push the basic mechanics of the game. \n\nAlthough some parts of the game seem purposefully unfair, the challenge of winning each round is incredibly appealing, and as a huge plus the rogue-lite elements, that provide the game a considerably huge replay value. As of the time of writing, there has been a DLC teased, possibly adding more secrets and mechanics to an already great game. For these reasons, I recommend this game. \n\nIf you enjoyed this review, I would like to invite you to visit [url=https://store.steampowered.com/curator/44722081/] [u]Backlog log[/u] [/url] my curator page for more recommendations and reviews.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A perfect game for gambling addicts out there without losing your life savings at the casino.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An enjoyable gambling game. It becomes a bit stale after finding an overpowered build, but there are still many tactics and starting buffs/debuffs to try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great horror aesthetic, great gameplay loop, also a great commentary on addiction. easily one of my favorite roguelikes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☑ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☑ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☑ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "LETS GO GAMBLING!!!\n\nNow after Balatro and this game, I am beginning to think I may have a problem with gambling games...\nAt least I'm not gambling with real money",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good and fun game. I really enjoy the horror elements and the retro look to the game overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There isn't much to say about this game's gameplay. You run a slot machine over and over again to pay off mysterious and increasing debts with the twist of having the ability to rig the slot machine in your favour (or not if you so choose :P). You have three goes at the slot machine per \"deadline\" to make up the money required to progress, otherwise...\r\n\r\nThis is an incredibly addicting game to play, I have managed to (as of now) 100% the game. The gameplay loop is very repetitive but it's still fun regardless trying out different setups and charms, seeing how many different ways you can succeed (or fail). Finding ways to deal with the charms you've been dealt to succeed is very fun and especially rewarding if you manage to pull it off. I'd always be trying to find ways to break the slot machines in new ways to see how much money I could accumulate throughout the run.\r\n\r\nThe graphics in this game are very reminiscent of Buckshot Roulette and I love it. It fits the vibe of the game and its gameplay perfectly in my opinion.\r\n\r\nYou start out with a base set of charms and more can be unlocked by just simply playing the game. Some charms require you to play in a different way than you may be comfortable to unlock them. However doing so adds a bit of variety to the gameplay loop which I'm always appreciative of and which is especially needed in gameplay as simple as this. \r\n\r\nUnlike most roguelike games, this one focuses a little more heavily on luck over similar (and also excellent) games like Balatro. The first two or three deadlines are effectively the make or break of your run, if you get a good initial charm setup, you're almost certain to win but if not you'll have to restart and hope for a better shop. While luck always tends to play some role in this genre, I feel like it can be a bit too heavy at times, especially with the new implemented hard mode (which I'll get to later). Along with this, while the first two deadlines are (sometimes) quite hard to pass, once you do it's a free run to the finish line. It would be nice for a little more challenge throughout the run since once you get the formula down for the game you can pretty much guarantee a win every time.\r\n\r\nOne of the major problems I've had with this game lies in the memory cards. These are effectively modifications to the run that you can make to change how you play. I really enjoy playing the memory cards. However, what I don't enjoy is that they're consumable. You effectively need to obtain them during runs and playing runs with them eats into their supply. This is quite frustrating when I was doing for the last achievement I needed in the game \"Lord of the Pit\" which in order to beat you need to complete a memory card in \"hard mode\" which doubles the deadline completion requirement. this is very heavily luck based.\r\n\r\nWhen I was playing, I could only pass the first deadline every 1 in 3 times and the second deadline every 1 in 5 which I wouldn't be too bothered about if it didn't eat into my limited supply of memory cards. I feel like memory cards should be obtained by a different method than what currently exists in game and they should not be consumable as they are now.\r\n\r\nOne last gripe I have with this game is that while I love the gameplay in this game but some of the choices made by the devs are a little questionable in my opinion. Most of the fun for some players in rougelikes and rougelites comes from the ability to break the game in exciting ways, infinite scaling, broken synergies, etc... While the devs have explicitly said that they haven't removed the ability to obtain \"endless runs\" they nerfed a lot of the charms in game and bumped up deadline requirements in the late game to make it harder to do so. I believe this was a wrong choice. The devs should be encouraging new ways to create endless runs to break the game by buffing some of the less helpful charms giving new and exciting ways to break the slot machine. \r\n\r\nA new update is around the corner, I'm excited to see what's in store with the newly announced DLC and I'll be sure to play it though :D\r\n\r\nOverall, despite a few of my gripes, I strongly recommend this game, it's incredibly fun to play and I really enjoyed my time playing it to achieve 100%. I'll be keeping an eye out for the future of this game and what else the developers have in store for us, for now though... Let's go Gambling!!\r\n\r\nScores:\r\nGameplay - 7/10\r\nStory - N/A\r\nGraphics - 9/10\r\nMusic and Audio - 8/10\r\nBugs, Glitches and Crashes - 10/10 (Higher is Better)\r\n\r\nOverall Rating - 8/10\r\n(NOTE: All scores are made with respect to the game's genre and theme).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You're trapped in a giant SAW style trap that will kill you unless you successfully gamble on slots\r\nit's a psychological horror disguised as a funny gambling game\r\n\r\nhighly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nothing will ever match the dopamine rush of getting 6 jackpots in a row. 10/10 love high stakes gambling.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very addicting, very fun but also very challenging and unforgiving",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game probably hates you. A lot. But it’s a dang good time.\n\nAlso feels surprisingly good to play on Steam Deck with the vibrations.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think I might have a problem, it's so addicting it must be what actual gambling addiction feels like but without the stakes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gambling addict ahh Game\nif you like gambling as i do and you don't have the money and courage for irl gamblin, THIS GAME IS FOR YOU",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Already loved the demo. The game is simple at first look but finding the right buffs for a good combo  can be hard at first. But if you want a dopamine rush from gambling then this is perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let`s go gambling oh dang it, oh dang it, oh dang it, oh dang it, oh dang it, oh dang it, oh dang it, oh",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is really fun, and it doesn't take much to completely break it with the items you can get. Unlocking more items isn't too bad, though some of the requirements can seem a bit daunting. Also, all the sounds and machine noises are fun, they really nailed that.\n\nI really don't like how the memory card system works though, the cards themselves being single use is awful. The challenges are neat, but only having a finite amount of chances to use them is frustrating.\n\nStill, for $10? You can do a lot worse.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is literally crack; just played for 6 hours straight. Don't get it if you have plans. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game of the year, and easily recommended to anyone with a severe and crippling gambling addiction. Had to sell the farm and livestock, but at least the family gets to watch me win HUGE. (albeit, under the comfort of our new overpass)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is like buckshot roulette but there's a slot machine and also whenever I lose I hit my balls with a steel beam. \r\n\r\n8.5/10, basing your builds on interest is broken as hell when done right and has a better success rate than anything else in the time I've played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game but trying to get 100% is literally just praying to rng gods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "CloverPit certainly nails being a slot machine nightmare, and to some extent it works as a satisfying rogue-lite as well.\n\nThe PSX-style graphics, atmosphere, and sound design are excellent, and they do a good job of drawing you in. There is some very light narrative and atmospheric storytelling, but I honestly hoped for something more developed.\n\nThe novelty of the gameplay loop and rogue-lite progression is exciting at first. It’s visually satisfying too, with all elements being physical objects in the game world. Getting a good spin on the slot machine, inspecting your trinkets, and watching the numbers go up feels tactile and fun.\n\nBut as you progress and figure out the optimal strategies for beating pure RNG, the cracks start to show. CloverPit lacks agency, and as the novelty fades, it lacks surprises.\nAfter seeing its ending at around 15 hours, I can’t help but feel there could have been more.\n\nI still had a good time with CloverPit, until I didn’t. And in that sense, it was a worthwhile experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really don’t like this game’s early game RNG at all. If you’re not lucky, there’s basically no way to meet the deadline in the beginning it’s way too dependent on pure RNG",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have you ever thought that slot machines were boring because there wasn't enough interaction, meaning your fun gambling experience was purely up to RNG. Thats not fun, because winning is fun. This game makes slots fun. With the variety of items and options, you can infinitely spin those slots! And of course you must remember, RISK IT FOR THE BISCUIT!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is great but i have 2 big issues with it which puts it behind Nubby and Balatro for me.\r\n\r\n2 Main issues:\r\n\r\nMemory Packs: Its straight stupid to gate different playthroughs behind charges. Every \"run modifier\" can very easily run out if you don't win the run, gating them off and forcing you to do a boring run just for a chance at another try. The whole point of the memory packs for other games like balatro is extra content with new rules for people who've gotten bored of the base game. So making those same people have to do pointless normal runs just to re-unlock them is cheap. Once I own those cards I should be able to do that kind of run whenever I want. I've completed the milestone and now you're making me do chores to re-visit the endgame. Even if it can later be unlocked to be permanent, i see no logical reason to gate them at all.\r\n\r\nLuck: Luck is defined very wierdly in this game, and since its the core stat of the game I think needs changing. Luck doesn't synergise well with many builds based on specific symbols. at around 5 luck it will give a more likely chance for the same symbol to show up, based on your odds of each symbol. This is perfect as is. If you accidentally gain more than that much luck, it starts to become a downgrade as it will do the same but for higher value symbols like 7's and diamonds, no matter their odds of actually appearing. Having this be a mixture between a really good proc and really bad proc for many builds leads to an unfun gamble of stats, where your build can be too good and give you too much luck making your jackpot hit for 500 because it was diamonds, and not 3 million because it was lemons (most common). I understand why its like this, as I guess its the most realistic way of doing a luck stat but if it makes most builds encounter this issue just change it.\r\n\r\nItems: i think they gave a good variety and there's definately enough in the game to make games unique, but they all revolve around 3-5 playstyles which is a shame, the main 2 being \"symbol proc\" and \"luck stacking\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just 100% the game, and i can now say for certain that [strike] i have a gambling problem [/strike]  CloverPit is a really enjoyable roguelite game with a cool, gritty atmosphere that maintains its Replayability throughout the course of it's game time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game but needs some serious glow ups. Standing there waiting for the floor to drop EVERY SINGLE TIME YOU FAIL? Annoying as hell. Having to watch your interest drop and tickets come out every time? Annoying as hell. Then your biggest problem is the rng which could give you something great round 1 or by round 3 you're struggling to get anything to help you move forward. It IS a fun game but definitely needs some basic improvements. \n\nAfter playing more i forgot to add the utter annoyance of having to go through a \"death\" for ten plus seconds and sit through all the nonsense even on a restart, with the restart death cutting out the ten seconds of nonsense and just dumps you down the hole, then you have to see what you had or didn't have even if you didn't spin. Making it basically NOT a restart.\n\nAfter playing even MORE, i am starting to get sick of just how easy it is to lose first round and having to see that BULLSHIT waiting to die thing EVERY SINGLE DAMN TIME! Who enjoys being forced to sit through a ten to fifteen second animation waiting for your character to die? Dev needs a solid boot in the ass.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": ">Gamble\r\n>win the jackpot\r\n>die\r\n>respawn \r\n>repeat the endless cycle\r\nLET’S GO GAMBLING!!!’\r\nPerfect game would gamble again and again 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One spin gives me hope, the next one destroys my whole bloodline.\r\nPerfect game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute KeyJingle-slop game, this game is disgustingly addictive and I don't feel good about playing it this much, which is pretty spot on.\n666/10 there is nothing to eat but mold",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was genuinely disappointed when the game didn't crash after hitting the E+308 display limit. I'm now sitting on E+335 a number that is physically impossible to comprehend. What's the point of spinning anymore when you're already earning billions of times the number of atoms in the visible universe with every spin?\nThis isn't a game. It's a journey into mathematical oblivion\n10/10, would break reality again!!!!\nps: The number of atoms in the universe E+83 is a joke when you consider that drawing a normal zero on a piece of paper DIN A4 ISO 216 with a pencil DIN ISO 9180 only requires about E+17 atoms. I'm not sure about the 12 g/mol on pencil , please correct me. The chemistry and physics technicians",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "barely 2 hours into this game and im absolutely ADDICTED. i find this even more pleasing than Balatro. first review ive written in a minute coz it's that good. if u love gambling games, give this a spin ;>",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First things first : GAMBLING!. Also, I definitely love the game design and mechanics, makes me think of Balatro.. The infinite possibilities and entity making fun of you when you loose... Yep, that's definitely for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "CloverPit: 8/10 Burgerz\r\n🍔🍔🍔🍔🍔🍔🍔🍔\r\n\r\nTL;DR: \r\nOne of if not the best Slots games on Steam\r\n\r\nGameplay:\r\nThe Hook/Loop is simple yet addicting enough to keep you coming back for more.\r\n\r\nGraphics & Style:\r\nThe PS1 Style visuals are in right now and this game looks and feels great\r\n\r\nSound & Music:\r\n\"Let's go Gambling\" The sound matches the vibes nicely.\r\n\r\nValue for Price:\r\nI think its a great value at full price and a steal when it's on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excessively fun and re-playable. Addictive in the best way. Perfect way to kill time.\n\nEDIT: WTF is this update??? 1.2 made unnecessary 'balancing' changes in a game that LITERALLY instructs you to break the slot machine... But apparently the dev thinks we broke it too much in our non-competitive single player game.\nAlso, what's the point in a gambling game without high highs and low lows? I don't understand how the dev's notes in the patch are them saying certain things were too broken, when again: they literally advise you to break it lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm going to making a video that goes over the recent changes. But to summarise most of the points in the video, WHAT IN GODS NAME DO YOU MEAN YOU MADE THE EARLY GAME (the hardest phase of the game) EVEN WORSE???? I wasn't bothered with all holographics as going for world record in endless was as fun as slamming my peanuts between a hammer and a nail so I didn't get Delusions of Grandeur in holographic....I wish I had. Is getting 400 coins at the start of the game fun when, on average, you get 60 to 120 coins in 21 spins WITH some of the better items? a cherry jackpot gives about 200, YOU NEED TWO, count em, TWO WHOLE JACKPOTS TO GET PAST ANTE 1....AND THEN THE GAME KEEPS GOING. I had been slaving away for hours to get a run, have a nice interest build going, get NO interest items AND they nerfed most of them. Get no good calls, flat out lose. All for nothing. Anyway, good game, really enjoy it : P",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fantastic. A simple, but extremely addicting game. You can get all the dopamine from a big slots win with none of the risk. With just a touch of story and \"your final reward\" just waiting to be claimed you can have endless fun searching for the best combo's and trying to break the machine.\r\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gambling addiction changed to gambling game addiction lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Promising start, but quickly loses depth\n\nThe game kicks off with a lot of excitement—it feels deep, and there's plenty to explore at first. But after a few quick playthroughs and once you understand what all the power-ups do, it starts to feel like rolling a die and hoping for even or odd. There's not much left to discover beyond that.\n\nGiven how fast it wears thin, I find the price a bit steep and wouldn't recommend buying it at full price. All in all, it's a fun little game if you're into gambling mechanics, but once you’ve figured out the trick, it gets old fast.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've been... In a loop... For ages... Currently on a run with a record of -e32... Make it stop It's only deadline 12",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good! Slot Machine rogue-like where most of the strategy comes from the finding and choosing \"lucky charms\" that synergize.\r\n\r\nThe gameplay itself is pretty basic, but what I really liked about it was the meta-game of trying to escape. That being said I couldn't bring myself to complete a lot of the grindier challenges and endings. Regardless I would recommend this game wholeheartedly for 10 hours of fun gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game needs to be banned bc its more addicting than real slots thank god and the lucky stars that u play wit fake credits instead of real money bc id be bankrupt bc its too addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it! First real game I played on Steam. It's quite difficult, haven't managed to get out from over 6 million debt. And I can't manage to consistently get jackpots if I dont' get lucky in the beginning. I've played for almost 100 hours and still not bored! I'm sure there's still a lot i haven't discovered yet and I don't want to look at other people's walkthroughs. \nMinor suggestion for improvement would be the kind of anticlimax of the screen after you went through the hole. And that it's clearly a dude. Women would have to hang over this toilet to pee. But this game is really all kinds of horror, really dirty and stressful. This comes pretty close to how I imagine hell would be if it existed. I found a small easter egg. If you have enough coins but you wait long enough to deposit them... well, you have to find out for yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't listen to the people complaining about the update, you can \"break the game\" easily enough and it's pretty fun. not as deep as i would hope but hoping future updates bring some more interesting mechanics or more complex machines. the ability to hold spaces would be a great one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thanks to this game every time I play slots in real life, I fear that 666 will show up on reels and that I lose all my money… which happens anyways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great roguelike. It is a little more obtuse than Balatro, but it essentially follows the same math logic. You need to stack multipliers, probability, and then an active that increases a passive multiplier. \r\n\r\nThe only downside to this game is that it does not like my 360hz screen, the textures kind of vibrate (unless that intentional). If you like Balatro, Dungeons & Degenerate Gamblers, and Bingle Bingle, then this is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro meets Inscryption and create a child together with gambling addiction. If u like these 2 type of games, this game is for u!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, addicting. Has that \"one more round\" feeling. Runs are very quick, ~15-20 mins or so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never liked slots, but I always liked tactical synergies and breaking games with multipliers. Good one, worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spin, I hit big, dopamine.\nI spin, I get nothing, I try again.\nI spin, lose everything, accept fate.\n\nSUPER fun game with great sound design and a fun gameplay loop that keeps me coming back for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm seeing a lot of people complain about the 1.2 update making the game worse, but I started playing on 1.2 and I've 100% it and had fun every step of the way. Now, I wasn't there for the previous version, but I still find lots of fun in the newest release!\n\nI do think a lot of the criticism is valid, however. The hard mode, in my opinion, is pretty fair and it's just a little trickier getting a run going. If anything, I'd like to see it scale a little more exponentially as opposed to a linear x2 multiplier. Perhaps starting off pretty average, but the deadlines get tighter as it goes on? Realistically, it only takes a good first round to secure a win in hard mode.\nAnd yes, Delusions of Grandeur hard mode x4 difficulty is insane. I managed to complete it through the most batshit string of events possibly conceived (I'm glad my friends were there to watch lmao).\n\nA lot of items need buffs and their uses to be less niche. The game needs to be more endless-friendly (as there are like 4 items throughout the entire pool of items that actually provide exponential scaling, as endless demands).\nDev seems to be a douche, insisting on the use of skill in a game revolving mostly if not ENTIRELY on luck. I 100% the game on this \"hard update\" and it's really not all that impressive. I just got lucky, and that's the point of a lottery game.\n\nEssentially, the game is fun but may piss certain people off. If you get frustrated with monotony or chances, pass on this one. If you're just looking for shits n giggles, go nuts!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is where all gamblers go when they die, so you (a gambler) can have a sneak peek of the afterlife:\n\nPlay on the slot machine to earn money for a series of ever increasing deadlines. If you lose, you fall into the pit of despair you have ultimately dug yourself in.\n\nBut, various lucky charms (lucky cats in different disguises) are available to you which, if you have a good setup, can lead you to becoming the house that always wins.\n\nIt will take one good, long gaming session to learn the game and reach the ending, plus one or two more to acquire most achievements and the alt ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All the addiction of gambling with none of the real world cost. \n(Apart for HOURS of your life)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and enjoyable for gamblers to ease off on spending money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This won't cure your gambling addiction, but good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not perfectly balanced but pretty fun, decent variety of builds and plenty replayable for at least a dozen hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Balatro but the devil wants your soul, you can play slots, and you can piss. (theres more to it than that but thats the basic rundown)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"haha funny gambling simulator, numbers go-\"\r\n\r\nNo, it's actually fully addictive.\r\nDev is probably certified in psychology.\r\n\r\n100% the game, all holo cards, all achievements. \r\n\r\nWhy?\r\n\r\nI just wanna see that text in my brain... \r\n\r\n\"YOU ARE FREE!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like Balatro, but slots and you can keep body parts in drawers to make your life harder. \n\nIf you enjoy roguelike/roguelites, seek a bit of gambling, like min-maxing off of RNG options, and pulling a lever, Kronk; I would recommend playing the demo and inevitably buying this game. Highly recommend, fun game to spend some spare time playing when you can't figure out another game to play or just don't have the energy for something else but want to occupy your time with something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game to sit on the couch and pass to your partner run by run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun but loses it's charm quick. I wish there was a \"mixed\" option on steam for games like this. The art & style is amazing, and the concept is super unique. The game itself is built well with no major flaws and for the price, it isn't bad \n\nThe real issues arrive after 5-10 hours (after unlocking all 4 drawers), with the main one being the memory cards. Currently the memory cards are way too hard to get, and way too easy to lose. It's insanely easy to lose a run within the first deadline. Also, this might just be me however I find the amount of \"builds\" in the game really limiting.\n\nOverall, CloverPit is a fun rougelite but doesn't have the \"addictiveness\" or the replay value as most other rougelites. I'd recommend picking up this game when it's on sale, and if the developers fix some of these major gameplay flaws, I would recommend it at full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Positive overall. Fun overall. It's worth $10 and an evening or two, but...\r\nIt doesn't have the staying power of, say, Balatro for me. It doesn't feel like it quite has an \"ending\" ending based on the research I've done, so I don't feel a lot of incentive to keep going, and it's a small silly thing but the \"death\" animation at the end of a failed run takes too long. It's atmospheric and fine the first couple of times, but when you're dozens of runs in it's unbelievably annoying that you can't skip it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good, pretty fun, a LOT of different charms (jokers), with different active / passive possible combinations, not to mention memory pack cards and phone calls. Ignore pople crying about how hard the game is - it's not that hard to beat, around 31% of people \"finished it\" (those who got the door key and went outside). After that, I consider it \"hard mode\", like Balatro's upper stakes. And... yes, it's mostly luck-based. It's a slot machine game, what did you expect? You can still control a lot of the circumstances with charms and making decisions but, just like in Balatro - or many other games - it'll boil down to luck plenty of times, that's natural.\r\n\r\nThe % chances of symbols to spawn do look quite weird, tho... I mean, honestly, 50% to spawn a particular symbol and not having even 1 pattern with it many times in a row - in more than a few rounds - is quite suspicious, seriously. I think those odds should be a bit more transparent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An original, expansive, & addictive strategy gambler.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On the surface the game is Balatro with slot-machines. But Balatro is a game about getting more and more points and this one is not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game but very luck based (no really its a slot machine)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is addictive AND friendly for the wallet\r\nIt's shiny like a gambling problem, which you may of may not developp due to this game.\r\n\r\nJokes aside, this has some replayability and challenge despite its simplistic gameplay and I found myself coming back to this game, wanting to achieve higher stages through charm synergy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game breaking bug that lost me all my progress in the game, do not buy until they fix because I played through most of the game and got this game breaking bug.\nUpdate- I went into the files and was able to find a backup of my data and restore it. BE WARNED, do not reopen the game too many times or the backup will be lost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BOOK BOOK BOOK !!!\nalright game, start of a new run is always a little of a coinflip, but runs arent too long and theres lots to unlock, overcome and do in this little 2 by 3m cell with nothing but a hog to crank and coin to earn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and addictive. For a game with the very simple mechanic of spinning a slots machine it is really impressive how much depth the game actually has with the addition of upgrades and tons of other features. You are still going to get bored if you play it for hours at a time but there is only so much they can do to make spinning a slots machine fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the fact that it is hard to play because it is a gambling sim. I also like like the fact it is playable on steam deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let's go gambling!\r\n\r\nCame here with a dollar and a dream.\r\nLeft with two broken legs and a (half-used) fruit basket.\r\n\r\n9/10 would bet again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice game. Good gamplay and amazing athmosphere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 \r\n\r\nReally fun and engaging game of \"chance\" that really has no chance involved lol. It's a great game to get a dopamine rush and to pass the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun addicting game. Pick it up, put it down, go for a round and hone your strategies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from how addictive this game is, it really shines in the roguelike/roguelite genre. It's crazy that it's being developed by only two people. I can't believe people have balls to say the product isn't finished at all. Stop hating on little things like it being a AAA game, lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun and addictive. Satiates my gambling addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to pick up, hard to master.\r\nFun, addicting, crippling...\r\nLET'S GO GAMBLING!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 100%ing the game on 1.2 pre nerf hard mode i can declaratively say; Let's Go",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun stuff, notunecessairly overly complicated and scratches the gambling itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "JACKPOT JACKPOT BABY YEAH YEAH!!!!! oh. 666. fml\n\na really good addiction simulator and a fun waste of time, runs great on steam deck especially as a pick-up-and-play game which is why I'm reviewing/nominating it for best on steam deck :) WOOOO GIMME THEM LUCKY NUMBER 7s!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wonderful little game. I used to enjoy going outside and hanging out with my friends when not working. Now i play virtual gambling in the darkness of my room. Keep it up team, I will be playing your game for a long, long, long time. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most fun games of it's kind I've played. I had a blast seeing what each trinket did and how they work together, for hours on end. Top shelf game, and for a good price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly addictive!\r\n\r\nI'd definitely compare it to the same kind of excitement I also had for Balatro, albeit with an atmosphere that is much more focus on making you feel pressured and/or claustrophobic (Which is clearly the intended mood the developers was going for, anyway.) If you're looking for more games like that, I suggest giving this a go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly fun gameplay loop. Hoping for an expansion to this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me a big gambler, i like all the flashing pixels om my screen and when it flashes yellow i almost pe my self every time, but a good soft game ether way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Casino rogue-likes are the ultimate solution to losing real money, while still getting the gambling chemicals firing in your brain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was actually quite surprised how fun this is. Easy game to just wile away some time on, there's actually some strategy to it too which was unexpected. Worth a go for the money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very similar to balatro. Maybe not as difficult. Still a good way to spend time proactively thinking about strategies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "balatro and buckshot roulette had a kid and gave it an ipad for its first 9 years of life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Find a great build, use it once, lose next 20 attempts in a row.\r\nGreat game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally Buckshot Roullete but Gambling. To put it simply, the game is great. Buy it (or wait until it's on sale).",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "EDIT 2: The devs have made a post about how they're listening to feedback and such, so there's hope yet, but until we see the actual changes, it's hard to say whether it's 'safe' to buy the game, so to speak. It'll depend on what we actually see. Especially since they announced a DLC only a few days later, which just reads badly even when giving the complete benefit of the doubt and saying this was something already planned and they made the decision not to delay the announcement despite what's been going on surrounding the 1.2 update. The fact that there's a DLC being announced before the game has even been out for two months doesn't bode well to begin with, too, so a lot of players are assuming the worst.\n\nTo be COMPLETELY fair, it's not clear whether the DLC is paid or not as of yet, as far as I've seen. If it [i]is[/i] free, though, it probably would've been wisest to say that upfront, or better yet, not make it a 'dlc' at all and instead a free update. It does seem like a lot of players have forgotten that devs (as a whole, not just in the case of CloverPit) aren't really obligated to provide ANY new content for free. It's become common practice, it seems, but when it comes to a game that's released complete, there's no good reason to demand devs add more things. If a game wants to sell DLC, that's perfectly fine. But there's definitely a consideration to be made for timing, as well as the general attitude towards DLC these days. It's just another thing that's not really helping the playerbase's agitation, unfortunately.\n\nIn any case, my hope is that the devs truly have learned something in all of this and are able to sift through the vitriol and such to understand what's gone wrong, here. For all the game's flaws, it's a fun time, and I'll be happy to recommend it if things improve, but until I actually see it, I just can't recommend the game. Unfortunately, the gaming sphere has seen far, far too many broken promises to really take any dev at their word.\n\n[ Prev Reviews ] (Going to cut down and summarize my previous posts bc with the edits, it's gotten too long to be practical)\nCloverPit is probably still worth the money, especially on sale, but the 1.2 update was an utter fiasco that has left a large portion of the playerbase varying levels of upset and angry with the devs. The changes made in the 1.2 update are generally hostile towards players, including item changes that are near universally nerfs with only a few very minor buffs and one item rework that I’ve found makes the item unusable rather than better. The update also changed the parameters of an achievement by making hard mode required for it, which, due to the game’s very low skill ceiling and lacking opportunities for skill expression, makes getting said achievement an exercise in patience at best, and at worst, an utterly miserable grind that’s far more luck-based than before, as well as functionally tossing out significant chunks of progress myself and others made towards said achievement prior to 1.2.\nThe 1.2 update has only been received more poorly as word has spread about why some of the changes were implemented, as well as one particular Instagram post that comes across very, [i]very[/i] poorly, found here: https://www.instagram.com/reel/DRAPaLakwpW \n(In case it gets deleted in the future or is inaccessible for some other reason, it’s a short video with the captions of “how it feels knowing i just made my game twice as hard for y’all [smiling face with hearts emoji, ribbon emoji, twinkle emoji]” and “double deadline amounts good luck teehee [smiling face with hearts emoji x4]” with pictures of smiling/smug cats flipping over gameplay footage.\nEven when giving as much benefit of the doubt as I can, that this is a dev seeing the backlash and believing it’s simply people who are upset the game isn’t “””easy””” anymore or thinking it’s just a very few noisy people and the majority are content with the update, this is an extremely immature thing to put up. It’s no surprise, however, that most of those who saw it took it for what it most clearly appears to be, antagonism towards the players who are upset with an update that makes the game less fun to play. And even giving said benefit of the doubt, this is still functionally telling players to just ‘git gud’ at a game that, as I said before, has an extremely low skill ceiling and simply doesn’t have much to actually improve upon in terms of player skill.",
      "voted_up": false,
      "votes_helpful": 518
    },
    {
      "review": "Dev makes single player huge success roguelike, sees people having fun, decides to nerf ways to go endless as of patch 1.2\nActually giga cringe, do better and listen to the community. We want an easier way to get memory cards or just have an option to use them infinitely, for example when they go rainbow. We also would like some other qol like banning items, etc, just check the comments on every update, steam discussions, there are so many ways to improve the game and you decide to just straight up be controlling. Now you are forced to not play the game and skip to get some mem cards, and infinite runs got gutted. Who are you to police how and for how long we should or should not play your game.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": ">players play game\r\n>have fun\r\n>dev sees players having fun\r\n>nerfs game to remove fun\r\n\r\nwhat is this strategy called?",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "its a great game but the flashing just stops me from being able to play it with my chronic migraines. If they add a way to toggle flashing lights then i would be playing this so much more",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "DO NOT BUY THIS GAME EXPECTING TO 100% IT\n\nEarly on, while getting unlocks and getting memory cards, this game is actually pretty good. It was a fun and simple rougelite that was hard, and took a bit to get the train rolling to understand and get better at this game. And that's what makes some of the best rougelites out there, simple to play but difficult to master, with lots of fun unlocks helping greatly.\n\nBut these devs want to cater to about 5 or 6 youtubers than are known for breaking games and making infinite money. As such, they are nerfing every other item to the ground. For a single player game, this is absurd, but normally these patches didn't dramatically affect games, you could still master this. This only affected maybe 5% of people playing to the extremes.\n\nUntil their recent 1.2 patch. The only challenge left for me was memory cards, which each one had a unique and fresh experience making players rethink entire strategies. Now, with the change to rainbow cards, say goodbye to that achievement. Expect to reset a run 10+ times just to get lucky enough for the FIRST deadline. Because resetting a game for RNG is what makes a game fun.\n\nThank you Panik Arcade for catering to a couple Youtube slop videos, which by the way is what made your game popular in the first place. As a congratulations for selling 1 MILLION copies, ruin the experience for everyone else.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I genuinely loved CloverPit up until the 1.2 update. I’ve put a good amount of time into the game and was steadily working toward 100% completion. I was totally happy to keep grinding, until this patch essentially punished anyone who hadn’t already finished the hardest achievements.\n\nThe biggest issue is the new requirement for upgrading memory cards to holographic. Previously, you unlocked holographic versions by winning with that card three times. Now you must beat that card in the newly-added Hard Mode, where your debt is doubled. This change sounds fine in theory, but in practice it makes several memory cards borderline impossible to clear. Some cards already alter the game so heavily that just winning once is difficult, doubling the debt on those cards turns them into instant “throwaways.” And unfortunately, you need every card holographic to unlock a certain achievment.\n\nPlayers who already earned the achievement before 1.2? They’re done. Players like me, who were one card away? We’re now facing challenges that are mathematically close to unwinnable. The last card I needed was Delusions of Granduer, which doubles your debt. I was one win away from turning it holographic. Now, to make it holographic, I have to beat that card with the debt doubled again. You can’t even get out of the first round on Hard Mode with some of these setups.\n\nOn top of that, the charm “rebalancing” is almost entirely a series of nerfs. The patch describes these changes as making things “fairer,” but the reality is that these nerfs further cripple certain strategies. Combined with the new Hard Mode requirement, the update effectively raises the difficulty floor while removing many of the tools players used to manage that difficulty.\n\nThis patch didn’t just make the game harder, it retroactively made achievements harder. That means players who didn’t get lucky before the update are now permanently behind. Instead of rewarding long-term play, this update undercuts it.\n\nI loved the game. I still think it has great ideas. But right now it feels like the developers are punishing their most dedicated players.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I love the idea and it has a lot of potential but I really dislike the way it's been handled.\n\nUpdate 1.2 sucked out a lot of the fun from this game, the game is already full of charms that are essentially useless and now a bunch of the ones that *were* useful are nerfed to the ground instead of buffing the crappy ones. \n\nHard mode is a lazy 2x multiplier to debt which makes deadline 1 even more luck dependent.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "after the latest update i can no longer recommend this game as they nerffed a lot of things and removed endless mode in a game that was all ready kinda tedious to even get a good run. instead of improving the game and adding QoL or actual content they are more focused on taking the fun out of the game, i will probably be uninstalling it as i wasnt having much fun before the update and now i just see no point in playing as the developers are ruining it further.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "With the update, endless runs were patched out, and the high deadlines get harder even faster than they already did. The worst part is that you now only get holographic cards in Hard mode. Before, three normal runs were enough. With the Golden Calf card you already start with double the normal debt, and now in Hard mode you suddenly have four times the debt. You’d basically need two jackpots in each of the first three rounds just to survive – completely impossible. Really bad patch…",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Dev encourages players to find synergies between items to tip the scales of luck in their favor. When streamers find synergies that let them bend the game over their knee, (which is really fun and what they were told to do,) the dev proceeds to nerf every powerful item without stating any other reason than over powered sorry as to why. This game went from feeling like a difficult but fun gambling game to something that felt like you were actively being crippled in every run if you were able to get past deadline one.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A single player roguelike shouldn't be getting nerf bats swung at popular strategies like it's in an online multiplayer game. If you want build diversity, buff the other lucky charms to make them more viable, not nerf into non-usability the lucky charms you view as \"broken.\" The fun of rogue-likes like this for a lot of people is to break the score cap as much as possible and see how ridiculous of an endless run you can get, and this most recent patch has gutted the games ability to provide that. I won't be playing this game again unless I see indications that the ideology behind these nerfs has been given up, and the game is fun again. Not to mention how annoying it is to get specific memory cards and win with them, but now to foil them for the achievement, you have to beat the new hard mode with those memory cards, no option for the previous option of winning 3 runs with those memory cards.\n\nTL;DR - New patch = no fun, please reconsider your ideas behind why nerfing those charms seemed like the right path forward for this game.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "After giving a good faith try on this patch, I am having a really hard time understanding how any of this makes the game better or is pro-engagement. Forcing you to beat Hardmode on every card rather than having a choice, screws everyone that didn't grind the game before. It should be a choice.\r\n\r\nNerfing the endgame to stop you from going infinite makes 0 sense, there is no correlation between endgame content and having an infinite run.\r\n\r\nSPOILERS: Literally using Holy Phone usually nerfs your run from taking advantage of red phone calls and forcing 7's to 84% and having their base value in the e's.\r\n\r\nSeems like the devs don't have an understanding of what is actually powerful vs what they nerfed. Nerfing cigarettes because you can use it to restock a bunch of times seemed like it's main purpose, it restocks your shop - 1 slot, upgrading things by base value past deadline 3 is not viable and a waste of time honestly, you should be atleast multiplying it or working on something else.\r\n\r\nBTW I am an all achievements room 11 player currently. I love the shit out of this game, but this patch is so bad except for hourglass and bell rework those can stay.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "EDIT: Already deciding to do DLC, I see? This is getting more ridiculous than ever after you screwed up the V1.2 Update; there's still time to revert changes from it.\nIf the DLC is going to be paid, then I might as well never touch this game again.\n----------\nI've had a lot of fun with this game during its release, but holy crap. This is just plain dirty...\n\nV1.2 is what I describe to be one of most anti-fun updates ever to be conceived. The point of this game as a whole is to keep on \"breaking\" the slot machine, but now with this update, which nerfed a lot of the useful Lucky Charms, completely made it harder for you to even get good runs and to keep on going endlessly.\n\nI have one question to ask: What was the general idea of wanting to make endless runs harder in a solo rogue-lite game where all you do is spin a slot machine and get the best run overall? \nTo me at least, this just feels like a slap in the face to us players who spent hours on this game. You developers appreciated the support you got from us, yet you gave us a plate full of turd, and we have the reasons to criticize this update. If this keeps on going, your community will turn away from what made you popular in the first place.\n\nFor right now, I wouldn't even recommend nor picking up this game, because if this is the type of treatment that we are getting from the developers, then that's their loss, not ours.\nIf the devs do somewhat stumble upon this review, it is not too late to revert the update.\n\nUntil a new patch releases that reverses these changes, I'm keeping this as a negative review.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The devs have made the choice to nerf items in a SINGLE PLAYER GAME. They no longer allow high tier/infinite runs because why? Who knows. They managed to kill the only end game goal and essentially ruin the replayability of the game. It was a great game, it is now......uninstalled.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I got instantly hooked on this game when a friend introduced it to me, to the point it's the first game I ever tried to 100% purely out of enjoyment. However, the recent update has lead to nothing but disappointment.\n\nCloverPot's new item description is confusing. There are also typos in the description of some items. A very sloppy update from my perspective. The recent nerfs took out a lot of things without enough buffs or changes to supplement for what was lost. Endless run strats may feel cheap, but those were only viable because building with other items that are very underwhelming is not enjoyable either. Besides, these endless runs are optional -- if the player finds it cheap or not fun to play, they don't HAVE to try these strategies.\n\nAlso ever since 1.2 dropped, I have noticed the CPU usage of CloverPit randomly jumps between 3% - 20% on my device. After having the game open for a while, the game is completely laggy and I go from 120 frames per second to 30 frames per chance.\n\nInstead of nerfing/buffing items, perhaps consider adding Quality of Life changes to the game. There are several things that I feel require more attention than knocking out endless run strats which aren't even required to beat the game. I propose the following QoL:\n- hotswapping items in drawers,\n- automatic unpacking of memory cards,\n- auto-decline deals,\n- accessibility settings to reduce the amount of flashy animations in the game (the game becomes an eyesore at one point just because it blinds you...)\n- additional speed settings or animation skip settings.\n\nAgain, truly enjoy the game prior to the update. It's just sadly unplayable for me; not even because of the nerfs, but because of optimization issues and lag. Needing to restart my game every few other run due to the FPS drop is exhausting.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game needs a \"toggler\" feature like megabonk. There's waaay more trash items here. It was fun at the start, actually winning 3 straight games back to back (unlocking the key). But after you unlock enough items, the item pool gets diluted with garbage effects and it starts to feel bad. \n\nToo many runs die with no fault of your own. At least balatro feels it's possible to beat all seeds to be beatable until purple stakes and up. It's amazing to think about how balanced balatro's joker cards with the sheer amount of cards there and it doesn't need to have a toggler to do it.\n\n--update for steam awards",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "devs already asking for paid dlc on a unfinished game that really lacks depth ...",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "- Sells 1 million copies of CloverPit\n- Not enough money\n- Sells out to xbox game pass\n- Not enough money\n- Adds paid dlc despite the early access state of the game\n\nDon't bother with this game, the dev has ruined it with multiple updates since release and is just chasing the bag.\nNo amount of money is ever enough for these people.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "from the steam page: \"...Bend the rules, break the game,...\". then some people did break it, but the devs didn't like. so they made the game \"harder\" for everyone and some achievements almost impossible while pretty much flipping the bird to the playerbase with a post on instagram...\nthen, not even 2 months after release they announce a dlc, after updating the game to a miserable, unfun state",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Throwing in a negative for the abysmal trash heap that is the 1.2 update - \n\nA \"hard\" mode that just double deadlines and is MANDATORY to get polychrome memory cards instead of being an optional choice alongside clearing a memory card 3 times to get a polychrome (why not make hard mode give another reward instead?)\n\nNot a single worthwhile QoL improvement \n\nNerfed charms to prevent endless runs... for a singleplayer game with no leaderboards or any ranked system... instead of just looking to buff most of the game's charms that are dog**** in the first place to make them viable and create more late-game/endless build possibilities\n\nUntil the devs actually revert some of their choices in this update and/or make decent improvements for the next update, I cannot recommend this game for its replayability or going for its completion",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "After update this game went down the shitter. Even with normal memory card selected and normal difficulty the RNG in after the update seems fucking terrible. Spent 3 hours spinning and working previous builds and cannot even make it past the 2222 coin deadline. Do not recommend this anymore especially since before the big update this game was a blast.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The core of the game is fantastic. Balatro-lite with a really creepy aesthetic, enough depth to keep it going for a while.\r\n\r\nI can't in good faith recommend this game with the 1.2 update however. Some of the nerfs were warranted, but more than anything other items need buffs instead. On top of that, there was no reason to kill the infinite run loop - it's not like the game has any rewards for going into the exponential values, it was just a fun gimmick to do once or twice. Very bizarre to apply such heavy-handed nerfs just to kill a single goofy but unrewarding loop.\r\n\r\nThe Hard Mode change/requirement is abysmal as well for completionists, leaving the first two deadlines entirely up to RNG - scoring 180+ coins in the first deadline has always been a tall order, and now it's required for every single mode if you want to 100% the game. Insane decision.\r\n\r\nVery good game and core premise, but this update destroyed so much of its replayability.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "After almost two months, the game got a big update making some of the achievements basically impossible without an unreasonable amount of grinding for tens of hours just to try and get them. In its current state, the game is no fun anymore.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Until the hard mode patch gets reverted, don't buy this game, they managed to steal my money, don't let them steal yours.\n\nEdit: Word is they are working on a hotfix. Until I see proper tangible fixes here, I'm not about to change this review. 1.2 shows they haven't thought their changes through, and whatever this hotfix is might follow that pattern. If you have bought this game and can't refund, check the discussions, one of them will tell you how to revert these changes for your copy, for better or worse, up to you though.\n\nOH BOY, DLC INSTEAD OF FIXING THEIR MISTAKES. FUCK 'EM, NEVER BUY THIS GAME.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Game was fun until devs nerfed everything in a patch.  Now you can't win, and the game I bought and enjoyed no longer exists.  Buyer beware.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would have recommended this if you liked games like Balatro where seeing the big number go up and manipulating RNG through careful inventory management, but as of the most recent update the developers seem oddly hell-bent on PREVENTING endless runs for no reason, even though they are incredibly hard to actually pull off and can lead to a lot of failures.\n\nIt is weird in general for a developer to nerf elements of a single player game THIS hard? Just look up the patch 1.2 notes and see for yourself if you care about the fine details, but basically they made the game harder, they nerfed the ability to do endless runs, and they rebalanced a lot of things for the worse.\n\nThe game itself is a good metaphor for the shallow and vapid nature of gambling wins. You play as an unspecified damned soul in a hell-like cage where after a while, even a Jackpot means nothing as it isn't enough, it's never enough. Ultimately the way to \"win\" and escape is by rejecting the call of gaming more and more away and to just let go.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "You asked for \"even harder challenges\"  Devs to dumb to think of new content so \"We made whats already there even harder\"\nDevs are so crappy that they dont know the difference between \"harder challenges\" and making \"current challenges harder\"\nSell 1M copies then brick the game so you lose your player base and no longer have to support it. CASH OUT RUG PULL.\nDo not buy this game.\nWas a fun game until the latest update and they just screwed everyone over if you had not finished rainbow foiling all your cards. I had the hardest one left (already 2X) now to do it on hard mode its 4X. trash update.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After spending over 100 hours with Cloverpit, I really wanted to like it. The concept, visuals, and overall theme are fantastic. But once you dig into the gameplay, the cracks start to show and the recent update only made things worse.\r\n\r\nCharm variety is extremely limited. Out of 125 charms, maybe a couple dozen were ever worth using before the update. Now, after a wave of over-nerfs, only a handful feel viable at all. Runs already tended to play out the same way before. Now they’re even more samey. You’ll almost always end up going clovers or bells because they’re far and away the strongest options. Lemons and cherries can work, but anything built around diamonds, treasures, or sevens is basically doomed from the start. Their associated charms just don’t scale or synergize well enough to compete.\r\n\r\nThe new “hard mode” sounded promising, but it completely misses the mark. Doubling the coin requirements across all deadlines doesn’t make the game more challenging in a fun or strategic way. It just makes the early game miserable and heavily luck-dependent. What used to be about making smart early choices to build momentum is now just praying your first shop doesn’t screw you.\r\n\r\nA smarter approach would’ve been to scale difficulty gradually. For example, keeping the first deadline the same, then ramping up by +10%, +20%, and so on rather than a flat 2x multiplier from the start. As it stands, “hard mode” feels less like a skill test and more like “luck mode.”\r\n\r\nThere’s a great foundation here, but the lack of charm variety, repetitive run structure, and misguided balance changes make Cloverpit tough to recommend in its current state.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Generally enjoyed the game until the recent update. I'd love to provide feedback on the changes, however the game (which was working fine for 30+ hours) now crashes on the first phone call. Hard to recommend a game that I can no longer play.\n\nEdit: Still broken, still can't play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Normally I'd rate this game as positive, but it suffers from lack of QoL, it can easily get too tedious to sort/play it efficiently, from convoluted mechanics to just straight up questionable ones.\n\nIn the latest update the Devs decided that it's more important to nerf the possibility of endless runs and outright nerf plenty of stuff that have the potential of infinite scaling, rather than address unfun and otherwise useless/obsolete methods of scaling.\n\nAnd the thing that bug me the most is the drawers, they are so great allowing you to save and hold onto items, whenever you need them, hot swap between items to maximize their usage.\n\nBut god, they are so unintuitive, having too constantly open the drawer to see which item you have there, unless you are actively remembering where you put and store each item. \n\nA great change would be that you just have to hover your mouse over the drawer and it would display the item, and ohh god the memory packs... Why do they have to work this way? \n\nIt's not hard to farm them, I have farmed more than I ever will need playing this game, but it's still a point of frustration for alot of these players, and the DEVS know that, so they simply chose to nerf what is fun for players and not address anything else.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Over the few runs I did, no matter how good my \"build\" was, I never really felt like I had an influence in the game like other roguelikes. I just pull a lever and watch everything else happen, hoping enough stars will align so I can get to the next quota. I dunno, maybe that's the whole point, but it doesn't really make for good gameplay in my eyes.\nI'm sure others enjoy it, but I didn't.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Love the vibes, love the art direction and sound/music... but that's about it. While there is A LITTLE strategy involved, there's just a bit too much watching RNG do all the work for me to consider it a game or fun. Add to this DLC already being announced (unless it's free???)  and the dev(s) having a bit of a \"contentious\" relationship with dissenting fans, that's gonna have to be a \"no\" from me, dawg.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "its alright, probably worth buying it on sale rather than full price and theres not much to the game. i feel as many of the \"lucky charms\" dont really do much to the game play (not all the lucky charms are like this), ive only played on 1.2 but from what i have seen this was intended and make the game more unenjoyable. the devs hostile comments towards their community along with them already getting ready to pump out dlc content for a game thats not even a month old puts a VERY bad taste in my mouth and will be actively staying away from Panik Arcade from now on until they change their tune, which i hope they do!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Until patch 1.2v, it was an AWESOME game. \n\nNow it's just frustrating. \nInstead of having an awesome run like every 5 games, you now have it every 100 games. \n\nSeriously, including Hard-Mode (Doubling Deadline cost), FORCING it on the memory Cards to get Rainbow, removing Endless Runs AND nerf an entire mechanic without buffing anything usefull to give playable alternatives. \n\nSeriously, the first Deadline was aways the critical one since it's the one deciding if the run even starts. And now, instead of just needing 45 coins, you need effing 150 coins . . . for the FIRST DEADLINE! With ONLY 2 CLOVERTICKETS! Especially if the Shop doesn't offer useful or purchasable charms, since they're expensive or VERY situational.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sometimes devs sit down and think: He have this nice lil singleplayer game here that people enjoy. How about... not? And then nerf the shit out of it",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "GOLD GOLD GOLD\n\nWhat it felt like a really innovative and exciting (to some degree) take on the rogue-lite genre turned out to be a completely limited gameplay wise game. \nThe variety which is inherent to this type of games is gone after an hour or two of gameplay. After that, you left with only one slot machine inside this narrow room. \nIf only there were some progression that unlocks new slots or at least new skins for the existing one. The interaction part of the slot itself is also insanely limited; you don't have any interactions outside of the spin lever and the button that increase some passive bonuses. There are plenty of ways to make it more engaging (just look at the real online slots) and fun to play.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wish there was a \"middle/neutral\" rating for a game, but there isn't; \n\nWhile I think the idea and the charm of this game is really nice, the simple fact you have to constantly fight the game on if you can even get past the first or second round because the game just decides it doesn't want you to is frankly ridiculous. Once you play long enough you get so many items that dilute the pool you can almost never find what you want even while rerolling. These two things combined make it to where going for high reward builds for symbol valued higher than Cherries or Lemons is almost impossible, because if you don't take a luck item to start your run you can just lose the first 3 rounds with no chance to get going; this is especially annoying when you get an item and phone call combination for a specific high-rate symbol, then proceed to roll nothing or only cherries and lemons ending your run instantly. This is worsened by the 666 appearing on the third deadline itself (why not putting it on the 6th deadline and make that one 666?), meaning that by turn 3 and 4 when the game ACTUALLY begins you can get a 666, lose everything and get caught back in the original loop.\n\nDo I understand it's a slot machine and it is literally random chance? Yes, I get that that's the novelty and interest, but it's also a video game that should allow players to both actually play and feel like they're progressing/understanding items and builds after playing for X amount of time, but it just doesn't.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the devs dont want you to have long runs and use the game mechanics as intended... ...so they nerfed the game with a recent patch... for some reason... in a single player game... \r\n\r\nall of the really good items suck now. was great before this patch, dont recommend now.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "cant recommend until new update is either reverted or changed to address the criticisms\n\nalso, the 666 mechanic is not fun and could use some work. it feels like it triggers way more often than just 2% or whatever the base amount is. in my opinion how it works needs to be changed, if not how often it triggers then the effect it has. \"you lose all of the money you have\" is just not fun. especially if its the last round or the last spin and you cant do anything about it\n\nedit: announcing dlc right after pushing an update that no one liked, barely 2 months after the game came out, is CRAZY",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I liked this game a lot, but I cannot in good faith recommend anyone else support the game at this time. The dev is being really rude and hateful to their community members who politely mentioned they disliked an update. This is absolutely unacceptable behavior from a dev team even if it consists of two people. The fact they cut endless mode out is ridiculous too, I'm probably gonna try to get a refund as this is no longer the game I bought.\n\nEDIT: And of course Valve denies it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I was enjoying it, and close to 100%. The latest update changed unlocks to require doubled deadlines (instead of continuing to allow for three wins with the [b][i]option[/i][/b] of one win with doubled deadlines). Most of my runs now end at the first deadline.\r\nIt was fun for a hundred or so hours at least.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "1.2 botched like 70% of the fun with this game, the whole thrill of a roguelike is the rush of being rewarded with endless potential after utilizing unlocks well and the amount of nerfs (plenty of which were just not needed) just kind of killed that thrive to push the game to its limits.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The significant removal of endless runs is a dissapointing decision made for an overall very fun game,  many of the changes make the game feel less unique and intresting making it stand out less as a unique thing  in the quickly growing economy of gambling based roguelites, the things that made it stand out arent bad by nature of being diffrent.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Until the 1.2 update, game was a bit unbalanced, but fun. The memory card mechanic could have used some tweaks to not lose rare cards when the game just does not want you to even pass the first deadline, but game was fun.\n\nThanks to a lot of nerfs, not tweaking the cards in a fun/player side way, and introducing crashes to a lot of players, I feel this is not the game I bought. It is a harder, more unfair and less fun version of it.\n\nDo not recommend until a patch goes back on some dumb decisions and corrects some design issues of the base game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "couldnt get passed the first few deadlines, dieing got old fast, normally got loads of time for games like these. but just got frustrating and boring. must of just got all the bad seeds.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As of today's patch, the devs ruined the game and its less fun than it used to be.\n\nSad L.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Game is fun and all, but you are literally just restart fishing for good items and most runs end in the third step or so due to just RNG and nothing at all you can do about it. Feels very overtuned. The two runs Ive gotten were I DID get far were very enjoyable though. For the most part youre just pulling your hair out over \"increase chance to appear\" not doing jack shit.\n60% chance for clovers? the last 6 spins with no clovers at all but lots of bells and cherries say otherwise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "New update ruined the game. Hard mode should be renamed 'we hate the players mode'. It made the holo memory card grind significantly less fun, nerfed so many items, and buffed only a handful. You'd think this was a battle royale shooter or something with the way the devs are trying to 'balance' and stomp out fun in the game. They are also trying to kill endless runs, which is whatever to me, but sucks in a genre where that is a huge component of these sorts of games.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Good game until 1.2 released which just nerfed a lot of charms for basically no reason and then tries to tease a dlc (at the time of writing this isnt stated to be free or not) for the game. I get that the publisher of this game didnt want to stop the announcement but this is just a really bad decision and having a paid dlc this early is stupid. I wouldnt bother getting the game right now unless they change everything for the better and the dlc is free",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a mixed review \nTLDR: Game had merit on release, has gotten slightly less fun over updates. Don't recommend if you want endless runs, or very large numbers.\n\nThe game was fairly fun around the time it released, but after the 1.2 update it no longer has the same pull it had previously. Cloverpit is relatively easy besides luck. If you know what charms to take and what to do you're pretty much guaranteed a win. \n\nNow to the problem with the new update, since Cloverpit is simple enough to win if you get lucky, most of the appeal of the game came down to going endless, and getting as big a number as possible. With 1.2 released the devs nerfed most charms adding little to the game, of course this is just balancing, but wait, this is a singleplayer game with no online competition. Nerfs should rarely be included in singleplayer, unless they are literally game breaking e.g. crashing the game from being too powerful, not game breaking in the way that the devs describe, which is just their original idea of the game. \n\nDevs forcing a playstyle onto players rarely goes well, and comes across as controlling. If your game is \"broken\" from players doing something you didn't expect, you should embrace it. For example, Peak. Peak had a bug where you could essentially teleport to the end of the game, they patched this since it wasn't intended, but players didn't approve, so they reverted it with a slight change and made it a feature. There is no ranked mode or any competition in Peak, so they didn't mind, so it doesn't make sense when devs do. \n\nTo give the devs some merit, certain endless runs could break the game from overloading it, but I don't see how that is the endless build's fault. If the 64 bit integer overflows and flips back to 0 from getting too many tickets, then instead of nerfing charms that give you tickets, cap the ticket amount so it doesn't flip back over. Which in 1.2 they sort of did, they added the cap to patterns, but not tickets. Instead of adding code fixes, they just nerfed most of the game so you couldn't get there in the first place.\n\nI currently do not recommend this game on one condition, you are looking for a game where a big number gets infinitely bigger, which might be expected from a gambling game, but since the update, the number can no longer get as big. They are apparently making a hotfix for the 1.2 update \"that addresses some of the points\" (from feedback) but also announced a DLC so I don't believe they will change their ways.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept but gets stale quite fast.\nThe more you unlock, the more watered down your charm selection gets.\nThe memory cards are single-use that you have to collect?\nThere are no carry-over bonuses or upgrades, you can't even block a charm.\nAnd then they tried their best to remove endless runs from the game.\nWay to spoil the fun...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was a great game before the most recent (1.2 Hard mode update). Now the possibility of getting 100% achievements is nigh impossible. Revert the change to allow for the previous win condition (3 normal runs) instead of REQUIRING hard mode (2x blinds), and the hardest card (4x blinds).",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if you have fun in a game and the response is having your fun nerfed, then i'm not gonna have fun. if it's not fun, why bother?",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Genuinely the concept of the game is super cool. The graphics are really well made and i can see that a lot of love was put into this game. Funny silly gambling game in hell. Getting crazy numbers and endless runs was one of the most fun things. However,,, the recent update:\n\nIt was so funny and satisfying but then the game got nerfed and now its not really fun anymore. I don't really get why the developers did it. It's not like it is a multiplayer game that need nerfing down for fairness; its a silly singleplayer roguelike game where you make your own path in uh gambling hell lmao. The game was fairly difficult to begin with which made getting big numbers and endless runs even more rewarding and silly. It just feels like all fun was removed in the latest update. Hopefully they don't make anymore decisions like this in the future. \n\nAbsolutely great game in concept and the devs should be proud of themselves for making it but gahh recent update kinda bad,,,,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It might be a skill issue but sitting down on the first deadline praying I get lucky enough to pass it on the new hard difficulty is not how i imagine 'skill' being tested. It has become a slog trying to make my memory cards rainbow. It honestly feels like such a lazy way to spice up the difficulty.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is very fun at first but quickly devolves into an rng hell.  There is very little skill expression at all, and it's mostly just hoping you stumble upon synnergies in the mid game.  If you want to waste your time literally gambling then play this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great game when it came out, love it, beat it, even went after achievements. But after latest update can't even start the game since it crashes every time. I'm on Intel GPU by the way. Also this updates mostly just nerfs good trinkets and gets rid of infinite builds, wich in a single player game feels completely unnecesary. It just ruins the most fun parts of the game in my oppinion. Unfortunetly do not recommend until update is reverted or fixed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "---{ Personal Note }---\nNormally I would recommend that game that gave me a lot of fun. Sadly, the last update completely removed all the fun stuff of the game and made it completely unbalanced and boring, and completely killed my desire to  play again and/or finish the game at 100%. I will go back to my review if the future update removes the bad thing of 1.2, but for now I won't play that game again nor recommend it to anyone.\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☑ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Very Short (Less than 1 hour)\n☐ Short (1 to 5 hours)\n☐ Average (5 to 10 hours)\n☐ A Bit Long (10 to 20 Hours)\n☐ Long (20 to 50 Hours)\n☐ Very Long (More than 50 hours)\n☑ Infinite\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 0\n☐ 0,5\n☐ 1\n☐ 1,5\n☐ 2\n☐ 2,5\n☐ 3\n☑ 3,5\n☐ 4\n☐ 4.5\n☐ 5\n☐ 5.5\n☐ 6\n☐ 6.5\n☐ 7\n☐ 7,5\n☐ 8\n☐ 8,5\n☐ 9\n☐ 9,5\n☐ 10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I like 'Balatro', I like 'Slots & Daggers', I got addicted to 'Ball x Pit' and I have addiction issues in general, but this game, somehow, is just lame and ... cringe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Refunded. Apparently I bought the game at a bad time. Recent update supposedly stealth buffed how often the \"666\" mechanic comes into play. With a 1.5% chance of a 666 (which clears any earnings for that round) I was managing to get it on every 2nd-3rd pull. Glad I could pull out on this one.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is based on randomness with very little player agency. Items to buy are random, there is no real scaling of items, synergy is completely up to chance, and the only way to win is really by pure luck; your actions have very little meaning. This is the biggest issue with Clover Pit, which makes it stand out in a negative way from games like Balatro, where you can actively strategize and have a mix of randomness and skill. That is not here.\r\n\r\nWorst of all is that the game has major issues which could be fixed via continuing updates, particularly by giving the player more agency in the outcome of the game. But instead the developers announced a paid DLC. Great example of developers having a neat idea, having no idea how to execute it, and then trying to reap as much money as humanly possible rather than make a decent game.\r\n\r\nBuy something else. The devs have the mindset of AAA companies while wearing the cloak of being indie devs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was very into this game but the seemingly limited ways to beat the game and the ridiculous RNG I cannot in good faith recommend this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the game itself is really good, I can't recommend it seeing what the devs are doing. First they released an \"update\" that basically adds nothing, nerfs fun items into the ground and makes the deadline scale faster. Questionable, considering this is singleplayer game so all you did was make the game less fun. But what made me write this review, the devs ignored the feedback and announced a DLC. The game has already made them 10M$ and continues to make more. The \"DLC\" looks like the first major content update that they're locking behind a paywall. If they walk back on some of these terrible decisions I'll gladly change my review to positive, but I don't want to support greedy devs who exploit their fans to make a quick buck.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Zero fun in this game, The free to play demo was good and showed a lot of promise but now the game is pay to play, the difficulty has been set that high that it is just tedious and boring. Save your cash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Make a bad update > mock players for not liking the changes > announce dlc not 2 months after game released. Randy is that you?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Fantastic game on release. It had the same energy as Balatro while still feeling like a new addition to the rogue-lite market and having a reason to exist. Then came out the videos of streamers and youtubers finding combos of items that would \"break\" the game and allow for endless runs. That's fine, and I figured that was the whole point of the game, the game presents itself in a manner that it should be broken or that you should find the most broken/OP build.\n\nThen came a rebalancing update that completely nerfed certain items, and completely broke many builds. On top of this, deadline scaling was reworked to make endless runs impossibly more difficult. Why take this away? As many people have voiced, this is a single player game with no currencies or leaderboards or multiplayer. Having OP item combos or infinitely scaling builds did absolutely no harm to the game and was made the game fun for many people. \n\nDevs originally gave the impression that they were \"listening\" and were going to make a follow update that put more thought into the balancing changes. Behind the scenes though, they apparently have been mocking players for \"skill issues\". Isnt the entire point of the game gambling? How does that equate to a skill issue?\n\nThe final nail in the coffin for me was that this game released almost 2 months ago. No content updates since then, just a single balancing update that angered a lot of players, and now they have the audacity to announce a paid DLC for this game. No thanks. Y'all can take your paid DLC and shove it. If this is how you're going to treat your community, I'm out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really wish game developers would stop catering to the ultra-competative. Just because John Tryhard has a video on youtube showing how they broke the game with different items, doesn't mean they all need to be nerfed. This is just a casual game. There's no leaderboard. So why make things less enjoyable for everyone.\n\nYes the items could be used to 'break' the game but guess what. That's what roguelite games are all about. Let us have fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shit...\n\nThe RNG in this game is set to \"Go F*** your self\"\n\nIm losing all the memory cards I managed to get and losing within the first 2-3 deadlines all the time now.\n\nSince I got lucky and got the white phone and key the game has just been making me lose.\n\nIf I wanted to feel bad about gambling id go to a casino!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "um. ok. it's a slot machine game. I didnt hate it but its definitely way over-hyped. why is it so convoluted and why is my POV being forced away from my control here and there. the game gave me head aches just playing an hour. Its like people asking \" hurr durr why do you use dark mode maan\". It's fine that graphics are artsy blocky pixel kinda way but we gotta read bunch of LONG ASS texts to see what a charm does etc. I dont know if its from the head aches but charm info and their effects could be shown with simpler and better animation and sound feedback perhaps. the only think i can say is when pepper charm shows up, i get more counts. The neko cat, the c4 bomb thingy, that chrystal and battery thingy etc, no idea. Also, there is plenty room on the table for charms but there is an arbitrary limit to how many you can keep? I think if you could hang or insert charms on to the slot machine or something we could clearly see oh there are this many slots for charms etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "80% of runs are a waste of time and go nowhere without a shot. Maybe if I get lucky and unlock even more things it gets better later on right off the bat? But...screw that? I'd rather just play something else.\r\n\r\nThe few times you can get lucky and get anything going, it is fun. But they're so few and far between.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "weird choices, bad changes, and upcoming dlc releases instead of making the base game better. fun game likely to soon be ruined by awful decisions. maybe they can still recover and fix everything though, so ill wait and see if anything changes for the better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its fun at first, but it becomes repetitive fast and too easy to win once you know what you're doing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Games actually good depending on your luck run. I've had terrible luck for a majority of this game so my review will stay recommending people against buying it. If you want to make people suffer buy it for them",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game starts off pretty fun but as you progress and unlock charms the chances of starting a winning run diminish fast as the pool of charms gets bloated with things that are pretty useless, making you restart like 9 out of 10 runs.\nThe latest patch has made it even more difficult to progress by nerfing some of the good charms without improving the filler. The game could also use a lot of QoL improvements, but the latest patch and the dev's response to the backlash isn't inspiring any confidence.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Don't buy the game just play the free demo. It's not worth it, there is nothing in the full release that makes it worth buying.\n\nThe reason i bought the game was for the \"story\" and more items but as it turns out those are the reason why i do not enjoy the full game. After unlocking all the drawers the game just becomes a reset simulator were you hope to get good items. There are so many useless items that it's almost impossible to get the good ones. I have spend days resetting over and over again and i constantly don't make it to the 4rth deadline. I know it has a lot to do with luck but making the game take actual days to get one good run because of the items is bad game design imo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Visually a neat game, but doesn't really do anything good that I typically look for in this genre. There really is an overwhelming lack of meaningful choice making. Its like if every round of balatro had one hand and zero discards. There's just no interaction in the actual gameplay, and the set-up of your pulls is so abysmally restricting that its not even engaging in that regard.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sorry, can't recommend this game after the blatantly out of taste update the devs put in.\n\nAbsolutely disregarded any feedback from your player base, no QoL improvements, nothing. Just nerfed the game to make it harder and more boring.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I gave this game enough of my time.  Can't take anymore RNG bull sheet.  \r\n\r\nGo play Balatro, it's a far better experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Spent about 25 hours obsessed with this game, creating fun and profitable builds, and every hour spent in game since has been less fun, Don't know what they're thinking with these updates, or why announcing DLC for a game that still needs some TLC and polish to really be considered a completed game... I hope they're taking this stuff into consideration and make the game fun again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Spin seven times: earn 2 coins. Repeat until you can't pay back 200 coins. At no point did this ever feel like it was going anywhere or getting better with every death. Oh good sometimes cherries can be golden cherries. I'll watch those match with my other non-existent cherries.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't buy until the devs revert the patch that killed the viable options in the game. The game needed some balance changes since most of the charms were not even worth trying after reading what they did, but making everything worse wasn't the way.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Was great until the update, double deadline was specific to the golden nob and you just had to play each card 3 times to rainbow it, which was challenging enough imo and the nerfs have ruined the game a bit.\n\nSadly this feels like changes to appease the tryhards who moan its not challenging enough which is a shame.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has a lot of potential and I really enjoyed the early game, but now that I've beaten it a couple times it just isn't fun dying over and over again in deadline 2 or 3 because I can't roll any good items in the shop. Your item pool gets so diluted that it's hard to get the ball rolling on a good build. Part of what makes this game fun is exploiting the items to make insane infinite run builds, but it seems the devs are moving away from that play style in favor of more 'difficulty'. While I understand this game is inherently luck based, it isn't fun to die 5 times in early deadlines in hopes for that 1 good run.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Developers changing the game's rules so the house always wins. 10/10 just like a real casino!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well unfortunately, i got this after the 1.2 update. Sounds like the game may have been fun prior to this. Wouldn't recommend it now. Earlier builds dont feel satisfying at all and even if you get some insane luck with phone calls, you still just can't seem to to get anything to work for you even if you build for it. Several hours in and there's no meta building that seems to give any kind of edge so you're just kinda stuck slowly slogging through. It needs work",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Man I really like this game, but so much about it just makes me want to say don't pick it up until the game gets some serious updates.\r\n\r\nThe game is fun on its core, but the biggest issues are: no way to turn off the blasting lights, a lack of quality of life. And with this recent update it just made me feel like. Wow. I guess what I thought this game was suppose to be wasn't at all. Devs don't want endless runs, even though they allow it? Like- it's a singleplayer game??? Who cares if you try to go naninf, that's the fun of endless mode. And it's not even really going to help with unlocks regardless.\r\n\r\nOn top of that the flashing lights is really irritating and gives me a migraine and I don't typically deal with photo-sensitivity, but I cannot in good faith imagine someone with that would even be able to do one go at the spins.\r\n\r\nAnd just like- how is it that AFTER you do the \"true ending\" the game is still so obtuse with pieces in the drawer or like the skull which for some god damn reason isn't guaranteed you have to roll sometimes upwards of 50 times just to see it on like deadline 3. It boggles my mind how the devs didn't consider how someone might want to actually 10% the game. Especially if you fuck up and have a bad run and need to restart. Welp, time to restart 3 or 4 times to fill the drawer again when it could just, auto be filled after you have beaten the full game. Like. and memory cards do not need to be opened one at a time after you get all of them unlocked. Like. When you play this game so much and need to open like 4-5-6 even it takes forever.\r\n\r\nGenuinely wait for this game to update. Or like, get better I don't know. I'm just upset about this latest patch with no real quality of life things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Number 1 reason for hate is the fact that there is no way to disable animations, you can speed them up up to 4x but that is so slow. And speeding it up even more won't make it better, just add stupid option to disable animations completely.\n\nSecond, Memory cards are consumables. Like man you make game more RNG than it needs to be, making it even more RNG to get the Cards in the first place, and you make them consumable. Big red flag.\n\nI wanted to refund it but I was too late.\n\n2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The balance was questionable before 1.2 and you had to reset a lot to get a decent run going and after 1.2, it seems like it's not worth the trouble of slogging through the RNG.\n\nBut hey, the devs sold their million copies, why should they care about the players that got them there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Gets boring very fast and releasing a dlc when the base game is still not good is just pure greed",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The base game is really good, great amount of fun but, seeing as they plan a DLC, when there could be so many improvements done to the base game... it really takes my mind to a cash grab, quick profit riding the wave of popularity for the game. Util i see otherwise I can't recommend, I only bought it to support the developer, but you can really just grab a free copy off of google if you know what I mean, I would like to withdraw my support for the dev.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has one of the most fucking idiotic random imaginable. Fucking dogshit \"666\" bullshit appears more often than any other symbol, with a 1% probability. It's a stupid, broken random generator. And I won't change my mind until the developers fix this rigged bullshit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful 1.2 update that nerfed way too much. The devs claim that this is to \"prevent endless runs\" which is just their way of saying that they're anti-fun. Scammed me out of my money, don't let it happen to you, and DEFINITELY don't buy any of their games, whether or not it's good right now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The latest nerfs were too hard on the core of the game. Expecially for endless runs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New update ruined it.. way to much RNG now revert the cards back to 3 wins and il like the game again..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "There is too little content, the gameplay is too repetitive, and what players can do is quite limited, with only a handful of powerful items available.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I don't know how but they managed to release one of the lamest, anti-fun updates that also completely failed to improve the swath of minor issues that pile up to make the game a boring slog to go for completion. \n\nThere's a severe lack of variety when that vast majority of items are the same thing but for a different symbol. The game is not remotely honest about the chances of symbols and patterns appearing. Even at 4x speed the spins take so long late into a run that it's extremely tedious. Runs will either die on the 1st or 2nd deadline or be a complete joke with zero friction with little exception, the new hard mode does nothing to change this besides the nerfs to a ton of items in the same update, most of them not even good in the first place.\n\nMost confusingly of all, what exactly is the issue with getting a run that can go forever? What is the beef some roguelite devs have with letting a player try to make the biggest number they can, despite that being the whole appeal in the first place? Yeah it's tedious and boring, but when you can end a run at any time, even AFTER you've failed to meet a deadline, it feels insane to tell those people no, they can't have their fun actually so we're gonna artificially make it impossible now.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "i really liked this game at first, but i just cannot get behind the latest update, which effectively ruins any way to get far into endless, making it really repetitive and unfun. the combos that were fun to build towards and offered high risk high reward, or just fun gameplay, were nerfed to the ground. \n\nThe game shines in a lot of aspects, and it has love and care put into it, but sometimes there is a line, especially for a rougelite, as the game is at its best when pushed to its limits. even the description of the game itself says the game is broken, and you are MEANT to break the game, so the first update being one that contradicts that feels kind of silly. hopefully you reconsider these changes, as i really love this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have 124 hours in this game. A good chunk of that time is having it up in the background while playing another game that has long queue times. It was a great filler for in between matches. I was looking forward to the challenge of 100%ing this game before update 1.2. Now it feels impossible. I'm 4 charms away from having them all unlocked and don't care in the slightest anymore due to now just playing \"Restart the game until you get god tier items AND incredible luck.\" If you were on the fence, I would either move on from this game or check back in a month or two to see if this worst decision update gets reverted/fixed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game had everything to become a nice alternative to Balatro, but the devs decided to go against players, pushing an update that no one asked for, everyone disliked, and now there's no trust what the devs will do next. And despite massive criticism, rather than defend their choice or apologise for a goof, they decide to make a meme on instagram. Until the devs decide to listen to the players feedback i suggest staying away.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "While I LOVE roguelites, this one just has too much rng. My last session lasted almost 3 hours in which I didn't have a single good run because the game refused to give me any patterns and I kept losing at the first or second deadline. There is just not enough control over the runs. \n\nMemory cards could be fun, but again, totally dependent on rng and single use on top of that.\n \nI feel like the progression isn't rewarding at all. I can deal with rngsus hating me if a good run would at least reward you with progression, but 1 good run in many hours of gameplay just isn't fun. Any progression you do get, unlocking new items, objectively gives you even less chance of completing a good run because having more options means you need even more luck to get items that synergise to score high enough to meet even the first few deadlines.\n\nIt was fun (read: new) for a little bit, but I doubt I'll ever fire up the game again.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}