{
  "positive": [
    {
      "review": "I am still hesitant to give this game a thumbs up, it's more on the neutral side of things but you wouldn't go play souls-like games without experiencing the original Dark souls series \r\n\r\nIf you're new to this genre this game should be the last one you play or the one you skip altogether, there is nothing special about it, only torment and despair. \r\n\r\nThe biggest reason this game got the most hate in the series is the gameplay and level design. \r\n\r\nFor gameplay, they went for a slowish pace, animations are slower, iframes are shorter, stamina is scarce, and even when you level your character a lot you still need to manage your stamina and attacks. I personally like slow gameplay in games, I enjoyed it, but I agree that it didn't hit the mark, especially that the enemy doesn't have the same stamina management and it gets frustrating at times. \r\n\r\nLevel design has the most bullshit going on you'll ever witness anywhere, the difficulty in this game isn't the boss, it's to reach the boss, every corner, every step has something that's gonna make you hate the game. If you played DS1, think Sen's fortress. Now there are ways to deal with all of it but till you figure it out, suffer...\r\n\r\nFinally, the story, they tried to go for the same mysterious vibe DS1 had and they failed miserably, it's not a sequel, it's a cheap copy in that regard and not a single bit interesting. \r\n\r\nIf you're playing FromSoftware games you'll pass through this game, but if you're looking for a decent soulslike experience, that's not it.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "I know it gets alot of hate, but its undeserved, in my opinion. Its just... different. Lots of bosses, and the game seems longer, but that aint a bad thing. Not my most favorite FromSoftware game, but its nowhere near a sbad as all the hate...,",
      "voted_up": true,
      "votes_helpful": 64
    },
    {
      "review": "I AM THE DARK SOUL 2!\r\n\r\nRoad to bosses were more difficult than the bosses themselves. Great armour sets, great environment, great soundtrack. Overall a fun game to play once you know what you are doing :D",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This game makes me want to cut off my own balls and pour lemon juice on what remains, and I mean that as high praise. Dark Souls II is agony refined into art. A lot of encounters feel unfair until it suddenly isn’t, and every triumph feels like a religious experience. \n\nThe Crown of the Ivory King expansion is absolutely peak, a frozen hell that's so interesting you almost forget it’s trying to break you into a million pieces.\n\nI hate this game and it's not good for my blood pressure but I recommend it a lot. I played a lot of the origin DS2 but this is the definitive version. I’m glad I came back to it.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Dark Souls II is a game that evokes a lot of mixed feelings in me. DS2 is a game that does a lot of experimenting and big risks that ultimately put the experience somewhere between okay and downright awful. I've seen a lot of comments that the hate is overblown and it is actually a very good and maybe even the best DS game. While I agree the hate was overblown I can't help but think that we're swinging too far the other way with how much it's being praised. Since I am going to be pretty critical, let's start with the things I like.\r\n\r\nThe Good:\r\n\r\nDS2 has a very addictive gameplay loop, despite the flaws I'll talk about later on in the review. The progression of weapons, armor, and skills feels really good and the pacing of getting stronger is genuinely really fun. This might be the primary reason why I'm able to mostly look past it's issues. Likewise, DS2's weapon and armor design is pretty good, I always looked forward to trying out new weapons and armor. Though I've only played through it once, it's easy to see that the flexibility and variety of builds far outstrips the original as well.\r\n\r\nWhat DS2 does right, it does really well. NPCs are also a major highlight of the game for me. DS1's NPCS, while charming, always felt more mysterious and distant. DS2's NPCs feel more like real, living people and not like phantoms, which lends to DS2's overall atmosphere of a world that is beginning to die as opposed to DS1's atmosphere of a world that's been long dead. Majula in particular really enhances this, feeling like a growing community with each new NPC you discover. If you talk to certain NPCs enough, they'll give you gifts which is a nice touch. The NPCs you talk to have backgrounds, goals, and fears. While you could say that DS1's NPCs have these things, they're just more fleshed out in DS2. It just makes the hub and world feel a little more alive and connected.\r\n\r\nThe Bad:\r\n\r\nOkay, now for the bad, which there is a lot of. The biggest, most glaring issue that trumps anything else is the design philosophy when it comes to making difficult encounters, which is: throw massive amounts of enemies and hazards at the player. DS2 is infamous for its ganks and to be completely honest, that is terrible game design. When comparing it to DS1, which had intentional and clever placement of enemies that were at a manageable number, DS2 will have giant groups of enemies rush you from across the map. Additionally, they will rarely break aggro and will chase you down if you try to run past, while attempting a boss for example. This forces you to fight these hordes of enemies every single time you're trying to beat a boss, which can get miserable quickly. Add onto the fact for some of the hardest bosses, like those in the DLCs, have brutal boss runs with not only hordes of enemies but also environmental hazards or enemies shooting magic at you from afar. It's not clever, it's not fun, it's just creating difficulty through volume as opposed to unique, quality move sets.\r\n\r\nThe hit boxes in this game are criminal. Everyone knows about the adaptability skill and how infuriatingly crucial it is to level it to reach a point that was just default in DS1 but beyond that, the hit boxes for enemies is just unfair. Enemies will be able to snatch you when you're multiple feet away, outside of their attack animations. Or they'll be able to damage you when their animations indicate they missed. I don't know if this was a design choice or an oversight but it's atrocious and very unfair. Another very poor gameplay decision was the constant loss of health for every death that you can only reverse with human effigies, a finite resource in the game. In a game series about constantly dying over and over, punishing the player for dying is abysmal design. It just sucks.\r\n\r\nFinally, one of the biggest disappointments for me was the art design and atmosphere. Many people talk about how DS2 has the best atmosphere of the trilogy and that's just not true. DS1's atmosphere of darkness, mystery, and despair has been replaced in DS2 with an atmosphere that frankly feels cheaper in all respects. While some areas in DS2 have a good atmosphere and feel reminiscent of DS1 (Drangleic Castle, Majula) many others feel out of place and honestly like a theme park. Iron Keep and Huntsman's Copse make me feel like I'm playing WoW and that is the antithesis of the central visual themes of the dark souls series. This goes down to even how the undead look. In DS1, the undead's skin was stretched, dehydrated, withered. The undead in DS2 look like a stereotypical frankenstein costume, it's embarrassing. The boss designs, for the most part, do not help this. Many of the bosses in DS2 are generic, fantasy stereotypes as opposed to the unique twists on classic fantasy tropes that FromSoft is known for. Generic skeleton bosses, knight bosses, or demon bosses (some of which are very important to the story) make me feel like I'm playing a low quality MMO. Not to mention the reuse of bosses from DS1, there are a number of rehashes from DS1 that are just worst in every way (Ornstein, Bell Gargoyles). It's just lazy and uninspired. There are, of course, good boss designs but they are by far the exceptions and not the rule.\r\n\r\nOverall, DS2 is a very flawed entry in FromSoft's catalogue and honestly if I hadn't played it with my friends, I don't know that I would have even finished the base game. My recommendation is that if you're souls crackhead like me and you see it on sale, pick it up and give it a try. It's far from the horrible game people made it out to be on launch but it's certainly not the brilliant, misunderstood underdog of the series that people today keep claiming it is.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Different from the other souls games, but for being seemingly the most hated souls game, it's still better than 90% of games out there.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Dark Souls II: At the End of Ash, There Is Still Light\n\nI still remember the first time I arrived at Majula.\nThat seaside ruin, swept by a damp wind, had almost nothing—\na bonfire, a windmill, a silent woman.\nThe sunlight was pale, the air was salty, and the music felt like a memory.\nBack then, I didn’t yet understand that Dark Souls II wasn’t a game to “beat.”\nIt was a world meant to be felt—a world that had already fallen apart, but where people still refused to vanish.\n\nThis game never hurries to tell you anything.\nIt doesn’t throw its story into your face like most games do.\nIt simply stands there, silent, waiting to see if you can find meaning within the ruins.\nLike those moments in life when you walk into an empty place—no one explains it to you, but you know it once mattered.\n\nI\n\nThe map of Dark Souls II isn’t perfect.\nIts world isn’t a miracle of interlocking design, but a crumbling labyrinth.\nAnd yet, I love this imperfection.\nIt feels like reality itself: paths split, meanings blur, landscapes collapse into one another without logic.\nYou keep walking—through poison fogs, into castles, down into caverns—and everywhere there’s that mute sense of history.\nThe world feels like the corpse of the past, and we are wandering inside its bones.\n\nI died in the same place over and over, until frustration turned into quiet concentration.\nWith every death, I memorized a stone’s edge, an enemy’s rhythm, a hidden shortcut.\nThe game, in punishing you, is also teaching you.\nIt’s teaching you what it means to endure—to find worth inside repetition.\nEach time you rise from the ashes, you’re not just playing; you’re existing.\n\nII\n\nAnd the story? It barely speaks.\nThe NPCs mumble fragments, as if they’ve forgotten who they once were.\nYet that silence makes everything more human.\nI began to imagine their pasts, to stitch meaning from scraps.\nEach item description reads like a torn letter; each boss feels like a fallen king, a knight, or a mother whose memory curdled into wrath.\n\nDark Souls II never tells you who is good or evil.\nIt only shows how time erodes will.\nYou witness kingdoms decaying, ideals dissolving, the flame itself fading—\nand still, you keep walking.\nThere’s no reason, no reward, only a journey you cannot stop taking.\n\nIII\n\nI’ve always loved its light—not sunlight, but the trembling light of a torch.\nWhen you walk into a cavern and raise that flickering flame,\nthe walls glisten with moisture, and the air itself feels rotten.\nIt’s terrifying, yet strangely peaceful.\nThe beauty of Dark Souls is not the kind that pleases the eyes;\nit’s the beauty of order born from ruin.\n\nA broken cathedral, a rusted suit of armor, a banner waving in a dead wind—\nthese things remind you the world isn’t dead,\nit’s merely been forgotten.\n\nIV\n\nI think about the combat—it’s cruel, but honest.\nIt destroys arrogance, dismantles impatience.\nIt doesn’t care how skilled you are; it only demands sincerity.\nWhen I finally defeated a boss, I didn’t feel triumph.\nI felt something quieter—a breath after exhaustion.\n\nYou look at the fallen creature,\nthe message “Soul Acquired” appears,\nand you wonder: What did I actually win?\n\nPerhaps nothing. Perhaps only survival.\nAnd maybe that’s enough.\nBecause life, too, rarely rewards effort with applause.\nIt simply asks us to keep breathing through the pain.\n\nV\n\nWhen the final door opened and the fire awaited, I didn’t feel joy.\nI felt hollow—like I had witnessed the end of a world.\nYet within that hollowness, I began to understand what “soul” really means.\n\nDark Souls never glorifies strength; it glorifies the will to keep living beneath collapse.\nIt’s a tragic kind of romance—\nthe fire will die,\nand still we choose to light it.\n\nSo when I lifted my head from the screen\nand saw the first pale light of dawn outside my window,\nI realized something simple:\n\nLife itself is a long, dark soul.\nYou stumble through fog, awaken by the bonfire,\nunsure of the goal—only knowing you must keep walking.\n\nAnd when morning finally comes,\nand you look back upon the ruins, you’ll understand—\nyou never conquered the darkness.\nYou merely learned how to walk within it.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Paid to replay this peak, I love all the fromsoft games but this one scraches an itch the others dont, know im not saying its better then the other games, BUT this game slaps even harder every playthrough",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "this might be either the best or the longest game ever made. will re-review once I finish it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game Fromsoftware has ever made and Elden Ring doesn't come close. Over hated by people who have never even played it",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Amazing game, but I swear The Gutter is less dark than my dating prospects.\nI fell into holes in DS2.\nNow I fall into emotional holes in real life.\nSomeone said I should “touch grass” so I tried, but I just rolled off a cliff instead.\n10/10 Incredible game, terrible choices.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100 % recommend Perfect Game Perfect World Structure, sit's at 2nd place when it comes to all 3 souls games, and 4th when it comes to soulslikes I've Played \n\n\nBut seriously This game is overhated and I don't get it I genuinely enjoyed this game 100% recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favourite Dark Souls games of all time, brings back very good memories.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun and so SO!!!! EASY!!! I AM 100000% LYING but it is fun and give it time explore and remeber dont lose youre souls he he he",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its peam and goated and do NOT skip this game before going to ds3 or i will enter your house and make you feel unsafe",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a game that makes you want to switch to dark souls 1 instead. beautiful visuals littered with low effort enemy placement to make it more difficult. every room is equivalent to the capra demon room but with 12 dogs high on bathsalts constantly jumping on you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you are not ready to consider hunting an entire area into extinction as a legitimately viable strategy, you have not reached the level of patience this game attempts to teach you. Harsh enemy placement forces careful gameplay and planning on enemy aggro, etc. Probably had more fun getting through a hard level than a boss fight.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Came straight from DS1, after getting used to the mechanical changes I very much enjoyed it. DS2 very much rewards careful progression where in 1 often running through was my go to strat which more often gets punished in this one. \r\nCurrently I finished the main story and progressed onto the first DLC which is a very good addition already.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished ds2, honestly idk what all the negative fuss is all about.\n\nGame is great, better then ds1 in my opinion even. If you don't like ds2 thats fine but it might just be a skill issue\n:P",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it was hard but then i got good and now fun. mechanics bad weapons good boss mid. would die again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Forced hate, definitely not the best in the series but a good game. Level up adaptability",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best game in the series don't listen to the hate just play it, if u struggle with early game look up a rapier build and cheese a few early bosses",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "funniest slapstick comedy you'll ever play and the game that truly set the flame of ambition in FromSoft\r\n\r\noften misunderstood for its sadistic enemy placement, tons of undercooked nonsense, and making people look up stronger words for obtuse\r\n\r\nbut despite these sins, Dark Souls 2 walked so Elden Ring could run - the depth and breadth of the underpinning RPG systems and a beautiful, gigantic world make Dark Souls 2 arguably the most unforgettable of all of FromSoft's games\r\n\r\nthe game is ambitious, frustrating, magnificent, miserable, and everything in-between, and for that I love it deeply",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please stop listening to Youtubers.\r\n\r\nThe game is massive and fun. Unlike openworlds, the content in this game is very dense. Besides Frigid Outskirts, you don't end up running a big empty maps.\r\n\r\nThe game asks you to actually pay attention to your surrounding, not unlike tactical shooters. Check corners, be careful of chests and doors. Act like a Dark Souls 3 player just running and rolling their way to fog gates and you'll be, for good reason, punished. The game wants you to interact with its level design! This game has the most bosses in the series, but also has great levels between them. Running to fog gates is just turning the game into a mindless boss rush.\r\n\r\nBy the way! Find a level too difficult? Monsters only respawn up to twelve times! Everytime you fail reaching the boss or beating the boss, you progress towards making the game easier for you, so you will, eventually, be unstuck. The game also features healing consumables, so if you're low health after dealing with a lot of enemies, you can pop Lifegems to be fresh for the boss, without using any of your Estus Flasks.\r\n\r\nYou can level Agility through Attunement and Adaptability as a difficulty slider mechanic.\r\n\r\nThe weapons have the most varied movesets, and sets of weapons and sorceries in general. tons of builds possible, and tools to use depending on the situation.\r\n\r\nOverall, it is my favorite game in the series. Stamina matters (unlike DS3), you have build variety (unlike DS1), the exploration is fun and rewarding (unlike Elden Ring).\r\n\r\nGive this game a chance, and ignore souls sloptuber takes that they regurgigate for easy views and likes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is surprisingly good. Once you played it more like an RPG than an action game (unlike DS 1 and 3), its surprisingly fun. Feels like Elden Ring 0.5, if you get what I mean. Definitely give it a try using either magic or power stancing, everything else feels kind of wrong.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This used to be the “worst” Dark Souls game — the punching bag of the series.\nBut honestly? With all the new Souls-likes flooding the world I realized something horrifying…\n\nIt can get worse.\nMuch worse.\n\nCompared to some of the stuff out there now, Dark Souls 2 has actually aged into a perfectly acceptable experience. Still janky, still confused, still wandering around like it doesn’t know what franchise it belongs to — but no longer the bottom of the barrel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Most people hate this game, because it was different from the other Dark Souls games. It was also made by someone else, since Miyazaki was working on Bloodborne at that time, but from my personal experience, this game is unique in many ways. \r\nThe only tip I have for new players is to get your AGL stat to 105. That gives you enough I-frames to enjoy the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played ER 2 years ago almost, about 1500 hours, figured id explore the series. Got DS3 this march of 2025, couldnt get passed the stupid tree boss (come to find out it was optional). Took a break for 6 months, got back into it begining of october end of september, and last month ish i 100% it fell in love. Just got DS2, and i hate it with a burning passion- but im a masochist so im gonna 100% this anyway. But wow. Can no hit a lot of bosses in other games but the NPC's in this game are worse than ng7 malenia , and im still in the first half. \"JuSt LevEl AdP bRo\" fuck u.  but its a good game still just damn twin",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100% the most overhated game i have ever played and its not even close, its my fav in the DS trilogy now",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A solid sequel that can stand on it's own merits. This game improves many aspects from the first game (equipment durability, the weapon upgrade system and 4 ring slots instead of 2, among other things) and the gameplay is equally fun in terms of combat and exploration, but the one drop in quality would be the bossfights, there is a lot of filler in terms of the 41 bosses in this game with many of them being pathetically easy, to the point where I have beaten every boss in this game with only 8 of them taking more than 2 attempts. another annoyance would be the runbacks to certain fog gates, with some of them basically requiring you to clear out the enemies beforehand because for whatever reason you can still get hit while in the animation of traversing the fog, something that the first game made you invulnerable while doing so.\r\n\r\n7/10 it's really not as bad as people on the internet say, it's a pretty solid experience \r\n\r\nFrigid outskirts is still the worst area in video game history tho, seriously fuck those stupid horses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember that this game was so hated when it came out, mostly because it was very different from DS1 and I`m certain that it was also bercause of the diference bettwen the pre-releace footage and the final product. The game still have some cool details that not even DS3 had and I`m not sure why they didn`t included. The game has some thing that I don`t like, some of the animations feels floaty, sound effects are not that good and some places of the game sure look ugly if you stop to look. Still the game is really still really good and it`s still one of my favorite games that I can play over and over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean. it's whatever. If i could put it in between ok / meh, or decent I think that's where it lays. Bought this to form my own opinion on this, some aspects I enjoy and others I'm not a big fan of. Overall it's the same as any souls game, It's fun wandering around etc but think the format of layouts and bosses are pretty bland and forgettable, you could ask me what boss I just killed and I'd have nooooooo idea. But!!! I do think it's fun, I like overcoming the difficult parts and how much of a troll this game is, I just know they were giggling in the studio making some parts of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've purchased this game before, and I left a negative review because it felt unplayable on a PC.\r\n\r\nI tried again even though I promised that I wouldn't install this game again. I changed some of the settings after some research and I was able to play the game.\r\n\r\nThe game seems to be fun. There are many invasions (pvp feature) against bots and real players, so if it doesn't suit your playstyle then this game is not for you, but I would still encourage people to give this game a chance or two.\r\n\r\nTorch mechanic is surprisingly fun.\r\n\r\nI still need to finish the dlc but at least the main game is done. I felt there were enough content to keep me busy (45 hours and ended up at lvl 151)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look. I actually do not recommend this game at all to pretty much anyone. But there is no \"ehhhhhh\" middle ground option and a flat negative *only just* scans as unfair to me. I really had to think about it though because my god what a mess... \n\nThe first-half of this re-release scans to me as self-parody - a comical overcompensation for those who felt base DS2 was too empty, too uncanny, or god forbid too easy. I actually think everything up to Drangleic Castle is MUCH MUCH WORSE in this version. It is borderline unenjoyable. \n\nIf you have ever had someone tell you \"enemy placement is much better in Scholar\", they are lying to you. Horribly. Every moment of infamy that earns DS2 its polarising reputation comes from Scholar's \"revisions\". The Iron Keep was not that bad in base game, and it's entirely because of how they tweaked the AI. It's a quadrupling down on a tedious design paradigm - there are only so many times \"luring it out required ahead\" can be read without your eyes rolling.\n\nSo, why a thumbs up? Moddability, mostly - DS2 Lighting Engine has this game looking far better than it has any right to, and while there's only so far you can go to work around deeply inconsistent art direction, it works around one of the biggest issues with the original experience which was that it was hideous 90% of the time. I also think the revisions to the late game are generally nicer - the Dragon Shrine and the castle are the two main examples in my mind. \n\nOther notable alterations... getting the ember for infusions early is a total nothingburger of a change to me, and removes any excitement in looking for it as well as facilitating the noob trap of early-game infusing just because you can, so I don't care for it. Changing the Bastille Key to be attainable without much effort also seems pointless. Just... deeply weird changes all round. Not the kind of revisions that this game so deeply needed.\n\nAs for the DLCs being thrown in... well at least one of them is good! The Sunken King DLC is by far my favourite passage of this game, actually enjoyable to explore and two out of the three bosses are genuinely great. Iron King was an immediate return to the awfulness of Scholar design ideology, just full of terrible ideas and only Fume Knight to save it. Not worth the slog. Eleum Loyce is SO CLOSE to being up there as the best area - great exploration, decent bosses in the main section - and they just couldn't help themselves and HAD to throw the Frigid Outskirts in there, which might well be the worst area in a game full of bad ones. God awful stuff.\n\nSo. If you've had someone say \"DS2 is bad but the DLCs are good\"... no! No they're not. Not good enough to be worth all that. But if you are like me, and you just have to know... well. I'd probably still recommend playing base game with the season pass. But if you want to mod the game then this is the release you go for. Just pretend the first five to ten hours didn't happen. Trust that if you think you're the kind of person who can do that, you will find that self-belief tested. It really is as bad as everyone says. \n\nAs before - I enjoy that this is the first souls-like to streamline set building in the post-game, infinite titanite vendors are a good idea and actually getting to engage with the mechanical complexity on offer once the humiliation ritual of the campaign is over provides a surprisingly large amount of redemption. If you beat all the DLC and get the King's Blessing, Bonfire Ascetic-ing the areas you want to see in NG+ while wearing the stuff that stops you from hollowing gives you a glimpse of the few good ideas in here working at their best. \n\nSomewhere in the collective consciousness exists a \"good\" version of DS2. Neither one of them actually are. Playing both of these versions to find out felt like putting my hand on a stove for 100 hours. But you really do have to see for yourself, I suppose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Dark Souls II is one of the most controversial games in the series.[/h1] \nIt is often called the black sheep because of its unusual mechanics and design choices. Yet, despite its reputation, it has amassed a devoted fanbase. Its atmosphere and lore are unmatched, offering a distinct sense of melancholy and mystery. While many players describe their experience with the game as a love-hate relationship, I’ve seen firsthand how it can surprise newcomers. Contrary to common advice that DS2 isn't beginner-friendly, my girlfriend recently started playing and found it approachable and genuinely satisfying despite just having played and finished DS3 as her first ever Souls game.\n\n\n\n[h1]The advantages:[/h1] \n\nIt has a unique atmosphere and world design. It makes you feel sad and gives you the urge to explore, which is probably the most beautiful of any Souls game.\n\nDLC expansions: The Crown of the Ivory King is especially popular. People like it because it is well-made, challenging, and offers exciting experiences.\n\nThere are many different builds and customization options: There's a lot of flexibility in the playstyles, from powerstancing to magic hybrids.\n\nRewarding progression loop: It's fun and keeps you playing.\n\nMajula: This is such an iconic hub that it deserves its own mention.\n\n\n\n[h1]Cons:[/h1] \n\nLevel design and enemy placement: too many gank squads and frustrating layouts.\n\nThe game's mechanics are clunky. Healing feels sluggish, and the hitboxes are inconsistent, which makes combat less precise until you get ADP up.\n\nDeath penalty system: losing max health each time you die can be discouraging. It feels punishing, but it does make you want to play with other people to regain humanity items, which I consider a plus.\n\nBoss quality: there are twice as many bosses as in other games. Some are easy or not too difficult, but many are much more unique than the other entries. They have cool extra features that change how the environment works, which makes the battles more interesting. Definitely better than Dark Souls I, but about equal to DS3 (mostly because DS3 is so smooth when it comes to gameplay).\n\n[h1]Recommendation:[/h1]\nDark Souls II is best for players who are already familiar with the series and want to experience its unique take on the formula. Veterans may notice its flaws, but newcomers can still enjoy it, especially if they like the atmosphere and unusual elements.\n\nThis is my favorite game in the series, and it's much better than Dark Souls I if you can look past the nostalgia. In this game, it's important to level up your ADP. You might feel like you can't dodge anything when you're starting out, but once you level up, it's not that much harder than other games.\n\nIt's also much more open and expansive than the other games in the series, originally intended as an open‑world title like Elden Ring is today. Because of changes in development and leadership, that vision was scaled back, but you can still see the traces of it  making DS2 feel bigger and different in scope compared to its predecessors.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for a combined total of 150 hours across PC and Xbox all to prove the haters wrong. I can say, after all this effort, the haters are absolutely correct. Every single critique you've heard of DS2 is true to varying degrees and the game only picks up in the latter half after hours of just kinda bad gameplay. That's the worst thing about it, it never gets so bad it's a spectacle, it's just bad enough to be frustrating. Why do I recommend this? Drangleic Castle and so many other late game locations are absolutely worth the effort to get to. Not in spectacle alone, they're fun to go through as well. Just bring a crossbow and use it constantly to lure out and pick off enemies, cheese every area you can because the game is actually designed around it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know it gets alot of hate, but its undeserved, in my opinion. Its just... different. Lots of bosses, and the game seems longer, but that aint a bad thing. Not my most favorite FromSoftware game, but its nowhere near a sbad as all the hate... Majula..... 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dubby game even though DS1 Remastered & DS3 have better controls and menus. You have to get used to it a little but once you do the lore, difficulty, and cool environments will keep you engaged and having fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda cluncky with some pretty shit features like the adaptability stat and your hp getting halved as well as some pretty forgettable bosses but overall still very very good and fun. Wouldnt recommend as first fromsoft game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best of the trilogy. The hollowing mechanic is rough but no more so than Demon's Souls. Combat can be a little off at times, but is outweighed by the build variety. ADP isn't actually the worst thing in the world but a little puzzling of a design choice. Only one zone really annoyed me but otherwise, this game is really the most fun for me of the three. Fortunately, some of its design choices seemed to have bled over into Elden Ring, thank goodness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All the negative reviews are paid agents from big pharma. Don't listen to them. There is no such thing as Dark Souls Remastered or Dark Souls 3. This is the only Dark Souls game you can play on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unironically the best souls game in my opinion, play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but there are some flaws regarding the game's design in comparison to the rest of the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far i like and dislike the game for many reasons... The game looks good and is kinda fun.. sometimes..\n\nIt would need hella quality of life upgrades to make it better, \n1-Remove the health bar chunks getting cut every death... \n2-Rebalance some enemy spawns some areas have way too much for way to small spaces... \n(they kinda did already but some places they added some npc that wasnt in the area or was later in the area in og)\n3-Make us able to drink flask walking... \n4-Make it possible to login offline like DS1-3....\nOther than these problems i find the game alright.. id say DS3 best DS1 middle DS2 whorst...\nThe game should have a remake to fix the old problems.\nIm still gonna play the game cause i payed for it... but as is im not gonna enjoy playing it as much as DS1-3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst experiences i've ever had, insufferable from the beginning to the end, it water clear that every part of this game is made with the only and unique intention to piss you off. You have to play it to know what it feels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Terribly under-rated. This is peak Souls, desperately depressing and grind-worthy. Very flexible build-wise and the world can be tackled in many ways/paths. This game is exhausting in a good way, you live it and die by it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After Fully finishing this game i can safely say that this is the by far the best souls game of all time! I love how when i  do too many inputs at once my character stays still and gets touched! This game really captures the mental anguish that comes with playing souls like games. 10/10 would sacrifice my time again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I broke my joystick while playing. Definitely a good game! \nDLC seems a bit drawn out, but it's tolerable. \nWorld is quite large and Its missing some small details, \nbut it doesn't hinder the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean, its like okay. Worth playing but I probably wont be playing it again anytime soon...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game way back when I was just getting into the Souls series back on last gen Consoles, where the FPS being above a certain amount would start shafting the durability of your weapons. I was new to Dark Souls, and was unsurprisingly awful at the series for my 1st playthrough. And yet, despite literally playing what people say is the worst Souls game Fromsoft made, I fucking adore this game.\r\n\r\nYeah- Elden Ring exists, and I'm not gonna go so far as \"Dark Souls 2 is actually the bestest game\" but fuck I'd be lying if DS2 wasn't worth the higher highs and lower lows. To put it simply, this game is like a rollarcoaster, for every good quality there's a middling or outright ass quality. For example, DS2 has the most build variety barring maybe Elden Ring, but playing a Hexer with a Dark Chaos Rapier is objectively the strongest build overall. Or how some of the sickest boss fights in the Souls Series (Like Sir Alonne or the Old Ivory King) is here in DS2, while also sporting the easiest bosses in the franchise (Looking at you Giant Lord.). Even so, I argue Dark Souls 2 has enough good to outweigh the bad.\r\n\r\nA personal high point for me, which feels like it represents the game is the weapon type Halberd. It's my favorite version of the weapon type in the series, it has a sweet spot mechanic that forces the player to space good for the best damage, and it can carry you through the game if you treat it right. It's also an awful weapon type due to it's moveset, consisting of telegraphed overheads for it's 1 and 2 handed attacks by default and only getting sweeps on the running or follow-ups. And yet- it is my favorite fucking weapon (Mastadon Halberd my beloved.) with no substitutes. It represents this game perfectly to me, when it hits my God it's literally peak barring Elden Ring, but you gotta give it a chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the first two hours of the game I kept rushing in and dying so I decided to take on the enemies slowly and not rush through the areas as much and it was very easy from there on and much more fun. 3/10 difficulty, 4/10 bosses, 8.5/10 game and 9/10 expansions/dlc. Very good game overall and I will probably go for 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark souls 2 probablemente sea el videojuego mas gracioso que he jugado en mi vida, no hay una sola decision de diseño en este juego que sea amigable hacia el jugador, cada momento que pase jugando este juego fue en pura agonia, pero al mismo tiempo es un juego divertido y que hace compromisos para ser honestamente, el juego mas unico de la saga souls bourne, apesar de compartir nombre con el juego anterior de la saga.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game can be fun only by using the ( center Deadzone mod ) for controllers which fixes the clanky movements and camera control.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are a fan of the first Dark Souls, this game is a fantastic experience provided that you level up your ADP stat as early as you can and get your Agility up to 100. In my opinion, a flawed but extremely good and satisfying game just like the first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game that I can fully recommend to everyone - do not skip it even though people might try to recommend that to you.\r\n\r\nGame is different compared to DS1 and DS3 so you have to be prepared for it.\r\nLore centered much more around a player, the curse, npcs and their journey through drangleic for their own answer for the curse. Here the game is already different compared to the rest of trilogy - the myth of chosen undead/ashen one is replaced by much more personal story.\r\n\r\nGameplay is much better compared to its prequel - has its flaws but is still unbelieveably better. In the end - this game has inspired a lot of their future games, especially Elden ring.\r\n\r\nGame was pretty ambitious by looking at what it supposed to be but the time restraints and limitations of (at the time) consoles did not really help the already problematic development.\r\n\r\nStill, like I said, game is fun and if you are looking for great Souls experience this game is surely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this when it first came out, and it is \n\nStill a great game but....\n\nI forgot and did not miss the mobs at all!🤣\n\nDespite the flaws of DS2, it's still top 3 on the Darksouls series🤣",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At this point, I've played most Fromsoft games, and I feel like I can give a meaningful review. Maybe. Take it with a grain of salt: DS1, 2, 3, Bloodborne, and Elden Ring (minus the DLC).\n\nThis might be long, though I generally write as stream of consciousness. Forgive my rambling.\n\nThese games aren't about difficulty. Sure, it enhances the game, but if your sole reason for playing this game is the PVP or the bosses, fine, I guess? But really they're more philosophical if anything. Eat some hot sauce if that's your thing. Or touch grass. Anyways.\n\nDS2 iterates on its predecessor in that it elaborates what it means to be human, and the purpose of existence itself. In my opinion. [Spoiler] The first sin is Gwyn linking the fire because he went against the nature of things, which are cyclical. He broke recursion of light to dark and prolonged fire, which is to say civilization. [/spoiler]\n\nIn a sense, Dark Souls and Fromsoft games in general are concerned with religion, myth, and are our modern day version of the Illiad, or Odyssey, etc. That much is clear to me. But that does it a disservice, in a sense this is a form of art. The beauty of Dark Souls is it doesn't hold your hands, but it's fair. You have the choice to interact with the NPCs, to learn of the world. Or maybe you won't. You can do a strength build - a mage build, whatever. There are ways to make the game easier or harder based on that playstyle, and typically, it's the barrier to entry that makes it difficult.\n\nAnyways, gameplay, because obligatory. When you understand the core basic mechanics of the genre, it becomes a lot easier - allocate stats, put on armour, upgrade armour, upgrade weapon, scale with highest stats. The mechanic people don't like, hollowing, can be avoided by just by putting more health to offset that gap. The game sells plenty of anti-hollowing stuff later, and it's really pushing a feeling on you. If there's a boss you're having trouble with, explore elsewhere. There is subtle telegraphing, and more often than not, if you're bashing your head against a wall, try a different angle. I think you can re-spec your character, or can learn to, 5 times? That's another thing, so you're encouraged to experiment. You can equip multiple spells to increase usage, and you can use consumables to use more spells as well - spell-casting is a lot more fun in this game than in a lot of others.\n\nOne of the spots I had most trouble with my play-through was because I did not explore the windmill and kept brute forcing the auto-health boss. I explored, discovered how to stop the auto-heal, and it was much easier. I'm keeping it vague because spoilers, but if you've played you know what I mean. That is precisely the feeling it's going for - hopelessness, and then triumph when stepping back. It tells its story through setting, environment, and aesthetics.\n\nIf this is your first game, come back once you've played a different entry to dip your toes in so to speak. Or dive in, either way, I can see on both sides why people find this divisive- it really boils down to how you interact with media, and therefore I cannot recommend this to most people, not out of an elitist mentality, but simply because Dark Souls doesn't explain itself and is sort of an anti-game, in the sense that most work with and for the player, where Dark Souls is actively challenging you perspective-wise.\n\nPerhaps I missed the point. I can accept that. In any case, I finished the base game as of this review, but I definitely plan on trying the DLC at some point. ([strike] I did not do the ending because you restart from the beginning if you do that, and I want to do the ending once I've beaten the DLC. That's also a thing [/strike]) If you finish the game, you can choose whether to restart. Regardless, if you like Dark Souls 1 & 3, you might like Dark Souls 2, though maybe not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not the best game Fromsoft has ever made but it's still a great game and still better than Elden Ring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game play is good but i have an issue when i go to level up my stats its only stuck on vig cant able to level up other stats help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game, nay, masterpiece is something that ANYONE can enjoy.\nTo those who say \"It is the worst souls game ever\" - You probably played ER as the first souls game.\nTo those who say \"There is so much Jank in the game\" (yes, there is) You are definitely overlooking where the areas where this game outshines the other souls titles. \nAnd to those who say it is too hard, i would love to recite the words our Brothers and Sisters in arms alike \n\"GIT GUD SCRUB\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first the game is janky and takes some time to get used to but once you get passed the rage inducing enemy placement, the game really opens itself up and you can see what this game really has to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some parts of this game have such dense atmosphere that this is the Dark Souls I think about the most.\n\nThere are fundamental game design issues that happened between trying to improve the original release with Scholar of the First Sin. Leading to neither version being definitely better than the other.\n\nThis game resonate with me extremely strongly, but I know in a replay that it's faults will sting harshly. \n\nIf a remake was ever made that fixed its faults without compromising the atmosphere and feeling, it would be unreal.\nEither way I will likely either play this version or the original release version again one day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game felt like torturing myself for 26 hours and I have never uninstalled a game after beating it faster than this one. 7.5/10 good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Biggest Dark Souls game. Most weapons and armor. Most bosses. Best PvP. Coolest environments, although I do love the first Dark Souls as well. This one might be more open, but it's very good as well. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls 2 feels like it was actually the first attempt at Dark Souls, but has two major benefits of the developers not hating the player's guts yet and the game is actually finished.\n\nSome design choices are a major step down when compared to Dark Souls 1, but in the end it is much better than people would have you believe.\n\nHard to recommend to newcomers of FromSoft or the Souls genre as most of the game's highlights are near end-game/at post-game, but it is a good time if you can stick it out.\n\nThe bad:\n\nThe legendary atmosphere the first game is just missing.\n\nMuch weaker environmental storytelling\n\nVendrick and the other major players aren't as clearly highlighted as Gwyn & his lords.\n\nThe combat feels less meaty, more flaily, than the first game.\n\nThere are tons of 'dead' level ups that you need to do in order to get utility points.\n\nMore throwaway bosses than in the previous title.\n\nThere are some difficulty spikes-here-and-there, but before the post-game, this entry is significantly significantly significantly easier than its predecessor.\n\nThe good:\n\nThe checkpoints are, for the most part, not hidden and are much more plentiful.\n\nStill some issues figuring out what to do to advance, but not nearly as bad as its predecessor.\n\nMost areas between the boss and the next checkpoint are rather short and easy.\n\nMulti-boss fights have more openings to interact with opponents\n\nTitanite slabs are much more abundant.\n\nThe post-game content is better than pretty much anything seen in DS1 (save the first half of the Artorias DLC in DS1).\n\nBosses' hitboxes and animations are much better aligned here than the previous title.\n\nThere is some BS, but nothing here is as terrible as Lost Izalith or the Tomb of Giants.\n\nAfter beating the game you'll want to beat the ENTIRE game again, rather than in DS1 where you want to repeatedly just finish Anor Londo then restart.\n\nStill beautiful, still Dark Souls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing addition to the Dark Souls series, might feel weird compared to the 1st one, but it has it's own qualities. Had a feeling I was breezing through the game, before realizing I was only half way done (not counting the DLC content). I'm looking forward to the other installments from the same franchise, even though I'm playing as a \"boring\" knight class. All in all, a great experience at times frustrating, but very rewarding. \r\n\r\nPS: You can heal much more and this game felt much more forgiving than Dark Souls 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The first sin is a very interesting concept, and I was fond of studying it in this \"video game\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This one may very well be the best.\nPeople tend to forget how utterly broken the first Dark Souls game was (I myself have too), and since this game unfortunately still has massive problems (mostly hitbox related like in DS1, and the agility stat doesn't help it even though it is adjustable). This game is also less forgiving than DS1 and 3, i.e. you cannot just run to the boss gate and have the animation save your lazy bum (you kind of can in the original version, because it has less enemies), which I actually used to dislike myself, not anymore though. I still kind of enjoy playing it. Maybe I just like broken games.\nOne huge problem this game has is that it has items that can only be obtained through online play. The Ring of Thorns +2 is a great example, which requires the player to invade 1000 (!!!!) times and win. This game is dead (at least the official servers, not sure about the custom ones) so this is basically impossible, especially at higher levels (my main character is at SL262 with ~20M soul memory, so basically I am unofficially banned from playing online). The invisible weapon rings are just painful to get.\nNot going to talk much about the level design as people know how dumb it is.\nAnother small problem is that the player character doesn't seem to be entirely ambidextrous (but is still ambidextrous, in DS1 and 3, holding an axe in your left hand will block with the axe, and holding a shield in your right hand will start attacking with the shield, which is completely dumb). For some enemy types (I only tested two, with slash damage) the left hand seems to deal less damage than the right hand. Blocking with shields takes the same amount of stamina with both hands, but holding a shield with the right hand seems to block less damage. This is a problem with inventory management, mostly.\nAlso, I hope the person who decided to show controller mappings on PC doesn't work on PC games anymore. I'm sure he was also the genius behind the double clicking idea as well, which has to be enabled and disabled each time you launch the game, because they refused to fix this bug, if you don't want input delay. You couldn't even do anything about it in the original DS2. Not to mention that you enable *disabling* double clicking just to confuse you. There's also this bug where it occasionally makes your character do a 360 spin and push you a *lot* to the left if you press the left strafe button while running (not sure if this happens if you try going to the right, never noticed that) which is extremely annoying near ledges and on bridges.\nThe camera being moved to the right when the inventory is open is an interesting concept, but makes walking while switching items annoying.\nBalancing is actually very good (except for Iron Keep, which is a bit overkill to be honest), some buffs are are a little bit overpowered, there are still ways to one shot bosses, but it's still mostly balanced, especially PvP (or maybe I just didn't get enough minmax builds). This is also the only game which is beatable by only leveling strength and not using any weapons. It took me around 9 months but it was possible without armour as well. Beating the Asylum Demon with only fists was enough for me in DS1. Took 15 minutes each time I tried because I always messed up in the end. After Firelink Shrine, that's annoying. And yes, Shrine of Amana was as great as you can imagine.\nBonfire ascetics make replaying the game much much more enjoyable as they allow you to fight your favourite bosses without having to replay the entire game again. Doesn't restock shops, which sucks, but it's still better than nothing.\nThis game also looks the best. DS1 and 3 are very ugly in comparison. DS2 is just stunning. It is also quite colourful, unlike 1 and 3 which have an unrealistic limited colour palette.\nIt truly deserves to be called Best Souls II. It really doesn't deserve all the negativity it gets/got.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There are a lot of problems with this game but also a lot of good things. The areas feel very alive, though sometimes that means too many enemies and the ambience was very nice, especially Majula. The graphics were better than I was expecting and there were some fun bosses. I would recommend this game to people who enjoy punishment or have extreme dedication. 6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a FromSoftware game that Miyazaki wasn’t working on, and you can tell. The game gets a lot of hate, and some of it is deserved. In this game, there’s a stat called Agility that controls your i-frames, so you basically have to level it for the game to be enjoyable.\n\nThis is the weakest Souls game, but the worst game of a perfect series doesn’t mean it’s bad. It’s still a great game, and you shouldn’t listen to the bad reviews—it can be a lot of fun if you level up Agility. The bosses are unique and fun, the areas are pretty cool, and the DLC was also a joy to play through.\n\nGame: 8/10\n100%: 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lit, but mad glitches and enemey placment could be better but still peak game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This souls game has by far the most memorable and melancholy atmosphere and characters to me. I have yet to find a game with a mood that sticks in my mind as vividly and as long as this game's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They told me this is a bad game. So far I have really enjoyed it. Only thing that bugs me is the fact that your healthbar gets smaller when you die. But the solution to that is: just don't die lol.\n\n\nAlso back up your saves. This has no steam cloud saves. Learned the hard way..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very good, but very underdeveloped. \nA ton of niche gimmicks, cool features some weird details. \nA massive amount of content. \nBut everything is put together rushed, almost randomly. \nWhile some bosses have an amazing number of attacks, the AI is insanely dumb. \nThe game lacks playtest and maybe a year or two of development time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Newcomer to Dark Souls/Soulslikes. I have been rampaging through all of the games. I started with Elden Ring, then Sekiro, then Lies of P, then Khazan, AI Limit, and all of the rest, save Bloodborne and Demon's Souls because I am PC only... Just recently decided to take the plunge into Dark Souls and Dark Souls 2. Loved 1. And now that I'm about 10 hours into 2, WOW, what a game. I heard so much hate about this game but I don't get it. I am loving Dark Souls 2. It is a little annoying that you have to level the ADP stat to get more iframes/roll distance, but it really isn't that bad if you just grind it out early. The game mechanics are great, the enemies are cool, the bosses are cool... THE GAME IS COOL. Don't listen to the haters. If you're a fan of Soulslikes, BUY THIS GAME.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game honestly gets a lot more hate than it deserves, it's a pretty decent game for being the \"worst\" souls game in the series, but I managed to enjoy it despite its many flaws. \r\n\r\nHowever, some of this game's choices feels like a fucking mistake. Whoever thought the Smelter Demon was a good boss should be executed, whoever designed Shrine of Amana is fucking evil and needs a welfare check conducted on them. I love walking two feet then getting spellsniped by squads of mages who have aimbot.\r\n\r\nStill, even with a pretty subpar boss roster and kind of bad areas, it's still worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best souls game, only downside is skill issue and they won't make a remake that brings it to modern graphics.  Elden ring is basically a remake but not as good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Souls 2. Some prefer base and some prefer SOFTS, both worth your time and one of the few games I will keep coming back to replay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nota 78/100\n\n\nDark Souls II é curioso na minha jornada pelos Souls. Foi o primeiro que joguei, e dropei, e o último da trilogia que finalizei.\nDesisti na época por achar muito difícil, mas anos depois voltei determinado a fechar a franquia e enfrentar um chefe que sempre me chamou atenção: Sir Alonne, cuja estética achei incrível e diferente da melancolia típica da série.\n\nRecomecei com um personagem de destreza, meu estilo favorito, mas perdi meu save com mais de 40 horas após um problema no PC. Refazendo tudo do zero, aprendi a dominar o ritmo de combate, que é bem diferente dos outros Souls.\n\n\n Pontos ruins\n\nEstus lentíssimo. O personagem demora 354 anos pra curar, e só melhora com Adaptabilidade (que ainda teve o nome traduzido errado).\n\nExcesso de inimigos. Muita área entupida de mobs sem sentido, principalmente nas DLCs. Torna a exploração cansativa e chata. Acaba forçando você tendo de agrar inimigos com arco de longe\n\nSoul Memory. Péssima ideia: limita o co-op entre amigos ao invés de balancear automaticamente como nos outros jogos.\n\nFrames e ações inconsistentes. Rolagens e ações básicas não garantem invencibilidade, o que gera muitos golpes “fantasmas”.\n\nDebuffs confusos. O sistema de veneno e maldição é ninguém que eu conheço entende como funciona aquela barra esquisita que aparece lá pra medir o debuff.\n\nPontos bons\n\nRamos Perfumados. Itens limitados que criam boas escolhas.\n\nFogueira da Adversidade. Permite refazer áreas e bosses, ótima ideia para quem gosta de repetir desafios.\n\nEmpunhar duas armas iguais. Exclusividade dentre a trilogia é divertida que deixa o combate mais variado.\n\nMagias - Tem uma variedade maior de magias no geral do que nos outros jogos.\n\nMesmo com todos os defeitos, Dark Souls II me divertiu mais que o primeiro. É um jogo imperfeito, mas cheio de identidade, e que merece ser jogado por qualquer fã da série Souls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can see why this is the one that DS fans hate...  flaws are there but still I would recommend.\nA quick rundown (since to be honest I forgot to leave a review just after finishing so my mind might play tricks on me...)\n- death penalty (obvious one), I guess there is a reason it never returned in later titles, just feels unnecessarily punishing\n- world design, again an obvious one is the infamous lift to 'iron keep' - in general the way levels were structured it sometimes feel You play a 'mario' game where You just move from World 1-3 to World 2-1 type of experience, while You would expect a seamless  and fluid transitions as is typical for soulsbournes.\n- stats are stupid, again a known issue, adaptability/agility... and separating vitality as the equipment load stat from endurance\n- if You want to get to experience the full game - use a guide .... this is something I've experienced in all souls titles so far (DS3 is still pending on my list), You basically should choose if You want to have full immersion or 'do-all-see-all' type of run...again I tried to limit reading guides and it ended with me missing the actual title boss...(scholar of the first sin) and it's just because of specific boss kill order I did... I mean that is fcked up :(\n\nThere are some obvious good stuff they added (compared to DS1) - proper power stancing, proper fast travel, good enchanting/infusion system. All in all it's a very enjoyable game (the core of what makes a these games great is still there) but hides a list of issues that cannot be neglected.\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another good fromsoft game, lots of fun if you like DS1, DS3 and Elden Ring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting 100% achievements is a terrible experience in this game (NG++ is painfull). Other than that it's pretty good. The weapons and armor sets are great in DS2. New mechanics are mostly sadistic and frustrating. Overall, Dark Souls 1 is a better game, but Dark Souls 2 is still worth playing, even NG+ is fun. I don't recommend a 100% achievents run though. It's really not worth the grind and frustration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great RPG! Hard but beatable. Just enough upgrades along the way to get you through. Give it a go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just as good as 1 and 3. I have sunk the most hours into this one.  The fans who hate on it are wrong. Just level up adaptability every now and then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, tbh at first it was more of a hate relationship. \r\nBut after some time ... I somehow felt in love with DS2 too. \r\n\r\nThe stamina management feels kinda off. But you get used to it. Some mechanics are really really fun. And the bosses are - at least most of the time - great! \r\n\r\nIf you're a souls fan, just give DS2 SOTFS a try.\r\n\r\n(:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well of course I recommend it. It's my favourite Soulsborne game. Initially playing it on Ps3 a ton, then Ps4 when SotFS released.\r\n\r\nIt has the a lot of variety for enemies. 3 has a few more and Elden Ring just copied enemies straight from 2 and 3 so it doesn't get any brownie points. This was the game that introduced Power stancing, an absolutely great ability. Every build is pretty 'viable' in this game, and everything feels pretty good.\r\n\r\nBosses are actually varied (Looking at Elden Ring) and usually unique. The story is very well written and presented in this game, plus the locations are grim and you can really see the corruption taking over. Except Majula.. beautiful Majula, the only place we need.\r\n\r\nIf you're worried about lack of weapons and armour, I wouldn't. 3 and ER probably have more, but the sheer amount of items in Ds2 is literally insane. The fashion is great too!\r\n\r\nHowever even as a true Ds2 lover, and glazer. I recognise it's faults, and there are many.\r\n\r\nFirst is obviously the most heard, Adaptability. Tying i-frames to a skill is a very non user-friendly choice. Second is the one I battled the most back in the day, Co-op being tied not to level.. but soul memory. If I decide to farm an enemy for some armour and my friend hadn't guess what? Can't summon until they get those souls too. Ring helps this but is still present.\r\n\r\nThe game is very clunky. It is also quite old, but it's still something I have to, and do recognise as someone who recommends this game. You are slower in this game, 3 and ER spoiled people with their anime movesets and all that bs. The hitboxes are also quite poor. You aren't abysmally slower but:\r\n2 handed weapons feel like a 2 handed weapon. You're lugging a lot of weight. Rolling is still quite fast, but it's more imo realistic and nice feeling. Estus Drinking forces you to stop and is super slow, restricting panic heals. Looting is also quite slow.\r\n\r\nAside from these ^ the rest of the issues I would say are quite minimal. But most of the hate for this game, really is artificial. People on the Internet *told you* it was bad and you believed it. But people who actually played it, recognise it as a good game. So have an open mind with all I've said and give it a try. If you still don't like it, then it's fine it's not for you.\r\n\r\nElden Ring ruined the Franchise >:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is no where near as bad as people have said. Its a very experimental game, there's a lot of bad and good design in there. Overall it is worth a shot, it may take a few tries to get into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After ~60 hours and making completing the game, it is clear that this game has been grotesquely underrated by the insipid copy/paste mainstream-gaming-media, followed by group-think YooHooToober \"game reviewers\". (I cannot imagine how much grief Tomohiro Shibuya and Yui Tanimura must have endured at the hands of these NPC game-reviewer dorks).\n\nPros:\n- Locations are both wildly varied, stunning and oozing atmosphere\n- Music, though sparse, is wonderful\n- The pacing of the first 80% of the game is excellent and very satisfying\n- Excellent variety of weapons\n- NPCs well written and voiced\n- Enemy variety broad and imaginative (though generally less intimidating than those of DS1)\n- Excellent hub-world that doesn't feel like a cliche hub\n- Difficulty ramps smoothly in first 80% of the game, making you feel ever-so-slightly behind the curve / under pressure at all times\n- Full of pleasant surprises, such as some enemies fleeing when you're holding the blazing torch\n\nCons:\n- Adaptability stat throws an unnecessary wrench into the game's mechanics\n- Areas appear grand upon first encounter, but soon feel small once progress is made. Areas are more bite-sized than DS1\n- Bosses are easier and less intimidating than in DS1\n- Combat is clunkier than DS1, with large \"I'll just wait here a moment while you cleave me open with your sword\" windows of time for the enemy to punish you\n- Locations, though beautiful, are less intimidating in their scale than in other DS games\n- Parrying is less encouraged than in other SoulsBorne games, and when you do complete a parry your R1 attack is far far far less satisfying than in DS1\n- Late game levelling becomes an absolute chore, with disappearing enemies, and difficult to find weapon upgrade materials. Making this section feel more like a job than a game.\n- The pacing of the latter 20% of the game is a huge letdown. The final boss sits waiting for you in the mid-game area of Drangelic Castle, which robs the final confrontation of any sense-of-occasion. There's no hard-won battle to reach the boss, and therefore no gravitas. (The Throne should have been placed in a mountain-top castle, with a gruelling uphill gauntlet to fight through, filled with new enemies that train you to develop the skillset necessary to thwart the final boss, while building up a sense of intimidation via the perception of overwhelming odds, such as a lightning storm atop the castle that worsens as you approach, and eerie music full of diminished chords)\n- DLC is resentfully cheap and difficult (I suspect the devs were upset about the game's initial reception and sought to prove themselves by way of difficulty-spiking the DLC with cheap lock-you-in-an-area gauntlets full of projectile-enemies that curse and mob you).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For all the haters THIS GAME IS PEAK FR, ye ofc the first time i played it felt it was different and the hitbox is a bit shitty but aslong u play u will enjoy it and like it, this game made me feel i was in a long journey and i love it , way bigger than ds1 and ds3 but yea.. some bosses i ask why are they even in this game but dosen't mean they bad some as cool designs, its not so linear as ds1 and 3, i would say 7/10 maybe more who knows😎",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most fromsoft peak we deserved 10/10 masterpiece better than Elden Ring and Bloodborne anyone says otherwise f u casual git gud..!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Коротко о лоре игры:\n-Когда, знаете, мы… календарь… майя… и… нет, мы не будем… спички, консервы… Далай Лама… Свет не будет… фотоны, фонарь, включил… Кто? Никого!.. И когда ты сидишь… и Кто? Аллё… Ничего и… страшно… Но, каждый человек… прежде всего - двадцать восьмой год… Когда… мы не будем запускать и… а потом оп – пресса… и что?.. Никому никогда ничего не было нужно.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "beautiful please play, very easy, don't play if you want a challenge, just a story tbh no hard bosses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AFTER ALL THIS TIME DARK SOULS 2 IS TO ME..STILL A MASTERPIECE. The depressing tone is its own way has been some of the greatest healing for me. Durring Long hours of brutally unforgiving gameplay, I found myself gaining deeper understanding of the dark nature of loss; and within that loss a kind of overcomness of my own grief and anger. Against so many Daunting foes, some colossal, some terrible in their presence,; and the ever evolving layouts of various combatants,  unassuming small traps, and literal dead ends, and each memorable. the Land of Drangleic offers a semless dungeon crawl that was honeslty lost in the open world of Elden ring. I personally am hopeful for a return to this style, but even grander. Until then I'll still be happy fighting The Ancient Dragon in DS2 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think I've played the pirate version of this game for more than a couple of thousand hours... It's the best in the series for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game kicks my ass and holds my souls for ransoom.\r\n\r\nGone hollow multiple times so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DS2 is a measurement of someone's character. If you see someone doesn't like it(or hates it) you can't trust them with anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls 2 has a rather poor reputation in the Souls community, which is why I would like to address several points.\n\nOn the one hand, the difficulty level is quite high, as it was in DS 1, but this is less due to the bosses and more to the excessive number of enemies. In addition, the character stops moving when healing and remains vulnerable when stuck in animations, such as when entering a wall of fog. Why it is often necessary to kill most opponents instead of simply running through them. \n\nOn the other hand, there are more ways to heal (life stones) than in the previous instalment, and teleporting from A to B is also possible from the start. Most of the areas look very nice, but often don't really fit together in terms of meaning. The soundtrack is (similar to the visuals) beautiful, especially in the starting area ‘Majula’.\n\nIt is also important to know that you have to invest skill points in the ‘adaptability’ stat to improve the invincibility frames of the roll and the speed of healing. If you don't know this, you will be very frustrated when playing. Furthermore, in the event of death, you lose part of your HP, but this can be negated by an item.\n\nAs usual, the story is not easy to follow, as it is only told in fragments. \n\nAs in the first part, the controls take some getting used to, but this improves with a little time. \n\nAchieving 100% completion was grind-heavy due to the necessary Covenant items, which unfortunately drags on. \n\nThe replay value is moderate. I would buy it on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than Dark Souls 1, similar to Elden Ring, Comparable to Dark Souls 3 pvp. You nerds are brainwashed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Failed miserably at ds1 went over to this instead and was able to put in 7 hours in this one its peak still",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still get war flashbacks of the Frigid Outskirts in the Crown of the Ivory King DLC",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game really isn’t as bad as people say. It definitely has some great highs, but its lows are about as low as the trilogy gets. The entire design around the game’s “difficulty” feels so artificial that it will genuinely make anyone extremely annoyed and frustrated at some point. Overall, I’d absolutely recommend playing this game—especially to get the full experience of the Souls series. However, my review and opinion have been somewhat tainted by the constant and incessant spam from DS2 glazers online, to the point where it actually changed my views on the game and made my opinion of it harsher.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Not a bad game and it is def better than general opinion is BUT not by much and i just cant recommend it. There is lot of bad decisions in this game what is reason why they went back and revorked it in DS3. There is no point to play this game unless you are huge fan of DS games or and have no life like i ... LOL. 6/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is like an 8/10 burger but they burnt the sh!t out of it and called it a delicacy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not as enjoyable as the first one. For one, fighting with lock does not worl properly here, due to that the lock is switching while fighting multiply enemenies, which you are doing a lot. \r\nSecond: There are a lot of enemies to fight at the same time, which wouldn´t not be a huge concern, but somehow it all feels kinda meaningless and lonesome.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is the reason for all my pain and suffering, as a keyboard and mouse user, i want to slit my wrists.  When I first played I had to go on controller,  IT WAS THAT BAD.  ALSO.  WHY THE FUCK DO YOU HAVE TO UPGRADE FUCKING DODGING. The bosses aint even that bad its just whenever I roll and get touched midair i want to kill myself. I have a hate relationship with ds2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is worse than Dark Souls. Even the start is so bad, where you first run to old ladies and only then choose class and items just appears from nowhere. But XBox series keys on keyboard? Really. There is noone in devs team that know on pc you use keyboard and mouse. 60 fps lock on PC also shows how bad devs are. Without their Master fromsoftware is a bunch of junior programmers that have assests from Dark Souls 1. No imagination, no skill.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Trash, sadistic and terrible game design.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like the story, atmosphere, enemies are cool, weapons and armour are cool and I find almost every character really interesting to learn about.\n\nBut omg I hate how easy it is to get lost in this game when it barely tells you to begin with which is the right way. And it's not like Dark souls 1 lost since you can eventually find out where you're meant to go, but i cannot get anywhere without looking up a guide to find out where is the way to the end of the game. I remember I went to go talk to some npcs to figure out some clues on where i need to go and one literally just tells you to go east to fight something, as if you have any sense of direction to begin with (never mind the norths, souths, easts and wests).\n\nI also find it quite frustrating how you can have certain areas where it feels like there are far too many enemies with the amount of damage you can take in this game. There's some points when you could be looking at over a dozen enemies at once all attacking you at the same time, or having multiple ranged enemies out of reach while you're trying to fight some ground enemies that are in your way.\n\nThere are also some trap areas that are impossible to dodge, so you have to hope that you can make it through with enough help and enough luck that you can either heal or just not run out of health before getting through the traps.\n\nHaven't completed this game yet since I only just found out i had apparently been going the wrong way and didn't need to go where I'm at now. And let's just say I'm relieved because this area has a boss battle that has multiple enemies in it that'll fight you with the boss *UNLESS* you backtrack that entire section of the game again to find helpers that'll make the boss fight much easier than without them. It just feels like it's unnecessarily making the game longer than it needs to be.\n\nIf you're into dark souls as a whole, i think you'll like this. But I can't recommend it based on my experience as it can drag for way too long and be difficult in a way that I just find way too annoying. (I've considered giving up and moving onto dark souls 3 prematurely as i've heard it's more similar to dark souls 1).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shitty game purposefully making your experience bad.\r\n\r\nPlay if you are a masochist, and even if you are try to be aware of controller damage inflicted by yourself",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shitty game, worst thing I ever played.\nJust did the 100% to trashtalk that shit and confirm the obvious truth!!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolute kusoge.\nYou ever play a game for 50 hours because people keep telling you it gets good but it never does?\nLeveling a stat to get a basic FromSoft game function, dogwater enemy placement, bad level design, boring bossfights and straight up not working hitboxes. Fully convinced people like this game as a meme.\nThe only thing this game has going for it that it can be very pretty at times.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This is the best Dark Souls game trust me bro you get guns in this one. The director also ego's the fuck out and tell you, you're gonna die alot HAHAH, yeah this game is eats shit alot! BWAHAH hja bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Play Dark Souls Remastered or Dark Souls 3 instead. Best games of all time.\nBut this game is dog sh!t.\nSuper janky, hilariously poor enemy Ai, poor combat mechanics, and overall bad game mechanics that don't exist in the other Dark Souls games. Simply not a fun experience. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game isn’t that great. It has some fun moments, but overall it’s kinda disappointing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a terribly designed game. There is no denying this. I did enjoy my time with it though (all of which was on playstation). If you want an in depth look at how bad it is, watch MauLer's \"in defense of Dark Souls 2\" series. And no, do not come complaining to me about \"b-but the videos are too long!\" or \"but...i-i liked it!\"\n\nThat's just embarrassing for both of us.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to see for myself if Dark Souls 2 was really that bad, and it was worse. The game itself could've been great, it has a solid foundation, a beautiful world and just really cool locations in general. The problem here arises when the mechanics of the game just aren't good at all. The ADP stat is one of the dumbest things I've ever heard of, the hitboxes in this game are abysmal, I have to lose health every time I die, the movement is floaty and doesn't feel smooth at all. These are just a few reasons that the mechanics of the game are poor. But despite all of this, those reasons aren't even the cause of my distaste towards this horrid game. Why on god's green earth does every single area feel like a goddamn 5 year old copy and pasted the same enemy type in the most random and abhorrent positions, that make no sense, beyond just serving as an annoyance to you. Every boss run back feels like a chore, and it doesn't help that I get no I-frames when moving past the fog walls, so I'm essentially dying 50% of the time, just to either get to some horrid boss that is literally a punching bag, or some disgusting badly designed boss that just serves the purpose of, again, being an annoyance. I beat every single boss in the game, and I have to say, the ONLY time I actually had fun in this game was with Fume Knight and Sir Alonne, everything else was a disgustingly poor imitation of what the first game did for the series. Like a lot of other reviews state, this game certainly has charm, but what purpose does charm serve when the game is this bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is every negative quality of Souls games amplified to 100. Do you love a fun challenge? Well there's none of that here. Just tedium and frustration. The few good additions present here are just so hopelessly outclassed by the multitude of terrible ones. Worst feeling gameplay in the series, most purposeful BS, least enjoyable package. Do NOT let the resurgence of love for this game fool you like it did to me. I would not spent money on it if I knew what it would actually be like firsthand.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just wanna say i love this game! but it's a love/hate. It's just i cant recommend this game to other people. Except people who just love dark souls and wanna play the whole trilogy. This game has some good aspects but it also has some bad ones. The bosses are pretty bad in base game except Lost Sinner and Dark Lurker. (Dark Lurker is a secret boss too so not mandatory) but the DLC's did improve and made the bosses alot better for the most part! Especially in the Iron King DLC. but the path way to get to the bosses are usally alot harder then the bosses themselfs. The combat feels more clunky and less polished in this game then the first or third one. The open world aspect in this game is just as good if not better. But it's just too bad this game doesn't play as good as the others. So if your planning to try out the dark souls series. DON'T START WITH THIS ONE. I reccomend starting with the first or third one before playing this. There's a reason why this game get's the hate it get's from the souls communities and it's deserved if you ask me. I will say that i think it's STILL a good game since it's dark souls but it's only for the die hard fans of the series i think",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is artificially made difficult. Enemies are spammed everywhere and are designed to overwhelm the player, hit boxes suck even after you level ADP to get you I-Frames at the regular level, bosses are boring and poorly designed, and the multiplayer just doesn't work properly. Wouldn't recommend this game to any Souls fan. Play DS1 or DS3 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the most avant-garde of the Souls trilogy. A real Scattershot of new ideas for the Souls formula, some good, some bad. Often quantity over quality. This game is unapproachable as a player's first game in the series, or even a second. This game requires an iron will and a stubborn heart to get through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a technical marvel how bad this game doesnt function\r\n\r\ndark souls 2 doesnt want you to play it\r\n\r\nyou need at least 4 mods to make the game run how its supposed to, and even then it just adds on more issues onto this absolute mess\r\ndoesnt work with high refresh monitors; it wont stay fullscreen which in turn makes it so you cant use a high fps mod which in turn breaks the game fundamentally\r\n\r\nthe camera has acceleration that you CAN NOT turn off\r\n\r\nthe first 20 minutes of exposition is a pure cringefest\r\n\r\njust play LITERALLY ANY OTHER souls game even the first one isnt fundamentally broken like this piece of hot garbage. if i could refund i would.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's just bad. After dying several times in a place \"jump dashing\" without any learning how to move properly, I decided to remove it. No control over movement, even good old Witcher 1 is better. Hitting opponent moves him out of the way and he hits you in the back - well, that's new. But yeah, you may select out of dozens of eyebrows, and think a couple of hours on nostrils width - it really affects gameplay. No.\nI'd rather start NG+ of God Of War instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Recently played DS2 (SotFS), the only mainline FromSoftware game I hadn’t yet tried. After giving it a fair shot, I’m putting it aside. It lacks the appeal of Dark Souls or Elden Ring, and I don’t enjoy it enough as a standalone to keep playing.\r\n\r\nMain issues:\r\n- Disconnected, small levels feel like themed world checklists (pirate cove, castle, forest etc.). They're over as soon as they start and the lack of cohesion between them all makes them feel pointless.\r\n- The hub-and-spoke world design isn't well implemented. Navigation and progression can be confusing.  In DS1 and DS3, even if you're lost, there's always somewhere to go and you don't often hit dead-ends.\r\n- Controls feel off; enemy hitboxes are weird and the lock-on mechanism only seems to lock the camera, not your aim. This can make combat awkward and frustrating.\r\n- SotFS is supposedly harder due to non-stop (!) trollish enemy placement. It slows the pace and gets tedious checking corners and behind to find enemies. Maybe this is an attempt to compensate for the levels being so short? Misses the mark if so.\r\n- Health penalties on death didn’t bother me much, but might turn others off. I tend to play glass cannon characters and I found this encouraged me to focus on stats that improved mobility and dodging.\r\n- Torches are ineffective and clunky—forcing one-handed combat, wasting time relighting, and often leaving me running in darkness unnecessarily. They're so unusual that I suspect their mechanics are relics from early development.\r\n\r\nOverall, DS2’s PvE fails to hold my interest due to these issues. I’ve heard PvP is good, so perhaps if you enjoy that, you might try it and enjoy the game if you don't expect much from the story or exploration.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is stupid, the core mechanic of these types of games are dying and learning something from that death. but do you know what happens each time you die? you fucking lose the max amount of health you have. the healing mechanic? takes 3 work days to drink and 2 more work days to get the full heal from a single estus flask. how do you fix your max health you ask? with humanity of course cause that made sense in the heads of the people who made this crap ass game. how do you get the humanity you say? you dont. you dont get humanity thats one more thing. does the game have any mechanics that make use of the less max health? yes it does. but you have to kill 2 bosses first to get a CHANCE at getting that weapon. trying to get the weapon again felt more stressful than my most job interviews. i would get myself fucking employed rather than touch this game ever again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no steam cloud save on a game released in 2015 is completely insane\r\nrip 100hr account\r\n\r\nfu from",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playing DS2 makes me want to replay DS3. Everything is just bad about this game, bosses are forgetable, spells all feel alike, and you can't grind souls unles you join Champions. The DLC is even worse then the base game. If you want to go down the spell caster route, good luck. No spells for you, unless you new game plus it. \n\n  This is the worst in the DS lineup. I tried a warrior to start and it was like driving a nail through my balls hard. Your starting class is your difficulty level. \n\nGo play DS 1 or DS3 for a better time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the best Dark Souls game trust me bro you get guns in this one. The director also ego's the fuck out and tell you, you're gonna die alot HAHAH, yeah this game is eats shit alot! BWAHAH hja bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"B-b-b-but the majula theme is so amazing dude\" Bro I DONT CARE, this game is ass. Its not only a bad souls but a horrible game altogether.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Easly the worst DS game by a long shot. There is honestly 0 good things i can say about this game. Beating it was pain and ending it felt like finishing a chore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Play Dark Souls Remastered or Dark Souls 3 instead. Best games of all time.\nBut this game is dog sh!t.\nSuper janky, hilariously poor enemy Ai, poor combat mechanics, and overall bad game mechanics that don't exist in the other Dark Souls games. Simply not a fun experience. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are absolutely desperate for a souls game, maybe you can reluctantly give this a chance.\r\nThe best way to describe this game fast is: \"Everything Dark souls 1 and 3 did wrong in one neat package\".\r\n\r\nI know this game has a die-hard fanbase and that I'll be eaten alive but lets go..\r\n\r\nA quick breakdown of the most notable things (there are a lot more) I find to be bad about this game:\r\n1. Too many high damage, high hp enemies for no reason (it's tedious to kill them over and over). People had been criticising the enemy placement and enemy density of Lords of the Fallen clearly havent played ds2.\r\n2. Too often mechanics that make traversal unreasonably tedious like: Mobs that degrade (almost instantly) your equipment, many areas with water/whatever else that affect movement.\r\n3. Extremely easy bosses (spend 2 hours moving around in a tedious place to fight a boss for a minute)\r\n4. Atrocious hit boxes. Enjoy getting teleported to an enemy's grab attack (not uncommon)\r\n5. Bad and clunky movement + poorly working lock on (Bonus: Lock on lingers like a second or two after target dies which is very fun when fighting 10 of them at a time!\r\n6. Seriously lacking animations for attacks.\r\n7. And finally since this matters the least out of the above to me, graphicly the game somehow managed to look worse that Dark souls 1 (which was looking very solid for its age)\r\n\r\nCredit where credit is due:\r\nThe game has excellent atmosphere, with some beautiful sceneries (despite the graphical quality), almost as good as ds 1, it has a lot of interesting ideas, a lot of content (though quantity over quality) and some very cool areas, with my favourite being the Drangleic Castle.\r\n\r\nTLDR:\r\nThis game takes a 5/10 from me. All the positive experiences that the game provided were poison by it's moment to moment clunky and poorly thought out gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "awful level design, awful bosses, cancer runbacks, 300 ms input delay, dont buy this garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After hundreds of hours in Elden Ring...  Movements and attacks in DS2 are so slow... it's unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My controller works for Dark Souls: Remastered and Dark Souls 3, but not Dark Souls 2: Scholar of the First Sin.\n\nI have tried every solution that I could find on YouTube.\n\nI do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute worst souls experience out there. I do not care for fans of it at all. Bosses are awful Mobs are awful mechanics are awful items and progression is awful. Its more fun sticking a fork in a wall socket then playing this fucking game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst part of the trilogy. Not responsive controls, waiting hours for character to move after any action, structure of a map is a joke, constantly getting lost because of backtracking and no info what to do next and many more. \r\n\r\nI would recommend it only for true masochists that want to suffer, not because of skill issue but because the game is just broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beat dark souls, dark souls 3, sekiro, and elden ring multiple times. this game is abysmal dog shit and I wouldn't force my worst enemy to play this game for an hour",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nah, not feelin this one. From what I've seen, the original version of this game looks way better with smarter and more fun enemy placement.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very bad game. 4/10 experience so far.\nUpdate: Just beat the game still bad 5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hottest pile of f*cking garbage that FromSoft has ever produced. I had to complete it though, just to say I've done it, but holy dog water. Hitboxes are absolutely garbage on times, get spam invaded by NPC's, backstabs just pick and choose when to work just like the hitboxes and roll mechanics. Estus flask healing you slowly are a blooming pisstake. Majority of locations are just dull and boring apart from the DLC areas, they are the coolest. Aside from them being lazy af and copy and pasting the smelter demon you fight in the base game and putting him in the DLC (they changed his flame from orange to blue!! So unique) No satisfaction from beating any bosses because of how f*cking garbage the mechanics are. What a steaming pile of crab infested pubes left on the toilet seat. Happy hunting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great way to find out how good your tedium limits are. If you like picking off enemies with your bow so that you might have a chance to get through, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has a totally different feel than every other game in the franchise. I recommend it if you want to experience all of the Souls games, but if you had to only choose one of the original Souls games then I wouldn't choose this one. With that said many mechanics introduced in DS2 evolutionized the genre. The bosses and music are extremely memorable. For that alone, especially with mods I'd try this one out. Get it on sale for sure. I might even play it just to understand some of it's references in DS3 and Elden Ring Nightreign.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Main story is easiest of the three, especially the first half; like monster hunter, the true difficulty comes from the dlcs. One thing the dlcs and main story share are horrible run backs. One of the, if not THE, worst game I've had the displeasure of playing. Which is funny because I was having a great time the first half as again, everything was easy, but the amount of stupidity, this game holds with everything else is abhorrent. I'd dive into it but I don't want to think of it for another second. If you want a challenge, become the cursed and take the journey; if you want to save yourself the unrequired trouble, just walk away. Glad I played it, wished I never had.\n\nIn hindsight, I'd like to edit and say, I don't think it was a bad game, worst I've played nonetheless, but the challenge came from bad design, not the game itself. For example, Fume Knight is a very easy boss in my opinion, but it was one of the hardest, shy of Blue Smelter Demon though it is the exact same reason, because the hitboxes were atrocious, and that's what makes it hard. Of course you could look at it as it's part of the game so it adds to challenge and thus charm, but I feel like a hard game should be because of the complexity of the moves and bosses quirks, not cause of poor design, which a lot of the game suffers from.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\n- You get more of dark souls formula without the massive connecting world like from DS1\n- More bosses (about double from the DS1)\n\nCons:\n- Lack of decent keyboard controls/support\n- worse windup and telegraphed attacks and weird hitboxes\n- bad movement/combat system that only works in certain directions\n- offputting and weird stamina system\n- overly poor pacing\n- generally doesn't feel fun as someone who's loved DS1 Remastered and Elden Ring\n- leveling system requires teleportation\n- teleportation is a very early feature that ruins the worldbuilding from the beginning\n- corrosive acid about everywhere forcing you to repair armor commonly\n- boss designs commonly copypasted\n- terrible areas (worse than in DS1) that is basically every area after earlygame\n\nThe gameplay generally feels like it was made to be harder without resulting into a fair and rewarding gameplay loop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you have played DS1,Elden Ring, Bloodborne, Sekiro and thinking that you'd get the same experince from this game, you wouldn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was tweaking out half the time and the only reason why i completed the story was because of the summons (clutch asf)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play the game, stuck on windowed mode because my monitor has too high a refresh rate, only shows controller controls so you have no clue how to navigate menus on keyboard, you have to play with a controller only and have a school computer to be able to play the game properly, DONT BUY IF YOU HAVE MODERN HARDWARE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Avoid making two mistakes: Playing DS1 and 2. \r\n\r\nFirst one aged horribly, a handful of fanatic is still present, who praise it's \"interconnected world\" that most would care not about; and the second one, which has some unfair bosses, craziest enemy placement and worst location (comparing with every other souls-like) - Shrine of Amana. Oh, they surely had mercy by not making it as a swamp area, otherwise it would have been a hellscape unseen before.\r\n\r\nBe not afraid to skip those handiworks and move forward. If no nostalgia or something similar plagues you - then there is nothing to see.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Makes me want to cut up my balls and pour salt on them I can't stand this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No. absolutely not. Do not play this. release me please.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you first played Dark Souls 1 Remastered, you will be disappointed with Dark Souls 2. I should have watched the gameplay first before buying, I just didn't want to spoil the game for myself. I find this iteration of the series terrible. I strongly advise you to familirize with the game before buying it.\n\nAlso, note that SOTFS version of the base game is different from the original base game. Unlike what you might expect, you are not buying the same game with all DLCs - you are buying an overhaul with significant changes (yeah, I know, I should have read the game description).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did not really enjoy this game, there's some cool aspects, but a lot of the bosses aren't great, and the boss runbacks are atrocious.\n\nbut the DLC areas are really good, those are a lot of fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't want to hear the same 'lol, this bridge is broken—just do everything you did for the last hour all over again' joke anymore. I feel powerless, even though I'm level 100, and that's something that was not missing in Dark Souls 1. The art is great, but the game just doesn’t nail the balance between frustration and fun :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spider too scary but at least torch saved my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Walking Simulator 2.0: Electric Boogaloo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only souls series game that doesn't have the \"Help me\" carving.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THISSS GAME IS TRASHHHH!!!! FVCK FOR ALL THE INVADERS< FVCK UU FORLONNN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The controls were POOPY dude. DISLIKE!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No, just not, don't do it for your self.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "play this game if you have patience and love bad movement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "play this game if you want to waste your life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Waiter! Waiter! More enemies jammed into one room!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst game ive played in my entire life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is bad af",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i take it back i hate no mans wharf sooooo much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1intensify is fine\n8intensify is disgusting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game i ever played",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't wait to play dark souls III",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shrine of amana made me want to harm myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poop wit a side of ass!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "GAME BAD ME NO LIKE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disgusting EULA :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "whoever made this game was out of their mind",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dis ain't it chief",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i would not wish for my worst enemies to experience iron keep",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ds2 deserves its hate",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "NO STEAM CLOUD SAVES",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just no…",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hot pile of poo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst ds",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shitty hit boxes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ازبل جزء",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "huinya",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've waited to finish all achievements before posting this review so I played long enough to form my opinion.\nI do not recommend this game, especially for souls first timers. Not all is bad about this game though and I'll try my best to give it a fair review still.\n\nWith the positives, the game is long and even though if you buy this version you already have the DLCs, the DLC are quite long and complete. \nThe story is good, as a souls story is so you get a lot more of it by reading item descriptions and so on but very enjoyable story if you like Souls games. The atmosphere is amazing, the game is pretty in itself. \nYou have a good liberty to make interesting builds that you like and it's fine as long as you know how to use your build ofc but that's souls games anyway.\nCrown of Ivory king is an amazing addition to that game, I really love that area, the story, the atmosphere, the boss you fight. (Except one very specific -optional- area)\n\nAnd that's the negatives, I'll try to avoid spoiler but that one optional area I just talked about is horrendous. Not visually appealing, tons of enemies that pop out from nowhere, really nothing interesting going on at all.\nFor the rest, the game is full of ganks. Now ganks aren't inherently bad, but I'd argue most of the ganks in this game aren't well done. There are exceptions namely in the first area of the game especially in [spoiler]No man's Wharf, forest of fallen giants[/spoiler]. But after these early game area which are really nice, the game takes a turn and start just popping tons of enemies in corridor, ambush all the time. The same trick over and over again. A single enemy walking alone then 4 others come in, all pretty tough. It gets boring. I'm a big fromsoftware fan and I've always been amazed by boss design and musics but there really isn't much memorable boss or music in this game. Then again, a few exceptions but I'm really disappointed on that regard too. The world building is a bit weird... I mean at some point you take an elevator at the top of a tower to end up... in a lava area? I read some people try to defend that but it's pretty sad that it's this way. I mean the elevator could have gone down below the ground instead, it'd make a lot more sense. But it's not like it's a bother in the game just a detail you notice only if you really pay attention to where you're going (if you're just here for bonk bonk, then it's whatever). And finally, the game feels so slow. Opening a chest, opening a door, entering a fog gate, healing... everything is just so slow and I get some people like that and I respect it, but it's not for me.\n\nAll in all, I wouldn't call it the worse game in the world or anything. It's a Souls game still, all things considered it's not THAT bad but I'm very disappointed in comparison to all the other fromsoftware games. I've had some fun but significantly less than in other games. It's quite a forgettable game I think and I'm pretty sad for that.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "I tried to like it and i really wanted too its just that the run backs are hell and the poor enemy placement is just dog water lol i loved the first ds1 and 3 just really wanted to like this one. sadly its just not for me.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "This game really isn’t as bad as people say. It definitely has some great highs, but its lows are about as low as the trilogy gets. The entire design around the game’s “difficulty” feels so artificial that it will genuinely make anyone extremely annoyed and frustrated at some point. Overall, I’d absolutely recommend playing this game—especially to get the full experience of the Souls series. However, my review and opinion have been somewhat tainted by the constant and incessant spam from DS2 glazers online, to the point where it actually changed my views on the game and made my opinion of it harsher.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Beaten every other souls game. Only one I don't recommend. I've sat down at least ten times trying to play this game, gotten variously far in all my playthroughs. Game would be good if it weren't for the copy pasted gank fights, stupid adp stat, somehow clunkier than the first game mechanics, and how the areas have stupid gimmicks like being blind due to snow or being blind due to fog. you know its fucking lazy and unthoughtful when they copy and paste an area gimmick. Only play this game if you like getting raped in the butt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ok so the negative for this is because I can't put mixed. Let me start by saying i have a love/hate relationship with this game, mostly hate, there are aspects of this game I think 3 could have had such as power stance, more weapons/build variety etc but what really drags this game down is not ADP, which is a total trash stat, its the design philosophy which all about killing the player and maxing out the amount of times the game can kill the player be it through the absolute spam of certain enemies or the bad boss design. Then there are things i can compliment such as the shear about of build variety, armors and weapons, spells and miracles, the NG+ cycle adding new things to spice things up. However the biggest issue is Life Gems turning the game into, if you're smart enough, an absolute cake walk for most of the games run time they can negate most DOT in areas such as The Gutter or Black Gultch or even the Mytha boss fight. Overall whats the most interesting aspect of this game is what could have been instead of what it was made into and its an utter shame we never got to see that version.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everything bad you've heard about this game is true. I sat through this janky mess to 100% and it was miserable. Everyone that likes this game is just trying to be a contrarian. \"Oh it's just slow paced, Oh it's just deliberate combat.\" No, it's sluggish, buggy and overflowing with G A N K. You can't look at the runback to Smelter Demon in Iron Keep and say it's good. Also you are punished for every death by losing max health up to 50% which you can only get back with Humanities. By FAR the most disappointing Final boss in the series. Even the PvP which is highly praised isn't any better than other, BETTER souls games. GOOD PvP is in DS3. The most forgettable, slogfest of a souls game riddled with issues I couldn't be bothered to write here, That's how awful this game was. 2/10 Don't play.\r\n\r\nOh and before I get a comment saying \"Just wear the ring of hollowing to reduce the death penalty!\" YOU SHOULDN'T NEED TO SURGICALLY ATTACH A RING TO YOURSELF TO MAKE UP FOR BAD GAME DESIGN.\r\n\r\nI thought DS1 was clunky, ohh boy.\r\nPlease for your sanity and enjoyment, Go play the other games. Bed of Chaos was better times than this. It's like if ALL of Lost Izalith was a game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is worse than Dark Souls. Even the start is so bad, where you first run to old ladies and only then choose class and items just appears from nowhere. But XBox series keys on keyboard? Really. There is noone in devs team that know on pc you use keyboard and mouse. 60 fps lock on PC also shows how bad devs are. Without their Master fromsoftware is a bunch of junior programmers that have assests from Dark Souls 1. No imagination, no skill.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "what if we placed a petrified statue infront of the only good area in the base game <-- genius game designers",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like the story, atmosphere, enemies are cool, weapons and armour are cool and I find almost every character really interesting to learn about.\n\nBut omg I hate how easy it is to get lost in this game when it barely tells you to begin with which is the right way. And it's not like Dark souls 1 lost since you can eventually find out where you're meant to go, but i cannot get anywhere without looking up a guide to find out where is the way to the end of the game. I remember I went to go talk to some npcs to figure out some clues on where i need to go and one literally just tells you to go east to fight something, as if you have any sense of direction to begin with (never mind the norths, souths, easts and wests).\n\nI also find it quite frustrating how you can have certain areas where it feels like there are far too many enemies with the amount of damage you can take in this game. There's some points when you could be looking at over a dozen enemies at once all attacking you at the same time, or having multiple ranged enemies out of reach while you're trying to fight some ground enemies that are in your way.\n\nThere are also some trap areas that are impossible to dodge, so you have to hope that you can make it through with enough help and enough luck that you can either heal or just not run out of health before getting through the traps.\n\nHaven't completed this game yet since I only just found out i had apparently been going the wrong way and didn't need to go where I'm at now. And let's just say I'm relieved because this area has a boss battle that has multiple enemies in it that'll fight you with the boss *UNLESS* you backtrack that entire section of the game again to find helpers that'll make the boss fight much easier than without them. It just feels like it's unnecessarily making the game longer than it needs to be.\n\nIf you're into dark souls as a whole, i think you'll like this. But I can't recommend it based on my experience as it can drag for way too long and be difficult in a way that I just find way too annoying. (I've considered giving up and moving onto dark souls 3 prematurely as i've heard it's more similar to dark souls 1).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "terrible\r\nit deserves way worse rating\r\nthe only redeeming qualities it has, is that it tried to do something different and that it eventually ends",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is like an 8/10 burger but they burnt the sh!t out of it and called it a delicacy.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}