{
  "positive": [
    {
      "review": "The game itself is buggy and dumb, but pretty fun. Worse than the other Skate games for sure. It's worth playing since it's free, but for the love of god please don't spend money on this game!",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Love the physics, graphics, and (some of the songs) The characters look like the adult version of the (New Xbox Avatars) so they ain't too fun to look at. The City is a perfect size for a game like this, along with the parkour and climbing, making exploration often more fun then skating. See that skyscraper? go climb it! \n\nThe missions are hit and miss, and the progression system isn't my favorite, but for a game that is free to play I can't crap on it too hard. Play this with some friends and just goof around, you'll all have a few really memorable laughs.\n\n8/10 You can roll around the city like Sonic.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Nothing beats the feeling of grinding down a set of stairs, only for another player to join in and grind alongside you — then someone else adds an object to extend the line, and before you know it, a half pipe appears out of nowhere with ten other players attempting something completely different from that set of stairs. Skate. might not be Skate 3, and the negative reviews aren’t wrong about that. But it’s not Skate 4 for a reason, and the lack of a battle pass isn’t going to change that — especially for a game that’s completely free to play.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "The Controls Feel A Little Rough At First But Once You Get Used To It, It's Really Enjoyable, Especially With Friends. The UI And Menu Design Are Also Nice. Not A Bad Game Overall. From Me 8/10",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is beyond realistic, like I can hit a drop from 100 ft, just like in real life.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "game plays nice, feels like old skate but even more in control honestly. all we need is a real story mode like the old games, brands and actual real life clothing items/brands that past games had but updated. and also we need more spots to skate and less bigger ones more realistic ones. ive played 70 hours n basically hit every spot ive wanted to already lol. i get its pre alpha so i still recommend but theres alot that needs to be added and the clothing and culture of actual skateboarding is a huge part of it for me.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The gameplay is smooth and to me that is the most important part. But there are a lot of bugs, they range from busted challenges and progression locks to multiplayer party problems. It also has bad monetization like a lot of games today. That being said, I am having a lot of fun with this game and want more of it.  I would like to see more and varied challenges, better multiplayer, and hopefully new maps and objects. This has become my go to relaxing game. I really like this one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Skate. 2/5.\r\n\r\nThe gameplay retains what made the previous games so enjoyable and exciting for any new and returning players. The art style is definitely something that will be hard to get used to on how fortnite esque it can look, from it's departure of semi-realism from before. The downsides are plentiful, art style aside. The repeating challenges, an underwhelming open world and lack of new activities to do in it, glitches that do more harm rather than give character to the game like how it was in the third entry, core missing aspects from previous entries.\r\n\r\nPlayers will find it tough to want to return, and keep playing while putting in a lot of hours into the game with all of it's issues. Whether new updates to the game will help boost player count and enjoyability or continue to lose it, will be interesting to see. To be forgotten as another live service that had potential, or finally make what made Skate,",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Skate is an absolute masterpiece for those who adore skating in a very realistic and also creative way. The main thing that makes Skate so good is the fact that it captures the very essence of real skateboarding perfectly. not only the tricks but also the flow, timing, and style. Skate, unlike other skating games that have players mashing buttons to perform combos. Skaters would do it just the same way if they had the chance. The open world design lets players draw their paths through a great big city filled with exploring, discovering hidden spots, and making their own lines. Every action, such as grind and flip, even bail, has become more realistic and exciting through the undemanding yet great physics of the game, and the players never get tired of that for the reason that it is so naturally exciting. Besides it all, there is room for creativity, making your own movie clips, altering your skater, and communicating your mood by means of tricks and combos. Skate is also a community builder by making it possible for players to play against their mates, to exchange footage, and to demonstrate their talent online. Each session reminds of a gathering at the park with friends where everyone is trying out different things, and testing limits. It’s not just a skating game, it’s a way of life.. a way to keep the culture alive, to honor the struggle, and to celebrate the freedom that skating brings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "genuinely don't understand why people hate on this so much, the graphics isn't that bad, the sounds are amazing, and the game itself isn't even that bad, I mean yeah, vee is pretty cringe.. but other than that, the game is great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I never thought i would be playing a EA (and i don't mean 'early access') game in 2025, but honestly except for a few bugs it doesn't deserve the hate it's getting. The only issue i have is that you can't directly communicate, but just by reading the forums i understand why that's probably a good thing. It would be nice to be able to communicate (voice chat) with friends on other platforms at least. I like the parkour element to an extent (as long as it's not just climbing) and i wouldn't be against introducing other sports like BMX, etc. into the game. .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dope game tbh, but long ass tutorial.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very buggy game, some funny and some annoying, feels unfinished, I dont really like the style but it's decent",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To preface: yes I know this game is in early access.\r\n\r\nI do actually really enjoy this game, it doesn't have the original feel of the first three unfortunately.\r\nI miss being able to do hall of meat, or dark catches.\r\n\r\nBut! This game has its own unique charm to it, unlike most people I do really enjoy the cartoony style of this game. Also it keeps me busy for hours which I usually struggle with due to low attention span and being busy. I enjoy the challenges and I feel like I'm 13 again play skate 3 for multiple hours. I do not like Vee, but I turned her off for the most part so she isn't as invasive.\r\n\r\nI do hope in the future they add features from the old game such as grabbing onto cars, dark catches/slides, etc. I haven't done any of the muliplayer activities but I'm sure they are just as enjoyable as solo playing. The map has many spots to skate in which is nice, you can virtually hit any trick anywhere.\r\n\r\nI rate this game a good 7/10 and hope to see more updates and such in the future :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a 30 year old  former skater with bad knees, this is as close as I can get to my glory days. This is the most fun skateboarding mechanics I've ever played. With grind assist set to 10, I really feel like I have full control of my board and can hit some really cool lines and tricks without it feeling like the game is doing it for me. The physics are great and the slams are actually kind of realistic. The map can feel repetitive at times, but if you look harder (and slow down) you'll start finding more and more hidden spots. The challenges are also repetitive but some of them are really creative and push me out of my comfort zone. The game is free, so that's nice but...\n\nThere is zero skateboard culture in this game. It's soulless and dead in a way that is very disappointing. On one hand, I'm happy they focused on making the mechanics fun but it's basically a big sandbox with loot boxes. Eventually, after you've done every challenge, the game will be nothing but a big free roam map that you've already skated for dozens of hours. No getting footy for a part, no demos for sponsors, no actual pro skaters, and very few real skateboard brands. The loot boxes are really annoying. Not only is most of the content generic AI generated slop (oh great I unlocked a pepperoni pizza sticker!), actually unlocking it is a tedious loop of silly \"Congratulations\" transitions that make you want to pull your hair out. The art direction is too cartoony and the skate customization is lacking. My skater looks like a wax doll. Progression in the districts is confusing. I think it's tied to the loot boxes? I don't even know or really care to be honest. Almost all the other skaters you encounter in the world are wearing the same exact outfit because the stuff you get in the loot boxes is so corny. \n\nThis is a fun skateboarding sandbox but it is also a testament to how corporate and devoid of culture games like this are becoming. It's really ironic that a genre of games led originally by the THPS and THUG series that were full of amazing skateboarding culture, footage, brands, and references has ended up like this. And we know the Skate games that preceded this were inspired by those games and full of skateboarding culture. I'm very torn because I love the actual skating in this game, but it's not really a video game. It's more like a really good proof of concept. If it wasn't free I would not recommend spending money on it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its Fun and has well done controls. Looks GREAT.\nGive it a try. It's free so why not?\n\nClothing Store is confusing to navigate. \nNeeds options to put hat on backwards or any direction really.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "horrible microtransaction game but the skating itself is very smooth and fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yo, I’m simping for this game. Never touched a skate game but felt the rizz with this one. Core vibes are on point, just need to patch a few glitch gremlins tho.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love how there are many fun places to skate in this new skate game! I love almost everything about this game however this game has some flaws. One flaw being a few bugs when skating mainly in the community park area. Another flaw is all the in app purchases which are overpriced in my opinion. All in all, for a free game that is fun to play you really cant complain so I would recommend this game to others.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game for breaking in a new controller or to just have fun, soundtrack is great too.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "despite the many frustrating bugs like not seeing anyone after joining a friend's lobby, the game is very well optimised and tons of fun. every week you get smth new to do and you always find new spots to trick on.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I was excited for this game and at first i enjoyed it. but as time went on i found it harder to have fun and just play the game. Some things were not possible to finish and the settings do not do much. you can change one setting and to changes the entire game and even makes it impossible to play even of you only change a fov it will change controller inputs and button layouts. if your looking for a game to mess around in for an hour its ok but if you want a game to actually play and finish challenges then i would find something else to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As long as this game stays free, I'd recommend a go at it. Just don't hold it to the standard of the previous skate games. It's a bit microtransactional but it's not as bad as other EA games. (For those of you who hate the AI robot talking to you constantly, you can turn her off in the audio settings) Also, this game is crossplatform so that's a huge win! Had a lot of fun with my console friends :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to just listen to music and chill either with friends or by yourself it is pretty realxing",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I honestly don't understand the crowd complaining about mtx cosmetics...  \n\nIt's a free EA game in 2025 you mfs should be glad they don't try to sell you faster skateboards for $4.99. OF COURSE it's going to have lootboxes, OF COURSE it's going to have paid cosmetics. How the f😂ck are you people so out of touch with the state of the industry?\n\nIt's a FREE game with ALL of the content playable for FREE. Skating feels good, the graphics are a bit sloppy sure but they get the job done.  It's a fun game. What's there to complain about besides the bugs?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "climbed towers for what felt like 4 years and then did a mega fucking flip trick and shouted a slur 10/10 game defintily recomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is honestly one of the better skating games I've played. \n\nPros: Solid story progression, great map and fluidity, gradually harder challenges are a nice side quest when main story missions are done, tricks are almost spot on when landed right or sketchy, the amount of things to do aren't endless but it's close, great views, great music, customizing is great, visuals and graphics are fantastic, and attention to audio details is great as well.\n\nOverall a 8/10 rating for a skating game.\n\nCons: Black loading screens being stuck are rare or often if you go AFK or load into something, inviting friends in your party to any kind of session or challenge sometimes glitches the start or options buttons from working, the halloween event challenges weren't showing on the map until the final week of the holiday event, clipping the edges of certain benches or building ledges would ragdoll your character and send you flying across the map, distinction between a change of direction in skating when coming to a slow roll seems to be an issue, sometimes held flip tricks or flip tricks in general aren't engaged unless you are precise, cosmetics in the shop are a little more expensive than I would like but the game was free sooo.... , claiming the seasonal objectives proves to be challenging because it is glitched and won't allow me to claim it even though it's all complete, item boxes seem to be a little bland for lvl 10 due to reskinning items we already have from other challenge boxes (not asking for the world but bigger and cooler items would be nice or ridiculous ones), NO NIGHT MODE.\n\n\nAll in all the game is amazing even with it's quirks. This skate game has potential to be the best of them all but time will tell if the DEVS listen to the fans and give us the service we desire. There are things to love and dislike about this game but the good outweighs the bad by a long shot because the cons are merely just annoyances THAT CAN AND SHOULD BE FIXED.\n\nPLAY THE GAME. IF YOU LIKE IT YOU LIKE IT. IF YOU DON'T THEN FIND ANOTHER GAME. :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "maybe . Although it is a bad successor to Skate 3, and Skate 4 was long awaited and praised, this game as a standalone is fine",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I told myself I wouldn't review this game until I got every achievement, which I did! So here goes:\n\nDear me does this game have its issues. Sometimes it crashes 4-5 times to actually be able to play, there are glitches galore, the challenges that refresh every day get pretty repetitive, and so on.\n\nThat being said, its early access, and I really do see the potential. I know there is a ton of negativity surrounding the game, and I know the Devs probably need to work overtime to iron out the creases, but there is so much fun to be had!! There's a reason I keep suffering through the crashes, because once I get to play, I am having a good time. Compared to Skate 3, I really like the controls, which I was surprised, because I thought it couldn't beat Skate 3. I find the city of San Van super cool and interesting, I like the cosmetics a lot, and playing with friends is super fun too! Even just picking some random spot to try and hit a silly clip for hours feels rewarding. \n\nAll in all, I just really like this game. I want to see it thrive, and I hope once it gets past early access, people will give it a more fair chance. :3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Keyboard and mouse mechanics janky but works and is still a really fun game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At first I was skeptical due to the amount of negative reviews, but, as someone who has played the previous skate games, I just don't see the big problem; I'm having a lot of fun with it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ok game,  Nothing on it's predecessors.\r\nHas a long way to go to get better.\r\nNot having any pros, or lack of F2P Skate branded merch is kinda lame.\r\n\r\n\r\nPS, Pls fix the achievements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love how SKATE makes the game realistic!\nThe game is so fun with achievements to earn, able to personalise and customise the character to our liking, and so much more!\n\nRecommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A bit messed up at launch but here we are now with a proper and stable performance. Skate coming in free with live service is a good idea to bring this IP back in the game. Overall so far is bringing a great experience on playing skate and enjoying the time to relax while completing some tasks or challenges to unlock some pretty cool cosmetics. It will be great if there are a competition mode (or is it already happening?) with some cool rewards.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At its core, skate. has solid mechanics and gameplay, bringing back the innovative Flick-It control scheme and combining it with smooth skating visuals and sounds.\n\nThe gameplay loop and rewards system could do with some improvements, but the recent updates, seasons and events look promising and deliver nice content iteratively.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i played abit in beta but my steam account was having trouble linking up with my ea so i had to play it through EA but other then that im having fun trying for the 100%\r\n \r\nsemi long 100%",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Get rid of that fucking clanker and her dumb ass long ass fucking tutorial \r\n\r\nother than that its pretty cool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A mixed bag of emotions on this one, the Game is riddled with bugs and silly micro transactions for your kids to rinse your credit card of all your hard-earned cash. The game loop is nothing special, but considering it's EA and it's very early access, it's pretty good with that in mind. The game is also missing Coach Frank (this is the toughest to swallow), a legend of the first 3 titles and beloved by all the OG players. Save Coach Frank! Call up Jason Lee and please, let the hurt finally end. 💔\n\n\n\nDespite these points, I find that I can't stop myself coming back for more! The Mechanics are solid, other than the random Physics spike (that launches you across the map, not unlike the first pinball in a classic era pinball machine), the gameplay remains fun and keeps you entertained. I found the store and loot boxes to be quite endearing once you get used to them. One point worth mentioning is that once you unlock an item, you get two prompts to accept each item; it's wearing my patience a little thin now. (Any devs reading this, PLEASE look into this asap)\n\nLoot for just playing is easily earned with a little daily effort. The one event I have encountered thus far (Hallowen) was actually really fun; it included its own events and currency that you can earn through those events. The Items you could purchase with this currency were really easy to earn. An additional 100 was available daily through the store. I managed to collect all the Halloween items with a little effort daily for a while. \n\n\n\nGiven that this title is free and I've yet to spend anything on the game, the level of fun I've experienced for nothing is impressive. If, like me, you're a veteran of Skate 1-3 and you yearn for the old days...this Game does somewhat scratch that proverbial itch. \n\n\n\n8/10 - For a free title, it's worth a go, especially for any old guard returning to fill that Nostalgia void. However, not worth investing any money into yet, in my humble opinion. If this title was retailing for something in the region of £20-30 then I would be giving this game a 3/10...it might be worth some investment in the future, but only time will tell if this game will blossom or fall into obscurity. \n\nI, for one, can't wait to find out. ✌️\n\nEdit - please add more content",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After spending over 100 hours with Skate and seeing Season 1 come to a close, i can confidently say: this game is genuinely good.\n\nGameplay\nThe core experience nails the classic Skate formula. The iconic Flick-It controls feel just as intuitive and satisfying as ever, capturing exactly what made the series special. Every session feels smooth, expressive, and fun.\n\nWorld & Map Design\nWhile the city can sometimes look a bit too clean or polished, the actual layout is excellent for skating. Lines feel natural, spots are varied, and the world encourages creativity. It’s a playground that keeps you coming back.\n\nArt Direction & Style\nThe game has had, and to some extent still has, some clashes in style and tone. The inclusion of TikTok-style dances, overly goofy emotes, and some questionable clothing options felt at odds with the grounded Skate identity.\nHowever, these concerns are actively being addressed, and you can really see the direction improving over time.\n\nDeveloper Communication\nOne of the most encouraging aspects is the team’s transparency and communication. They’ve been open about changes, receptive to feedback, and genuinely seem committed to shaping Skate into something great.\n\nFinal Verdict\nDespite a few identity hiccups, Skate is already a strong, enjoyable experience with loads of potential for the future. If you’re a fan of the series, or just love expressive, physics-driven gameplay, i highly recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game overall, solid mechanics and very fun with friends or to relax, but the devs need to add an offline mode for steam deck users and it seems like the game’s a little too focused on cosmetics over the gameplay. Would recommend though!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Riddled with micro-transactions(which, unlike fortnite, are completely avoidable, you just have to grind), the Ai voice they use is annoying(which can be muted), its a little buggy, and super unrealistic compared to every other skateing game. It also lacks alot of skating culture(literally no-one calls video footage \"footy\")\r\n\r\nOther than that, the gameplay is SOOO buttery smooth. The sound design, the locations, all super fun. It's a free game that is still being added to.\r\n7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ok its nice to see a skate game again but ughh idk its not perfect alot i hate but hey i can skate around in a modern game it could be worse ig its just classic EA not knowing what anyone wants anymore there was a time what seeing EA on the loading screen meant the game would be good and that time was 2005 ..... i cant stand izzy \"narrator girl\" she is insufferable and i wish i could start the game and not get nagged for the first hour and at the time of writing this thats how long she was annoying me for",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Like, I get why people who played and loved previous skate games are mad. I understand that microtransactions are a plague on modern gaming. That's not going to change though, companies like EA make games to satisfy non-gamers. I picked this game up for free and will not be putting money into it. The experience I got for free was pretty fun. The physics feel solid and the map has lots of cool spots and opportunity for creativity. Great free game to chill with friends or just to zone out to. Recommend,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is alright i guess, coming from someone who used to play the snot out of skate 3, the game is very similar in terms of the skating mechanics and style, which i absolutely love, if it wasnt broke dont fix it right? however, the transition into microtransactions for visuals like skateboard accessories and player clothing is a disgusting showcase of the pure financial greed of EA, yet another awesome game ruined by stupid transactions like this. im not saying the game is bad or distasteful, its just sad. i wont even mention the AI known as Vee because we all know we hate her equally. if you dont care about looks, or a shitty AI voice breathing down your neck 24/7 when youre just trying to skate, get the game, otherwise just play skate 3.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loads wrong with it but loads right too. Usual modern EA bs so prepare for that, loot boxes, 4 currencies, sub membership options etc. Some old things are missing, can't darkslide for example and the footplants don't work right at all. A bit of a lack of hill bombing lines and megaramps but the city has some quite fun spots still. Feels relatively similar to the past, body flips are way too easy and the way the game lines you up with ramps is a bit annoying as it prevents some stuff that previously would have been possible (drop ins especially, the game likes to line you up weirdly which often causes you to just bail). Late flips are way too sensitive too, often I'm trying to line the board up for a specific grind and it thinks I'm trying a late flip, so I bail. Irritating but not game-breaking.\r\n\r\nDespite all this it's the first new skate game in decades so I can't help play it. Clothes etc are decent, could do with more colours and the amount hidden behind paywalls is annoying but that's just EA being EA. Still the best skating franchise so I can only recommend, the gameplay and feel of skating in this series is unmatched.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its really fun. like really really fun. but the glitches man. i cant see my friends half the time and when i start a challenge there's a 50% chance that my game is just going to straight up bug out and i cant access my map or the challenge. if the glitches were strictly movement based like your character bugs out after falling that would be different; but having the game be unplayable in certain aspects, especially in the heart of the games appeal, its extremely disheartening",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is so much fun. its super relaxing when just sitting on a chair and skateboarding for fun and making cool tricks",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is so fortnite-ified. sadly, the skating is fun and addictive. so i like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really cool and fun game, Also It's free so what's not to love?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The sandbox is nice and the game is fun for a while however lacks direction and depth, it's very fun with friends and is a good mess around however isn't as good as any of the Tony Hawk games nor the other Skate games. It's a strange one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Graphics are so ass bruh. I feel like I'm playing a game made by Mark Zuckerberg and his weird Metaverse thing. the gameplay itself is awesome and unrealistic, easily tops Skate 3. But the fucking graphics are throwing me off so bad man\nIts literally just the graphics that's so ass. I'm loving the bugs theyre funny and all but graphics graphics cmon. It feels like corporate slop thats only made to be marketed rather than something linked to you and your hobbies.\nBring back hall of meat and coach frank instead of that robot ho.......pls..\n\nAlso skip tutorial button because it was hell going through that\nBETTER FUCKING GRAPHICS FOR THE FINAL VERSION I BEG\nAnd bring back Kinski as well for fucks sake",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its the best game ever but have a lil wish for the linux users to have access to play the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game it is so immersive and realistic with the way you can do so much, the possibilities are endless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun enough game at the best price. These kind of dick around games have been sorely lacking for over a decade. Bring back dirt bike and ATV games, bring back SSX bring back fun arcadey games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "play this game and try go to the parkinglot near the church and jump of the ramp while doing a coffin then do christ air into hardflip and land on the rafter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very fun and am supprised its free and i reccomend others to play it too the only problem is you need a controller but other then that its so fun (LOVE EA SPORTS SKATE)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Human Fall Flat with skateboard. Challenges from season 1 are easy, but grinding for full item/achievements take about 2-3 months without paying.\nReview posted in 1st day of season 2, new challenges are quite challenging, especially 2 out 3 challenges in locked area. New type of weekly Own the Lot seem to be fun, but people still tend to skate alone. Maybe the prize of this new thingy is suck, only Tix for skate pass, which you have a significant number from season 1. Tix will still useless without purchasing Skate Pass. However, I have grinded all season 1 pass and take 500 San Van Bucks redeem, I have 850 Bucks total, season 2 pass will also give about 250 more Bucks which can be used to purchase Skate pass. But the main point is WHY THE FCK THIS GAME GOTTA HAVE BATTLE PASS BUT 80% OF ITEMS ARE BAD?\nAnyway, the game is friendly to both newbie and experienced ones; the music - I won't judge because we got different taste; the mechanics and control is quite good, smooth but sometime bugs appear.\nSpend about 80 hours, full achievements, Pein x 3,14",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chill game for skating smoking and listening to music. mid map but itll be ight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too much fun, even though it's buggy and glitchy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's early access so things i want in the game aren't here but the core mechanics of the skating aspect are the best in the series. Down side is no story mode or Hall Of Meat but that's ok with me. \r\nThings I want Added:\r\nCustom Skate Parks where people can vote every season for the best one\r\nTattoos\r\nMore brand names\r\nHarder and varied challenges\r\nGive us a second map/let us go back to tutorial island\r\nLet people upload their replay editor clips in game and let us vote on them\r\nLet us tag up the city with sprays\r\nLet us hit pedestrians again(very important) \r\nGive us more hill bombs\r\nMore character customization \r\n\r\nit's a good game to play after work for an hour or two every day. Great skating mechanics but needs more activities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "drastic change in art style took a while to get used to. but as a skate vet whos been playing since the release of the first skate. its nice to have a new skate game other than session",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignore the forced hate, the game is free and has the best of the flick it system ive ever experienced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The price is right.\nPros: The skateboarding is pretty fun, feels like skate, and they loaded the city with a ton of stuff to skate.  \n \nCons: The trick list is very very limited, some tricks like foot plants don't work right, no death races and the art style is super cheesy. \n\nOverall: Pretty fun game game but has a ways to go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mega ramps are sick, it may be unrealistic but still is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, fun to relax and crusie around after work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the hate against the game and how its too modern I think it is one of the best skate games next to skate 3 because that was a CLASSIC but still I think this is a very very very fun game to play and would 100% recommend this to other people because it is super fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm gonna be honest this game is as bad as OG Skate fans/players were dreading being some weird mesh of MMO and Live Service when we really just wanted an updated game...  As far as I can tell they have done zero physics/gameplay updates in the 15 years since skate 3 came out.\n\nThat being said, I still bought the Founder Edition (er premium or whatever), I know I'm gonna sink time in to a new skateboarding game in the past 15 years that isn't whatever the hell country Tony has has outsourced that completely embarrassing franchise to.  \n\nSo if you're 20s-30s and obsessed with the skate franchise, I mean it's an update.  It's not great, but honestly $50 for an updated game, I'd rather spend it on this than many other mainstream game with barely remastered graphics/audio and they want 40-60 for it.  At least skate has actually been paying attention to playtesting, I'm not convinced they're understanding why people don't like them, but they're better than any company that's rebooting their FPS games for the 20th time in 16 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the game, open world air makes this game feel more real. Though I wish it had more tricks, there is a lot, but they are really hard to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its always been my dream to skate like this ive learned a trick from watching the charcters do it its a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addicting i cant get off the game it has been 4 hours straight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels like a more refined Skate 3, one of the only games as a service I actually enjoy. Fun to hop on for a few hours every day to complete the daily tasks and work towards seasonal challenges.\n\nClimbing is also an insanely good feature that is a complete game changer for lines and spots.\n\nLooking hopeful to the games future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if ur bored n dunno what to do, turn up spotify and launch skate. Its truly a chill and fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics are really good the gameplay is amazing and it is only 9gb",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "could be better: performance-wise, but okay! genuinely an okay game, some bugs here and there could be fixed but eh.\r\n\r\nplays better on Xbox One X tho xp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is quite boring but the challenges were kinda interesting, just wish there was more to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game, wont beat Skate 3 though, add some pro skaters and BRING BACK COACH FRANK.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the progress, hope all community request get considered, keep it up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty fun, but however there isnt a lot of people that actually play the game-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, chill and flowy game(When it works) usually whan i try to launch it gives me an error screen but very fun in general would recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best things to ever happen to me in a while (game-wise).\r\n\r\nIt's been a year since I was this obsessed with a game and before that it had been several years. It's not even that the games coming out have been bad.. I've just been in the worst gaming slump (+ experiencing varying levels of burnout from school and life). I've been in the gaming realm since I was five and now, as a young adult, it's healing to know playing games still gives me hope everything will be okay. \r\n\r\nThere's always a chance that you'll find a game that saves you from reality for a bit.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For Skaters, this is as close as it gets to a proper simulator, minus the cartoonish graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Needs improvement in multiple areas, more polish and better art style. Core gameplay of skating and doing tricks is nice and well made, the rest is questionable...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game but not very great on slower devices like mine, but worth your time if have strong PC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game I love skate it has funny glitches and stuff but its still fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dos pouquíssimos acertos da EA, esse é o maior de todos. Jogo divertidíssimo, joguei quase todos os betas fechados e só vi mudança positiva nele. Tem aí seus bugs, mas pra um early access até que tá bom. O loop é viciante, a cidade tem linhas muito fodas, você pode colocar as props você mesmo e dar um rolê com amigos também.  Se continuar de graça no release vai ser a maior vitória da EA em pelo menos uma década.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game its fun its an obby game too. if u like obby games u should prb get this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, would recomend. It is a bit difficult at start, but once you get it it's very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, skating feels consistent and complete, ofc there is a battle pass, but its a free game, ofc its not gonna be perfect, its in early alpha, ofc there will be bugs but they been working on them and the content is exciting. A++++++++++++",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, its great fun to play with friends and honestly, would reccomend to anyone who has the controller to play with.\r\nThat is my one dislike, the fact that you must have a controller to play.\r\nAside from that, looks great, plays great, and is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think that this game provides just enough shielding from the bad to be considered a positive review.\r\n\r\nPros: \r\n-Tricks: they feel rewarding and at least somewhat consistent. HItting a sick line really gives a nice dopamine hit when you finally nail something you have been trying to hit.\r\n-Free to play: this is such a big factor as there is no game like this that offers a free to play + not p2w system and that has to be admired + praised\r\n-Community: seeing others skate around and being able to interact and see what others are up to really adds a fun level of immersion + community\r\n-adding props to the world for people to add and build there own lines on the fly is a brilliant feature\r\n-Customization: I believe this still to be in its infancy and I was torn to put this in pro or con. A lot of clothing you get will just feel like reskinned items. Eg: you will get 4 jeans maybe all with a slight color/material difference - however they use the same models. I don't mind reusing models with new skins, but then the price needs to be adjusted accordingly. No one should shell out 4$+ for an item that is just a reskinned same model as they own.\r\n-Climbing: while janky at times offers a fun way to get around to high+new places\r\n\r\nCons:\r\nI am going to start with the biggest most glaring issue to me.\r\nSTOP CONGRATULATING ME FOR EVERY ITEM AND EVERY TASK.\r\n\r\n-holy mother of god. 80 hours played sure. I however have spend maybe 20 hours just skipping through CONGRATLUATIONS YOUVE UNLOCKED \"X\" followed by me skipping. Then proceeding to get the same congratulations message over and over again through some disgusting glitched loop that just abuses your time. Please for the love of god make a way to turn off these reward messages. Just add them to my inventory or something ill find it later. ANYTHING but the the current system.\r\n\r\n-The AI + \"story\": the last thing I want when I am skating around is some A.I voice barking in my head. It is one the most out of touch things i have ever seen in any video game. Yet alone a skateboarding video game. Anyone who tries this game. Know, that you can turn it off in settings and I reccomend doing that, Unless you wish to be harrassed by an AI voice that screams out of touch lingo at you every time you fail or succeed anything.\r\nThe \"story\" if you want to even call it that has you doing missions that more or less just teach you the ins and outs of skating and the moves you will encounter. The only issue wtih this is that a lot of these missions are locked behind completeing \"x\" amount of challenges. So you will often go do all these challenges just to do a mission. Then ironically you will be taught something that you already had done in previous challenges to even get to the point of doing the mission. Therefore making the whole mission pointless since you already learned and used the thing they are trying to actively teach you. I think the skate. team made a critical error when thinking this through. All the missions should be at the start of the game. So that way you learn all the moves needed for the challenges. Not the other way around.\r\n\r\n-invisible barriers + smooth transitions: I find myself running into invisible artifacts while grinding way too much. EG: you'll be grinding a long a smooth flat surface and out of nowhere your character will either just go flying or just completely bail. Some spots I have noticed have invisible \"humps\" where if you ride over the area too fast you fall. What I mean by smooth transitions is there is just a lot of not well thought out placement of different props or items by developers. EG: you will have a beautiful area to grind but randomly they just put some crap in the middle that then ruins what could have been a really cool line. I get that things are there to add environment+scenery but just thought for a skating game it could do a bit better in that area.\r\n\r\n-Cosmetic Prices: This is pretty self explanitory. I would say that the price of the \"premium\" cash you buy is about 3x more expensive than it should be.  Barring me from ever actually supporting the game with currency. Since that is just a complete rip off. The lowest amount you can buy is 7$ where I live and that gets you maybe 2-3 cosmetics(low tier) or 1 (high tier). There is basically no way beyond the season pass to earn the premium currency. And the season pass gives you chump change. Even if you complete the entire season you wont be able to get season pass with the currency earned. You would still need to buy it or wait an entire other season while saving the entire time. MAKE WAYS TO EARN IT. I shouldn't feel \"broke\" after 80 hours of grinding it out but there is no chance I will ever earn enough to get premium. \r\nSeason Pass: Feels majorly unbalanced towards the premium aspect. EG: all the coolest unlocks are premium(go figure) but along with that almost every step of the season pass has about 4 free items then about 6-7 premium items. The part that is most criminal about all of this? LOCKING THE LAST UNLOCK OF THE SEASON TO BE PREMIUM ONLY. Thats right. You heard that correct. You grinded all the way to end of the season? Feel like you should be rewarded for all the grinding you did? Well pay me money to be rewarded. Because the last items on the season pass page that are in the Free category is just a bunch of garbage that you would expect to just get out of one of the WAAAY to many:\r\n\r\n-Loot boxes these game companies that just unnecessarily add loot boxes to everything is just insane to me. This game really drives that home. It is so uneeded and adds nothing of value besides creating future gambling addicts. Which I would assume is EA's goal here. You easily could have just made it so you unlocked each of the things in these \"lootboxes\" via completing challenges or rewards themselves, but you just couldnt help yourselves.....\r\n\r\n\r\n\r\n-Challenges: I find that all the challenges are 1 of 2 things. They are either 1. the easiest thing you have ever done, requiring pretty much minimal effort. 2. You are fighting the jank of the game and its set on extreme. I find so many challenges will have you doing all these precise movements and landings but the game just doesn't set you up for it properly. EG: you will be assigned to go off a ramp and land a trick but the ramp wont line up with anything so you go off the ramp and have no where to land properly. You will see arrows to guide you on these ramps but the arrows are decorations at times because if you follow the arrows you will fail the mission from falling off the area. This is one example of something like this but I can probably think of like 3-5 challenges I've done where it was me just wanting to rip my eyeballs out, fighting the jank of the game, only to not really even feel accomplished when I complete it. \r\n\r\nWhat challenges should be: Actual combinations of tricks or precise lines. This would feel WAY more satifying then me hitting some ramp just right. It would improve on your skill too.  You guys are already almost there, just make them more challenging. You guys should be ok with not everyone being able to complete every challenge. I would love to have something that pushes my skill. Because at the moment it's only myself through my own satisfaction that is progressin me.\r\n\r\n\r\n\r\n\r\n\r\nTL;DR : Early access , Fun, free, overpriced cosmetics + season pass, janky in ways, could use some improvements overall, time invested + challenges isn't as rewarding as it could be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun and good to 0play with friends and ive enohoyed playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actually SO peak i cant even describe it. The  mechanics, controlls, even the SKILLS are top notch, ive js played this game for a little while but im addicted atp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was about as good as I thought it would be. Not overwhelmingly good but definitely not a bad game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes the loudest voices are the ones with nothing good to say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Skate. is probably the first game where ive done and achieved everything but i still want to play it because this game got an unmatched vibe due to all the responsible reasons such as the peak sound design!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun to skate around in. Better with friends for sure. Good customizing options keep the game interesting. Tricks and variations are wide too with lots of places for creative moves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and new experience with amazing graphics, brings back old memories with a new twist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great kill time game. Grind out objectives, go for crazy gaps, have a sesh with the boys. Or just pick it up and kill 10 minutes. I get that people hate micro transactions but nothing that effects the fun you can have is locked behind a pay wall and the game is free to play. I know people will always hold skate 3 to grail status but this game is a solid WIN for gamers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and cool environment, addictive gameplay that makes the time pass by quick",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Seeing the peach pants update was probably my last straw. This game has no foreseeable future and no chance of me dropping any money into this money pit of developmental hell.\n\nIt was a lot of fun in the beginning to meet new people, explore, and look forward to future content.\nYet so far there has been lackluster cooperation implemented to really guarantee a great and unique experience.\n\nI've always loved skate culture and the streetwear fashion that came with this lifestyle, so to see a game with so much potential had me inspired to come back to this era of life again was breath taking for the moment. \n\nSadly; without a correct art style the fans yearn for will slowly push away the people who make the game into a community. If this was an indie dev I would say change could be likely plausible, but EA is a company with shares on the stock exchange. They'll will milk it bone-dry then cut ties with no fan ever asking for a sequel anymore, allowing them to focus on bigger more rewarding cash cow systems.\n\nSometimes I hope my reviews will be wrong",
      "voted_up": false,
      "votes_helpful": 228
    },
    {
      "review": "Imagine adding a battlepass when its early access?\n\nImagine patching funny glitches than actually patching up actual bugs that is harming the game?\n\nImagine not having actual good clothing in the game?\n\nImagine if the devs had the midas touch? Instead of turning things into gold, it turns into shit.\n\nThanks you",
      "voted_up": false,
      "votes_helpful": 153
    },
    {
      "review": "Nah, no thx! \nSkating is on point and fun, but the rest feels unfinished and focused on money. A battle pass in Early Access? Yeah EA ofc ofc, that explains a lot.",
      "voted_up": false,
      "votes_helpful": 128
    },
    {
      "review": "devs seem more interested in microtransactions than making a good game",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great skateboarding mechanics in a very very empty world with noting to do besides grinding the same challenges over and over again to gain currency for lootboxes.\n\nThis is online only multiplayer video game and yet you feel alone. There is no text chat for actual communication and collaboration, no community engagement.\nStory mode missions are short and mostly just for teaching gameplay mechanics.\nSeasonal events focus more on new cosmetics and another set of in game currency than actual gameplay improvements.\nBut this is the problem with Early Access + Live Service game. By the time this game becomes  v.1.0, casual players will have seen and done everything skate. has to offer, there won't be any \"wow\" factors left.\n\nYet I still play it for 20-30 mins everyday just to do those daily tasks, hoping skate. will have something more to offer than a sandbox experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ah you know what, I'll give it a review.\n\nI have 80+ hours across PS5 and PC, 100%'ing the free rewards and milestones. I never spent a penny. I treat this game like a toy I can mess about with for a bit at a time because I was yearning for a new Skate for 15 years, but overall it really is the shallow, tone-deaf, monetised slop you've more than likely heard about.\n\nI gave it the benefit of the doubt for too long, and while I do think the skating itself feels admittedly quite nice, I have gripes with more or less every other aspect of the game. There is zero emphasis on skate culture, zero grit, and zero personality. No pro skaters, brands you now have to pay for, having to grind the same challenges day by day to make progress...\n\nIf a full experience came out akin to Skate 1, 2 or 3, maybe then you could have pried money from me, EA. For now I'll just add to the pile of negative reviews, but if you're looking to just mess about for a bit I guess I could recommend it for that.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Simplified review for you (i have 2000 hours in skate 3)\n\nGraphics: Good\n\nGameplay: Good\n\nMap: Ok (We need suburbs) Why is everything so clean?\n\nArtstyle: Very bad (Corporate hell)\n\nCharacters: Super annoying. (Mute asap) \n\nCharacter customization: Very bad (if you don't want to look gay, you need to pay up.)\n\nEven tho the game is named Skate. The game lacks skateboarding culture entirely.\n\nJust play skate 3.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Great moment-to-moment gameplay, muddied by a horrible approach to monetisation and an art direction so clean, so sanitised, so BLAND, that the game doesn't feel like SKATE and instead, more like some sort of corporate, meta-verse project Zuckerberg had a wet-dream about once.\n\nThere's no grit, no grunge, the art direction is a joke. Progression is an absolute mess because your \"grind\" is linked to levelling up enough to unlock loot boxes from each zone and those loot boxes take three-and-a-half weeks to open each time, because for some reason, every unlock needs to be an event.\n\nThe game has connectivity issues and bugs. I've started up challenges, only to then be forced to reset the game because buttons stop working, as does the UI. That has happened numerous times btw.\n\nThere's absolutely zero edge to this game, it doesn't feel like the Skate culture I remember from the 90s and early - mid 00s and it doesn't hold a candle to the original trilogy.\n\nAlso, for the record, I'm not some free-loader. I'm happy to support free-to-play games financially within reason, but during early access and with the prices for individual, fake clothing as well as a battle pass? No thanks.\n\nI will say however, that vibing with other players in the world randomly, hitting up locales, dropping down some props and attempting different lines with the controls + movement on display here can be pretty fun. That's where the praise ends.\n\nWouldn't recommend supporting it long-term or spending money on it, but you do you.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is my first ever skating game, so I have no connection to the other skates or other skating IPs. \n\nBut I do I hate this game and here is why: \n\n-EA is the publisher (no more needs to be said about that)\n\n-Always online... WHY?? Why cant we just have a single player skating game that has a multiplayer lobby?? How does always being online make the game better??\n\n-Buggy azz mess that seems to get worse over time the more you play. The stuttering 20 min into skating is  frustrating, especially when you try to get challenges done. I cant even do a simple kickflip without the jankyness. Dont let your player bump anything because then they will dramatically ragdoll (which would be funny if it didnt happen over the dumbest shit ALL THE TIME). \n\n-A lack luster verity in challenges and the rewards they give you. This one is more of a subjective statement, but I feel like doing the challenges of the day become very unfun and similar because they just seem to cycle through the same ones week after week. They do add a few new ones (I want to give them flowers where they deserve it, but its not enough to bring me back or care to get it done). I also feel like they are always in the same places and never in spots or areas you dont skate. The rewards are very hit and miss. Some of the stuff is pretty rad (like the sponsored stuff), but the rest is barely worth getting in my opinion. It feels like you are collecting to just collect (which I normally love), but in this game is very unsatisfying. I do appreciate that they made opening boxes less time consuming, but It doesnt motivate me to care or continue to open them any longer.\n\n-The map kinda sucks. I feel like San Van isnt a bad map, it does have some great skate spots, but I wish we had more verity in terrain, scenery, structures. It almost feels empty and void of real live. The cars and people are there, but they really dont add life to the city. One part of the city still isnt even open and this season (Season 2) they finally added a few challenges over there, but not enough to get people to hangout. Also when you turn off cars and people in the settings, they just go invisible, but they are still there! Vee will still say the stupid lines when you \"bump\" into them. I wish they just had multi maps that we could choose from instead of being trapped on this hell island called San Van.\n\nOther random gripes: \n\n-The tutorial people are annoying as hell, all of them!! Also the devs missed an opportunity to make them real people in the game you meet up with. Its kinda lame to have them just pop up as a picture with a speech that I could care less about. \n\n-You get all these cool skating props (the one fun thing to collect), but can only place 5 down, which is lame\n\n-The music is okay, I just listen to my spotify most of the time\n\n-The skating its self is fun and feels good at times, but the rest of the game is not and it makes it hard to care or want to get on to play anymore.\n\n-No Afros! (that one is a personal personal gripe), but really???\n\nTo summarize, this game has pissed me off so bad that Im done playing. Thankfully I can skate in real life, so Im going to go do that! \n\nThank you for coming to my Ted talk! Tchau!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I can't in good conscience recommend this game to anybody. There are things to enjoy about this game, gameplay-wise it's one of the best skateboarding games ever made... Unfortunately that is where the positives end.\nSeason 1 has been a genuine disaster. Before season 1 the game was buggy but that was to be expected, I was hoping that the game would only get better more updates came through...\n\nINSTEAD\n\nSeason 1 has introduced so many bugs that the game is damn near unplayable. Things that just worked before are now completely broken, for example, the co-op. The thing the game is designed around. Not even the microtransaction store works properly anymore. If future updates break the game as badly as season 1 has then in 2 seasons time (if the game makes it that far) then it genuinely might just brick your pc. Not just that, these bugs that WERE NOT THERE BEFORE will not be fixed for MONTHS. Why can't bugs be fixed in a normal timeframe? It's not like this is an indie game with single digit numbers of developers. There is absolutely no quality control at full circle. \nNow lets get to the actual content of the game... THERE IS NONE. YOU LOG ON, REPEAT THE SAME TASKS AND \"CHALLENGES\" EVERY SINGLE DAY THEN LOG OFF. This game is not a piece of entertainment, it is a job, a shitty one that doesn't even pay you. There are no deathraces, no games of s.k.a.t.e, nothing.\nLets move onto the battlepass... THE SAME BATTLEPASS YOU CAN'T FINISH IF YOU HAVE DONE EVERY SINGLE TASK AND CHALLENGE IN THE GAME.\n\nFuck you EA. And fuck you full circle. \nI can't believe the game is more broken now than when I playtested it last year.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Most of the challenge requirements are buggy and won't get credited. Forming a party with friends does not work resulting in frozen loading screens and dissappearing buttons and options. Recent nerfs in ingame experience makes it not worth to play daily any more.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly I feel stupid thinking that EA couldn't possibly ruin another great gaming franchise, but I was wrong. I get the game is in early access but the fact you have multiplayer co-op and break it with an update so you can't co-op with you're friends is crazy but the fact you leave it broken for two weeks instead of fixing it straight away as soon as it came to attention is laughable. Honestly even though it's free I feel like they should have paid me to playtest such trash, really not worth your time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Season 2 is unplayable. During challenges kept freezing when v was talking causing it to not be skippable and the only way to get out was alt f4. Happened 3 times in 3 challenges",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the only thing good about this game is the core skate mechanics (being generous) \nthis game is so fucking dog shit and upsetting that i actually had to take time out of my life to write a review on it...\n\nthere is an ungodly amount of microtransactions in this game, sure its a free game but genuinely who wanted that. they have managed to add a battlepass in an early access game. in my opinion a battlepass doesnt really sound that bad, 10 bucks to get a bunch of cosmetics sounds like a great idea, but of course they had to fuck it up. i can name about 3 things out of that battlepass that looks cool everything else is just random slop that they threw in there or maybe stuff that didnt make the cut for the item shop. i literally have 7000 battlepass tokens unspent because theres nothing good in there. what a waste in 10 dollars.\n\ni wouldnt care about all the microtransaction stuff if the game was fun and addicting. the gameplay loop for this game is truly garbage. the missions are not fun at all and feels like such a chore to do. since the only free cosmetic options are loot crates, these \"chores\" do not feel rewarding at all. it feels like i can do 100 missions and only get an ugly ass shirt and random props. nothing about the missions make me want to keep coming back. this game is so god damn boring, they hardly added anything you can do with your friends (other than the missions) when me and my friend play this game we skate around and do dick all, thats all you really can do. ALSO this game has a problem with trying to join your friends. theres always a chance you just cant sometimes either because their game server is full or the game just hates you and wishes nothing but the worst for you. with the servers being full you cant change the server your in so you sometimes have to restart your game and just hope you'll be able to join them. theres also a glitch where if you do join your friend you might not see them, like they're completely invisible... TO THE DEVELOPERS, WHAT THE ACTUAL FUCK HAVE YOU BEEN DOING THIS GLITCH HAS BEEN IN THE GAME SINCE PRE ALPHA? its a multiplayer game and they just let that happen, no solution. (i do believe this got fixed as i have not experienced this in a while but it was in the game for a really long time) \nAlso i dont know if this is just me but the camera in this game feels just the worst. i know you can adjust it but it doesnt really give you much, i still mess around with it and i just cant seem to find a good angle, it just seems poorly made.\n\ni wanted this game to be good so bad as i love skate 3. i went into this game trying it as its own, not comparing it to skate 3 and not nitpicking anything, a completely open mind. with that being said, this game is so bad and such a huge disappointment. a skate MMO would have been the coolest thing ever, unfortunately, the development team as a whole is lazy, greedy and just doesnt care about what the community wanted in the slightest.\nI tried to like this game so much but now every time i get on i just get bored and upset that this game is not good.\n\ni hope we see a complete 180 for this game soon.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Initially I did love this, and to some extent still like it. This is entirely because the skating mechanics are fun and I can happily pootle around doing not much.\n\nHowever, the monetisation, which I was ignoring, is so in your face it has really started to grate. Loot boxes and digital tat everywhere. I've been doing seasonal stuff and the Halloween content for something to do, but I spent none of the tokens earned because it's all rubbish anyway. Didn't realise I would lose all I had earned at the end of the event though, that annoyed me more than it should have considering I spent none!\n\nI played throughout the alpha phase a little and what I have wanted from the game the entire time is a story mode that you can play solo (or coop with some friends) with the classic elements like hall of meat and s.k.a.t.e. I don't really care what my digital avatar is wearing... :) I would happily pay for this, but I won't be buying into this seasonal FOMO content.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The gameplay is pretty solid, but the rest of it is basically the gaming equivalent of a mandatory corporate training video.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The only game that gets worse with every new update. Thanks for destroying a great franchise, EA",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a dissapointing soulless live service cash grab. That's it. Instead of a story or any soul, you get the cringiest, terrible voicelines by some \"AI\" and characters you wish you could punch. I honestly would have paid full price for skate 3 to be released on PC instead of this thing. \nPrepare yourself to spend way too much time in a tutorial that lasts the whole game, explaining things you already learned or figure out on the fly. \nThe map is terrible and I don't have any hope they will improve it. A flat soulless world, made so you can show of clothes while wishing you actually had a decent spot to skate.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overly monetised low effort piece of shit. The skating feels nice but everything else is designed to suck the soul from you and its not even good at it. Laziest most obvious attempt at a cash grab I've ever seen",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Played the crap out of Skate 2 and 3. It's nice to be able to skate around, hang with friends.... for all of maybe 20 minutes...\n\nThis game has no soul.\n\nMechanically, it's still Skate, but it's just lifeless. There's no incentive to grind out the game. The daily challenges are a joke, usually completed within 30 minutes or so. Weekly challenges? Maybe another 30-45 minutes. The only reason to play this is to avoid running an emulator to play Skate 2 or 3. I would gladly pay money for both of those games again if they were available. The only redeeming quality of this game is that it is free.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Decent start, but as of right now there isn't enough content and the game has performance and connection issues and I cannot recommend it right now because of those reasons.\n\nAlso it's Early Access and the game has a ton of microtransactions and already has battle passes. The fact they are selling cosmetics and battle passes and the game itself has barely any content is pretty shady and greedy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "mid. standards are below the bar from the old games. catch me playing skate 1 and 2 before i keep wasting time on this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just a vehicle to sell cosmetics. Spend five minutes getting into the game to have it crash five minutes later. What a shame.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "disgusting souless corporate greed, i waited 15 years for this game and it's complete f2p dogshit with 4 different in game currencies and a battle pass in early access. i have never been more disappointed in a game release until now.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I cant help but cry laughing at this game losing 92% of its player base in 2 months simply because the company behind cant control there greed. Thankgod this game has failed. I hope youve lost billions EA",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Absolute fortnite wannabe slop dripping in rainbow politics that forgot what made the Skate series good to begin with. Just souless, ugly, annoying to look at and and listen to, no coach Frank, just an AI annoyance that'll make you mute all voices ingame within minutes, no actual skate culture and a terrible city full of bald, same faced, ugly androgynous NPC's that are constantly in the way and add nothing to the game aside from a bit of laughter at their expense. Nothing about this is Skate, it's just Fartshite with skateboards. Session is THE skate sim. This just wants money for boxes full of alphabet mob garbage. So bad I had to remove it from my account so my friends don't see that I have it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "maybe try making an offline game if u cant make the multiplayer work right without 200 bugs after updating",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'll keep playing it but it's still incredibly meh. Seems as if it was built as an item shop before it was built as a skate game. EA is as EA does.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "doesnt work on linux due to a shitty invasive anticheat, why tf does a skating game need an anti cheat? let alone a kernel level anticheat",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "10+ years to make and its just a worse skate 3\n\nThey just removed a pair of shorts in the free to play pass because people who paid for the premium pass whined that the free shorts looked too similar to pants they paid money for......\n\nUninstalled lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game runs like dogshit for a 9 gig game and it's just a generic EA cashgrab.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The gameplay is the best there is out of any skateboarding game, the steeze is unmatched. The animations, sounds, controlls - pretty much perfect. \n\nEverything else either leaves room for improvement or is just disappointing me over and over again. \nThe map is decent, but after 30 hours you fell like you've skated everything. I thought the \"New spots\" are going to be actual map expantion, like new islands, more street-style parks, etc. But it's just wooden pieces in random parts of the map. Season 2 improved on this, but again, these spots will become stale pretty fast. \nThe art style is moving in the right direction, because ea couldn't just ignore all the criticism and negative feedback and had to do something to not kill the game. Now we have orange lighting, more grittines to the ground and better character models, but the hair still looks awfull, you can't change the gender of your player and there are only 3 usable body build presets that look remotely decent and not absolutely hideous. \n\nAll of this would be acceptable and understandable, but the game is riddled with bugs to a degree to a point whrre you don't even want to log in. \nFor instance, day one of s2 allready has mission softlocks, not being able to progress and settings that are resetting by themselves.\nOn top of that, the skatepass is underwhelming again, barely any good items and the f2p players are left, once again, with nothing. \n\nHonestly, i don't even want to log into the game anymore. It feels more like a chore, i don't get any excitement from playing the game. If i could, i would put the game in its current state in the \"meh\" category. But because im sick and tired of seeting how little is done and how much is promised, im giving the game thumbs down. Clown this review all you want, thanks for the free steam points.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "so ahh bro. graphics suck, no skate culture, this game feels and looks like it was made for a quick cash grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the suits got a hold of the legendary skate franchise and have officially killed it with this long anticipated sequel. words cannot describe how disappointed I am with what i'm calling \"fortnite on wheels.\" it disrespects skating culture, mocks previous (successful) releases, and misrepresents what players want in favor of the shareholder. this game represents everything wrong with the gaming industry today. dont waste your time. buy a used console, get your hands on an old copy of skate 2 and relive what once was.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very sterile and corporate feeling, was playtester for 1 year or so(?) and didn't notice any noticable improvement during that time. I do hope for this game to improve, it's sad to see what they've done with such an amazing franchise.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a mmo with no way to socialize, no text chat,\npoor performance,\nsoulless map/settings,\nboring cosmetics \n\nphysics are good and will entertain you for 30 minutes, and at least its free but nothing really enjoyable about this, just get a real skateboard/bike and go outside at this point",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "more cosmetics less gameplay",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game, but thumbs down until the rip score screen is fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generative AI slop, do I need to say more? The art style is derivative at best, clearly using fortnite as inspiration for the AI generated art style. The skating feels clunky especially compared to games like Session or SkaterXL (Even if it is a dead game).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Has nothing to do with \"skate culture\", which by the way, no skater has ever used the fucking term \"skate culture\". I'm tired of getting crop tops and leggings and golden unicorn rainbow buttplugs to put in and on my fortnite character in a skate game. I Waited 15 years for this sloppy, paywall driven, out of touch waste of time and energy on both the devs part and the players part. I know its \"free\" but I would have paid a large sum of money for a game that dignified Skate's legacy. We wanted skate, you gave us something that could have been a fucking fortnite update. eat shit.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Season 2 ruined the game , broken sounds, slow gameplay and characters that look like sum black goblin\nthey made a good game into sum gay shit",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was going to say \"I'm convinced that EA could be given the GTA franchise & would ruin it in less than 1 year.\", but \"convinced\" isn't quite the right word. \"certain\", & \"undoubtedly.\" are more aligned with the truth. EA has 100% proven, through their actions, & over the course of decades, that they're a scam. They're a storefront first, that offers some half put together game of a once beloved franchise. Their entire business strategy is to prey on the nostalgia strings of 90s kids, then market their games towards children, to maximize their potential demographic, to maximize the amount of people they can expose to their scam that is loot boxes, microtransactions, card pulls, & battle passes.\n\nThe fact that you can dress your character up like a poser, solely to appeal to kids & woke ideology, is everything you need to know. They compromised artstyle, gameplay, character customization, soundtrack, & worst of all, skate culture, JUST to try to market the game to children, who, care little to nothing about skating or skate culture.\n\nThe fact that the game is in \"Early Access\" but has a fully fledged battle pass, loot boxes, microtransactions, & store, is also proof and evidence that EA cared more about the potential monetization of this game than the actual game.\n\nAll of this, without mentioning the countless amounts of bugs that have been in the game for years now (because the game has been in development hell for years) that there is 0 mention in the patch notes about fixing or intending to fix. In Skate 3, if you had a lot of speed going into a vert ramp, it launched you in the air for a solid 3-5 seconds. In this game, you could speed glitch into a vert ramp & it'll either knock you off your board for having too much speed going into a ramp, or all of your momentum magically gets killed about halfway up the ramp & you get like 2 seconds of air max.\n\nI cannot in good faith recommend anybody to spend money on this game. F2P is the only saving grace here. It's a fun game for 6 hours or so, but it seems like the game goes out of its way to make sure you stop having a good time.\n\nI read somewhere that this game feels like the video game equivalent of the brand change of McDonalds in the 90s, to McDonalds today & I think that sums it up better than I ever could.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this fuckin game sucks and its insanely buggy, from completing mission crashing your game to, invisible party members i cannot recommend this game to anyone. do not install this garbage. its unfinished and all they care about is micro transactions",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is just bad. But it's free, so try it if you want.\n\nBeing my first try of a Skate-franchise game I gave it a lot of time and didn't post a review until now 90 hours in. Yeah, the cosmetics, \"skate culture\" and microtransactions are absolutely diabolical, grade A tier bullstuff from profit-gaming-company hell. But other than that, the skating is at times good, even so I spent 90 hours having maybe 60 hours of fun just skating, farming challenges (that are repetitive as can be) and just chilling. Since the core skate mechanics is somewhat fun, I can dig it. Sadly they won't improve on the terrible cosmetics and art style of the game, as well as in 2025 not having a single physical NPC to talk to (we have an A.I. \"companion\" though and three portrait-characters speaking to us sometimes). Despite their art-style mimicing The Sims or Fortnite (trying to become a Fortnite-esque popularity game) and microtransaction idea being terrible skins and emotes + dances that you can show off to other players, there is really no ever use for it since there is no community or place in the game to actually try and communicate with other players. No one stops or tries to use these mechanics to talk or show off to eachother since it just doesn't work. It's a skate game and everyone is focusing on skating, not ever stopping, and because it's unviable.\n\nWhat really bothers me in the end though is how f*cking broken the game is. In Season 1, coop challenges softlocked us at start and we couldn't press any button except ALT-F4 to close the game, because it sucks ass. In Season 2, congratulations! (x3 with pink and neon colours), now you are softlocked exiting a challenge because aforementioned AI \"companion\" wants to say some uninspiring line after you completed the challenge, and now you can't press anything to continue. You're softlocked and have to exit. And this is from EA, not a small studio. Absolutely garbage tier stuff. It's as though they don't even want you to play the game, they actually gives you an outing to exit it because you literally CAN'T play it. But, you have to use your own computers method to do so, because the game fails on that option too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this is one of the shittest made cash grab i see it gets fucking stuck on the most simple shit please jus make a skate 3 remastered not this dog shit wannabe",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel like performance is getting worse. The new tunnel area is almost unplayable. How does a game that looks like this run this badly in 2025?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DO NOT SPEND MONEY ON THIS GAME i will keep my review negative until i can confirm that the devs who have made and refuse to take out broken challenges in the game. challenges will straight up not work as intended, like the stunt jump onto the lilly pad, you cannot physically do everything in one go, so you have to first hit the lilly pad, reset and then do the other parts of the challenge. the game snaps you to shit you dont want to snap to, the game will make you randomly fall for no reason in the middle of a grind. there is 0 chance that they play test the game. people are reporting items missing that theyve previously claimed. this is not someone bandwagoning the hate on skate. i spent money on this game. oh and you wont complete the battlepass unless you log in every single day to do daily tasks for enough tix. its just laughable how this is continuing on. please devs, show me you doing the nosebleed grind challenge without it glitching tf out and flying you off your board",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont get how greedy and lazy developers can be i miss when games where passion projects not fucking revenue farms\n\ni will probably come back to this game every now and then cause im too lazy to emulate skate 2/3 but this game is so incredibly bad that i wouldnt recomend it to people even if i got payed. the whole game feels like its held toghether with duct tape, hopes, and dreams. and they prommise huge updates with loads of new tricks and clothing while in reality they just decided that you now can wiggle your feet and board while handplanting and adding like a single ground trick (the impossible) i have even noticed some of the old skate pass' premium items apearing in the new one as non premium (those rugged beat up looking boots) meaning that if people spent money on something they wanted and the next update the developers just disided to shove their middle finger up their customers asses and wiggle it around\n\nalso lets talk about the new skate pass almost the whole community wanted the game to look grittier and claimed the game looks toO clean and cartoony, and what do they do? ADD HAPPY RAINBOW PINK AND YELLOW SKATE PASS FROM THE 80s THE MOST CORPORATE \"lets make this game alternative looking to appease the alternative fans without scaring the normies\" MOVE EVER, AND FOR WHAT? TO MAKE THE GAME EVEN MORE BUBBLY, HAPPY, SPARKLY. PEOPLE OBVIOUSLY WANTED THE FUCKING 90s LOOK AND FEEL AND YOU GO THE COMPLETE OPPOSITE. HOW CAN A STUDIO BE SO DISCONECTED TO ALMOST THE ENTIRE FANBASE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "really bad and not like the old skate games. also takes a long time to load into the game and when your getting back to the session marker.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck giving EA my info just to play a skateboarding game. \n(edit) - Tried again and took an hour to log in because my steam username was a prohibited word on EA's site. I am litteraly named after a Transformer, im named after a character in a fucking babies show and its a prohibited workd 0_0\nNow lets talk about the game\n clunking physics that make you feel like your boarding on Jupiter\nthe character customisation is worse than what you could find on PSP games\nyou cant even customize your own fucking board. no changing the grip tape underside of the board or even the wheel ( the #1 thing skate actually customize.\nthe only way to get clothes tho customize YOUR chatacter is by buying \"skateboarding loot boxes\" i guess and from doing challenges where your reward are useless items of chlothing you didnt want , you cant pick what clothes you want from the store and buy it with in game currency you got.  In order to creat your own character in this game you have to gamble. the first 1 hour is not you having fun doing tricks or xploring the city, no, you are forced to do terrible challenges you didnt want to do. also the game continuously runs like ass because of all the players bing rendered at once (cant be adjusted btw)\nthe game constantly interupts you while doing stunts and tricks to pan the camera towards so bullshit task you never wanted to do. also the game impssible to get running smoothly because of poor optimization and the graphics settings are pretty much worthless and not even worth being there\n\nall round one of the worst gaming experiences ive ever had all because EA wont alllow us to use our steam accounts",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cant even launch the game and always black screen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is perfect for people who don't want to do any critical thinking and play video games for mental stimulation instead of actually engaging with the content they consume.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wanted to play. Seemed fun. Every single time I log into the game, it completely resets ANY character customization I've done. Thanks for the \"free\" money for clothes, can't enjoy it. Character resets any time I log in. Let me know when the game works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Corporate Greed and Live Service models are a plague to modern videogames.[/h1]\n\nThe skating feels absolutely amazing and the parkour is surprisingly good, dare I say it's better than in most games that include parkour mechanics. If there's one thing that Full Circle absolutely nailed, then it's the gameplay.\n\nHowever... while this game plays great, it SEVERELY lacks in everything else.\n\nI may have said that the gameplay is great, however there's so much missing. Season 2 promises better handplants and impossibles, alongside an improved replay editor. Season 3 promises darkslides and new gamemodes. But that's exactly the problem, why are we being drip-fed content that was available in Skate 3 on LAUNCH? that game came out 15 years ago. We had more features in a game released 15 YEARS AGO.\n\nThis is an issue with the live service model. In order to make it seem like we're getting \"new content\", they're just adding features that should've been in the game on launch. So many features are currently missing. What about game of S.K.A.T.E.? What about hall of meat? Why is it that we don't see an x-ray of our bodies when we fall from high up? It's all in the details. This game is missing a lot of them. But you'll get to experience those in a couple months time! Maybe if you buy the battlepass, they'll add stuff faster! But what do publishers love most? Money and Denying accountability. \n\nThat's why this game brands itself as \"early-access\"\nHowever, if you sell in-game currency for up to 100€, Have a fully functioning seasonal system with battlepasses and 20€ cosmetic bundles, then you're not in early access. This is a fully released game, disguised as an early-access title in order to avoid any criticism.\n\nWhen it comes to visuals, they are extremely lackluster and lack STYLE. \nUsually I don't comment on visuals in a game, but with a skating game and Skate games in particular, you expect a certain tone and art-style. What at first (back in 2022) looked like a dirty, grimy, realistic looking skate game, now looks like Fortnite for the lack of a better term. It's extremely cartoony and unlike Fortnite, the customization leaves a lot to be desired. You cannot change the color of your clothes, you cannot change the position of your cap, there are no tattoos, you cannot color your hair with custom colors, there's next to no body shapes and I could go on. It's quite the paradox actually, because despite the game pushing so hard for cosmetics, there's not only a very narrow selection of them, but the quality LACKS. There's very few Boards, Grip colors, Grip patterns, Hoodies, T-shirts and so on. Cosmetics in the shop are extremely overpriced and rarely look good. The cherry on top, is that the vast majority of branded clothing/customization is paid. Most of the free branded items are either stickers or really bad looking clothing.\n\nOn the topic of branded clothing and other customization related to real-life brands, why are there no real-life personalities? Where are all the pro-skaters? Why are the only characters in the game just voices, rather than actual people you skate with? And why does Vee... exist at all... which brings me to my last criticism.\n\nThe dialogue & story in this game is genuinely horrible.\nFirst of all, why didn't we get a singleplayer mode for this game? Since there's no singleplayer mode, it's only a matter of time before the plug is pulled on this game and we will never be able to play it again. People who paid for cosmetics? your money is forever gone! Oh, you wanna play the game? tough luck buddy! it's an online-only game! Anyways, the \"story\" is just a bunch of tutorials one after another. there's like 2 characters alongside Vee that briefly describe what the current story (tutorial) mission you're doing, is about. The dialogue is whatever, but what totally kills it is the delivery. Every single character in this game, talks like a robot. The delivery feels so fake, there's absolutely zero emotion behind everything they say. It feels as if these voices were done by AI, which brings me to Vee. Vee is singlehandedly the most annoying part of the game. Not only is she terribly unfunny, can't ever shut up, but most importantly of all she's an AI. THEY LITERALLY PUT CHATGPT INTO THE GAME. What did Skate 3 have in place of Vee? Coach Frank. An actual person that skated with you in the game, and helped you get better. Coach Frank was replaced by a soulless version of ChatGPT.\n\nAs of right now, changes are coming way too slow for people to care and people are dropping out en masse. However, even despite that, there's a chance for this game to make a serious comeback. Unlike a lot of other games, Skate. has a REALLY solid foundation. The core of the game is good, they just need to focus on adding content. FAST.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Skate, do tricks, buy stuff with credit card. that is literally all there is to do, no hall of meat, which was the best part of the games imo and they removed the x ray skeleton thing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's definitely a reason that it's called \"skate.\" and not skate 4. It strayed pretty far from what the original trilogy was.  Not a big fan of the new art style, everything is too \"clean\" and the characters look pretty cartoony, which is why they contrast with the environment. However, I will admit that the controls and gameplay feel much more responsive, even though more than a handful of tricks are missing (I can't complain since it's early access). Overall the game is pretty much \"meh\". If there was a neutral rating, that's what it would get from me, but since there isn't, I'm leaning more towards negative. I do believe the game can change and improve but I feel like EA won't give it the chance if the player count keeps declining.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "..meh... I was stocked because it was a free skateboarding game but this is pretty miserable for the hype it had\n\nEarly access but it has a battlepass lmfao\nYou cannot play singleplayer so prepare for the great wipe of all of your hard work one day, maybe it'll come much faster than we can expect now \nDaily challenges that are the same challenges you did yesterday so you keep doing the same damn thing over and over again... and many of the clothes are so badly designed. \n\nHowever I expected much much worse from EA so it's not too terrible, but it still feels very very very far from being a great game you could play for hours with your friends.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this has nothing to do with the skate series and even as \"just another skateboarding game\" it's mid and there are a handful of other games you should get instead.\n\n-There is no story mode instead you get to do the same challenges everyday\n-No more realism, cartoon graphics and flying through the air instead\n-Customization is ass (there barely is any), from you char to the clothes and accessorys of which most are locked behind micro transactions\n-And don't get me started on how EA just shits on skate culture.\ni could say so much more but if you loved Skate 1, 2 & 3 this game is not for you but ay it's free so make up your mind \n\nskate is gonna be like fifa, 2k and madden. a soulless quick cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hell yeah simulator and good with friends, but very boring after like 5 hours and you cant play with keyboard. Its a free game though, so not complaining.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute dogshit compared to older games in the series. Get pretty boring after you have done the mission cycle once. After that its repetitive gameplay. Shop is fully functional including battlepass in EARLY ACCESS, but there still are gamebreaking bugs. Gameplay wise it's literally either same missions or DIY. No other gamemodes(Throwdown is a joke). Starting missions just deloads everything but the map and you can only free skate around...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gameplay, good. everything else, trash. The worst map out of the entire franchise, it's so boring. i can load up s2 and still find new spots. this game, im bored in 30 minutes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks. A lot.\r\n\r\nwhen the game first released (still in early access at the time of posting) i actually had a lot of fun playing. There always seemed like something to do and new places to explore. Months later and I cringe at the thought of launching this game. I think its based on a lack of creativity, as the game feels like it was designed by Google's human resources team. Boring, Basic, and Disappointing. Don't get me wrong, I loved skate 2 & 3, but the team is rolling in their graves after seeing this Fortnite Mobile rendition of a skate game. No darksliding, no new tricks, no good clothing, no new missions, small and repeatable map, thousands of bugs and glitches, and a terrible art style. I currently have 90+ hours on the game, and every achievement. I still advise against playing this and hope that if you do, you can somewhat enjoy it.\r\n\r\nAt least its free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "constant bugs and issues with the game yet the ingame store (early access btw) has never had a single issue showing where ea's heart lies in making this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just another soulless corporate cash grab. The loot boxes, the uninspired artwork, horribly cringe dialogue, it just all feels so rinse repeat and similar to every other free to play with a season pass. The game has no depth or soul and the multiplayer is literally just sharing an open world with other people. The only redeeming quality is the gameplay but after a few hours of playing I find myself launching it for maybe 20 minutes to skate around and find myself bored.\r\nEarly access from a Triple A dev just screams lazy and if I had paid for this game, I would've requested a refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As a real life skater and a lover of the previous games, What are you doing? you had a huge opportunity and you just decided to chain it up with the rest of the slop this company makes. i hope you chalk on every pebble in the park... oh wait, this game has shown me you've never actually been to a skatepark. your idea of \"skate culture\" is actually abhorrent.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is really fun... when it works. played 80 hours flawlessly and now after the maple harvest update I cant even launch the game, endless ea anticheat error (7)(2)'s no matter what troubleshooting I've tried. Fix the fucking game before you cram its asshole full of shitty microtransactions.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "50% of the time i cant even get in because im not allowed to play offline in a singleplayer game. this sucks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "great game that could be even greater if they would actually work on the stuff that matters, first of all the 10 second unskippable cutscene that happens after opening a box is pretty annoying (along with the second cutscene after showing me what ive already seen) my game crashing randomly for no reason is also not a lot of fun, and the last thing is that theyre super out of touch with actual skate culture with the cosmetics in the box's and store. No i dont want a rainbow croptop, no i dont want a pair of bright green tights, 5 real world dollars for a pair of glasses? id rather not. Gameplay is a good 8/10 while everything else is a hard 5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its fine i guess gets stale real fast no new game modes or anything just challanges u repeat everyday",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a True skate game, boring time based challenges where it halts progression and you have to wait either the next day or a week for the challenges to refresh, was ok for the first 2-4 weeks, now just boring and repetitive. tldr boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Corporate skate game desperately trying to be trendy. Dishonouring skate culture",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I might continue playing this game just to kill time but i cannot in good faith recommend it right now.\n\nIt literally feels like every component of this game is falling apart at the seams at all times. Party system is busted, missions lag friends out, textures not loading. Literally the controls themselves do not work, you will do an ollie input 5 times, you will get 2 ollies out of it because the game just goes \"idk what youre doing\"\n\nDont even get me started on the \"characters\" in this game. Whoever decided to have a 50000000 page script for this game for its characters to mutter mundane garbage at you constantly, i need to speak with you just to ask why? Why does Vee talk literally all. the. time. at all points, Vee is saying something to you. This is the first game ive ever turned character voices off completely for, i cannot stand to hear a single other word from a character in this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a stain on the skate franchise. Sure the gameplay in a vacuum is nice, but there isn't anything interesting to do. All there is to play are the \"story campaign\" which is just a drawn out tutorial and then daily missions to do to grind out an in game currency. There are no pros, no own the lots, no real hall of meat, no deathraces, no nothing except for lines \"own the spots\" and session challenges. The own the spots are just a watered down version of the ones we see in previous installments. The art style is so corpratized and bland that it looks like a non-liscenced game a character would play in the background of a show. They have a fucking battle pass. Skate is dead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after 100%'ing it, i can safely say its corporate live service slop. The gameplay is amazing but it feels lifeless.\r\nif you have no cares for the \"story missions\" or whatever and just want to skate with good mechanics then this is the game for you but it was so annoying playing for >40 days in a row just to do my dailies and stuff to then hit the crates to get achievements.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I WOULD say that the only redeeming quality of skate. is the gameplay, however the most recent update breaks even that so I have no clue what the point of playing this game is anymore; the map is bland and too skatable leading to very little creativity for lines that don't require flying around, challenges aren't actually new and are just rotated around day to day, there's an entire section of the map that is \"locked\" yet you can still skate there (seems like they're too focused with cosmetics that will make a quick buck than actual content), and they have 3 different currencies--2 of which require real money or several hours of grinding just to unlock a miniscule amount in return. This game feels like it was skate run through a corporate AI filter (like the AI music that takes up 75% of the game's soundtrack) with a sprinkle of crypto gambling on the side for EA to make some easy money. Don't waste the time or money so EA knows to make some actual changes and I'll come back and fix my review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Soulless game that doesn't care about skate culture and only cares about pushing micro transactions on the player base. The game play is quite good with the skating/transitions feeling smooth however it stops there. I will play for a couple more hours then drop it...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is good but that's the only good thing i have to say about this game, Everything else in this game sucks and even with any updates this game in the future it will get always be an inferior product and its not what the people wanted, Its what EA wanted to put out so they can milk gamer's for all the money they can because 5$ for a pair of shoes in this game is crazy dont care if the game is free & early access thats irrelevant.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I gave it some slack at launch, but focusing more on micro transactions, season passes and downgrading rewards so that players have to actually play more is kind of a shit move.\n\nAlso using a Kernel Level Anti-Cheat is bizarre. I get it you don't want people to cheat your fantastic store but this would have legit been a perfect game for Steam Deck if not for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is utter shit grinding does NOT work worth a damn the tricks you do from controller to game does not correspond with what your doing you'll do an ollie and your character will do a kickflip or something completely different the missions do NOT track properly ive done the same missions over and over again completing all of my tasks and it will not count them at times the game occasionally wont start a mission instead it takes away your hud and leaves you in free skate you cant pause the game bring up the map nothing. Skate Is MILES behind skate 3 even skate 2 for that fact for a free game this game is worth free but I refuse to put a single penny into a game that doesnt even work properly. GAMING COMPANIES NEED TO STOP RELEASING HALF ASSED GAMES AND ACTUALLY COMPLETE THEM POLISH THEM BEFORE RELEASE THIS IS A LOAD OF BULLSHIT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Skate being free? Whats the worst that could happen? Everything is monetized, so any memories you have of previous skate games and being able to actively choose your attire, board and such is behind some form of currency. Whether youre gambling on what youll get from loot boxes to having to spend real world currency for a specific item from a brand (assuming they have it in the rotation at the time). The real crime is that they've sanitized the game to a nauseating degree so they can market it to children and not someone who is genuinely into the culture of it. I guess if you want a skating game, this is really it unless you prefer Tony Hawk since the other skate games aren't available on steam. You knew it was going to be bad when in the early access and beta, things were iffy at best but you better believe the microtransaction store was perfect. I was invited to test it out when it was in it's earliest stages, and it really is a nothing burger of a game. I really cant be bothered to come back to it, but I tried today and all I felt was a longing for literally any of the other 3 previous Skate games. It's depressing but it also feels like a perfect analogy for how corporations will take something unique and try to clean it up so they can sell it to the most people, really a wide net approach if you will.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "legit cant play the game all its saying is i have no internet connection for the last month F EA and F skate dead game anyways buggy af f early access just dont download it and dont give them money ffs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is not made by skaters for skaters.\nWhile the skateboarding can be fun at time the overall product of the game is not.\nIt feels very corporate with no real skater grit behind it.\nThe microtransactions would be better if we had more than just zumiez brands as well.\n\nThey need to focus more on listening to the community instead of pushing out half-ass updates.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "normalmente jogar com amigo melhora os jogos, mas aqui jogar com amigo é tão bugado que da vontade de comer chumbinho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "+rep for good skating mechanics & animations\n-rep for horrible f2p store\n-rep for no skate culture \n-rep for AI assistant\n-rep for horrible challenges \n-rep for daily tasks\n-rep for bad replay editor\n-rep for planned mobile deployment\n-rep for killing a franchise",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is okay but it don't work on steam deck, as a controller is mandatory to play the game I would of thought they would of tried to get it working on steam deck if support comes in the future or they sort out some decent cosmetics then i'll update this review only good thing is the core game works on computer, if you excuse the lag that some times happens and being unable to finish co-op challenges as it does not track properly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First off, I loved skate 3 and I do genuinely enjoy the core game play here. That being said, I really tried to enjoy this game and I did for a few hours. However they seem pretty set on making sure this game sucks to play for longer than 5 minutes. If you (like me) enjoy the core game play, prepare for frustration as you are assaulted by loot boxes, horrible visual vibes (soulless buildings, clothes, etc.), and most importantly the other players. This last issue is not possible to ignore, I tried to for hours personally, but as you keep playing you will continually experience other players spamming obstacles. This would be fine if you could just turn it off (Single player??? Private lobbies???) too bad we live in a online only \"paradise\" and when paired with the bugs riddling the feature placement system it is just not possible to play around this and quite frankly why should I have to? Why must I disable every stupid rail or ramp some random 5 year old puts down? Today was my final straw, I logged on 3 separate times to unwind and do some tricks while I am sick today and EVERY SINGLE TIME I was greeted with rails and other BS smack dab in the middle of stuff I'm trying to hit and EVERY SINGLE TIME again the garbage \"disable menu\" or whatever you want to call it bugs out and won't let me remove these obstacles in my way. For this single reason I cannot recommend this crap to anyone anymore even if it is free. The most depressing part of this in my opinion is how EA and other corporations in this industry need to take a long hard look inward, the source of these issues is plain as day! Stop burning out good devs, stop pumping out cash grabs, and maybe one day we can have a modicum of respect for the industry again I am truly in shock at how far and few between good game releases are in the AAA industry at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "since update i can't play for more than 3 minutes. endless crashes. worthless",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Beta was pretty good, then it comes out.... Game is online only yet it feels like you're playing with bots or npcs. I wanted to like the game but its pretty boring at best with its forced \" show you the way\" quests that involve other players are near impossible to complete. maybe one day.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's fun for a few hours but compared to skate 3 it's just boring and repetitive. The world gets boring it's just lots of stairs and massive tower jumps. With some good updates it could be better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fine gameplaywise, it has a good skate™ feel to it. I miss dark slides and finger flips, but since it's an early access I can let it slide (pun not intended).\r\n\r\nAnyway: season pass on an early access game? Perish",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Selling season passes for an early access game that is completely broken... Only a garbage company like EA can come up with  such morally dubious business practices",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Although the game is free and apart of the loved Skate franchise, it doesn't feel like a Skate game at all. Very lifeless and feels like a Fortnite-clone. Battle passes is an early release game and weird voice lines that don't feel like the people who made the game skate at all. Hopefully as time goes on they can make the game feel a bit more realistic and take community feedback. But this is EA we're talking about so my hopes are not high.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "+Overall gameplay feels nice.\r\n\r\n-The bugs \r\nI have been softlocked for over 2 weeks in \"Finer Grind\" mission, so playing the game feels like a waste of time. It seems to have been reported hundreds if not thousands of times by people who can't progress. It feels like nothing important gets fixed, most fixes are for cosmetic items or season pass related content which in my opinion is ridiculous. On the forums there are a lot of reports about these softlocks, so it's not the only mission with this bug.\r\n\r\nI do not recommend this game at it's current state",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They managed to twist and turn a beloved, expertly-crafted game series about skate culture and skating as a professional sport into a neon-colored, soulless corporate plastic mold (with in-game purchases of course). The world just doesn't feel alive, the characters don't feel like real people. They replaced actual pro-skaters that aided you in learning to skate with an \"AI companion\" which has the same level of personality as a piece of paper that just has all the instructions written out.\nI don't know what happened to the artistic direction of the first three games, but the way it is now just makes the otherwise good gameplay just extremely difficult to enjoy for me.\n\nAnd to hell with microtransactions!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "More bad skate spots than there are good. AI generated parks. No hills. Ramps that lead to landing on flat. Ramps that lead to water. Ramps for no reason. Too many large empty spaces. Early Access with annoying focus on MTX and season plans. 15 years later, 3+ years of development and somehow the weakest of the franchise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game would be fun if they spent the same amount time fixing bugs from day 1 as they did putting terrible skins in the game.\nThis game is the epitome of EA. A complete cash grab with no intent on getting better. I thought I'd give early access a chance cause I love the series, but holy ****, this game is barely playable.\nThere's also jack to do in this game, other than the 6 different challenges that just recycle day by day. There's basically no story or point to the game, and virtually anything you'd want is behind one of the worst paywalls I've ever seen. $5 american for some shoes? $9 for a deck?\nA waste of everyone's time and expectations. Literally EVERYTHING wrong with modern gaming, and they're not even trying to hide it.\nIf you want a lesson on how to make the worst roll out before official launch, here you go.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game but it's a battle trying to get it to run.\r\nEA's anticheat system is also way too invasive - it's a casual game, why do they need this?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sometimes im just a little piggy for the slop and thats not so bad\n\nits really disappointing its actually not a Paid, $50 dollar game with the branded cosmetics just being unlockables like every other skateboarding game ever. I get it though, brand licenses are expensive now... but come the fuck on. Sad that my weird sim-like homunculus has to look broke with this temu shirts and random pants. \n\nits fun though. So. take that for what it is. if i could give it a rating right down the middle, i would. Negative for shitty monetization. Fuck private equity and yadda yadda yadda. Hats ruined gaming. So it was told.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "battle pass for an early access game is criminal",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This feels like the antithesis of what the skate games used to be. There's no grit, no skate culture and everything feels so manufactured and corporatized. It's as if any part of this game I might have liked while it was going through development was hit with 10 different grits of sandpaper to knock off any edges someone could possibly find offensive or not happy/uplifting enough to fit in a corporate boardroom.\n\nIf you grew up loving skate 1, skate 2 and skate 3 you probably won't love whatever this is supposed to be, because it certainly isn't skate.\nIt feels so much more like a hollow shell to fill with microtransactions than it does a sequel to a beloved franchise. \n\nThe physics seem decent and the controls feel more or less like they used to, but Skate 2 and 3 already had fine physics and controls. I much prefer those games in graphical style, art direction and connection to skateboarding over this and I don't get loot boxes shoved down my throat for completing missions on those.\n\nI'd recommend Session or Skater XL instead or go replay the older games in the franchise if it's been a while since you've done so.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}