{
  "positive": [
    {
      "review": "Thank you, Nihon Falcom.\r\n\r\nI devoted half of 2025 to playing these games in preparation for the 13th game coming in January, and it needs to be stated: [b]Trails in the Sky 1st Chapter[/b] is a phenomenal remake and should absolutely now be held up as the gold-standard of how to show respect for a beloved JRPG. I did not think I was going to be as sucked into playing this game, given how recent I had gone through the Trails games, but it was very difficult not to fall in love all over again with the coming-of-age journey of Junior Bracers Estelle and Joshua Bright.\r\n\r\nFor starters, this game is streamlining for an older game done correctly. I was genuinely concerned when I learned that it was following the same gameplay-principles of the Daybreak games, specifically because I wondered if they were going to throw Lore out the window when it came to the advancements in Orbal tech mirroring the advancements in gameplay (something I’ve always appreciated about this franchise). But lo and behold: While the gameplay mirrors the Daybreak games, they managed to tie in a lot of the older systems back in, so it feels decidedly old-school and new-school combined. It’s hard to really go into details if you are new to the franchise, but for those who are in-the-know, this is a beautiful combination of the Sky Trilogy’s gameplay foundations, filtered through the lens of innovations that the Cold Steel and Daybreak games brought forth.\r\n\r\nI decided to go into the game right out of the gate with Nightmare difficulty, because after the Cold Steel games, I realized that the difficulty was becoming a joke, to the point that Daybreak 1 and 2’s Nightmare felt like the normal difficulty of the older games. I was pleasantly surprised that 1st Chapter’s Nightmare difficulty might be the most satisfying challenge we have had since the older games without feeling frustrating. You absolutely need to stay on top of your orbment combinations, and you are pushed pretty hard from beginning to end, which made it feel satisfying to finish.\r\n\r\nVisuals and audio need to be mentioned: This is, without a doubt, the prettiest looking Trails game to date, and traversing Liberl felt immersive in a way that no other Trails game has felt before. The setting feels lively, the music is absolutely stellar with different renditions you can opt to choose from, and the voice-actors have (thankfully) been given a lot more lines than we’ve had in quite a long time. I really hope that Falcom’s getting the money they need, going forward, because the decline in voiced lines has been a tragedy to witness since the start of the Cold Steel games, and while there are still stretches of time where non-voiced dialogue occurs, 1st Chapter definitely brings [i]enough[/i] lines to feel like we’re getting bang for our buck, for once.\r\n\r\nThe story beats are the same as the OG, and I must say that a lot of its best moments have thankfully gotten lots of love and attention in a way that the original could not dream to showcase. I’m glad that they went hard on this, because as much as I love the original, it has a very simple premise for a plot, and that can be a tough sell as an introduction to what will very likely be a lot of new players’ first experience with the franchise. For those who are new who will likely ask “Does this story get more interesting later?” I want to just assure you that yes, this franchise features a massive world full of a lot more characters, and if you enjoy the characters in this game’s party, then you are in for a wonderfully long ride if your intent is to now check out the rest of these games.\r\n\r\nThe important question is: Should you wait for 2nd Chapter’s remake now that we can confirm that it’s happening? That will depend on the type of player you are. Do you NEED the shiny new visuals, English voice-acting, and modern gameplay? Then you should probably wait. What I will say is: If you can put up with the compromises of switching to old visuals, Japanese (until Cold Steel) voice acting, and decidedly oldschool gameplay, my advice is to get started on the rest of the franchise, as I adored the journey and now consider the Trails series to be my absolute favorite JRPG games to date. They have flaws, here and there, but if you can put up with JRPG tropes (comes with the territory of playing them), then you should be able to see the value in this long-running series. \r\n\r\nPlease, for the love of Aidios, stop wasting time with Final Fantasy and play these games. That’s an order.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "My JRPG of the year. This game is a 9/10 for me. I loved the combat, majority of characters, and the story. My main complaints would be the story is VERY slow until the end, but the ending did explain a lot of things and has me hyped for the next game. The environments were also pretty repetitive but that didn't bother me much.\r\n\r\nGame is well optimized. Had 0 crashes or glitches.\r\n\r\nI'm excited for the next game. They have a new fan in me!",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "Excelente remasterizacion asi da gusto volver a jugar estos juegos, la misma historia solo un revamp grafico con jugabilidad moderna, no como el mamarracho qeu hicieron del FFVII",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Falcom have nailed this so perfectly that it felt like I was experiencing the magic for the first time all over again",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "SO, do you like great stories, interesting characters, and a fantastic battle system? Then you owe it to yourself to play this game. Phenomenal is the only way I can describe it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I'm glad this somewhat obscure gem got a rerelease that wasn't just AI upscaling with little to no new features. (We're looking at you plants versus zombies). Cannot wait for the rest of the series to release, would 100% recommend this to anyone who loves JRPGs.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Made me stop playing everything else, until I reached the end.\nLooking foward  the Second Chapter remake.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Brilliant reimagining of the old JRPG classic. \r\nIt's just as cozy and light-hearted as the original but it's way more fun gameplay-wise. \r\nHere's hoping for full remasters of Sky and Azure games!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I never played the original Trails in the Sky, so I went into the remake with zero nostalgia—but it honestly won me over pretty fast.\n\nThe biggest thing that stood out to me was the characters. Estelle and Joshua have such a fun dynamic, and pretty much everyone you meet adds something to the world. The game takes its time letting you hang out with the cast and get to know them, and it makes the journey feel really personal. Even side characters feel like real people instead of background decorations.\n\nThe combat system is also really solid. It’s easy to understand at first, but there’s a lot of depth once you start messing around with positioning, arts, and timing your turns. It hits that perfect “simple but strategic” energy that keeps regular battles from feeling like a slog.\n\nSince I never touched the original version, I can’t compare them, but the remake feels super approachable. The updated visuals and quality-of-life improvements make it way easier to settle into, and it doesn’t feel dated at all.\n\nOverall, the Trails in the Sky 1st remake is a great starting point for anyone wanting to get into the series. The characters carry the whole experience, and the combat is just fun on top of that. Definitely glad I picked it up.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I wish GungHo stuck to the Xseed script in some areas but other than that this a great remake with improved combat over the original game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "unironically believe when the second game gets remade it will be the greatest jrpg ever made",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you loved the original version of this, you'll love this version even more! It looks great, plays great and retains the charm of the original in both story and battle system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily one of the best remakes of a game out there. Played this on my Steam Deck and it ran buttery smooth. Very engaging combat and a story that'll drag you in for the long haul. If you have never played a Trails game before, start here and get ready for a wild ride and a massive story that spans 13 games and counting. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really great and faithful remake, I wasn't too sure how to feel about this since while Sky FC has aged a bit I still think it holds up well compared to most jrpgs around this time period but this remake has really made me appreciate the game a lot more in a different light. My only real complaints is the localization inconsistencies that bothered me a little bit but not too much to turn me off from the game. Some songs I do think don't sound as good as the originals like Zeiss for example but still good in its own regard. I would 100% recommend this game to any new fan looking to get into Trails as there is no better starting point than this one, the new cutscene direction and new graphic engine used for this game really does make this an unforgettable experience and one of the best jrpgs I played this year, I really do love Trails.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A remake that's really done right.  The original was a great game, no doubt, but it was a PSP game, which means severely limited by technology.  This is a total redo of the game all put into a current day engine with graphics that are really beautiful.  The game's original systems are there, along with some quality of life imporvements so it doesn't feel dated.  So, overall and amazing job from developers that clearly really care and love their games.\r\n\r\nThere's a few additions of gameplay mechanics that are in line with newer Falcom games that are added that do change the difficulty some, combo attacks and things like that.  Also an upgrade system for gear (nothing too complex) was added.  Overall it serves to make the game a bit easier than the original was (which could be hard in a few places).  Not really a down side in my opinion, but it is a change.\r\n\r\nOne thing that is a downgrade is the game's translation.  It's a new translation, and it feels like it was done on a shortdeadline.  Some terms that are consistent across other games in the franchise are different here, and it annoys every time you see them.  Also, they consistently mispronounce the name of the nation in the game.  Liberl is a nation, liberal is a political leaning,.  The two are not the same.  You never realized how much they say the name of their nation until you hear it misporonounced every time.  Still, not the end of the world.\r\n\r\nOverall it's a great game that's been remade with great care and attention to detail.  Going from pixel graphics on a PSP to the beautiful three dimensional vistas we see here is amazing.  Annoyances with the translation aside, it's a trully great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A faithful remake to the original Trails in the Sky FC, but with a combat system that's a simplified version of Daybreak's action to turn based battle.\r\n\r\nNewcomers should start here, though once you beat this game, it's very likely you want to start the next game (which isn't out yet as of writiing). Even for someone who played the original a few years ago, it's still a memorable experience to replay this.\r\n\r\nBiggest issue for me is the inconsistent terms that deviate from the canon. The music, while good, mostly takes itself a little too close to the original (though there's also the original to choose from).\r\n\r\nStill, can't recommend this one enough. It's great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute 10/10 remake. Visuals, animations, voice acting, all even better than I expected.\nThat ending hit even harder than it did in the original. \n\nCan't wait for 2nd Chapter!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is perfect. This is how remakes should be. 100% faithful and true to the original, just brought into the modern era. There is not much more to say honestly, pure brilliance.\r\nOne thing I noticed is the cinematography in the cutscenes is vastly improved compared to prior games. Perfect place to start for newcomers to the franchise. Looking forward to Second Chapter for sure",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I am sort of ashamed to say that I have bought quite a few Trails games on the PS4 and PS5 because they looked really good and I have heard great things. But the sheer number of games in the series intimidated me because I had no idea where to start the adventure. This remake gave me the perfect starting point. The battle system is engaging and the characters are endearing and the story is fun. There is a lot of dialog at times but overall the game is great! This game had a slow build which I enjoyed, the pacing did not feel forced, they allowed the story the chance to unwind and they allowed us the opportunity to get to know the characters. I highly recommend this game to anyone who is interested in the Trails series.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Ah a fun cosy JRPG with cute characters... 75+ hrs and many late nights later I can confirm this game was worth every penny. Very well optimised, simple ARPG battle system that you can trigger to turn-based, banger music and story that hit way harder than expected. Now I'm way too attached to this series - rip wallet.\n\nWell done Falcom you got me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've always been on the fence about getting into this huge decade spanning franchise but now that they have released the remake it's never been easier to jump in the Trails rabbithole. And oh boy I did not expect it to be that good that I went and finished it within a week. Now I have to decide whether to wait for the next remake chapter or play the og SC next. I cannot believe it took me this long to get into the series but it's better late than never!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game being as good as it is surprised me for sure. Interesting story with solid turn based combat. If you like RPG's I would give this game a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Getting to revisit Liberl and the cast of Trails in the Sky FC in this remake has been an absolute joy. I am a huge fan of the series and have played on a variety of platforms up to the most recent Calvard game. Estelle remains one of my all time favourite leads and the dynamic between her and Joshua is beautifully and faithfully done. I loved comparing old screenshots of my favourite moments from the original with the new scenes and felt like nothing was missed out. Having the game fully voiced was wonderful to experience. \n\nCombat and overall gameplay was enjoyable, having fast travel and high speed mode was really useful for NG+ and Nightmare mode. I can't wait to see the next installment. \n\nMy one *small* frustration was the pronunciation of 'Liberl' in the English translation which I did find a little bit distracting at times being so used to hearing/saying it differently from the other games in the series over the last few years. Not a major criticism as it didn't really negatively impact my experience but was noticeable enough to lose some of the immersion at times.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I started playing this series around June last year, I played from Trails in the Sky FC all the way to Trails to Through Daybreak II, I was lucky that I completed Daybreak 1, literally the day before Daybreak 2 was released. I love this series, and all the games are good, but Trails in the Sky FC and SC were always my favourite, and getting to play this Remake was almost like playing the game for the first time again. It's an incredibly faithful remake. I am looking forward to SC Remake, and I also pray they Remake the Crossbell games.\n\nJust a warning, this game is NOT a complete story, you need to play Second Chapter for Estelles and Joshuas journey to be complete.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Trails in the sky 1, now I wanna note I have been playing these games for quite a long time now and the Sky series remains my favourite, so how does the remake hold up? It holds up pretty dang well with only one issue I personally see, nothing game breaking but otherwise Sky 1ST Remake was stellar, it kept it's gameplay (as much as it could for 3D) while also adding to how it plays, even adding future games mechanics while enhancing it's original features, with voices included? It makes for the ultimate version of Sky, even if the original still very much has it's charms dood.\r\n\r\nOkay full review time! So Sky 1ST for those who have never touched the sky games at all focuses on the daughter and adopted son of Cassius Bright, those being Estelle and Joshua Bright and their quest to become Bracers, Bracers essentially being highly skilled handymen/Jack of all trades/mercenaries? But with a code/rules so to speak, of course as with any game and story it's not quite that simple and so their adventures begin dood!\r\n\r\nThe gameplay takes from daybreak, you travel through the decently sized parts of Liberl where you encounter various monsters, there you can either fight in live combat (which is better to stun them in than defeat them for an advantageous start) where you can dodge and perform various melee attacks or any time you can press square/X to initiate tactical combat, here is where the real damage lies, here it becomes turn based, you can cast artes (magic) for EP, Crafts (skills) for CP and even S-crafts for 100+ CP dood.\r\n\r\nExpanding on combat, for those new to the series again you have a timeline, here it shows who attacks next along with bonus effects that will randomly pop up for you or the enemy, ranging from healing HP/EP/CP, a guaranteed critical or a free instant spell cast, each type of attack and spell you and the enemy have has it's own wait time, on top of that certain skills and effects can delay their times and give you more turns or vice versa, you also have status effects which I feel have been improved in some regard in terms of effect, use and chance rates dood.\r\n\r\nCombat also has items and blocking which can be handy in the right situations but not always easy to guess, on top of that there are assist skills from your teammates in game and the ability to escape by simply walking to the edge of the battle area, the exception for that and active combat are bosses or story fights where you are stuck in tactical combat from start to finish dood.\r\n\r\nLet's see as for outside of combat we have quests and I find quests in these games have always been super worth it, the people feel like actual unique people in need but more than that for quests besides money you get BP, this increases your bracer rank and nets you some of the best stuff in the game and besides that you also have rewards, a new system that was added in daybreak, for doing various challenges ranging from enemy kills, how you attack them, spells cast, certain items collected ect ect, you get some stellar rewards, including the best armour and shoes in the game and some powerful quartz and accessories dood!\r\n\r\nSo talking about quartz, for newbies again, these are orbs with various effects that go into what's called an orbament, you use sepith of each colour/element to make them, (these drop from enemies or small amounts from broken objects) effects are all buffs of some sort but also depending on the combination of quartz you equip and strength of them, you can gain various different spells, it was a kind of complex system that has been made visually easier in this and even added all new unique spells to this that never existed before that look fantastic at that dood.\r\n\r\nSome more new additions to the game, a map now exists! Which yes never did before, super handy for real, along with that you also have quick travel, this is a mighty boon for the now larger size of the game world, on top of that caves are now a thing, a handy place to grind out a lot of enemies you'll encounter per area, you also have costumes now too, there's some fun free ones to go with some of the DLC ones too as well as a bunch of costume accessories too and finally you have three track types to choose from! The original games OST to go classic, modern version for this game or arranged! Falcom and their music at their best I swear dood.\r\n\r\nOkay last thing to talk about, I do feel how damage calculation is done is kind of poorly, I think it's acceptable mind you but the issue is that it makes buff skills and spells suffer, it's one of those you do x amount of damage at 100 ATK vs 100 DEF but then it doesn't really change until you reach 200 ATK VS 100 DEF (that's an example mind you nit accurate to the games numbers) which is fiine but it means that buffs are basically just there to push your stats up if you are under-equipped for some reason to do not pitiful damage or the like, frankly they should have kept it like in cold steel and make it do a buffed % of what damage you do instead, as it stands you're just wasting turns buffing sadly dood.\r\n\r\nAnd that's it really, the game adds so many great things, including icons on maps I forgot to mention making things easier to find than ever, there's nothing not to love about the game, Falcom did an outstanding job in making one of their most loved games even better and showing other devs how a real remake is done, thank you for reading and I hope you enjoy the game as much as I have dood ^-^",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "'s good. This is my new favorite combat system. Turn based but the over world combat still matters. \r\nPerfect game.\r\nPerfect story. \r\nI need the second one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For existing Trails fans: Liberl in 3D, 'nuff said. And voice acting brings these characters to life like you wouldn't believe (if you never played with the modded Evo voices in FC).\n\nFor new players: Welcome! No longer do you need to wonder \"What Trails game should I start with first?\" as this is the answer, full stop. Trails in the Sky 1st Chapter is just a small sampling of the characters, the story, the lore and world building that awaits you in this franchise. And when the credits roll, you'll want to jump right into the sequel, I guarantee it. Good thing there are a lot more games to slate your thirst in store, eh?\n\nThis is a full 3D remake of the original Trails in the Sky released over 11 years ago on Steam, complete with all modern Trails features and QoL improvements such as: real time combat (for non-boss encounters), little markers indicating when NPCs do or do not have new dialog to read, fast travel, better tuned difficulty settings, and more. [Do be aware if real time combat is a major draw, it is only present in the Daybreak games, and anything released after; the 2D games and Cold Steel are 100% turn-based]\n\nTrails in the Sky 1st Chapter focuses on the adventures of Estelle and Joshua Bright as they travel across Liberl to find out what happened to their father as well as resolving any local incidents that may crop up in each of the 5 major cities along the way. Fight in real time to stun enemies and whittle down their HP before finishing them off in turn-based combat (or wipe them out with only real time if you prefer). Boss and mini-boss fights are turn-based only, so don't slack off on those skills.\n\nOutside of combat, you have dialog and characters aplenty. One of the very few gripes I have is that not all major characters are voiced all the time. This is on par with practically every Trails release (and Falcom release in general), but voices are present more often than they are not. You'll quickly feel at home with each character, their personality, and their interactions with each other and the world at large. And the NPCs? They're all named, some of them have their own mini-storylines that go along as your own does, and you might even see them later in the game elsewhere, or even in a future game altogether!\n\nFor anyone that is a fan of turn-based gameplay, massive lore and world building, intimate character connections, or story-driven gameplay, Trails in the Sky 1st Chapter is an easy buy. And the best thing about coming in late? There are plenty of more games available RIGHT NOW to keep the ride going before you ever have to join the rest of us in having to wait for the next release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "軌跡シリーズの古参プレイヤーとして、本作『空の軌跡 the 1st』の最大の魅力は、時間をかけて徐々に没入していく体験にあると感じている。戦闘システムはおなじみのAT順行動と導力魔法を基盤とし、序盤こそ控えめだが、クオーツの組み合わせや行動順・位置取りの考察が進むにつれ、戦略性が自然と高まり、プレイの手応えが戻ってくる。物語は従来通りのスローペースながら、人物のやり取りや支線の密度、世界観の積み重ねが丁寧で、プレイを重ねるほどにエステルやヨシュアへの親近感が再び強まっていく。グラフィックは派手さこそないものの、都市・田園・自然環境の雰囲気が心地よく表現されており、世界を巡る感覚が損なわれていない。音楽はシリーズらしい温かさと前向きさを備え、場面に寄り添う旋律が物語への没入をさらに深めている。総じて、本作は派手な演出で注意を引くタイプではなく、数十時間のプレイを通して少しずつ軌跡の世界へと引き戻してくれる作品であり、古参プレイヤーにとってはまさに“帰ってきた”と感じられる一作である。",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall I recommend It as Its a pretty good game and a great remake with enhanced gameplay and artstyle  the mixed action and turn based is also great, I would say this Is the best way to play Sky 1",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Trails in the Sky 1st Chapter is a story-driven JRPG that prioritizes narrative depth and character development over spectacle. It follows Estelle and Joshua as they join the Bracer Guild, an organization dedicated to helping people through contract work. While the game includes exploration and combat, its true strength lies in its world-building.\n\nThe game takes its time to introduce characters, NPCs, and locations. This creates a sense of community and realism rarely seen in video games. For example, after helping local farmers, you do not simply move on — you are invited to stay for dinner and even sleep overnight including additional dialogue. Or Estelle, who first asks if the maiden and wife (two minor side characters) are okay after an incident in the mayor's office. By the way, the game has a lot of German names for its NPCs and locations. Side quests also contribute to world-building by tying into local issues. Furthermore, NPCs react to current events and the presence of recurring NPC characters gives the impression that the world is alive, with each NPC following their own goals. However, pacing slows noticeably in Chapter 2, pushing the main story into the background until the final chapter. \n\nThe in-game cutscenes are well-done. Dialogue feels natural and grounded, supported by thoughtful camera work and character animations during cutscenes. The dialogue is generally well written, though there are occasional lines that feel a bit rough. The game maintains a mostly serious tone, with occasional lighthearted moments. Some of them edge into borderline silly JRPG territory. For example, occasional naughty references that feel a bit out of place, and exaggerated anime facial expressions using “> <” symbols for the eyes.\n\nWhat makes the narrative stand out is its careful buildup. Unlike many games where major events happen abruptly, Trails in the Sky introduces plot points gradually, allowing players to connect with the world and its inhabitants first. The game creates realistic relationships between people, where everyone knows everyone, including gossip. The overall tone is charming and positive, with most characters being polite and likable. Especially the contrast between the two main protagonists is fun to watch. \n\nExploration is also fun thanks to hidden chests and small rewards off the main path. Unfortunately, the level design is disappointing: areas are linear and tunnel-like, with heavy asset reuse and few points of interest. Most levels consist of simple paths lined with trees and grass, lacking variety or memorable landmarks. At least backtracking is minimal, and fast travel between major landmarks is available. Most side quests also follow a simple, linear structure, often boiling down to errands with no surprises or sub-events. Moreover, there are \"treasure dungeons\" that can be looted by simply running past enemies, which can feel underwhelming. \n\nCombat offers an unusual mix of real-time and turn-based systems. Real-time battles allow quick disposal of weak enemies but feel like button-mashing. Turn-based combat is more as spells (Artes) and abilities are unlocked which add more complexity in terms of elemental damage and status effects. Each character has separate energy pools for spells and abilities, though these feel overly generous on normal difficulty. In turn based-combat, positioning matters: abilities have different AoE shapes, and some attacks from the side or back deal extra damage. However, the third-person perspective makes battlefield overview less practical. Furthermore, enemies can be stunned by repeated attacks, triggering automated team combos.\n\nEach spell and ability is accompanied by a nice animation. However, these animations are rather long and repetitive, which is why they quickly become tedious. For this reason, I mostly used high-speed mode during combat (although you can skip combat animations, I was too lazy to press the skip button each time). Elemental weaknesses encourage you to equip diverse spells, but despite a decent variety of enemies, most encounters feel similar on normal difficulty. Occasional boss fights add some variety. I wish the main characters played more differently — unique abilities aside, shared spell pools make them feel too similar.\n\nPlayer progression is slow and incremental. The orbment system let you unlock slots and put colored orbs into the slots to unlock spells and stat bonuses. It is neat system but also difficult to manage since you must consider different colors and connected paths. Combining different colored orbs on a path unlocks new spells, allowing you to customize and specialize your characters. Additionally, necklaces allow you to further refine your builds by granting specific stat bonuses and/or immunities. You will also find one or two new weapons in each chapter that simply have better stats than the previous ones. Furthermore, equipment items and orbs can be upgraded once by spending resources collected through combat and exploration. There is also a basic cooking system. As with most JRPGs, I mostly ignored it, except for the rewards given for cooking a meal for the first time. Besides that, there is an achievement system that provides small bonuses for various tasks, most of which you will eventually achieve by playing the game, such as cooking five meals or casting X different spells. \n\nI like the game's menus. They are well-designed and with good comparison screens during shopping. A minor quibble are the different font sizes which can feel inconsistent at times. I also find the rarely used green font color a bit unfitting.\n\nVisually, the game is bright and colorful, reminding me of Tales of Zestiria. I like the character and costume designs, particularly those of the main characters and NPCs. However, some minor NPCs look too similar due to asset reuse. Unfortunately, the environments often feel uninspired and repetitive because of the heavy reuse of assets, which is further exacerbated by the simple level design. Towns are more appealing, but most NPCs remain static, and interior design lacks creativity. Transitions between indoor and outdoor areas feel abrupt like running through a portal, but at least load times are fast. By the way, I love it when a game loads the last save automatically at startup, skipping the main menu entirely.\n\nWhile not the most complex, the music is very good and provides a cozy, positive vibe. The tracks are repeated often due to their limited number, but that didn't bother me. I found \"Feelings Soar with the Wind\" to be particularly catchy. The voice acting is good as well. I especially liked Joshua's voice, though Estelle's voice acting sometimes sounds a bit inconsistent. Unfortunately, the English lip-syncing is often off, and not all dialogue is voiced. I find it particularly odd that many scenes mix voiced and unvoiced lines, with the main characters being unvoiced.\n\nAll in all, Trails in the Sky 1st Chapter is a charming JRPG with a character-driven narrative and rich world-building. Its slow storytelling, simple level design, and modest presentation may not appeal to all players, but those who value character-driven storytelling and interconnected worlds will find it rewarding. The combat, crafting, and progression systems are good and functional, although I would not play the game just because of them, as I miss some additional depth. I am especially not convinced of splitting combat into two systems (real-time and turn-based). Turn-based combat with positioning in a third person perspective is not my favorite either. Still, battles are engaging enough to bridge story segments, and exploration, while basic, offers small rewards to maintain a steady sense of dopamine release. Overall, I enjoyed my journey with Estelle and Joshua and cannot wait for it to continue.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First experience with a Nihon Falcom game. It's good, not a story I was really feeling. Felt like a Saturday morning cartoon, bad guys get away constantly, silly bits and moments during serious sections, pretty dated tropes. I know that the story didn't get updated with the remake, so this is a new shell around a 2005 jrpg, but that didn't help me enjoy the game. Not really a lot going in that department. \nBUT- the gameplay is really fun, the different systems for building your characters is awesome, game looks great, spell animations are awesome, build customization and diversity is great. If you are a story over gameplay person, I can't really recommend this unless you're fine with a somewhat dated premise. Gameplay over story, however, definitely try this one out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Here we are again. Another year, another trails, only that this time we're going back to where it all begins: the very 1st Trails...remade. \nThis remake is pretty well done and faithful to the OG, but is not without its blemishes.\nLet's begin with what bothers me the most when something is remade: censorship, proof reading for the modern audience and 'cultural insensitivities'.\nUnfortunately there's censorship in this game, compared to the OG. ALL the dialogue lines poking fun at Estelle for being a tomboy, or her being teased that she's not the type for wearing dresses, or anything that has to do with her femininity is gone. I can't be the only one that finds this creepy, insidious, sick and deeply disturbing, right? \nOther than that, the dialogue follows the OG Japanese script and you'll be disappointed right from the 1st cutscene, since one of the most iconic lines in videogames is gone. Honestly, they could've left the \"Why is my present a boy\" line there and follow the Japanese script for the rest. These mfkers have no soul or no understanding of what the fandom really wants. More like GungHoe, amirite? \nThere's a patch in the works that replaces the new dialogue with XSEEDs.\n\nThe combat is too modernized, and is clear that it was done this way to retain the retard's attention span. You have too many extra actions when critting, too many procs for stats up and CP, too many ways to just mitigate the game's difficulty even on nightmare. Speaking of CP procs, you can S craft with Joshua and immediately get 100 or more CP back. This is wrong, this is retarded, this is not how it should be, considering the fuckup with S break spam from Daybreak. Stat ups in combat are barely noticeable and literally irrelevant in NG+.\n\nFalcom seems to have lost its way, The more of these games they keep pumping out, the clearer it is to me that their original vision no longer exists. You make me feel like a retard when playing this game, because EVERYTHING IS MARKED ON THE FUCKING MAP. At least do us a favor and eliminate that option when playing on nightmare, since it'd be implied that long term fans of the series play on the hardest difficulty of the game and they know what they're getting themselves into.\nLiteral quest design, envisioned in the OG, are meaningless here because you can find everything on the map immediately. You're asked to look for something or investigate, but you already know where to go because is marked. This is a very, very big issue that must be resolved. You can clearly see the cracks in the matrix, because you got the OG quest design and the modern 'quality of life' which mitigate one another. I've given this feedback on the other games too, when I reviewed them. This goes against the own intention of the developers, is a paradox that must be eliminated. \n\nNG+ is untested, enemies get a free 7-8k hit on you on counterattacks (WHICH CANT BE BLOCKED NOR ANYTHING CAN BE DONE TO AVOID BEING HIT BY ONE OF THESE). You thought counterattacks are annoying on NG Nightmare? Wait and how it feels in NG+ Nightmare. You shouldnt even lose your time playing NG+ on nightmare, because is retarded. Enemies go into rage mode and hit you for 12-14k on counterattacks. Is untested forreal. Too bad since I played Abyss mode in Reverie and finished it. \n\nIs a cool throwback for long running fans, and a good way to bring new fans to the series, but, as you can see, as a long fan of this series, the modernization of it doesnt quite bode well with me. If they would eliminate markers on the map, that would make such a huge difference...\n\nIf you're not a finicky retard, I recommend you play the OG instead.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9.5/10\r\nTruly best remake game I've ever played before. It retains the same charm the original game have but with upgraded gameplay and graphics unlike certain famous remake game that change the story and make it cringe (ahem).\r\n\r\nPros:\r\n- Same Story with just a little bit tweak here and there to add more connection to future game. Definitely scoring big nostalgia point to Trails Fans.\r\n- Best starting point for newcomer to the fandom. I'm even a little bit envious to the new player who will be surprised at multiple twist in the story\r\n- Fluid graphics and gameplay. The best game so far which utlize Falcom inhouse engine to their fullest capability\r\n- Stellar voice actors. I'm a bit skeptical because many characters has different VA (I play in japanese voice) but the quality is still very good\r\n- High quality translation. Although some minor translation change is noticable for long term fans, but it doesn't bother me too much and should not even be noticed by newcomers.\r\n\r\nCons:\r\n- The gungho regional price and russia sales issues. I still think Gungho made a big mistake and hurt Falcom name, but hopefully won't happen again\r\n- I noticed some minor bugs like stuttering graphics or lags\r\n- Some additional things to gameplay which according to the lore will be \"brand new\" in future games already being introduced here (such as sepith mass, support abilites)\r\n\r\nIn conclusion, New and Old fans alike please try the game if you haven't, this is worth the money when you compare to other remake games which only improve a bit just to milk some more money.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Spoilers ahead. \r\n\r\nWould I recommend this game to people? A remake of a game I started in 2018 that started my addiction to this day and has not left my mind ever since? Yes, yes I would recommend this game to everyone.\r\n\r\nMy only real critique is that I wished the calendar made it in because it would've been a very effective way of showcasing the passage of time and help line things up for people starting the series with this entry. Now that that's out of the way...\r\n\r\n\r\nMY HEART BURNS, MY WILL THRIVES AND MY SOUL SCREAMS!\r\nThe idea of remakes \"needing\" to be one way or another does not interest me in the slightest and in reality what matters if the new goal the developers are aiming for is something they were able to make. And to me, they truly delivered. The combat changes help elevate what could've been a bland interpretation into something that gives you utility and blends Arts and Crafts as one would expect after a multitude of games. The small amount of new quests allowed for background characters, as of this game, to get a larger presence and to top it all off, the countless new voiced dialogues that occur during traveling and during battle add flavor in an effective way rather than extending scenes. Granted that doesn't mean I'm ever against an extended scene, it was just an amazing use of dialogue in moments where silence once resided. \r\n\r\nThe addition of +50 for a post game challenge is an absolutely beautiful addition, thank you to Reverie for introducing it. This actually addresses one of my main issues with NG+ in these earlier games since the series stopped doing NG+ content after Cold Steel 2, in that now the game has tested you and can ramp up the challenge even further since you're now focused on gameplay instead of the story. My run on Nightmare had me scared for a long time as the addition of Rage was rather perfect in making sure enemies kept you on your toes but surprisingly before L, the enemies seemed at their strongest there and the final few bosses didn't seem to have me on edge the same way. Perhaps that's where +50 shows its true colors because I had noticed that on other people's runs on Normal, the enemy didn't get to showcase their true potential which reminds me greatly of higher difficulties in action games. Where the game now trusts you know what to expect and can ask you to fight wars of attrition if you so choose. \r\n\r\nMusic is my absolute weak spot in the grand scheme of things so to hear new renditions of songs that I was familiar with, helps me continue to strengthen one of my weaknesses. Needless to say, the new rendition of Hoshi no Arika is what truly brought me to tears. I've listened to that damn song for so long and much like Ai no Uta, I had no idea it could be elevated even further. \r\n\r\nThank you Falcom. Thank you so much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best kind of remake. Faithful to the original while massively pushing it forward in QoL, Graphics, and Gameplay. This is the definitive entry point into the Trails series for newcomers as it combines the amazing writing of the older Trails games and the fluid gameplay of the newer entries.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trails in the Sky 1st Chapter has been my first foray into the Trails series despite being an avid JRPG fan and I'm deeply enjoying my experience so far. It's an excellent remaster that's bright, colorful and full of passion. The mixed real-time and turn-based combat feels relatively simple yet fresh enough to keep combat interesting, and they did a good job of synergizing the two styles together. The characters are fun and evocative. The story is simple so far but entertaining nonetheless. The world is gorgeous and the music is fun and cheerful. I'm enjoying my time with it so far, and would recommend this game to any JRPG fan who wants to experience a Trails game for the first time like me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and great gameplay, can recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The original game is my favorite game of all time, across all genres and platforms. Going into this one, I was legitimately worried about what a remake of this scale could do to the game and I am happy to say they absolutely nailed it - everything from the presentation, voice acting and mechanics - phenomenal. This should be used as an example of what the gold standard for a remake of a game should be like.\n\nThe only two downsides - there is no \"Ultimate Edition\" that includes every single DLC (like Falcom's other games), and that I have to wait a whole year to get Trails in the Sky 2nd Chapter's remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trails has been a long running series, and thus been difficult to recommend to people. With this remake boasting the best gameplay in the series till date, it is no longer an issue - you can start the Trails series right here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the perfect example of how to make a remake, respect the original while updating the graphics and doing fomr QOL updates. The Trails series is the best game series out there, and i am happy to see this ramake is faithful to the original game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is funny game with kill monster and do arts and crafts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just so well done. If you are new it is the best place to start. If you are old it is the best trip down memory lane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best remakes I've ever played - and it's a remake of one of my favorite RPGs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty nice remake that is faithful to the original. Didn't encounter any techinally issues and there is good amount of graphic and other settings. \nHardest difficult is too easy though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is exactly what you should want from a remake. Not just updated visuals. Updated gameplay, new story elements, and an updated soundtrack. This is truly one of the best remakes I have ever played and I am looking forward to what Falcom will do with the next one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a long time fan of the Trails series I really enjoy seeing the first game that got me to the series in 3D.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good trails game, actually kept me engaged which not every trails game does tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good faithful recreation of the original game that started the entire Legend of Hero series. If you have been put off by the original 2d art style and want to play the sky games, this is the one to go for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute must play. Great story and characters with good voice acting. But for me, the combat system is the real standout. It is pretty unique and super polished which made the gameplay satisfying from start to finish. I'm new to the series and seeing how well done this gameplay is, I'm really looking forward to trying the other titles in this series. Also, can't wait for the SC remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always wanted to try the series, but the sheer number of games always intimidated me, so I used to settle for just watching videos and reading about it. After getting Daybreak, though, I ended up loving it. I also played a bit of Cold Steel I, and when this remake came out, I knew I had to play it.\n\nI haven’t finished it yet, i’m currently in the final chapter, but I’m really enjoying it. It’s an adventure that completely pulls you in. Estelle is incredibly charismatic, and Joshua serves as the calm, grounded counterpart to her energy. So far, I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best remakes made. If you love RPG's, you should treat yourself to this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed the original Trails FC this remake is absolutely worth it for the fully animated cutscenes. The way they designed the eyes of the characters really shows all their different emotions and its easy to tell what Estelle or Joshua are thinking. It makes the characters feel so much more alive.\r\n\r\nThe new quick battle addition is nice. I find I use it to just get the battle started or get a stun first before going into regular battle. It definitely was not meant to be used 100% of the time.\r\n\r\nI never write reviews but I feel I had to for this game. Its the start of an incredible series and I'm hopeful more play due to this remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always wanted to see what the Trails series was like since I saw art and gameplay from the Trails of Cold Steel arc, but I never started because of how Trails in the Sky FC gameplay looked like. Glad to say that is remake has made me a fan of the series and I am now eagerly awaiting for Trails in the Sky 2nd Chapter next year. \n\nI tried out the free demo, which includes the entire Prologue, just to test the waters and ended up buying the game even before reaching the end of the demo, because it got me that stuck into the story and world building. And yes, the demo saves do transfer to the full game. \n\nI do like the new translation being closer to the original Japanese script - even if it loses some of the more colorful localization Estelle memes that I have since seen from the Kiseki community - because it feels like I'm playing a season or cour of an onging anime saga. It put a smile on my face whenever I encountered the various shonen tropes that Estelle engenders throughout the game and the growth of her character. \n\nOh, and what an ending... even if I know that there are characters that survive because of they show up in the official art of subsequent games in the series but I am dying to know what happens and how things will resolve... want what further mysteries lie in Zemuria. (Since I've also been told that the Falcom is not afraid to kill major story characters, unlike what Square-Enix and other JRPG franchines has been doing lately).\n\nSome may nominate Expedition 33 for their RPG Game of the Year, but Trails in the Sky 1st Chapter is mine, for its charm, timeless story telling, intricate world building, simple yet meticulous battle system, and amazing Japanese voice acting, especially the voice actress for Joshua. (For the record, I loved Clair Obscur's French voice acting, it literally made me feel like I was playing a French art house film brought to video game life).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've heard of this series over the last couple years and have never jumped in since I didn't want to play old games. When I heard of this remaster/ remake/ whatever, I figured this was my chance to give it a shot. I have not been disappointed!\r\n\r\nPros: It's a long game, over 50hrs I'd say, but not in the way where it feels unnecessary. It's got that old school charm of JPRGs of old. It's well written and the characters feel very appropriate for the world. Build crafting is fun and as in-depth as you want it to be. \r\n\r\nCons: That old school JRPG charm can be cringey if you're not into that sort of thing. The length could also be a con if you're not looking for a REALLY long game. Skipping side quests can help shorten the length but I wouldn't say that's how the game is meant to be played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't play the original, so as a fresh set of eyes kind of play through, I love it so far. I'm so invested in the story, the visuals are amazing, combat is fun. It's so great. Play this game. Solid 11 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To play the remake of this classic with the new engine and gameplay mechanics, it's like a dream. I really hope that everyone feels the same. I also hope that Sky 3rd Chapter and the Crossbell Arc: Trails from Zero & Azure gets the same treatment while bringing in new players to the Trails Series. Thanks a lot Falcom & Gung-Ho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\r\n+ Visually incredibly pleasing, the art direction goes above and beyond in this game giving great designed characters, monsters and landscapes\r\n\r\n+ The mix of real time combat and classic Jrpg turns works very well and its quite refreshing, coupled with the various path of progress for your characters (Levels, Gear, Magic, cooking) it offers a deep but not overwhelming RPG system to play with\r\n\r\n+ Well written and incredibly memorable and likable cast of characters, starting with our protagonists Estelle and Joshua to the very last member of your party you encouter in the intriguing story, you are sure to remember every single person you meet in this journey\r\n\r\n+ Sizable numbers of side quest to do and an expansive set of regions to explore give a lot of value for the price asked\r\n\r\nCons:\r\n- Lack of enviroment variation, as beautiful and good looking the places you visit are, the landscape of \r\nLiberl is quite monotonous, its green fields and foresty areas for 50 hours plus, quite boring after a \r\nwhile\r\n\r\n-  While the story told is very interesting and intriguing i found myself finding a slight lack of 'edge' in the fact that despite the stakes nobody dies in this tale, ever, even when 'permanetly' dealing with a villain when given the chance would have solved a lot of messes in the third act\r\n\r\nWhat a pleasant surprise Trails in the Sky was, an absolutely beautiful adventure with some of the most likable characters i've seen in a while, the anime humor and action are on point and i am really hooked for the sequel to come ASAP.\r\n\r\nHighly recommended 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love that I gave a chance to this game even if I haven't heard about it before. I just love the genre and this game gives perfection. I can't wait for the second chapter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "And old classic revived. Amazing story, fun game play and upgraded visuals, it has it all, the best part is, its so very close to original, if You're considering joining the series, this is where to start! Cant wait for the next game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have not heard of this series before but I tried the demo and enjoyed the game.  Ended up grabbing it and am truly having a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent remake of one of my favorite JRPGs of all time. The new combat system is now one of my favorites in the JRPG genre. Being able to so fluidly enter turn the turn based combat system from the overworld combat is great. Story is just as good as the original, now with more voiced lines. Another excellent example of what a remake should be. The demo of this game is the entire prologue section ( took me about 8 hours to do everything in it)  so if your on the fence I highly recommend playing through the whole demo. Your demo save will transfer over if you do decide to purchase the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Does everything a remake needs to do and all the additions are just great. Trails is my favourite game series of all time and this really made me appreciate Sky FC as a whole a lot more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fairly true to the original.  The revised translation lacks some of the character of the original, but all in all it captures the spirit of the original game very well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "La mejor saga de JRPG de la historia. Este es el punto donde todo inicio y elimina cualquier excusa de no \"poder\" meterte a la saga",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]🌶️Overall rating: 5/5🌶️[/h1]\nAs someone who played the OG, this game simply amazed me with every turn; there was nothing that I felt was better in the original. Even the charming sprites were kept in the loading screens. I simply had no complaints about it. I am looking forward to the next one and you bet I'm gonna drop money on it immediately.\n\n[h3]🌶️Gameplay🌶️[/h3]\nThe mix between turn-based and overworld was a breath of fresh air. Fight, run, or git gud with dodging; you can do it all. While I eventually went into turn-based quicker as we got stronger stats, it was really helpful to have early game.\n\nThe game also gets much easier as your progress. Starting from Chapter 2, I had to swap to Nightmare mode as the battles were too easy for me.\n\nThe only issue I had with combat was that I had no idea if we managed to steal the buffs from enemies or not. Sometimes you end up not reacting fast enough to attempt to steal it again because you wanted to 'wait and see'.\n\nIn terms of missable items, there were definitely some secrets, but since everything is marked you won't miss too much as long as you make sure to go through everything. Although, I did end up [spoiler] missing a recipe as I forgot to read the books[/spoiler], but that's honestly on me lol.\n\n[h3]🌶️Story🌶️[/h3]\nThe story was really solid, especially near the end. As someone who played the OG I thought I was ready for the ending. I wasn't. It was super emotional, especially with the music, and I couldn't help but cry.\n\nI really liked how the characters were written and could really relate to Estelle. They grew on me so much and [spoiler]Joshua leaving[/spoiler] hit me even harder. I can't wait for the continuation.\n\nI loved how this game struck a balance between setting up for the next game and also having enough hard hitting story points in the current one.\n\n[h3]🌶️Music and Voice Acting🌶️[/h3]\nThe music is probably my favourite part of the game. The remixed versions were really done well, and during the emotional scenes I was literally moved to tears. You even had the option to use the OG music, which was a really nice touch.\n\nFor the voice acting, I played it in English, and the English voice actors were phenomonal. There wasn't a single time I felt that a character was 'off', except for [spoiler]Tita[/spoiler], who I expected to be higher pitched, not that it was bad.\n\n[h3]🌶️Graphics and Optimization🌶️[/h3]\nThis game runs amazingly. I played and streamed everything on medium, and my OBS simply purred like a kitchen. It doesn't have the most amazing graphics, but it was beautiful enough for me. I loved the art style, the effects, and even the environment. Truly a glow up from the OG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The standard by which all RPG remakes need to meet. Can't wait for SC! Hope they make 3rd, Zero and Azure.\n\nThing it still needs: auto save feature of every other trails game. It has a version of auto save, but not the helpful one that does it every 5 minutes and keeps the last 8-10 saves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A wonderful game for anyone with a passing interest in JRPGs, and the first entry in an expansive series.\r\nThe characters are loveable, the story, while slow, lays the groundwork for successive games, the world is a joy to explore, and the music is a faithful recreation of the original.\r\nI do have some reservations about the new localization, (more than likely due to the excellence of the original script), but the pros outweigh the cons. This is an easy recommendation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a bit skeptical about the remake at first but, man i absolutely love it, i can't wait for SC and 3rd remakes even if it goes downhill after Azure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly one of the best written JRPGs I've ever played, and since this is my first Trails game, I intend to play the rest. I've played thousands of hours of JRPG's, but none come close to the character and world lore like this one, and no \"pieces\" feel missing. Every bit of lore and interaction makes sense and has a purpose, which is incredibly difficult to pull off. Truly a work of love and inspiration!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics, same story you remember, and really interesting aditions to the gameplay to keep it feeling fresh, and the balancing feels like the best it's ever been. Honestly, I haven't found a single thing to complain about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very faithful remake with a lot of nice newly added quality-of-life features like fast travel and quest markers (which admittedly does make certain quests a bit *too* easy...). Action mode combat is a nice addition too. Has the high-speed (boost) mode from the original as well so you can speed through battles if you want. I'm pretty sure the combat/boss battles also got some difficulity tweaks compared to the original.\n\nIf this seems like something you'd like honestly just play the demo, it has the whole prologue for free and you can transfer your saves to the full game.\n\nMake sure to use Proton-GE on a Steam Deck to get about double the FPS! I played on mixed low/medium settings and got 60 FPS on mine with Proton-GE and about 30-40FPS without it.\n\nAnyways the game has Bestelle which should be enough of a reason to play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very solid remake of the first game of the Trails/Kiseki series. If you're even a little interested in getting into the series, this is the best place to start!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Trails in the Sky FC for the first time earlier this year and I really enjoyed it. I'm playing through the remake right now and it feels a lot more modern with quality of life improvements but without losing touch of the original art direction and overall feeling. I would definitely recommend it as a starting point to anyone new in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Try the demo if you're not sure, it's the entire prologue which is a pretty big chunk of gameplay and introduces most core mechanics, although they get expanded on later a bit. \n\nThe story is a slow burn and fairly predictable but enjoyable, there are a couple of tropes in it I'm not a huge fan of but like most JRPGs the characters will make up for those kind of nitpicks if you like the genre. Visually, its not the highest fidelity but I really like the  style and all the skills look great, I didn't get tired of looking at them throughout the whole game. Gameplay is the biggest draw for me, playing on nightmare it was challenging at times but for the most part felt great outside a few specific parts where you can kind of get locked in if you're not prepared enough. Areas were all a lot of fun to explore and comb through, the speed up QOL helps a lot with not making it tedious to do side content.\n\nIf the demo grabs you and you don't want to wait for a sale, it's worth full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The remake keeps the charming story and characters intact, but presents Liberl in a much more modern way, with smoother visuals, better UI, and a more dynamic camera that makes exploration feel fresh without losing the original’s cozy atmosphere. Combat has been overhauled to incorporate systems and conveniences from recent games in the series, making battles faster, more engaging, and less clunky for new players. On top of that, features like fast travel, clearer quest markers, a proper minimap, and various speed and skip options remove most of the old grind, so replaying or starting the series here feels far more comfortable. Overall, it feels like the definitive way to experience 1st Chapter: faithful to the original, but refined enough that going back to the old version would be hard to recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best remake I have played, such and awesome job voice actors and overll massively enjoyed it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is for me a gold standard of how to do a remake and also for what type of games deserves a remake. I hope I can see something like this for Chrono trigger or FF VI in my life. \r\n\r\nI've completed the original before and I can find no faults in this remake except for maybe the fact that it is a bit easier. I'm playing on Nightmare and the difficulty feels normal, it is challenging in places where it is supposed to be but there are very few places where I had to restart a fight. Which is probably not what the top difficulty should be. But I'm also a veteran and know how the orbment system, crafts, etc work. I like the rewards feature (in game achievements/milestones that give in game items) but it does give a few items too early.\r\n\r\nThe story and writing, characters, animation and gameplay are all superb. For some this might be a slow start as it does have a lot of buildup, but personally for me this had me hooked from the get go, even in the original game. I like the Bracers and the way you get to experience that journey. The way it integrates the lives of common people, not just nobles, etc. it is something that I always look for but rarely ever find. \r\n\r\nI'm glad there are people in this world who make games like this, I hope they can complete their full vision. Hopefully this game becomes even more popular after SC remake.\r\n\r\nTruly one of a kind experience in gaming (this series as a whole).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got that nostalgia feeling to it even though I've never played the original \r\nplus points cause you can make Estelle Hatsune Miku（＾ｖ＾）",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a pretty faithful remake of the original PSP game, don't let the discussions stir you away. It is great for both old fans and people that are just getting into the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is genuinely amazing and the incest is a filter for casuals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great remake of the original. Its preserves the story and characters of the original, while adding a fun new combat system that does not get stale as new mechanics are added with each chapter of the game. Overall, I feel this game is a 9 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that started my addiction to the Trails series back then. And now everyone can enjoy it with better graphic and gameplay. Truly an unforgettable journey...\r\n\r\n11/10 Estelle is Bestelle!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its not often a game can make me feel nostalgic only a few years after first playing it, but revisiting Liberl in this remake has brought a distinct feeling of warmth to me. Seeing these characters I have grown to love in full 3d, interacting in new ways the original couldn't has been a treat. This extends to the various NPCs of each region, the sidequests and the small optional dialogue you can find simply by going out of your way to visit places completely away from your main objective. Trails in the Sky has always felt like a lived in world, and this remake of FC has only made it feel more alive. \n\nIf you haven't played the Sky trilogy yet, do yourself a favour and pick up this remake. It's a gem of a story and the start of a wonderful world to experience, all packaged in a fun gameplay experience that will keep you coming back for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1st Chapter is everything a remake should aspire to be. More than just a simple retread of what came before with prettier graphics, it takes full advantage of the capabilities of modern hardware. I am primarily writing this review to go over how the game improves over the original.  \n\nGraphically, the game is a feast for the eyes. Rather than chase the bottomless rabbit hole of realism, Falcom tastefully rendered the game in a cell-shaded anime style. It runs perfectly on lower-end hardware (as low as the Switch!) and still makes you stop to admire everything around you every now and then. Grass is rendered in such a lush, verdant green, it makes you want to step through the screen and spend the afternoon laying in it without a care in the world. I have to mention the evenings; skies are a beautiful golden hue that make the whole environment shine in its luster. Combat and action cutscenes are a total thrill to watch. Characters are lovingly animated and I found myself slowing down to watch animations like Joshua's Flicker the thousandth time I saw it.\n\nThe characters are by far the biggest beneficiaries of the remake. Falcom took full advantage of the presentation capabilities of full 3D and brought their cast to life. Major story moments are shot in such a way you feel you're watching an anime; characters have different expressions and poses and actions for each scene, there's never a moment of standing around and reading of paragraphs of dialogue at each other. The (Japanese) voice acting is excellent and captures the intended emotions of each scene perfectly. These changes to the presentation make what was, admittedly, a game that was slow-paced to the point of boredom at points, into an engaging experience from start to finish you never want to take a break from.\n\nCombat is vastly improved with additions from later games in the series, such as Cold Steel's brave attacks and character links. These additions spice up even routine enemy battles and give the player a fuller toolkit of options for each potential situation. But I will say that the game's difficulty wasn't increased enough to compensate for all the new options in the player's arsenal. It's very easy to overwhelm enemies with a full 5-BP burst attack or be saved from a tricky situation with a character's bond-link action such as auto-revives.  But the original quartz system remains, where you have to carefully balance what stats you want your characters to have with what arts you wish to unlock. The real-time combat is a fun way to take out trash mobs out in the overworld, but it is basic compared to Falcom's real action games like YS VIII and is primarily intended as a way to soften up monsters before finishing them off in the traditional turn-based combat mode.\n\nThe story remains the same as the original. It is a slow burn, meant to build up and explore the Kingdom of Liberl before the REAL action starts in the 2nd Chapter. The English localization has changed from the original XSEED release, while there is much controversy over this change (and the liberties XSEED took in their localization), I will say the dialogue was fine and was not \"flat\" as some may complain. All of the notes hit, in moments of both tragedy and comedy. Overall, it reads as a more faithful translation of the Japanese, and yes, that means no Joss Whedon/MCU-esque quips every other line of dialogue. But strangely the new localization took liberties in places XSEED didn't, but not to the same degree as XSEED. There are no character derailments or exaggerations like XSEED's Estelle. \n\nThe soundtrack is a beautiful orchestrated version of the original tracks, and sounds so faithful throughout most of the game you have to listen to the tracks one after the other to tell the difference. There are no embarrassments like in the EVO arranged version of the original's soundtrack. Which, by the way, is an option you can choose along with the original and the full remake's OST. Silver Will sounds more bone-chilling and adrenaline-inducing than ever.\n\nTrails in the Sky 1st Chapter is my GOTY and I had the time of my life with it. I started Trails with the original Sky 1 back in 2019, and while I did eventually fall in love with it, it took me awhile to get through. It was a very, very slow burner. Sky 1st Chapter takes the exact same scenarios and makes them a total blast to playthrough with its amazing overhaul to the game's presentation and combat. Every weakness of the original has been lovingly patched over with total reverence for the original's vision. If its sequel, coming out next year already (yay!), is anywhere near as much of an improvement over the original as Sky 1st Chapter is, it will turn out to be one of THE GREATEST RPGs and even games of all time. After playing Sky 1st Chapter I anticipate Sky 2nd Chapter (working title?) even more than I did this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great JRPG and a great starting point for someone thinking about starting their Trails-Journey. \nThe Story is engaging and the Characters will grow close to your heart. \nThe Trails series has my favorite Turn-Based-Combat-System across all games I've played. \nI would definity recommend trying out the Demo, if you're deliberating to buy this game or to get into the Trails series as you can continue your playthrough from the Demo in the full game later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HEY DID U WANT AN INCREDIBLE OVERARCHING NARRATIVE THAT RIVALS THE EARLY MCU? HOW ABOUT THE CUTEST, MOST FUNNY GIRL MAIN CHARACTER EVER? OH BOY DO I GOT A GAME FOR YOU. but seriously, the trails series never fails to surpise me with how in depth its characte building is. even random npc standing around have diff voice lines depending on how far into the game you are, which coalesce into their own mini story arcs. my fav is the one about the 2 kids where the boy wants to be a merchant but his friend harshly reminds him of how bad he is at math and that it's kinda essential. eventually she reluctantly agrees to help him and that turns into her admiting that she has a huge crush and is only helping so they can make enough money and start a life together when they grow up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not done with the game yet but it might become the best JRPGs of my life ! \nIt's carried completely by the gameplay which is a combat system I have never seen in any RPG and is by far the best ever. Even lil mob fights are interesting as you are always engaged to optimize your movement and use of different ability. \nThe ability to accelerated everything is insane as QOL \nThe music is good but not even close to DQ, FF and Chrono Trigger in my opinion. It's actually the only thing that is lacking as an OST lover.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A blast to play and some great visuals. Like the mix of action and turn based combat. Story is fine for the most part, but picks up a lot in the final chapter. The characters are where this game shines bright. Estelle came off as a little annoying at the start but over the course of their journey she really matured and became a great character. I can't wait for the 2nd chapter remake coming soon. In the meantime I'm going to play the original SC, because I can't leave it on a cliffhanger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so good it made me buy the rest of the series and I finished SC as well (which is crazy since i have had for the longest time trouble finishing games). \n\nCan't wait till i'm caught up and able to experience the newer games in this series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great update to a great old game. This release make it so that newer JRPG fan can get in the game easier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "way too wordy and kinda boring but fun overall i guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a long time Trails fan whose favorite game in the series is Sky SC, this is clearly made by people with a deep passion and love of the original game. It also makes for a great entry into the series. All around a fantastic offering for new and old fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best remakes in the whole history. If not the best. Falcom did a great job and remade everything, saving vibes of og with new stuff in addition. Enjoyed it as if I was playing it for the first time. Best entry into the long-lasting series with one big whole plot and one of the best worldbuilding in the entire game industry. Best JRPG series imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never got into the original. When the remake hit it looked spectacular. Now that I finished the game I cannot wait for chapter 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never much cared for this series or the original in particular. Played it for a week or so and moved on. Well, considering how gorgeous this remake looked, and the neat real-time/turn-based switch mechanic, I figured I'd give it a try....and I'm glad I did.\r\n\r\nIt's everything a good JRPG should be. Simple, direct, non-confusing, beautiful scenery, cute characters, challenging combat, tolerable grinding, and a great soundtrack. I think if you're a fan of JRPGs, even if you never cared for the more rudimentary/archaic nature of the original game, you'll for sure like this remaster. \r\n\r\nI'm looking forward to them doing this with the rest of the series. If so, they have a new fan and an open wallet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the remaster, I just wished they would of asked for $5-10 more dollars and actually voiced all the dialog, there are some scenes that are only half voiced and it just kinda ruins it for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Localization inconsistency aside, this is a fabulous way to experience the origin of Trails.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The beginning of an incredible journey made more accessible. I recommend you play this, especially if you like, game spanning epic stories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Estelle and Joshua deserve some love. Best JRPG of the year, one to start another 500+ hour play through of the entire series with the only bad thing being the wait for chapter two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trails in the Sky 1st Chapter is quite possibly one of the best video game remakes ever made, one made with love for every single facet of the original. While I prefer Xseed's script to GungHo's, I would without hesitation recommend playing this game if you are even remotely interested in Trails. It is incredible.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is absolutely worth playing. The core experience is fantastic—Falcom once again proves their mastery in crafting engaging stories, solid gameplay, and memorable soundtracks. Their attention to detail and world-building is top-tier.\nUnfortunately, the publishing and handling by GungHo significantly detracts from the overall experience. Poor localization choices, questionable monetization strategies, and lackluster support have left a stain on what could have been a near-perfect release.\nIf you’re a fan of Falcom’s work, the game still shines through. Just be prepared to look past the publisher’s missteps.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The graphics are great, the animations are great, the music is great, the dialogue and voice acting is great, the combat is amazing, the RPG progression system is great. The vast majority of this game is awesome, except one thing, the story is the most boring JRPG I have ever played.\r\nI am almost 60 hours into the game, on chapter 3 of 4, and there are absolutely no stakes what so ever. You are literally traveling from town to town doing random odd jobs for people. Like, there are monsters in my garden can you make them go away? I lost the keys to my warehouse, can you find them? A light went out on the side of the road, can you fix it? I need some mushrooms for my soup, can you find me some? I am not even joking.\r\nNo big bad guy trying to take over the world, or summon a demon from a nether plan. No mana tree dying inviting monsters into the world, nothing. \r\nI read the game picks up, but I can't recommend someone buy this game to spend 60 hours doing menial jobs where nothing important is going on at all. Only reason I am not dropping the game right here is because I already put so much time in. \r\nIf you like the over the top, epic level story from games like the Tales series, Mana series, Final Fantasy, YS, so on, this game does not have it. \r\nEverything else is top notch.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For a remake, I'd say this game does a really good job. Specifically the combat is pretty good throughout the entire game. But the story (which I assume is unchanged?) is really bland for 95% of the game and only starts going IN THE FINAL COUPLE CUTSCENES. This game was obviously written before ChatGPT existed, but it kind of feels like it was at times with how much nothing happens",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels cheap and soulless against the original. Will be refunding",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] Trails in the Sky 1st Chapter - the Prologue's Foreword Part 1/8  [/h1]\n\n[b] TLDR: This game is 90% filler and the remaining 10% is only interesting if this is your first time seeing anything anime adjacent story wise or have room temperature IQ  [/b]\n\nJust so you get how long and drawn out the cutscenes and explanations are, my review is going to reflect this as well\n\nThe plot centers on *deep breath* Estelle Bright, daughter of Cassius Bright (former S-Rank bracer and ex-general), adoptive sister of Joshua Bright, student of Scherazard, junior bracer of the Liberl Kingdom’s Rolent branch under Aina. She travels with *another breath* Joshua Bright, adopted son of Cassius, junior bracer of the same branch, designated analytic ballast for Estelle. Together they wander Liberl to qualify for senior bracer status.\n\nThis could’ve been a single sentence. Instead it stretches itself into a multi-paragraph roll call, the narrative equivalent of a student essay padding every line to hit a mandatory word count, which is the exact problem with the game: constant exposition, constant recaps, constant nothing. If you can tolerate hours of conversational drift, low-stakes errands, and cutscenes that insist on narrating every molecule of the air around them, proceed. If not please avoid this game like the plague.\n\nThe gameplay is structurally sound. The turn economy works, the positioning matters (sometimes), and the system tries to differentiate itself without collapsing into gimmickry. Level scaling kills most grinding; once you match enemy level, XP evaporates, and the game on normal difficulty never punishes you for skipping encounters.\n\nBut without the x4 speed toggle, the pacing would be intolerable. Even with it, the final quarter becomes an act of self-coercion: pushing through out of obligation rather than engagement, hoping there will be some kind of payoff.\nThere isn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game itself is good but you are honestly better off waiting for some anon to mod in the original Xseed localization. The new localization being drier with unnatural grammar is one thing but not bothering to make sure you are being consistent with terminology across a 13 game series just shows a complete lack of care and the fact that all the item, quartz, and accessory names were blatantly machine translated when they could’ve just copied their historic names from the wiki for the same level of effort is downright offensive.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "I played the original (was sitting unplayed in my library) and 1st chapter side by side. While 1st chapter is impressive initially (they have done A LOT of work in the remake), it became apparent that this version has missed the originals comedy, quirk and charm by a large margin. Unusual since its competing with the 2d sprites of the original.\nI think its due to a few reasons, one is, dialogue has been quite watered down from the original, maybe a younger audience in mind?. Two, the Japanese VA's sound unusual IMHO, as a Japanese speaker, they just sound \"off\", I cant remember another example in media where native VA's were this jarring. Three, Estelle comes across as quite \"vanilla\" and lacking charm despite having higher fidelity models at the devs disposal, she really falls short compared to the original 2D images as stated previously. \nI could go on but essentially, the original had me chuckling and drew me in easily to the the characters and story while the remake had a cold \"sterile\" vibe after some time with it. I wish I could give a \"Meh\" rating as its not terrible, but I recommend giving this a miss and grabbing the original.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "This game is absolutely worth playing. The core experience is fantastic—Falcom once again proves their mastery in crafting engaging stories, solid gameplay, and memorable soundtracks. Their attention to detail and world-building is top-tier.\nUnfortunately, the publishing and handling by GungHo significantly detracts from the overall experience. Poor localization choices, questionable monetization strategies, and lackluster support have left a stain on what could have been a near-perfect release.\nIf you’re a fan of Falcom’s work, the game still shines through. Just be prepared to look past the publisher’s missteps.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The graphics are great, the animations are great, the music is great, the dialogue and voice acting is great, the combat is amazing, the RPG progression system is great. The vast majority of this game is awesome, except one thing, the story is the most boring JRPG I have ever played.\r\nI am almost 60 hours into the game, on chapter 3 of 4, and there are absolutely no stakes what so ever. You are literally traveling from town to town doing random odd jobs for people. Like, there are monsters in my garden can you make them go away? I lost the keys to my warehouse, can you find them? A light went out on the side of the road, can you fix it? I need some mushrooms for my soup, can you find me some? I am not even joking.\r\nNo big bad guy trying to take over the world, or summon a demon from a nether plan. No mana tree dying inviting monsters into the world, nothing. \r\nI read the game picks up, but I can't recommend someone buy this game to spend 60 hours doing menial jobs where nothing important is going on at all. Only reason I am not dropping the game right here is because I already put so much time in. \r\nIf you like the over the top, epic level story from games like the Tales series, Mana series, Final Fantasy, YS, so on, this game does not have it. \r\nEverything else is top notch.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For a remake, I'd say this game does a really good job. Specifically the combat is pretty good throughout the entire game. But the story (which I assume is unchanged?) is really bland for 95% of the game and only starts going IN THE FINAL COUPLE CUTSCENES. This game was obviously written before ChatGPT existed, but it kind of feels like it was at times with how much nothing happens",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels cheap and soulless against the original. Will be refunding",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] Trails in the Sky 1st Chapter - the Prologue's Foreword Part 1/8  [/h1]\n\n[b] TLDR: This game is 90% filler and the remaining 10% is only interesting if this is your first time seeing anything anime adjacent story wise or have room temperature IQ  [/b]\n\nJust so you get how long and drawn out the cutscenes and explanations are, my review is going to reflect this as well\n\nThe plot centers on *deep breath* Estelle Bright, daughter of Cassius Bright (former S-Rank bracer and ex-general), adoptive sister of Joshua Bright, student of Scherazard, junior bracer of the Liberl Kingdom’s Rolent branch under Aina. She travels with *another breath* Joshua Bright, adopted son of Cassius, junior bracer of the same branch, designated analytic ballast for Estelle. Together they wander Liberl to qualify for senior bracer status.\n\nThis could’ve been a single sentence. Instead it stretches itself into a multi-paragraph roll call, the narrative equivalent of a student essay padding every line to hit a mandatory word count, which is the exact problem with the game: constant exposition, constant recaps, constant nothing. If you can tolerate hours of conversational drift, low-stakes errands, and cutscenes that insist on narrating every molecule of the air around them, proceed. If not please avoid this game like the plague.\n\nThe gameplay is structurally sound. The turn economy works, the positioning matters (sometimes), and the system tries to differentiate itself without collapsing into gimmickry. Level scaling kills most grinding; once you match enemy level, XP evaporates, and the game on normal difficulty never punishes you for skipping encounters.\n\nBut without the x4 speed toggle, the pacing would be intolerable. Even with it, the final quarter becomes an act of self-coercion: pushing through out of obligation rather than engagement, hoping there will be some kind of payoff.\nThere isn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game itself is good but you are honestly better off waiting for some anon to mod in the original Xseed localization. The new localization being drier with unnatural grammar is one thing but not bothering to make sure you are being consistent with terminology across a 13 game series just shows a complete lack of care and the fact that all the item, quartz, and accessory names were blatantly machine translated when they could’ve just copied their historic names from the wiki for the same level of effort is downright offensive.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "This game is absolutely worth playing. The core experience is fantastic—Falcom once again proves their mastery in crafting engaging stories, solid gameplay, and memorable soundtracks. Their attention to detail and world-building is top-tier.\nUnfortunately, the publishing and handling by GungHo significantly detracts from the overall experience. Poor localization choices, questionable monetization strategies, and lackluster support have left a stain on what could have been a near-perfect release.\nIf you’re a fan of Falcom’s work, the game still shines through. Just be prepared to look past the publisher’s missteps.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I played the original (was sitting unplayed in my library) and 1st chapter side by side. While 1st chapter is impressive initially (they have done A LOT of work in the remake), it became apparent that this version has missed the originals comedy, quirk and charm by a large margin. Unusual since its competing with the 2d sprites of the original.\nI think its due to a few reasons, one is, dialogue has been quite watered down from the original, maybe a younger audience in mind?. Two, the Japanese VA's sound unusual IMHO, as a Japanese speaker, they just sound \"off\", I cant remember another example in media where native VA's were this jarring. Three, Estelle comes across as quite \"vanilla\" and lacking charm despite having higher fidelity models at the devs disposal, she really falls short compared to the original 2D images as stated previously. \nI could go on but essentially, the original had me chuckling and drew me in easily to the the characters and story while the remake had a cold \"sterile\" vibe after some time with it. I wish I could give a \"Meh\" rating as its not terrible, but I recommend giving this a miss and grabbing the original.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "The graphics are great, the animations are great, the music is great, the dialogue and voice acting is great, the combat is amazing, the RPG progression system is great. The vast majority of this game is awesome, except one thing, the story is the most boring JRPG I have ever played.\r\nI am almost 60 hours into the game, on chapter 3 of 4, and there are absolutely no stakes what so ever. You are literally traveling from town to town doing random odd jobs for people. Like, there are monsters in my garden can you make them go away? I lost the keys to my warehouse, can you find them? A light went out on the side of the road, can you fix it? I need some mushrooms for my soup, can you find me some? I am not even joking.\r\nNo big bad guy trying to take over the world, or summon a demon from a nether plan. No mana tree dying inviting monsters into the world, nothing. \r\nI read the game picks up, but I can't recommend someone buy this game to spend 60 hours doing menial jobs where nothing important is going on at all. Only reason I am not dropping the game right here is because I already put so much time in. \r\nIf you like the over the top, epic level story from games like the Tales series, Mana series, Final Fantasy, YS, so on, this game does not have it. \r\nEverything else is top notch.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For a remake, I'd say this game does a really good job. Specifically the combat is pretty good throughout the entire game. But the story (which I assume is unchanged?) is really bland for 95% of the game and only starts going IN THE FINAL COUPLE CUTSCENES. This game was obviously written before ChatGPT existed, but it kind of feels like it was at times with how much nothing happens",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels cheap and soulless against the original. Will be refunding",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] Trails in the Sky 1st Chapter - the Prologue's Foreword Part 1/8  [/h1]\n\n[b] TLDR: This game is 90% filler and the remaining 10% is only interesting if this is your first time seeing anything anime adjacent story wise or have room temperature IQ  [/b]\n\nJust so you get how long and drawn out the cutscenes and explanations are, my review is going to reflect this as well\n\nThe plot centers on *deep breath* Estelle Bright, daughter of Cassius Bright (former S-Rank bracer and ex-general), adoptive sister of Joshua Bright, student of Scherazard, junior bracer of the Liberl Kingdom’s Rolent branch under Aina. She travels with *another breath* Joshua Bright, adopted son of Cassius, junior bracer of the same branch, designated analytic ballast for Estelle. Together they wander Liberl to qualify for senior bracer status.\n\nThis could’ve been a single sentence. Instead it stretches itself into a multi-paragraph roll call, the narrative equivalent of a student essay padding every line to hit a mandatory word count, which is the exact problem with the game: constant exposition, constant recaps, constant nothing. If you can tolerate hours of conversational drift, low-stakes errands, and cutscenes that insist on narrating every molecule of the air around them, proceed. If not please avoid this game like the plague.\n\nThe gameplay is structurally sound. The turn economy works, the positioning matters (sometimes), and the system tries to differentiate itself without collapsing into gimmickry. Level scaling kills most grinding; once you match enemy level, XP evaporates, and the game on normal difficulty never punishes you for skipping encounters.\n\nBut without the x4 speed toggle, the pacing would be intolerable. Even with it, the final quarter becomes an act of self-coercion: pushing through out of obligation rather than engagement, hoping there will be some kind of payoff.\nThere isn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game itself is good but you are honestly better off waiting for some anon to mod in the original Xseed localization. The new localization being drier with unnatural grammar is one thing but not bothering to make sure you are being consistent with terminology across a 13 game series just shows a complete lack of care and the fact that all the item, quartz, and accessory names were blatantly machine translated when they could’ve just copied their historic names from the wiki for the same level of effort is downright offensive.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "This game is absolutely worth playing. The core experience is fantastic—Falcom once again proves their mastery in crafting engaging stories, solid gameplay, and memorable soundtracks. Their attention to detail and world-building is top-tier.\nUnfortunately, the publishing and handling by GungHo significantly detracts from the overall experience. Poor localization choices, questionable monetization strategies, and lackluster support have left a stain on what could have been a near-perfect release.\nIf you’re a fan of Falcom’s work, the game still shines through. Just be prepared to look past the publisher’s missteps.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I played the original (was sitting unplayed in my library) and 1st chapter side by side. While 1st chapter is impressive initially (they have done A LOT of work in the remake), it became apparent that this version has missed the originals comedy, quirk and charm by a large margin. Unusual since its competing with the 2d sprites of the original.\nI think its due to a few reasons, one is, dialogue has been quite watered down from the original, maybe a younger audience in mind?. Two, the Japanese VA's sound unusual IMHO, as a Japanese speaker, they just sound \"off\", I cant remember another example in media where native VA's were this jarring. Three, Estelle comes across as quite \"vanilla\" and lacking charm despite having higher fidelity models at the devs disposal, she really falls short compared to the original 2D images as stated previously. \nI could go on but essentially, the original had me chuckling and drew me in easily to the the characters and story while the remake had a cold \"sterile\" vibe after some time with it. I wish I could give a \"Meh\" rating as its not terrible, but I recommend giving this a miss and grabbing the original.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "The graphics are great, the animations are great, the music is great, the dialogue and voice acting is great, the combat is amazing, the RPG progression system is great. The vast majority of this game is awesome, except one thing, the story is the most boring JRPG I have ever played.\r\nI am almost 60 hours into the game, on chapter 3 of 4, and there are absolutely no stakes what so ever. You are literally traveling from town to town doing random odd jobs for people. Like, there are monsters in my garden can you make them go away? I lost the keys to my warehouse, can you find them? A light went out on the side of the road, can you fix it? I need some mushrooms for my soup, can you find me some? I am not even joking.\r\nNo big bad guy trying to take over the world, or summon a demon from a nether plan. No mana tree dying inviting monsters into the world, nothing. \r\nI read the game picks up, but I can't recommend someone buy this game to spend 60 hours doing menial jobs where nothing important is going on at all. Only reason I am not dropping the game right here is because I already put so much time in. \r\nIf you like the over the top, epic level story from games like the Tales series, Mana series, Final Fantasy, YS, so on, this game does not have it. \r\nEverything else is top notch.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For a remake, I'd say this game does a really good job. Specifically the combat is pretty good throughout the entire game. But the story (which I assume is unchanged?) is really bland for 95% of the game and only starts going IN THE FINAL COUPLE CUTSCENES. This game was obviously written before ChatGPT existed, but it kind of feels like it was at times with how much nothing happens",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels cheap and soulless against the original. Will be refunding",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1] Trails in the Sky 1st Chapter - the Prologue's Foreword Part 1/8  [/h1]\n\n[b] TLDR: This game is 90% filler and the remaining 10% is only interesting if this is your first time seeing anything anime adjacent story wise or have room temperature IQ  [/b]\n\nJust so you get how long and drawn out the cutscenes and explanations are, my review is going to reflect this as well\n\nThe plot centers on *deep breath* Estelle Bright, daughter of Cassius Bright (former S-Rank bracer and ex-general), adoptive sister of Joshua Bright, student of Scherazard, junior bracer of the Liberl Kingdom’s Rolent branch under Aina. She travels with *another breath* Joshua Bright, adopted son of Cassius, junior bracer of the same branch, designated analytic ballast for Estelle. Together they wander Liberl to qualify for senior bracer status.\n\nThis could’ve been a single sentence. Instead it stretches itself into a multi-paragraph roll call, the narrative equivalent of a student essay padding every line to hit a mandatory word count, which is the exact problem with the game: constant exposition, constant recaps, constant nothing. If you can tolerate hours of conversational drift, low-stakes errands, and cutscenes that insist on narrating every molecule of the air around them, proceed. If not please avoid this game like the plague.\n\nThe gameplay is structurally sound. The turn economy works, the positioning matters (sometimes), and the system tries to differentiate itself without collapsing into gimmickry. Level scaling kills most grinding; once you match enemy level, XP evaporates, and the game on normal difficulty never punishes you for skipping encounters.\n\nBut without the x4 speed toggle, the pacing would be intolerable. Even with it, the final quarter becomes an act of self-coercion: pushing through out of obligation rather than engagement, hoping there will be some kind of payoff.\nThere isn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game itself is good but you are honestly better off waiting for some anon to mod in the original Xseed localization. The new localization being drier with unnatural grammar is one thing but not bothering to make sure you are being consistent with terminology across a 13 game series just shows a complete lack of care and the fact that all the item, quartz, and accessory names were blatantly machine translated when they could’ve just copied their historic names from the wiki for the same level of effort is downright offensive.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "This game is absolutely worth playing. The core experience is fantastic—Falcom once again proves their mastery in crafting engaging stories, solid gameplay, and memorable soundtracks. Their attention to detail and world-building is top-tier.\nUnfortunately, the publishing and handling by GungHo significantly detracts from the overall experience. Poor localization choices, questionable monetization strategies, and lackluster support have left a stain on what could have been a near-perfect release.\nIf you’re a fan of Falcom’s work, the game still shines through. Just be prepared to look past the publisher’s missteps.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I played the original (was sitting unplayed in my library) and 1st chapter side by side. While 1st chapter is impressive initially (they have done A LOT of work in the remake), it became apparent that this version has missed the originals comedy, quirk and charm by a large margin. Unusual since its competing with the 2d sprites of the original.\nI think its due to a few reasons, one is, dialogue has been quite watered down from the original, maybe a younger audience in mind?. Two, the Japanese VA's sound unusual IMHO, as a Japanese speaker, they just sound \"off\", I cant remember another example in media where native VA's were this jarring. Three, Estelle comes across as quite \"vanilla\" and lacking charm despite having higher fidelity models at the devs disposal, she really falls short compared to the original 2D images as stated previously. \nI could go on but essentially, the original had me chuckling and drew me in easily to the the characters and story while the remake had a cold \"sterile\" vibe after some time with it. I wish I could give a \"Meh\" rating as its not terrible, but I recommend giving this a miss and grabbing the original.",
      "voted_up": false,
      "votes_helpful": 64
    }
  ]
}