{
  "positive": [
    {
      "review": "It's the video game equivalent of crack cocaine, only cheaper and even more capable of completely destroying your life",
      "voted_up": true,
      "votes_helpful": 371
    },
    {
      "review": "3000% luck -> gets burger from opening a box 3 times in a row\n\ngame is alright but a lot of things don't make sense",
      "voted_up": true,
      "votes_helpful": 262
    },
    {
      "review": "This Game Is a 10-Dollar Threat to My Personal Hygiene\r\n\r\nRating: 11 / 10\r\n\r\nAlright, forget your $70 AAA disappointments. Forget buggy messes, pointless stories, and games that demand a $2,000 graphics card.\r\n\r\nMEGABONK IS HERE. AND IT IS A BANGER.\r\n\r\nI went in expecting a cheap laugh. I've come out 30 hours later, sleep-deprived, seeing glowing XP gems when I close my eyes, and my life has been fundamentally changed. This game has a \"Very Positive\" rating on Steam for a reason: it's one of the most addictive substances legally sold.\r\n\r\nWhat Even Is This?\r\n\r\nImagine Vampire Survivors. Now, give it a 3D engine, a physics-defying jump button, a hit of 1990s-era graphics, and a truly stupid sense of humor.\r\n\r\nYou are dumped into an arena. Hordes of enemies appear. You run. You jump. You slide. And you automatically \"bonk\" everything in sight. You grab loot, you level up, and you create builds so absurdly overpowered that the game engine starts to sweat.\r\n\r\nThe \"Just One More Run\" Addiction\r\n\r\nThis game's core loop is so perfectly tuned it should be studied by scientists.\r\n\r\n    10:00 PM: \"Okay, I'll try one run. This looks silly.\"\r\n\r\n    10:45 PM: \"Whoa, I unlocked 'Monke' who can climb walls. And I just got an item that makes my axes orbit me. Okay, one more run to try this out.\"\r\n\r\n    1:30 AM: \"My build is insane. I have 70 items. I'm shooting 4,000 projectiles a second. The screen is just a solid wall of damage numbers. I am a god. I cannot be stopped.\"\r\n\r\n    1:32 AM: A boss looks at me sideways. I die instantly.\r\n\r\n    1:33 AM: \"THAT WAS BULLS**T. JUST. ONE. MORE. RUN.\"\r\n\r\nThis is it. This is the whole game. It's perfect.\r\n\r\nWhy It's Better Than Everything Else\r\n\r\nThis game puts $100-million-dollar titles to shame.\r\n\r\n    It Costs 10 Bucks: That's less than a single, ugly horse armor skin in Diablo. For that price, you get 20+ characters, 70+ items, and endless replayability.\r\n\r\n    It Runs on a Toaster: The system requirements on Steam literally list \"potato\" for the processor and \"no\" for the graphics card. And it's still more fun than games that require a quantum computer.\r\n\r\n    The Builds are STUPID (in a good way): This isn't about tiny 5% stat increases. This is about finding combinations that break the game. You can become an unkillable, screen-clearing demigod, and the game wants you to.\r\n\r\n    No Bugs, Only Features: Unlike some games we've discussed, if you suddenly clip through the map and fly into the sky, it just feels like part of the \"bonk\" experience.\r\n\r\nConclusion:\r\n\r\nThis game is an absolute, 11/10, life-ruining masterpiece. It's pure, uncut, chaotic fun. It asks for nothing and gives you everything. Stop reading this. Go spend the 10 bucks. Go bonk.",
      "voted_up": true,
      "votes_helpful": 198
    },
    {
      "review": "Balance is a mess, a boss that can and will spawn inside you leading to an instant run ending, most of the weapons, items and characters are completely useless, moving at any pace beyond \"painfully slow\" requires exploiting an engine glitch, end boss mechanics are the opposite of a good time, community's toxic as hell, dev insists on a ridiculous leaderboard mechanic that prevents the game from evolving since its balanced around a maximized meta, the fact there is a meta at all in a PvE game, scaling seems to have been calculated by a drunk gibbon, zero build diversity, cringeworthy meming, runs are almost entirely based on the whims of an RNG God that hates you personally\n\nTime for another round. Haha skeleton go fast.",
      "voted_up": true,
      "votes_helpful": 406
    },
    {
      "review": "Megabonk is one of the those games where you can chill and play after a long day at work. Amazing game on PC and Steam Deck that gets better and better with progression and is insanely addicting too. It is similar to games like Brotato and Vampire Survivors. It is at a good price point and would 10/10 Recommend to Bonk!",
      "voted_up": true,
      "votes_helpful": 37
    },
    {
      "review": "Bought this game out of respect for the developer's integrity - an extremely rare trait nowadays. Turned out to be a 3D vampire survivors but with a potentially addicting loop\n\nI might have to be wary of myself or I will likely end up playing for hours on end XD",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "I will happily nominate this game for a Game you Suck at. I had so much fun with it, and I am looking forward to way more fun and unlocks.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Immensely satisfying and a true evolution of the \"Survivors-like\" (or, my preferred term, \"bullet heaven\") genre. It's so entertaining and a great way to relax and unwind. The leaderboards are a very nice touch, albeit a constant reminder to me how much I suck at this game compared to my friends!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Megabonk is basically what happens when someone mixes platforming, chaos, physics, and pure disrespect for gravity into one game... and then says \"Yep, ship it.\"\nYour mission? Simple Bonk things. Bonk everything. Bonk like your life depends on it. And trust me, it will depend on it because half the time you'll bonk yourself off a cliff instead.\nIf you want a game that's silly, chaotic, surprisingly fun, and lets you feel like a discount superhero with a bonking stick... this is it.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Addictive asf. Put some loud music in your headphones and get ready for nonstop grind. Every run is hilarious, chaotic, and makes you wanna keep improving — the more you play, the crazier it gets. Can’t stop playing!",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "MEGABONK is one of those games you can jump into after a long, exhausting day and still end up having a great time. The soundtrack, character designs, and skill animations are all genuinely impressive. What really stands out is the sheer variety of builds you can experiment with, allowing for tons of creative playstyles. Every session gives a strong dopamine rush that keeps you coming back for more. A surprisingly addictive and well-crafted experience.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "- Have you ever done a bonk? Megabonk.\n- Megabonk.\n- Are you being held in a megabonk? Megabonk.\n- Megabonk.\n- When you don't fulfill your duties, are you held in a bonk? Megabonk.\n- Megabonk\n- Difficulty +5%.\n- Difficulty +5%.\n- How do you feel when you hold the hand of someone you love? Difficulty +5%.\n- Difficulty +5%.\n- Were you taught to attach Monke to monke? Difficulty +5%.\n- Difficulty +5%.\n- Do you long to connect with someone Monke? Difficulty +5%.\n- Difficulty +5%.\n- Do you dream of connecting with someone? Difficulty +5%.\n- Difficulty +5%.\n- How do you feel when you hold your monke in your hands? Difficulty +5%.\n- Difficulty +5%.\n- Do you feel like something is missing?\n- Difficulty +5%.\n- Books to increase experience.\n- Books to increase experience.\n- Repeat three times “Books to increase experience.”\n- Books to increase experience, Books to increase experience, Books to increase experience.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "After about 70 hours of playing and getting 100% of the achievements, I feel ready to write my review of Megabonk. If you like games like Vampire Survivors or Brotato, you will absolutely love Megabonk, a game that I found totally amazing. It is basically an RPG roguelike where your main goal is simple: kill enemies, take down bosses, and last as long as you can. You'll get stronger as you go, leveling up, opening chests on the map, and grabbing other items that can make your run much easier. The game also features challenges that can be incredibly complicated and even frustrating, which is great if you are looking for an extra layer of difficulty beyond the normal mode. Right now, the game has 3 tiers, 2 zones, and 20 characters, and each one has their own special advantage when leveling up; plus, there's a huge variety of items, weapons, and tomes to unlock. To sum it up, this game is perfect for killing time: it’s super easy to get into and incredibly addictive. It's amazing that this was made by just one person. It’s totally worth the price; honestly, I'd pay even more. I understand the developer will likely add more content, but even if they don't, it's 100% worth it. An excellent indie game to add to your library.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Every single time we are forced to wait for Dani to release any new significant/important/worthwhile update, living itself as a pastime turns into an absolute Kevin. Oh well. Just as one filthy (but rich) 引きこもり once said - \"more is more, and [b][b]MORE[/b][/b] is [b][b]BETTER[/b][/b]\". 'nuff said in a nut.\n\nLife is a total Kevin sometimes, but at least you can shield against it with golden and spiky shields, cacti, lifesteals, toxic barrels, speedy cloaks, etc., whatever else \"ticks\" [i]your[/i] Kevins.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Megabonk is fast, chaotic, and surprisingly deep.\nDashing and bonking through enemy waves feels great, and the variety of characters, items, and quests keeps every run fresh. Easy to jump into, hard to stop playing. A solid pick for action roguelike fans.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Megabonk is as fun as it is frustrating at times. It's addictive fun for a quick rush, although it feels like the RNG hates you sometimes. It deserves whatever awards you think it does!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the game is interesting\n, but...\nwhere are the updates\nI'm addicted to bonking",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Takes me back to the good old days when I was eating sweets and drinking sodas instead of worrying about tomorrow 10/10 becoming a kid for 10 mins while playing it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great debut game by an unknown indie creator.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Had to uninstall the game due to a lack of self control. Do not play this game if you have stuff you need to do and can't say no to \"one last run\".",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very fun and very addictive! \n\nJUST ONE MORE RUN...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Pretty fun and can keep you busy for a while, handful of flaws. Going for unlocks is kinda fun but after that it’s pretty repetitive. Going for leaderboards is really mind numbing. Still worth the 10 bucks and worth your time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is one of the most addicting games ive ever played, the game loop is amazing. 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A combination of Vampire Survivors with Risk of Rain 2.\r\nAmazing and also frustrating but very good. \r\n\r\nEasy to learn, hard to bonk.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Megabonk: The Genre-Defining 3D Bonk[/h1]\n\nThe \"Survivors-like\" genre is crowded, but Megabonk immediately carves out its own identity with one major, genre-defining shift: it brings the frantic chaos of reverse bullet hell into a low-poly 3D environment. This is not merely a graphical facelift; it fundamentally alters the gameplay loop. Instead of simply dodging enemies on a flat plane, players must now contend with verticality, utilizing jumps, slides, and terrain to evade or gather enormous, three-dimensional hordes. This infusion of active movement and exploration injects a kinetic energy reminiscent of games like Risk of Rain 2.\n\nThe result is a more active, strategic, and intense experience than its 2D predecessors. Adding to the freshness is the game's unapologetically chaotic and meme-heavy humor. From absurd character designs like the skating skeleton to its frantic metal soundtrack, Megabonk leans into its absurdity, ensuring the aesthetic and tone are as unique as its perspective. While the core loop of leveling up and chasing powerful builds remains addictively familiar, the full transition to 3D makes Megabonk feel less like a clone and more like a genuine evolution of the horde-survival genre. If you're looking for an auto-shooter with a genuinely new angle and tons of quirky charm, this is the bonk-tastic blast you need.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Such Mega, very Bonk\n\nLovely little game that's the only of it's kind I've really gotten into besides Risk of Rain 2. Very silly, which I like too!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you like Vampire Survivors meets goofy characters in 3D, you'll love this! Want a super fast skateboarding skeleton? Done! Want a wall climbing monkey that flings his bananas? Deal! While there are no upgradeable weapons like Vampire Survivors, there are a lot of combos you can do in this in conjunction with character abilities for a unique run every time! There are tons of unlockables and achievements to be had, and the developer is still patching and balancing. I absolutely recommend this gem!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Goated game, super chill vibe, best for filling up free time",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this is truly the best game for Steam Deck, there won't be any games better than this one. It's okay to not release anything else",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Melhor surpresa indie para mim desse ano, comprei sem pesquisar muito só por estar em um valor baixo e me surpreendeu sendo o primeiro jogo do gênero que joguei. Recomendo para qualquer um, muito viciante e interessante de descobrir os novos personagens e matar o bosses com diferentes builds.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I never loved a game that much while also probably the worst player alive on it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best way to fill time while waiting for the StarLadder Budapest Cs2 major 2025 day 1 tech pause.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h3] Gameplay Mechanics – How the game plays moment-to-moment (movement, controls, unique systems). [/h3]\n\nThis is a roguelite time survival game. All you can do as the player is Walk, Crouch/Slide, Jump, Turn Camera and Aim (sometimes). It plays like Vampire Survivors or Risk Of Rain, I guess (never played it). You will enter a stage with a 10 minute countdown, and will have to go around the stage looking for chests, shrines and upgrades in general, while fighting off hoards of enemies and a few bosses. You will level up by killing enemies, allowing you to choose and upgrade your Weapons and Tomes.\n\nthis game has a silver mechanic, that is the currency that allows you to unlock new characters and gear. You gain silver passively through runs.\n\n[h3] Difficulty & Challenge – How hard the game is, balance of challenge, fairness. [/h3]\n\nThe game has several different levels and objectives, that make the difficulty vary a lot. To 100% it I would give it a 7, mostly due to completing 30 Challenges and a few of the weapons/tomes/item/character unlocks. In a casual run, with a meta character and build, the game can be a 5. If it were not for the tier 3 final boss, a casual run could be pretty easy, maybe a 3 or 4, But the last boss can really ruin your day.\n\n[h3] Combat System – How fights feel, variety of moves, enemy behavior. [/h3]\n\nYour character uses the weapons passively, just like the items and tomes. All you gotta do is walk around and avoid being hit by enemies.\n\n[h3] Weapons, Gear & Abilities – Variety, upgrade systems, usefulness, uniqueness. [/h3]\n\nThe game has quite a few weapons, a lot of them are very fun to use, My favorites were the Katana, Dexecutioner, Flamewalker, Axe and Aegis.\n\nYou also have Tomes, that upgrade your stats, for example, raising your Luck, XP Gain, Damage, Attack speed, Etc.\n\nThere are also Items, that you find in chests that drop from enemies and are also bought during runs.\n\nTo unlock most of these, you need to complete some in-game challenges and sometimes buy certain items or characters and then unlock them using silver.\n\nAll unlockable items can be turned on or off, meaning you can choose not to be able to find some of them during runs, if they don't fit your build or if you want to reduce the pool size to focus on an specifc build.\n\n[h3] Level/Area/Mob Design – How environments are structured, exploration, layout creativity. [/h3]\n\nThere are two maps so far on the game. The Desert and the Woods.\n\nThere are 3 tiers for both of them, each connected to one another by a portal that turns on after you kill the stage boss for the tier you are on. After the tier three stage, the portal actually teleports you to a boss stage, that is the same for both Desert and Woods.\n\nThe maps themselves are ok, they are procedurally generated, so they never repeat. Each tier has a different Hue to the ambient colors, but really not different at all. The maps are unremarkable and sometimes very annoying to get around if you don't have extra jumps (Mainly woods).\n\nI enjoy the mob design, there is quite a few different type of enemies, and some do have unique traits. For example the Desert has cacti enemies that shoot thorns at you if you sit still, so you gotta always keep moving when they spawn. However most mobs just walk at you and damage you by touching.\n\nI kinda feel like the mobs could look a little different from one tier to another, maybe following the color scheme for each tier. For example, the tier 3 Woods has Red grass, and then maybe the mobs could be red (As they are green on tier one and also is the grass).\n\n[h3] Story & Narrative – Plot, characters, pacing, emotional impact. [/h3]\n\nThere is none.\n\n[h3] Music & Sound Design - How good is the music and design and how well it fits the game. [/h3]\n\nThe music is very arcade-y, reminding me of old games that I really enjoyed as a kid. There are just a few tracks on the OST, but they more than enough for the game not to sound too repetitive. The sound design is really good, I love how satisfactory most of the sounds are. Huge bonus points for them actually adding the Bonk sound with the Bonk item haha.\n\n[h3] Visuals & Art Style – Graphics quality, artistic direction, animations. [/h3]\n\nThe visuals are retro, just like super nintendo, early 3D stuff. Just like Super Mario 64 and such. I think it fits the vibe of the game, and it really is quite nice to look at (at least until your super leveled weapons and skills take over the entire screen lmao.\n\n[h3] Performance & Polish – Bugs, frame rate, loading times, overall smoothness. [/h3]\n\nThe game runs super well 90% of the time, but I did have some freezes when opening chests and while having too many SFX from weapons going on at the same time.\n\n[h3] Replayability – Side content, multiple endings, NG+ options. [/h3]\n\nThe replayability is pratically infinite. There are 39 challenges, 20 characters, 29 weapons, 23 tomes and 78 items. The possibilities are practically endless, even more so with the dev updating the game quite often to change the meta sometimes.\n\n[h3] Boss Fights – Design, difficulty, creativity, memorability. [/h3]\n\nFighting bosses are just like fighting normal mobs, but with the added challenge of dodging attacks. Every tier 3 run has 3 stage bosses and 6 mini bosses. There are 6 unique mini bosses and 2 unique stage bosses. The final boss for a run is by far the hardest one. They throw annoying orbs, have invincibility phases, they disable your weapons. It is really easy to die to it even if you are op during the run. Sometimes they are a bit unfair due to where the shrines that disable the invincibility spawn, and also because of the orb behavior. There are my only issues with it (I also think it is lame that you can't lifesteal from it when it is invincible). The stage bosses and mini boses I really enjoy fighting though.\n\n[h3] Achievements – Creativity, difficulty, how they encourage exploration or mastery. [/h3]\n\nThe list is very complete, they make you unlock everything on the game and do 30 challenges. There are some hard unlock but there are also some easy ones, so it is a nice balance, with not much unfun grind. really solid selection. Some challenges really take some creativity to be able to get through (and some good RNG).\n\n[h3] Conclusion \n\nThis is a very nice roguelite, that enables the player to be engaged for hours and hours without becoming taxing. I was pretty burnout with this genre for a while and this game brought back my interest. The progression feels nice and the builds are super fun. I do wish they stole vampire survivors weapon combination idea, as Megabonk weapons could really do some crazy stuff with that mechanic. Solid 8/10 game. Best cozy game of the year.  [/h3]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Oyun bazen kendisini kaldıramayıp çöküyor ve ilk runımdan beridir liderlik tablosuna yeni runlarım eklenmedi \nAma eğlenceli çok fazla farklı karakter ve silah var aşırı güzel hissettiriyor. Harika oyun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Every aspect of a good game with the good noises and effects. Great for a chill sesh or challenge yourself by doing the quests with additional limitations. Well worth the purchase!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beware of this game. You will lose sense of time and the sun in the window will remind you that you forgot to go to sleep.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a really fun game, I see now why everyone was praising it. It is pretty much just Vampire Survivors but 3D, as generally everyone says.\n\nHowever, I find Megabonk to be much more enjoyable, though. I couldn't really get into Vampire Survivors.\n\nExperimenting with different builds is really fun, I'm trying to unlock Vlad soon! He seems cool.\n\nAlso, I thought Ogre sounded boring, but he's actually really fun! Give him a try if you're having doubts like I was. I also really like the idea of the Ninja, but he's quite hard... In any case, my favorite character so far is CL4NK/Calcium-- I can't pick between the two.\n\nOverall, Megabonk is a super cheap game, and has theoretically endless playtime! Give it a try, you won't regret it; unless you just don't like these kinds of games. I really hope they release some DLCs with more stages and characters, I'm sure they will. :3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is with the HIGHEST honor I bestow upon this game my 69th review.\r\n\r\nThis game is addicting fast paced ridiculously fun and you will never get the same build twice, it plays like a phone game without the micro transactions, no real world money besides the base game price!\r\n\r\nIts fun, Its Chaos, Its meme-riddled and doing it perfectly. \r\n\r\nThis FEELS like a video game. \r\n          Like they use to.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very addictive, lots of progress, very good yes indeed.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lots of (getting my ass kicked cause I dont understand rouge-lites) things to do learn and grind for achievements. Can be slightly addicting but not for me xd",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I definitely suck at it, but it's super fun anyway. Makes you want to keep trying and that's always a great feeling in a game :loddlelove:",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super addictive and hard to master. Has its own spirit. Died hundreds of times. Definitely will die hundreds of times again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Bunnyhopping is fun. The perspective switch from your average pick-three survivors game is also novel. But it is yet another pick-three survivors game. Which is fine by me given it's actually pretty fun, but I can see how people can just bounce off it right away. \r\nI didn't mention the silly dialog thing because I don't think it's an issue.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it's love - hate game. if you're lucky and get best weapons, buffs, items definetly get you on happiness. if you're unlucky (like me) it's most irritating but still addictive and well versed game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's essentially Vampire Survivors with some changes in 3D. Honestly it's an incredibly addicting game. Sure I do lose often but I still end up gaining something I love that!!! In nearly every possible way a truly fantastic indie game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While you are rotting in the endless loading screen purgatory of your raid, where the queue stretches longer than a death-row appeal - here is a gloriously morbid little game to keep the existential dread at bay (and maybe hasten the sweet release of actually playing)\nGreat meme-charged game, me likey!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's Vampire Survivors in 3D. What could go wrong?\nSeriously, the dev of Vampire Survivors should get at least 50% of all profits from Megabonk",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not being nominated in the Best Indie Game category at the GOTY awards should be a crime for this incredible game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Risk of rain meets vampire survivors. Fun and addicting.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A simple yet fun and quirky vampire survivors like game that you can easily sink hours into without realizing it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Here is an honest review for those of you who do not care for the meme reviews and nonsense.\r\n\r\nMegabonk is a solid Roguelike/Roguelite game that you can really play on any occasion in which you have at least 10 minutes available. PERFECT for steam deck, and genuinely enjoyable in any amount. \r\n\r\nWhile I do believe it is somewhat lacking in content currently (only 2 levels with 3 \"stages\" on each, with each \"stage\" being a different and harder version of the same map) but with future updates I hope more maps and content will be added. \r\n\r\nThe great thing about this game is that regardless of content, it has infinite replayability and the maps are RNG based so it does change significantly every playthrough. Dozens of characters, weapons and items make every run unique and fun, with abilities to change which items you see in each run to some extent, there really is a metric $#!%load of ways to play. With 51 hours in, I have yet to beat the final boss, but I am also still unlocking stuff! \r\n\r\nSeriously, if you even LIKE roguelikes, buy this game. Totally 100000% worth it. And just don't be a loser and use the Meta, do your own thing!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Steam recommended this game to be nominated in my \"Sit back and relax\" category. I voted on it for sit back and relax.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b]Megabonk[/b] is a chaotic 3D roguelite that blends humor, challenge, and frustration in equal measure. The concept is fun, gameplay is fast-paced and addicting, and the presentation has plenty of personality - yet the longevity of the game gets compromised by questionable design choices.\n\nThe first few dozen hours are easily the best part, when discovering new items and weapons still feels exciting and the difficulty curve fair. Each playable character feels distinct, and many have some kind of perk that makes their gameplay quite unique. The Forest area and its enemies are well designed, and the soundtrack does a great job of amplifying the tension and energy of each run. Unfortunately, the fun begins to fade the deeper you go, with the Desert area standing out as a frustrating mess of bad enemy types, annoying environmental hazards, and unbalanced bosses - which is a shame, since the layout itself is great.\n\nBalance is easily Megabonk's weakest point. Weapons feel underpowered compared to items, making power progression feel inconsistent and too luck-based. The final boss fight is both unfun and mechanically dull - taking away your weapons in a game that incentivizes you to level them up is surely a weird take. Combined with issues like forced bunny hopping (the difference in mobility is night and day), many challenges and quests dragging on for too long, many weapons and tomes being massively underpowered, among other issues, it ends up feeling more like an Early Access title than a finished product.\n\nOverall, Megabonk is a fun and unique entry in the roguelite genre that manages to have really high highs and low lows. Its early game is a blast, full of charm and chaotic fun, but it needs more work in order to have the replayability of a game like Vampire Survivors. Despite that, it's still worth checking out for its style and addicting gameplay loop.\n\n\n[h1]The Good[/h1]\n+ Interesting 3D take on a saturated genre\n+ Very fun and dopamine-inducing for the first 30 or so hours\n+ A godlike run with thousands of kills and tens of legendaries always feels amazing\n+ Soundtrack slaps, paying homage to many classics like Castlevania\n+ Art, VFX/SFX, and the game's irreverent theme complement each other very well\n+ Endless waves at the end of a stage is a very fun idea that brings a lot of risk-reward to the game\n+ Forest area is great, I recommend playing there for fun\n+ Leaderboard adds a lot of replayability, and extra points for having friends leaderboard!\n+ Memes\n\n\n[h1]The Neutral[/h1]\n* Game is deceptively hard, sometimes for the wrong reasons\n* At least the dev didn't make us do all challenges for the 100% achievement xDD\n* It's been a while since I've raged so much in a game, and I've played a lot of hard games recently\n\n\n[h1]The Bad[/h1]\n- Game feels too punishing in its current state, a second life with a small invulnerability window as a meta-progression unlockable would solve so many issues on late-game runs\n- Most challenges feel less like a test of skill and more like a battle against RNG and tedious mechanics\n- Microwaves, magnet, and boss statues should be another color/icon on the minimap\n- A hotkey for toggling between smart aim vs close aim would be very welcome\n- Desert area is actually so unfun to play - the end boss is just icing on the shitty cake\n- Taking away your extra weapons in the last boss feels like a cheap gimmick\n- Items are too strong compared to most weapons, making each run too reliant on good RNG\n- Feels like an Early Access game balancing-wise\n- Obligatory bunny hopping is annoying; it could give a small advantage, but not this much\n- Fuck cactus quest, why is there an unlockable item gated behind something like that\n\n\n[i]maybe him skill issue[/i]\n[h2]7 / 10 - IGN[/h2]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "quite funny and great sit back and relax game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Has been my daily wind-down game on my steam deck. Fun and runs great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "*Drug dealer approaches*\n- Mom... buy me some drugs pls\n- No son... we have drugs at home\n*Drugs at home*\n\n8+/10 \n- addicting as fuck but needs more items, maps and overall variety... also a system where You buy items in menu is bad because You can basically skip all the bad items and buy only the ones that are in meta... BoI did it well and Dead Cells did it wrong",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you dont like this game you have mental problems its the best game ever and i hope it stays.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 should not have shaken the sus bush\n(risk of rain style game, great flow)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pray to RNG, that you get what you want\r\nor just deal with what game gives you and you might get crazy build (like vampire on stage 2 desert, where i didnt have enough damage to deal with boss, but enough heal/lifesteal to survive 4 minutes of ghosts, just being their plaything over the whole map)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Vampire survivors in 3D. Simple rules. Short rounds. Good entertainment during my lunch breaks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "big bonkin, big stonkin\r\nbest game featuring a skeleton riding a skateboard that i've played this year",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very creative and enjoyable roguelike game that has a new take on vampire survivors type games.\r\nSo far one of the only vampire survivors games apart from the game itself that I've enjoyed.\r\n\r\nIf you're looking for a witty, memegame then this should be perfect for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Def a dope ass game.\r\nIt's not the game design masterclass that Vampire Survivors is, but if you have dopamine addiction and you're a zoomer with ADHD it helps fix you up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game, very addictive, highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Im megging my bonk rn\r\n\r\nPretty cool and addictive game, very funny too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't mind me, just chuggin sugar and dorito blend as I eviscerate wave after wave of dopamine inducing enemies; uncountable lives thrown into the abyss in the name of stimulation; an adorable fox wizard unleashing armageddon on everything observable, leaping with the wind, soaring with the spirits, every run a stale meme-filled apotheosis and by the gods is it addicting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great game to lean back and bing chill whilst playing, unless going for world record then god have mercy on your soul for how long it takes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While I've thoroughly enjoyed my time here so far, my recommendation is largely tentative and depends on my hopes for the direction that the dev will take with the game going forward. Movement is surprisingly fun, most characters are quite silly and charming, the current available maps actually feel and play very substantially different from each other and there's a pretty healthy variety of items to shake up how each run flows. Runs tend to suffer from a pretty sluggish start and endings that don't really feel totally satisfying, but everything in between feels excellent and the power curve feels solid. This sounds mostly fine and you'd expect things to smooth out with updates, but much of my concern for the future of the game comes from one particular aspect of the game that is immediately apparent the SECOND you open it.\n\nIf the inspirations weren't apparent enough from the promo material, the game can largely be described as a Risk of Rain-inspired survivor-like hybrid. While that line risks oversimplification and glossing over the details that make the game special, it should do a fine enough job of painting a picture of what to expect for those who have played those titles. Megabonk carries a number of strengths from its predecessors, but the mix of features tends to produce some new weaknesses that neither title struggled with in the past.\n\nItems are an extremely important part of the power curve of your runs and there's a ton of them to be found. Chests are plentiful around the map and also drop from some enemies, so you'll be seeing plenty of items to platform your character. Likewise, you'll become terribly familiar with the lengthy opening cutscene the game stuffs in when interacting with any chest that slows the earlygame to an absolute crawl. The game essentially takes Risk of Rain's chests and layers the VS chest opening sequence onto them, with the result being an insane overabundance of obnoxious game-pausing menus to stare at. While the lengthy opening animation can be mostly skipped, your run is still frozen with every opening and you still have to navigate through and accept the item. It gets REALLY tedious really quickly and is one of the major factors in how slow this game feels to start.\n\nThe other big issue weighing down the earlygame at the moment is movement. As previously mentioned, I think movement in this game is surprisingly fun... Once you actually learn how to use it correctly. Most of your speed comes from a combination of item stats and funky bhopping silliness, but without one (or both) of these you are INCREDIBLY slow. Sliding down hills can help but this is largely situational and map-dependent, so if you don't know any better you're gonna be spending a lot of time casually strolling around while getting run down by enemies that either move on pace or significantly outrun you. Movement tech should serve to elevate the current experience, but at the moment it's effectively mandatory to learn due to the size and scale of the map.\n\nBut these issues can be patched. Changes can be made to improve the experience and smooth out the snail pace you're stuck with from the start. My biggest concern is what cannot be adjusted with updates, and that is the feature that is presented in the main menu as soon as the game launches: The leaderboard.\n\nUnless hidden by a setting, there is a leaderboard that is always visible and displays the \"best\" runs ever performed in order of kill count. An innocent feature on its own, but with the way the game works at the moment it effectively defines a successful run by getting a lot of kills. This can only improved by two means: Grabbing difficulty-scaling items and staying alive in a run for a REALLY long time. The latter of the two is the problematic part, as every run ends with an endless survival section that exponentially scales in difficulty the longer you stay alive. The game essentially just spams one type of flying enemy at you forever and constantly increases their health and damage until you're dead. Getting smothered to death by one-tone enemy spam is a really lackluster way for a run to end, and the game railroads you into this situation at the end of literally EVERY run. \n\nAnd therein lies the problem: The leaderboard existing in its current state has effectively set this loop in stone. The current competition is very unfun, but it is what is official and thus people will compete. The loop is treated as a competitive experience and the community is giving feedback about \"balance\" and basing their vision on what is feasible at the \"highest levels\" of play... In this extremely unserious and goofy survivor-like. Will the dev make changes to the game based on the opinion of those sacrificing hours of their life running in circles for numbers that don't matter? Will nerfs come to items seen as overpowered by the smallest slice of the playerbase? Will changes be made in service to \"content\" the vast majority simply doesn't care about? Will good changes stay in place, even if they make things \"too easy\" and hurt the egos of big number gamers?\n\nI've seen this happen a lot in other games. All we can do is see where things go from here.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely incredible game, especially for one made by one person! I'm waiting for the meta to cycle out atm, but cracked the top 200 through the grind. Anybody can reach the top ranks with the right build. Super addicting and I can't wait to see how the meta shifts!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bonked until I cant bonk no more. Extremely addicting and fun until its not fun and you get shit luck 20 games in a row then this game is pure cancer. I would recommend to Ipad kids and people who doom scroll because of the massive dopamine rush from seeing so many things on the screen go boom.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a good game to turn your brain off and watch damage number go up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Based on a bunch of short clips I saw on the internet, this seemed awesome. After spending some time with it though I can say that while this is a fun game, for me it has failed to distinguish itself from the other games it takes heavy inspiration from (Risk of Rain 2, Vampire Survivors). All of it's elements don't feel like they form a cohesive whole and are there just to resemble RoR or VS. The soundtrack is absolutely phenomenal, though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is an absolute blast. so much variety in weapons/characters that you're sure to find some that suite your playstyle well. with the rng involved, each run will feel completely different as you'll have to adapt to what you're given and make it work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Risk of rain with vampire survivors. \nHope they add weapon  combinations and other maps. \nGood game - Recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Top tier addictive game. Love and hate it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An absolute gem. $10 for hours of gameplay. Can't wait for more content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "游戏有毒。但就是比毒品便宜很多又会毁了您的生活半夜不睡觉熬夜打这游戏。可以说棒棒，赞 \\(≧▽≦)/",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What can I say, I bought this game thinking it looked okay... I found I absolutely LOVE bonking shit! If you want a game you don't have to devote too much time to and have a blast, this is a great option. To sum it up, there's always one more run!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Do you have any friends? No? Awesome.\r\nThen this game is for you, it kind of reminds me of good ol' Realm of The Mad God, however in my opinion it's even better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please list the actual specs. I thought my i5-1135G7 with 8GB of RAM could run it smoothly, but it starts lagging in the later stages of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game!! \n\nIt is so much fun and so addicting to try and unlock everything! Vampire Survivors was an addiction of mine for a time, now it is this one!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is an absolute blast if you like survivor games. Loads of fun weapon/ tome combos and it's great on Steam Deck after a long day at work and you just want to sit on the couch and kill thousands of monstes with bananas.\r\n My only gripe is there's currently just 2 maps, I'm hoping there will be more variety in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "LOVE THIS GAME!! It's super fun to sit back and play, def gonna be my nomination for that award.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "How to make a review after playing only one hour so far...?!\n\nHmm, it plays like Vampire Survivors, if Vampire Survivors was going to be 3D...\nWait Vampire Survivors is going 3D...\nOkay it's 3D but the Gameplay changes to Dungeon Crawler (Vampire Crawlers).\nSo, i guess we're good to go that route then ^_^\n\nI like the Style wich reminds me of the pixely graphics of allready mentioned predecessor.\nGameplay seems pretty solid, i'm still not convinced of the meta progression but the game has to have something that seperates it from other games from the same category.\n\nDid i mention that you can play as Po...ahem...clearly i ment Giga-Chad !!\nGo play it if you enjoy'ed Vampire Survivors and all of it's follow ups = )\n\nOh and this review is totaly unbiased and unsponsored !!\n...why is it not sponsored uncle Poncle ?! O_o",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a good game. Its a solid rougelike that keeps you wanting to play more. The only critique I have is the final boss of each map is not that fun to play against imo. I think the creator was going for a Mythrix type fight from Risk of Rain 2 but it ends up being a very long and drawn out fight that I typically avoid unless I really want to do it. \n\nObviously you can use a curse and poison build that shortens the fight drastically. Like im taking that away, but if you are doing the fight with a normal build it does take a awhile.\n\nLike some other critiques I do think making the XP tome a requirement for any run is kinda redundant. By all means the gold tome in theory would be as good as the XP tome because you can get more chest for items but its just not especially if you are going into late game you need cp way more than gold.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "God am I awful at it but god is it fun. Absolute triumph of a game in every aspect. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very addictive gameplay, I just wish there were more maps. Looking forward to an update or DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my favorite game to play when I have a little time to kill. I can also sink hours into this game trying to get that perfect run.\n\nI would highly recommend this game to anyone that is a fan of roguelike/bullet hell games.\n\nAlso I got demonic essence once in a run and it changed my life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun game for short periods of time, just sit back and relax",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to just kick you shoes off, relax and.....wtf where did the goblin come from!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h3]Bonking makes me feel good.. (6/7 - IGN)[/h3]\n\nThere's not too much to say about the game, else than it's being 3D Vampire Survivors with memes inserted (that you can jump or fly?!). You bonk the enemies then some random ghosts bonk you back! \n\nThere are lots of characters / weapons / items to unlock, and 2 main stages (with 3 difficulty levels) currently in the game. \n\nI wish dev was updating it more often (like seasonal events etc.), but current game state is fun enough to spend hours in. So, yeah you can totally give it a go if you are into that kind of games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Megabonk Review! 🎀[/h1]\r\n\r\nOh my goodness, Megabonk is sooooo much fun! 🥳 I can't stop playing it! Seriously, the game loop is super addicting, and before you know it, hours just melt away like cookies on a hot day! 🍪 What I really love is how many enemies there are on screen – it gets absolutely chaotic and exhilarating! It reminds me a lot of playing Call of Duty Zombies with the chaotic amounts of hordes of enemies 🧟 The developer took a mix of Risk of Rain 2 and Vampire Survivors, (which are both super cool games!) and mashed them together into this fun and exciting roguelite~ You'll be dodging and weaving and just having a blast right from the start! ✨\r\n\r\nThere's also just so much to do! You wouldn't believe all the progression with unlockables and challenges. New characters, awesome weapons, and tons of other secrets to discover! It keeps things fresh and exciting, and I always feel like there's something new to chase after. I'm so excited to see what the developers add in the future because this game has so much potential! I'm already so close to unlocking every achievement and I just wanna keep playing and playing! 💖\r\n\r\nIt's a really good time and definitely worth checking out if you enjoy roguelite games that keep you coming back for more. You won't regret it! 😊\r\n\r\n[b]Here's my happy little rating scale for you! 🌈\r\nOverall, I'd give Megabonk a solid 7/10 Stars!~ 🌠👍\r\n⭐⭐⭐⭐⭐⭐⭐✩✩✩ (Good/Fun)[/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, straight up. A very game video game. No fat, all meat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing for a good amount of hours and one thing I have noticed is there is no story telling at all? I feel like I have made decent progress into the game but I still don’t know anything besides that something went wrong at the lab and now aliens are everywhere lol. I haven’t met a single NPC that had a meaningful piece of dialogue. Like what? I have noticed the weird guy with the briefcase. I wonder what’s up with that.\r\n\r\nAnyways, this isn’t a critique if the game I actually really enjoy the gameplay so far. I can see how this game was ahead of it’s time for sure. Please no spoilers!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game 4 times. 1 for me, and the other for the broke homies. I was just bored that the voice chat in the server was getting boring so I just got them all hooked on Megabonk.\n\n\nAbsolute dopamine factory of a game if I can say so myself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A steal for $10, I thought about this game way too much for like a month straight. Always take the boss shrines",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Megabonk is like doing a sick flip off a drunk blindfolded horse while juggling several bottles of coke laced orange juice, all while in a set of really sick flame printed armour. That is to say, it's utter chaos, and this particular rogue-like blend makes me want seconds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone owns it by now, its the same brain off roguelike like vampire survivors but in 3D. very fun can spend a ton of time getting lost in each run while watching vids or chillin.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's almost time for the 2025 Steam awards! I nominated this game for \"Sit Back and Relax Award:\r\nThis game is the antidote to a busy day. It's smooth, it's relaxing, it lets your worries melt away. This game is your moment of zen.\"\r\n\r\nThis game is 100% soothing and would never make me want to throw my mouse. 👀\r\n\r\nIn all seriousness, This game is pretty fun once you start to unlock tomes/weapons. \r\nThe grind is slow but well worth it and can cause a fun competition with friends. Although some of the challenges make me question the creators sanity.\r\n\r\n10/10 will continue to call Dexecutioner \"Big pp energy\" when leveled correctly 😎",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game takes a well known concept of roguelite and pushes some of its aspects to the max. Its somewhat easy to get you hands on but has a nice degree of difficulty and grind if that what you're looking for. Would love to see some multiplayer at some point.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I was hoping that this game would be like a better version of \"Mystic Survivors\" and that you would be able to get very overpowered with lots of dopamine but its mainly just me being mad at the game for the stupid mini bosses that destroy you with very little recourse and the impossible challenges. \n\nYes I'm bad at the game. I am bad at all games. Thank you.\n\nIts got a lot of memes that don't make any sense to me. Not hip enough to play this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Dani, if you disappear for another 3 years and return under another pseudonym (while leaving this project half-baked and boring like the rest of your projects), you might make something average. There isn’t a single original thought in this game, and once the recency bias fades, the resulting whiplash will leave us wondering why we gave you another chance.\n\nSorry, I meant this game is wholesome reddit chungus 100 boi.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "[b] tl;dr [/b] - generally fun game before you hit ~5hrs of playtime, unfun cock and ball torture afterwards.\n\n3D survivorslike gameplay feels genuinely fun and fresh, love the movement (yet despise the amount of displacement effects and knockback), hitting the bhops tingles my autism in a good way, but the cracks in gameplay quickly start to show:\n- Nonexistent build variety with the t3 and above builds being either playable (aka 1 or 2 combinations) or unplayable (literally everything else);\n- Weird progression (although I don't ~mind~ lack of metaprogression in a game like this, locking weapon and tome slots behind quite a handful of challenges (slightly less egregious compared to the release) is certainly a... choice. The more stuff you unlock, the more punished you are - even though you can disable the unlocks from your roster, it feels weird removing 95% of the stuff you've worked for);\n- Godawful final boss I don't think anyone likes;\n- [A matter of personal preference, but still] le painfully outdated dank memes xD in big '25.\n\nIs it good? \nIt's ~ [b] alright [/b]~ but unfortunately the novelty quickly wears off. Still puzzling to me how it got astroturfed into what is pretty much the second coming of Christ, despite being middle of the pack game of its genre.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game is the Wuchang: Fallen Feathers of its ilk.\n\nThat's not a compliment.\n\nIt tries very hard to be something it's not. In this case it's trying to be a 3D Vampire Survivors except it's completely lost the plot as to what makes Vampire Survivors fun: character and build variety.\n\nOf the characters available as of now, three are viable. Yes, three. Everyone else is trash. The weapons? Hope you are looking forward to running Aura/Dexecutioner/Blood Magic for the millionth time. As for Tomes, are you excited yet? Because you get to run XP and Cursed Tomes in perpetuity and don't you dare complain about it because then the toxic community that is in lockstep regarding these reviews, incapable of thinking for themselves (as evidence ironically by the meta builds) will be on you like stink on crap.\n\nThis game sucks. It sucks and it shouldn't. This was an easy layup of a concept that got bogged down by devs who I can only assume are either insecure narcissists that protected themselves via an echo chamber, or so incompetent and lazy that they didn't bother to do QA. Perhaps both, I'm not sure. What I am sure of is that they don't deserve your money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Absolute crap of a game. It can be addictive at first, but the more you play & getting into it - the more you realize how bad it is at almost everything. \n\nThere's literally 0 (zero) horizontal scaling like at all, if you want to get to the LB - there's only one build that works, but you'll need all the right items in like first 60 seconds or so of your run, and the run must be on a special char, that dominates the LB. Period. There's no second option, only this thing will work, whether you like it or not.\n\nDev has an attitude of a minmaxer, with all those cheesy comments like \"Yeah, I know that I was short on time to release on a schedule, so while in a hurry I made an unkillable OP boss, that I can't kill myself, but you know what? It's your problem, just git gud\" and etc.\n\nIt will be fun for like first 10-20 runs to try & figure out how random stuff works & probably kill the boss couple of times, but when you'll start to realize how 80% of items in the game are completelly useless - there will be no fun in countless 100-150 restarst in first couple of minutes of a run, cause you're not getting like anvil, crefit card, holy book or whatever.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "This game is fun until tier 3, then its just difficulty to increase play time and not for skills sake. Most runs will become purely RNG on almost all the characters except the meta characters and builds, tons of useless or detrimental items and tomes that do nothing or add no real synergy, only really there to make your rng worse. There are weapons and tomes that are actually useless, i see you mines and space noodle. This game isn't fun in the late stages, just pure RNG sim, and the Desert map is just miserable on the whole.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I enjoyed this game, and it's fun to play every once in a while. However, despite this, I cannot seem to recommend as the gameplay can feel grindy at times as unless you're trying to min-max max it's not really that fun. It feels that you're forced into that kind of gameplay as the game balance assumes you are at the level, so if you get unlucky with items, weapons, books, or upgrades, you'll just have to restart or you'll just end up getting hit with no real way to heal that health back eventually causing your death.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "While I usually enjoy bullet heaven games quite a lot, this one just isn't for me, it seems.\nMy issue is mostly with the physics that don't work for me.\nIt's simply not fun when a good chunk of lost runs are due to mobs kicking you around the map (or into corners) like their soccer ball (sometimes for several minutes straight) without a reliable way to gain back control over your character and move where you need to be.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly like this type of games. But this is one is not fun to play.\nOnce you past a couple of hours, only left is griding without any progression. Game is hard af, which may please 0.1% of players but miss the important point of what a game should be, fun to play.\nHonestly had enough of trying and constantly dying frustrated.\nUninstalled.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wish I could give this a neutral review. The game is solid in terms of weapons, characters, and difficulty scaling, but my praise more or less ends there. It is severely lacking in terms of stages and bosses. There are a grand total of two different stages with three \"tiers\" for each of them. Without a solid content update, I can't really recommend this to others.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing for a while, the RNG just keeps destroying you over and over again, as you keep hoping the next run will be better. The game needs a SEVERE anti-RNG patch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "My review will likely change with updates, but currently, the game's balance is severely off, only a handful of specific weapons and tomes are viable for the endgame, making variety nonexistent. Content is also thin, featuring only two stages and limited boss encounters, which makes runs repetitive quickly. Adding to the frustration is the snails paced movement and a noticeable lack of meaningful permanent upgrades, which together undercut both the immediate gameplay enjoyment and the long-term progression loop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Leaving a negative review until they implement a quick restart option on loss. I shouldn't have to go to menu, character selection, stage select, etc. and waste time after every death. Let me keep playing, the game is good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG games are always hit or miss. Gameplay could be fun, but boring characters are overpowered while interesting characters are overwhelmingly weak. Knockback from enemies kill any joy from the game.  Requires specific builds to be relatively good (evident by leaderboards).\r\nWill wait for balance changes to make more versatile gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Look like a demo for 15 bucks! Two levels, based luck game, absolutely not a 3D Vampire Survivor. Run away the hype.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really tried to like this game. But more You Play, more You see how bad is it. Lack of balance is horrible, literally one champion is dominating everything. Difficulty is horrible and its not soulslike fair difficulty but rather unfair not fun difficulty. Its more like player vs rng. RNG is worst. I never played a game with so bad rng.  Literally one viable build for all characters. XP, Luck, Chaos, Difficulty tomes and cheese. Cheese is being top1 most important Item in game making You reroll rounds till You find cheese jn first 5 minutes otherwise You will not kill first bosses with difficulty poles. \n\nGame is fun till the point You realise its all about dopaminę addicition and Infinite lootboxes of skills/tomes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has a lot of potential but feels like it left Early Access too soon. The movement is smooth and satisfying, and there are flashes of brilliance in some weapon and tome combos — when the stars align, you can absolutely melt through enemies and feel unstoppable. But that power swing cuts both ways: most runs depend entirely on RNG, and when the right upgrades don’t appear, you hit a wall fast.\n\nOnly a handful of tomes, weapons, and characters really stand out, while the rest feel underpowered or unfinished. The difficulty scaling between tiers is wild — too easy one moment, unfair the next — and with no meaningful meta progression, it’s hard to stay motivated after unlocking everything once.\n\nIt’s a fun, cheap experiment that mixes Vampire Survivors and Risk of Rain 2 without fully capturing what makes either shine. The soundtrack’s great, the core movement feels good, but it still plays like a work-in-progress rather than a polished release. Meme game.\n\nVerdict: Cool ideas and fun movement, but unbalanced and inconsistent. Worth watching, not quite worth recommending yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love Vampire Survivor style games, but this one burnt me out quickly. In short, this game is a very simple, but difficult 3d version of Vampire Survivors, which encourages the player to explore the map to gather various items and bonuses to beat the game. Each round is 10 minutes and on higher tiers of a map, you have to beat a level boss to enter a new round of the map with scaled up enemies and rewards and shorter round time.\n\nThe foundation of this game is great and the gameplay loop as well, but the content is very bare bones. You have a bunch of characters, cool weapons and items, but only two maps and a bunch of challenges. Most people do not even play the second map, because it is horrible to play on with overly difficult bosses and enemies. Enemies and bosses are basically towards you walking boxes of ouch, some with different ranged attack patterns, which is great, but again some of them have such unfair attacks that are not fun to learn.\n\nThe advertisement of this game is all about \"who can kill the most?\", which this game clearly builds around. Quickly explore the entire map, get all bonuses, level as much difficulty as possible and \"survive\".  And this survival is basically endless. After the timer, ghosts appear which gradually get stronger and faster, until they rush through your weapons to one-shot you. The big problem is the meta: This entire \"Who can be the best?\" quickly turns into \"Who can outrun the ghosts the longest?\" with the global leaderboard simply outrunning ghosts for up to 10 hours. And that's not everything: they need hundreds upon hundreds of attempts just for the right world objects to spawn in each map to give you the correct items to even come close to a good run. With the items, upgrades and spawns being so much rng, even attempting a good run is just a waste of time.\n\nWith the current highscore meta of using exactly the same build on the same map and outrunning ghosts for hours, while not offering a lot of content, this game is simply not worth the hype. It's neat and I liked it until I unlocked most of it, but I wouldn't recommend it over other Vampire Survivor games.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Game starts out fun and loses it's spark around when you get to area 2. You'll be doing great and then something just kills you in less than a second and it doesn't seem to matter if you spec into defense or not.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game was my addiction that quickly turned sour.  I actively hate this game now and I will not be playing it anymore unless I find mods that'll improve the pacing and enjoyment.  I've played Risk of Rain 2, which I wouldn't call an \"easy\" game by any means, but its an enjoyable game with reliable power scaling that makes sense, and promises endless waves which megabonk fails at.  I have put in countless hours into Risk of Rain 2, that's what I would call a good game that doesn't heavily implement RNG.  I don't need megabonk to be easier, I would just like my upgrades to make a difference in my chances of victory, I wish I didn't have to follow the meta in order to have a good run, and the fact that the whole game relies fully on RNG just leaves me feeling like its not a skill issue on my end, I just have to wait for perfect RNG odds to determine my run.  Megabonk feels like one of those mobile games that looks fun in the advertisements but is nothing like what it's advertise.  I don't see how the description of \"endless waves\" describes this game accurately, because your run has a timer that once it runs out, overpowered ghosts start spawning until your dead, which happens in no time.  I'm just over it and will be trying Vampire Survival instead.\r\n\r\nIs it skill issue???  Or bad game, who knows, all I know is games are supposed to be fun and I find no enjoyment here.  Good day.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have as much a Goopy Goblin Gamer Brain as anyone, but Megabonk fails to satisfy beyond its first 60 minutes of mind-numbingly alleviating boredom. \n\nAnd having played those 60 minutes, I can confidently say that I have seen all that Megabonk has to offer, and I have no desire to grind out more of its meaningless \"content\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game starts out quite entertaining, but after the first 3-4 hours and after unlocking new items/weapons/tomes things start to go downhill fast. The game has serious balance issues and you can only expect to really succeed if you follow meta builds and get extremely lucky with actually being able to get the weapons and tomes you need. The movement system is pretty meh, and mastering the bunny hops and sliding feels mandatory rather than rewarding. The more things you unlock the harder it gets as the few items you actually want get further diluted by every additional item in the loot pool.\r\n\r\nIf you want to have a good run you're essentially locked into a gameplay loop of starting a run, re-rolling constantly to fish out specific weapons and tomes (looking at you Luck/XP/Curse) and if you don't get what you need in the first 5 minutes you just have to restart the run, as otherwise you won't be able to keep up with the wild enemy scaling. The first 10 minutes of every run are painfully slow, even when you are bunny hopping and sliding everywhere. The 11-20 minute mark are when things get \"good\" as your build is generally going to start coming together, but this is where the fun essentially ends. Once you reach the final zone you will either hit a massive power spike or die immediately, and it's at this point any semblance of a game breaks down. It just becomes a chaotic mess with so many enemies and VFX taking up the screen that you basically have to navigate using just the mini-map, and all you do is just select the highest tier upgrades that appear every 5 seconds as every enemy on the map just instantly melts around you. Eventually a single enemy moving at mach 11 will pierce your safety bubble and one-shot you unless you go through the final boss portal. The final boss is straight stupid, with mechanics taken straight from RoR2 but somehow made bad.\r\n\r\nThis is one of the only games I've ever played that I actually regret spending time in. 3/10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Derivative uninspired Vampire Survivors + Risk of Rain ripoff without any of the depth or identity either game has.\n\nWhat seems competent at a surface level glance boils down to rinse and repeat runs of the same 2 maps with next to negliable variation. As well as a super wonky item balance with no real interesting synergies beyond what you'd expect of these games.\n\nI think what irks me most though is a tie between its complete unwillingness to do [i]anything[/i] new at all or its attempts at humour. Generic fantasy enemy archetypes in giant barren copy paste fields but \"so retro\" or genuinely miserably unfunny forced Reddit \"jokes\".\n\nIt's like a 40 year old suit wanted to appeal to the youth. Only they forgot it's stuff terminally online millennials found funny like 10 years ago (e.g. Scorpionussy, Shrine of Succ, Monke, Maybe Him Skill Issue?)\nThankfully there is a [strike]fix[/strike] mod to remove most of this and make it infinitely less insufferable, but it wouldn't kill the dev to just make the writing good to begin with so I don't know what that's worth.\n\nIf you have no interest in using your frontal lobe and just want dopamine, it sure is a videogame that is cheap and does that. But you could just do better with the games it apes its ideas from too that're infinitely less vapid.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pros: The 3D perspective allows a unique approach to the stages and freedom of movement, which is unusual for this type of game genre.\r\nCons: \r\n- No unique evolutions that allow you to feel more powerful. \r\n- No sensible progression that feels like you're moving towards something meaningful.\r\n- A lot of weapon types just feel unsatisfying to use.\r\n- Weird difficulty spikes between tiers, which feel like a balance issue. \r\n- A lot of characters don't exist beyond their starting weapon, and there is no reason to use them.\r\n- The geometry of the desert level feels very flat compared to the forest level. \r\n- Too much RNG on top of RNG. A lot of weapon and upgrade choices, but not many paths you can actually take. Makes you question why even expand your arsenal in the first place.\r\n- Inability to exclude certain starting weapons or upgrades from being selectable. Makes me want to erase the save and just not unlock those characters/weapons.\r\n- In the game, which is essentially about choice, interesting weapon and upgrade combinations, the final boss of each Tier 3 stage just straight up confiscates your investment. I deeply resent this design idea, and I hope it will be addressed in the future.  \r\n\r\nTl;dr: Amongst the abundance of games of the similar genre, Megabonk failed to meet my expectations with questionable design choices and lack of variety when it comes to meaningful upgrade paths.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really fun and addicting, and I would recommend it, but for the time being I'm going to rate otherwise because the final boss is just awful. It just ruins the flow and theme of the game. Kinda surprised that I fought the nerfed version, apparently it was much worse. \n\nSo, the boss gets it's own arena and quick cutscene. Pretty cool, then I see it's just a reskin of the tree boss I've already killed 50 times. Whatever, it doesn't surprise me but would've been cool to get something new. \"Surely there's a gimmick,' I thought. The boss does his usual AOE attacks with some new projectiles, but his health bar does not budge. This is because as the fight starts, he steals your 2nd, 3rd and 4th weapons. So I felt completely blue-balled, because instead of a cool gimmick, or some new moves, I get to run around the boss for 20min with my starting weapon which is underpowered because I picked up better weapons during my run and put all my points into those. The structure of the fight has you deal enough damage until he summons totems which heal him, the size of the totems are barely bigger than his AOEs, and he spams his new projectiles at the same time so it's impossible to charge them all before he gets all his health back. After this, you get 1 weapon back. Before you think, \"Oh, you get them back, what's the issue?\" I will say, It doesn't matter that you get your weapons back, because if your build is reliant on your 4th weapon, you have to fight the boss 3 times with shite DPS before you can properly fight the boss. Strategizing for this fight then requires you to build your character like they have 1 weapon, dumping all your upgrades into it and picking only tomes to support it and nothing else. It really ruins the care-free \"grab something random and run with it\" nature of the game up to that point (being a rogue-lite and all). This boss feels like an attempt to pan a fight that didn't have enough substance to warrant an \"epic final fight,\" but I would've preferred that to this slog. It's actually dreadful, the worst way to end a otherwise satisfying run in a fun game.\n\nTL;DR: Game is great, final boss(es) are ass, I will change my review when it's no longer ass.\n\nEDIT 1: I also agree with the sentiment that other reviews have about how aggressive the difficulty ramp is. Every tier 3 run goes the same, I try a non-meta character but make a strong build, fly through stage 1 and half of stage 2 then get insta-killed by a regular elite, and if I invest in armor/HP my DPS isn't optimal for the hordes and I get swarmed. It's a shame this game is so fun but it's made the same mistakes I've seen in other rogue-lites. The difficulty challenges are there for a reason, dude, don't make the easiest difficult impossible unless you play like a meta-slave or get godlike RNG.\n\nEDIT 2: Didn't catch this during the first fight, but the final boss has an attack that stops you from healing for like 10 seconds, and if you happen to opt into bloodsteal (one of 2 ways to reliably heal) the boss's invulnerable state makes it so you cant hit him to get health back after the projectile wears off. I did everything I was supposed to, built my build perfectly, got lucky drops, aced all 3 stages and still got fucked by the final boss because hes just a build negator. I seriously cant stress how unfun the final boss is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I mean, it was quite fun the first few hours until I realised the difficulty scaling v the NPCs was just ridiculous. - for someone who likes a challenge, it just become frustrating and tedious when I was doing the same thing over and over and over..even after trying to 'git gud' the RNG in this game is skewed purposely by design against the player.\n\nThen I managed to get mods for it, but then so did alot gamers and idk what happened but someone or someones managed to brick the leader board and got it shut down for a weekend I think. \n\nPeople were running into 7 figures of kills. - which was just straight up not possible on genuine runs and I felt kinda bad for the dev and all the genuine players, but it is what it is. \n\nModding the difficulty to scale it down just a tad made the game alot more enjoyable to play, Idc about the most kills or being top of  some intangible leaderbaord or care about being validated or sooth whatever mental health issues players have nowadays.\n\nBut the game does eventually fall into the same trap of repetitiveness and tedium while offering nothing new like most games released to day. - this includes indies and triple A titles.. Innovation in the gaming industry is a mythical land nobody visits anymore. - it's just been replaced by copy paste game mechanics/concepts/gameplay. All thrown into a RNG and spat out and passed off as a new 'game' - replayability wise, there is none. - \n\nBullet hell hell games are literally the one and the same. - played one, played them all\n\nPlenty of weapons, characters and there's plenty of content. \n\nThere's many hours of fun to be had. \n\nBut it's just simply not engaging enough for me to carry on playing.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's not a BAD game, but it is -- IMO -- one of the weaker Vampire Survivor likes out there. Initially it seems great: the graphics are colourful and have a lot of personality, the game has plenty of humour, it feels nice. But the more I played, the more frustrated I grew with the insane amounts of RNG (and the limited ways you have of trying to tilt it in your favour). And I'm not talking about ultra end game high level play, you'll start to feel the frustration way before then, because so many weapons in the game require very specific combinations of passives and upgrades to be even functional, and your chances of getting those specific combinations are not very high. Add in some questionable scaling, and the game just gets too frustrating.\r\n\r\nI played it for 19 hours, so it's not TERRIBLE, and you can definitely get your money's worth from it. But if I had to pick, I'd take Deep Rock Galactic: Survivor, Brotato, Soulstone Survivors, Halls of Torment and a bunch of others way before Megabonk.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love this game, but, I'm leaving a negative review in hopes Vedi sees this. The scaling in the game is whack, brother. It is quite literally impossible to get to later stages of the game if you don't constantly crank only damage, XP, and luck/crit. Going into a run without any of the tomes for each is like running into a war with a water pistol. This game is a lot like Vampire Survivors, a game that absolutely flourishes with countless different builds that you can cause utter havoc with, but in this game, it feels like it's meta, or nothing. A balance adjustment to the way the enemies scale would make this game a lot more enjoyable.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It definitely has enjoyable aspects to it, but I can't bring myself to recommend it.\n\nIt plays very much like Risk of Rain but with... less. Less items, less customizability, less maps, less run lifetime, less polish...\n\nMany enjoyable elements have completely frustrating mechanics thrown into them, not for any particular challenge it seems, but purely just cus. A good example being the tornados on the desert map. They aren't really a hazard, not really a boon, they are not really doing anything but stalling gameplay completely.\n\nScaling makes zero sense either, you can run around the map completely obliterating everything, minions and bosses alike, without taking a scratch at crazy armor/evade/lifesteal and then just get blown away by 1 random attack from no where. Mobs from start to finish either can't touch you, or bum rush you faster then any amount of run upgrade can mitigate just to 1 shot you.\n\nBuilds don't have any satisfaction to them either. You build one thing and that's that for each character. RNG doesn't offer experimentation it just screws you out of a viable endgame by throwing 50 of the wrong upgrades at you in a row, usually projectile speed (who has EVER wanted that upgrade path btw in a roguelike...). The top 1000+ players on the leaderboard are all the exact same character because there was no balance thought out to any of the mechanics. There is never a reason to not take attack speed tomes for example.\n\nThere is no imagination to this game. It feels like everything put on the drawing board came from AI and then the creator just slapped \"bonk\" on the end of everything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Megabonk is a breakout success that does a lot of things right, but has a few areas that lack severely. Let’s start with the good. This game has so much potential for long term life. It’s incredible such a small gem of a game was created by one person. The variety of characters, items, and tomes is insane. Unlocks are fun to achieve during the runs, even though RNG can sometimes be annoying when it comes to needing certain items. The greatness that the game makes you feel really starts to flicker after a few hours; let me explain why.\r\n\r\nI have one main issue that really drags down my love and addiction to the game. Difficulty balancing. The difficulty spike from stage 1 to stage 2 is quite huge, but manageable with a high damage build. However unless you're lucky, you are very rarely going to be overpowered in stage 2. Normal enemies aren’t too bad, it’s when you fight elites and bosses. Their health and the damage they deal is increased by a lot and they turn into bullet sponges. Your build rarely affects this big change. It’s when you get to stage 3 however, where I feel the game takes a big nose dive. The difficulty of everything is stage 2, is dialed up to 10. Any more upgrades you get, or items, barely impact your stats at this point as enemies are just too strong to be affected by you. \r\n\r\nBut nothing comes close to the absolute, unbalanced nightmare that the final boss is. No pickups, over 7 million health, heat seeking attacks that are extremely hard to dodge, and the ability to heal. This is by far, probably one of the worst bosses I’ve ever fought in any game. Unless you have the RNG gods on your side and you complete a meta run perfectly with absolutely no flaws at all, you just might have a chance. I’ve gotten to this boss several times doing meta builds and I can never do enough damage to even feel like I’m hurting it. The health pool is just too much, and it doesn’t help that the boss can 1-2 shot you instantly. Constantly dying here at this wall is just ruining the fun and love I have for the game. There seriously needs to be a nerf of some kind to make stage 3 a lot more doable. You could just cut the final boss health in half and that’ll be a step in a positive direction. Otherwise, can we get progression upgrades in the shop similar to other rogue games? Some nice permanent boosts from the beginning could really be game changing and make things feel much better. \r\n\r\nAt this time I really can’t make this review positive, but will happily make it so if something changes. Runs are just starting to feel pointless to me, as no matter what I build, even meta builds, the final boss is just so unfair with how it’s stats are set up. I hope for a change to make things feel more fair and fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i tried enjoying this game, but in it's current state i feel it still needs polish, specifically in balancing, and fixing some glitches like enemy projectiles going through objects and walls randomly, during one of the last boss fights, i ended up glitching through the geometry and getting completely stuck, there are items that are very tedious to try to obtain, specifically Cactus for me, spent hours trying to get it and couldn't due to RNG.\n\nThat's the other thing about this game, it is the most luck based Rogue Like game i've ever played, i feel like this kind of forces you to go for the strongest possible items, tomes and characters, game can be a lot better honestly but in the current state i have to give it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An \"okay\" game that would be acceptable as an early access game in it's current state.\n\nThe steam trailer has things that are missing from the game, including enemy types (as far as i'm aware anyway) and  even levels.\n\nThere's too many things about the gameplay loop that make the game frustrating. There's a lot of things that don't really make any sense from a gameplay experience such as the silver system for unlocking stuff, spending gold mid run to do things like banish items or refresh item rolls. You can't spend rerolls on chests, only on level ups. Banishing items in the level up doesn't reroll the item that level. There's a lot of Quality of Life this game needs in order to feel better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The final boss is insanely frustrating. It alone is why I'm giving this game a thumbs down. He takes all but your main weapon, making the others feel completely wasted if you level them up. He becomes immune to damage until you charge three pillars that are such enormous pains in the ass as you'll get absolutely obliterated by like 7 homing missiles which blast you out of the charge zone. And he recharges his health while you're getting whipped around the map. Tone this boss down; it's completely outlandish compared to the rest of the run.\n\nThe combination of unlocking and buying upgrades feels like it was designed to make you waste your time. Stats aren't explained very well, and it's impossible to see your character stats and what certain status effects do.\n\nMaybe after some balance and QoL improvements this game will be fun, but right now it's just frustration. It's a shame because the movement system is actually insanely fun to master.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Right now, I don't recommend the game. It has serious balance and RNG issues that need to be worked out. First starting out it is fun but the more time you put in the less fun you will have and the more anger that will build. Shouldn't take 50 retries to get a decent build going. Until this is fixed, do not buy.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I really want to recommend this, but it's really important for a game like this to avoid sudden, unavoidable deaths even for the more squishy characters. This game just doesn't do that. I can't count the amount of times I've had a near-perfect build that felt like I was doing great just to die in 1-3 hits trashing the whole run.\n\nIt took me a while to pin down why I found this game so much more frustrating than other survivor-likes, and I think that's kind of the crux of it. Pretty much all enemies do too much damage which becomes even more problematic as things scale. I could only imagine how frustrating vampire survivors would be if brushing up against an enemy immediately ate 1/3-2/3 of your health. Maybe I'm just remembering VS as being more forgiving than it is, but that sort of situation seems excessive even on base health/armor values for most of the characters.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Most boring vampirelike ever, tons of grind for not-so-good unlocks without much variability. Half of the stats, weapons, and tomes are just bad, why even bother trying some different things and builds when you have a few exact good builds that are gonna win you the run? All runs are played by the meta xp grind and just feel the same, whatsoever. Shitty leaderboard simulator for streamers.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is great, but so much bugs developer promises to fix and but doesn't keep his promises seriously",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its Alright?\r\n\r\nI'm not seeing the hype beyond the funny vibes and OST. I don't feel any better at the game after almost 10 hours of playing. Most runs feel like a 3 minute crapshoot on \"am I gonna get anything good or is this run going nowhere\" even with toggle helping out.\r\n\r\nThere's no way to actually increase any base stats either, and alot of lvl-ups don't feel impactful until you have 20 of just one because of how math works out. Let alone the power-spike enemies have between stages, oneshotting stage 1's boss tends to lead to stage 2 doing the same to you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Games fun but fairly barebones, and there’s ~3 builds that are so much better than the others they’re basically required for the later stages. Not very well balanced.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every stage turns into a DPS check, and with how unbalanced it is, you end up using the same builds over and over just to keep up - assuming the RNG even lets you get what you need, since your ways of mitigating it are extremely limited.\n\nIt’s all the more disappointing because, at its core, it’s not a bad game. There’s a lot of heart in it, and it can pull you in, but I just can’t see myself playing it long-term given how unbalanced and RNG-dependent it is.\n\nI kept coming back, hoping it would finally click and I’d understand why it’s so popular, but it never did.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The faults of the game come out the more you play. \n\nThe final boss is god awful and unfun. it needs to be completely redone. it's a copy and paste from Risk of Rain 2's old final boss and garbage.\n\nThe movement is terrible. So many times you feel no agency. Characters are too floaty. \n\nMobs are either unnoticable or will launch you across the map, even with that green shield powerup.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's pretty addictive and has great art style, but shallowness of gameplay leaves a really bad aftertaste.\r\nThere's basically only 3 enemy types, which you automatically kill by running around. That's the entire game loop.\r\nThis foundation is so bad, that all the tiny features they introduce to the game mesh badly with one another, turn out to be fundamentally meaningless, and simply fall flat.\r\n\r\nThis is really no better than Newgrounds flash games. So lower your expectations before buying",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is addicting but trash. you have to use the same exact builds that everyone and their mother uses to get on the leaderboard, otherwise you cant do anything. theres probably 1,000s of combinations for items and weapons etc but none of them matter except a handful. If you pick ANYTHING other than the meta build stuff you have no chance of being succesful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is a meme. This is a good thing. This is a bad thing. Up to you to decide which one it's more of, but for me, it leans a bit more to the latter.\n\nThe game is cheap. This is a good thing. It's hard to feel like I wasted my money, only my time. But this game is mostly something I play and try not to get invested much in while listening to Youtube videos...before I get tired of another BS failed run and go play Vampire Survivors instead.\n\nThe game feels good to move around in. This is a great thing.\n\nThe game is half-baked. This is a bad thing. Especially when it's been pushed as 1.0 when it's basically Early Access-tier, content-wise. Right now it doesn't actually nail the appeal that either Vampire Survivors or Risk of Rain 2 have, which are its most blatant inspirations. Not mixing them well enough that it feels like it benefits from having aspects of both. Movement feeling good pretty much relies on extra jumps and getting used to bunnyhopping + sliding, but it's random chance if you get extra jump upgrades at all, since there's no item that gives extra jumps at the moment (and personally I'd just put in being able to buy one or two from the ability upgrades with Silver). Upgrades can vary strongly and some weapons rely on one specific stat to be really good. Too bad if you don't get that one. Rerolling, Skipping, and Banishing costs Gold (which gets in the way of you upgrading) and the latter two waste a level, which are handed out like candy in VS and barely matter because items are FAR more important in RoR2. Here it can be crippling since level speed falls off fast without an XP tome.\n\nThe game currently feels best \"early game\" with Desert feeling far less fun, especially the boss.\n\nDo I recommend it? I would say no. It is a meme. ATM, I think the dev doesn't take the game seriously enough to properly improve on it because it's a meme [i]to him too.[/i] The REASON I'm saying no, is that there's plenty of games going for around the same price or 5-10 bucks more that are more enjoyable, feel more fleshed out and developed, or seriously undertaken. It's not great that ATM, the best part of this game (and the only one that doesn't have issues IMO) is its soundtrack.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is a blast, just wish the devs did more for it. Gets boring very fast. If updates were consistent it would be a good review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Far more frustration than fun.  When you manage to get a good run going it can be lots of fun, but for every good run I often find myself slogging through 15-20 terrible runs to get a good one.  There's just a bit too much random outcome and not nearly enough bad luck protection to offset it, particularly with tomes and weapons.  Given that items are presently the most powerful things in terms of determining what a given run's potential is, their current level of control feels appropriate.  But once you have toggling unlocked, the fact that you can't toggle off any of the default weapons or tomes becomes incredibly infuriating.  The number of runs where I'm out of all of the refreshes before even getting my desired tomes or weapons for a run because weapons and tomes I have no intention of taking continuously come up just saps all of the fun out of the game.  I've spent too many nights trying to enjoy the game only to waste the entire evening never getting a run with whatever build I'm trying to put together with any meaningful amount of time left to defeat the zone boss.  Additionally the number of times where I select to refresh on a level up only to receive 2 of the same 3 offerings again is incredibly infuriating.  I feel like this game could be so much more fun with just a little more fine control over weapon & tome availability along with preventing an option that was offered from being offered on the next offering when a refresh is selected.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to like this game, but as I've reached a decent amount of playtime, I've become increasingly irritated by aspects of the game. My issues:\r\n- It's frustrating that there are a decent number of enemies that move faster than half of the playable characters\r\n- It feels mandatory to take some combination of XP/Chaos/Luck/Difficulty tomes or you're gimping your run's ability to scale hard enough to finish a full tier 3 run\r\n- The tier 3 final bosses are some of the most miserable experiences I've had in gaming. It's very frustrating to build up a run only to have the final boss take 3/4 of your weapons at the start. Not to mention the various mechanics like the homing laser or orbs, and the need to capture shrines to make the boss vulnerable to damage again during the fight (meaning if your healing is based on lifesteal, it's worthless for large chunks of the final fight too).\r\n- No ability to save a run and quit the game. This is just disrespectful of my time. Especially when runs that go infinite can take literal hours to complete in comparison to a barebones run.\r\n\r\nGoing to table the game for now and wait for the next update to see if there are any improvements, or just more content added.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the most mid game that's released in years bolstered entirely by impoverished manchildren who find edginess a quality trait in a video game. the game is a generic survivors-like that does nothing new, unique, or interesting that others haven't already done. it's an amalgamation of various games in the genre. the only reason it has such high reviews:\n\n1) content creators & their sycophants\n2) video game addiction/consumerism\n3) manchild syndrome",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game feels like it combined Vampire Survivors and Risk of Rain 2. Both games are absolutely fantastic and the combination of both seems like a great idea.\r\nRoguelite with choosable weapons (vampire), different choices and certain upgrade paths that are locked after choosing them during the run (vampire) and random items on top with interactables (risk of rain).\r\n\r\nBut the most important thing from these games is that you always felt a certain power fantasy and this game just hates the idea of that.\r\nYou go full damage, and yet it takes several minutes to clear the boss on midgame runs or so. So you go full tanky and your damage just is absolutely a** and the tankiness is just an illusion because you will still die within 2, 3 seconds.\r\n\r\nThe game is early Access still. So maybe it will get patched and it will feel more like the other roguelites especially in the category it tries to be. Right now it has some vibes but the satisfaction is not there.\r\n\r\nExamples:\r\nFull damage build with 1 or 2 random tankiness items I got with rng. The second boss has 1.5 mill HP. my dmg in the whole run after dying to the endless swarm that comes after the time runs out and not having defeated the boss was just scratching 1 million at that point. Those were 20 mins in a single run and the boss was about 200k dmg of that alone. \r\n\r\nIt feels more like a chore than a relaxing and a game for \"zoomers that have adhd\" as most people seem to call it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am not quite sure I am playing the same game everyone else is?\r\nThe game I am playing has poor progression, ridiculous scaling, and no way (that I can see) of leveling up a meta character. I feel no progress or satisfaction playing a run. Their is nothing being gained. Every worth unlocking is three unlocks deep with most of the starting progression tied to random events that only happen once in a blue moon?\r\nWhat game are you playing?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Late game scaling is completely busted. That's kinda the point of these games...needs a balancing update or something. Running the same viable builds is pretty boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Severely lacks balancing. I hope to enjoy it someday as much as I do Vampire Survivors and Death Must Die, but I don't have any fun in this game as it is.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is carried hard by movement systems and simply being the first notable 3D game in its subgenre. Everything else has more interesting systems, the item balance is bad, level variety is poor. It pulls ideas from RoR2 and Vamp Survivors together but doesn't execute them well.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "pretty unbalanced, ghosts knock you in every direction, bosses have too much hp, you need crazy luck for good runs. There is a reason why the leaderboard is full of the same class ...\n\npretty fun for the first 5 minutes of each run but thats it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is absolutely for a certain type of person, however this is definitely not the game for me. Runs do have aspects of skill to them, but getting a successful run wayyyyyy too often feels like just totally rng of \"can you get good enough items in order to succeed, and if not then you're fucked lol\". If you don't get good enough items by the end of the first round sometimes it just feels like you might as well start over, which is an annoying thing to have to do. The game is fun, but the overwhelming amount of rng required to get a good run with very minimal options to mitigate it outside of using mods is way too frustrating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No updates and game is going to be dead. Dev just got rich and dont care about the game anymore. Leaderboard is full of abusers and cheaters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bazı item ve silahlar cidden useless spesifik 2 3 tane build ile tier 3'de rekor falan kırabiliyorsunuz onun haricinde oynarken öleceğinizi bilerek oynuyorsunuz çünkü tier 2 boss'da baya zorlanıyorsunuz. Bazı statlar oyunu cidden zevkli şekilde bozuyor ama diğer statlar da bir o kadar işe yaramıyor etkisini hissetmiyorsunuz. \r\nVampire Survivors formülü var evet ama Vampire Survivors oynarken neredeyse her silahla bazı bileşenleri yaptığınızda o mapi tamamlayabiliyorsunz. Scale mantığı çok kırık oyunda buna denge lazım 1 kişinin yaptığı bir oyun evet dengelemek çok zor ama oyuncu kitlesi 2 3 tane build'e bağlı kalmamalı ki çeşitlilik adı altında işe yaramaz itemlar dengelenmeli ya da tier scale mantığı çözülmeli.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is clearly a meme version of Vampire Survivors (complete with its awful reddit-like humor, used mostly from kids and teen-edgelords wannabe), that could have potential.\n\nBUT: a lot of things have to be seriously reconsidered and reviewed, from the RNG to the mechanics; let's see what is wrong with this game, just to make some example and how can be improved:\n\n1- The RNG system is a complete mess, not even TBoI and EtG were so harsh in this field, even vampire survivors did better than this; the RNG system doesn't incentivate you to try a build or experiment weapons and tomes, you just have to pray to get the meta items needed to progress, and this brings me to point number 2;\n\n2- Weapons and tomes: the weapons is something that i can't understand, they feel completely inconsistent run by run, trying new ones that apparently should give you an edge against enemies and bosses, reveal to be useless.\nWeapons like the revolver, the wireless knife (to name two) need some serious balancement; the tomes revolve only around three specific...aka luck, XP and curse.\nThis not only limits the choices for builds, but also become MANDATORY if you want to arrive at the boss; if you want to balance and improve things:\n\nA- Make life, damage, agility, magnet, armor, XP and luck as permanent powerups that can be bought to the shop ingame with silver coins;\nB- Buff armor, shield, spikes, life steal to an acceptable level;\nC- The curse book should give also higher luck for drops and items, since more the difficulty better the drops should be, but again: RNG is obnoxious in this state.\n\n3- Tier 3 bosses are a complete pain in the ass (i'm already watching you idiots that will write \"sk1ll 1ssu3 lololololol\" because you are living skill issues at life); why the hell i should make parkour while i have a big ass boss attacking me with absurd OHKO attacks and even shut down recharge temples?\nWell: make sure that the temples heal less for the boss and give it a tad bit of speed to deactivate them;\n\n4- Enemies and Bosses spawn logic: seriously, this is something awkward. Some enemies and even bosses spawn directly inside you and other times they spawn stucked inside a wall or a piece of the ambientation requiring to have a piercing weapon to attack them; give at least a decent amount of space from the player so you can reason a moment better, at the actual state is a complete clusterfuck.\n\nFor now i can't recomend this game in the state it is, but i will retry it until there are some balancements and improvements...and not catering things in favor of streamers and YTbers because they whine and bitch.\n\nFor now: this gets an F, i will change my valutation only when i will see some improvements.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Megabonk asks the question \"What if you combined Risk of Rain 2 and Vampire Survivors, but removed the parts that made each of those games fun?\"\n\nI've been around the block with Survivors-likes, and I can safely say I have no idea why Megabonk of all games is getting so much attention and praise. For starters, it's missing the BIGGEST part that makes Survivors-likes so unbelievably addicting to engage with: The build variety. In Vampire Survivors, you are constantly trying to carve out your build so that it's as good as it can possibly be in the late game. Going for weapon evolutions, waiting to pick up items on the map so you can hold more than the maximum amount, shit like that. It makes every single run super engaging, since you're constantly planning for what you'll do next moment to moment. Megabonk completely lacks this mechanic, or in fact anything even remotely similar to it. You start with only 2 weapon and tome slots, and you can only get up to 4 of each, leaving you with basically no room to build out anything other than the absolute bare essentials. And I do mean \"essentials\", since trying to beat the game with anything other than the most obviously powerful build options will leave you completely screwed in the end due to the game's astronomical scaling. Take an Armor tome because you're out of rerolls? Unlucky. That's a completely dead tome slot, and now you can't scale your damage AT ALL because you didn't take the Damage tome. This makes the runs mind numbing and repetitive, since it's just farming for the same things over and over, and once you have your designated Good Items, you've officially made 99% of the decisions you'll make for the entire run. It's just boring compared to what I've seen elsewhere.\n\nWhat about the Risk of Rain 2 elements? Those, I gotta admit, are pretty inspired. The teleporter summoning a stage boss is a neat idea, and the progression through the areas is reasonably fun. It gives you something to actually think about while you're doing a run, which is something the game desperately needed. As for the chests and the items, hooooly hell it's so unsatisfying I can't put it into words. The decision to make the chest price scale exponentially with each one you buy completely kneecaps the sensation of snowballing items that makes Risk of Rain so fun. Instead, it turns into a simulator of playing a gacha game without paying money: Spending days saving up your precious shekels until you have enough to spin the big flashy lottery machine and hope it doesn't give you a 1* oatmeal again. Utterly miserable.\n\nThe enemy design is fine, the level design is ok, and I give the game credit for being a 3D Survivors-like, something that I haven't seen before. Other than that, this game is completely redundant. It offers nothing that other games on the market can't, and I just don't understand why people have been losing their minds about it. If you want a game that's like this but better, check out Yet Another Zombie Survivors, Picayune Dreams, or even just the OG Vampire Survivors. Again, there's nothing that this game offers that those games can't deliver on in spades.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too much time for not enough payoff.  I'd rather plan Vampire Survivors or Halls of Torment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RNG... That's the whole game. Every run is solely based on RNG, the tomes you get, the weapons, and the items. It makes the game unique, sure. It also makes the game super annoying. The game was super fun when I first started, but as I put more hours and runs in, I found out how random it actually is, and it's starting to drain me. Some runs, I get good RNG, but then it's not enough to go far in stages. In other runs, I get terrible RNG and have to restart. I've watched YouTube videos on strategies to use to get better runs, but for the life of me, I can't mimic them. Also, not to mention the item/weapon/tome unlocks are super annoying. Half of the \"Builds\" I see I can't copy because I haven't unlocked the item, and I have spent hours trying to unlock them, but fail every run. I don't rate it negatively because of the fact that I can't proceed. Sure, it is annoying, but it's just a virtual slot machine, as someone said. I probably won't stop playing until I unlock everything because that's the determination at this point, but the whole RNG is slowly driving me away. \r\n\r\nBefore you purchase this game, you should understand a couple of things: The game is pure RNG, every decision matters hella, it starts super super slow and then gets really overwhelming in minutes, and YouTube barely helps. Goodluck ;)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Scaling is atrocious. It's fun for a while, but becomes a chore after a while. Buy it when it's on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun at first and then once when you start to progress, a normal session last anywhere between 10 to 15 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no updates, bad quest desing (fuck tony mczooom)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty fun, but if you dont plan on using the bunnyhop exploit, you wont get far.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not worth to buy it. They need to add lots content, New map, Multiplayer. Since theres no update for new content. So dont buy it yet till they update it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game just didn't live up to the hype for me, I just can't seem to get into it. There is only two levels and they are incredibly boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im sorry but megabonk is most certainly NOT the definitive vampire survivors game, the format in 3d did not work well and the only reason this game is popular is because of the dani controversy\n\n\nspend your money elsewhere",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game but would be even better if it didnt crash CONSTANTLY no matter what I update, changing graphic settings, v sync, nothing has changed it. please fix the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maybe him skill issue? (I don't think it's fun as the game loves to swarm you with enemies that get progressively more health to a point where bosses are difficult to kill unless you know the speed tech early game.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun for the first 3 hours or so but after that it becomes a bit of a slog. The lack of meta stat progression makes me feel like I've hit a wall once you get to tier 2. Weirdly, my first few runs were the best and after that I've struggled to reach the same heights again no matter how many weapons or characters I unlock.\n\nIf it had some meta progression it'd probably be one of my favorite games ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fairly addictive, but there's not a lot of substance there. It's good for a quick dopamine hit, but terribly balanced and with cringey, edgy humor. There's only 2 stages, 1 is fun to play, the other is a test in how patient you can remain when RNG rakes you over the coals. The final bosses are also infuriating. You will melt every boss and swarm up until then, only to have your defenses eviscerated in seconds and have it come down to if you can platform with the terrible physics and controls. More often than not you will just get ragdolled out of the shrine charge zones preventing a victory.\r\n\r\nIf you play, do yourself a favor and heavily mod the game to help you avoid the bullshit the game throws at you and claims is \"challenge\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is addicting! And sometimes even fun. But mostly infuriatingly unfair. If you want to win the highest difficulty (just win, not even come anywhere close to the leaderboards) you need insane amounts of luck.\nMegabonk makes me rage like few other games can and I f***ing HATE it! But.. just one more attempt..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs more than 2 biomes, needs ways for the character to feel like they are doing something after like minute 5.  Idk, just a really weird thing where the run is decided so early and without items combining there's nothing to get excited about.  It's fun, but not engaging.\r\n\r\nIf you really like Vampire survivors maybe this will scratch the itch. But without some significant updates I think it will be well below VS in the tier list.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for a while, starting for fun and later getting into high level runs. When the WR was 8-9 hours of gameplay, it was cool, but now, with the new meta, it's become ridiculous. The developer doesn't seem to care about fixing the issues. It's an absurd that we have to endure 40ish hours on a single run (with 38h of those being basically AFK) for a chance at the world record while still having to restart multiple times just to get good RNG. The meta is getting worse and unreasonable. \r\nPlease fix your game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's addictive for sure and there are some good parts when you start playing, but overall this game's just an unbalanced mess. I'm pretty sure the dev don't have a clue about WTF they are doing with this and struck gold by accident.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute waste of time, dev designs rage bait tactics as \"game design\" while just blatantly ripping off better games. Play vampire survivors.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lack of diversity killed megabonk. it's just the same world boss with more hp, and the only way the devs make it harder is by removing your items before you fight the final boss. this seems incredibly lazy. it was fun the first few hours before i had beaten forest and desert though. beyond that is extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried really hard to get into it. Just feels like a clunkier and worse VS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Progression is WAY too slow for something that names everything inside itself after memes. Anything else will do",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balancing sucks, mad that I can't beat the final boss even on god tier runs. The enemy scaling is crazy. I've wasted so much time on this game. Outside of the difficulty, this game is a shit post. Go play Risk of Rain 2, or Vampire Survivors instead of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fine. However the bosses ruin the flow, a mode to remove them and just focus on surviving until the portal opens would be better. Also more maps but that's a future issue not a current one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good for a time and has that vampire survivors charm. Unlike vampire survivors, an overwhelming majority of the items, weapons, and modifiers are borderline useless. This leads to frustration when every run has to be restarted every 4 minutes because none of your level up choices included a worthwhile weapon. I feel like this could be fixed with a balance pass, but I can't recommend the game before it receives a little more polish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has horrible bosses, a balance that ruins most characters, fake difficulty spikes, stupid and unfair scaling, and it takes Risk of Rain and Vampire Survivors and somehow makes it not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked the game, it's cool to see that it's so creative and that characters scale with different things until...\nluck + curse + crit chance EVERY SINGLE RUN, do you scale with movement speed? luck + curse + crit. Do you have auras and scale with size? luck + curse + crit, do you want to make a duration build with bananas that keep rotating on your body? let me suggest luck + curse + crit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun (love the grinding aspect), but won't recommend atm since the movement is so slow atm and punishes most characters with no speed dependency",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like it, but needs weapon merges i'd say, way too rng every start of game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can never get \"lucky\" with items. 40 hours of runs just to get dusted over and over. Go on youtube and some of these guys with these crazy runs and outstanding luck are a little fishy. Overall fun game but the chances of getting certain items is dog water. There should NOT be fall damage in a game like this. Oh dont forget the bosses know your every move , sending aoe attacks on you before you know where you gonna land. I like this game but some of this stuff is a little crazy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I mean I guess it’s okay, I don’t understand the love for the game but it’s not necessarily a bad game now. The gameplay feels mindless though and lacks strategy, it should be harder and more challenging. Not increasing the Hp but adding more layers of strategy and complexity. Eitherway it’s a pretty decent game it just lacks depth in its gameplay \n\nIf you don’t care about strategy and just want some dopamine rush just play this but personally it’s not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its mostly good wish there was a 50/50 option. 3d vampire survivors. But it has some WONK. frequently trapped between walls and enemies for instant death. Final boss blows. 3 rounds of shield you have to stand still for and the homing attacks are glitchy as hell. they get stuck on the bubble and become completely unpredictable. Usually amassing at close range until the bubble drops and they all hit you at once INSTANT DEATH. Only thing that would make it more annoying is if the boss full heals at 1% health\nEdit: he does heal! Fuck this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not enough revolutionary for me to spend time for another vampire like game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Megabonk is fun on the surface but its so close to a vampire survirors reskin at its core that it feels like a regurgitation -- and its not mechanically deep enough to justify the price when compared to the original titles that inspired it.\r\n\r\nits animation, sound and visuals sit really close to where vampire survivors was and its in the same genera. The chest graphics, sound and mechanics are a great example of this. \r\n\r\nAdditionally, where it adds a third dimension of traversal to vampire survivors, it lacks depth to add enemies attacking you in interesting ways with that added dimension. Some enemies have this (like the desert bandit miniboss or the scorpussy desert boss) but when compared to similar 3d titles like risk of rain 2 the pathfinding is too simple to create complex emergent gameplay within the swarms of enemies. \r\n\r\nI just wish it was goofier. The padding out of progression feels cheap when there are not mechanics new to this game within a pretty small genera.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's very nice, except for the final boss mechanics, which are jarring and take away all the fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s obvious that every thought, every decision, every line of code was made with one main goal in mind: to make the game as unfun as possible for the player.\n\nThe “meta” might be the worst meta ever seen in a video game (EXP/LUCK/CURSED Tomes). The developer is aware of the issue but stated on Reddit that he will never fix it.\n\nSome items are so broken that if you don’t get them at the start, you might as well just restart the run, which means you end up spending more time restarting than actually playing.\n\nAnother absurdly unfun mechanic is the final boss: you spend 30 minutes building your setup, and boom, the boss steals ALL your weapons. There’s no counter to it. Good luck killing a boss with 10 million HP (its tankiness is ridiculous by the way) with absolutely no weapons.\n\nThe game has potential, but it needs a LOT of balancing work.\n\nEDIT: I tried to give the game another chance, and I realized I was being way too kind in my review, it's easily one of the worst games I've ever played.\nAnd the dev ran off with the money, he doesn't update the game AT ALL even tho there is close to no content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot of these power fantasy games have a problem with sometimes when you die it feels like your death was out of your control or because of some small mistake. In this game 90% of the deaths feel this way, even if you have a cracked build going that melts elites and can full clear most ads misinputing your movement slightly, getting bumped by an enemy you didnt see. some boss abilities just being undodgeable if you rng screwed you on terrain, large enemies spawning literally ontop of you and being undodgeable will constantly kill you and it just makes the game really unfun after awhile when youre mostly repeating the same parts of stages",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's cool when you first play but it begins to feel tedious much faster than other survivor games... I personally have gotten a lot more time out of cheaper survivors and had a lot more fun in the time I spent in them. interesting game though, but as a fan of survivors I'd say check out a different one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game jargon and non descriptive functions of items are very annoying. I don't want to go to reddit to figure out what an in game item does.. just explain it in game. This is manipulative, to cause outside engagement I suppose. The endgame is ridiculous, too RNG reliant. You have to restart playthroughs dozens of times, just to get a chance. Another manipulative tactic. The RNG is designed for masochists with a lot of time to to waste.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game kills you in so many chickenshit ways.  Too addictive for what it does.  You waste waaaay too much time.  Uninstalled.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Number Go up trash for ipad babies\n\nOnly reason I played this for so long is because it distracts me enough to enjoy the audio book im listening to.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything that I think is fun to use, seems impossible to actually win with. So that's a huge letdown. Also dev seems awol.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}