{
  "positive": [
    {
      "review": "This was written during patch 1.1, things may change in the future but honestly i dont plan on coming back to this game.\r\n\r\nDespite my experience, i still will recommend the game, cause it was a good experience overall until i went for 100% (and i mean savefile 100% not steam 100%). The game have a major balancing issue going on right now, with only 3 builds (to my knowledge) able to reliably farm end bosses. Despite that, the game's design is really cool, the systems within it are interesting even if they arent deep but make for interesting synergies. \r\n\r\nId argue that in its current state, \"idle\" isnt really a thing deeper in the game, and thats its major issue, active play is near mandatory to clear the game in a decent timeframe. Theres even a build going on that is pure active play that absolutely breaks the game. I still believe that its things that will be fixed overtime and the game will be better after a few more updates. \r\n\r\nIt may seems like a very doomer take ended with a light of hope, but i really think the game is worth checking out, but not worth pushing for 100% in its current state (unless a true idle build gets found?).",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Great game if you're into big bosses, big numbers, and multi-tasking.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "IDLE BOSS RUSH is a satisfying and surprisingly addictive idle game that nails the feeling of steady, meaningful progress. The constant stream of upgrades, flashy boss fights, and smooth mix of idle and active play make it easy to pick up and hard to put down. The town-building layer adds extra depth, giving you a sense of growing your own powerful kingdom over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Seriously good game, has a fatal flaw of deleting the save when the computer shutts off in a power outage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great and I'll give a positive review. Not very interactive after a couple hours, but that's the IDLE part of the game is. It's a nice game to leave on in the background while you do something else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that you can leave this game and it can really help you to do that. Also I enjoy that it doesn't need a good computer/pc to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. Zero microtransactions which is great for an idle game. Took just under 140 hours to 100% the game. Highly recommend if you like idle games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At 75 hours I have 100%'d the game. More idle games need to aim for a finish line and Idle Boss Rush is one where you can get in, enjoy, build and eventually decide to put it on the shelf, happy in what you've accomplished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would recomend as it is a very relaxing game and it was quite enjoyable to complete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found it to be fun.\nWhile trying to 100% is time consuming, it was pretty fun to just chill and play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun for a little while. good Afk game and not too expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game got some interesting builds you can do but after some hours it does get a little boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have had a wonderful time playing this game. almost got all achievements. Will be going for 100% and yes that does include the Granordioroth pet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10, this game is fine if you like idle games and ready to grind, but check out the guides. It will save you a lot of time for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good. Its a lot of fun and with the recent updates theyve made it way less grindy as well. The 100% achievements are grindy, which is by design as its a mission to get 100%, but by no means unreachable. Ive just finished it in the 13 hours and it was pretty fun. I AFKd for like 3 hours in the end to get the final achievements so its about 8-10 hours of gameplay.\r\nThe replayability is low so i won't be coming back to it, so if youre looking for a 200h game, this isnt it.\r\nAbout a 6/10 for me. If youre bored and played most of the other good incremental games, this is well worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 100% the game, most of it was fairly boring with just farming boss kills, which would be fine for an idler game, but to do good damage you need to be actively playing it. the damage ranges from 1-2 shots to kill a boss in 10 seconds or less while actively playing or taking up to 10 minutes to kill it while away. you cant really get good consistent damage unless your actively playing. this would not  be so bad if the game play was fun but it is pretty much just clicking on meteors every 5 seconds or a freeze icon, which if you choose not to then no damage is dealt.\n\nIf your looking for a game where you can complete the main story and defeat every boss once over a few days then this is the game for you, roughly would take around 15-20hrs and would include you actively playing for the last few bosses to actually do damage, then this is the game for you\n\nif you want an actual idler game where you can leave it in the background running and make a decent chunk or progress, you wont be getting that from this, or if you want an idler game where you can have good replay ability then you wont be getting that either unless your willing to actively play for an extra 30hrs to replay\n\nim giving this a good review at the end since for £8.50 the first 15-20ish hours were still fun experimenting with freeze,burn and poison and felt rewarding taking down each boss slowly but surely. woudnt recommend to 100% tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is more of a neutral review.\n\n[b]The Good:[/b]\n[list]\n    [*] The game is interesting in that it allows either an active gameplay style or a passive one. Active would be things like ice damage or using meteors. Those abilities are far more powerful than the passive damage sources, but it requires user interaction. Passive style revolves more around fire, poison, and light damage.\n    [*] The bosses are interesting and the game encourages you to explore different builds as you get and unlock new items and prestige upgrades\n    [*] Figuring out the best way to kill a boss you're struggling with is quite satisfying\n[/list]\n\n[b]The Bad:[/b]\n[list]\n    [*] The grind is real... So much grind... It would be nice if you could add conditions for moving onto the next boss. Like \"Get all items (mainly the pet item which has a very low probability)\", or \"unlock all kill achievements\", but in general, you'll need to leave the game running on a single boss for days at a time to be able to upgrade its items to its max.\n    [*] Many of the items are worse than useless, they're actively detrimental to your overall damage. One item consumes poison and fire stacks to increase physical damage for the trolls. The damage you get from this item pales in comparison to the damage you would get from the poison and fire since they're ramping damage.\n    [*] On the flip side, some items are almost mandatory. One item reduces boss resistances and multiplies non-physical damage. I don't know of any build that wouldn't require it since physical damage is a relatively minor damage source\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best cookie clicker ever probably. game stopped progressing  pretty fast tho, completed it in 20 hours ish, i hope more content will be added to the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fairly short game, without a ton of replayability, but fun for the time that I played it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% the game in less than 3 days. Cool graphics and features, but could use some more end game content. Would love to see more bosses and better / stronger / new upgrades in the future. \r\nAnd preferably a way to gain the prestige gems that doesn't require checking in every 20 minutes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fine. Fun, even. It's got great presentation, looks and sounds great, and the numbers are satisfying as they go up, which is basically the main thing for a proper idle game. \n\nPretty short, though, honestly, and somewhat clunky in design. The prestige system feels pretty underwhelming, somehow, because of how much grinding is required for everything in order to make proper builds. The advisor system feels limiting more than fun, but you eventually unlock stuff that makes it somewhat less annoying. How the various buildings scale seems odd, and even stranger is that you can actually max things. And, as others have mentioned, there's a ton of grinding, which wouldn't be quite as bad if there was actually an offline mode...but there isn't.\n\nif you like idle games and don't mind one running on your second monitor, and if you wait for more updates and/or a sale, then it's probably a recommend. It looks like they're still working on updates, so hopefully they can iron out more of the issues/add more content, in which case I could easily see it become a full recommend. We'll see.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is short and fun but with no \"endgame\".\r\n\r\nI like the graphics and the progression feels nice with different builds to try you have a reson to Prestige.\r\nSpeaking of prestige you dont get additional points for using prestige it basically just a respec.\r\nThe point you get for meta progression is something you get for traiding or for achivements.\r\nAs soon as you finish the game the scaling pretty much stops for the player after you kill the final Boss. you can go for ages and only see minial increses. There isnt a system to push you any further,\r\n\r\nOverall though i enjoyed my time i wish there was more to it with more progression.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decent Idle game, but it gets boring real quick 6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a good game to have play in the background while you play another game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and unique idle game. I had a great time playing this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun and relaxing game. I really enjoy the visuals and music. The theme overall is really well done and adds to the addicting gameplay. I love upgrading my town and units and seeing all the new fun things I can unlock. I am excited to work my way through the prestige upgrade tree and see just how insane my damage and money production can become.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool long idle game. Not for people who are only mildly into idlers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you want a perfect game award this one is good for it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, just fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"They don't know I studied the general theory of relativity.\"   - Wormhole Worm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creative Idle Game Style",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Afk gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "noice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yuh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OVERALL\nThis is a pretty neat, satisfying incremental/idle game that is JUICY as hell. I played the demo, loved the ideas, and immediately got the full game on release. For a £7.50 / $9 it's a great deal. It's definitely worth a go if you like idlers/incrementals, and/or love the overall feel of this from the main vid. There are a few rough edges, and this isn't a crazy long grind style idle game, it's a relatively short, single player idler with some light management to keep it interesting, great characters, cool artwork and effects, and a BANGING soundtrack. \n\nPROS\n- Good balance between passive idling and active interaction - chill, not overwhelming\n- Soundtrack slaps, HARD.\n- Artwork is fantastic, game juice/FX excellent - very satisfying experience\n- Progression system is well constructed and feels interesting at its heart\n- Doesnt descend into 'number on screen go brrr', the visuals and worldbuilding (however simple) make it work\n\nCONS\n- Scaling is a bit rough round the edges, with the early/mid game unlocks coming in thick and fast, then slowing down very quickly toward the end, which forces some grind, which feels a little off for this game. You get a bit too much too quickly, but it's still good stuff.\n- Signposting for the prestiging system (soft vs hard prestiging) is a little unclear - the soft prestiging feels like cheating, honestly.\n- Partly because of the scaling thing meaning you unlock almost everything really quickly, it feels like the game needs a couple of extra 'things', there's a decent amount going on, but because you end up spending a lot of time with all the current systems/buildings etc, it feels like there needs to be more of a mid-late game mechanic that's introduced\n\nIn conclusion, I rate this, and I'd recommend it if you like idlers/incrementals, as it feels pretty fresh. I personally hope that the dev keeps working on refining the game, and hopefully adds more content/DLC in the future!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This was written during patch 1.1, things may change in the future but honestly i dont plan on coming back to this game.\r\n\r\nDespite my experience, i still will recommend the game, cause it was a good experience overall until i went for 100% (and i mean savefile 100% not steam 100%). The game have a major balancing issue going on right now, with only 3 builds (to my knowledge) able to reliably farm end bosses. Despite that, the game's design is really cool, the systems within it are interesting even if they arent deep but make for interesting synergies. \r\n\r\nId argue that in its current state, \"idle\" isnt really a thing deeper in the game, and thats its major issue, active play is near mandatory to clear the game in a decent timeframe. Theres even a build going on that is pure active play that absolutely breaks the game. I still believe that its things that will be fixed overtime and the game will be better after a few more updates. \r\n\r\nIt may seems like a very doomer take ended with a light of hope, but i really think the game is worth checking out, but not worth pushing for 100% in its current state (unless a true idle build gets found?).",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's a good game for the price, don't expect hundreds of hours of content though, for me it was a good, entertaining idle adventure.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Very fun game, but it gets incredibly grindy mid to end game to the point where i left the game on and watch tv or a movie. The divine gems system needs work. 8/10 you will 100% get your money worth",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game if you're into big bosses, big numbers, and multi-tasking.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This has become one of my favorite incremental games.\nI have already played the demo couple of months ago and loved it, the release did not disappoint.\n\nWith plenty of bosses, items, a large skill tree that you can't complete all at once and 89 achievements, this offers plenty of content and grind. I was able to put in a bit over 60h of gameplay to achieve everything.\nDue to the ability to create different builds, the game also offers more depth compared to other games in it's genre, where the strategies are more linear.\n\nThe pixel art is on spot and executed amazingly.\n\nIt luckily also supports Steam cloud save games, which is a must to switch between desktop and Steam Deck.\n\nThis should get Steam Deck verified, it runs incredibly well. The item counts are a bit hard to read, but everything else is fine.\n\nLast but not least, the soundtrack is an absolute banger. I wake up and have it in my head. Someone was cooking.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Better than WOW, just add some achievements for mastering all items and collecting all pets, thx",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Enjoying the game. I have it running in the back ground while I work, then click a few buttons every so often - then back to work.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Really Nice Idle Game, You can progress Really Quickly Once you actually Know the Meta, i finished the game in not even 5 Hours. But thats due to my Speedrunning Nature, This game can take way longer than that. For People who wanna rush tho, Just try to get The Ice Whip to Tier 3 quickly, and you can 1 Tap until the Endboss without any issues, Just stack Trolls. I hope this game gets more content updated into it soon!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "decent lenghthy.. and theres a memory leak issue after MANY HOURS..like 24 with it open..so do close and reopen once a day...otherwise its a good little game if you want something to just spend a few minute every day  then let it run",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Is very good, only thing that is kinda bad is that its only like 1 viable late game build to choose from.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "While in the demo phase, game started out of the a fun little game, but my god how much stuff they put in the real game...\nIt's a blast playing through it.\n\nThe Devs listen very closely to the community. \nQuite a long game if you want to 100% it, so it doesn't end quickly.\nSeveral different types of \"builds\" to go for.\n\nThank you Ada & Mike for letting me playtest this fantastic game. :meowDJ:\n\nGreetings,\n\nDE.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "It's ok if you want to spend some money to play for just a few hours. I got to and beat the last boss in about 30 hours, the rest I played just to maximize everything in the game without it being necessary in any way.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good idle game, the negative reviews are people who have never played an idle game in their life and dont know what an idle game is. the soundtrack is also insanely good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's ok, for what it is, but it's quite short.\nDesign of bosses is good,\nMusic is fire,\nThere is around 5-6 different 'builds', so you can restart game (using prestige points) and try it out.\n\nBut the number of bosses and units is very limited + it's not actually an 'idle' game, bc there is not much point to just seat around and farm (yes, you can farm legendary items and some of them are ok, but game can be completed without it)\n\nSo yeah, just a simple game for 10-20 hours then there not really a point to play imo.  6.5 / 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "IDLE BOSS RUSH is a satisfying and surprisingly addictive idle game that nails the feeling of steady, meaningful progress. The constant stream of upgrades, flashy boss fights, and smooth mix of idle and active play make it easy to pick up and hard to put down. The town-building layer adds extra depth, giving you a sense of growing your own powerful kingdom over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just beat the final boss and do not really feel the need to keep playing at the moment. At some point upgrades from buildings stagnate and meaningful upgrades came slow when that happened. Bosses look nice visually, but their skillsets and resistances basically do not matter at all which is a bit of a shame.\n\nOverall it was ok. I liked it when new buildings and unlocks kept arriving steadily, but the fun took a nosedive when all that was left were minor upgrades or skillpoint upgrades that would need me to hunt 5+ achievements to get, which is a slogfest once you have all the easy achievements finished.\n\nWould give it like 7/10, could become more interesting with more updates.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Ton of fun while actively playing and passively! Loot farming hits all the right feelings and an itch is satisfied.\r\n\r\nWas a few updates along the way to 100% and dev listening and putting out proper fixes/adjustments, can't wait for the next game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Okay. Game is okay. I guess i can recommend it as time killer for a 2-3 days i think. But basically its too short if you aim to just kill last boss. *cough* 10 bucks *cough*\n Cheesiest strat - stack burn from your phoenix, use few artifacts for that, few passives on a tree too. Cap money early with forturite and max windmill. Aaaaand knowing that in advance you probably can complete game even under 2 hours. \n My point is - no real endgame. Only grind here are 100% for achievements. \n And its actually a shame for idle game to have less than 12 hours of actual gameplay (some grind included and even 2 hours afk). \n So to summarise - 6/10 time killer for a few days.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Excellent Idle game, don't let any mixed reviews fool you.  If you want to pay for a game solved in 12-14 hours, in the Idle genre, then ya, get mad.  This game isn't AAAA, but it's quite creative for an Idler, it has fun with its graphics, and plays well enough to extend things long enough but not too long for the price.  Many idlers are simply one dimensional and too obvious, this one gates well, relys on incremental progress and later decisions, as well as has a unique level of control for how to progress that most idler's don't.  I appreciated the level of input I had to put in, a nice balance of decisions vs time going back to watching YouTube vids on the other screen.  I did almost no spam clicking, which is another thing I like about good Idlers.  I don't like to spend much on games, so I've been glad to get what I have for this price.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Absolutely amazing idle game and love the stratzgy aspect to it!!! It really makes you think about what you should chose.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is fantastic. awesome idler to keep on a side screen while i'm working and check into. really fun bosses, awesome art, amazing addition to the idler genre. 100% would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A well crafted experience. A bit less replayable and long than most idle games, but it's very high quality.\n\nThe game also has no offline progress, and [strike]there is no endless prestige system[\\strike] like in most games for the most part, but that also makes it higher quality, because those systems are generic at this point.\nPS: They now added the ability to increase boss levels which allows you to scale the game infinitely, with skill points as reward.\n\nWhat you get instead are skill points in a skill tree, which you can reset by hard reseting, where you have to build your buildings from scratch (though it is faster to get them back, than the first time around).\n\nAnd there is some material grinding for completionist to get all equipment to highest level and quality.\n\nAnd timing challenges, which also tell you how well you are doing in them compared to the other % of players.\n\nOverall a great game and interesting systems.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Seriously good game, has a fatal flaw of deleting the save when the computer shutts off in a power outage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great and I'll give a positive review. Not very interactive after a couple hours, but that's the IDLE part of the game is. It's a nice game to leave on in the background while you do something else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that you can leave this game and it can really help you to do that. Also I enjoy that it doesn't need a good computer/pc to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. Zero microtransactions which is great for an idle game. Took just under 140 hours to 100% the game. Highly recommend if you like idle games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At 75 hours I have 100%'d the game. More idle games need to aim for a finish line and Idle Boss Rush is one where you can get in, enjoy, build and eventually decide to put it on the shelf, happy in what you've accomplished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would recomend as it is a very relaxing game and it was quite enjoyable to complete.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found it to be fun.\nWhile trying to 100% is time consuming, it was pretty fun to just chill and play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun for a little while. good Afk game and not too expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game got some interesting builds you can do but after some hours it does get a little boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have had a wonderful time playing this game. almost got all achievements. Will be going for 100% and yes that does include the Granordioroth pet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10, this game is fine if you like idle games and ready to grind, but check out the guides. It will save you a lot of time for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good. Its a lot of fun and with the recent updates theyve made it way less grindy as well. The 100% achievements are grindy, which is by design as its a mission to get 100%, but by no means unreachable. Ive just finished it in the 13 hours and it was pretty fun. I AFKd for like 3 hours in the end to get the final achievements so its about 8-10 hours of gameplay.\r\nThe replayability is low so i won't be coming back to it, so if youre looking for a 200h game, this isnt it.\r\nAbout a 6/10 for me. If youre bored and played most of the other good incremental games, this is well worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 100% the game, most of it was fairly boring with just farming boss kills, which would be fine for an idler game, but to do good damage you need to be actively playing it. the damage ranges from 1-2 shots to kill a boss in 10 seconds or less while actively playing or taking up to 10 minutes to kill it while away. you cant really get good consistent damage unless your actively playing. this would not  be so bad if the game play was fun but it is pretty much just clicking on meteors every 5 seconds or a freeze icon, which if you choose not to then no damage is dealt.\n\nIf your looking for a game where you can complete the main story and defeat every boss once over a few days then this is the game for you, roughly would take around 15-20hrs and would include you actively playing for the last few bosses to actually do damage, then this is the game for you\n\nif you want an actual idler game where you can leave it in the background running and make a decent chunk or progress, you wont be getting that from this, or if you want an idler game where you can have good replay ability then you wont be getting that either unless your willing to actively play for an extra 30hrs to replay\n\nim giving this a good review at the end since for £8.50 the first 15-20ish hours were still fun experimenting with freeze,burn and poison and felt rewarding taking down each boss slowly but surely. woudnt recommend to 100% tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is more of a neutral review.\n\n[b]The Good:[/b]\n[list]\n    [*] The game is interesting in that it allows either an active gameplay style or a passive one. Active would be things like ice damage or using meteors. Those abilities are far more powerful than the passive damage sources, but it requires user interaction. Passive style revolves more around fire, poison, and light damage.\n    [*] The bosses are interesting and the game encourages you to explore different builds as you get and unlock new items and prestige upgrades\n    [*] Figuring out the best way to kill a boss you're struggling with is quite satisfying\n[/list]\n\n[b]The Bad:[/b]\n[list]\n    [*] The grind is real... So much grind... It would be nice if you could add conditions for moving onto the next boss. Like \"Get all items (mainly the pet item which has a very low probability)\", or \"unlock all kill achievements\", but in general, you'll need to leave the game running on a single boss for days at a time to be able to upgrade its items to its max.\n    [*] Many of the items are worse than useless, they're actively detrimental to your overall damage. One item consumes poison and fire stacks to increase physical damage for the trolls. The damage you get from this item pales in comparison to the damage you would get from the poison and fire since they're ramping damage.\n    [*] On the flip side, some items are almost mandatory. One item reduces boss resistances and multiplies non-physical damage. I don't know of any build that wouldn't require it since physical damage is a relatively minor damage source\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best cookie clicker ever probably. game stopped progressing  pretty fast tho, completed it in 20 hours ish, i hope more content will be added to the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fairly short game, without a ton of replayability, but fun for the time that I played it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100% the game in less than 3 days. Cool graphics and features, but could use some more end game content. Would love to see more bosses and better / stronger / new upgrades in the future. \r\nAnd preferably a way to gain the prestige gems that doesn't require checking in every 20 minutes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is short and fun but with no \"endgame\".\r\n\r\nI like the graphics and the progression feels nice with different builds to try you have a reson to Prestige.\r\nSpeaking of prestige you dont get additional points for using prestige it basically just a respec.\r\nThe point you get for meta progression is something you get for traiding or for achivements.\r\nAs soon as you finish the game the scaling pretty much stops for the player after you kill the final Boss. you can go for ages and only see minial increses. There isnt a system to push you any further,\r\n\r\nOverall though i enjoyed my time i wish there was more to it with more progression.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decent Idle game, but it gets boring real quick 6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a good game to have play in the background while you play another game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and unique idle game. I had a great time playing this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a perfect game award this one is good for it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, just fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"They don't know I studied the general theory of relativity.\"   - Wormhole Worm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creative Idle Game Style",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Afk gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "noice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yuh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OVERALL\nThis is a pretty neat, satisfying incremental/idle game that is JUICY as hell. I played the demo, loved the ideas, and immediately got the full game on release. For a £7.50 / $9 it's a great deal. It's definitely worth a go if you like idlers/incrementals, and/or love the overall feel of this from the main vid. There are a few rough edges, and this isn't a crazy long grind style idle game, it's a relatively short, single player idler with some light management to keep it interesting, great characters, cool artwork and effects, and a BANGING soundtrack. \n\nPROS\n- Good balance between passive idling and active interaction - chill, not overwhelming\n- Soundtrack slaps, HARD.\n- Artwork is fantastic, game juice/FX excellent - very satisfying experience\n- Progression system is well constructed and feels interesting at its heart\n- Doesnt descend into 'number on screen go brrr', the visuals and worldbuilding (however simple) make it work\n\nCONS\n- Scaling is a bit rough round the edges, with the early/mid game unlocks coming in thick and fast, then slowing down very quickly toward the end, which forces some grind, which feels a little off for this game. You get a bit too much too quickly, but it's still good stuff.\n- Signposting for the prestiging system (soft vs hard prestiging) is a little unclear - the soft prestiging feels like cheating, honestly.\n- Partly because of the scaling thing meaning you unlock almost everything really quickly, it feels like the game needs a couple of extra 'things', there's a decent amount going on, but because you end up spending a lot of time with all the current systems/buildings etc, it feels like there needs to be more of a mid-late game mechanic that's introduced\n\nIn conclusion, I rate this, and I'd recommend it if you like idlers/incrementals, as it feels pretty fresh. I personally hope that the dev keeps working on refining the game, and hopefully adds more content/DLC in the future!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This was written during patch 1.1, things may change in the future but honestly i dont plan on coming back to this game.\r\n\r\nDespite my experience, i still will recommend the game, cause it was a good experience overall until i went for 100% (and i mean savefile 100% not steam 100%). The game have a major balancing issue going on right now, with only 3 builds (to my knowledge) able to reliably farm end bosses. Despite that, the game's design is really cool, the systems within it are interesting even if they arent deep but make for interesting synergies. \r\n\r\nId argue that in its current state, \"idle\" isnt really a thing deeper in the game, and thats its major issue, active play is near mandatory to clear the game in a decent timeframe. Theres even a build going on that is pure active play that absolutely breaks the game. I still believe that its things that will be fixed overtime and the game will be better after a few more updates. \r\n\r\nIt may seems like a very doomer take ended with a light of hope, but i really think the game is worth checking out, but not worth pushing for 100% in its current state (unless a true idle build gets found?).",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's a good game for the price, don't expect hundreds of hours of content though, for me it was a good, entertaining idle adventure.",
      "voted_up": true,
      "votes_helpful": 5
    }
  ],
  "negative": [
    {
      "review": "After 100%ing everything, I can say most of my playtime was pretty boring. After clearing the game once by taking down the 13 bosses (which really only takes one prestige), the rest of your game time is going to be taken up by grinding. You need at least 600-700 kills on each boss to guarantee max rarity, and more to get the materials to max them out. \n\nThis is 90% of the content in the game. Builds range from \"one-two shotting the final bosses\" to \"potentially taking half an hour per kill\", meaning that not optimizing just feels like a giant waste of time. At the top end, there's really only two viable builds. There used to be more, but they snapped the game in half too much and were nerfed. So the main selling point of theorycrafting builds is pointless because there's no incentives for anything other than speed kills.\n\nThe power spikes that you get in incremental games that give you dopamine are very rare, with them coming only from item rarity upgrades and progressing in the skill tree. Progressing in the skill tree is odd, as the most effective way of doing so is to stockpile a bunch of resources and then getting the funds as quick as possible to purchase the buildings that let you buy more skill points. This means that  it both incentivizes speed kills and also doesn't really let you toy around with builds.\n\nI didn't even bother doing that, so it took me 76 hours to get everything done. However, I was paying attention for only 5 of those hours tops.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "It was a fun game for a little bit, but it becomes a waste of time eventually. Poorly balanced items, prestige can actually hinder you pretty severely, and most units are just worthless to use. My high amount of hours was just me grinding bosses until I had a ton of their loot for a personal set goal, and because I really didn't have another incremental to play at the time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a $10, 20 hour idle game.  Pass on something this expensive that doesn't even offer the basic \"reset for big big number\" that defines the genera.  Sure there's a reset but its not even necessary to complete the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Cool concept/shell but didn't feel well executed to me. Hopefully updates make this into something great.\n\nThe review regarding the issue being \"stagnation\" feels very real to me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It looks like a huge nerf wave happened that left about half of the mechanics literally useless. Might get fixed in the future.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It quickly becomes boring in the mid-late game. The incoming power creep doesn't feel gradual, it feels like going from 25->30->40->1000. One second you have everything maxed out with the money you're currently earning- all the damage you can possibly do, a great build with MAXED out related items boosting your build, and then the next you're doing like, no damage on a level one boss. And upgrades don't feel like they're following that progression or closing that gap, nor does the upgrades in the skill tree. I was shocked when I maxed out how much money my farm could make, and I still had four bosses I hadn't gotten to beating and farming yet. \n\nThe addition of up to 4 levels of a boss doesn't feel like it helps that at all? It's cool for farming items when you can kill the 4th level boss quickly, but it doesn't solve the sudden and drastic jump to really strong bosses and no monetary gains to follow it.  \n\nIt feels like, from reviews, there's likely *one* good build you're *meant* to use that I clearly didn't have (I was built around fire dps and crits). But EVERY build should be viable, should feel balanced, and should be fun to play with.\n\nOverall, I'd give this a mixed if Steam had that option. The art is really cool, the boss designs are awesome, and the early game is fun. It just stops being fun during the period you'd be spending the most time with it, the mid to late grind, so I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Starts well then grinds to a halt with a very odd prestige system.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]A Promising Game That Turns into a Grind Fest[/h1]\n[b]OBS! THIS REVIEW CONTAINS SPOILERS[/b]\n[b]TLDR at the bottom[/b]\n\nAfter 74 hours of playtime, I have finished all achievements, unlocked every possible pet and almost maxed out the Talent Tree. And before I leave this game to the depths of my steam library, I thought it fitting to leave a review explaining my experience with the game.\n\n[h2]Quick Summary of Game Resources[/h2]\nThe game is about slaying one selected boss monster repeatedly to obtain resources such as [b]Materials[/b], [b]Items[/b] and [b]Gold[/b]. \n[b]Gold[/b] lets you upgrade buildings and recruit followers which help you slay the boss. \n[b]Items[/b] give special effects by being equipped to Advisors.\n[b]Materials[/b] are used to upgrade the strength of Items.\nAll of this is shown clearly in the Gameplay Trailer.\n\n[h2]Gameplay[/h2]\nWith the Game Resources explained above, covering the gameplay loop becomes a lot easier because it's not very complicated.\n\n[u] The beginning of the game[/u]\nThe game starts off slow with the player slowly amassing upgrades and increasing their damage. Depending on what the player chooses to focus on, the time it takes to transition into mid game can vary by a lot. Personally, it took me a combined three hours of active gameplay to find a way to skyrocket my progress. It was the [spoiler]Farmlands building.[/spoiler]\n\nBy combining [spoiler]the Farmlands building[/spoiler] and [spoiler]the item [b]Ruff[/b][/spoiler]. I was able get into the gameplay loop the player will be running up until they finish the game.\n\n[u]Mid game to late game[/u]\nMid game starts once the player has unlocked most upgrades and buildings. At this point, the Player has also unlocked the [b]Prestige[/b] system. This, as shown in the Gameplay Trailer images, is a tree full of upgrades for the various buildings and followers.\n\nUp until this far, the Player has probably been sticking to one build or trying out multiple by combining Advisors, Items, Followers and Buildings. Looking at the Prestige Tree, they wonder \"What other builds can I make to become stronger\".\n\nTo unlock more nodes on the Talent Tree, the player unlocks two buildings, the [b]Alchemist[/b] and the [b]Marketplace[/b] and start farming bosses to obtain more resources which they trade in for Divine Gems every 20 minutes.\n\nThis is the most broken down and straight-forward progression path that I can describe as well as the one I myself took.\n\n[h2]My thoughts and critic[/h2]\nI had fun at the start. The first five hours or so was quite active and it felt like I had an impact on the game with my builds. However, as time went on, a very big issue became glaringly clear as I unlocked more and more nodes and Items. [b][u]There is next to no build variety.[/u][/b]\n\nI'm a very build oriented person so I made a few builds. Sadly, most of them eventually didn't have the damage scaling for later bosses or were painfully slow, making them feel obsolete. Very few builds actually  ended up working and a lot of the nodes on the Talent Tree do basically nothing. Some Items sound strong but when put into action, they fall flat.\n\nOutside of builds, the grind of items also became very boring. After entering the mid to endgame stage, I spent most of the time just having the game open while I played League or WoW. This is because there was nothing else for me to do in the game. I farmed Items and resources.\n\n[b]What could be better?[/b] [i]imo[/i]\n[list]\n    [*]More bosses\n    [*]More Items\n    [*]More pets\n    [*]Give some pets unique abilities\n    [*]Give certain followers more strength through additional nodes or items\n    [*]Improve the Collection Progress system - It stops around midgame\n    [*]Rework the way you get Divine Gems, the current system is just a boring grind\n    [*]More complex Wheater mechanics\n    [*]Rework the Resident system - It's currently very one-sided and becomes a very limiting factor\n    [*]Add rewards for completing certain achievements\n    [*]Add ways for the player to add color the game. 50+ hours of grey is boring.\n[/list]\nThese are just a few of the things I came up with but I'm sure if I played through the game again, I'd find other things to point out. \n\n\n[h2]TL:DR / Final thoughts[/h2]\nTo summarize whether the game is worth it's price tag - I'd have to say no. While the game's core is promising and if expanded upon can evolve into something very impressive, as it stands right now, it only captivates you just enough to keep the game running in the background while you do chores or play another game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game has potential, but there's a single serious flaw. Stagnation.\nIf you play for several hours, you slowly grow bigger and better. But at some point everything just runs to a halt and things stagnate. I had a solid 2 hours of fun, the remaining 16 hours felt like pain...\n\nEventually, you'll unlock the \"prestige\" system, which is nothing more than a fancy reset button. It does not bring you any increased benefits if you were to prestige multiple times like you would in other idle games. Instead, the game wants you to read up on all the skills, perks, equipment, to then try to find a \"build\" that should break the game. But from what I hear, the developer seems to nerf builds occasionally so it gets hard and harder to progess.\n\nAnd eventually, the ONLY consistant way of progressing, is by waiting 20 minutes, and then buy a prestige point from the shop... And with 2 shops, that's 6 points per hour at most. And that's assuming you have the materials to buy them, which you likely won't. And you don't need just 6 points... you'll want to get 200+.\n\nEverything in this game is designed to slow you down, nothing makes you feel strong. if something makes you feel strong, it'll get nerfed. You'd think they'd just move the goalpost further, no. instead they shoot your kneecaps to prevent you from progressing.\n\nIf you like excessive reading, and constant min/maxing while attempting builds that each may take HOURS to figure out if they work or not, then sure, this could be a cool game. But for the vast majority of people... this aint it.\n\nedit: \nMy original review was made on 18 hours. Because I wanted to give the game a fair chance, I went to their discord to get more advice and tips/tricks... this did not change my opinion of the game.\nI am currently just finishing all achievements. and all hours past 18 are essentially done AFK because the only way to progress, is to hit a button every 20 minutes to get more prestige points... and you need to do this... 60+ times. So yes, this WILL increase time played, and no... it's not fun.\n\nFinal time for 100% of all achievements is 36h, which would be cool, if the game was fun past the initial 2~3 hours. Which it was not.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "really enjoyed the demo but the full release is so weird with its upgrades and stuff after just like 5 hours of playing im reaching \"max\" on basically everything but theres like 5 bosses left to go and no clear way forward",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "game is fun for a couple of hours, then it becomes a grindfest that you have to keep the game running for dozens of hours to farm material for the worst prestige system i've ever seen on a idle game.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "I wish I can give the game a \"neutral\" review.\n\nThe game is \"fun\" but it really needs better pacing and a better end-game system. The Prestige system needs an overhaul. Considering this game $10 base, I'd expected more because I've poured more time in cheaper or free idle games that had better systems.\n\nI managed to get all the achievements, some require alot of time and you actually need to pay attention for some like the Meteors click, but I feel like there should be more. For example, the Jack of All Trade: \"Reach a Bronze start in 6 different Arena Boss Rushes\". Why isn't there a Silver and Gold versions of this? is this a sly way of artificially adding/increasing game time since we cannot earn more Divine Gems with these missing achievements? After earning all of the achievements we're forced to keep looking at the shops every 20mins or so to earn more Divine Gems. There are so many achievements the dev can add to increase the gain of Divine Gems but most likely will refuse to do so until a better Prestige System is released.\n\nTo me, I think the $10 should've had way more content initially because it's essentially just an idle game, and the dopamine hit for most idle games is prestiging and advancing everytime, but you alas the end-game content is non-existent.\n\nI say wait till the game goes on 50-75% off or after like 5 huge updates because currently it's not worth it the price tag for the amount of content there is.\n\nI'll change my review once the game has been updated properly and the $10 price tag is justified.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "The demo really got me hooked, and I expected there to be a lot more content. Unfortunately, after finishing the game in about 25 hours and completing nearly everything it has to offer, I can’t recommend it.\n\ni love the item system and the art design but an idle game with less than 30 hours of content..,it’s simply far too short and lacks long-term progression or an real endgame.\n\nThere is better Idle games which cost less / free that have more content and depth",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Satisfying progress at the beginning, then it turns into a flat grind for the last few bosses as you try to collect divine gems and upgrade the gear you need.  Boring and slow.  Additionally, there's a massive memory bleed because the dev apparently has no idea how to, or interest in, learning how to have the game release memory.  It'll use up 30 gb of ram in less than 6 hours, so idling it is even more of a grind.  I'd say avoid until at least the memory issue is fixed.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "This game feels like an idler game which is trying not to be one.\n\nMajor upgrades cost citizens, and once you upgraded it, you can never get them back, this would be fine, except that your citizens have a cap, and it's impossible to upgrade everything, you can only really focus on two different races(warrior,troll,bird etc.) since even their damage upgrade cost 20 citizens.\n\nAnd the 'hard reset/rebirth' function is atrocious, your weapon and phoenix experience also gets reset back to 0, especially the phoenix, since to level it up you have to manually click on it, resetting it's progress again.\n\nI can guess why the developer made it this way, to make this game more 'strategic', which comes to my first point, this is an idler game, why does it need to be strategic? What is wrong with being really brainless and overpowered?\n\nAnd the boss before the last boss is so unsatisfying to fight with. It's ability locks your items, which made the fight way longer than how other bosses are.\n\nIdler games are supposed to be satisfying, yet the game design seem so unsatisfying. \n\nAnd the recent update made this game even more unsatisfying to 'play' with item nerfs, I feel like the developer is trying to make this game have longer playtime by dragging the fight longer, but that just made me feel less likely to play.\n\nThe unsatisfying factor outweighs the satisfying factor of an idle game in my opinion.\n\nIn my opinion, ways to improve the game:\nRemove the citizen cost for upgrading.\nDon't reset phoenix's level when hard reseting.\nKeep the original pre-nerf clock's ability, but make it so you can only get to this at max level.\nChange the eye boss's ability.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Demo was the best part\nFinal upgrades to items that cost 1000res have almost zero impact on the game and are mostly designed to just waste your time\nBoss rush? More like boss crawl",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "Played the demo, bought the full release and refunded it.\n\nWhen upgrading in the demo, the balance felt good like I was making steady progress and hitting breakpoints with the farm and my damage, but the full release completely scales the cost/benefit of upgrading unreasonably.\n\nThe cost of everything is ridiculous, at 9 warriors you now need to spend 40k to get a 10th, the farm costs like 100k to upgrade from 4k gold per harvest. The cost basically jumps a multiple of 5-10x for no reason. You cannot just buy units anymore cause after around 10 of any unit the cost of the next then sky rockets. I was upgrading a unit and for some reason the cost goes from like 40k to 600k? Like wtf?\n\nPoison is also no longer useful in the earlygame and only really useful in the later stages because you have to stack 10 times more poison each time, 7/77/777. I get this fixes the issue of poison originally being useless in the late game, cause 3000 damage becomes nothing, but in the mid game, you never get the poison stacked to 777 and by the time i stack to 77, the boss is almost dead already.\n\nDevs lost the plot thinking this is a AAA title that needs 30 hours of gameplay, and I heard it will take you 30 hours to complete this grind. Why? Increasing timers and slowing progress just isn't fun, the demo felt way better at pacing. \n\nTLDR; The demo respected your time, and the full release doesn't.",
      "voted_up": false,
      "votes_helpful": 159
    },
    {
      "review": "At first, I enjoyed this game, it was promising. But already, a few hours in i realised, that this game would not last long.. The progression walls in terms of damage, and limits in terms of time consumed to progress, as you can trade potentially to get a gem for more skills, every 20 mins is seemingly pointless, because, you can maw down the bosses and be done w the progression of killing all the bosses. The rewards for, doing the Arena, seems kinda pointless, as the timers gives you seconds/a few minutes, to get some materials, but before you get to a point where you can kill these bosses that efficiently, you probably already farmed the living s**** out of them, and the resources you get, makes me question why bother? in any case, i have thousands of thousands of hours in idle clicker games, I enjoy the genre a lot, this game strikes me as half finished. I have 110 hours now, mainly because i just let it farm for the pets you can get.. but that is the only reason.. in a few more days, there will be nothing left. and I find it sad, that my review is a negative one. I hoped this game would keep grow and give us interesting new things to experiment, and honestly, i was hoping for a lot more boss encounters. It came up, as a game that was promising \"endless possibilities\" but they are not.. they are very quickly capped..",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The game needs more content and the ability to max everything out especially since there is no offline mode progression. This is a fun concept that I want to keep playing yet it falls short on the idle promises.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "This one needed to cook longer. The progression system was altered too heavily from the demo, which gives the game a completely different feel in a bad way. Late(r) stage rewards and unlocks seem to be an after-thought, as they're not tuned to scale with what your average damage per second should be at that stage of the game, making them completely negligible.\n\nThere's also the sticky situation of it being an idle game with no offline progress, but having what I assume is a memory leak. It eventually consumed double the amount of resources Chrome does, which is impressive.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "After 100%ing everything, I can say most of my playtime was pretty boring. After clearing the game once by taking down the 13 bosses (which really only takes one prestige), the rest of your game time is going to be taken up by grinding. You need at least 600-700 kills on each boss to guarantee max rarity, and more to get the materials to max them out. \n\nThis is 90% of the content in the game. Builds range from \"one-two shotting the final bosses\" to \"potentially taking half an hour per kill\", meaning that not optimizing just feels like a giant waste of time. At the top end, there's really only two viable builds. There used to be more, but they snapped the game in half too much and were nerfed. So the main selling point of theorycrafting builds is pointless because there's no incentives for anything other than speed kills.\n\nThe power spikes that you get in incremental games that give you dopamine are very rare, with them coming only from item rarity upgrades and progressing in the skill tree. Progressing in the skill tree is odd, as the most effective way of doing so is to stockpile a bunch of resources and then getting the funds as quick as possible to purchase the buildings that let you buy more skill points. This means that  it both incentivizes speed kills and also doesn't really let you toy around with builds.\n\nI didn't even bother doing that, so it took me 76 hours to get everything done. However, I was paying attention for only 5 of those hours tops.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I wish I could give this game a “mid” rating - because that’s exactly what it is.\n\nWhy even bother adding 0.1% chase items when they’re completely useless? That was such a disappointing realization.\nProgression is interesting but never really shines. Builds feel unbalanced across the board.\nHonestly, I just wish there was more of everything.\n\nThe skill tree is fine, but I wish I could actually see the whole thing and expand on it properly.\nIt’s kind of weird finishing the game before even unlocking all the skill points. Took me about four days to finish, which just feels too short for something that had so much potential.\n\nAnd why are there so few collection rewards? I had four legendary items and the collection was “complete.” Like… what? Where’s the grind?\n\nAs for builds, focus on poison soldiers early, then switch to light spears when you can. Fire builds? Absolute trash. Only use fire if you need to grab the two “light” items, then drop it immediately. After that… that’s basically it. Game over...\n\nThe game showed real promise, but in the end… it just didn’t deliver.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "It pretends to be interesting, but the prestige mechanic is quite punishing, and the game goes out of its way to hide upgrades from you. The game is also quite memory intensive, which is annoying, as it does not include offline progress. I had a couple of crashes, while trying to farm materials for one of the legendary items. The challenge mode seems made just to tease you, I finished the game having only done two of the 5 or so challenges. It has a cute artstyle, and the music is good, but ultimately I did not enjoy it too much.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I can't recommend this game due to how little content there is for a non free idle game, the Dev estimated that it would take 3 days to beat all the bosses and 1 to 2 weeks to get all achievements, however i was able to get all achievements in 64 hours (and this could be faster if you were only going for those achievements)\n\nThe content that goes beyond achievements is basically just grinding to max rarity / level all equipment and getting all boss pets, this wouldn't add much time on top if i were to go for this, with only the final 2 pets remaining\n\nThe other problem here is the progression you would normally expect from an idle game is over extremely quickly, once you can kill the last boss you are not going to get much stronger and you are just achievement hunting.\n\nThe art and music is really great in this game, but not enough to carry the issues it has.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Kill the boss until you fully upgrade his weapons to legendary > move to next boss and repeat until you hit the end game slog",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The game’s fun at first, but it really lacks content.\nWithin minutes you can do almost everything, and in about an hour you’ve maxed out all features. After that, there’s nothing left but waiting a few more hours to beat it.\nOnce that’s done, there’s literally nothing to do except grind for achievements—which you can finish in three days.\nThis should absolutely have been released in Early Access.\nIf you’re thinking of buying it, wait for some substantial content updates that will let you enjoy it for more than just a few hours.\nThe bosses’ artwork is the only thing it does well (and the reason I bought it), and I really have to give credit to the developers for that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Whats the point of being an IDLE game if you close out the game and come back to no progress? The idle part only works if you have the game open - defeats the purpose of an idle game tbh",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "There's 2 types of idle games. Ones that end and ones that grind to a halt to hide the fact that there's really not much to it. This game is the latter. I wish there was a \"it's fine\" option but for the time being this a no for me. There is some cool build variety but in the end it doesn't matter because progression becomes so slow that it's a pain to ever experiment or do anything but the meta build.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have to preface this saying i have 10k hours in ITRTG, finished NGU idle, 7k hours on Galaxy idle, 5k on Your Chronicle. And i have to say, tying the prestige mechanic to achievements is one of the dumbest ideas i have ever seen on and Idle game, it makes game pacing and S.T progression feels awful and like a grind in the worst way possible for an idle game. Its quite a shame since the equipment idea from boss farming is quite nice, but it just feels like this game has no content and they are masking it with deliberately slow progression so we dont realize the shallow mechanics (just items, ST and the buildings)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I won't beat a dead horse although I do agree that the sudden choke point creates a lot of extra annoying grinding and the upgrades feel less and less impactful as the game goes on.\r\n\r\nNo my main issue is the fact that there is not a regular cloud save that happens. that you have to quit the game  or save manually. \r\n\r\n3 days i had the game open and grinding. My game crashed after i upgraded something and it wiped the entire progress. Cool game, cool ideas, cool graphics, and a really cool upgrade system. \r\n\r\nBad pacing, horrible artificial increase in game length, bad save system.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Quite a sad situation we have here. Coming from the demo, everything looked nice. Progression and bosses felt well balanced, artwork and UI are good. Sadly the full game does not really build on this foundation. Progression continues a bit further quite well, but then you're stuck. Unit upgrades takes way longer, while the impact doesn't scale. Only way to progress later on (killing bosses, but also quickly killing bosses for farm) is to level up items and skill tree (called hard and soft prestige). For the items you need to farm the bosses and that for quite some time. The later bosses have annoying mechanics (without any good counter) which stops you from efficient farming and you require 1111 of each item to fully upgrade, with a ~20% drop chance. The skill tree requires tokens, which you get from achievements and can buy from items you farmed. The more you have, the better your build can become. With soft prestige you can only extend your current skill tree. If you want to fully reset the tree, you can do a hard prestige and reset your whole progress except items and prestige points. While you can easily come back to around 4/5 of the progress, the last part takes forever as scaling is so weird. Then again it does barely matter, as 99,9% of the damage is coming through elemental damage from the items, thus many upgrades for units are completely useless, especially damage, as it does not scale.\n\nI played similar games for much longer, but somehow they did not get boring, as progression always brought great new stuff. This isn't the case here and such I cannot recommend the game. At the point you finally have enough points and item levels to create a cool build, you have already solved everything there is in the game. If they would increase the progress a bit in the current \"end\" game so it doesn't get that boring and instead develop something challenging to tackle if you got all the items and skills, I could recommend this game. In the current state you've seen the best of it after you've played the demo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game's balance is fucked. You reach a point very quickly where everything is maxed because the game only goes up to Quadrillions and everything has hard caps. The last 5 bosses force you to stagger slowly through them unless you use the Ice Whip, in which case you absolutely destroy all of them, the final boss' ability doesnt even matter because that strategy doesn't require units. Prestiging feels like ass because your prestige currency is tied directly to the amount of achievements you get, or ludicrously priced trades in the maxed out traders. Overall,the game is very short for anyone experienced in this genre, and isn't even really \"idle\" as there's no offline progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not only some units are completely superior to others, there is almost zero synergy between then. The last tier of items are extremely grinding and uninteresting. Felt like a big waste of time. Even for idler standards.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Summary:\nGame was interesting at first but then it just became monotone and boring because HP scaling for boss is kinda crazy as you move towards the end. Lack of mid to end-game content. \n\nDetailed Review [Spoilers]\nPros:\nInteresting concept\nVariety of Builds based on choice of items and skill build\nVery fun early game\nHard and Soft Prestige concept is nice\n\nCons\nGame starts to get boring during mid game\nSkill Tree is lacking\nSkills/Summons/Units and their respective builds are imbalanced and lack tuning hence resulting in a cookie cutter build(s)\nPrestige System is lackluster because technically it is just a skill reset, it fundamentally provides no substantial benefit.\nBoss skills is a good concept but imbalanced and lack tuning resulting in ridiculous scaling, for example, Hexgaze, the 2nd to last boss, locks one of players equipped items. Not a problem but at level 2 of the boss, it has a 40 second cool down and when you go to level 3 it has a 1 second cooldown, at least based on the tool tip in-game.\nLack of Offline progession..... as an idle game.... this is....a nono.... at least cap offline progession at a set limit maybe 10 or 12 hours\n\nIn-depth Analysis/Review (mostly for devs)\nPrestige System\nHow should I put this, the system is really underwhelming, over roughly 100 hours of game play, I only Hard prestiged twice, and because the skill tree is so limited in comparison, the existence it has in the game is almost something you can do without.\n\nImbalance/Lack of tuning with respect to Equipment Synergy And Skill Tree Builds.\nI believe that the game would be more fun if all the units/items and their respective synergies all worked just as effectively before taking into consideration boss resistances/skills. My opinion is like this because the skill tree is really simple, the progression is linear and the only flexibility you really have in the game is the type of builds you have, while early game it does not matter much, personally I find that as you move towards the end of the game, there is only one or maybe two skill builds that are efficient hence resulting in cookie cutter builds.\n\nLack of content\nI think recently the standard on Indie games have risen immensely and I believe that this game is really not worth it. Although I have played for roughly 100 hours, technically speaking realistic gameplay is only maybe 4-5 hours with most of it in the early game and me just AFK waiting for resources to roll in, to press the upgrade button once.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It was a fun game for a little bit, but it becomes a waste of time eventually. Poorly balanced items, prestige can actually hinder you pretty severely, and most units are just worthless to use. My high amount of hours was just me grinding bosses until I had a ton of their loot for a personal set goal, and because I really didn't have another incremental to play at the time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It feels good at first, but at the same time it’s a bit lacking. The progression feels off. You spend about 50% of the game before you even prestige, then after that you push another 10% further and suddenly you can prestige with almost any build and finish the game without much thought.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wish there was a mixed option,\n\nbut alas, It starts very good, first day is fun, progression is good, but then it's just awful, kill the bosses until you get 1000 items, go next boss, no real choices to make and to gain prestige points you need to check in every 20min to trade\n\nalso not very much content unfortunatly",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a $10, 20 hour idle game.  Pass on something this expensive that doesn't even offer the basic \"reset for big big number\" that defines the genera.  Sure there's a reset but its not even necessary to complete the game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Tldr:  just no\n\nLong version: I finished the game start to finish in update 1.1, completed 100% of acievements and then continued the grind to get all pets and all items maxed. There are a lot of problems I see with the game.\n\nI played a click freeze-; a burn-; a poison-; a \"mid budget\" troll-; a physical damage- and a Light Spear build. The difference in their power is astonomical. With one build of them you one shot every boss (insanely low investment), one with higher investment and with others despite higher investment you sit there for 20 minutes to kill a mid-tier boss. Due to the way the game is build there is nothing you can do about this other than playing \"the best\" build.\n\nWe all know idle games, you one shot everything, get to a wall, use a ascension mechanic of some sort and get stronger. Not here. You fight these Bosses, most of their abilitys are not at all impactful and for like 2 or 3 of them they can litterally break your build. But thats fine for me. What is not is the pacing. You dont get to a wall, reset and then get stronger - no. You earn skill points [b] once [/b] when defeating a boss for the first time and then you spend them in a limited skilltree (with limited I mean there is a predifined number of passives to take). So when you got everything for a archtype you cant get stronger through that when hitting a wall. Instead you have to grind the items you need by killing the bosses which drop them. You need 1000 items to level an item to its highest rarity. On the highest difficulty you drop 2 loot chests with the item garanteed. So ~500 kills - not to bad you might think. Well that depends on the kill time. The last boss of the game needs to be killed 100 times for its hardest archievement - the second last one 400 times. You will probably not do them on max difficulty but even if you did you still did not finish the item.\n\nYou basically come to a point where you get a build together just to farm items which not requires you to actively click anything and leave it running on low level bosses to get the item to max rank you need for a build. Its just so boring! Killing the final boss with the right build is pretty easy, but then the game is basically over. There is no point to farm the items or farm skill points (you can get more every 20 minute as an exchange for ingame materials) because you most likely cant spend them. And when you see a 200+ passive points build guide dont let yourself be fooled. Two builds that I played could one shot the last boss in their highest difficulty and when I stopped I \"only\" had 147 passive points.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The demo was enjoyable so was hoping this was going to be similar to the demo but boy was I wrong about that.\n\nThe jist of this game is to basically grind out achievements to build a skill tree so get perks and upgrades. The problem is it takes forever to grind anything so doing a hard prestige will set you way back.\n\nI really tried to get into this one, but the grind fest and the massive walls you run into all the time.. yeah it might be for some but I'm about ready to call it quits on this one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If the price was $1-$2, sure maybe this is worth it. The advertised gameplay length is extremely inflated, and seems downright deceptive. The game was solved with everything that was in the demo, the rest of drops are useless and most gameplay consists of sitting there waiting for things to drop in hopes that they will improve gameplay. They don't and are just boring, and seem to have almost no thought put into them since 2nd boss drops are all that are needed to beat the final boss. Do not recommend, you will feel cheated by the cost once you realize how little gameplay there actually is.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "[h2]Grind >>>>>>>>> Strategy[/h2]\n\nEven if you come up with a great or creative build, sorry but stat check will be the enemy you have to face after each boss. Please afk and let it grind for a few hours. This is the gameplay loop that this game. Grinding is the one and only strategy here.\n\n\n[hr][/hr]\n\n\n[h2]Disappointing prestige system[/h2]\n\nOne of the most boring prestige system I have seen in these several year. It only give upgrade on numbers but no impovement on game mechanic or special upgrade for other system, plus you need to grind heavily for those meaningless upgrade. It really kills your interest on continue this game.\n\n\n[hr][/hr]\n\n\n[h2]My thought[/h2]\nKinda disappointed as the art style and vibe is not even bad. I just don't understand why it has to be so grindy when its not worth it. For [u]incremental games[/u] fans, this one didn't catch the spirit of incremental games, but only the cons. For [u]grindy games[/u] lovers, this is still not for you because it is just not worth your time and money in the current stage. There are a lot of similar game you can try before but this.\n\n\nOverall, I will rate it as [b][u]3.5/10[/u][/b] .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well this game is great in the beginning, but once you reach your first prestige the game starts to slow WAY down, the balance on the bosses on the later end doesn't even make sense from how slow you gain prestige crystals.\n\nGame has NO offline progress which is kinda bizarre for an IDLE game, the balance on the game in the endgame is atrocious, the boss rushes feel almost impossible after the third one.\n\nIn my opinion the game has the chance to be great if it gets updates, but as of right now I wouldn't spend money on it.\nIf the game updates and fixes these things ill change my review but as of right now the launch of the game isn't worth it.\n\nTLDR: The games balance is a huge headache, Game doesnt respect your time as an IDLE game, No Offline Progress.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game starts off strong, with plenty of new buildings and customization options that make it enjoyable to play. However, after a few hours, it devolves into a grindheavy experience where progression practically comes to a halt.\n\nAt that point, it becomes more of a background activity, just sitting there as the bosses gets taken care of by the slow poison build-up, with little interaction required from the player.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It breaks my heart to not recommend this game because I can tell a lot of passion went into it, but I cannot in good faith recommend it. \r\n\r\nI like 100%ing the incremental games I play, they're usually fun 1-8 hour experiences and have some neat gameplay or interesting decisions made by indie and solo developers. This game nails it, plus awesome art and music, until you get out of the early game. Like by the 5th or 6th boss, it's incredibly slow. I would've loved this game if it took me 6 hours to beat, not 60, most of that time of which was AFK just letting the kills rack up.\r\n\r\nIt is possible I had a bad build but I really don't think I did. I experimented with a lot, I soft and hard prestiged a bunch, I even reviewed guides to see if I was missing something. There are two core problems with the pace of this game:\r\n\r\n1. EIther boss health or player damage scales WAY too high in the late game, even some of the most optimal builds I could afford (more on that later) just took forever, especially when most bosses need to be defeated 1000 times.\r\n2. Actual progression in this game relies on Divine Gems, which aren't a paid currency thank nuts, but are extremely timegated. You need to wait 20 minutes to be able to purchase 2, and in the mid game especially its very likely you won't have what you need to trade, or you would be trading something far more valuable such equipment for a rarity upgrade.\r\n\r\nThe most recent update seems neat, but it doesn't really fix the core problems in my opinion.\r\n\r\nNo disrespect to the devs, this is a really neat and cute game, I enjoyed it especially in the beginning when I was present enough to enjoy all the different artwork and music; but with love, there are flaws.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game quickly turns from fun and interesting into a slow progression, where most of what can be done is limited. Shops reroll every 20 minutes and half the time the offers are just horrible. The reroll timer starts only after you hover over the shop, so you are forced to wait the entire 20 minutes before the next one. Everything becomes insanely expensive and take a huge time to farm. The items are interesting and it's cool to combo them, but you only have 6 slots to equip and getting new ones is veeeeery expensive. Could be fun but the devs wanted to stretch play time so much they ruined it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looks and feels fun for a while but ends up being a chore. \nI like the foundation and hope that future patches will improve on it and fix the completely off balancing",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's really, really, fun for the first hour. Then just completely lacks any momentum after day 1. Cool art, UI is nice, I didn't encounter any bugs or crashes, and has nice music. Just lacking content",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Like many others, enjoyed the demo and liked the art. Unfortunately, this idle game just falls short. I had to find a guide to end the game because I didn't know how else to progress. There isn't enough information given to you to piece things together, and every build I made just failed.\n\nToo much information is hidden from you. Skill tree can be found out by doing a hard prestige and fucking around in the tree, but for some reason they decide to hide it from you. Same with information you don't have buildings for. Weather isn't shown to you until later, which means you might be struggling because of the weather early game. Also until recently, a memory leak caused the game to take up all your system's resources, thankfully fixed.\n\nUnlike others I would have been fine if it was shorter for 5 dollars. It overstays its welcome and if you don't use exact combinations (which btw you have to grind a shit ton just to be able to use) I don't know how else you win.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pretty awful release to be honest. Demo was much, much more better. Even though the price tag was not worth it (5.21$ with 10% off for Turkey) I still wanted to go ahead and see what was brought up to the table. I have been playing incremental games for like the last 12 years and this was one of the most annoying progression feeling I have ever had in an idle game. Which again, on a rushed release is not a problem but the Demo was fine. So this can only mean one thing, poor quality. See you on another one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The mid to endgame (which you comfortably reach in around 5 hours) is completely broken, you have very few routes for upgrades and you'll still have like 4 or 5 bosses left to kill.\n\nDespite being an idler, it feels like a slog, you're ages between tiny upgrades and there never seems to be any light at the end.\n\nThe demo was a much better game, didn't outstay it's welcome and was well paced, the full game is unfortunately one of the worst games in the genre.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun in the beginning, but the progression shat its self 6 hours in of mostly idle gameplay. The only thing to do after 4 hours was wait, not wait and do stuff, wait and do nothing. It was a disgrace to run it on my pc at that point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is initially fun. It becomes a bit too grindy for me about half way through the game. That is another issue as well, unfortunately 'half way through' is about one day. Beat the game on the second day. That was it. After you kill the last boss there is literally nothing left to do except let the game grind and grind and grind into oblivion. There is such a small amount of content that in my opinion it is definitely not worth the $8.99 price tag. I cannot at this time recommend this game. Fun concept, however there is no 'meat' to this skeleton.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's quite repetitive and disappointing. The idea is you keep killing the same bosses over and over and you optimize your build by farming materials that they drop. The bosses do nothing, they are just PNGs with a health bar. Unfortunately the actual theorycrafting space is super cramped and the items take forever to farm (yes, I know it's an idle game), and once you bring them to max level, you realize that the build they enable won't even scale fast enough, forcing you to essentially start over. \n\nThe synergies you end up with are nothing to write home about. The usual \"developer was creatively bankrupt so they added fire/ice/poison elemental damage that forces you into mutually exclusive upgrade paths\". That's pretty much all the complexity there is and it doesn't even TRY to be different about it. Bosses with resistances and you with elemental weapons. Everything else is \"number go up\" gameplay and RSI simulator, with none of the charm of the original Cookie Clicker.\n\nSo while it could probably redeem itself, I believe that this is a $2-3 game at most, definitely not a $10 game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Initially really fun!\nBut the balance is off and the rebirth/respec tree is annoying, unbalanced and uninspired. \n\nLate game becomes incredibly tedious and going for full completion becomes a time wasting slog (afk farm 1000+ 10-35% chance droprate items)\n\nI'm sure if there are some updates and balance patches this will be a worthwhile game, but the price while fair is a bit steep,when there are other much higher polished and full experiences in the incremental genre for cheaper.\n\nCheck this game back out later.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I will say, it was a nice game, but the grind is not very tasteful.\n\nIt feels like a lot of the upgrades are useless. The light spears to me, feel useless unless you get items and skill points in them. At no point I felt compelled to even try the items because when I unlocked it, it was just bad, useless and doing no damage.\n\nThe items grind is plain boring. Why is it 1000 items for the last upgrade? It could be less as it is just leaving the game running in the background for 1-2 hours. You could make it 500 if you want to space out the upgrades. But the huge number along the low drop rates for some stuff make it just boring, distasteful and pretty much feels unfinished/rushed.\n\nThe max upgrades on some of the stuff feels weird as not even with talents you can squish something out of it.\n\nPrestige doesn't feel well thought of - you need to use resources if you don't want to hard reset, but if you hard reset, you get to the point you were at in like 5-10 minutes anyway, and that's it. You could just let people play with the talent tree at will. The costs are kind of high too at some point, as later bosses can be a slog to grind.\n\nAdvisors being locked - weird problem that sells prestige as a solution, but prestige is pretty much just a small hassle. I think they wanted to have a neat idea that just turned into a bothersome gameplay idea.\n\nThe game had a nice early game, but the late game doesn't feel that well thought of. Once you reach your first prestige, you can say you finished the game as there won't be that much more to do except bigger numbers, but there's no content after that, you will have gotten all of your upgrades and all gameplay changing things in a few hours and after... mindless grind that doesn't feel rewarding at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3-5 hours of meaningful progression and actual incremental upgrades, after which you hit a massive impenetrable wall that seems to require at least another 100 hours of boring grinding to actually complete the game.\nThe prestige tree forces you to pick between bad and even worse nodes - you can't unlock everything.\nCould be good, but needs a huge re-balancing of everything somewhere past the mid-point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Before purchasing I checked estimated play time etc, devs said 3 days to kill all bosses and like 1-2 weeks to max everything. That's not true at all, just one evening of about 7 hours and I had already maxed all possible means of recruitment damage and was about 70% done on upgrading equipment. You also hit a wall with the last 4 or so bosses as everything is upgraded to the max but it still takes 20+ mins to kill the last couple of bosses because of over inflated health pools.  I would not recommend unless there is more content",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The fun falls off hard after 5-7 hours. Everything after that point is a massive, un-fun grind for minimal upgrades. The prestige system is also pretty lame, relying on achievement progress to get spendable points, meaning once you get through the easier achievements all that's left is the very grindy kill the boss 100 to 1000 times. The last nail is the damage ceiling and falloff of all forms of damage dealing, meaning after you get to a certain point of structure upgrades there isn't any meaningful ways to increase damage. This damage ceiling leads to unbearably slow bossfights as early as 3-5 bosses before the end meaning the only way to beat them is to leave the game running for long periods of time, all for small meaningless upgrades.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Treat this like an \"ehhhh\" rather than a yes or no.\r\n\r\nThe game mechanically is great, I love that each boss has a loot table, I love the weakness/strength mechanic on the bosses, I really like the boss designs and everything like that. The pace of this game is absolutely glacial and having spent 14 hours in game, most of that has been farming for item upgrades just to do *slightly* more damage to a boss that's already taking a long time. Once you've conquered that boss, onto the next one with a new mechanic. If the problems with pacing were sorted (as well as the current memory leak issue) this would be a solid recommendation, but until then I'm uninstalling and staying away",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like many others, bait and switched by the demo. Demo felt great, actual release was just like \"look at what they did to my boy\" simulator. Nerf. Nerf. Nerfs all around for everything, everything nerfed. Everything slower. Drop rates nerfed, but you need MORE items. Much more micro added, despite it being an idle game, AND now everything takes longer but wants you to pay attention to it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game has a hard barrier at around 5/6 hours into it, making it realistically impossible to progress without putting the game on the side for a full day.\n- Balancing is not good, stuff that is expensive towards the end adds flat damage that basically does not change anything\n- Farming resources is annoying because there is a respawn delay (which you can lower, but not enough in my opinion)\n- There are no buttons to purchase multiple upgrades at once (which is kinda easy to make and is a key feature of almost every incremental games especially with prestige)\n- Most of the items are bad and/or useless\n- Most of the skill tree is useless\n\nPros:\n- Some cool ideas, overall design is fine, the 5 first hours are fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Edit:\n\nThe devs have released balance updates/changes and somehow the game is even worse than it was in the first place... I don't know what to say. It's a full on thumbs down at this point. They nerfed things that already weren't even relevant, so God only knows what the hell they're thinking. What's the point of a game like this if only one or two builds will ever amount to anything? I wish this game were even remotely fun... I fully, wholeheartedly wish I'd skipped this purchase. 9.99 seemed like a high price for what I was expecting, but for once I was the idiot who made the purchase since I was hopeful... Never again, I guess.\n\n\nOriginal review:\n\nI'm somewhat in a sideways thumb position currently for this. It's a neat concept with how it integrates music per boss and has nice art, but I really imagined it'd be... More than what it is. It's a game you leave open with no offline gain which isn't bad on its own, but it's definitely frustrating that it launched with a bad memory leak lol. That's not why I'd leave a thumbs down, however. The scaling is a bit inconsistent, and a lot of the mechanics and numbers don't feel like they're explained well enough. For example, there are prestige nodes that increase your poison damage by 5,000 and 25,000 if I remember correctly, but my poison damage was already dealing billions if not more by the time I'd reached the second one which had me wondering why it even exists. Is it an increase to the BASE damage? Who knows because it's not well documented. There are multiple things like that, and honestly the grind for money quickly devolves into just having your farm make money because the money from bosses isn't worth it and then lots of the grinds just kind of fall off in terms of being \"fun\" or \"satisfying\" to complete.\n\nI'll have to toy around some with different builds probably since mine seems to have fallen off the face of the planet, but we'll see if I actually start enjoying this game more. For what it is, the game feels grossly overpriced at 9.99 considering what the actual gameplay/loop is, but we'll see if my opinion on that changes or not. I really was looking forward to this and thought the price tag seemed a bit high for what I was expecting, and so far it's been worse than I expected.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have 3 bosses left and no upgrades left. Very odd, but I'm assuming the dev missed adding something. \n\nI'll have to not recommend it for now but it's pretty close to being ok.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly not really worth buying. There's very little content in this game, the prestige system is boring and you don't really feel the rush of number go up after like 2 hours anymore. Also Achievements are broken on Linux",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant give it back, after 5hours gamefun ended, i join the other reviews. Dont buy ist.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The same sentiment as many others have expressed - the game starts off fun and then after a couple of hours, it loses any and all momentum and becomes a slog to make progress. The end game balancing is dreadful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun at first, but really starts dragging after a few hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Most other reviews mention this but that's because it's true - the demo was fantastic, but the real game has too high of a price for not enough content. You can quickly cheese through all bosses in a few hours with the Ice Whip build, and there's nothing meaningful to do after that. \n\nI've played to 100% and it isn't worth it, you pick one or two meta builds and then sit there doing nothing until 1000 boss kills. Meaningless grind is not content, it just racks up the Steam playtime and makes the game look longer than it is.\n\nI like it, but it either needed to be half the price, or five times the content. Buy it on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Cool concept/shell but didn't feel well executed to me. Hopefully updates make this into something great.\n\nThe review regarding the issue being \"stagnation\" feels very real to me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It looks like a huge nerf wave happened that left about half of the mechanics literally useless. Might get fixed in the future.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dont change your skills from soft to hard. It will delete your town and u loose are your work. I lost like 4 day play time just like that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It quickly becomes boring in the mid-late game. The incoming power creep doesn't feel gradual, it feels like going from 25->30->40->1000. One second you have everything maxed out with the money you're currently earning- all the damage you can possibly do, a great build with MAXED out related items boosting your build, and then the next you're doing like, no damage on a level one boss. And upgrades don't feel like they're following that progression or closing that gap, nor does the upgrades in the skill tree. I was shocked when I maxed out how much money my farm could make, and I still had four bosses I hadn't gotten to beating and farming yet. \n\nThe addition of up to 4 levels of a boss doesn't feel like it helps that at all? It's cool for farming items when you can kill the 4th level boss quickly, but it doesn't solve the sudden and drastic jump to really strong bosses and no monetary gains to follow it.  \n\nIt feels like, from reviews, there's likely *one* good build you're *meant* to use that I clearly didn't have (I was built around fire dps and crits). But EVERY build should be viable, should feel balanced, and should be fun to play with.\n\nOverall, I'd give this a mixed if Steam had that option. The art is really cool, the boss designs are awesome, and the early game is fun. It just stops being fun during the period you'd be spending the most time with it, the mid to late grind, so I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Starts well then grinds to a halt with a very odd prestige system.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has potential, but there's a single serious flaw. Stagnation.\nIf you play for several hours, you slowly grow bigger and better. But at some point everything just runs to a halt and things stagnate. I had a solid 2 hours of fun, the remaining 16 hours felt like pain...\n\nEventually, you'll unlock the \"prestige\" system, which is nothing more than a fancy reset button. It does not bring you any increased benefits if you were to prestige multiple times like you would in other idle games. Instead, the game wants you to read up on all the skills, perks, equipment, to then try to find a \"build\" that should break the game. But from what I hear, the developer seems to nerf builds occasionally so it gets hard and harder to progess.\n\nAnd eventually, the ONLY consistant way of progressing, is by waiting 20 minutes, and then buy a prestige point from the shop... And with 2 shops, that's 6 points per hour at most. And that's assuming you have the materials to buy them, which you likely won't. And you don't need just 6 points... you'll want to get 200+.\n\nEverything in this game is designed to slow you down, nothing makes you feel strong. if something makes you feel strong, it'll get nerfed. You'd think they'd just move the goalpost further, no. instead they shoot your kneecaps to prevent you from progressing.\n\nIf you like excessive reading, and constant min/maxing while attempting builds that each may take HOURS to figure out if they work or not, then sure, this could be a cool game. But for the vast majority of people... this aint it.\n\nedit: \nMy original review was made on 18 hours. Because I wanted to give the game a fair chance, I went to their discord to get more advice and tips/tricks... this did not change my opinion of the game.\nI am currently just finishing all achievements. and all hours past 18 are essentially done AFK because the only way to progress, is to hit a button every 20 minutes to get more prestige points... and you need to do this... 60+ times. So yes, this WILL increase time played, and no... it's not fun.\n\nFinal time for 100% of all achievements is 36h, which would be cool, if the game was fun past the initial 2~3 hours. Which it was not.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "really enjoyed the demo but the full release is so weird with its upgrades and stuff after just like 5 hours of playing im reaching \"max\" on basically everything but theres like 5 bosses left to go and no clear way forward",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "game is fun for a couple of hours, then it becomes a grindfest that you have to keep the game running for dozens of hours to farm material for the worst prestige system i've ever seen on a idle game.",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "I wish I can give the game a \"neutral\" review.\n\nThe game is \"fun\" but it really needs better pacing and a better end-game system. The Prestige system needs an overhaul. Considering this game $10 base, I'd expected more because I've poured more time in cheaper or free idle games that had better systems.\n\nI managed to get all the achievements, some require alot of time and you actually need to pay attention for some like the Meteors click, but I feel like there should be more. For example, the Jack of All Trade: \"Reach a Bronze start in 6 different Arena Boss Rushes\". Why isn't there a Silver and Gold versions of this? is this a sly way of artificially adding/increasing game time since we cannot earn more Divine Gems with these missing achievements? After earning all of the achievements we're forced to keep looking at the shops every 20mins or so to earn more Divine Gems. There are so many achievements the dev can add to increase the gain of Divine Gems but most likely will refuse to do so until a better Prestige System is released.\n\nTo me, I think the $10 should've had way more content initially because it's essentially just an idle game, and the dopamine hit for most idle games is prestiging and advancing everytime, but you alas the end-game content is non-existent.\n\nI say wait till the game goes on 50-75% off or after like 5 huge updates because currently it's not worth it the price tag for the amount of content there is.\n\nI'll change my review once the game has been updated properly and the $10 price tag is justified.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "The demo really got me hooked, and I expected there to be a lot more content. Unfortunately, after finishing the game in about 25 hours and completing nearly everything it has to offer, I can’t recommend it.\n\ni love the item system and the art design but an idle game with less than 30 hours of content..,it’s simply far too short and lacks long-term progression or an real endgame.\n\nThere is better Idle games which cost less / free that have more content and depth",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Satisfying progress at the beginning, then it turns into a flat grind for the last few bosses as you try to collect divine gems and upgrade the gear you need.  Boring and slow.  Additionally, there's a massive memory bleed because the dev apparently has no idea how to, or interest in, learning how to have the game release memory.  It'll use up 30 gb of ram in less than 6 hours, so idling it is even more of a grind.  I'd say avoid until at least the memory issue is fixed.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "This game feels like an idler game which is trying not to be one.\n\nMajor upgrades cost citizens, and once you upgraded it, you can never get them back, this would be fine, except that your citizens have a cap, and it's impossible to upgrade everything, you can only really focus on two different races(warrior,troll,bird etc.) since even their damage upgrade cost 20 citizens.\n\nAnd the 'hard reset/rebirth' function is atrocious, your weapon and phoenix experience also gets reset back to 0, especially the phoenix, since to level it up you have to manually click on it, resetting it's progress again.\n\nI can guess why the developer made it this way, to make this game more 'strategic', which comes to my first point, this is an idler game, why does it need to be strategic? What is wrong with being really brainless and overpowered?\n\nAnd the boss before the last boss is so unsatisfying to fight with. It's ability locks your items, which made the fight way longer than how other bosses are.\n\nIdler games are supposed to be satisfying, yet the game design seem so unsatisfying. \n\nAnd the recent update made this game even more unsatisfying to 'play' with item nerfs, I feel like the developer is trying to make this game have longer playtime by dragging the fight longer, but that just made me feel less likely to play.\n\nThe unsatisfying factor outweighs the satisfying factor of an idle game in my opinion.\n\nIn my opinion, ways to improve the game:\nRemove the citizen cost for upgrading.\nDon't reset phoenix's level when hard reseting.\nKeep the original pre-nerf clock's ability, but make it so you can only get to this at max level.\nChange the eye boss's ability.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Demo was the best part\nFinal upgrades to items that cost 1000res have almost zero impact on the game and are mostly designed to just waste your time\nBoss rush? More like boss crawl",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "Played the demo, bought the full release and refunded it.\n\nWhen upgrading in the demo, the balance felt good like I was making steady progress and hitting breakpoints with the farm and my damage, but the full release completely scales the cost/benefit of upgrading unreasonably.\n\nThe cost of everything is ridiculous, at 9 warriors you now need to spend 40k to get a 10th, the farm costs like 100k to upgrade from 4k gold per harvest. The cost basically jumps a multiple of 5-10x for no reason. You cannot just buy units anymore cause after around 10 of any unit the cost of the next then sky rockets. I was upgrading a unit and for some reason the cost goes from like 40k to 600k? Like wtf?\n\nPoison is also no longer useful in the earlygame and only really useful in the later stages because you have to stack 10 times more poison each time, 7/77/777. I get this fixes the issue of poison originally being useless in the late game, cause 3000 damage becomes nothing, but in the mid game, you never get the poison stacked to 777 and by the time i stack to 77, the boss is almost dead already.\n\nDevs lost the plot thinking this is a AAA title that needs 30 hours of gameplay, and I heard it will take you 30 hours to complete this grind. Why? Increasing timers and slowing progress just isn't fun, the demo felt way better at pacing. \n\nTLDR; The demo respected your time, and the full release doesn't.",
      "voted_up": false,
      "votes_helpful": 159
    },
    {
      "review": "At first, I enjoyed this game, it was promising. But already, a few hours in i realised, that this game would not last long.. The progression walls in terms of damage, and limits in terms of time consumed to progress, as you can trade potentially to get a gem for more skills, every 20 mins is seemingly pointless, because, you can maw down the bosses and be done w the progression of killing all the bosses. The rewards for, doing the Arena, seems kinda pointless, as the timers gives you seconds/a few minutes, to get some materials, but before you get to a point where you can kill these bosses that efficiently, you probably already farmed the living s**** out of them, and the resources you get, makes me question why bother? in any case, i have thousands of thousands of hours in idle clicker games, I enjoy the genre a lot, this game strikes me as half finished. I have 110 hours now, mainly because i just let it farm for the pets you can get.. but that is the only reason.. in a few more days, there will be nothing left. and I find it sad, that my review is a negative one. I hoped this game would keep grow and give us interesting new things to experiment, and honestly, i was hoping for a lot more boss encounters. It came up, as a game that was promising \"endless possibilities\" but they are not.. they are very quickly capped..",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "The game needs more content and the ability to max everything out especially since there is no offline mode progression. This is a fun concept that I want to keep playing yet it falls short on the idle promises.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "This one needed to cook longer. The progression system was altered too heavily from the demo, which gives the game a completely different feel in a bad way. Late(r) stage rewards and unlocks seem to be an after-thought, as they're not tuned to scale with what your average damage per second should be at that stage of the game, making them completely negligible.\n\nThere's also the sticky situation of it being an idle game with no offline progress, but having what I assume is a memory leak. It eventually consumed double the amount of resources Chrome does, which is impressive.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "After 100%ing everything, I can say most of my playtime was pretty boring. After clearing the game once by taking down the 13 bosses (which really only takes one prestige), the rest of your game time is going to be taken up by grinding. You need at least 600-700 kills on each boss to guarantee max rarity, and more to get the materials to max them out. \n\nThis is 90% of the content in the game. Builds range from \"one-two shotting the final bosses\" to \"potentially taking half an hour per kill\", meaning that not optimizing just feels like a giant waste of time. At the top end, there's really only two viable builds. There used to be more, but they snapped the game in half too much and were nerfed. So the main selling point of theorycrafting builds is pointless because there's no incentives for anything other than speed kills.\n\nThe power spikes that you get in incremental games that give you dopamine are very rare, with them coming only from item rarity upgrades and progressing in the skill tree. Progressing in the skill tree is odd, as the most effective way of doing so is to stockpile a bunch of resources and then getting the funds as quick as possible to purchase the buildings that let you buy more skill points. This means that  it both incentivizes speed kills and also doesn't really let you toy around with builds.\n\nI didn't even bother doing that, so it took me 76 hours to get everything done. However, I was paying attention for only 5 of those hours tops.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I wish I could give this game a “mid” rating - because that’s exactly what it is.\n\nWhy even bother adding 0.1% chase items when they’re completely useless? That was such a disappointing realization.\nProgression is interesting but never really shines. Builds feel unbalanced across the board.\nHonestly, I just wish there was more of everything.\n\nThe skill tree is fine, but I wish I could actually see the whole thing and expand on it properly.\nIt’s kind of weird finishing the game before even unlocking all the skill points. Took me about four days to finish, which just feels too short for something that had so much potential.\n\nAnd why are there so few collection rewards? I had four legendary items and the collection was “complete.” Like… what? Where’s the grind?\n\nAs for builds, focus on poison soldiers early, then switch to light spears when you can. Fire builds? Absolute trash. Only use fire if you need to grab the two “light” items, then drop it immediately. After that… that’s basically it. Game over...\n\nThe game showed real promise, but in the end… it just didn’t deliver.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "It pretends to be interesting, but the prestige mechanic is quite punishing, and the game goes out of its way to hide upgrades from you. The game is also quite memory intensive, which is annoying, as it does not include offline progress. I had a couple of crashes, while trying to farm materials for one of the legendary items. The challenge mode seems made just to tease you, I finished the game having only done two of the 5 or so challenges. It has a cute artstyle, and the music is good, but ultimately I did not enjoy it too much.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I can't recommend this game due to how little content there is for a non free idle game, the Dev estimated that it would take 3 days to beat all the bosses and 1 to 2 weeks to get all achievements, however i was able to get all achievements in 64 hours (and this could be faster if you were only going for those achievements)\n\nThe content that goes beyond achievements is basically just grinding to max rarity / level all equipment and getting all boss pets, this wouldn't add much time on top if i were to go for this, with only the final 2 pets remaining\n\nThe other problem here is the progression you would normally expect from an idle game is over extremely quickly, once you can kill the last boss you are not going to get much stronger and you are just achievement hunting.\n\nThe art and music is really great in this game, but not enough to carry the issues it has.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Kill the boss until you fully upgrade his weapons to legendary > move to next boss and repeat until you hit the end game slog",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The game’s fun at first, but it really lacks content.\nWithin minutes you can do almost everything, and in about an hour you’ve maxed out all features. After that, there’s nothing left but waiting a few more hours to beat it.\nOnce that’s done, there’s literally nothing to do except grind for achievements—which you can finish in three days.\nThis should absolutely have been released in Early Access.\nIf you’re thinking of buying it, wait for some substantial content updates that will let you enjoy it for more than just a few hours.\nThe bosses’ artwork is the only thing it does well (and the reason I bought it), and I really have to give credit to the developers for that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Whats the point of being an IDLE game if you close out the game and come back to no progress? The idle part only works if you have the game open - defeats the purpose of an idle game tbh",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "There's 2 types of idle games. Ones that end and ones that grind to a halt to hide the fact that there's really not much to it. This game is the latter. I wish there was a \"it's fine\" option but for the time being this a no for me. There is some cool build variety but in the end it doesn't matter because progression becomes so slow that it's a pain to ever experiment or do anything but the meta build.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have to preface this saying i have 10k hours in ITRTG, finished NGU idle, 7k hours on Galaxy idle, 5k on Your Chronicle. And i have to say, tying the prestige mechanic to achievements is one of the dumbest ideas i have ever seen on and Idle game, it makes game pacing and S.T progression feels awful and like a grind in the worst way possible for an idle game. Its quite a shame since the equipment idea from boss farming is quite nice, but it just feels like this game has no content and they are masking it with deliberately slow progression so we dont realize the shallow mechanics (just items, ST and the buildings)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I won't beat a dead horse although I do agree that the sudden choke point creates a lot of extra annoying grinding and the upgrades feel less and less impactful as the game goes on.\r\n\r\nNo my main issue is the fact that there is not a regular cloud save that happens. that you have to quit the game  or save manually. \r\n\r\n3 days i had the game open and grinding. My game crashed after i upgraded something and it wiped the entire progress. Cool game, cool ideas, cool graphics, and a really cool upgrade system. \r\n\r\nBad pacing, horrible artificial increase in game length, bad save system.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Quite a sad situation we have here. Coming from the demo, everything looked nice. Progression and bosses felt well balanced, artwork and UI are good. Sadly the full game does not really build on this foundation. Progression continues a bit further quite well, but then you're stuck. Unit upgrades takes way longer, while the impact doesn't scale. Only way to progress later on (killing bosses, but also quickly killing bosses for farm) is to level up items and skill tree (called hard and soft prestige). For the items you need to farm the bosses and that for quite some time. The later bosses have annoying mechanics (without any good counter) which stops you from efficient farming and you require 1111 of each item to fully upgrade, with a ~20% drop chance. The skill tree requires tokens, which you get from achievements and can buy from items you farmed. The more you have, the better your build can become. With soft prestige you can only extend your current skill tree. If you want to fully reset the tree, you can do a hard prestige and reset your whole progress except items and prestige points. While you can easily come back to around 4/5 of the progress, the last part takes forever as scaling is so weird. Then again it does barely matter, as 99,9% of the damage is coming through elemental damage from the items, thus many upgrades for units are completely useless, especially damage, as it does not scale.\n\nI played similar games for much longer, but somehow they did not get boring, as progression always brought great new stuff. This isn't the case here and such I cannot recommend the game. At the point you finally have enough points and item levels to create a cool build, you have already solved everything there is in the game. If they would increase the progress a bit in the current \"end\" game so it doesn't get that boring and instead develop something challenging to tackle if you got all the items and skills, I could recommend this game. In the current state you've seen the best of it after you've played the demo.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game's balance is fucked. You reach a point very quickly where everything is maxed because the game only goes up to Quadrillions and everything has hard caps. The last 5 bosses force you to stagger slowly through them unless you use the Ice Whip, in which case you absolutely destroy all of them, the final boss' ability doesnt even matter because that strategy doesn't require units. Prestiging feels like ass because your prestige currency is tied directly to the amount of achievements you get, or ludicrously priced trades in the maxed out traders. Overall,the game is very short for anyone experienced in this genre, and isn't even really \"idle\" as there's no offline progression.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not only some units are completely superior to others, there is almost zero synergy between then. The last tier of items are extremely grinding and uninteresting. Felt like a big waste of time. Even for idler standards.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Summary:\nGame was interesting at first but then it just became monotone and boring because HP scaling for boss is kinda crazy as you move towards the end. Lack of mid to end-game content. \n\nDetailed Review [Spoilers]\nPros:\nInteresting concept\nVariety of Builds based on choice of items and skill build\nVery fun early game\nHard and Soft Prestige concept is nice\n\nCons\nGame starts to get boring during mid game\nSkill Tree is lacking\nSkills/Summons/Units and their respective builds are imbalanced and lack tuning hence resulting in a cookie cutter build(s)\nPrestige System is lackluster because technically it is just a skill reset, it fundamentally provides no substantial benefit.\nBoss skills is a good concept but imbalanced and lack tuning resulting in ridiculous scaling, for example, Hexgaze, the 2nd to last boss, locks one of players equipped items. Not a problem but at level 2 of the boss, it has a 40 second cool down and when you go to level 3 it has a 1 second cooldown, at least based on the tool tip in-game.\nLack of Offline progession..... as an idle game.... this is....a nono.... at least cap offline progession at a set limit maybe 10 or 12 hours\n\nIn-depth Analysis/Review (mostly for devs)\nPrestige System\nHow should I put this, the system is really underwhelming, over roughly 100 hours of game play, I only Hard prestiged twice, and because the skill tree is so limited in comparison, the existence it has in the game is almost something you can do without.\n\nImbalance/Lack of tuning with respect to Equipment Synergy And Skill Tree Builds.\nI believe that the game would be more fun if all the units/items and their respective synergies all worked just as effectively before taking into consideration boss resistances/skills. My opinion is like this because the skill tree is really simple, the progression is linear and the only flexibility you really have in the game is the type of builds you have, while early game it does not matter much, personally I find that as you move towards the end of the game, there is only one or maybe two skill builds that are efficient hence resulting in cookie cutter builds.\n\nLack of content\nI think recently the standard on Indie games have risen immensely and I believe that this game is really not worth it. Although I have played for roughly 100 hours, technically speaking realistic gameplay is only maybe 4-5 hours with most of it in the early game and me just AFK waiting for resources to roll in, to press the upgrade button once.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}