{
  "positive": [
    {
      "review": "I have played this games since it came out, stopped for a while to play ASA, eventually decided to come back because it isn't a computer murderer to run this game versus ASA. Plus I get to still play with some mods I have always loved like the Paleo Ark mod. Overrall, love ASE over ASA. Much better game.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I am writing this review after decades. So i am only rating the game based on what i felt after all these years. Not like it is today...\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n☑ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☑ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☑ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This game has held many memories for me. \n\nI first played this game back in MIDDLE SCHOOL. Over time me and my friends set up our own server with my shitty backup PC and we played on xbox for SO LONG during that entire school journey. Really up until college, then we faded out.\n\nFinally, after a while we decided to set up a server and play on steam. This game is dogshit. It will not run well on any PC you throw at it, whether you like it or not. Setting this game up is a  pain in the neck, but once you do, the memories start flowing and you relive everything all over again. \n\nThis game is complete horseshit and will forever anger me, but at the same time.. it has some sort of charm to it. Something that keeps me and my friends coming back after so many years. I started this game a man and became a woman and am STILL PLAYING it (with very long breaks in between).\n\n73/100 - I will kill myself",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "ARK is the only game where I spend hours taming a dinosaur, proudly ride it for five minutes, and then watch it get obliterated by something that looks like a lizard with anger issues. I starve, overheat, freeze, get kidnapped by flying birds, and lose all my stuff at least twice a day. It’s buggy, brutal, and somehow the most addictive prehistoric torture simulator ever made.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the game is great and for being old its amazing its worth the price and the graphics are great",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "played since 2014.... full of bugs and overall a janky experience but nothing else does ark better than ark. 10/10 love my alien game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily one of my favorite games. Mechanics can be seen as \"janky\" to newcomers. Not for the faint of heart. Highly addictive with a moderate learning curve. Since official online servers are no longer supported, best played with a group of friends on a private server.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "super duper fun and i say that everyone who likes the things that this game intales should give it a go as its not bery expernsive, but it takes up heaps of storage and i dont know why it does take up that much space, i had to delete some apps and game to download but oh boy was it worth it, however i think that the main reason i like this game is that they have a very open map and that these said maps vary in difficulty, i enjoy the map thats centerd around the gods, thats a good one. along with all that i think that the main point around getting this game would be because of the dinosuars, this is a very fun experience and everybody who is interested in them should 100 percent give this a jolly old go! a trey even! maybe a jump or leap of faith if you will but if you think that this isnt worth it ill tell you it most certainly is!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a great game with amzing visuals if you have a good graphics card but it is 450+ gig for everything so you need to be commited if you want to play fully",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love farming materials in video games. A key aspect of this game is farming—therefore, I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but optimization Is SOOO FUCKING BADDDS, dont install it unless u want brain damage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is definetly a new experience in Survival-like Game, where you could go toe-to-toe with Dinosaurs and even tame it. Gotta catch em all~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have always liked this game since its release in 2015, and it is indeed my favorite game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game for a long period of time. It's glitchy, poorly optimized, and Wildcard tends to ignore the community's needs, but the player base still makes the experience worthwhile...despite frequent map glitches and random disconnects!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game i wish the servers never went down and look at the sun if youre new its not bright at all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Day 1 spawned, Died 10 sec later. Respawned lived for 1 min died to raptor. Respawned played for 800hrs. Love the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pain and suffering incarnate. Every time I try ARK I feel like Sisyphus, rolling myself up the mountain in a perpetual pursuit of my items, every climb, stunted early by the overbearing jaws of Hyenas and Sabertooth Tigers. This game consumes you, eats you whole. I love every second.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ark Survival Evolved. The most epic family friendly adventure possible! Fitted with a extremely talented and gifted community of souls that drive the game further. Pushing the boundaries of what can be done in the game through modding and map development. Its strange how much I love it, like a gem I never knew I had, until now. I highly recommend ark to everyone at home, its a very well made game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for farming and taming, can also involve som PVP if you're interested, very good storyline, beatuful maps and a great multiplayer game, a lot of teamwork and effort is needed to strive in this game, the hardcore mode is not for simpleminded people, be ware",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found this game really fun its good for beginners has alot of adventures.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seru tapi gaseru, optimisasi game nya dari dulu gapernah berubah, bahkan device high end tetep 60fps di settingan high, optimalin lagi game nya pasti nambah seru",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game Gives me excitement that I haven't felt in a long time. That say something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everything is good except for the map, need better location",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated nostalgic old game. Lot's of content and brings back old PS4 memories. %100 recommend playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is designed for multiplayer, but plays decently well in singleplayer. Process of initially building up your base, crafting gear, taming animals and exploring the map is really fun and exciting. The high chance of death when exploring and dangerous creatures lurking in the map always keeps you on your toes, no matter how far into the game you have progressed. The story is surprisingly interesting and I love the fact that you have an actual end goal - killing all the bosses. The soundtrack is easily the best thing about this game, it has blockbuster movie levels of production quality.\n\nHowever, some of these mechanics can become quite tedious near the lategame-endgame section. Crafting recipes end up becoming really expensive with no major ways of making the resource collection process more efficient. Dying to random bullshit becomes much more common and retrieving/recrafting your items turns into a massive time sink. There are a lot of bugs in the game, and while 99% of them are not game-breaking, they still detract from the experience and make things infuriating when they really shouldn't be.\n\nBut to be honest these issues only really exist because you're supposed to play with others, so I would highly recommend playing this game with friends. Most of the mechanics are balanced well in singleplayer, with the default single player settings. The only major exception would be the Snow Cave, which was basically impossible for me to complete alone without God mode - Enemies are so spongy and bringing a group of Theris is really difficult given how they constantly get stuck in parts of the cave. Mods may fix these issues, but I wouldn't know since I only played vanilla.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "moved from epic Ark to here,nothing to say if ya like dinosaurs and numbers play ark and breed dinos and muatte then to max melee and stuffs, the building freedom in this game is insane 100/100 recommended but pls fix Aquatica related Bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game brings unimaginable joy, especially when you lose everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Better with friends and mods. Super glitchy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, in  all my life, there never was a game like ARK: survival evolved. Not even close. This is the absolute best game that ever existed, and ever will exist. This game is near and dear to my heart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a good game,its hard but not extreme.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My point of view is someone who had never played this before, somehow missing / ignoring it the last 10 years!  So, I don't have any frame of reference for the drama around Aquatica release, the mod situations at that time, etc.  That said, my wife and son and I have spent the last 45 days having a really fun time in Ark on the Island map with our own private server.  We are up to 14 mods, and even though many haven't been updated in years, the ones we use all seem to work fine on the current Aquatica branch of the base game.  It did take quite a bit of work to get our INI files and mod situation sorted at the beginning to give ourselves a fair challenge but not be so grindy.  Boosting stack sizes and weight stat gains in the INIs was a huge QOL upgrade, as well as overall taming / breeding time reductions.   After 45 days, we've beaten the 3 Alpha bosses but haven't yet tried Overseer, hoping to do that this weekend.  Overall I think this is still a very fun game.  My only real complaints are around the building system, which is far more archaic and annoying compared to the games that came later in this genre.  I'm hesitant to install a building mod though, as I've read horror stories of the mod failing to load or other glitchy behavior and losing all your buildings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ARK is so good and I recommend it so fun because you can play with your friends or by yourself and you will get a good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have over 1500 hours on this game on ps4 and it is one of my favorites of all time even though they are really bad at doing anything good to this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ARK: Survival Evolved is one of the most chaotic, addictive, and unforgettable survival games out there. You start with nothing, tame dinosaurs, build a base, and slowly turn into a prehistoric powerhouse — if the wildlife, other players, or the environment don’t kill you first.\r\n\r\nThe highs are incredible: riding your first raptor, building massive forts, taking down huge bosses with a team of tamed creatures. The sense of progression is unmatched. But the game definitely has rough edges — bugs, performance issues, and the occasional frustration of losing hours of work to a surprise T-Rex.\r\n\r\nStill, no survival game matches ARK’s mix of creativity, danger, and pure “did that just happen?!” moments. If you’re into survival crafting and giant prehistoric chaos, it’s an experience worth having.\r\n\r\n9/10 – Wild, buggy, brutal, and absolutely unforgettable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game on itself is very good, tho i need to say, if you have a friend, it becomes even better, but be careful, they are leaving this game completely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ark, is honestly the second best game i have ever played. The main reason for this is not just my love for dinosaurs, But the fact that this games story building, compelling lore, and dynamic gameplay that keeps me coming back. I cannot undermine the fact that this game has so much content packed into it that its shocking how much this game has to offer, This game is truly a 10/10 game. (also snail games sucks)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hard at first. But when you get used to the game, it is a lot of fun and can play with your friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun and especially for people who love dinos and farming, but also good for people who like survival",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So im not going to lie if your playing on this on a windows 10 computer (which is mine) its very laggy but thats why you can adjust the grahics. in th beggining of the game i'm telling you if you arent a pro you'll be scared so thats why you should try ato a get a parasaor (sry bout my grammmar) so its less scary and its easier for you to kill things. overall i rate this game a 4.5 out of 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ark was my childhood. It was one of the most fun and most played games. I have hundreds of mods and hundreds of hours. I got every achievement and got every dino. I'm am only putting this as a yes because of my days I use to play. I tried to play it once again now but I can't. The game is a laggy mess and I had to get rid of all my mods and it somehow made it a bit better but I cannot play the game anymore. I can't make a server with my friends without my game crashing every time. I had to restart multiple times because it crashes and wouldn't close. Task manager wouldn't even work. I miss the old days man. All those youtubers. The mods. The dinos and the friends. I really loved that time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mods Carry this game if you dont try mods in this game whats the point. Primal Fear Peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly alot of bugs and poorly made, but somehow really fun when your playing with other people. Takes up an insane amount of storage though. Also new one takes like a space shuttle to run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cause pain but to addicting to stop playing the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hmmm. This game is a unique and well story telling game which personally i would enjoy for at least 100 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive had trouble with the loading screen but i got how to fix it and the game is pretty good itself even after nearly 10 years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ARK: Survival Evolved is a large open-world survival game where players must gather resources, build bases, and tame dinosaurs in order to survive in a dangerous prehistoric environment. The variety of biomes, creatures, and items keeps the gameplay interesting, while breeding, boss fights, and technology progression provide long-term goals. Playing with friends on co-op or PvP servers makes the experience even more exciting and unpredictable. However, the game is heavily criticized for its poor optimization, frequent bugs, long loading times, and occasional server problems, especially on weaker PCs and consoles. With better performance, stronger stability, and a more polished user interface, ARK could reach its full potential as one of the best survival games available.\n\nWell, there are several significant downsides.\n\nVery poor optimization – even powerful PCs can experience FPS drops and stuttering\nLarge number of bugs and glitches that can break gameplay\nExtremely large game size and long installation/loading times\nFrequent crashes and server instability on official servers\nUnbalanced gameplay in PvP (experienced players dominate new players)\nComplicated and sometimes frustrating inventory and crafting system\nSteep learning curve with little in-game guidance\n\nPS:and it's a very interesting game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for co-op, I use Ark Server Manager to host a private server for myself and friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "juegazo, lo jugaria dia y noche si pudiera, he visto juegos buenos pero esto ya es otro nivel de juegazo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd rate this game 6 out of 10. It's a lot of fun to play but it can sometimes be quite buggy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "massive catalogue of tamable creatures with multiple maps with tons of content and TONS of mods.\r\nbuy this instead of ASA, it runs better, is much more stable, has more content and is not trying to sell you bad dlcs for single creature for 5 bucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, even with its janky and bugged out gameplay. Although I havent even played it for 200 hours, I'm addicted. The soundtrack is absolutely beautiful (thank you, Gareth Coker).\n\nBut it is badly optimised (to the point where even the base game is so large I have to delete most of if not all of my other games if I want to play this), and the graphics would be great if I could run them at over 10 fps (I have a low to mid-end PC, and would not recommend playing on anything less than 16gb RAM, because even that crashes a lot). \n\nThis used to be so much better: packed online servers, actually fun and cheap new DLCs, and a game focused around dinos and dying over and over again, rather than whatever new mess Snail Games has gotten themselves into. \n\nBut get it if you want",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ark is a really cool and fun game were you tame dinosuars and craft things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "REALLY HARD GAME TO GET INTO!!\r\nI have a love hate relationship with this game but around 70% of the time i have fun playing it.  \r\nAt the time of writing this review i would pick ASE over ASA simply due to performance issues in ASA, but if you have a choice between the two in the future, id pick ASA cus hopefully by then performance will be much better\r\noverall ARK is a good game for peeps looking for hardcore survival",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it does freeze yes, although it is a good game especially with mods like primal fear and pugnacia have fun:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi. \r\nI really liked this game it's a game where you can explore and find out what is next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even if it got a bit more buggy, (thanks updates)  it is still a stunning game i play a lot. There is a bit of a learning curve, but all i can say is that you should look around more! the different beams have different materials near them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first time playing ts and i played for 16 straight hours honestly best game i ever played....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like survival games and big progression, ARK is worth every hour.\nRating: 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Last comment I made I was tweaking out, this game is good just beware of the corrupted outdated mods that'll completely erase your save and mess up your game. This game Isn't as popular anymore so no one fixes the mods anymore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With over 2,500 hours, how can I not recommend ARK?\n\nIf you love survival, base-building, dinosaurs, or pure sandbox insanity, ARK is absolutely worth diving into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but will make you want to break what your playing on into a million pieces and not even look back sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game has tons of mods and is so immersive, also I love the open world survival craft. Great game would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts game is good.If u play single player start is good but after like 2-4 days playing its boring similar to minecraft.But if u have someone to play with its good.I really like ark but i never met someone that likes it like me.I played w friends mobile version bc they cant buy it and its fun.But if they had it on pc it would be 100x better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game a lot as a kid so its very nostalgic to me, bought it on pc and then saw this shit takes up like 200 gb of storage, optimize the game more but other than that i have had lots of fun replaying some of the maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun with friends but servers are not so fun rust is more better for that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You hate and love this game, it's uniqe because it lets you ride dinos! We all started as kids loving dinosaurs... plus the price is really good for a peak game! Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been a mess from the start , and no I wouldn't recomend playing online with the aquatica branch of the game.However as a singleplayer, or maybe if you host a server with friends, the experience is worth a try .Do not buy this for more than 12-15 euro/dollar or anything else the publisher Snail Games promotes because they do not deserve your money due to their not caring about their customers  and everything else WRONG with them.This has been a bumpy joyride playing this game and i hope that the singleplayer experience ,with mods, lasts for me & you. Overall once an ambitious game with idealistic gameplay but quality of life and other issues ,with an abusive Publisher who has tried to milk it with redundant  dlc's, genesis felt weird and buggy for me , and then the  updating the game with their own GARBAGE dlc Snail Games actively  tried to kill  off ARK to sell more shiny \"Remasters\" of the game which is bloated with Gacha purchases such as premium CREATURES. This is the original , messy , dino-survival experience and chances are that you will either love it ,or hate it ,to the bone , or both :))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is super fun and has better mods than ASA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very good game but the new aquatica dlc is trash every other dlc is goated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely horrible but, I it's addictive so thx and i'm getting my friends on it too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i name all my creatures and develop emotional attachments to them only to be heartbroken when they die due to my ambitious hunting endeavors and terrible leadership. 10/10 will keep crying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing gameplay and graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pure fun. riding a dinosaurs is what we here for. It’s chaotic, hilarious, and super addictive. I always end up staying on way longer than I planned...\ntotally worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "生存神作我到現在還是忘不掉男人礦洞\n有人偷玩我的忘記叉掉DLC以爲本體300多gb",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buy ark, wait 4 days for it to download, boot up the game, get your eardrums disintegrated, make a world, get arc flash on your eyes, tame a dodo, get jumped by 3 raptors and a dilo, lose motivation do deal with it, and leave. 10/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ark: Survival Evolved was a ton of fun. You can play it alone or with friends on a private server, and you’ll have an amazing time. The public servers are mostly filled with no-lifers, so it’s best to avoid those. Other than that, it’s a really solid game with good DLC content. 8/10 for the game 7/10 for the 100%. \n\nAlso try out mods for this game they make it a lot better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, lots of free extra content and good mods. Would absolutely recommend if you're feeling the urge to wreak destruction on the back of a Raptor or Snow Owl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You Haven’t Lived Until You’ve Woken Up Naked on a Beach Punching Trees While a T-Rex Screams in the Distance...\r\n\r\nArk: Survival Evolved doesn’t just start — it throws you into chaos. One second you’re admiring the ocean view, the next you’re fist-fighting a dodo and realizing you’re dinner for something much bigger. From there, it’s all downhill… and somehow uphill at the same time.\r\n\r\nThis game is a beautiful, brutal fever dream — part survival grind, part prehistoric insanity. You’ll rage when your base gets wiped, cheer when you finally tame that Spino, and stay up ‘til 3 AM because your wyvern egg can’t be left alone for five minutes.\r\n\r\nYeah, it’s buggy. Yeah, it’ll break your heart (and maybe your GPU). But when that sunrise hits over the mountains and your dinos roar in sync — it’s pure cinematic glory.\r\n\r\nFinal verdict: You don’t play Ark. You survive it. And once you do, you’ll never look at trees, birds, or your free time the same way again. 🦖🔥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good building survival game, nothing else quite compares, many levels of depth to things to do here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game. Progressed far, joined a good community and tamed a lot of dinos. I also loved the building mechanics, and how you could build a dream base. The survival mechanics were interesting and made the game an adaptable challenge compared to other survival game. I tamed a lot of Dinos and enjoyed using their abilities to help build or tame other dinos. I also loved learning about lore and characters.\n\nThen the UPDATE happend.\n\n\nAquatica Update:\n\nWhen Aquatica launched...it ruined A LOT of things, which. It made the game quite unplayable, is the best way to put it shortly. \nWhen they provided the roll back, it had more lag than it was before the actual Aqatica update, to the point where it began to be unplayable, and sometimes would end up with weird bugs, such as no-clipping into a solid wall and a floor.\n\nIf I were to rate this before Aquatic update it would be a yes. but Aquatica ruined a lot of things including, a friend of mine's enjoyment, as they lost some dinos and base. In the end I had to stop playing as with the game issues, and other issues, as it was starting to feel more like a chore rather than a fun experience. \n\nFinal Thoughts:  \nIf you still want to play the game, choose Pre-aqatica. While its buggy, its not as bad as the Aquatica update, which ruined maps that were not part of the Aquatica DLC. It may be a challenge at first to survive, but its worth is if you enjoy survival games, Dinosaurs and anything close to that, its one of a kind (two, if you count ASA) and worth the adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard to run and takes a while to launch on ASUS TUF A15 laptop with RTX 2050\r\n\r\nreally fun game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very educational if you are interested in the subject of paleontology, and if you are into dinosaurs in general. \nIt is probably the best survival game I have ever played, since it's just so nostalgic from past games I have played related to the same style of this  specified game.\nThough, some downsides are the amount of bugs in this game, and the cave system isn't the greatest in multiplayer in my opinion.\nEither way, amazing game, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for the first time in my life after my friends recomended it to me. 5 minutes in and im already running fo rmy life from a bronco. Fell off a cliff straight into a raptor and then got absolutely ripped to shreads in 2 seconds. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a brilliant game cant stop playing it takes a long time to complete but worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time. It was the Jurassic Park franchise as a kid, and this game now that I'm older, where I developed most of my love/interest for dinos. Spent so many days & nights on public servers making friends (and sometimes enemies). Spent most of my time playing on Playstation (1200+ hours), but also made some fond memories on PC!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always keep spare back up saves in a folder so you can renew your game since my island map save keeps randomly getting deleted off my computer. probably intentional considering snail games does deliberately destroys the game with their updates. <Right click your game in the steam library-----> click manage -----> browse local> Shootergame------> Saved..... Make a new folder on your desktop called ArkSave go back to the saved folder in shootergame and copy SavedArksLocal folder into your new folder and LocalProfiles folder into your new desktop folder so you can copy them back if your game gets deleted.> after every session when you close out of the game copy the folders ArkSave and SavedArksLocal into your new folder. So time for the review since i have beaten every map on Xbox multiple times i will say this game if fantastic with very few flaws other then snail games themselves of course. If you want the best experience never play with random people since others have a tendency to be as toxic as possible when given the chance online. If your like me with your anxiety then you will play the game by yourself since there's always something to do when alone but others do help mitigate the grind and Ohh there is a ton of that. The countless tales i could tell that I've had on this game like ........ getting knock unconscious by a giant boa and a turtle saves your life only to find out you feel unconscious in a foot deep puddle drowning slowing as you yell wake up wake up ahhh only to gain conciousness at 10 or less health which causes you to be terrafied at every little noise you hear near you. or the time i jumped off a cliff on the center while being chanced by a Giga only to parachut into a sarcs mouth but you cut the shoot early to land on it back and run away while the giga changed agro and eats the sarc, or runninng from a reaper on the surface you plung down the pit and back into the under ground only to find its still hunting your and trying to eat your a** and as soon as you turn around its right there mid bite taking up your screen, or surviving a super heat wave on scorched earth while your legs are broke crawling throw the desert oh the agony (its a cooler temperature under the 3 oblisk on scortched earth by the way if your new go there just beware the kapros and raptors green is technicaly the safest). Ark makes you feel things that other games cant especially Aberration with its horror factor you will be paranoid on that map. I highly recommend Ark if you love exploration, survival or base building though the buldings not as good as conan exiles by a long shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The amazing amount of options and choices mean that you will be able to play for a long time without the game feeling repetitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, just make sure to install the pre-aquatica build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It Good But The Graphics is soo good that my pc cant Handle it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a Fun game to play with Friends, and the QOL Mods definitly make this Game better than it is. sure, it's got Bugs but personally, i don't think that's a Reason to not Reccomend this Game. Just, whatever you do, Make sure you go to Betas and play on the \"Pre-Aquatica\" Patch, as the Aquatica DLC screwed with the Entire Game, even if you don't own the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i was playing this game on my mobile and i was fan of it because of this game i have learn to manage things in my life and what should i have that is enough for me that's all Thankyou",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ark is enjoyable because it gives you complete freedom to survive,build, and explore in a world filled with dinosaurs and mystery. It's not just about fighting or collecting resources - it's about creating your own story in a living, unpredictable world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with great music. \nThe graphics are good but the performance could be better. \nHaving a lot of tames is fun until you try to go out with them then they all get stuck behind a rock or a few trees.\nDont under estimate alpha dinos they will use all your ammo to knock out. And dont let them in to your base.\n\n10 / 10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun and enjoyable but the devs kill the game and its too long but still played 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A super fun survival game about taking dinosaurs to become the strongest thing in the island or wtv dlc you are on anyways over all a good game with tough and easy takes very easy grind game requires a decent computer but I can run it just fine on a dell laptop I heavily recommend this game but be warned this game can make you very mad at times due to the fact that when you die you loose everything except your lvl it also takes a few 100 gigabits so wouldn’t recommend on Mac even though it’s supported",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ark is a very very good game. its a lot of fun and if you at least know some basics  you can have a lot of fun. I have 42 hours and the best I have managed to tame is a Trike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommended. Been playing for years, no complaints. Absolutely the best game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good and is fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Game have so many memory. Made tons of friends and enemies along the way as my journey took me across the Arks. I will always remember my babies that have come and gone (R.I.P. Lighting). I will always remember all of them they will not be forgotten I will carry them on always!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🎮 ARK: Survival Evolved – A True Test of Survival and Imagination 🦖\n\nARK isn’t just a survival game — it’s a living, breathing world filled with danger, discovery, and endless possibilities. From taming your first raptor to building massive fortresses on floating islands, every moment feels like an adventure written by you.\n\nThe graphics are stunning, the sound design makes you feel the heartbeat of the wild, and the thrill of surviving your first night never gets old. Whether you play solo or with friends, ARK teaches you patience, creativity, and teamwork in the most primal way possible.\n\nIt’s not a perfect game — sometimes the dinos get a little too wild — but that’s part of its charm. You never quite know what’s coming next, and that unpredictability is what keeps me coming back.\n\n⭐ Overall: 9/10 – A breathtaking survival experience for those who dare to face the wild.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I can't say it better than this....\n\nSnail Games\n\nLet’s not pretend anymore.\n\nYou didn’t “accidentally” break everything.\nYou didn’t “unintentionally” destroy years of work and communities.\nYou didn’t “update” to improve anything.\n\n\nYou knew exactly what this last update would do.\nYou knew it would break every mod, every server, every map players spent years building.\nAnd you did it anyway, so you could herd everyone into ASA, for money, that's all you care about.\nWe see you.\nWe see the contempt you have for the players who made your company relevant in the first place.\nWe see the disingenuous theater of pretending the part owner is some separate entity pulling strings behind your back.\nYou are the same.\nSame boardroom.\nSame decisions.\nSame disdain for your own community.\n\nYou didn’t just break some files.\nYou tore down thousands of hours of passion and creativity.\nYou removed entire worlds, because you have nothing left to offer except forced obsolescence.\n\nCongratulations.\nYou’ve proven once and for all you don’t deserve the goodwill people still tried to give you.\n\nIt’s over.\nWe won’t be manipulated by your “new platform,” your “new roadmap,” or your excuses.\n\nYour game was never yours.\nIt was ours.\nAnd you destroyed it.\n\nWe see you.\nWe won’t forget",
      "voted_up": false,
      "votes_helpful": 464
    },
    {
      "review": "I loved this game for years, and spent tons of time and money on it. Different DLC's, buying on both PC and console...seeing how they ruined it over time was heartbreaking. I have thousands of hours on console and moved to PC hoping it would run better - it doesn't.\n\nThey don't care about user experience. They ignore the community constantly just to push for more money. There are glitches in this game and Ark: Survival Ascended that have been around since day 1... if you buy this game, be prepared to have to read multiple guides on how to get it to work properly, and still fight bugs and game-breaking issues regularly. \n\nIt seems like they purposefully broke this version to force people to buy ASA, which ended up being even worse... seriously, don't reward them with your hard earned dollars. They laughed their way to the bank over and over and people are still entertaining them... with absolutely no mods this game blue screens my high end gaming PC and forces it into repair mode EVERY time I close it, so I don't even have the option to \"deal\" with the bugs like I used to. \n\nAs a gamer, I never felt so defeated by a love-hate relationship like I have with this series. I wish a better built clone of it would just come out already... I would much rather roll the dice on a new company screwing me over than continue letting Wildcard and Snail do so.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "At first this game will seem fun then slowly become an addiction before you lose your whole family and friends due to it holding you hostage for so long that you eventually die from a crippling depression with no one but your tribe that slowly eats away at youre soul because you cant get in a base at 5am when youve been raiding all day sometimes longer approach at youre own risk as you might wanna commit crimes as if youre black from this game",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Aquatica update ruined everything on purpose as a push to buy the new ark.\nmultiplayer doesn't work 90% of the time.\nMenu runs terrible at 8-30 fps at times for no reason i have a 9060XT by the way (this sometimes happens in game as well)\ntree shimmer is so bad to a point there should be a genuine seizure warning before you open the game. (meshes also sometimes break)\nthere are unbreakable rocks and trees i can just walk through.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "So this game was killed with an update? I've played for 100 hours and now the game wont even load a map within 5 minutes. The devs are scummy scummy people and I'll never support them again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "ARK used to be about surviving dinosaurs. Now it feels like I’m surviving Snail Games’ monetization decisions.\r\n\r\nWhen ARK: Survival Ascended launched, I genuinely hoped this was a fresh start — a chance to rebuild the game on a modern engine, fix decade-long bugs, and wipe the slate clean. Instead, it’s been a parade of half-finished content drops, paid DLC before the base game is even stable, and a constant feeling that players are being monetized first and listened to last.\r\n\r\nThe new Aquatica DLC should’ve been exciting. A map focused on underwater exploration, new creatures, new environments — finally something different. Instead, it feels rushed, unoptimized, and unfinished. Performance tanks constantly, even on strong hardware. Underwater FPS swings between “slideshow” and “PowerPoint presentation.” There are floating foliage meshes, invisible collision, dinos spawning inside geometry, terrain holes, missing polish, repetitive biomes, and creatures with broken AI. It’s like someone exported the map from the editor and said “ship it.”\r\n\r\nWhat makes it worse is that many of these issues existed in older maps. We already reported them. We already lived through them. Buying a DLC shouldn’t mean paying for recycled bugs.\r\n\r\nIt’s painfully obvious what the priority is: push out paid content as fast as possible instead of fixing the base game. Critical bugs from launch are still here. Server stability is bad. Balance issues go untouched. UI problems linger. Networking issues are constant. But new paid DLC? That arrives right on schedule. Players shouldn’t have to pay to beta test content inside a game that itself still feels like a beta.\r\n\r\nThe community has carried this franchise for years. We tolerated jank, bugs, lag, wipes, disappearing tames, rubberbanding, and servers melting during events — because we believed the game would eventually improve and that loyalty would be rewarded. Instead we got higher prices, paid DLC before the game is finished, cosmetic monetization, bundles, cross-promotion, and marketing hype, while stability and core fixes feel like an afterthought.\r\n\r\nWildcard clearly has talent — the creature designs and ideas are great. But it feels like every creative decision gets overshadowed by Snail Games’ desire to monetize as aggressively and as early as possible. ARK could be incredible if the priority was finishing systems and supporting the community instead of cranking out the next DLC.\r\n\r\nThe saddest part is that this could have been the definitive version of ARK. Instead, it’s becoming a cautionary tale about what happens when a publisher prioritizes revenue over quality.\r\n\r\nIf you’re considering buying the Aquatica DLC, ask yourself this: do you want to pay to test another unfinished map while the base game still struggles to run correctly?\r\n\r\nUntil the focus shifts from monetization to actually finishing the game: ❌ Do not recommend.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I bought this game because i like dinosaurs and thought it would be good fun. \r\nI expected a game that works, to be able to tame dinos and have a good time. \r\nWhat i got instead was a buggy, laggy, unfinished bundle of spaghetti code that can barely load a menu, let alone try to run an actual game. \r\nI love the freeform sandbox style of the game, the dinos, the gameplay, but the game seems to want to fight you at every single step. \r\nMain menu? cool, let's click in- frozen. Wait ten minutes, click in, run the server- frozen. 45 minutes of load time, connection timeouts, crashes, and freezes later, we finally load. wonderful! let's go do something- frozen. Low frame rate. Open a menu? lag. \r\nThe controls are impossible to use in the godawful UI, and any time you try to do something even remotely entertaining, the game completely gives up and shuts itself down. I have had the game crash by WALKING TOO FAST. My PC can run literally every other game i own, except this one. It's not worth it.\r\n\r\nTLDR: Don't buy this beta, half-finished moneygrab. It's not worth the hours you will waste waiting for literally anything to load.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "My first experience playing an MMO PvPvE type of game. I hated that everything I worked so hard on would get destroyed when I logged off. Glitchy. Lots of memories with friends though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is so bad and not worth playing anymore, the removed all multiplayer function and crossplays.....  why pay for a full game then you need to buy a server just to play with friends? what a wasted space in the gaming industry",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The idea that this game still has active community is a joke. Would write a longer review but it would require more attention than devs gave while making this trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Devs got greedy after building the game on the player's backs and ruined the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "this game used to be a blast, now it is riddled with random freezes, multiplayer issues (friend can never join my non dedi server the first try. we just have to keep trying and trying until it just randomly decides to let him connect), and random crashes (on main menu and in-game). I could not recommend anyone to buy this game while it is in this current broken state.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Major loading issues.  Can only briefly get the main menu to work after waiting an inordinate amount of time.  Afterwards, you change one thing and it locks up, never to be used again.  Can't even alt-tab to get Task Manager to kill it.  Like every command you give it is delayed by 5 minutes.  Wanted to play with this with a friend.  Exact same issue on their computer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Took me many tries to even get the game to run, then when I am in there, there is not help getting started. I did not get far. I do NOT recommend. No, i do not want to watch external videos to get started. If the game cant do this on it's own then it is not worth playing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dont waste money on this game... I must say this game has the most interesting and intriguing theme but horrible execution its laggy, unoptimized, dumb and graphics are horrid. buy Ascended instead! :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love this game, reinstalled it because some friends wanted to give it another go... spend a few hours trouble shooting why we could not connect reverting all versions did nothing. installing the newest version with zero mods did nothing and after a few hundred hours in the game its just not worth the time. what an absolute shame...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game crash's on menu or if i hit a button on the ui \nruns fine from the xbox/microsoft store",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am posting this review based on the way the game is now and not my gameplay over the years. If more people di that then no body will waste their money. I love Ark it had always been my go to game...that is until Snail came along and killed it. It wont let me load into the game. I play solo and you would think that would work but no and i am NOT paying $60 for ascended. They broke it they can give it to us. For all of us who are angry we need to fight back. Im not done playing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ich liebe dieses k*ckspiel und habe auch mehrere Monate jeden Tag durchgesuchtet. Ich kanns trotzdem niemandem empfehlen der seinen Blutdruck in einem gesunden Bereich halten will. Bei Menschen mit Aggressionsproblemen ist dieses Spiel ein potentielles Todesurteil für sämtliche Technologie in Griffweite. Bin so angep*sst dass ich nichtmal Satzzeichen verwenden kann xD 10/10 werds wohl immer weiter spielen lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Vaya juego de mierda, ojala y se mueran todos junto con todo su puto dinero porque gaste dinero en este juego de mierda y no me rembolsaron .I.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love this game, but now it is completely unplayable. The loading screens take *ages*. I have better things to do than spend 20 minutes staring at nothing. Also, the game file size is ridiculous, even with removing DLC and manually compressing the installation after downloading. It's tragic. I really wanted to play again, but it's just not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wow what happened, came back after a few years and the optimization is so poor i cant even open the fucking game. Loser Devs, dont add it if it breaks your game. Dont support these idiots.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is a bad game. It is the best bad game you will ever play.\nOptimization is bad\nGraphics are bad\nRuns like bad on a NASA quality rig\nAnimations and gameplay are bad\nDevs are bad\n10/10 with friends and I can't explain why",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After years of play, and years of not playing (5 plus years gone)I came back to find some of the biggest problems the game had not fixed... This game is a computer killer.  It was never made right (so people who knew about these kinds of things told me) and made your computer run extremely hard (poorly optimized).  I burned one of my comp's up, I was so hooked on the game and didn't stop playing, cooked that sucker.  And it appears they have moved on and left this one on the vine to ripen and die.  Don't get me wrong, this game is very much fun, but it can break your heart (and computer if you're not careful) in a half-second.  If you haven't been infected yet, don't get in the water with us fools.\n\nCompletely and totally based on how this company treats it's player base I'm saying No.  Not just to this game but anything this company develops.  Save yourself some frustration and buy a competitors product so you don't risk getting boned in the end.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "spend a week downloading. Game wont boot. spend another two days updating to a beta version. Game barely runs 3/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "after the last update the game isnt running the start menu is freazing i cant select any thing in it i cant even exit the whats wrong with this update \ncan you please fix it or send me a refund for my money and time i spent on this game \nthe update of 25-11-2025 just killed the game for me and i think for everyone els ..........\n!!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "doesn't load properly and keeps crashing or holding....why did I ever think this game could ever be fun?!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't play this trash game anymore. Spent a good 48 hours trying to install it JUST to feel the nostalgia of playing the game again, only to be met with a dead game. Latest update straight up killed the game and you're not even able to stay in the main menu for more than a minute without it freezing. The game itself isn't even worth playing, and don't bother with the other Ark related games by these publishers as you'd most likely get backstabbed by them years down the line when the next Ark game comes out. Words cannot describe just how upset I am that this once great game comes to an end like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after 10 years of the game being out and i cant connect to a server",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game literally doesnt work anymore. They want you to go play their money grab ASA. That game also barely works. Fucking horrible slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For the first time in my life, I’m writing a negative review about a game that used to be fantastic.\n\nAs many other reviews already mention, this game has been manually dragged to its death — and that’s unbelievably sad.\nThe last time I played ARK was back in 2019, and my friend and I were excited to return. But right from the start, it was a nightmare. Loading takes forever, the game freezes constantly, and even creating a server together felt like a struggle.\n\nWe finally managed to get one running at the end of October. After about three hours we stopped, planning to continue next time.\nThat next time never came. Everything kept crashing, and suddenly we couldn’t even play together anymore because the server threw an error.\n\nStill, I didn’t want to give up immediately, so we waited a few weeks. November 20 would be the day we’d try again.\nBut the small spark of hope I had vanished instantly. My friend made it clear — this isn’t playable anymore. Even if multiplayer did somehow work, you’d spend half an hour just waiting, getting frustrated, knowing deep down it’s not going to get any better.\n\nARK is dead. And we have to accept that.\nIf I’m being honest, I’m afraid ARK 2 will eventually end up as the same kind of disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When game runs for me with my RTX 4070 TI super, 32 GB of RAM and i7 processor it runs on max quality well. Problem is that often in game first screen, menu is often freezing and only way to get out is to restart PC. And if i get further, game only starts like after 15-20 minutes of loading. I had no problems months ago in weaker hardware. Looks like new game devs are trying to kill this game in favor of new Ark Survival Ascended.\nSo great game if it works. But not in the latest update and not in the direction game devs are going.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unplayable. I keep loading the game up every few weeks to see if I can play it, but sadly can't. Doesn't even load. I think the devs killed this game on purpose so everyone would go to the other one. I don't want to play the other one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just came to this game recently as a new player and what a fucking shit show. I do not recommend this old game to new players. The amount of errors/glitches/troubles with just starting the game and in the first couple hours of playing it compare to the Sims 4, which is an insane thing to say. Couple that with a bad UI and limited in game options make it feel half done and low effort. (examples: game freeze after starting up, always lag on main menu, 20 min to load save files, loading screen freezing, starting new save user issues, ground/wall visual clipping everywhere, dinos bodies warping, flickering glitch, dead bodies flying and missing)\n\nBecause of this experience and the reviews I read about the company, I will be removing the new game Ascended from my wishlist and ignoring any future work from them",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Goodbye old friend.  Played this game from almost launch on both consoles and PC.  Thousands of hours in vanilla, good memories.  But the best content by far was on PC and from the mod community.  Snailtrail Games killed the momentum by splitting the customer base with ASA.  I don't recommend the game now, unless you just want to play single player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kept trying to play this game, even bought the DLCs except Aquatic. Every time I tried loading it, it would freeze / stop running and I would be unable to have the game loaded for any time longer then 60 seconds. The game is so poorly coded and made, that, it's imposible to even play!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decided to play the game again after 10 years, downloaded all 70 GB of it, only to find the game unplayable and freezing in the main menu. Look if you can't get your sht together after 10 years you don't deserve any players. Instant uninstall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to play this when it first came out and it was okay and fun but now I can't even get it to load without it crashing. Really sad the game developers aren't even listening to their audience about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent my 15 bucks and it fails to open. Locks up. Dont waste your money on this overbloated non functioning pos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game when you can play it. Home screen is super buggy. I am constantly getting kicked or lagging out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to enjoy this game about 5 or 6 years ago and decided to buy it again and it literally doesn't work. The game crashes upon trying to create a single player world. Tried a million different things and scoured the internet to try and find a fix but nothing works. Don't waste your time or your money on this piece of crap game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after the aqua update this game is unstable with 4 hours of gameplay withoughrt me ever seeing the map",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed this game a while back. However, new owners have essentially destroyed the game and its a buggy, janky, AI powered mess. Until there are some major changes in organization structure or ownership, DO NOT BUY. Also snail games is trash never support them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If all you want is a parasite simulator where you inhabit dino's and you don't really care about mechanics and balance, just dino go RAWW! This is for you. Otherwise this game suffers from being a pretty large idea, with little planning, rushed out the door to fund actually making it work, sometime in the future, which looks increasingly like being delayed indefinitely. Even when they're releasing V.2.0's for money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "under optimized, ugly character creation, shady company that marked this as abandonware in favor of making a sequel which is just the promised fixes for this game, at a full game price upcharge.\r\n\r\nkept alive and fun via modders and community. wait for a big sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "กูเล่นเกมเหี้ยนี่กับเพื่อนแล้วเกมกูก็แคลชหลังจากนั้นกูก็เข้าเซิฟเพื่อนไม่ได้เกมแม่งโง่ชิบหาย Ascended แม่งก็ควายไม่คุ้มตัง จนกูต้องกลับมาเล่นอาร์คอีโว แต่เกมแม่งก็หมาอยู่ดีถึงจะดีกว่า ascended นิดหน่อย",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over 1k hours, I loved this game, then they broke it to force ASA on us. Ignoring the players for a money grab...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone with 3k+ hours into this game and played from the beginning on official servers via vanilla settings and unofficial servers plus running my own private server with mods for almost 2 years with friends. It's not worth it. Simple as that. I wish I could get my money back and the hours spent on the game and it's the only game I feel that way about.\n\nThis game had so so so much potential, it really did. There wasn't and still isn't entirely anything like it and it just was thrown in the trash. It isn't playable even on single player. It's just overall broken and not salvageable. \n\nHold out for Ark 2 or go with Ark Ascended if you just really really want to give it a go.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what a great game, this is my experience:\n\nclick start\ngame loads up\nfully frozen\nclose game\n\nclick start (again)\ngame loads up\nworks!\ntry to join a game\nloading....\nstill loading...\ngame disappears\n\nmeh i give up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played ark casually with a friend for years and when i heard they were making the game again on a different engine i was excited until everything happened and now ive lost all faith in this game and franchise and i cant bring myself to play anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมนี้ดี แต่ก็มีบั๊กเยอะเหมือนบ้า… เกมโคตรบั๊กเลยโว้ย",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ARK could be a great game, but it’s buried under technical issues. Constant frame drops, crashes, and bugs made it nearly unplayable for me. Even on a strong PC, the lag is ridiculous. The concept is awesome, but the performance is stuck in early-access mode forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is a buggy mess. The multiplayer is unplayable, and if you put the graphics a little too high (even if your pc can handle it) it'll most certainly crash sooner or later",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is full of bugs , crashing at startup and hanging while audio keeps playing , basically unplayable on my pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its fun at times but most of the time its annoying and not worth the time... it feels like the devs got the game ready for beta testing and then decided there's not much money in fixing all the bugs and decided to go all in on developing DLC content rather than fix problems that have been in the game for literal years... I'd also say the game play loop is annoying more than enjoyable. The devs make certain gameplay mechanics purposefully annoying and difficult without adding to enjoyment. For instance, a consumable, Wyvern milk slowly spoils quickly so you'd assume you could put it in the fridge... You cant. It spoils in 30 minutes which can be prolonged to 6ish hours if you use other food preservation structures (more primitive and less effective)... Furthemore, to get the milk you have to knock out a wyvern rather than kill it making it annoying to collect, preserve and use the item. There are many mechanics like this that ignore logic to increase difficulty/annoyance. I can only play a couple hours before I have to stop because it annoys me. Afterwards I take a multi month break from the game. Although it can be fun to tame dinosaurs the game gets annoying way to quickly. For those reasons I can not recommend the game so much so id tell others to steer clear of it. Oh it also takes a crazy amount of storage. I have a 500 GB SSD--- it uses more than 40% of my entire storage. So having this game means not being able to readily play 2-3 other large games or a handful of small ones.\n\nIll also add that it seems like the devs are now actively sabotaging this game to make people by the re-released version that uses Unreal Engine 5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game used to be playable. Magically corrupts files at random now, crashes on startup (I've tried every possible fix- I'm fairly tech savvy). My PC is fine.\r\nPretty sure it's an intentional feature in the code so people get tired of it and buy Ascension.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is broken guys, i cant launch the game properly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ever since the Aquatica update, I can't pull up the game. It freezes, and crashes my whole computer. I cannot in good conscience recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, the game is okay. It’s fun — until one of your leveled animals gets killed because of some stupid bug in the game. The latest update is totally broken. The game doesn’t even load. If you want to play, you need to roll it back to the pre-aquatic update. The game was buggy and unbalanced from release, but now it’s even worse. And dont take me wrong. The game was awsome. Even tho the game was broken. But when the snail corporation bought this game thay kill this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SPAWND IN tried to kill a dodo and a raptor milested me by jumping on me and puting it in were the sun dont shine.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to enjoy the game and couldn’t get it to run. I then learned that there was an “update” and now it’s incredibly unstable. Glad to see executives killing good games when they’re shitty remakes don’t meet the profit margins. I’ll find something else rather than buy the next gen of a game that will probably get its head chopped off as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is quite old and joining friends seems quite to be a problem and the files tend to bug a lot.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wastes to much space and the updates need so much space for nothing new",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game, cant even get in the game for 1 hour, always freezing n not responding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play with my friend wtf. this game has such a good developers didn<nt do anything at all so dont even think about enjoy playing this game with your friend. dont buy just go for other game. this is a very friendly remind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is almost good, it just runs poor takes up too much space and is just rigid and clunky down to the very basics it feels like the most generic game ever it and good and bad way it just not worth the poor optimization and enormous size.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would've reccomended the game highly and I genuinely enjoy playing despite its downfalls. But due to Snail Games and Aquatica, I would tell others that the game ain't worth it as I don't support the publisher whatsoever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do NOT play this broken ass game,most of the good servers have been shut down and it is still a buggy fucking mess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After years of getting cancer in game and all the bugs that are present till this day now the game decides to fuck us all OUT OF THE GAME. You cant even launch the game now or if you do it doesnt load anything.\nguess what??? ASE is on sale!!!!!! What a coincidence, right? I cant imagine the greed this company has that it purposely breaks the game and puts other even SHITTIER version on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game works great on the deck but it says it has cloud save support and the cloud save says up to date but it dose not save your saves to the cloud you have to restart from fresh every time you go to play it on a new deck or other computer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've updating my review to be more positive even though i'm leaving it as not recommended. it took a long while and a lot of googling and trial and error to get this gaming working correctly. the devs have left this game in an absolute mess its poorly optimized and the files are bloated. The game itself is fun once I got it working I enjoy it a lot but i cant endorse giving these devs money when the game has been out this long and is still this unstable and bloated.\n\nTLDR: the game is fun when you can get it to work  but i cant recomend giving the devs money for it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game freezes everytime i try to play shit game\n\nedit: you have to install pre-aquatica for it to work fine but bricking your game on purpose does not deserve a good review!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crashing although i have a great pc (rtx 3060ti and ryzen 5500 and 16gb ram) i tried everything it just keeps crashing. no other game does this. very odd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game before the aquatic update, I'm still a beginner after hours and hours of playing and just started understanding how everything works. Now it's really frustrating to even start playing. It takes me atleast three attempts to be able to open the game. First attempt is a non responsive main menu, second attempt is a bit better as I can actually click on play single player but it won't load (will be stuck in a boot loop). The third attempt was so far successful, but as of today I can't enter the game no matter how many times i start it up. Also, i have to restart the computer every time to be able to shut down the game.. Tried reinstalling, thought my computer was the problem but after a little research, I'm really sure it's not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broken, can't load the game on the current patch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While this game was one of the best games to play for a long time, unfortunately the game is abandoned and more unstable than a early access release game from a 1 man indy dev team.\r\nThey have actually abandoned the game, no official OCE or Asia servers, and unless they legally have to, they will NOT resolve any issue in regards to hackers unless they are legally bound by law to look into it.\r\n\r\nIf you like cheating, insane third person camera abuse, racism and being a living bong dreg, then this game is for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game may be the most buggest game ive ever seen in my live. this game runs like a grandma thats on life support",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried to join a friends lobby and kept telling me to download steam. I launched the game from steam wtf, garbage servers back to battlefield i go",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To say it shortly, DO NOT play this game. \r\n\r\nTo elaborate in full it would mean to encourage you to play this game. It is paradoxical but its true.\r\n\r\nI knew about this game since it came out in 2015 and followed on youtube during 2016. After that I forgot about that game for few years until 2019  when I met a guy online that had this game on Epic and was willing to borrow me his account to play. I easily clocked 450 hours in short time because game is super addictive. \r\nI was playing mostly official PVP which is very slow gameplay and it takes steep learning curve to experience full game. On average in PVE it would take a month for new players with 1X to experience most of the game on ONE map playing 8 or more hours a day.  (and there is 10+ maps)\r\n\r\nSince 2020 I have had 4500 hours in this game mostly PVE and still did not experience everything there is. Most of my hours are during Covid and these are just in game hours, there is also fair share of hours spent on youtube watching about this game, plus general thinking about the game when I was not logged in. so number of hours spent is much much higher.\r\n\r\nIts a great game and there is hardly any other game to my knowledge that would provide similar experience. For people in love with nature, scenery, animals, dinosaurs, exploration ,grind and progression this game is perfect.\r\nBUT....\r\n\r\nBe prepared for this FAT game, you can play one map at a time but all maps are 400+ GB combined plus add few mods just to check it out. Game will be taking 600 GB of your space.\r\nInstallation lasts forever up to 5+ hours. To enter server it would take 5-10  min or 20 min if game even recognize server. \r\nit is resource demanding so medium or decent PC is required for any setting above low graphics.\r\ngame is filled with bugs, lags, glitches and dumb situations. A fricken rifle that get stuck and you can not shoot from it every now and then.\r\nThere is massive amount of times you will be surprised, tired, frustrated and thankful for any stupid reason, when you get stuck or died to dumb things and reasons.\r\n\r\nGAME IS ADDICTIVE, game is not polished, game is complicated.\r\nMy advice, play PVP only on boosted rates and with quality of life plugins or mods included no longer than few days once a month with friends because what ever you do,\r\nor how hard you try you will eventually die and lose everything to non lifers or to chinese cheater tribes.\r\n\r\nIf you play PVE also play on boosted rates and do make a check list of interesting things to do or else you will lose 1000 hours into mating some stupid color or some stat into your favorite dino that will either die or you will not use it.  I do highly recommend playing single player and finish the game before you go in multiplayer because on servers people will just give you free stuff and free dinos and ruin the game experience for you.\r\nGAME IS LOVE-HATE UNHEALTHY RELATIONSHIP\r\nGood luck avoiding it. 👍",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is broken, nothing works. My dlc's don't work. And I cant even play with my friends. Also why the fuck is this game 500gb with all dlc, I thought cod was bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They only want money and won't even fix bugs that have been in the game forever. Just to name one, Grappling hooks are completely useless with a controller still... you can't disconnect are you kidding me? Fix your game you greedy pigs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "every single time i ascend and download my character, 9 times out of 10, the game turns my PC into a vegetable, i've herd it was* a really good and fun game to play, but with the somewhat horrendous optimization the game has, its no surprise even high end rigs would freeze, personally, i would still play it because there is no other game like it, but don't blame Wildcard for this bad optimized game, blame Snail, also, the time it takes to load, even with a SSD, is enough for me to bake a cake",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1/5 The company abandoned it and has actively done everything they can to push players onto their new trash money hungry game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Par ou commencer tellement le jeu a de problem les bugs sont trop présent pour un jeu ayant 10 ans et qui et donc censé être régler au bout de 10 ans par exemple j'ai un bug qui fait que si je sort du jeu sans le fermer juste en allant dans une autre aplli je dois redémarrer mon pc car rien ne fonctionne même pas la touche Windows.\nLe jeu fait 168go alors que des jeu bien plus grand comme Dayz font à penne 30go. Le jeu n'est pas particulièrement beau en plus de ça.\nLe jeu est très mal équilibré par exemple vous débutez c'est votre toute première partie et vous spawner sur un niveau facile mais à penne arriver vous vous faites défoncés par tout ce qui bouge autre exemple vous venez de craft vautre armure en fer complete avec des fusils maintenant vous penser pouvoir battre presque tout et bien vous allez être déçu alors oui vous tuer les monstre genre les petite dinos mais avancé un peu dans les terres et tout vas vous déchirer tout vas vous tuer en 3 morsure.Les DLC ne sont pas intéressant et font juste buger le jeu au même prix que le jeu de base 15 balle pour chaque DLC et ils en sortent un par ans en fait le jeu est drôle les 20 premières heures et après ce n'est que de la rage.\nLes menu sont infâme mal fait est bug depuis les dernières version c'est une galère pour rejoindre un ami les temps de chargement qui avant prenez 1min et maintenant 15 min de chargement la progression et lente etc... Fuyez",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk why they still sell Evolved when Ascended is out???? I used to like this game way back when, but I can't support these awful developers.. Do not buy this or the Ascended version. They are both a buggy mess, controls are awful, load-screens are insane long.. Don't repeat my mistake and instead spend your hard earned money on something that deserves it!\r\n\r\nIf you absolutely want this game, get Ascended on super sale, Evolved is outdated...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is as old as Fortnite, and yet it still somehow manage to run WORSE. It’s an unoptimized piece of absolute garbage, the devs keeps making dlc’s like the game was still alive. Let it die the game was never good anyways. Don’t buy this trash even if it’s free it’s not worth your 500gbs and time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely the most infuriating survival game I have ever played. This is such a cool concept let down by terrible mechanics that have remained unchanged for God only knows what reason.\n\nThis game is tedium incarnate. Building pieces have to crafted one at a time, then placed into the hotbar, before you can place them. There is also no crafting from storage, meaning you are constantly running back and forth.\n\nEverything is also way too expensive, with even the most basic items requiring tens of resources to craft. There's also no way to decrease crafting requirements, only increasing the amount of resources you can gather. This, ironically, just makes crafting and building take longer since you get encumbered faster.\n\nEven with mods, there are just too many smaller issues that add up to a frustrating experience. Perhaps I just haven't found the right mods, but that just makes the problem worse if you need to hunt for mods that add basic functions other survival games have had for years.\n\nAnd don't even get me started on the game's insane size. 160GB for JUST the base game is a level of ridiculous that would make the COD devs blush.\n\nIt also doesn't seem like the unnecessary remaster has improved the game at all, possibly even made it worse. Honestly, there are so many other survival games that are better in pretty much every way. Just go play them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Optimize this stupid unplayable game, it has more crashes than an average drunk man in front of my house at 2am. Fix this fuckass game you bitchass jews",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't recommend this game if you plan to play with friends! i cant join even when they invite me they have to restart there pc even then i takes 30 invites just to get in once it a bad game in general",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Other survival games are better. The devs kinda just slop out some new content and hope the dinosaur game sticks. if you want PVP go play Rust if you want dinosaur games there is plenty same with survival craft. Best with ungodly amounts of mods",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This might be the most disgusting thing I've ever seen a game company do.  Shut down the game and force people to buy the same, slightly upgraded version of the same game but with less of the stuff?  Surprised this was actually legal to be honest.  I hope they go out of business soon.   This is nuts.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Listen. If you haven't played Ark before listen to me and don't get it. I got thousands of hours on windows and even grabbed 400 here in a few weeks. This game will get you addicted in a way meth can't. It will burn you inside out.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "ark evolved is good, ascended is so much better, get it on sale for 20$ and only get ark survival evolved if you want to do mainly pvp, if your doing pve go straight to ascended (asa).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "who publishes paid dlc during ea prob eats small children, too. there isn't a more explicit way of saying: 'we put monetization before delivering a meaningful experience' and 'we poop on our customers'.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "poorly optimized, no official servers, buggy multiplayer, cant refund after 2 hours",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "amazing graphics and content but god awful coding",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People think this is fun?\r\n\r\nThe Good:\r\n- The (oversized) velociraptor analogues have feathers\r\n\r\nThe Bad:\r\n - Literally everything else\r\n\r\nThe Ugly:\r\n- Animation quality straight out of 1996\r\n- Control maps reminiscent of 1994\r\n- The inventory flashing \"hologram\" projector would give anyone a seizure\r\n- The music is SO LOUD (and overly dramatic)\r\n- UI design that will give you carpal tunnel in a day\r\n- More death than a Hidetaka MIyazaki game\r\n- More bugs than a Men In Black movie villain's barn\r\n\r\nI heard SO MANY great things about ARK. Critically acclaimed and rave reviews. I'm not a *big* fan of the \"Survival Game\" genre, but after having played a few others and gotten an idea for what I do and don't enjoy, I thought it was time to give this a try. \r\n\r\nBecause WHO DOESN'T WANT TO RIDE THEIR OWN PET FRIGGIN DINOSAUR??????\r\n\r\nStart up the game and the very first thing I notice is the game defaults to Windowed mode at 2/3 my native resolution. The second thing I noticed was that I couldn't click on anything and the game's main menu was completely non-responsive. Eventually it did start responding, not because of anything I did though. Even after it started responding it was still very laggy and would go unresponsive for several seconds at a time. \r\n\r\nThe menu and options screens are cluttered and confusing, even to a veteran gamer. But poor UI design is a staple of modern computing, since everyone started learning to code from Stack Overflow and stopped going to school for it. Still, I *expect* more from a popular video game. \r\n\r\nThe menu includes a survival guide. That's not a good sign. If you have to put a how-to guide in your menu, it means you didn't balance the intro / tutorial experience very well; or in this case didn't include one at all. \r\n\r\nThe process of starting a new game is ... a LOT. Having come from setting up dedicated servers for a few other survival crafting games, I wasn't as intimidated as I might have been 6 months ago, but players new to the genre would absolutely be crushed and confused by all of the \"Single player\" server and world options. The character creation process is... lackluster. You kind of get to customize your character's appearance, but that boils down to an amateurish bone scale along a 2D plane for a half dozen body parts and changing eye, skin, and hair color along a spectrum that all kind of looks like the same color of mud. \r\n\r\nAfter all that and finally getting into the game proper, the real question is whether the core gameplay loop and structural mechanics are engaging enough to keep playing. \r\nThey aren't. \r\nEven on EASY mode in an EASY start area, you die before you even figure out how to craft anything. And that's after having read the survival guide before playing. You start out unable to craft any meaningful weapons or armor, much less a shelter or even a camp fire. Therefore you die. A lot. And even on \"easy mode\" there are raptors and spinosaurus and piranhas hanging around your spawn location. And mobs that kill you have a tendency to camp your body, so good luck getting any of your inventory back.\r\n\r\nAssuming there's anything worth recovering in your inventory anyway. You have to get your \"engrams\" before you can craft anything, and that's where the mechanics really break down into garbage. \r\n\r\nIn order to learn to craft anything, you have to spend \"Engram points\" on an \"Engram\" that is the game's method for learning new crafting recipes. The limited number of Engram points available and inability to easily reassign them (especially early on) encourages players to save their Engram points for the better later-game crafting options. The result is a crafting system that actively discourages players from crafting. \r\n\r\nBut then, I had to play, and die a lot, for an hour before I figured out how to even spend Engram points and get new crafting recipes in the first place. \r\n\r\nEngrams aren't just bought with Engram points, you have to unlock them first. The only way I found to unlock unknown Engrams was to get them in a \"Supply crate\". Again, the game's mechanics break down here, as supply crates are fairly rare, spawn for a limited time, and many of the crates that spawn are higher level than your character (even in a single player game) - making them completely unavailable to you even if you're able to find and reach one. This, again, discourages players from playing the game, since every supply crate has a moderate to high chance of being unusable anyway. \r\n\r\nThe controls are wonky with a few non-standard key mapping decisions that drive me up the wall. (TAB hasn't been the key for opening the console in a game since 1997. And C hasn't been used to crouch since 2004.)\r\n\r\nThe dinosaurs are gorgeous but would disappoint YDAW (admittedly resulting in an entertaining youtube video). (OK, but seriously, your raptors are 8 feet tall, fine, you watched too much Jurassic Park and I can forgive that. And at least you put feathers on them. Sort of. But then you orient your thagomizers upright like you used a dollar store stego toy from 1985 as your model. Guys. Seriously. We've known thagomizers are oriented horizontally since 1993.) And while the dinosaur animations look OK (for the most part), the character animations look like they were rigged and animated by a teenage intern from the 90s using Blender for the very first time. (Zoom out to third person and punch something. Then watch a real person punch something. Then laugh. Or cry, depending.)\r\n\r\nThe resource gathering is tedious, the HUD is barely visible, lacks any kind of crosshair or easy way to tell what you're looking at, focused on, or in range of, the sound effects are incongruous, and no, you do NOT use a pickaxe to dress a carcass. Assuming you manage to kill anything before it kills you. \r\n\r\nAnd for those of you reading this and screaming at your monitors that \"It's a *survival* game, staying alive is *supposed* to be hard\", yes, I know, but even the most hard core survival game needs to keep players alive long enough for them to learn the basic mechanics and *how* to survive, and this is *not* a \"hard core\" survival game. \r\n\r\nLong story short - I had really high hopes for this game, but it's 100% disappointment. And I would still love to tame and ride my own dinosaur, but this is not the game where that will happen.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "can't play private server with my boyfriend anymore. also the new game won't save progress. do not waste your money on ark.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not much to say just completely wipes your save every now and then",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Age 16: Tries ark survival evolved. Game runs piss poor. Ok dern, probably my shitty alienware laptop thats like 6 years old. That's ok whatever.\n\nGrows up, gets big ass PC, updates PC specs to date, gets a job, etc etc. \n\nAge 24: tries ark survival evolved. Game runs piss poor.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}