{
  "positive": [
    {
      "review": "nice game but should add more things for the free version",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "got heartbroken -> decided to play this game -> 4 match straight met againts cheater and got wreck by them ->  my points just go down the drain in a blink of hours -> atleast i got nothing to lose now.\n\nok jokes over, i miss her gng :/",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "difficult game due to cheaters should add a mode where u can play against ur friend unranked",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its a Great game\r\nWith the power to see the world,\r\nthis game is so fun",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Sadly it's not like the browser variant. Would love to see multi-player for player made maps and be able to play player made maps in this version.\n\nJust 1 tot 1 copy of browser edition we need.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love the concept of a free to play game that hides a 30$ mandatory subscription behind a few sessions.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "That's a very good game, broad your horizons and interesting to compete eacn other!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You guys won’t fucking believe this. The moment I stepped into this damn game, the first thing I ran into were demons fighting like the place they spawned is literally their own backyard. They mash every button without a second thought, while over here I don’t even fucking know what’s lurking around me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Didn't know it was on steam, though I have played alot of it on my schoolcomputer instead of taking notes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly don't know why people were complaining about the game being behind a subscription concidering the web version also is like that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the best games out there! i love geography and this makes me relaxed, btw rainbolt is soo good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game. You put Kazakhstan or Zhytomyr and you win. Isn't that steeply?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, highly recommend. Please bring a feature for free 1v1 with your steam friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not a great game for starter if you aren't even familiar with the Ghana tape.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good it helps you how to think fast and know all the places around the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best UI designs I have ever seen , pretty , to the point, not minimal but not cluttered \nPhenomenally light, \nPerfect amount of everything \nOffers the micro transaction, but doesn't force it down your throat and block the actual game\nVery well done, This is what we need in the new age of AI, subscription plans and micro transactions. \nTHANK YOU",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it a lot there are just a lot of people using chat gpt and cheating but other than that its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if u dont have a opponent which use browser to search",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game really got upgraded after adding an option to play for free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play with a friend and better your knowledge on geography.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GeoGuessr is one of the most unexpectedly addictive geography games you can play. What starts as a simple idea—guess where you are based on a random Google Street View drop—quickly turns into a blend of detective work, world knowledge, and pure intuition.\n\nThe Steam version runs smoothly, loads quickly, and makes jumping into rounds effortless. Whether you prefer casual play, timed challenges, or competing with friends, the game offers a nice balance of accessibility and depth. There’s always that “one more round” feeling, especially when you barely miss a perfect score.\n\nWhat really makes GeoGuessr shine is how much it teaches you without trying to. You start recognizing road signs, vegetation, license plates, languages, and even soil colors from different countries. Every match feels like exploring a little corner of the planet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a cool game, where you can learn a bit of geography and things about every country like: their language, buildings etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definitely requires gamemodes available on the browser version but still fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game - awesome client for the casual user. Competitive players may still prefer the web-based version for certain things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game but should add more things for the free version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that makes you think and sometimes even makes your heart pounder. An interesting game that tickles not only your nerves but also your brain (in a good sense of course).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, just bad that people are cheating sometimes..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy geography, mystery, and guessing wildly incorrect locations with confidence, this game is basically your soulmate.\n\nIf you want a fully-featured game without a subscription looking over your shoulder like your mom asking why you left the fridge open, maybe wait for updates.\n\n8/10 — Got dropped in the wilderness. Learned nothing. Had a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game to have fun with your bro, to visit beautiful places in the world and guess them :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is nice having a glance around the world and seeing different cultures and trying to guess which one it might be",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "спасибо этой игре, ведь теперь я знаю что london is a capital of india",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun as a multiplayer challenge for others in the steam community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and fun exploring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it is too expensive...\nBut to play it 10 min with a friend it's fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please describe what you liked or disliked about this game and whether you recommend it to others.\nPlease remember to be polite and follow the Rules and Guidelines.\n\n\nVisibility: Public\nLanguage: English\nAllow Comments\nFormatting help\nDo you recommend this game?\n Yes\n \n No\nPost review\nIs this game relevant to you?\n0.2 hours played\n\n8 friends have played this game:\n\n\n\n\n\n\n\n\nOnline PvP\n\nOnline Co-op\n\nSteam Achievements\n\nIn-App Purchases\n\nStats\nRequires 3rd-Party Account: GeoGuessr (Supports Linking to Steam Account)\nUses Anti-Cheat Software\nIn-house cheat detection system\nLanguages:\nInterface\tFull Audio\tSubtitles\nEnglish\t✔\t\t\nFrench\t✔\t\t\nItalian\t✔\t\t\nGerman\t✔\t\t\nSpanish - Spain\t✔\t\t\nSee all 11 supported languages\nContent\nIncludes Interactive Elements\nIn-game purchases, Online interactivity\n\nIncludes 27 Steam Achievements\nNo Move Duelist V\nSpot On! II\nAce II\nAce III\nView\nall 27\nTITLE: GeoGuessr Steam Edition\nGENRE: Action, Casual, Free To Play, Early Access\nDEVELOPER: GeoGuessr\nPUBLISHER: GeoGuessr\nRELEASE DATE: 8 May, 2025\nEARLY ACCESS RELEASE DATE: 8 May, 2025\nVisit the website External\n Instagram External\n X External\n YouTube External\n TikTok External\n Reddit External\n Twitch External\n Discord External\n Facebook External\nView update history\nRead related news\nView discussions\nFind Community Groups\nEmbed\n \n \nEarly Access Game\nGet instant access and start playing; get involved with this game as it develops.\n\nNote: Games in Early Access are not complete and may or may not change further. If you are not excited to play this game in its current state, then you should wait to see if the game progresses further in development. Learn more\n\nWHAT THE DEVELOPERS HAVE TO SAY:\nWhy Early Access?\n“GeoGuessr is a game best experienced with a thriving community. By launching in Early Access, we can refine the gameplay, introduce new features, and ensure the best possible experience with direct feedback from players. Our goal is to create the ultimate competitive and casual geography game, and Early Access allows us to evolve alongside our players.”\nApproximately how long will this game be in Early Access?\n“We expect to remain in Early Access for at least six months, but this may change as we develop new features and refine gameplay based on player feedback.”\nHow is the full version planned to differ from the Early Access version?\n“During Early Access, we aim to expand GeoGuessr Steam Edition with new game modes, maps, and competitive features. We plan to refine matchmaking, introduce more customization options, and enhance the overall gameplay experience with community-driven improvements. The goal is that the full version will reflect a more polished, content-rich experience based on what players love most.”\nWhat is the current state of the Early Access version?\n“The current Early Access version of GeoGuessr includes unlimited free Quickplay Solo Duels and Quickplay Team Duels, whereas competitive Solo Duels requires a Steam Pass. Players can compete against users from all over the world, explore diverse locations, and climb the ranks in competitive play. While the core experience is already solid, we are continuously refining mechanics, UI, and progression systems to enhance long-term engagement.”\nWill the game be priced differently during and after Early Access?\n“The price will not change for the duration of Early Access period. Nor is it likely that we will increase the price upon ending Early Access, but if we do, we’ll always provide clear communication before making any changes.\nPlayers who join during Early Access will retain access to all updates throughout development.”\nHow are you planning on involving the Community in your development process?\n“Our players are at the heart of GeoGuessr. We’ll be actively engaging with the community on Steam discussions, Discord, and social media, gathering feedback to fine-tune gameplay, balance competitive features, and introduce new content.”\nREAD MORE\nPlay GeoGuessr Steam Edition\nFree To Play \nPlay Game\n \nRECENT EVENTS & ANNOUNCEMENTS\nView All\n\n2.0: Free Quickplay Duels!\nMon, October 27, 2025\n\nGame updates regarding free-to-play\nTue, June 3, 2025\nSee all updates (Latest: Oct 27)\nSee all discussions\nReport bugs and leave feedback for this game on the discussion boards\n\nABOUT THIS GAME\nThe Free edition includes unlimited Quickplay Solo Duels and Quickplay Team duels.\n\nIn-game purchase of 1 year Steam Pass is required to play Competitive Solo Duels, or be on an Unlimited Yearly or Elite Yearly subscription.\n\nGeoGuessr Steam Edition takes you on a journey around the world, challenging you to recognize locations an",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game i got cooked by two italian gypsy's i know that they were hacking i just cant prove it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, but I don't think the free version is where it's at. I will probably need to pay for it soon because it seems like I'm playing against either AI or players that are cheating. It's pretty laid back and I enjoy it a lot otherwise. I will try to pay for it and see if that is a more realistic experience though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, makes fun with friends and its for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game to play with your friends! But kinda boring if other google the location.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, although removing the subscription required to play competitive would’ve been nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and relaxing game, especially if you enjoy traveling and exploring new places.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in my opinion this game actually interesting , but when i played a wingman mode he got AFK , and developers please improve music quality",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just for game awards progress lol. Tho overall its pretty fun and entertaining with a friend, idk how about solo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever made, it is a pure effort from the developers. I have seen no graphics better than this in the entirety of my life. It deserves to win the Noble peace prize for simply existing as a tool in this cruel world. It is a light upon the industry in which it resides. All other games should take inspiration from this revolutionary style and immersion. No experience comes close to the level of beauty this achieves. I would even suck the dick of the devs for how amazing this is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game. But you need to pay a suscription if you wanna have more experiences and locations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for the love of GeoWizard. it's a great and fun community nowadays. there is so much things to learn about the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun but could be more fun if it was with a party function like the browser one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In every run I think it's my country and in the only time it really is, I miss it. Love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it would be better if we can buy it once. Not to subscsribe every month. \nBut its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, but to avoid being a suсker, you have to remember the countries.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even though its better than it was on launch in its current state there is no real reason to use it over the browser its just simply slower to load.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GeoGuessr is very fun, especially with friends. Playing against others is exciting, and it’s a great game to chill and relax with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game. I have a lot of fun playing and it's educating too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is sit and relax game. THis game helping us to learn world..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to suck at, kinda sucks the steam version doesn't seem to have all of the web-based version's features",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This version of GeoGuessr is great for casual & free 2v2 mode.  If you plan to try hard 1v1 you should probably get the browser version. Either way, super fun game! 10/10 recommend & it makes you think stronger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game, but only free quick games... c'mon, even some free 5 league games will be more interesting for everyone than replaying quick game mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The concept is great but I dont see much difference between the web version and the steam version fo rnow atleast. Hoping we get more optimizations and desktop game features!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a nice easy game and makes fun, unfortunately competitive playing is hidden behind a pay wall, if you are willing to only play against bots it's funny nevertheless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game to play for aged care residnets that enjoy seeing the diffrent places in the world and it makes it like an armchair travel simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, but Gaben's mother is a whore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“GeoGuessr is a fun, addictive, and educational game that makes exploring the world exciting. Simple, engaging, and perfect for quick sessions — highly recommended!”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly not happy with how the game is mostly behind a play wall. Would be nicer if its more intuitive with friends and etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very good way to show how little you actually know about places.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but hard for people who are not good with geography",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, and getting better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. It's simple, smart, and super addictive. A must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can really recommend Geoguessr, I play it daily, but I don't see the point of playing it on Steam when the browser version is so much better. I just installed it for the achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill, fun, and surprisingly addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice and fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GeoGuessr a cool game especially for two people. When you play, you not only have fun but also learn about the places in other countries.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Прикольная игра, после буквально 1,3 часа я стал лучше ориентироваться на земном шаре и хотя бы примерно угадывать место положение нужной страны,но есть нюанс что в команде с другом бывает не заходит поэтому 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sadly it's not like the browser variant. Would love to see multi-player for player made maps and be able to play player made maps in this version.\n\nJust 1 tot 1 copy of browser edition we need.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Steam version is heavily limited unless you subscribe but it is a fun geography based game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "where do I even start? It’s supposed to be educational, right? Learn about the world while having fun they say. And yes, it does teach geography. I now know that Russia is really big, and yes, roads in some countries are just straight lines to infinity. Super useful knowledge if I ever… get lost in Siberia.\nBut let’s talk about my personal experience. GeoGuessr is basically a game that turns me into a very stressed-out anthropologist. I stare at a random street corner in Kazakhstan for fifteen minutes, analyzing the power lines, the dirt, the exact angle of the sun, while my brain screams, This is literally useless information But also, I feel accomplished because, somehow, I guessed within 500 km. Victory! A small, meaningless victory, but victory nonetheless.\n\nNow, the Americans. Oh boy. I wouldn’t recommend this to them. GeoGuessr for them should come with a warning label: Harder than Dark Souls. Prepare to cry.\n\nAlso, the irony: you learn geography but your self-esteem dies. You’re supposed to be learning, but really you’re questioning your life choices while staring at a dirt road in Mongolia, thinking, How did I end up here? How did my life bring me to this? The game is practically therapy if your therapy involves existential dread and global humiliation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game if you have a friend to play with, but it is okay to play alone too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game...very fun to play and it also improves your observation skills and general knowledge about the various parts of the world. The game was not optimized and was a bit broken at launch but now it feels pretty smooth so do give it a try. Game on!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is really simple but great. Playing duos with friends is really fun even tho i only won like 1/7 games. Deff recommend if you and your friends are bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ну игра впринципе четкая, так же считаю что в аргентине есть абсолютно все.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is quite fun when you play with your friends and I suck at this game sometimes lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's cool and interesting game, where you can really improve your geography knowlege. It's interesting to see how other people live, study their font to found the country, and looking for every detail to point the exact location!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun and all but like you cant get past bronze league without a pay wall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good port of the original website game.\nBut i want them to implement all the modes to it so it would be even more fun to play on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love playing the game in my browser, but here a lot of features are still missing... I appreciate the effort tho!\nAND PLEASE ADD COUNTRY STREAKS HERE PLEASE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, don't understand the problem with the reviews. Works just fine, I didn't have to pay or anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, but its missing a lot from the browser version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play co-op with friends against other players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The steam version is cut down a lot and poorly optimized (And I mean POORLY). But still a fun way to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love playing this game, the fast paced mini-matches it has really makes the game not drag on and makes it fun to play. Used to play the web version of this but this is a lot more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The reviews being pretty negative are definitely biased and based on the launch state of the game which was definitely rough.\r\n\r\nWith the recent addition of a free unranked 2v2 mode making it not entirely subscription based, I definitely feel as if I can recommend the Steam version of the game, however if you're going to buy the subscription (like I have), it's significantly better value to purchase the browser version to get access for single player and just use Steam for ranked PVP.\r\n\r\nTbh my only major gripe is that the achievements are pretty much impossible to get without putting thousands of hours into just the PVP, which is only one part of the whole GeoGuessr experience, plus I feel as if they should include the single player modes in the Steam port in the future :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overall good game just like the browser game, what can i say its geoguesser on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good geoguessing game but i heard somethings are bad with this game, maybe i recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, but its missing a lot from the browser version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overall good game just like the browser game, what can i say its geoguesser on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its geoguessr. I only got this because it came free due to my geoguessr membership. I still prefer the web version tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, but i feel like a lot of players just use ai to find the location instead of actually trying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sometimes its hella broken and need more attention and updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Одна из лучших игр! Занятная + учить страны.\nOne of the best games! Fun and helps you learn about the country.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game where you can have a good time both alone and with a friend. I love games that test intelligence and wit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almaniya bayrağı gördüm elə bildim Berlindi, Naxçıvan çıxdı.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "Pay to play and not even optimized. Respect your player base pls",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "No Singleplayer, Locked behind paywall... No more to say else then that im heavenly disappointed...",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "This game is a piece of trash. The free online version is way better. Do not download it to buy the premium.It's not even a premium, it's a subscription.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "-Competitive matchmaking is too expensive.\n-Some enemies, at least in free mode, act like bots.\n-Locations are repeated, often capital cities.\n\n[b]However, what bothers me most is the price of competitive play.[/b]",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I enjoy the game but, there is no way to play against your friends. The biggest negative side is that it requires a yearly pass to play ranked, and its not possible to link your steam pass to the web version.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "almost every feature locked behind paywall.. no singleplayer bruh",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Not all too great, it works all right the interface is pretty mid, but in my opinion there shouldn’t be a difference between the web version and steam version, also theres just too much in game purchases for what the game is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pay to play.\nI would not even mind if the game cost £30, stop with the horrible subscription modelling.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I actually can't believe how poorly the steam edition of this game runs compared to the browser version.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "GeoGuessr is one of the most frustrating and poorly designed games I have ever used. The absence of a simple one versus one mode for friends is unacceptable and shows a complete lack of understanding of what players actually want. The game presents itself as a polished product, yet it fails at one of the most basic forms of competitive play. This failure makes the entire experience feel unfinished and careless. The interface feels restrictive and outdated. Every action feels slower and more irritating than it should be. The game seems determined to prevent users from enjoying it in the way that makes the most sense. It creates needless barriers that turn what could be a fun and engaging activity into a tedious and disappointing chore. The design choices show no clear direction. Features that should be easy are buried behind confusing menus or are simply not available at all. It feels as if the creation of this game focused on everything except the actual experience of the player. There is no sense of improvement, no sense of progression, and no sense that the team behind the game understands how players interact with competitive map based challenges. The lack of meaningful updates to fix simple problems sends a clear message. The game is not built around the needs of the community. It is built around a narrow vision that ignores obvious improvements. The result is a product that looks impressive on the surface but falls apart in actual use. Using GeoGuessr for any form of direct competition with friends is an exercise in frustration. The game refuses to provide the most essential feature that would make it enjoyable. Every time you try to play with someone you know, the game works against you instead of with you. It ruins the experience and removes any excitement the game might have had. Overall, GeoGuessr feels like a wasted opportunity. It could have been a simple and enjoyable challenge between friends. Instead, it is a restrictive, stubborn, and poorly planned product that does not respect the time or expectations of its players.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sorry but i have to leave a negative review this version of geoguessr is not ready it needs a lot of updates if you buy the subscription you only get competitive also idk if everyone has this but sometimes i get a random grey screen and it doesn't leave till i restart the game as you might guess that can be really annoying in comp games",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "- Add a free single player mode\n- Lower costs for competitive\n- Optimize performance\n- remove bots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't understand why you would buy this on steam? now i have two versions of the game for like $70 bucks total..per year. You can only play competitive solo on the steam addition. no competitive multiplayer. fun addicting game especially with friends but this is pretty ridiculous.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Should have been free to play within steam or at least make it so that you get some real competition as well not just clankers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gave doesnt work well it also is very laggy all the time and I had to uninstall because it was bugged and I couldnt play. I have a 4090 its not posible for this google maps game to crash........",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but only you can play with your friends duels against other duos, so keep in that mind",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lacks lot of features and game modes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "“GeoGuessr Steam Edition is a great concept: the visuals are clean, the interface is smooth, and the core idea of guessing locations around the world is still as addictive as ever. The problem is the subscription. You’re already buying the game on Steam, and then you still have to pay a recurring fee to access the full experience. That instantly kills a lot of the value. If it were a one-time purchase, this would be an easy recommendation, but with the extra subscription on top, it just feels overpriced. Fun game, bad monetization.”",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its good but I don't really want to pay 3 quid for competitive gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not offer half the functionality of the browser game, terrible UI and the game does not allow you to log out. Lots of design flaws and terrible consumer friendliness.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "кусок говна ебаного. работает как залупа через раз. карту не грузит. кидает челов которые за пол секунды угадывают. думаю разраб страдает диареей раз высрал такую дресню. желаю ему искренне негатива.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "making most features in this game locked behind a paywall is crazy and dissapointing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A very interesting and unique game however the subscription is too expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game, but DO NOT PAY for it. the online version is free and single player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun but not being able to play against friends unless you pay a monthly subscription is scummy at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says i can buy a 2,5 euro monthly pass but it takes me to a yearly buy for 29.99 euro, just play on the browser, at least until its done being early acces.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game but theyre greedy and bc of this game is sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no singleplayer for some reason, the one round of online i played the other person guesses within 5 seconds of the round starting. very dissapointing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks. There is no way to play against your friends and all the people you verse are bots. It is also pay to play even though it is a free download. They put this game on the store as \"free to play\" when in reality it costs $30 just to have it for a year.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "прикольная игра, но почему подсуживает испаноязычным игрокам, сколько раз с ними попадался, всегда попадаются страны испаноязычные, победить там просто нереально, они все понимают, а РФ попадалась мне всего один раз и то глухомань без надписей, а еще что бесит, что время от времени карта лагает и появляется просто белый экран вместо карты, только выход из игры помогает",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GeoGuessr — это увлекательная 🤩 и образовательная 🧠 географическая онлайн-игра, которая превращает обычное рассматривание карт в захватывающее приключение! 🤯 Игра бросает вам вызов, помещая вас в случайное место на Земле 📍 с помощью панорам Google Street View, и ваша задача — указать это место на карте мира! 🗺️",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enjoy the game but, there is no way to play against your friends. The biggest negative side is that it requires a yearly pass to play ranked,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game of shit....\nwhen you meet guy from f.e Brazil, but he now fucking each сm in the West Tajikistan",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think this is the worst marketing move I have ever seen. The developers don't give a fuck about the community, they only care about money. Remove this fucking monthly subscription. It must be a one-time purchase if you don't want your game to die completely. I'm keen on geography. I really like the idea and concept of the game, but I DON'T LIKE the devs' attitude towards us. Also, the game has zero optimization, and there are too many cheaters and bots. Fix your peace of shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game itself is ok but keep playing the browser version, Steam release is purely a subscribtion grab, not worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mega slabe ogolnie takie kurwa chujowe strasznie dziala od niechcenia naprawde nie polecam wolalbym chyba sobie wsadzic zarzace prety w oczy niz odpalic te gre na wiecej niz godzine",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dogshit game. Dont google you will be banned. everyone is googling and you cant do shit.  Also tons of bugs. not worth the time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You limit how often people can play your crappy google maps guessing even after forking you over 30 dollars per year, and still attempt to advertise yourself as free. If you want something similar and free just use open guesser.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Imagine being so greedy that you think it's a good idea to lock almost every game mode behind a 30-dollar yearly subscription. Who in their right mind buys a game only for one year for 30 bucks? They also locked the achievements behind this paywall. The price is already too expensive for what it is (a geo-guessing game), but at least it would be a bit better if a single lifetime payment could be made. Until then, I wouldn't recommend this game to anybody.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay to play, the mobile version has way more content and also available to play solos, events for free that you cant even play on this version",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall i do recommend playing but not in its current state. i like that you can play geoguessr for free now but the game is not optimized at all and even on good pcs you will have 3 fps at random times, as well as black screens",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY AM I FORCED TO BUY THE SUBSCRIPTION FOR 1 YEAR??? \n\nLet me buy it for 1 month...maybe I don't want to play competitive in 2 months, therefore the subscription would be useless.\n\nWhat a joke of a scam...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has basicly every feature behind a paywall subsription, while the game is fun you cant really do anything besides solo duel. Devs fix your shit!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game pretty funny when you beat someone with locations that are close to them irl but my main gripe is that the game feels too repetitive every location is going to be in the capital of the country you are in I want to have more verity maybe more small cities unique locations etc instead of just a city or in the outskirts of a city and im not paying!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wait. So I'm subscribed to the game online.... I can use that profile on steam, but I have to pay for a separate subscription to play on steam? The greed is INSANE lmao. \n\nAnd to have to wait a week to rank up is ridiculous. I have to wait two weeks just to play the game mode I want to play. Better make sure I have auto-pay enabled!\n\nAlso, you have to pay double if you pay monthly vs yearly, BUT, you can only access parts of the game if you pay for a year in full.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its all fun and games until you reach to another rank and YOU HAVE TO PURCHASE IT!!11!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's almost always Latin America or Southeast Asia. I'm tired of it. Europe is very rare.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It needs an option to adjust graphics asap. It needs to be able to auto transfer achievements for users who have  played previously via broswer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Many bugs such as cant use the map can't see anything on my screen or interact with any of the interfaces. Mainly getting completely white screened",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot play solo and now pushes you to buy their steam pass. Nothing like the normal web version.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy mess. \n\nGreat fun with a friend, if it worked the way it should. \n\n1 - Constant black screens and crashes, would it not be better to use the steam version of a browser to launch google maps instead? \n2 - Arrows and clicking on road surfaces works on normal google maps, so how did you break that here? Once the click on the road will work, another time good luck you have an invisible wall in front of you and need to use an autoclicker on the arrows otherwise the holding space thingy will accidentally mark a guess on the map if you clicked in a rough area and now you have few seconds left lmao.\n3 - How did you manage to make the quality so bad sometimes? No matter the graphics version you click you will have times where everything is really blurry for ages. \n4 - Achievement not unlocking or taking any progress. We got a few 5k point guesses none of which registered. I manually had to use SAM to unlock the 10 5k guesses achievements after confirming it with my friend and I am hoping to come back to a fixed game.\n\n4 - Price lock on competetive? Seriously? \n5 - From what I see Americans, Russians and Brazillians have the attention span of a toddler. Can't understand the language? Click anywhere? This last point is just the fact we encountered so many idiots.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i read all the negative comments about the bots, but what's actually funny, is that i even didnt get to wittness it since the game DOES NOT even launch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Blatant cashgrab with few small features. Not worth of your time and money. There are better free alternatives you could try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "99 percent sure the guy i went against was cheating but couldnt report him just play openguessr at least you can do singleplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the 1v1s are fun but insane that you gotta pay for google maps lol just play openguessr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun but actually pay to play which is not a cool move",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its not that bad but still the pass is the worst i'd rather pay 15$-ish one time than this shi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it has a leaderboard where it takes like 15 matches to complete and your stuck with bots, when you finish the leaderboard it asks you to either pay or reset all your progress",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cheaters cheaters and cheaters always at point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "decent but too expensive and not the same as on the website",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is trash, whats the point in uploading it on steam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is sooooooooo much better when played through a browser.\n\nAvoid this version imo!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My main complain about this game is subscription.\n\nIm fine with paying 2.50 per month, the problem here however, there's no \"monthly charge\", you get subscribed annually 29.99. Add option for monthly charge.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You can't link your web and steam accounts and it's misleading to suggest getting a pro account.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a bit fun but only have 2 mode \nThe original version is so much better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow, this is really bad. Terrible performance, buggy and much more limited than the browser version.\nMaybe the devs wanted to try out the Steam integration? I can't think of another reason to do this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only free edition without chance of getting a real opponent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game. Also, ignore the positive bot reviews.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game but better played in a browser",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horse shit. Either the map disappears or the location disappears. Bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit, it's nothing like the web version back in the day",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a piece of shit , just crash and nothing comes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game, cant 1v1 with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Лагающая хрень, с читерами и без рейтинга",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't play single player. You have to pay to unlock stuff. Greedy company don't play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix your game, its very buggy, i don't recomand to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its pretty dirty to force people to but an yearly subscription considering most will abandon the game after a few weeks maybe a few months",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot of bug, sometimes the map is gone or just show black screen with arrow",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game but cant inv friends to solo duel",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is buggy, is unplayable and not optimized at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad game full of cheaters who guess the EXACT location within 5 seconds",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be able to play geoguessr for free on steam version, now its the same as the browser version. Theres literally 0 reason to get a fucking geoguessr subscription. Unless you are a content creator and can afford or some geoguessr pro",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "literally bugs out and you cant guess most of the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont waste ur time. win 10 games in a row and u get promoted to silver and it makes u pay for the game just like the online version",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "runs very slow and doesn't work half the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im not playing a subscription based game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Steam Client is kinda awful compared to the browser. Just use that instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont download if you have a weak pc better play it on internet very badly optimized",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this everything goes black and glitches out",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't even care about paying to support the devs but subsciption instead of one time purchase? Nah get outta here",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why cant i just play alone \n\nthis game is also ass and greedy devs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible they make you pay 60 dollars just to get full access",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not free to play, must have a subscription. Only has competitions, no singleplayer or anything that is in the browser",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "laggy as hell after a few games on a decent computer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a<SZDFGHJKLÖLKOJUHYGTFREWZXCDFD X XERD CDRC TVF  GVTGB YBGYHNUNHUHNVFCDRB EXSVRC D  TFV VR5DC WXACXTNHUMJIK,JHGFDSSDFGHJ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EVERY THIRD MAP IS INDONESIA OR PHILLIPINES PLZ MORE EUROPE COUNTRIES!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much micropayments",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most greedy and money hungry scamproject ive ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of ruzzian cheaters just like CS2",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game makes me wanto put my balls in a blender",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}