{
  "positive": [
    {
      "review": "This game made me very happy.\r\n It's said we lose interest in games as we get old. I think the problem is the games, not us.  I was always looking forward to coming back to play more. Bloodrayne made me feel the same way when I played it a month ago. \r\n The game is beautiful in many ways. I took the \"fusion\" ending and it made me happy. Now I'm going for new game+ and the other ending. \r\n This game is proof that making a AAA game won't doom your company. Passion, care and creativity can still exist in this space.",
      "voted_up": true,
      "votes_helpful": 157
    },
    {
      "review": "The combat is sick, the bosses are great, and the camera definitely has its own agenda. The story? Pretty good. The vibes? Immaculate. The jiggle physics? Working overtime.",
      "voted_up": true,
      "votes_helpful": 114
    },
    {
      "review": "Great game, nice story, gooooood outfits",
      "voted_up": true,
      "votes_helpful": 54
    },
    {
      "review": "I've finished the game twice now, on easy and normal. This is a really good soulslite/soulslike beginner-friendly game, very easy to get into. This is a perspective of a player that did not play or did not get far into Dark Souls, Elden Ring and Sekiro.\nIt's very accessible, and gives you lots of help and tools to succeed and will let you see the full story, including a visual assistant for dodging and parrying on easy mode.\n\nThere is indefinite New Game Plus mode, you can keep your outfits and gear and keep going over and over.\n\nWhen it comes to purchasing, when I went to unlock some hairstyles and (some raunchy) outfits, I was sure because it was a Korean Game that I would have to put out some serious cash, but no, everything in game is in-game currency or achievements (there's costumes in the store as dlc, that's fine)\n\nThe Nikke and Nier outfits bought as DLC were earned in a cool minigame and hunt fashion, instead of them just magically showing up in your inventory, have to work for them, which is nice, it feels earned. The Tachy suit is placed on the bridge in the city.\n\nThe voice acting is very good, Eve in particular. You can change it to native korean if you want which sounds great too, a little more natural maybe. Performance was pretty okay for me on a 5900x and 5070 on 1440p High. I sat around 70-80 fps, but had to turn down the world 4k textures to high, some rock faces were a bit blurred. I did not experience any crashes. The only issue I had was cutscene stutters, but i believe thats a common unreal engine problem.\n\nThe Boss fights have simple mechanics and strategy, doesn't take too long to get the rythym but I haven't completed hard mode yet..there may be too many trash mobs in the open world at times, but they do let you avoid some groups, and some gun types help with groups. I really like the Buildcraft with the exos and augments, cool different types to use, ie-i had to switch to a beta/charge build set to finish the last boss of the game on normal.\n\nThe more I play this game, the more interested in the lore and characters, I wasn't completely enthralled with the story, but the game is actually just real fun to play, and not just gooner slop.\n\nThe music is absolutely a 10, that soundtracks are constantly living rent-free in my head all the time.\n\nI cannot wait to get my hands on Stellar Blade 2 when it arrives and likely will buy a copy on here and PS5.\nIf you are interested in Stellar Blade but are not a good player or don't overly like souls games, it might be a good starting point. Be wary though, it is still a souls like game; dodging, parrying, heavy hits, surprise attacks from behind barrels, etc.\n\n9/10",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "It takes a lot of self control to keep my arms on the controller.\r\n\r\nAlmost 20h in 2 days,\r\nVisuals/ OST/ game play and story are great but the best part is EVE :)",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Fun music and graphics are great.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "[b]PlayStation[/b] did a good job with this one from [b]SHIFT UP[/b].\n\nStellar Blade is an outstanding game that feels more than average hack and slash due to the potent [i]story[/i].\nThe gamplay is pretty good and feels really comfortable, levels and skills are solid. They almost found perfect balance between too much and being a ripoff from other combat styles, now about the combat, this is one of the strongest points here because it is smooth! This doesn't feel like trying, it's teaching you steps to be better and better.\nMusic hit the spot roaming around. You don't really need a beast pc to enjoy Stellar Blade and it makes it approachable, dlcs are pretty fire but I didn't get any of those, try the demo and then buy it on sale!\n\nStellar Blade is a 9 out of 10.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3583677857",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Great game, visuals, combat, story & sound tracks.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "[b]The visuals, the assets... They knew their audiences...[/b]\n\nJokes aside, \n\n[h3]Pros: [/h3]\n\n- I'm so surprised. The gameplay and combat mechanic are solid. I don't know exactly how to describe it, but the combat mechanic against common, uncommon and rare enemies is like hack and slash-y, or you can use that dodging mechanics (like Souls-like games) and perfect parry (like sekiro-like games).\n\nAnd then come the mini bosses and big bosses. At first glance, it's almost like a souls-like game, but it's not a fully souls-like games (in this game you don't lose any \"collectibles\" upon death and you can revive yourself mid battle with an item).\n\nThe combat mechanic is closer to sekiro-like games in a sense that \"perfect parry\" will rewards you more in bosses combat (you can defeat the bosses faster), and again it's not a fully sekiro-like games either.\n\nAnd on top of that there are tons of super skills moves that you can unlock and use that sometimes could hugely help you in combat.\n\nAnd you can interrupt any bosses moves as long as your timing is right and you are brave enough.\n\nAnd yes, you can adjust the difficulty settings if you wanted to.\n\n- Visual/Graphics/Scenery looks good. And it's one of an optimized Unreal Engine game at least on my end (and it's rare instances for UE games in this day and age)\n\n- You can get tons of customization for your character to make her looks more \"appealing\". So if this is cup of your tea. Enjoy and feast your eyes!\n\n- And yes, this game has an advance built-in photo mode.\n\n- There's a boss fight mode. If you just want to fight the bosses and nothing else.\n\n[h3]Informational:[/h3]\n\n- The story is so subjective. It could be good for some, and it could be boring for some too (like a little bit predictable or some sort)\n\n[h3]Cons :[/h3]\n\n- In some areas like wasteland and great desert. It's a large semi open world area, and the majority of it consists of Rock and sand, with a sprinkle of scrapyards here and there. \n\nIf you want to use fast travel features, you need to activate the camps/checkpoints, and to do this, you need to reach that location on foot (either run or walk). Visually, it still looks good, but the exploration could get boring the more you do it, especially if you are on multiple New Game+ (NG+) runs already.\n\n[b]All in all, I really recommend this game.\n\n8.5 / 10[/b]",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Stellar Blade knows exactly what it wants to be and doesn’t pretend otherwise. Tight combat, satisfying parries, flashy skills, and bosses that actually punish bad habits instead of just soaking damage. Once the combat clicks, it’s hard to put down.\n\nThe world looks great — ruined cities, weird sci-fi vibes, and solid atmosphere throughout. The soundtrack goes way harder than expected and carries a lot of the big moments. Story isn’t groundbreaking, but it’s good enough to keep you moving forward without getting in the way.\n\nPerformance has been solid for me, and the controls feel responsive, which is honestly the most important thing for an action game like this.\n\nIs it perfect? Nah. Some side content feels a bit repetitive, and the story plays it safe at times. But the gameplay absolutely carries the experience.\n\nIf you’re into stylish action games with rewarding combat and don’t mind a straightforward story, this is an easy recommend.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Stellar Blade is a pretty fun game and It has some good lore.\n\nNever really understood the hate it got.\n\nAlso got a free Scarlet skin so that's pretty neat (even though I don't have her yet).",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game for sure, but it’s bogged down with tedium and honestly extremely weak endings.\r\n\r\nThe action gameplay is fun and fast paced—like a cross between Dark Souls and Nioh. The dodge and parry mechanics are paramount. Sound design is incredible, exploration was fun and rewarding, and the character performances were extremely strong. I played the game in its original Korean dub, and when I compared that to the English dub, there’s no contest—the Korean dub is superior in every way.\r\n\r\nThe story was interesting, if a little lacking at times. My main gripe is that the main character EVE doesn’t really have an arc. She learns plot-relevant information on her journey and reacts to it, but she doesn’t change as a person by the end and that’s honestly extremely disappointing. And the “tedium” I mentioned was all those damn side quests… I’m cool with side quests but these ones amounted to “find this thing.” After a couple dozen I just kind of abandoned them and plowed through the rest of the story.\r\n\r\nI experienced all the endings, even the secret one that I had to look up because I didn’t finish all the side quests, and they’re… serviceable at best and maddeningly hollow at worst. The secret ending is without a doubt the best one but after everything is gone through in-game it just kinda felt like an afterthought.\r\n\r\n7.5/10 for this one. I understand a sequel is in development, so I can only hope that they turn out an even better experience.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I am honestly disappointed by the amount of people that see this game for its main mc as a sexy female with costumes and thinking : \"Ah that type of game\" without even playing it.\n\nThe game itself is really inoffensive on the mater of nsfw content ( none, but some daring costumes ).\n\nThe game delivers great combat and a solid story to go around that becomes progressively more interesting. It is one of the few games that does not get repetitive with its quests.\n\nHonestly if you think of trying it out but the stereotype of \"gooner blade\" stops you just ignore that. The game is actually good as a game, great story, great questlines, great combat, great graphics, surprisingly well optimized on underpowered hardware and you have the addition of some nice costumes and character customization. \n\nWhy the f. aren't more people playing this ?",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Fast-paced action game that delivers from start to finish. The combat feels smooth and satisfying, the world is visually stunning, and the soundtrack is incredible adding real emotion and energy to every fight and scene. Eve is a great protagonist, the story is engaging, and the whole experience feels polished and memorable. Easily one of the year’s best games.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great music, great booty, great game. 10/10 would save humanity again.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "So, people, wipe your drool and get your hands off the table. Let's talk about Stellar Blade. If you've been online in the last six months, you've seen Eva. You've seen her costumes. You saw her climbing the stairs. Koreans from Shift Up, of course, are marketing geniuses - they sold the game with one \"physics\" of the body.\n\nBut I'm not here to discuss the size of the polygons on the main character's ass (although, come on, 10 out of 10). I went through this piece of Korean gambling and now I'll tell you if there's a game behind all this latex at all.\n\n• Visual: Koreans know what we need. Let's close the topic right away: yes, Eva looks like she escaped from the wet dreams of a 15-year-old teenager. There are a mountain of costumes, and each next one reveals more skin than the previous one. The developers didn't even try to pretend that it was a \"deep drama\". But if you distract yourself from the heroine (which is difficult), the graphon is really juicy. Post-apocalyptic Earth, destroyed cities, deserts - everything shines, sparkles, Unreal Engine 4 is squeezed dry. The enemies are some biomechanical freaks, Find, they look disgusting and cool. Monster designers - a prize, Eva's costume designer - a monument during his lifetime.\n\n• Gameplay: Suddenly, it's not just a \"walking simulator\". I expected it to be a one-button slasher, where you just mash the \"square\" and watch the bodies shake. But the fuck was swimming there.\n\n• Fight: It's, damn it, almost Sekiro, only in heels. Parries, dodges, perfect blocks. The enemies are hitting painfully. If you stupidly squeeze the attack, you will be smeared on the asphalt in two seconds. The impact of the blows is my respect. You can feel the sword entering the flesh.\n\n• Difficulty: The game sometimes allows you to light a cigarette. Some bosses make you sweat and swear. You have to learn patterns, not just admire the views. It was a pleasant surprise.\n\n• Pumping: Skill tree, exoskeletons, upgrades - everything is standard, but it works. You feel how Eva turns from a beautiful doll into a killing machine.\n\n• Plot: Nier: Automata for the poor. There is a plot here, but it would be better if it wasn't. Androids come down from space to recapt the Earth from monsters. Doesn't it remind you of anything? Yes, it's Nier: Automata, only without the genius of Yoko Taro and philosophical detachments.\n\nEva resembles a toaster in charisma.\n\n- Eva, we need to save humanity!\n\n- Accepted. The task is clear.\n\n- Eva, look, what a tragedy!\n\n- It's Sad. Let's go kill.\n\nThe dialogues were written either by a neural network or by a person who last communicated with living people in 2005. Adam (partner) is a stuffy guy who wants to shoot in 10 minutes.\n\nWhat pissed me off (Aggression mode: ON)\n\n1. PLATFORMING. What the hell?! Who came up with the idea of putting these crooked jumps on the beams into a dynamic slasher? Eva in battle is a graceful doe. Eva on the platform is a cow on the ice. You jump on a rope, it flies by and falls into the abyss. You scream, load yourself, repeat.\n\n2. Linearity of levels. Sometimes they just chase you down the gut. I turned the wrong way - I leaned against an invisible wall. In 2024 (or when it was released there), invisible walls are a shame.\n\n3. \"Serve-bring\" quests. Side quests are boring to death. Run to the other end of the map, kill the mob, come back, get a sticker. I made them only for new costumes (yes, I'm corrupt).\n\nBottom line: Play or draw... ahem, watch? Stellar Blade is a paradox. Everyone came for the \"plot\" (well, you get it), but stayed for the chic fight. If you like slashers, where you need to press the buttons in time, and not just pound the gamepad - take it boldly. It's a high-quality, beautiful, driving action movie. Just turn off the brain during the dialogues and get ready to burn on the sections with jumps.\n\nIf you are a hater of anime style and you are allergic to beautiful women in games - pass by.\n\nRating: 8 elastic buttocks out of 10. (For fighting, honestly).\n\n\n\nТак, народ, вытирайте слюни и убирайте руки со стола. Поговорим о Stellar Blade. Если вы зашли в интернет в последние полгода, вы видели Еву. Вы видели её костюмы. Вы видели, как она поднимается по лестнице. Корейцы из Shift Up, конечно, гении маркетинга — продали игру одной «физикой» тела.\n\nНо я тут не для того, чтобы обсуждать размеры полигонов на заднице главной героини (хотя, камон, 10 из 10). Я прошел этот кусок корейского игропрома и сейчас расскажу, есть ли там вообще игра за всем этим латексом.\n\n• Визуал: Корейцы знают, что нам нужно. Давайте сразу закроем тему: да, Ева выглядит так, будто сбежала из влажных снов 15-летнего подростка. Костюмов — гора, и каждый следующий открывает больше кожи, чем предыдущий. Разработчики даже не пытались притворяться, что это «глубокая драма». Но если отвлечься от героини (что сложно), графон реально сочный. Постапокалиптическая Земля, разрушенные города, пустыни — всё блестит, сверкает, Unreal Engine 4 выжат досуха. Враги — какие-то биомеханические уродцы, Найтиба, выглядят мерзко и круто. Дизайнерам монстров — премию, дизайнеру костюмов Евы — памятник при жизни.\n\n• Геймплей: Внезапно, это не просто «симулятор ходьбы». Я ждал, что это будет однокнопочный слэшер, где ты просто мэшишь «квадрат» и смотришь, как трясутся телеса. А вот хрен там плавал.\n\n• Боевка: Это, блин, почти Sekiro, только на каблуках. Парирования, увороты, идеальные блоки. Враги бьют больно. Если будешь тупо жать атаку — тебя размажут по асфальту за две секунды. Импакт от ударов — моё почтение. Ты прям чувствуешь, как меч входит в плоть.\n\n• Сложность: Игра иногда дает прикурить. Некоторые боссы заставляют потеть и материться. Приходится учить паттерны, а не просто любоваться видами. Это стало приятным сюрпризом.\n\n• Прокачка: Древо навыков, экзоскелеты, апгрейды — всё стандартно, но работает. Чувствуешь, как Ева превращается из красивой куклы в машину для убийства.\n\n• Сюжет: Nier: Automata для бедных. Сюжет тут есть, но лучше бы его не было. Андроиды спускаются с космоса, чтобы отбить Землю у монстров. Ничего не напоминает? Да это Nier: Automata, только без гениальности Йоко Таро и философских загонов. \n\nЕва по харизме напоминает тостер.\n— Ева, нам надо спасти человечество!\n— Принято. Задача ясна.\n— Ева, смотри, какая трагедия!\n— Грустно. Пошли убивать.\n\nДиалоги писал или нейросеть, или человек, который последний раз общался с живыми людьми в 2005 году. Адам (напарник) — душный тип, которого хочется пристрелить через 10 минут.\n\nЧто выбесило (Агрессия mode: ON)\n\n1. ПЛАТФОРМИНГ. Какого чёрта?! Кто придумал засунуть в динамичный слэшер эти кривые прыжки по балкам? Ева в бою — грациозная лань. Ева на платформинге — корова на льду. Ты прыгаешь на веревку, она пролетает мимо и падает в пропасть. Ты орешь, загружаешься, повторяешь.\n\n2. Линейность уровней. Иногда тебя просто гонят по кишке. Свернул не туда — уперся в невидимую стену. В 2024 (ну или когда она там вышла) году невидимые стены — это позор.\n\n3. Квесты «подай-принеси». Сайд-квесты — скука смертная. Сбегай в тот конец карты, убей моба, вернись, получи наклейку. Делал их только ради новых костюмов (да, я продажный).\n\nИтог: Играть или дро... кхм, смотреть? Stellar Blade — это парадокс. Все пришли ради «сюжета» (ну вы поняли), а остались ради шикарной боевки. Если ты любишь слэшеры, где надо вовремя нажимать кнопки, а не просто долбить по геймпаду — бери смело. Это качественный, красивый, драйвовый боевик. Просто отключай мозг во время диалогов и готовься гореть на секциях с прыжками.\n\nЕсли ты хейтер аниме-стилистики и у тебя аллергия на красивых женщин в играх — проходи мимо.\n\nОценка: 8 упругих ягодиц из 10. (За боевку, честно).",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The price is a bit high. Buy it on sale.\nSo far, in 100 hours of gameplay, the game has crashed once, and that was very early on in the game. I tried to recreate the crash, but it didn't occur again. Maybe it was bad luck. The game has otherwise performed flawlessly.\nMy main gripe with the game is that one of the costumes, the \"Planet Diving Suit (3rd) V2\" uses the regular \"Prototype Planet Diving Suit\" as a base instead of the Prototype V2.\n\n[spoiler]Tachy is best girl.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Stellar Blade feels like the beginning of a brand-new franchise with a bright future ahead.\nWhen you reach the end of the game, you get this feeling that says, “Yeah, the real journey is just beginning,” and it leaves you eagerly waiting for the sequel.\nThankfully, Shift Up Studio has confirmed that a second installment is already in development.\n\nThe only real downside of the game—and something I’m sure they’ll improve in the sequel—is the lack of weapon variety. You basically have only one weapon throughout the entire game.\nSometimes, after defeating certain bosses, you feel like you’re about to obtain their weapon, but in the end, you stick with the same one until the credits roll.\n\nThe game has three different endings, and if you explore everything and complete all the side missions, you’ll achieve the best ending with a 100% completion rate.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "What can i say about this game? Great performance on PC, beautiful character, nice mechanic, the story telling is quite enjoyable, lore is awesome. If u can, get it. Please show support to this dev, the game is really worth the price",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I checked out Stellar Blade for the obvious reasons, and was met with the smoothest and most visually stunning game I've played all year.\nPeople have turned this into a meme, but the combat in this game is genuinely Stellar (no pun intended). It's basically a souls-like with light/heavy attack combos, different reactive moves (other than the standard perfect parry or dodge) and it feels genuinely cinematic at times, even when fighting regular enemies.\n\nThe story is sort of barebones, but the world that has been built around it is interesting, and filled with history and memorable characters. The music sets the perfect vibe for this abandoned dystopian sci-fi world, and multiple tracks have made it to my Spotify playlist.\n\nIf you're ever in the mood for a high quality action adventure experience with a bit of eye candy for us \"female enjoyers\", Stellar Blade is a no-brainer purchase.\n\nPS: I've never used photo much so much in my LIFE!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Containing better visual style than most other 'souls-like' games (and not just the protagonist either; the enemies look nice as well) Stellar Blade comes across as 'souls light' to me.\r\nThere's dosens of different enemies but combat comes down to just different timings vs. dosens of different builds like you'd find in Dark Souls or the like. Despite this the game play remains fun & interesting.\r\nNot far enough in to comment on story.\r\nHyung-Tae Kim's art style really shines through on the 'Eve' design & makes the game... interesting... to play as well. It also gives mild hope that the Magna Carta games will one day see an official Steam release.\r\nThumbs up.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you ran out of souls-like to play and are looking for a new game, buy this. It's not perfect, but combat is fun and fluid. Parry system reminds me of Lies of P (an incredible souls-like). It's forgiving but most bosses and creeps feel relatively repetivive.\r\n\r\nPros:\r\n-Combat is incredibly fun\r\n-Eve is nice to look at and you can customize her\r\n-It's challenging at times, but not too much to punch your screen\r\n-It's an easier, sexier souls-like\r\n\r\nCons:\r\n-Can't \"hearth\" or return home at any time\r\n-Cut scenes are long and you can't skip them\r\n-If you enter end game too early, you might have missed out on buffs.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "10/10 - Stellar Blade is my absolute favorite game of all time! Pure perfection in every way imaginable. From the moment I booted it up on PC via Steam, I was hooked – this isn't just a game, it's a masterpiece that blends heart-pounding action, a gripping post-apocalyptic sci-fi narrative, jaw-dropping visuals, and an endlessly replayable modding playground that keeps me coming back for hundreds of hours. I've sunk over 250 hours into it already, and I'm nowhere near done. Shift Up nailed everything here, delivering a title that's as beautiful as it is brutal, with Eve as one of the most iconic protagonists in gaming history. \n\nLet me start with the story because it's one of those tales that sneaks up on you and hits like a freight train. You play as Eve, the last surviving member of the 7th Airborne Squad, descending from the orbiting Colony to reclaim a Naytiba-ravaged Earth. What begins as a straightforward \"humanity's savior vs. monstrous invaders\" setup evolves into a mind-bending exploration of identity, betrayal, creation, and what it truly means to be human (or Andro-Eidos). The twists in the back half – especially around the Elder Naytiba, Mother Sphere, and the Raphael Marks – had me gasping, replaying cutscenes, and theorizing on forums for days. Characters like Adam, Lily, Tachy, and the enigmatic Raven aren't just sidekicks; their arcs weave emotional depth into the chaos, making every dialogue choice and ally interaction feel weighty. The three epilogues added in updates (plus NG+ expansions) offer multiple endings that reward replayability, turning a 30-hour adventure into a 100+ hour saga of discovery. Sure, some voice acting feels a tad stiff early on, but the Korean/Japanese VO options and orchestral soundtrack elevate every scene to cinematic heights – those boss reveal themes still give me chills! \n\nThe levels? Oh man, they're a design triumph – sprawling, interconnected ruins that feel alive and purposeful, not just empty corridors. Xion is a vibrant hub city buzzing with NPCs, side quests, and secrets; scavenging for Vitcoins, blueprints, and outfit materials here feels rewarding and immersive. Wasteland's dusty expanses hide brutal ambushes and collectibles, while the contaminated zones like the Great Desert and Spire 4 deliver verticality with grapple points, environmental puzzles, and hidden paths that encourage thorough exploration. The Abyss and Tetrapod areas ramp up the horror with grotesque Naytiba nests (those glowing eggs in your screenshots gave me nightmares!), tight platforming, and laser traps that demand precision. Every zone ties into the lore – abandoned colonies, flooded ruins, orbital debris – creating a cohesive world that begs you to 100% it. Side quests aren't filler; they flesh out survivors' stories, unlock crafting mats, and lead to heartfelt moments or epic gear upgrades. And the traversal? Perfect parry-dodges into burst slides, double jumps, and wall-runs make zipping through these levels feel like poetry in motion. \n\nGameplay is where Stellar Blade ascends to god-tier. Combat is a symphony of fluidity and satisfaction – Eve's blade combos chain into ranged drone shots, beta skills (those glowing orbs for perfect parries), and burst counters that punish aggression. Upgrading gear at camps (exosuits, drones, amps) lets you experiment with builds: go aggressive with tripods and chainsaws, or tactical with infinite ammo hacks and laser blasters. Bosses are legendary – Gigas' multi-phase stomps, Stalker's acrobatic lunges, Providence's aerial barrages, and the final showdowns demand pattern mastery, perfect timing, and adaptive strategies. Story Mode eases you in with slow-mo aids, but Normal/Hard ramp up the soulslike tension without frustration. Ranged weapons add variety (love sniping weak points mid-combo), and the skill trees branch into endless depth. It's accessible yet challenging, with that \"one more try\" addiction factor cranked to 11. PC port is flawless – DLSS/FSR, unlocked FPS, ultrawide, even Steam Deck verified at 40-60fps. No Denuvo woes post-crack, pure buttery performance. \n\nBut the REAL joy? MODDING. This is Skyrim-level creativity unleashed! Nexus Mods exploded to 2k+ mods in months – One Stop Camp Shop unlocks ALL 125+ outfits (DLC like Nier 2B, Nikke Scarlet included) instantly, no NG+ grind. Play as Tachy, first-person view, infinite beta energy for spamfests, or Ultimate Engine Tweaks for 200+ FPS on mid-rigs. Outfits? Infinite: Psylocke X-Men skins, Bayonetta glasses/hair, Mai Shiranui cheongsams, bunny suits, even Thomas the Tank Engine bosses! Custom NanoSuits let you mix/match – Eve in Alita armor, Viessa bikinis, or pregnancy mods (wild community). Mod Hub/Vortex make installs drag-and-drop easy (~mods folder in Paks). Director Kim Hyung-tae loves it: \"Once purchased, it belongs to the user!\" Replayability skyrockets – new outfits per run, QoL cheats, reshaders for neon glow-ups (those bioluminescent eggs pop!), menu randomizers. I've spent 100 hours modding alone: red Ocean Strings, Eve x Dark Rift crossovers, eye/makeup tweaks. It's a living game, community-driven evolution that fixes \"middling\" bits like photo mode (fan patches incoming). No microtransactions, just pure player freedom.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Tried to play for the Eve fan service,\nStayed for the gameplay.\nEnjoyed both at one time.\n\nGood LORD ITS SO WORTH IT EVEN AT FULL PRICE",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Worth it! Super fun and keeps challenging even after many hours!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the most interesting adventures this year. Beautiful visuals and good combat.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is good, Shift Up, love y'all guys for making Stellar Blade and NIKKE",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "99% of gameplay is staring into Eve's ass. 10/10 that alone makes it worth the price. spent half my playthrough playing with one hand.\n\nJokes aside. Amazing gameplay and visuals and the ost is fire.I recommend not playing the English dub tho as it sounds pretty bad imo.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Goddess Of Victory NIKKE walked, so Stellar Blade could run.\n\nArtificial Hyperintelligence Eve, wife of Maciej Nowicki aside; this game is awesome.\n\nCombat, visuals and soundtrack are amazing, with a story being ...quite mediocre (but that was even said by Shift Up themselfs).\n\nwhile it is quite expensive, get the Complete Edition, the Scarlet boss fight rocks!\n\nalso can't forget how optimized the game is. if it can run on a very mid range PC from 2020 or a Steam Deck in stable frames while looking good and being a Midslop Engine 5 game, other studios should take notes.\n\n10/10, gooning aside, you're getting a great 30h long journey",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Usually i don't look at games from PlayStation with my butta and i admit, it was the graphics that made me look at this one. the visual style is impressive, the combat has that awesome *BAM* to it, the soundtrack is pretty nice on your ears, the story is interesting and might be more accurate as years will go by, it got a lot of love for souls games, but probably wouldn't be in my top 5, top 10 more likey - sorely based on the difficulty, that could've been harder in my opinion - compared to FromSoftware's in-your-face-difficulties, couple of endings.\r\n\r\nthe enemie design is sadly repetative, dunno why they integrated a fishing minigame (love fishing mini games, here it is kinda weird to be part of the game somehow, but like it though), no real gear - just outfits, combat abilities based on rarely found materials to upgrade a non-exchangable weapon,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "People like to talk about disasters of like \"global warming\" or \"x politics\". But you know what we are in desperate need of? We need more HOT women in video games. That's real focus that we need to have. We have a SEVERE drought of HOT women in our video games. And it worries me. \n\nThank, God, that shift up has brought us a lil bit of HOT women into our video game scene. Having a great game, incredible combat and music is just the side course of bringing with HOT women.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Stellar Blade – Short Review (7.5/10)\n\nA strong first entry with gorgeous visuals and a great opening and finale, but a slow, padded middle. The worldbuilding is solid and the story becomes surprisingly grounded once the mystery boxes open, though the villains lack identity for most of the game.\n\nCombat looks stylish but plays more like a parry-focused Souls-lite than a true character-action game. It works, but the emphasis on blocking/parrying limits variety and pacing. The game is at its best when you can use the full kit instead of waiting for counters.\n\nGraphics: 8 – Beautiful art direction and polished environments.\nSound: 7 – Good but not memorable.\nGameplay: 6.5 – Fun, but too dependent on parry timing.\nStory: 7 – Slow in the middle, but the ending lands well.\n\nOverall: A visually striking, enjoyable sci-fi adventure with some pacing issues. Worth playing, especially for the beginning and ending.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I came for the ladies, and stayed for the gameplay.\n\nJokes aside, this game impressed me on every level. It runs fantastically on my PC and well enough on Steam Deck, it looks incredible, the soundtrack slaps, the story is surprisingly good, and the combat is addicting and expressive.\n\nIt's Sony's best selling PC port for a reason, and not just cause Eve is hot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A perfect action adventure game with everything you could ever ask for. Seriously, it checks every box.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After beating this game for the first time I can say its a solid 8-9/10, suggestive outfits aside the combat is super fun and the story/world building is fantastic and surprisingly deep with unexpected plot twists. Light comedy use plays perfectly into the story, you can see the main character grow as you progress the main story, the soundtrack is badass, the boss fights are sick and the animations for everything are top tier. Game design overall is extremely beautiful and I would definitely recommend this game, can't wait to play it some more to get the other endings.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I like this game.  It's fun.  It does get hard for me to see what is going on at times.  This game has a good high-contrast mode which makes it easier to see, but whoever picked the colors for it were either not thinking or making an elaborate joke.  The 3 presets make the enemies red, yellow, or blue, which happen to be the 3 colors that are used for determining what type of attack the enemy is doing.  So with high-contrast on you can see the enemies clearly but you can't tell what attacks they are doing.  I doubt they will ever go back and fix this, but it would have been nice to pick the highlight colors (or at least have some different preset options).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice ass\nNice story\nNice gameplay\nNice ass",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'll admit, I came into playing this game not expecting much but fan service (which I'm a fan of) but was amazingly surprised on how polished the game was. I have not yet completed the story at the time of me writing this review but I'm nearly completing it since I'm focused on exploring the world and interacting with side quests and NPCs. That alone is testament that a game is well done that the mini games and world building keeps you distracted from playing the main story.\n\nI'm going to break my review into three parts, the gameplay, story, soundtrack and extra stuff\n\nGameplay - Fantastic\nI think the only gripe I have with the gameplay is that it couldn't allow me to play on hard mode until I beat the game which was a bummer. Despite that, I was amazed on how engaging the gameplay was, and wish that these mechanics were incorporated in other hack and slash games like the NieR series and such. The gameplay always tries to switch things up to make sure that you aren't always doing the same thing over and over, whether that'd be solving passwords/puzzles, interacting with objects to get across platforms, or changing your approach of fighting an enemy depending on their weakness. The combat itself is probably one of my favorite aspects of this game, I absolutely love games that incorporate the parry system and I'm proud to say that this game didn't half ass it and made it a viable alternative instead of dodging (Take notes Fromsoft). On top of that, the animations of Eve slashing her enemies, parrying, doing finishers, is BEAUTIFUL. You can tell a lot of care was put into making these animations look as badass/sexy as possible, props to ShiftUp for delivering. The games progression system is based off earning points which you can invest into Eve's skill tree which gets expanded as you play the game more, and it's great since you can invest into a playstyle that YOU want, reminded me of Sekiro. When you're not fighting enemies, you're platforming and the game does a great job at making you appreciate the sceneary and making things cinematic for you. As for the enemies, I enjoyed most of them although some got to be frustrating (looking at you invisible starfish), but the grotesque design of them made it very unique and made me happy that I wasn't just fighting robots or something non threatening. You can even fish in this game for god's sake. All in all, great across the board.\n\nStory - Great\n\nTake my opinion on the story with a grain of salt since I have not yet finished the story yet, but from what I have seen so far, I'm impressed with the characters that they introduced to us. Some are alot more flat and boring (mainly the soldiers of Xion) but besides that, the main cast are very likeable. Adam is the first dude you meet in the game who helps Eve out and his JP actor is someone I instantly recognized so I knew I was going to vibe with him and I did. Very down to earth and competent, and his banter with Lily is great. Lily is the third member of the squad who's like your typical tomboy energetic mechanic, really what more is there to say or like? I like that she is one of the few characters that questions the objective and plot of what's going on, while Adam is more compliant which is odd but interesting. Last but not least is Eve, the poster girl and waifu we all adore. She's clueless in that she doesn't know what Earth and human practices are like but it makes sense for her since they were in outer space so it's always cute to see Eve discover things that we do in our daily lives as fascinating, similar to 9S explaining humans to 2B. It makes me annoyed that people had the nerve to trash on Eve for her figure and looks despite her being as innocent as one can be personality wise, goes to show why you shouldn't trust tr00ns or obese women on what makes a women beautiful, men know what gets them going and it doesn't take a rocket scientist to figure out that Eve does. Honorable mentions are NPCs such as Enya and Su, the ones who hang around in the bar. I absolutely loved the side quest with these two characters, and was the one that stood out to me the most. I'm a sucker for late night jazz bars, and this one hit home for me.\n\nSoundtrack + Extras - Kino\n\nThe soundtrack is insanely good, I was impressed how every single area in the game had it's own unique soundtrack, and it stood out too! Some tracks were so good that it was actually annoying leaving the area and not being able to hear it again since it was reserved for a small section in the map. The campfire music is peaceful and soothing and the alternative options that you can choose from on the disc player are great too (I've been playing Blur a lot). The boss music was pretty good, although none of them hit home for me besides Tachy, and I love that they kept her music when you transform to her form as Eve. I still think that the environmental map soundtracks are the best, and Silent Street from Edios 7 which is the first area that the player enters in is the best track. I think it encapulates the overall theme of the game quite well. Well done ShiftUp, they always get great composers for their games (Destiny Child and NIKKE). \n\nAs for the extras, let's start off with the fan service. PEAK. There are so many outfits that Eve has, from a schoolgirl outfit, to casual blue jeans and a shirt, to a one piece swimsuit with tanlines. I mean the possibilities were endless and they knew that when making these outfits. All of them manage to make Eve's booty look great which is not hard to do if you look at her overall figure and who she was modelled from IRL. I was impressed that they gave us such a range of options for us and them being collectables too was a nice bonus. My favorite Eve outfit has to be Wave Oblique Monokini, why? CAUSE TANLINES. The problem with all these outfits is now that you've seen how good they look, you HAVE to get them all and it can be annoying having to look every single place in an area to make sure you don't miss anything.\n\nOverall - Highly Recommend \n\nI'd say this game is worth the time and money to play if you're looking for a good singleplayer game with fun gameplay mechanics, as well as nice fanservice in every corner. People who say this game was astroturfed from the attempt at cancelling it fail to ignore the part where the game has more to offer in the gameplay department, the fan service stuff is just the bonus. It's criminal that this game was gatekept by Sony for so long, and I can't wait to play the NIKKE and NieR DLC after I'm done with the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Combat, movement and exploration is tight, story telling is there and audio/soundtrack is glorious. Even the menus are slicker than they need to be. The main character is the least beautiful thing about this game, thats saying something.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a recommend from me. Combat is stylish and satisfying. Story is good and there is some replayability with multiple endings and unlocks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Smooth and challenging combat? ✔️\nFun exploration? ✔️\nBobs and Vagene? ✔️\n\nThis combo basically never happens in modern gaming, so I’m officially praying for more content like this.\nShift Up, you knew exactly what you were. Keep going.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an amazing game. Cant wait for the sequel. Beautiful female characters + good combat + interesting story What else you want more. Jurnalists are not happy with this one for sure so you know its already a good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed the game.  It certainly has its fanservice elements, but it has an engaging storyline and entertaining combat system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was one of the best games I've played for 2025. The story is amazing. Combat is great. Controls are good, I played on mouse and keyboard too! Graphics were fantastic. Assets. Yep.\n\nThis is a game I'll do another playthrough of later. That's a good af game.\n\n11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The soundtrack is the best part about this game! Graphically speaking this is a very well optimized game. Runs great on a RTX 3060.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought booba, and unexpectedly, a game came with it. A very good game. \n\np.s.\nI would like to mention the incredibly catchy music separately. Even if you don't like this genre, the music will stick in your ears so much that you will find yourself humming it in your head.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade left me happily surprised and genuinely very impressed. All i knew about this game before it released on steam was that the main character has a over the top body. While this is true, and certainly is a reason why some people wont try this game, it is also a reason why people did play this game. Let me state that yes, Eve (the main character you play as) is very over the top body wise but, she is literally a scanned model of the South Korean model Shin Jae-eun. So its actually a pretty fair argument to just conclude that is a realistic interpretation of this woman. I think that's probably where the conversation of \"unrealistic woman\" or \"over the top sexualization to cater to that audience\" should end. I promise if you actually just gave this game a shot you would understand why this game is so highly rated.  this is easily in my top ten games I have played all time. its one of my few games i have given a 10/10 rating.  Stellar Blade has insanely impressive music, I have even added songs from this game into my everyday playlist. Seriously, listen to \"Flooded Commercial Sector\" \"Everglow\" \"Silent Street Battle\" to just list a few from the top of my head. i have songs from this game stuck in my head almost daily and its been weeks since i last hopped on to do some combat. speaking of combat, as i just mentioned, i find myself going back from time to time just to fight a certain boss again. Stellar Blades combat is so much fun. you have options, great hit feedback and really tough difficulty options. playing this game on the hardest settings actually had me stuck for a little bit on some fights and even some areas, it was really giving me that feeling i had back when dark souls 3 first released and i was trying to learn that games fights. Not to say Stellar Blade is a souls copy, and the Souls Like term is used pretty loosely these days, but im not really sure what i would use to explain Stellar Blades combat. i guess it feels like a modernized and polished version of Sekiro, but more of a focus on big flashy moves, instead of simply spamming bosses down. This game features a fighting game like system of combos. so hitting buttons in different orders would provide you with different attacks. Remembering what combo you are doing and using the right one at the perfect time in a fight was certainly a great boost to the skill ceiling of an already challenging game on that harder difficulty. Also this game features a NG+ system and a pretty large skill tree, so lots of flexibility and a constant stream of upgrades and new tools and moves to use throughout your playthroughs. But this game isnt just about combat, all though it easily could've been the main focus. The story of Stellar Blade is so good, i truly think that a major reason why this game is so loved. it has great main characters, great side characters and tons of side missions and interesting things going on in an already interesting setting and universe. Without spoiling anything about the story, the main story is fantastic, you arent too sure of how literal certain things are or if its mostly metaphors. it certainly had me guessing what was going on and even at times if i was even the morally \"good guy\" but the payout at the end is so good and really caught me off guard. plus this game features multiple endings, which really gives you the freedom to do what you think is \"right\" In closing here i would just like the state that i am so glad i ignored the dull insults people threw at this game initially, gave it a chance myself and experienced such a immaculate game. I am so excited to play the sequel that was announced recently. i cant wait to see where the story goes from here and continue to slay Naytibas with Eve.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the great experience so far. The game looks fantastic, but what impressed me more is how smooth everything feels once you’re playing. Combat is very responsive, parries feel precise, and animations don’t interfere with control at all.\r\n\r\nOn a high-end PC, performance is excellent. I’m running high settings with a high refresh rate and it stays smooth during normal gameplay and even in most boss fights. No major stutters or weird frame drops.\r\n\r\nThe visuals and sound design are solid, but the combat is what really carries the game. It rewards learning enemy patterns instead of button mashing, and fights feel fair even when they’re tough.\r\n\r\nOverall, it feels like a well-polished action game that runs smoothly on PC and respects your hardware.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this game. Parry that bullshit. Don't dodge forward on yellow for the love of god.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When I first started this game, I was amazed with how epic everything looked. Thus I thought \"surely this can't get any better.\" and to my suprise it did!\nIt is one of better written stories, you can feel the passion the creators put here.\nThe gameplay was fire, I never was so hooked up on it. You can feel the stakes with each encounter. Each new oppnent is a new puzzle to solve and when you do solve it, it feels amazing!\nEvery texture and model here is so painstakingly perfect, that you can't revert your eyes from it. If my (imaginary) girlfriend (she is hot!) would strip naked in front of me, I would just grab anything from table and throw it at her. You can imagine it would take much, because you would be still looking at the screen.\nSoundtrack is really solid. The female voices make everything much more engaging. I still listen to some of them.\nYou must play Stellar Blade! It is the BEST Fishing game I ever played! \nOh, and the rest of the game was fine too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hentai really is art. I mean this is basically Nier Automata, but even sexier. I somehow got a boner as a woman from this. Anyway, the actual gameplay is super good. Combat feels flashy and cool. Difficulty is pretty well balanced for the most part, and the story has some nice twists! Highly recommend if you like stuff like Bayonetta or Nier Automata.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good mix between Nier, Dark Souls, and action games. Play for Eve and stay for the AMAZING music, interesting story, and STELLAR combat! 9/10 minor issues don't take away from the game as a whole.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade is an absolute gem for me! The breathtaking visuals and dynamic combat  kept me hooked from start to finish. The characters are well-developed (maybe a little bit more of EVE history would be good), and the world-building is impressive, drawing you into its beautifully crafted universe. The gameplay feels smooth (even on my low-end computer) and intuitive. If you're a fan of souls-lite this one is definitely worth your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great story, Great character/world design, Great soundtracks, Great game mechanics, and a Great Game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a player who had never played Souls Likes before (if the game can be classified as such), I was very interested in trying this project. I was drawn in by the interesting setting and, of course, the expressive characters, if you know what I mean. :3\nThe game has an excellent soundtrack. The combat system isn't as responsive, but it didn't make me suffer. I have high hopes for the sequel, which is currently in development. Good luck and patience to the developers. <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I've played! Combat is extremely fun, the world is interesting and the visuals are awesome!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "When I first heard this game was in production, my expectations were low. As a casual NIKKE fan, I assumed it would be a quick cash grab. But I was glad to be proven wrong once I saw the genuine work being poured into it. Playing the game now, I'm in awe of the music and gameplay. The fact that many of NIKKE's composers are back, applying their craft here, makes the entire experience feel incredibly immersive and deep for the world of the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is difficult but it is a great game and dosnt care about censorship just look at Eves assets. This is what gaming should be like, lets hope devs look at stellar blade as an example of how to do it right.\nGame of the year 2025?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is actually peak, the goonservice is just bonus",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good solid game with replayability (going on my 3rd playthrough).\nA light in the today's darkness because it was the game that restored my fate in the possibility of still exiting good games.\nSure it as it's flaws, but they are far from the ones of the games made for the \"Modern Audience\".\nIt's also a game that gives you a lot of space for interpretation as it doesn't give you all the answers straight forward. In the end many questions are left to be answered which leaves the hunger for a Stellar Blade 2.\nTotally worth for paying full price with DLCs. \nSupport the game developers, but only when the game is released, as many great ones already fall from their grace when they got a name in the market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sick hack n slash combat with smooth animations and engaging gameplay.\r\n\r\nSolid story, not something out of this world but pretty entretaining. \r\n\r\nAwesome OST that hypes up the environment and adjust to each scenario\r\n\r\nYou can build the character in a way that adjust to your likings (long range, close range, exp, etc) So you can try different gameplay styles\r\n\r\nDetailed world building through level design where the game encourage you to explore through collectibles and side quests\r\n\r\nA solid 8.5/10, really awesome game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the fighting style and the music! Best part: so many costumes to swap out—love it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade is awesome, and I'm not even talking about Eve's assets. The optimization, soundtrack, art design, its fluid combat are all just fantastic.\n\nAnd the dress-up options are glorious too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Shift Up has shown they're experts in aesthetics. If you like the character design and style of GODDESS OF VICTORY: NIKKE, you'll feel right at home here. The visual style is stunning, and Eve is an instantly iconic protagonist—she’s more than just a pretty face. Her story and growth really drive the game.\n\nThe narrative hits harder than expected, blending intense action with real emotional moments. It feels like the perfect evolution of the developer's style. I’m already craving a sequel to see where Eve's story goes next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute amazing gameplay, music is very good too. \r\nStory was slightly predictable, not bad but not fantastic either. \r\nOverall I say this game is great for its gameplay and not story. The combat is Stellar. \r\n\r\nBonus: Eve is cute af :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story was fine, but the combat was really nice and fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]Stellar Blade — My Thoughts[/h2]\r\n\r\nStellar Blade absolutely swept me off my feet. From the moment the game starts, it pulls you into this gorgeous, broken world that somehow feels both haunting and beautiful. I fell in love with everything — the side quests that actually feel meaningful, the stunning soundtrack that hits at just the right moments, the jaw-dropping visuals, and of course, the incredible main heroine who carries the whole journey with style and heart.\r\n\r\nThe story grabbed me way harder than I expected. The endings left me thinking about the characters long after the credits rolled. It’s one of those games that stays with you — not because it forces deep messages, but because it feels sincere.\r\n\r\nThe combat? Addictive. It nails that perfect balance: slasher energy with souls-like tension, but never to the point of being suffocating. Challenging, yes — but in a fun, “I can totally do this” way that keeps your adrenaline going.\r\n\r\nSure, there are a few rough edges — some parkour moments get buggy, and a couple of things could’ve been smoother overall — but honestly, those tiny issues melted away in the bigger picture.\r\n\r\nAt the end of the day, Stellar Blade is a game I wholeheartedly recommend to anyone who wants a stylish, emotional, action-packed adventure that respects your time and rewards your effort. It’s bold, it’s beautiful, and it’s absolutely worth experiencing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably my favorite game of 2025.\r\n\r\nTip: dodge has a slight delay before it gets invu frames and the duration and range is very short, so you will get hit and it will feel inconsistent if you are approaching this like dodge in other games. Apparently, this is by design, because parry is supposed to be the thing you do most. Once I knew this, I was able to get used to it.\r\n\r\nAnother tip: don't use the transform ability you get midgame if you want a challenge, because it trivializes fights significantly once you know how to use it.\r\n\r\nAnd another tip: there is a point of no return in the game after which you cannot teleport around anymore. The game tells you this, but in a weird wording, so look out for that. \r\n\r\nLast tip: there are two different endbosses depending on how you navigate a dialog before the fight. I didn't like my endboss at all and later learned, after watching a video, that the alternative is much cooler. Decide if you want to spoiler yourself and get a glimpse of whether you'd enjoy your choice's boss or not.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It does not live up to the hype unless you can focus on that ass while glitching all over the place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I would definitely call this an actual good video game despite it having a reputation of being a gooner bait, it does not have the gacha slop or monetization for you to buy more skins to show more skin. (Plus you can mod it)\r\n\r\nThe combat is actually pretty engaging, I really appreciate how they've innovate different mechanics like being able to interrupt enemy combos by shooting a gun at em kinda like bloodborne does. It gets pretty slow at first but it'll eventually build up in middle to late game. However I wouldn't call this souls like, its more of an action slasher with some souls mechanic.\r\n\r\nDifficulty wise, it's pretty easy on normal difficulty especially from the early to mid game but the difficulty will spike up in the near end of the game.\r\n\r\nStory is okay, nothing too much to say about it or worth remembering maybe except for some of the side quest but the level design, cutscenes and music is where they've put all their sweat and tears on and I'd say that feels more memorable.\r\n\r\nDo I think it worth the full price? Honestly I say yeah, I think I got my money worth with this game despite it being a lil bit pricey, I would say wait till it goes on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade is a visually impressive game with strong ambitions, yet it doesn’t quite reach the heights it aims for. The world looks stunning and realistic, but the art direction feels oddly uninspired despite the technical excellence. The story starts off confusing before finding its rhythm, and while the open-world sections offer plenty to explore, they often feel empty and repetitive. In contrast, the more linear “corridor” sequences are much better paced and far more enjoyable to play through.\n\nThe gameplay loop tends to repeat itself, and despite a solid combat system, the overall experience struggles to maintain momentum. The soundtrack is generally grating, looping in ways that quickly become tiresome, though a few tracks stick in your head, and some of the camp themes are genuinely pleasant. Considering the overwhelmingly positive reviews, I expected much more. I still had a good time, but it’s a real love-hate relationship. If possible, I’d rate it a neutral 5/10: decent, but far from the masterpiece I was hoping for.\n\n----------\n\nStellar Blade impressionne visuellement et affiche de grandes ambitions, mais n’atteint pas tout à fait les sommets qu’il vise. Le monde est superbe et détaillé, mais la direction artistique manque curieusement d’inspiration malgré la qualité technique. L’histoire, d’abord confuse, devient plus intéressante au fil du temps, et si le monde ouvert propose beaucoup à voir, il donne souvent une impression de vide et de répétition. À l’inverse, les séquences plus linéaires sont bien mieux rythmées et nettement plus agréables à parcourir.\n\nLe gameplay finit par tourner en boucle, et malgré un système de combat efficace, l’ensemble peine à garder son élan. La bande-son, souvent agaçante et trop répétitive, fatigue rapidement l’oreille même si certaines musiques finissent par rester en tête, et que quelques thèmes du camp sont particulièrement réussis. Au vu des critiques extrêmement positives, je m’attendais à bien mieux. J’y ai passé un bon moment malgré tout, mais avec un vrai sentiment d’amour-haine. Si je le pouvais, je lui mettrais un 5/10 : une expérience correcte, mais loin du chef-d’œuvre annoncé.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's good, but it's a bit hard. The story is fine, combat is fun, but the great part is the visuals and music. You can also revive mid-fight if you have an item, so if you like Sekiro, you might like this game.\r\n\r\nI wish more modern games had a good-looking main character like this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played for 69 hours and did two runs, I still wanna go back for more runs and try to complete it 100% because this is what I think it deserves.\r\nKUDOS to Eastern companies for giving players great games, stories and plot twists.\r\n\r\nWE NEED MORE",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Get past all the gooner bait and what you have left is a beautiful game with an engaging story and banging music. One of the very few games I've had the attention span to complete this year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b] 10/10 [/b]\r\n\r\nVery good game. Solid game mechanics, world-building, and overall a very visually enjoyable game.\r\n\r\n[hr][/hr]\r\n\r\n[h2] Gameplay [/h2]\r\n\r\nOne of the best thing that this game did in my opinion is the perfect blend of open-world map and linear level design. Open-world game nowadays usually face the problem where sometimes the world feels too empty, but Stellar Blade handled this very well with the blend.\r\nThe exploration in open-world map is also quite rewarding as quite a lot of your gears and especially exospines come from exploration.\r\n\r\n[h2] Story [/h2]\r\n\r\nThe story itself is a little bit cliche in a sense that it is one of the common post-apocalyptic tropes. Nevertheless, it remains interesting enough and pick-ups that you get through exploration often add more details to the story and the world-building.\r\n\r\n[h2] Combat [/h2]\r\n\r\nCombat is fun. You have multiple options to approach a fight. There is a certain combination of equipment that basically allow you to lock down a boss forever. Put that aside, the combat is more about respecting the enemy attack pattern, while getting into a rhythm of offensive and defensive reaction of your own. It does resembles Sekiro.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game, amazing soundtrack, flashy gameplay and a good story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade looks amazing. Like, I want to live in this world just to look at it.\n\nThe graphics? Gorgeous. I’ve spent more time just staring at the world than actually fighting, and that’s saying something. Combat’s fast and fun - you’ll feel like a total badass doing flips and slashing stuff.\n\nBut the story? It’s kind of all over the place. I’m halfway through and still don’t know what’s going on. There are monsters, there’s a post-apocalyptic world, and I think I’m supposed to be saving humanity... The main character is a total win, though. She’s got that perfect mix of “I’ll kick your butt, but also I’m trying to figure life out” vibe.\n\nWould I recommend it? Sure, if you like cool fights, eye candy, and a story that might make more sense later... or maybe not. Either way, I’m sticking around to see how it all pans out!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Friend gifted me this game, and I have to say this is a very solid game. Definitely recommend, it has one of the most satisfying combats I've played. \n\nThe ONLY negative I can say about the game is the Ranged-only crawls were not as fun when you're SO addicted to the blade combat that you just want to go back. Although the Ranged combat is still fun, it just doesn't compare to the Blade. This shouldn't hold you back from playing the game what-so-ever, but something to note.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good visuals and wasn’t expecting the story to be unique. I love to see them do this again!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Buy it, support the asian market. They are doing a better job than western devs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade is such a fun mix of action \"souls\" like without being super difficult, it has difficulty but its way flexible and its super fun, so i def recomend this game if you are looking for something different and flexible but also engaging combat, nice music and very good visuals and aesthetics overall.\r\nside quest are not terrible thank god and even then you can always use a guide if for some reason you are having trouble with some (i did had to check some videos for certain items) overall a very pleasant experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10\n\nThe game is extremely difficult, especially if you play with one hand like me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story: Interesting but not captivating.\r\nCombat: Feels good and has nice skill expression.\r\nGraphics: ...yes.\r\nDifficulty: Relatively easy at medium. Slightly easier than DS3 at hard.\r\nSummary:\r\nWould recommend. Nice world building, fun combat, good graphics. Runs good even with avarage Gaming PCs, slight problems with certain hardware but nothing that can't be overlooked.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm already suck in soul-like game, and now this game really distract me with tits and butt. I can't even dodge, my eye keep getting distracted.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Blade has exceeded all my expectations, as I walked into it thinking this game would just be like any other sci-fi shooter, but instead, I ended up getting far more involved than I ever thought I would be. \n\nThe story had my full undivided attention while I played the game. Not only is the plot compelling, but it also has scenes that provide the player with a meaningful and emotional connection to the game, which is unlike many games today that seem forced. The world lore also feels immense, and the pacing throughout the whole game kept me engaged enough to never want to skip cutscenes like most games today does.\n\nThe combat experience in this game is fantastic and has been the highlight of Stellar Blade. After I got used to the timing of the combat mechanics, it was fast-paced, flashy, and surprisingly complicated, but in a fun way! Every single battle I felt was important, and the combination of dodging, parrying, and putting in my special abilities worked so well together. The idea of wanting to try “one more time” when I took damage or even died was something special, and seeing how well I performed my combos was a good feeling.\n\nThe visuals in this game are absolutely amazing. Stellar Blade has incredible graphics both in the environments and in the open world, but also in the character models, and the lighting effects are also breathtaking. There were multiple occasions when I would simply stop playing and admire the incredible graphics before me.\n\nOverall, Stellar Blade is one of those games that looks amazing, plays great, and actually backs it up with a legit, emotional, and fun story. It is definitely worth your time if you’re into sci-fi action games or just want something that feels fun as well as polished from start to finish.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "hot girl good gameplay, break every PS exclusive launch to PC is that easy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a definitive MUST PLAY title. I stand by my review of the Demo (more games should have Demo's btw just sayin'!) in which I said I would get this game on sale and so I got it and I am thrilled that my Demo saved game (which is ~2hours of gameplay) seamlessly transitioned into the REAL DEAL: a GOTY contender - Stellar Blade. \n\nNot for the timid and this soundtrack is, Sublime. MUST PLAY!\n\nGraphics 100, Gameplay 100, Story - it's alright maybe 85/100 - Certified BANGER.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have never been good at these types of souls like games, but thoroughly enjoyed the visuals, soundtrack and exploration of the larger open world areas a lot. This is definitely one of the better investments you could make nowadays, which says a lot about what's currently in the gaming market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "that @ss, but in truth in all, they really did a good job making this game, but ummm, the voice acting, and the script plus the story, was a big mehhhh, but a great game for sure\n\nWould play 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You come for the gooner content. You stay cause the combat is fantastic. The exploration is really good and the Music is amazing. Ton of collectibles to grab. While difficult, its not as bad as the other souls type games. Very satisfying.\n\nThe story is pure dog water though, its like someone asked Chat GPT to ELI5 Nier Automata's story and then made that into a video game. Also my god the characters........ The helicopter pilots that die in a call of duty mission have more character.\n\n9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So i have managed to get through one play through so far and have started on my new game plus, With 66hrs in the game i am confident in saying that this is a really fun and challenging game. \n\nWhen fighting the enemies you are going to need to pay attention to attack patterns and choose carefully when to strike, Its not the type of game where you can spam your bottons and win. So bare that in mind. in regards to a build, i personally don't think its as important in my opinion as i found i was able to get through the game without changing anything around really, i used defense perks which helps with surviving, [But maybe i will feel differently about this in my new game+]\n\nThe graphics are stunning and the movement sets really make you feel like a bad-ass when your playing, with executions and a lot of colourful flares. So if you like to style on your enemies it certainly gives in that department. Also when getting into this game be prepared to check every corner of the maps for all the secrets!! Trust me its worth it!. take your time and don't rush. Oh and if it looks breakable... It probably is! XD",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Sexy dark souls was very fun and the combat is very satisfying. I bought this game to stress test my new computer and it did not disappoint!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Decent story, great gameplay, great soundtrack, hot women...what more can you ask for?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had my fun with the game but to be honest I think it's pretty average.\n\n[h3]The Combat[/h3]\nThe combat I think has potential but I have a feeling the game can't really decide wheater it wants to be a character action game or a Souls-like/Sekiro-like. Sure it has a variety of strings but they are not that good and your main source of damage are the skills that are tied to beta (blue) and alpha (red) meter.\nAnd the fact that you have only one weapon for the entire game doesn't really help.\nAnd combat feels bad when theres more than one enemy around you.\nAlso it has a Tachy mode (local devil trigger) which gives you invincibility but in terms of damage it's a joke, so you'll end up using it just as a suvival tool IMO.\nOn normal NG the combat feels not so good but I on hard with NG+ starts to feel decent, but it still suffers from points i mentioned from above.\n\n[h3]Bosses and Mobs[/h3]\nBosses are fun (most of them) and i like that they and the mobs follow a single artstyle (even if they are generic).\n[h3]Story & Quests[/h3]\nSide quests are either fetch quests or kill stuff (straight out of korean mmo). There are like a few memorable quests that can tell some story.\nThe main story itself is very bland (basically Nier Automata but worse) so as the characters (espetially Adam) and only Raven & Lily are interesting (Kaya is cutie tho).\nEve while looks very pretty has a personality of plank of wood through the entire game. She has a character growth and someting interesting going on but the problem is when that happens the game just ends.\n\n[h3]Locations and presentation[/h3]\nThe visuals look pretty and the game is well optimized which is great.\nThe soundtrack is an absolute banger and goes straight into my playlist.\nThe two open world are Desert and Desert 2 (really) so I hope you really like deserts. And most of points of interest are enemy camps with a chest or other collectable.\nThe locations looks great at the beginning and endgame and great music really adds up the atmosphere. But in midgame locations are forgettable. Since aside from 2 deserst you get underground labs and a sewer.\nOh, and platforming sucks. I won't elaborate.\n\n[h3]Collectables and stuff I guess..[/h3]\nUnfortunately the absolute majority of collectable character logs are just some dude's last words that add absolutely nothing interesting.\nAt least Eve has a LOT of colletable costumes to collect which are great. And many more to unlock (most are recolours but also new ones in NG++). And even more costumes from collab DLCs if you bought them.\nThe puzzles are straight from kindergarten and add nothing to the game.\n\n[h3] Uhh.. So what?[/h3]\nI think Stellar Blade is 6/10 game. Maaaybe 6.5\nGet it with a discount if you feel like it.\nIt's clearly a game from an inexperienced team so many problems arive from that, but I can see they tried and putted some effort in to the game. Once again it has potential and I hope they hire better writers and other issues will be fixed in the sequel (and personally I hope it will play way more like a CAG insted of a Sekiro-like).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tons of fetch quests and passible \"mash parry and counter\" combat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games this year (2025) on the PC platform.\n\n- Engaging story\n- Great visuals\n- Good combat system\n- Good soundtracks\n- Amazing optimization\n\nThank you SHIFT UP for Stellar Blade and Sony for publishing it. We need more anti-woke games like this.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "You don't want to miss this AAA Gooner Masterpiece. A Superb Hack N Slash with identical gameplay to Nier Automata.  Enjoy playing dress up and dress down with your character, as you slash your way through the game, getting more outfits to play fashionista.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[table]\n    [tr]\n        [th][h1] My Playthrough [/h1][/th]\n        [th][url=] Youtube Playlist [/url][/th]\n    [/tr]\n    [tr]\n        [td][h1]The Review[/h1][/td]\n        [td]A very high quality game. From the aesthetic to the music. Everything about this game is gorgeous. The combat is fast and flashy. The story is also unforgettable. I highly recommend this game.[/td]\n    [/tr]\n[/table]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing, really enjoyed the style, gameplay and charecters. \nonly thing i hate is the stupid Dlc scarlett. Way too OP to fight.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game ..I am NOT a 'Souls' fan whatsoever . However I loved the God of War games and the last Devil May Cry and this is basically a hybrid of both those games plus lashing of Vanquish style visuals, action and atmosphere and overblown electrically charged action. I am mastering combos and parrying left right and centre but it does not feel like I am simply hitting the correct buttons at the right time it feels like I'm playing the game. There's also the option to shoot your way through levels or combine it with sword play. At its heart this is what this is a PURE game and its a wonder and a joy to play.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "this game is just too linear and frustrating... it doesn't feel very inspired. exploration is boring, combat is tedious and boring and one dimensional... its a dress up simulator. no cool loot or weapons after 16 hours... no reward for playing... nothing i like at least. i have a headache just thinking about this game. ew",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "[h1] Stellar Blade is an ALRIGHT game that sometimes manages to be a GOOD game but always fails to be a GREAT game. [/h1]\n\nTo be transparent, I haven't completed the game yet, but my motivation to actually continue is quite low due to a variety of reasons. I praised the demo for it's great visuals, soundtrack and intruiging combat. I thought that the game would add a bit more depth to that system - oh how wrong I was.\n\nStellar Blade's combat isn't terrible, but it's quite shallow. The game is extremely lenient even when not on an easy mode and ignoring the free revives (why do they exist!?). I don't mind the game being a bit easier, but the game really lacks depth. Almost all the bosses that I have fought thus far are a pushover and become boring pretty fast. For some of the bosses it feels like they aren't really trying to kill me. Their so not aggressive in any way and a lot of them have range attacks that barely even try to hit you. Running in a circle is enough to avoid em, and that is not all too engaging.\n\nEVE's arsenal can be quite boring too. The drone is probably the best addition, but T mode is extremely strong with very little downside or brain power needed. Burst skills are also not that engaging usually. Overall, the skill ceiling is almost as low as the skill floor, yet your character is very powerful - which transforms most fights into pushovers. It is only when you are deprived of healing or have to deal with weird movement that the game actually becomes a challenge.\n\nSpeaking of which: - movement can feel a bit clunky, though I had less issues with it than my friend or some other people that I talked to, though I have to admit that the parkouring in this game feels REALLY bad to control a lot of the time.\n\nAnother issue with Stellar Blade is that on occasion you have huge, open areas to explore, which due to their scale feel kinda empty. SHIFTUP tried to combat this by adding tons of enemies that patrol the map, which doesn't result in fun enemy encounters however. It just forces you into combat on occasion while you walk around a huge empty area doing some dogshit quest that contributes very little to the story and is basically just fetching some random item from somewhere. The quests overall are a major reason as to why I am not continuing right now. Yes I know; they are optional. But some of them give new outfits or even some decently written story lines, you just never know which ones are good and which ones are bad. I don't feel like missing out on major content with this game because I know that I probably won't replay it much unless people make fun mods.\n\nIn terms of Story: Most of the characters feel extremely flat. I like EVE, but her character is not well explored at all. Which is weird because you get some cute and interesting scenes at the very start of the game, but the developers do nothing with her. Same goes for Adam. Raven is more interesting at the moment but we'll see.\n\nOverall, the story is just as shallow as the gameplay. Stellar Blade has a fuck ton of cutscenes but in the end it's a lot of talk that rings hollow. The main cast is not that well developed and the ''big twists'' halfway through the game left little impact on me. The game director himself admitted that the story was lacking, but blamed it on budget constrains, which I don't think is a good excuse. The game has an entire logbook for all the characters and enemy types, yet they barely use it to add more to the lore! Lots of it is just recap or basic shit. Enemy descriptions are barren. I am not one to complain about fanservice, not at all, I think it's great! But to me it feels like EVE is just a pretty girl slapped on top of a mediocre to alright hack'n slash to compensate for a weak story and shallow combat.\n\nThe game is actively holding itself back. It has so many great ideas but often times fails to really capitalize on them. Also, the yellow paint is annoying and stupid.\n\nThe best part about this game really is the music and visuals (despite some typical unreal engine issues persisting). Performance wise it's pretty good I'd say, but not recommended for lower end PC's. Though I find it odd that the game doesn't run that much better on a lot of the empty open areas, especially the desert.\n\nI am simply tired of so many reused enemies and bosses. Tired of the uninteresting story. Tired of the sluggish combat. Stellar Blade can be a fun game, but when I compare it to other titles in my library, I see little reason to boot it up. If you're gonna buy this game, get it on a sale because 70€ is waaay too much for any game, especially Stellar Blade. My review might've been more positive if it was priced accordingly.\n\nI apologize for this hastily written review but I just had to put my thoughts out there. Could've gone into more detail but I will eventually update this book here anyway. You can have fun with this title if you turn your brain off. Enjoy.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "not recommended because of denuvo and stuttering.\nbesides those issues this is still a 6/10 experience.\n\npros:\n-good soundtrack\n-hot woman\n-hype moments\n-final two bosses actually had interesting move sets and introduced a new mechanic (in the last hour of the game LOL)\n-rewarding exploration\n-collectibles & side quests have better writing than the main story\n-good fishing systems\n-vendor affinity systems\n\ncons:\n-combat sucks for half the game, even after unlocking the god of war rage mode it's still unresponsive\n-many enemies and bosses share similar move sets - feels very stale and most bosses feel trivial\n-no weapon variety\n-the dead space sections are boring\n-side quests, while written well, are mostly fetch quests and very boring\n-english voice acting is so generic it hurts to listen to\n-writing and story beats are very predictable.. you will NEVEr guess who the enemy was all along!!\n-platforming feels clunky because you cannot make minute movements and it tries to magnetise you to stuff\n-the puzzles were made for people that need instructions for brushing teeth\n-some areas don't let you use the map which feels tedious when side quests tell you to go to old areas you haven't been to in a while\n-can't pause cutscenes... you have to open the playstation overlay to force pause them\n-there's a delay on skipping voice lines which gets very annoying when you're trying to open a vendor for the 30th time and they keep saying the same 2 voice lines before it allows you to open the actual vendor interface",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "interesting story and interesting enough characters, but could have been a lot more in depth, game play starts off fun but turns into a slog before long.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game itself is exellent but during the last playing sessions I've experienced a lot of crashes which is strange because I played a lot of Khazan and Lies of P that are the games also made on UE4 and their technical state was close to ideal. The problem is known, there are some solutions in the web but it didn't help me at all. So its hard to recommend even the great game if you can't play it without crashing every two minutes. Trying to reinstall and waiting for patches, if the problem will be solved I'll remove this post.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stellar Blade is basically the gym bro of action games: incredible body, unbelievable reflexes… zero personality. The combat? Fast, tight, rewarding... the kind of parry system that makes you feel like a god when you nail it.\n\nBut everything wrapped around that glorious combat? Yeah… that’s where it falls apart faster than a cardboard katana in a rainstorm.  The story is so generic it might as well have come free with Windows 95. The characters have all the emotional depth of a power-point slide. And the world? Boring, drab. Side quests? Fetch this. Kill that. Find the thing. Talk to the cardboard NPC. No spark, no soul, no “why should I care?”\n\nSo yes, brilliant combat but surrounded by a narrative so bland you could use it as rice seasoning.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Mid-maybe worth $25. \r\nGameplay isn't there. \r\nRotating your character is animation locked? what? I will walk to a station in camp, then have to walk away and back to interact with another because my character wants to do a 180 with every keyboard input. \r\nDidn't find the combat mechanics fun. \r\nDefault keybinds are odd-clearly intented for a controller. \r\nStory is too shallow/slow and there are too many forced cutscenes just the drag out telling you some lore or holding a conversation between characters.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "First off: I don't typically play this style of game, so I'm obviously going to struggle more than someone who is far more familiar with this type of game, but I can accept that.\n\nAnd I'll be honest, maybe this game's style of combat just isn't for me, but the game so far has proven itself to be more irritating than fun. \n\nThere are some minor gripes that I have with the game, such as, but not limited to; fixed savestations rather than just saving via the menu (this is honestly kind of a big one), having save-tokens rather than just being able to override a savegame whenever and however many times, menu navigation, awkward default keybindings, some odd movement \"quirks\" (such as the walk toggle disabling whenever I stop pressing a movement key, making navigating small short-distance spaces like the camps annoying, dodging before sprinting, etc.), and a few more than I can't be bothered to list.\n\nAside from the appalling performance that introduces consistent stuttering for a solid 5-10 seconds every 60 seconds despite running it on low graphics with a GTX3070, 12th gen i7 and 32GB of RAM certainly does not help my enjoyment, and makes boss battles significantly harder than they already are, the combat just does not feel all that fair to me. Though, that is not because of the combat itself, moreso the aforementioned performance issues, and some of the mechanics themselves. (At least, to my experience)\n\nIt feels like my button presses are queued up rather than being direct inputs, leading to combos during situations where I'd rather take a few steps back or to the side to avoid an attack. I find myself spamming shift to get out of the way, only to find EVE continuing to hammer at an enemy.\n\nThe targeting is another issue. Just a bit ago from writing this review, I had to deal with 3 enemies at once, which, while not ideal, I should be able to deal with it, and I could. However, it's kind of a problem when I'm locked on to an enemy that's behind a wall while my cursor is over an enemy next to me, and instead I'm continuing to bash this wall instead of doing damage to an enemy that I could actually hit and kill.\n\nAnd then there's the matter of enemy attacks. If an enemy is swinging its big heavy sword (or whatever they might be using) over its head, my instinct is to move out of the path of the sword. I don't *dodge* out of the way, I just *move* out of the way, because that seems the reasonable thing to do, because why the hell would I dodge when I can just move and attack when it's exposed? (In theory, at least) Yet, the entire character just rotates around its X axis, and still swings and hits me. That just doesn't seem like something that should be possible.\n\nSure, much of my frustrations with this game is just me. I'm not very good at it, and I'm not used to these sorts of games, so they don't come as naturally to me than it would to someone more familiar with them. However, the aforementioned issues for me make the game rather frustrating, and overall, not a very enjoyable experience.\n\nI don't dislike it enough to refund it (and I'm kinda too lazy), but honestly, I can't recommend it.\n\nAlso, the music doesn't feel like it matches the gameplay except for the boss battles. For the most part, it just sounds like generic background music, but that's just my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Restarting the game from scratch because of a softlock issue... great...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't typically write reviews, but I feel I owe it to people that come to this game with my mindset...\nI was told this game is akin to the Nier series, but except for the hot robot ladies I didn't find much else in common.\nGranted I didn't play much, so maybe if I come back to it later I'll change my mind... but I found the story uninteresting, the dialogue pretty soulless, and the combat and movement kinda clunky, not nearly as fluid as I was expecting (maybe I'm missing something, but it felt I was locked into animations that were already done more often than not).\n\nI also looked around online and found many others that came here with the same promises and were disappointed,  so this is a warning to Nier fans seeking a game that scratches that itch: this ain't it chief.\n\nAgain, I didn't play that much, maybe one day I'll give this game another shot and change my review, but for now this is what I have to say.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to like it, but it's a bad Souls-like in terms of gameplay and a poor imitation of Nier Automata in every other aspect.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While undeniably nice to look at, Stellar Blade leaves much to be desired in terms of gameplay. Put succinctly, this game is Sekiro, but less fun. Giving the game its due, the cosmetic items are fun to collect, everything in the game is gorgeous, the soundtrack is great, and it's one of the few optimized AAA ports of 2025. All the pieces of an enjoyable game are there and serving their purpose aside from the combat. The fact that connecting with enemies feels the same as swinging through air lends a sloppy feeling to every enemy you'll confront in this game, and since fighting is the vast majority of what you'll be doing, the fact that combat just feels off is always at the front of your mind. It's tough to give a game I really wanted to like a bad review based on one flaw, but because combat is at the heart of this game and the combat frankly sucks, it's tough to recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was surprised at how bad this game is. Gameplay is pretty bad, navigating the world is atrocious, visuals have a veneer of quality but feel cheap, aliasing yet blurred somehow.\n\n3 out of 10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Stutters really badly on my PC. RTX 4060 Ti with 8GB Vram. I dont have this issue with other games. A quick Google search shows that this is a common problem. Frustrating thing is that the demo ran super smooth, now I feel like Ive been ripped off",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am going to go against the grain and not recommend it. I honestly baffled by the other reviews. My friends and I agreed on a few things with Stellar Blade. The combat felt stiff, it lacked any flow. You do not have much mobility and the attacks are far from over-the-top. The dialogue and environments feel soulless. There is a lack of depth and uniqueness. The main character rarely has monologues and nothing is explained. Maybe the story gets deeper eventually, but if the only revelation on what was discovered in the plot was 10 hours in, it is a very, very slow drip. None of the characters reacted to the new discovery either, nor discussed it. Also, I already assumed what the discovery was before it was found. The dialogue also contradicts itself or does not make sense sometimes.  I encountered one bug so far, and it was a permanent stat upgrade that crashes the game and my GPU when I pick it up. \n\nOverall- I would only pay maybe $25 for this soulless, borderline AI generated, visually stunningly modelled, slop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Giving this game a negative review with the hope that they will improve on their next title. The game has great visuals, music and sound. Unfortunately the combat, exploration and difficulty really needs tuning. Get your shit together shitup.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall this is a good game.\r\nHowever, I am stuck on a platform related issue on the 1st mission at the Plaza Entryway station where you have to perform a triple pole jump.\r\nIt says you have to do a Jump-Dash on the second and third poles. \r\nI can get to the second, but the third always falls short. \r\nI have reset my frame rate to 30 as advised with no luck. \r\nI have spent over an hour trying to do this specific jump and I can't proceed further into the game until I do. Others online have had the same issue/\r\nSo I have given up, \r\nHopefully the developers can fix this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring gameplay that lacks a real combo system, 70% of game is just deserts game says it crash when it doesn't kicks you out anyway losing hours of progress sometimes, extremely nihilistic with side content literally 90% of them is that there dead end of story if your going get this game get it 20 i just cant see this game being worth at full price",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not for a casual gamer. Even story mode poses enough challenge. Enemies are everywhere and while most fights is totally not interesting there is next to no avoiding them. Story seems nice though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not worth its full asking price. It should have stayed in development for another 3 years. It is too short, the enemies and boses are reused multiple times, unimaginative combat system and map design, boring cliche anime characters, every story ends in tragedy trying desperately to make you feel something but its done and written so badly. This game is mediocre in every way possible. Its soulless. As the devs said themselves they have been inspired by nier automata and bayonetta but this game is as far as you can be from it. The main character lacks a personality and style.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass great\nstory neat\nmods horny\ncombat good\nplatforming miserable\n\nsome bosses will just bullshit and oneshot you if you miss one bullet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its aight, excpected the dialogs to be better considering it a PlayStation Exclusive, aimed toward gonners.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If steam would allow neutral, i would give this a neutral.\n5/10 \n\nTLDR. get this at a discount (<40$), if you are into action combat games (check the Free Demo!)\n\nLongform:\n\nThe good:\n- grafical fidelity is high\n- the combat is generally very fun (and for the most part challenging)\n- amazing soundtrack\n- adjustable difficulty, highly adjustable acceptability\n- free Demo (that is representative of the game)\n- I liked the English voice over\n\nThe mediocre:\n- the story is very basic, it's not bad per se, but if you are aware of common sci-fi tropes you can predict it very easily\n- enemies are varied enough for one playthrough but get repetitive beyond that\n- the levels are varied in them self as far as mixing combat/ platforming/ exploring and small puzzles go\n- progression feels almost to fast, as the game constantly throws skillpoints and upgrades at you\n\nThe bad: (mild spoilers)\n- the levels/ areas are incredibly repetitive: you start in a city, then desert, city, desert city and the game ist over. By the time the (short) game has ended i felt like I had played through it twice given how similar the areas were in their design\n- immersion is very low as you constantly need to platform or solve very gamey riddle to progress, yet the protagonists talk like everything is supper serious, which feels like they just didn't know how to properly integrate all the platforming and puzzles into their narrative vision\n- sound design: the soundtrack is awesome but the game is divided in sound zones, when you step into a new zone a new track plays. This means every time you reach a checkpoint you will get an immersion breaking music change, let alone the hub area, where the music changes 5 times in 30 seconds depending on the route you take\n- pacing: during the first 80% of the story you faces 10 bosses (of these only 6 are unique while 4 are recolors), then in the last 20% you face 6 bosses back to back no regular enemies in between. Yes I don't get it either.\nthe game is very short (~ 25 hours) if you play the main story and readable side quest. What do I mean reasonable? Many sidequest are: back track to a location you already cleared to kill x or find a box. They are so - obviously filler it makes me cringe.\n- cumulative this leads me to critique the price. There is way to little content to justify the huge price tag. Paying 40$ would be the absolute limit, I'd recommend this game at. And that's being generous.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has cute girls, and is fairly fun. The music is gratingly bad. The entire ~3hrs I played there was like a 90 second loop of a woman singing playing over and over and over. I considered muting the music, but then I realized I have so many other games on my backlog that I wasn't going to make excuses for this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don.t play game is  harder that dark souls and bloodborne",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good for streaming content for those game streamers are usually good at games. Lots to explore, sparky fighting skills and effects, excellent character design. \r\n\r\nHellish for average players. Do not waste your money if you're not good at Darksouls games. Even those trash monsters on the field will eat you alive if you're not good at those.\r\n\r\nGit Gud? Shut up. You don't pay me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I know I have completed the game for 100% (achievements included), but it was pretty boring gameplay. Best were boss finishing cutscenes, costumes and locations.\n\nSidequests are boring, fight feels hard to dodge and parry (Clair Obscur is way better in this).\n\nCollectibles are fine, but only cans.\n\nI went trought main story only in NG+ and it took only 5,5 hours. It is pretty short and mostly boring (NieR was 100% better), so without the exploring and sidequests, the game is not worth it for the full price.\n\nRecommended price is about 20 bucks.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "painfully, excruciatingly mid outside of EVE's visual fidelity. combat feels good and fun and flashy for the first handful of hours until it becomes annoying half the time rather than fun. it's sekiro: automata as ordered from aliexpress and it's also drunk, and it can never really even maintain half of the slickness in control and combat-feel as any of the other games it is constantly reminding you of. exploration is fine, besides EVE feeling like a drunkard covered in molasses sometimes, and the two main \"open world\" areas both being vast, empty deserts full of nothing interesting and sprinkled with enemies like JRPG random encounters and dotted with the boring sidequests you pick up from the hub town.\nthe story and worldbuilding is nier: automata written with chatgpt by a teenager for their amateur webtoon, which is to say it isn't particularly good. it almost makes you feel silly for paying attention and trying to get [i]something[/i] out of it, but it never stops feeling just kinda generic, and again constantly reminding you of its influences that are way better (not helped by the nier outfits literally changing the music in areas).\nyou would think there would be colorful and interesting characters to fall back on, but unfortunately that isn't the case either. none of the characters go beyond dull, flat, and one-note. they're very pretty, but you do not care about any of these people. \nit's kind of wild that SHIFT UP's own mobile gacha game nikke has more fun characters with engaging storylines in comparison, in a cast also full of bouncy bodacious beauties. get that for free and have a good time if that's what you're looking for. there's just better games for \"hot woman doing cool things\", and way better games if you're looking for souls-like combat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a top gooning experience, don't get me wrong, but the game is... empty.\r\nThere are 125 outfits and only 20 bosses. \r\n\r\nThe open areas are huge and empty. You can't even run between things you want because you are forced to fight or run on regular speed instead of cruising. Long animations for miscellaneous actions. Transparent walls. Clunky \"exploring\" movements. 0 iq puzzles. Everything related to exploring is just bad and frustrating.\r\n\r\nMelee Combat is fun but you have more moves than there are enemies. You can find the style you like, this is cool. Only 1 animation to \"kill\" after parry, that's getting old and boring like in the first 2h.\r\nShooting is made clucky and not fun to use in combat, too long to shoot, too long to choose ammo type, the charging ammo is a joke, no one will be able to use it in combat. \r\n\r\nTLDR:\r\n+ Top gooning content\r\n+ Fun Melee Combat, lots of moves\r\n\r\n- Shooting\r\n- Frustrating exploring\r\n- Empty word that doesn't look interesting. I guess most people don't notice the background though...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "save system sucks. back to save points instead of save anywhere.\n\nEdit: so im done x.x had a fatal error that it corrupted my save while trying to search warehouse 77 in the flooded district of edios 7. 14 hours down the drain... uninstall. oh and yea the corrupted save got uploaded to the cloud of steam so i legit have to restart the whole ass game. fuck that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Severe performance drops in the final section of the game makes it unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game looks good for sure, but the main combat loop is kinda terrible at best.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have yet to play this game. It refuses to launch. I've watched videos and read articles about getting passed the error but nothing works. I've reinstalled steam, updated my pc and graphics driver, ran the game as admin, ran the game in compatibility mode, verified game files, reinstalled the game and prayed to all the Gods of old. \n\nThis WILL not work. \"FATAL ERROR\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played it for around 1 hour, the gameplay is boring, the combat is clunky, I don't feel like I have much agency in the combat at all, the attacks and combos are slow, the enemies are boring but also don't give clear cues on how they attack, so it turns out it gets pretty frustrating and boring verh quickly.\nWe can all agree we only play this for THE PLOT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Typical asian coomer shit, with horrible combat, horrible game design and horrible pricing. The soundtrack is your typical orchestral-techno low-quality asian mindnumbing slop, with some talentless \"singer\" trying to speak, rather than sing, the lines that carry as much meaning as a 5 year old's doodle with feces. Women look like bloated sexdolls only a closeted hikkimori coomer would find attractive, i.e. they look like androids with glued on silicon sexual organs. \n\nThe fact that this shit has OW positive reviews just means that you can't trust any review rating on steam: a bunch of bots upvoting a gooner \"game\", that plays like an AI-made tech demo is not something you should base your opinion on.\n\nBuying and \"enjoying\" this game is like spending gold bars on instant shit-flavoured ramen. You'd be a clown to do so.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gameplay wise it's a worse version of Nier Automata. But lets face it no one gets this game for its Stellar gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sooo... I want to recommend this game, but i can't. This game is good to the point when it's not.\n\n[h1]Firstly - MOVEMENT[/h1]\nIt is so BAD. Eve doesn't turn immediately, she needs to go around to make a turn. The ledge grab doesn't always work, and you just jumping like and idiot at the ledge trying to grab onto it, and sometimes you can't even jump because you stuck...\n\n[h1]STORY[/h1]\nDidn't finish the game yet, and also didn't understood a damn thing, so i have no right to say anything about the story.\n\n[h1]COMBAT[/h1]\nSometimes Eve doesn't dodge even when you press the button, and sometimes combo's doesn't work, [i]for the same reason...\nalso dodging animation looks more like she's stumbles rather than dodges.[/i]\n\n[h1]CHARACTER DESIGN[/h1]\nEnemy's DESIGN is the worst i've seen in any game, also main character's designs isn't the best [i]Just look at Eve's face...[/i]\n\n[h1]other STUFF[/h1]\n\n[h2]1.Button prompts[/h2]\nI would say the MOST annoying thing in this game!!! [i]for example[/i] You can't activate the camp or sit there because the button only appears when you near it and EVE is LOOKING AT SPECIFIC ANGLE AT IT, so many times you just struggling to press it and just circling around it, or forced to step back, look at something in front of you, and walk straight at it so you can use it. Why am i supposed to do the [u]RITUAL[/u] to use anything at the camp!?\n\n[h2]2.Suits[/h2]\nSome of them are good and some are meh but could be better if they didn't ruin them with some annoying elements... Also some suits change Eve's body proportions, don't know why they did them like that.\n\n[h2]2.Cutscenes[/h2]\nVoice acting is just horrendous. Animations in the cutscenes are stiff and lifeless, all the characters just speak monotonously without a single emotion, the same is for their faces that almost never change. There's only a small number of character's that have \"Not that bad\" voice acting and face animations, and i would say the best character in these terms is Lily.\n\n[h2]Issues[/h2]\nAfter exiting menu's the mouse sensitivity becomes so much slower.\nIf you pressed exit the game button and alt tabbed, the game will not close, it will just run in the background until you open the game and then the game will close.\n\n[h1]OPINION[/h1]\nBasically this is just Nier but if it was Dark Souls, with bad design choices, and much more annoying... This is just sad, the game could be so much better!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game definitely over rated. \nI am pretty sure most of commons were positive because of the sexy female protagonist. I can tell this game is trying to be souls like game. But it is extremely hard, more than dark souls 1,2,3, Elden ring.\nThe doge and defense is lagy, some how is not response when you press the bottom (brand new pc and brand new ps5 controller).  the objects around the building are sticky, once you pass close to the building, you automatic triggers action.\nI do like the graphic and concept, but why it makes such shit sound affects....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a pastiche of design elements from better games that doesn't do justice to any of the works it pulls inspiration from.\n\nIt apes Nier Automata's aesthetics without the narrative direction to back it up. The combat is a half-baked attempt at Sekiro/Soulslike gameplay without the finely tuned animation timings and telegraphing that make those games tick. The level design is a generic slog with a random mishmash of enemies sprinkled wherever.\n\nThis is like if you AI generated a whole video game. Soulless slop.\n\nI liked when Doro showed up though.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Garbage of a game and cant even get a refund because I idled too long. Played about an hour of actual playtime, idle for 4 hours. Steam won't refund the game.\n\nHonestly, the game is super lame, basic, and very linear and straight up boring. The combat is a lackluster attempt at souls style combat, with little actual customization. Ive seen better skill trees on free to play android apps. \n\nI bought it on sale for $48 and paid about $48 dollars too much.\n\nAlso, to steam, genuinly pissed I cant refund this garbage because I idled on thanksgiving 🤣 was really looking forward to the steam machine but this experience has been thinking ill pass and just build a pc, get a rog ally, and say bye to valve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not my cup of tea.\n[list]\n    [*] Game play seems to revolve heavily around defensive mechanics: parries and dodges. Fine by itself, but putting pressure on enemies yourself doesn't feel like it's worth it; light attacks deal very little damage, and heavy attacks put your character into animation locks. You get one stagger per (regular) enemy - the shield break - but otherwise, they have hyper armour for their attack strings. Considering all of this together, I've been mostly standing around waiting for an attack to parry or dodge.\n    [*]The visual language in this game is kind of messy. I'm not sure how to phrase it, but everything is conflicting with each other: The overdesigned sci-fi characters (the combat suit neck tie is insane) with the 20th century post-apocalyptic city with the body horror monstrosities. \n    [*]Kinaesthetics are akward. Jumping in particular feels really awful. Lock-on slows you down. This probably wouldn't bother me so much if people didn't like to compare this game with Nier:Automata, which is like the gold standard on how moving in a video game should feel like.\n    [*]Your main character is called EVE and in the first five minutes experiences a suspiciously timely rescue by a guy called Adam. There's also a god-computer. This game isn't cool enough to let people have sex, so here's my guess how this turns out: EVE (maybe all space people) are \"cut from the ribs\" of Adam, who needs them to pg13-fuse to Become As Gods 2025 and kill god. Also Soylent Green are people. Actually, nevermind, Adam made god, but he also made the Soylent Green in his quest to unmake god, because heavens forbid a female character gets to have real agency in a Korean video game. \n[/list]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yawn.  It's kinda like easy Sekiro but still pretty hard.  The voice actor for the dude is the goofiest sounding dude ever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's the combat that drags the game down... never really feels good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "movement is slow and dogsh!t, combat is the same, waste of money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The only issue I have with this game, is sound lag. Some of the dialog skips in cutscene. I hope to get a refund for it. I'm very disappointed. i have an RTX 2070 I should have no issues. i even updated my drivers and still the same thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[list]\r\n[*]story predictable\r\n[*]characters two-dimensional, unrelatable, unlikable\r\n[*]weird head movements during conversations\r\n[*]wonky voice acting\r\n[*]music okay-ish, but used in an unsuited way\r\n[*]textures very rough and generally too large inside the VRAM -> be careful when 'only' having 8 GB of VRAM\r\n[*]controls imprecise, especially for platforming, swimming, photo challenge\r\n[*]air dash too short, with a weird ballistic curve\r\n[*]damage windows and visual markers of bosses don't line up often\r\n[*]way too much enemy tracking\r\n[*]way too easy to get trapped in the own animations, which makes some moves/skills borderline useless\r\n[*]perfect parry not very rewarding -> lower the amount of pp needed for an advantage, otherwise perfect evade will always be favored\r\n[*]dying has no consequences ...\r\n[/list]\r\n\r\nSolid 6/10. Game is focussed too much on selling a$$, not quality. Can't recommend for the original price. Wait for a sale. For the amount of jank you are getting here, $30 seems about right.\r\n\r\n[b]PS:[/b]\r\nSHIFT UP, I know you love DMC, Souls-likes, Nier Automata and the like, but please go back to these games, take a very good look and ask yourself honestly what it is they do so well and you do not ...",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is trash WHAT DO YOU MEAN I WAS GETTING A 1FPS BUG BECAUSE I RUN MY AUDIO THROUGH A USB???????????????????????????\r\n\r\n How is this a thing in the big 2025?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't know where to go next.... stuck! Cannot play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "needs more Adam ass shots",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too easy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game never play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stellar Wanker",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ultra-generic, heavy-handed, lazy and unoriginal.\r\n\r\nYellow Painted Ledge Climbing\r\nUnskippable Cutscenes, filled with BAD & Unimportant Dialogue\r\nPhoned-in Voice Acting (Especially the Male Lead)\r\nNonstop Hand-Holding the Player Every Step of the Way\r\nUninspired Story, with lead character names like Adam & Eve\r\nYet Another Skill Tree System (With Grindable Skill Points, What  A Snooze)\r\nInvisible Walls, Forced Linearity in \"Open\" Sections\r\nTerrible Graphical Inconsistency, Sometimes sub-PS3 Quality\r\nHope You Like Game-Flow Interrupted By Cutscenes About Nothing\r\nSeriously, Were These Cutscenes Written in Accordance with the Netflix \"Second Screen Dialogue\" Rules?\r\n\r\nSave your money and buy something original and worthwhile, cuz you've already experienced everything this game has to offer. It borrows constantly from other sources while adding nothing new or interesting itself. The nightmarish Alien-Horror boss the game builds up to in the first act? Just a gorilla with some generic sci-fi trim. The city where all humanity lives is called Zion and their spiritual leader is the Oracle, but they changed the spellings hoping you wouldn't notice they ripped off the Matrix. You can find sexy anime girls for cheaper elsewhere, with less embarrassing voice acting; just jerk it between rounds of Sekiro and you'll have a better time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shitty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i wanted to give the benefit of a doubt to this. but it is unfortunately \"well okay i guess\" at its best moments and \"painfully mid\" on average. the best way i can describe it is like getting into a really mid anime from 2000s that really does not have much outside of eye candy fanservice to redeem itself. and then you still watch it because i guess the eye candy is that good or something and you come out of it feeling absolutely nothing\n\nit does an okay job at combat, which is barely just difficult and has enough friction to be engaging while still going way more into a flashy power fantasy-ish direction. it did feel fine to play, for the most part. it does, actually, a good job at setting up a bunch of pretty set pieces but overall level design is not very remarkable, its just servicable. there are some detours for exploration purposes but nothing too crazy outside of the two big open areas 95% of which consist of completely \"optional\" stuff, side quests, character progression materials and gear, and collectibles. the soundtrack is pretty nice? but in certain locations its like a weirdly short loop that can get tiring really quick. fishing minigame? yay. also i do not feel like this is something that should even be mentioned but since thats the time we're living in, the optimization and overall technical execution is probably the actual best thing about this game\n\nbut then its all tied together by a frustratingly bad story. its literally the one thing i expected the least from and i was still left disappointed. dialogues, character and quest descriptions, codex entries, a lot of it feels like very amateur fanfiction, sometimes even as if it was written by an actual ai. the characters are nothing but vague tropes. the story itself has so many bizarre tonal whiplashes which were one of the few parts of the game that managed to surprise me mostly with how stupid they were, there is no subtlety to anything at all, it does every trope in the book you can expect from it, you can see almost everything it has to offer coming from a mile away. it feels exactly like the kind of a story you'd see in a very mid gacha. i feel like the korean mmo pseudorealistic artstyle actually does this game a disservice because even if i do not hate it that much, it very obviously clashes with the way characters move and gesture and talk and the direction of a lot of cutscenes, the ones where they talk a lot especially, they feel very anime but do not look like one, which just feels strange?\n\nand in the end i find it weird how many people excuse all of this with \"this isn't what the game is about\". then what is it about? if you took away everything except the dress up part and a couple dozen of camera angles from cutscenes, what are you gonna be left with? is this more than enough for you? was the black pearl outfit (that one looked pretty meh actually for something you get for exploring every nook and cranny in the game) so good it completely overshadows the entire rest of the game? it is precisely because of this i feel so disappointed because nowadays this kind of a game has been almost entirely relegated to the realm of free to play predatory gacha slop that only utilizes its eroticism in order to drain people's wallets and sanity more effective. with that price tag you can say that maybe stellar blade aimed for the same thing",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "AS much as i deeply love this game, and it becoming one of my favorite games of all time i can't quite recommend it, just the pain of being brutally honest. \n\nGreat Aspects\n- Very good soundtrack, very versatile in types of music\n- Great customization\n- Best photo mode in gaming by far\n- Great bosses\n\nMediocre Aspects\n- The combat\n- Enemy designs\n- Unique ambience, matches very well with the music\n\nBad Aspects\n- Tons of collectathons\n- Stupid puzzles, repetition\n- Fake progression\n- Gigantic leap of difficulty at endgame\n- Story\n- Lack of variety in areas\n\nThe soundtrack\nIt's got a lot of electronic music, orchestral, ambient and a bunch of i wouldn't even know what to call. Its propably my favorite soundtrack in any game i've played, but it depends on your taste of music, for me this is by far the highlight of the game.\n\nCustomization\nYou get to collect tons of outfits, glasses, a few outfits for your side characters to equip during the game. There are tons of them and all of them seem unique, even if few are ugly. If you like playing dress up in games you'll absolutely love this, and i definetly did.\n\nPhoto mode\nYou get to control lighting, filters, angles, poses, time of day, character expressions. It's got everything! I spent tons of time in it, also another highlight in the game. Whether you want explicit pictures or not, but since people do im sure many will take this as a nice addition. I mean, it's Eve afterall, she looks like the perfect woman to me.\n \nBosses\nThe bosses are hard and feel rewarding to play after you learn their movesets, well, which i guess is supposed to be a thing for a good boss in a game. The only bosses i dislike in the game is the final ones such as the unidentified naytiba and what she turns out to be. I won't spoil, but you will definetly recognize who it is during the cutscene if you play.\n\nCombat\nEve feels stiff and weird. Here im talking about hordes of enemies which you will be fighting throughout the entire game. It's fine against bosses, but when the majority of the game involves ranged enemies of some kind and hordes, it's not good. Aspecially when you get cornered or ambushed by ranged attacks while fighting a enemy during the time. It gets you killed a lot, aspecially at the start of the game. People are far over the top with this souls like mediocre combat.\n\nEnemy designs\nBoring, not much to say here. And you will be fighting basically the same or similar enemies throughout the entire game, and their movesets are not any more innovative than their design.\n\nAmbience\nJust decided to include this because the music fits very well with the places you explore.\n\nCollectathons\nYou have currencies, outfits, things to upgrade, buy. Chests are fucking everywhere across the maps, it just gets tiring of fighting through waves and you just do that, get some chest and move on with the place further on and repeat. Now that's a huge problem.\n\nPuzzles, repetition\nThis game really misjudges the players intelligence by making you do brainless puzzles throughout the entire playthrough just to progress. Find a power cell, find a chest, move on and repeat. It's just so brainless, if you don't fall in love with other aspects of this game then this will completely burn you out and you will not even want to play anymore.\n\nFake progression\nYou get skill points for getting moves of course, but there are moves locked that you should already have at the very start of the game, instead you have a struggle at the beginning just because you don't have those moves, Besides not having those moves, you have to upgrade them to gain a second part of that move sometimes, damage is understandable. \n\nDifficulty spike\nIts insane how much more difficult the game gets at the ending while barely teaching you anything about what's going to come beforehand. I expect it's even worse at normal mode, i started with hard instantly not knowing it was supposed to be played with new game+ where you gain extra upgrades, i aventually learned how to deal with every boss, but the two bosses before the final boss are absurd, with one hit moves that will screw you, one of them even stops you from doing special moves and is harder to catch while attacking, hard to stunlock and if you're no professional you will get stuck or have to cheese. \n\nStory\nI mean, this is a story game, so how come the story is so bad? I can't explain it because of spoilers, but it's really nothing special for a game this price and the characters just feel like total robots. There were very few i actually liked. Also the voice acting is all over the place, a few characters fit perfectly some sound like total trash. I couldn't stand Lily in the english dub, Adam was worse in Japanese, but the other ways around i liked it more. So not is it just a bad story, it doesn't have good voice acting.\n\nLack of variety in areas\nSeriously, after exploring an abandoned city we get some lame desert and wasteland, TWICE in the game. No snowy biome, no grassy forests, or anything unique, just the same old crap. Would love for someone to tell me of a game where i can actually find unique areas, because this is just not gonna cut it. You basically spend all your time in the game in deserts and wasteland, and the main city of the game is also in the wasteland and looks ugly as crap. It feels lifeless and has absolutely no charm, and the areas are completely carried by the music. If not for the music i would've totally had a differenht opinion on this game.\n\nSo overall, the game has qualities but the most important things are bad. So that makes it a pretty bad game, aspecially for the price, dissapointing standarts people have nowadays. This game is absolutely overhyped because of Eve, she's the main appeal of the game and she really stuck to me, she is hot as FUCK. I will be looking forward to the second game, and considering this is their first AAA it's an okay attempt. The importance of this will be seen if they learned their mistakes in the second game or not, but since tons of people work on games nowadays people shouldn't be excusing big bad games. Many people have more power and control, it cannot be that difficult to plan out a game if anyone can come up with these ideas with some critical thinking. That is all.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "this game is just too linear and frustrating... it doesn't feel very inspired. exploration is boring, combat is tedious and boring and one dimensional... its a dress up simulator. no cool loot or weapons after 16 hours... no reward for playing... nothing i like at least. i have a headache just thinking about this game. ew",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "[h1] Stellar Blade is an ALRIGHT game that sometimes manages to be a GOOD game but always fails to be a GREAT game. [/h1]\n\nTo be transparent, I haven't completed the game yet, but my motivation to actually continue is quite low due to a variety of reasons. I praised the demo for it's great visuals, soundtrack and intruiging combat. I thought that the game would add a bit more depth to that system - oh how wrong I was.\n\nStellar Blade's combat isn't terrible, but it's quite shallow. The game is extremely lenient even when not on an easy mode and ignoring the free revives (why do they exist!?). I don't mind the game being a bit easier, but the game really lacks depth. Almost all the bosses that I have fought thus far are a pushover and become boring pretty fast. For some of the bosses it feels like they aren't really trying to kill me. Their so not aggressive in any way and a lot of them have range attacks that barely even try to hit you. Running in a circle is enough to avoid em, and that is not all too engaging.\n\nEVE's arsenal can be quite boring too. The drone is probably the best addition, but T mode is extremely strong with very little downside or brain power needed. Burst skills are also not that engaging usually. Overall, the skill ceiling is almost as low as the skill floor, yet your character is very powerful - which transforms most fights into pushovers. It is only when you are deprived of healing or have to deal with weird movement that the game actually becomes a challenge.\n\nSpeaking of which: - movement can feel a bit clunky, though I had less issues with it than my friend or some other people that I talked to, though I have to admit that the parkouring in this game feels REALLY bad to control a lot of the time.\n\nAnother issue with Stellar Blade is that on occasion you have huge, open areas to explore, which due to their scale feel kinda empty. SHIFTUP tried to combat this by adding tons of enemies that patrol the map, which doesn't result in fun enemy encounters however. It just forces you into combat on occasion while you walk around a huge empty area doing some dogshit quest that contributes very little to the story and is basically just fetching some random item from somewhere. The quests overall are a major reason as to why I am not continuing right now. Yes I know; they are optional. But some of them give new outfits or even some decently written story lines, you just never know which ones are good and which ones are bad. I don't feel like missing out on major content with this game because I know that I probably won't replay it much unless people make fun mods.\n\nIn terms of Story: Most of the characters feel extremely flat. I like EVE, but her character is not well explored at all. Which is weird because you get some cute and interesting scenes at the very start of the game, but the developers do nothing with her. Same goes for Adam. Raven is more interesting at the moment but we'll see.\n\nOverall, the story is just as shallow as the gameplay. Stellar Blade has a fuck ton of cutscenes but in the end it's a lot of talk that rings hollow. The main cast is not that well developed and the ''big twists'' halfway through the game left little impact on me. The game director himself admitted that the story was lacking, but blamed it on budget constrains, which I don't think is a good excuse. The game has an entire logbook for all the characters and enemy types, yet they barely use it to add more to the lore! Lots of it is just recap or basic shit. Enemy descriptions are barren. I am not one to complain about fanservice, not at all, I think it's great! But to me it feels like EVE is just a pretty girl slapped on top of a mediocre to alright hack'n slash to compensate for a weak story and shallow combat.\n\nThe game is actively holding itself back. It has so many great ideas but often times fails to really capitalize on them. Also, the yellow paint is annoying and stupid.\n\nThe best part about this game really is the music and visuals (despite some typical unreal engine issues persisting). Performance wise it's pretty good I'd say, but not recommended for lower end PC's. Though I find it odd that the game doesn't run that much better on a lot of the empty open areas, especially the desert.\n\nI am simply tired of so many reused enemies and bosses. Tired of the uninteresting story. Tired of the sluggish combat. Stellar Blade can be a fun game, but when I compare it to other titles in my library, I see little reason to boot it up. If you're gonna buy this game, get it on a sale because 70€ is waaay too much for any game, especially Stellar Blade. My review might've been more positive if it was priced accordingly.\n\nI apologize for this hastily written review but I just had to put my thoughts out there. Could've gone into more detail but I will eventually update this book here anyway. You can have fun with this title if you turn your brain off. Enjoy.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "not recommended because of denuvo and stuttering.\nbesides those issues this is still a 6/10 experience.\n\npros:\n-good soundtrack\n-hot woman\n-hype moments\n-final two bosses actually had interesting move sets and introduced a new mechanic (in the last hour of the game LOL)\n-rewarding exploration\n-collectibles & side quests have better writing than the main story\n-good fishing systems\n-vendor affinity systems\n\ncons:\n-combat sucks for half the game, even after unlocking the god of war rage mode it's still unresponsive\n-many enemies and bosses share similar move sets - feels very stale and most bosses feel trivial\n-no weapon variety\n-the dead space sections are boring\n-side quests, while written well, are mostly fetch quests and very boring\n-english voice acting is so generic it hurts to listen to\n-writing and story beats are very predictable.. you will NEVEr guess who the enemy was all along!!\n-platforming feels clunky because you cannot make minute movements and it tries to magnetise you to stuff\n-the puzzles were made for people that need instructions for brushing teeth\n-some areas don't let you use the map which feels tedious when side quests tell you to go to old areas you haven't been to in a while\n-can't pause cutscenes... you have to open the playstation overlay to force pause them\n-there's a delay on skipping voice lines which gets very annoying when you're trying to open a vendor for the 30th time and they keep saying the same 2 voice lines before it allows you to open the actual vendor interface",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "interesting story and interesting enough characters, but could have been a lot more in depth, game play starts off fun but turns into a slog before long.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Rant review ahead with no structure at all -\nIts a game with decent combat mired in a million little drawbacks and nitpicks strung along by an ass plot. every side-quest is a fetch quest and both huge areas in the game are essentially the same, a yellow wasteland and a yellow desert. parrying feels good but the fact that your riposte options dont have I-frames means you might as well have just dodged instead. Which would be fine if the perfect dodge attacks had I-frames but they dont either so youre screwed either way if youre facing more than a single opponent. The combat animation however are absolutely gorgeous, iv heard people complaining that theres too much slow-mo in the game but personally i think the devs hit that sweet-spot that gives the player that Adrenalin shot every time it happens. Especially when performing perfect parrys/dodges and seeing some of the more flashy abilities linked to it. the air dodge is useless since it moves you only half a meter forward and doesnt integrate with your combos at all.  \n\nThe games skill tree is chock-full of abilities that should be readily available to the player from the start but seem like they were added to it just to make the tree look more complex than it is, minor gripe is that the freakin double jump is locked behind story progression for no good reason at all, it doesnt make any areas super accessible up to where you get it so it feels like another action i should have had from the start. The games combat is entirely grounded so its not like the player would have been overwhelmed with air combos either. \nMultiple sections of the game ask you to prove yourself in combat to prepare you for the next area, then immediately takes away your ability to USE said combat in the area you just got to. Instead forcing you shoot everything in a dark room las if youre playing Resi 4. They repeat this gimmick multiple times to iirc. The gun itself feels great to use though, lots of different ways to use it be it for crowd control or focusing on single targets thanks to the different gun modes you unlock. I noticed you can also use it to cancel some sword animations as well which not only keeps your combo going but looks and feels great to pull off.  \n\nTheres a few movement mechanics that you use once and then never again like wall running or swinging off poles. That said, the platforming in this game is pretty trash too which is a shame cuz you can tell by the many different climbing animations what they wanted it to work but it just doesnt. Story is trash with one--not characters including an MC i could have sworn has amnesia cuz she never talks about herself or her past or anything to do with where the angels are from, side characters have nothing they wanna strive for except the status quo - save the world. Major plot twists are hammered into you from the beginning of the game with every other scrap of lore the game tosses you through dead bodies other items you pick up, though if youv ever watched an anime before youll be able to guess the twists all on your own after the first hour. The devs/execs are also desperate for you to watch every single cutscene in its entirety no matter how boring or minor it may be which is straight up selfish, feels like I paid for the game but i dont get to dictate i engage with is when control is ripped away from me just to watch a conversation about some guy who likes cutting peoples hair but cant afford a pair of scissors for himself.\n\ni give this game a 6/10 because i do enjoy the combat and the beautiful environments you go through even though the former needs some work imo, but visuals dont make for a good decent game by default at all while everything else feels like a by the numbers slog.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Look, we all know why you're looking at this game. Aside from that, it's genuinely a 5/10 game. The story isn't nearly as compelling as it thinks it is, the characters are bad and the performances are stiff. The combat is competent, but so many other great games have competent combat on top of good story. I also don't think soulslite combat was the right choice for the story the game seems to be setting up. \n\nYou, the reader, are better than this generic action game slop. Show a little self-respect and find a better game.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The game itself is exellent but during the last playing sessions I've experienced a lot of crashes which is strange because I played a lot of Khazan and Lies of P that are the games also made on UE4 and their technical state was close to ideal. The problem is known, there are some solutions in the web but it didn't help me at all. So its hard to recommend even the great game if you can't play it without crashing every two minutes. Trying to reinstall and waiting for patches, if the problem will be solved I'll remove this post.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stellar Blade is basically the gym bro of action games: incredible body, unbelievable reflexes… zero personality. The combat? Fast, tight, rewarding... the kind of parry system that makes you feel like a god when you nail it.\n\nBut everything wrapped around that glorious combat? Yeah… that’s where it falls apart faster than a cardboard katana in a rainstorm.  The story is so generic it might as well have come free with Windows 95. The characters have all the emotional depth of a power-point slide. And the world? Boring, drab. Side quests? Fetch this. Kill that. Find the thing. Talk to the cardboard NPC. No spark, no soul, no “why should I care?”\n\nSo yes, brilliant combat but surrounded by a narrative so bland you could use it as rice seasoning.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I waited for this game to be available on PC. I believed in all the stellar (hoho) reviews.\r\nMan, I was wrong.\r\n\r\nThis game is like a love letter to Yoko Taro written by someone that has no creativity. It tries so hard to be \"Nier: Automata\" without understanding why that game is good to the point it almost becomes hilarious. If it wasn't that it costs like a AAA game and makes you suffer through a multitude of frustrating boss fights that feel like they were designed by knowledge checks fetishists. Actually, one of the last bosses feels like it was designed by a game designer that was salty the playtesters used an ability you have from the start of the game, you know, like those Atlus/SMT boss fights with random hidden checks to avoid making them too easy. In that boss fight if you use that ability the opponent gets a random cutscene that blocks any positive effect that attack has aside from chip damage (while you obviously waste the energy/mana to use it).\r\n\r\nSome other observations:\r\n- The story is banal. As I said, it's basically a copy of \"Nier: Automata\", but with plot twists you can feel with all your 5 senses from a mile away. Do you guys know the name of the main character? Imagine the story from there.\r\n- No characters are likeable. It's not like the game makes you hate them. Every character feels like a piece of furniture bought from Ikea that has been put there just to deliver a half-baked sentence picked up from \"The book of overused cliches\".\r\n- The combat system wished it was the one from Sekiro or Metal Gear Rising: Revengeance, however it suffer from rheumatism. Attacks are long and uncancellable into blocks or dodges, all enemies attacks stunlock you, meaning that you cannot fudge the first perfect parry to then recover and finish parrying the obviously deadly combo from even mob enemies, random delays into combos that need to be parried, some bosses have combos of UNBLOCKABLE attacks with unclear dodge/zoning patterns. For this last point: imagine you've learned how to block a combo, then do a perfect dodge of an unblockable attack (because a default dodge would still damage you), just to find out that the enemy has multiple follow up attacks, including other unblockables that require a specific dodge to work. In other cases, instead, enemies have attacks that can be perfect-parried, but have no charge-up.\r\n- An entire shooting mechanic that's useful only for a couple of gimmick moments\r\n- FISHING and other extremely deep and useful minigames\r\n\r\nBasically, this is a well crafted gooner trap and I fell for it entirely. To be fair to the company behind this game, that part of the content is pretty good, however I think it would have been more efficient to play \"Operation Lovecraft: Fallen Doll\".",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "A glitched that addressed a year ago still in the game. My game is locked, the entry and the exit in the train station are blocked. Can't progress the game. I can't open the map either. After completing the quest. I wanted to revisit the station now i can't get out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1] 6/10 [/h1]\nSCREW DENUVO, i got high FPS but there's always fps drop here and there\nI expect more for a game that published by sony like their other title (ghost of tsushima, god of war) what is clear if i know the game like this from the start i won't play it, glad i play through steam family share so it's free. The game main story only 20 hours but side quest padding make it 55 hours and it's not even good, if the main story at least better and [spoiler] not leaving on cliffhanger [/spoiler] for the confirmed sequel i won't give this negative review\n\nUbisoft quality (mediocre storyline, uninspiring and repetitive world that most of them are sands, weak side quest) + the combat while great but don't have any aerial battle, it feels like hack and slash with parry and dodge + great characters design, i like EVE as character she is interesting but the character expressions are bad that only nod... + Clearly mobile first developer (nikke) because there's so many plothole, useless information, unpolished stuff on everything\n\nIf you want to play korea game like this one i suggest try Lies of P first instead",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "5/10 OVERALL SCORE\nCombat it pretty responsive and fun. Music is good too. I like the vibe of a post-apocalyptic universe with female super soldiers using mainly a hack and slash style combat. Of course it's quite visually stunning as well. It also has very few if any microtransactions (just the DLC i think) and so I have to commend the devs for that. \n\nTedious gamplay:\nOne big issue I have is that the campaign is incredibly tedious. Every step along the way it feels like the developers asked themselves \"okay thats good, but can we stretch it out a bit more?\" I have spent so much time getting passcodes and fusion cells just to be able to access the next door and get into the next area, all so that I, as the player, spend more time online. Entire sections of the game have taken me perhaps twice as long as they should have simply because they have me aimlessly wandering around trying to find these items to get to the next area. I guess that looks better for player retention on their end right?\nAlso why is fast travel such a pain??\n\nStory:\nWriting is pretty weak to begin with. But the fact that they obviously are trying to add in so much fluff to stretch the playtime out makes it even worse. And this is supposed to be a story driven game, and so you spend a huge amount of time in cut scenes (that you cannot skip) listening to an incredibly mid story. The director has been quoted saying he's a \"visualist not a story teller\". But isn't that kind of glaring issue for a story driven game?\n\nIts too bad because I think there was potential for a great story if that's what they cared about.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The game is a Nier Automata clone that copied the combat from Sekiro and Jedi Fallen Order. In short, it sucks. Eve is slower and clumsier than a fully armored medieval knight. Lock on system still sucks against multiple opponents, as it has always sucked, and Eve is so clumsy even the 1v1 boss battles are barely enjoyable. The environment looks garbage (it is literally a ruined city full of garbage) and most of gameplay is running around in the trash city as if you are in a Ubisoft game searching for passcodes for doors. Writing is horrendous and dialogue so bad the game would be better if everyone was mute.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Mid-maybe worth $25. \r\nGameplay isn't there. \r\nRotating your character is animation locked? what? I will walk to a station in camp, then have to walk away and back to interact with another because my character wants to do a 180 with every keyboard input. \r\nDidn't find the combat mechanics fun. \r\nDefault keybinds are odd-clearly intented for a controller. \r\nStory is too shallow/slow and there are too many forced cutscenes just the drag out telling you some lore or holding a conversation between characters.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I would like to offer an alternative opinion to keep others from spending a lot of money on a game they might not enjoy. Although the game is solid, I cannot recommend it at the very high AAA price point it occupies at the time of review. I am neutral on the culture war thing surrounding the game - for me, it is perfectly fine to have eyecandy as a protagonist, even though I am personally not aroused by a pixelbutt.\n\nGameplay (6/10)\nThe strength of Stellar Blade is certainly the combat system. It rewards player skill, is fast-paced and responsive. Most bosses have interesting movesets. For me, that's about it - but since you spend a lot of your time fighting, it might be enough for some. It might also be worth mentioning that I didn't consciously encounter a single bug, albeit one CTD.\nThere is a mix of open world areas and dungeon-like linear zones. The open world reminded me a lot of MMORPGs in quest quality, you hunt 5 monsters, take 10 pictures and catch 3 fish. I found exactly one quest in which I was emotionally involved. There are very few items actually worth exploring for - you collect different currencies all the time, most of which are next to useless and do not further your combat ability. 90% of the things you find will be for cosmetic purposes. So make sure this is enough to motivate you, there is no \"loot hunting\" like in Borderlands. The areas are wastelands and deserts (literally) with a bland color palette and no interesting quests or stories to find. Invisible walls are used to keep you from going or jumping where Eve obviously could, making the exploration even more tedious.\n\nThe dungeon-like levels I consider to be better and offer some variation, but they make heavy use of imprecise platforming, overuse jump scares, and even recycle bosses.\n\nThe skill trees in the game are bloated - most of the time I was running around with 15 skill points to spare, because there was nothing to spend them on which would have improved my playstyle. You level up quickly and will have bought all important skills by midgame.\n\nStory/Writing (3/10)\nOh boy. The overall premise is good enough and could have been shaped into something decent. But I am convinced a random AI could have done a much better job at writing. We collect X blobs to create a superblob, and the superblob will help us defeat the elder boss. The main twist was hinted towards so early that you could spot it from a mile away. The dialogue has zero emotion, exacerbated by the english voice acting. There is no chemistry between the characters and our protagonist has no personality at all. This is a waste, she could have become an iconic hero like Lara Croft.\n\nGraphics (6/10)\nYou can tell they spent a lot of time on the character model of Eve, her motion capturing and her outfits. It can also be fun to \"dress for the occasion\", but it's not enough for me to make a game. The facial and head animations, as well as the gestures, are barebone and distractingly bad. The rarely fit to what is said, the faces are largely emotionless. NPCs in town make \"bah bah bah\" movements with their mouth, accompanied by a blank stare. It again gives me the impression of playing an MMORPG. Enemies/Bosses are well designed, everything else looks bland with little artistic value.\n\nSound (6/10)\nThe english voiceover adds, as mentioned, to the lacking presentation of the story. Eve herself is okay, the rest sounds like they read the ingredients list on a shampoo bottle. It seems that a lot of people enjoy the music, so I am rating it higher than I personally would. On average I'd consider it mediocre and it would never have stood out positively for me (like it did in Clair Obscur). Some tracks are good, but they are used rarely and do not supplement the emotions of the story. Instead, you will be hit by a 3 minute vocal song on a loop while exploring an area for two hours. It was one of the very few instances in which I actually had to turn off the music in a game.\n\nOverall (5/10)\nI am aware this is controversial given the ... stellar ratings the game has enjoyed. They drove me to buy the game at a high price and regretting it. If you are on the fence, wait a bit until it is half price.\n\n+ Good combat system\n+ Polished\n+ Visually compelling protagonist and motion capturing\n+ A lot of visual customization and outfits for Eve\no Music a matter of taste. Some good tracks, far too repetitive in the open world\n- Bland open world elements with MMORPG style quests\n- Weak story due to atrocious writing, no emotional buy-in, forgettable characters and bad voiceover\n- Relatively short given the recycling, backtracking, open maps and quest quality\n- Barebone facial animations and gestures, especially by NPCs\n- No in-game economy to speak of, no weapons, armor etc. to find\n- Imprecise platforming, annoying for most players",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Alright game. It’s a beautiful looking game with cool fighting mechanics. But the story is meh and the terrain traversal and platforming mechanics are pretty bad. Also, I found there to be too many animation locks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is fun. I like the story, i like the quests - and normally i hate questing. The world is fun, little to much desert for my liking but i don't know if this would change, i am like just at the start.\r\n\r\nBut gosh damn, the controll's are dogshit. The target locking in every shape or form is dogshit, no matter what option you use. The camera angel is dogshit. The Movement is dogshit - the direction changes or even simple turning the character around is so stupid, i was permanently biting my fist. The interaction with objects and/or characters is fine, but getting the keyinput to actully be able to use certain objects or talk to characters is so stupid because of the IMMENSLY BAD MOVEMENT, i can't anymore.\r\n\r\nI gave the game a real chance, because i like the setting, i like the story, i like the character design (obviously LOL) and i even like the boss fights, but NOT with this clunky ass gameplay.\r\nNot for me as a PC gamer, and yes, i tryed MNK and Controller.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First off: I don't typically play this style of game, so I'm obviously going to struggle more than someone who is far more familiar with this type of game, but I can accept that.\n\nAnd I'll be honest, maybe this game's style of combat just isn't for me, but the game so far has proven itself to be more irritating than fun. \n\nThere are some minor gripes that I have with the game, such as, but not limited to; fixed savestations rather than just saving via the menu (this is honestly kind of a big one), having save-tokens rather than just being able to override a savegame whenever and however many times, menu navigation, awkward default keybindings, some odd movement \"quirks\" (such as the walk toggle disabling whenever I stop pressing a movement key, making navigating small short-distance spaces like the camps annoying, dodging before sprinting, etc.), and a few more than I can't be bothered to list.\n\nAside from the appalling performance that introduces consistent stuttering for a solid 5-10 seconds every 60 seconds despite running it on low graphics with a GTX3070, 12th gen i7 and 32GB of RAM certainly does not help my enjoyment, and makes boss battles significantly harder than they already are, the combat just does not feel all that fair to me. Though, that is not because of the combat itself, moreso the aforementioned performance issues, and some of the mechanics themselves. (At least, to my experience)\n\nIt feels like my button presses are queued up rather than being direct inputs, leading to combos during situations where I'd rather take a few steps back or to the side to avoid an attack. I find myself spamming shift to get out of the way, only to find EVE continuing to hammer at an enemy.\n\nThe targeting is another issue. Just a bit ago from writing this review, I had to deal with 3 enemies at once, which, while not ideal, I should be able to deal with it, and I could. However, it's kind of a problem when I'm locked on to an enemy that's behind a wall while my cursor is over an enemy next to me, and instead I'm continuing to bash this wall instead of doing damage to an enemy that I could actually hit and kill.\n\nAnd then there's the matter of enemy attacks. If an enemy is swinging its big heavy sword (or whatever they might be using) over its head, my instinct is to move out of the path of the sword. I don't *dodge* out of the way, I just *move* out of the way, because that seems the reasonable thing to do, because why the hell would I dodge when I can just move and attack when it's exposed? (In theory, at least) Yet, the entire character just rotates around its X axis, and still swings and hits me. That just doesn't seem like something that should be possible.\n\nSure, much of my frustrations with this game is just me. I'm not very good at it, and I'm not used to these sorts of games, so they don't come as naturally to me than it would to someone more familiar with them. However, the aforementioned issues for me make the game rather frustrating, and overall, not a very enjoyable experience.\n\nI don't dislike it enough to refund it (and I'm kinda too lazy), but honestly, I can't recommend it.\n\nAlso, the music doesn't feel like it matches the gameplay except for the boss battles. For the most part, it just sounds like generic background music, but that's just my opinion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Restarting the game from scratch because of a softlock issue... great...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't typically write reviews, but I feel I owe it to people that come to this game with my mindset...\nI was told this game is akin to the Nier series, but except for the hot robot ladies I didn't find much else in common.\nGranted I didn't play much, so maybe if I come back to it later I'll change my mind... but I found the story uninteresting, the dialogue pretty soulless, and the combat and movement kinda clunky, not nearly as fluid as I was expecting (maybe I'm missing something, but it felt I was locked into animations that were already done more often than not).\n\nI also looked around online and found many others that came here with the same promises and were disappointed,  so this is a warning to Nier fans seeking a game that scratches that itch: this ain't it chief.\n\nAgain, I didn't play that much, maybe one day I'll give this game another shot and change my review, but for now this is what I have to say.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to like it, but it's a bad Souls-like in terms of gameplay and a poor imitation of Nier Automata in every other aspect.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While undeniably nice to look at, Stellar Blade leaves much to be desired in terms of gameplay. Put succinctly, this game is Sekiro, but less fun. Giving the game its due, the cosmetic items are fun to collect, everything in the game is gorgeous, the soundtrack is great, and it's one of the few optimized AAA ports of 2025. All the pieces of an enjoyable game are there and serving their purpose aside from the combat. The fact that connecting with enemies feels the same as swinging through air lends a sloppy feeling to every enemy you'll confront in this game, and since fighting is the vast majority of what you'll be doing, the fact that combat just feels off is always at the front of your mind. It's tough to give a game I really wanted to like a bad review based on one flaw, but because combat is at the heart of this game and the combat frankly sucks, it's tough to recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was surprised at how bad this game is. Gameplay is pretty bad, navigating the world is atrocious, visuals have a veneer of quality but feel cheap, aliasing yet blurred somehow.\n\n3 out of 10.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Stutters really badly on my PC. RTX 4060 Ti with 8GB Vram. I dont have this issue with other games. A quick Google search shows that this is a common problem. Frustrating thing is that the demo ran super smooth, now I feel like Ive been ripped off",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am going to go against the grain and not recommend it. I honestly baffled by the other reviews. My friends and I agreed on a few things with Stellar Blade. The combat felt stiff, it lacked any flow. You do not have much mobility and the attacks are far from over-the-top. The dialogue and environments feel soulless. There is a lack of depth and uniqueness. The main character rarely has monologues and nothing is explained. Maybe the story gets deeper eventually, but if the only revelation on what was discovered in the plot was 10 hours in, it is a very, very slow drip. None of the characters reacted to the new discovery either, nor discussed it. Also, I already assumed what the discovery was before it was found. The dialogue also contradicts itself or does not make sense sometimes.  I encountered one bug so far, and it was a permanent stat upgrade that crashes the game and my GPU when I pick it up. \n\nOverall- I would only pay maybe $25 for this soulless, borderline AI generated, visually stunningly modelled, slop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Giving this game a negative review with the hope that they will improve on their next title. The game has great visuals, music and sound. Unfortunately the combat, exploration and difficulty really needs tuning. Get your shit together shitup.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overall this is a good game.\r\nHowever, I am stuck on a platform related issue on the 1st mission at the Plaza Entryway station where you have to perform a triple pole jump.\r\nIt says you have to do a Jump-Dash on the second and third poles. \r\nI can get to the second, but the third always falls short. \r\nI have reset my frame rate to 30 as advised with no luck. \r\nI have spent over an hour trying to do this specific jump and I can't proceed further into the game until I do. Others online have had the same issue/\r\nSo I have given up, \r\nHopefully the developers can fix this issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring gameplay that lacks a real combo system, 70% of game is just deserts game says it crash when it doesn't kicks you out anyway losing hours of progress sometimes, extremely nihilistic with side content literally 90% of them is that there dead end of story if your going get this game get it 20 i just cant see this game being worth at full price",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not for a casual gamer. Even story mode poses enough challenge. Enemies are everywhere and while most fights is totally not interesting there is next to no avoiding them. Story seems nice though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not worth its full asking price. It should have stayed in development for another 3 years. It is too short, the enemies and boses are reused multiple times, unimaginative combat system and map design, boring cliche anime characters, every story ends in tragedy trying desperately to make you feel something but its done and written so badly. This game is mediocre in every way possible. Its soulless. As the devs said themselves they have been inspired by nier automata and bayonetta but this game is as far as you can be from it. The main character lacks a personality and style.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass great\nstory neat\nmods horny\ncombat good\nplatforming miserable\n\nsome bosses will just bullshit and oneshot you if you miss one bullet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its aight, excpected the dialogs to be better considering it a PlayStation Exclusive, aimed toward gonners.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If steam would allow neutral, i would give this a neutral.\n5/10 \n\nTLDR. get this at a discount (<40$), if you are into action combat games (check the Free Demo!)\n\nLongform:\n\nThe good:\n- grafical fidelity is high\n- the combat is generally very fun (and for the most part challenging)\n- amazing soundtrack\n- adjustable difficulty, highly adjustable acceptability\n- free Demo (that is representative of the game)\n- I liked the English voice over\n\nThe mediocre:\n- the story is very basic, it's not bad per se, but if you are aware of common sci-fi tropes you can predict it very easily\n- enemies are varied enough for one playthrough but get repetitive beyond that\n- the levels are varied in them self as far as mixing combat/ platforming/ exploring and small puzzles go\n- progression feels almost to fast, as the game constantly throws skillpoints and upgrades at you\n\nThe bad: (mild spoilers)\n- the levels/ areas are incredibly repetitive: you start in a city, then desert, city, desert city and the game ist over. By the time the (short) game has ended i felt like I had played through it twice given how similar the areas were in their design\n- immersion is very low as you constantly need to platform or solve very gamey riddle to progress, yet the protagonists talk like everything is supper serious, which feels like they just didn't know how to properly integrate all the platforming and puzzles into their narrative vision\n- sound design: the soundtrack is awesome but the game is divided in sound zones, when you step into a new zone a new track plays. This means every time you reach a checkpoint you will get an immersion breaking music change, let alone the hub area, where the music changes 5 times in 30 seconds depending on the route you take\n- pacing: during the first 80% of the story you faces 10 bosses (of these only 6 are unique while 4 are recolors), then in the last 20% you face 6 bosses back to back no regular enemies in between. Yes I don't get it either.\nthe game is very short (~ 25 hours) if you play the main story and readable side quest. What do I mean reasonable? Many sidequest are: back track to a location you already cleared to kill x or find a box. They are so - obviously filler it makes me cringe.\n- cumulative this leads me to critique the price. There is way to little content to justify the huge price tag. Paying 40$ would be the absolute limit, I'd recommend this game at. And that's being generous.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has cute girls, and is fairly fun. The music is gratingly bad. The entire ~3hrs I played there was like a 90 second loop of a woman singing playing over and over and over. I considered muting the music, but then I realized I have so many other games on my backlog that I wasn't going to make excuses for this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don.t play game is  harder that dark souls and bloodborne",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good for streaming content for those game streamers are usually good at games. Lots to explore, sparky fighting skills and effects, excellent character design. \r\n\r\nHellish for average players. Do not waste your money if you're not good at Darksouls games. Even those trash monsters on the field will eat you alive if you're not good at those.\r\n\r\nGit Gud? Shut up. You don't pay me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I know I have completed the game for 100% (achievements included), but it was pretty boring gameplay. Best were boss finishing cutscenes, costumes and locations.\n\nSidequests are boring, fight feels hard to dodge and parry (Clair Obscur is way better in this).\n\nCollectibles are fine, but only cans.\n\nI went trought main story only in NG+ and it took only 5,5 hours. It is pretty short and mostly boring (NieR was 100% better), so without the exploring and sidequests, the game is not worth it for the full price.\n\nRecommended price is about 20 bucks.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "painfully, excruciatingly mid outside of EVE's visual fidelity. combat feels good and fun and flashy for the first handful of hours until it becomes annoying half the time rather than fun. it's sekiro: automata as ordered from aliexpress and it's also drunk, and it can never really even maintain half of the slickness in control and combat-feel as any of the other games it is constantly reminding you of. exploration is fine, besides EVE feeling like a drunkard covered in molasses sometimes, and the two main \"open world\" areas both being vast, empty deserts full of nothing interesting and sprinkled with enemies like JRPG random encounters and dotted with the boring sidequests you pick up from the hub town.\nthe story and worldbuilding is nier: automata written with chatgpt by a teenager for their amateur webtoon, which is to say it isn't particularly good. it almost makes you feel silly for paying attention and trying to get [i]something[/i] out of it, but it never stops feeling just kinda generic, and again constantly reminding you of its influences that are way better (not helped by the nier outfits literally changing the music in areas).\nyou would think there would be colorful and interesting characters to fall back on, but unfortunately that isn't the case either. none of the characters go beyond dull, flat, and one-note. they're very pretty, but you do not care about any of these people. \nit's kind of wild that SHIFT UP's own mobile gacha game nikke has more fun characters with engaging storylines in comparison, in a cast also full of bouncy bodacious beauties. get that for free and have a good time if that's what you're looking for. there's just better games for \"hot woman doing cool things\", and way better games if you're looking for souls-like combat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a top gooning experience, don't get me wrong, but the game is... empty.\r\nThere are 125 outfits and only 20 bosses. \r\n\r\nThe open areas are huge and empty. You can't even run between things you want because you are forced to fight or run on regular speed instead of cruising. Long animations for miscellaneous actions. Transparent walls. Clunky \"exploring\" movements. 0 iq puzzles. Everything related to exploring is just bad and frustrating.\r\n\r\nMelee Combat is fun but you have more moves than there are enemies. You can find the style you like, this is cool. Only 1 animation to \"kill\" after parry, that's getting old and boring like in the first 2h.\r\nShooting is made clucky and not fun to use in combat, too long to shoot, too long to choose ammo type, the charging ammo is a joke, no one will be able to use it in combat. \r\n\r\nTLDR:\r\n+ Top gooning content\r\n+ Fun Melee Combat, lots of moves\r\n\r\n- Shooting\r\n- Frustrating exploring\r\n- Empty word that doesn't look interesting. I guess most people don't notice the background though...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "save system sucks. back to save points instead of save anywhere.\n\nEdit: so im done x.x had a fatal error that it corrupted my save while trying to search warehouse 77 in the flooded district of edios 7. 14 hours down the drain... uninstall. oh and yea the corrupted save got uploaded to the cloud of steam so i legit have to restart the whole ass game. fuck that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Severe performance drops in the final section of the game makes it unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game looks good for sure, but the main combat loop is kinda terrible at best.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}