{
  "positive": [
    {
      "review": "When I tried the demo, I actually wasn't too sure it'd be my thing. Before now, I've only ever used one other program to act as my cozy, lofi, chill ambience (gogh). But the other day, I fell down a rabbit hole and discovered that there's a decent amount of these 2D/low resource utilities. This is probably my favourite alternative to gogh!\n\nI love the selection of music-especially the classical songs.. I bought the 'all-in-one' bundle, but i think the music that comes in the base game is fine, too (i used the demo for about 2 nights before deciding to buy and I was unaware that it even had any DLC until that point).\n\nInitially, I was a little upset at how level progression works. Leveling up will earn you huge chunks of currency you can use to customize your experience further. And you  unlock things like new pets and rooms at certain level milestones. You can only really level up by listening to music.I remember feeling a little upset thinking \"man, it's gonna take forever to get everything!\" and i just read a negative review to that same effect.\nbut I realized... that's kind of the point of a utility like this, no? it's meant to sit to the side and look cute while you focus on your work or tasks. there's a lot to customize, but its primary function is not to be a dress-up game, haha!\nSo, after I stopped harping on the leveling and simply focused on my work/projects. I had a good time hearing the music and the time seemed to fly by! I felt like the level-up boxes were coming in non-stop. I really like this thing!\njust take it easy~",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Foreword:\n\nMini Cozy Room: Lo-fi has an interesting concept. I bought it at full price while owning two other “productivity-enhancing tools” simply for the music downloadable content that intrigued me (classical and jazz ones specifically).\n\nAesthetics:\n\nThe game has beautiful pixel art and a ton of customization options for your character and your room. You can unlock more rooms the higher level you are, which then unlocks more customization options.\n\nThe music is very good. I listened to all the albums (including DLC) and really enjoyed the Jazz and Classical music albums.\n\nFunctionality:\n\nThe leveling system is fairly simple. Each second grants you experience; the higher level you are, the more experience (and rewards!) you get. You can be away from the keyboard, but you can only bank a maximum of five levels.\n\nYou have all the expected productivity-enhancing tools (timer, memo, etc.).\n\nEnjoyment:\n\nI did not use it for work, but I really enjoyed my time with Mini Cozy Room.\n\nConclusion:\n\nMini Cozy Room: Lo-fi can be categorized as part of the new wave of work productivity enhancers or just a cute, innocent distraction. The pixel art and music were extraordinary, definitely a steal even at the full price.\n\nOther Notes:\n\nNone at the moment.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Needs to have WAY more and in depth customization options (Better backgrounds, more things to do, more animations). I got all the dlc, good music. I really hope this DEV delivers. \n\nThis game is like Spirit City: Lofi Sessions, but optimized for a laptop. This is a super niche but NEEDED game. The productivity tools are insane to help me study at my university library with headphones.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "After 4 hours of playing I can say that I strongly recommend this game!\nIt's small, cute, has all the necessary gadgets(to-do list, timer and memo pad) and not only the lo-fi, but the jazz playlists. Since I'm a big fan of jazz, and it really helps me to concentrate - this is the killer feature :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a cute little application,  stop watch, notes, and ability to play your own music, along with decorating small spaces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got it on offer assuming it would be a LOT less than it is and all I can say is: I'm far beyond shocked how lovely this is made! It almost feels like I stole lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This app is very customisable but not distracting. It's easy to focus or just unwind. Especially if you're doing a creative project, studying, reading. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the perfect little background game / app to add a cozy ambiance to my day. it's simple, darling, has TONS of music to pick from, and lots of organizing / decorations that aren't locked behind a paywall. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is officially my new lo-fi background go-to. The vibes are cozy, the music is relaxing (though playlists need some curating), and it’s perfect for studying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, bought it for my friends as well as myself coupled with a few DLCs. The more uplifting songs are my personal favorites and there are plenty of them. I recommend the Jazz and Lo fi Hip Hop DLC if you want some more cozy/happy vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best cozy game, even comes with necessary tools such as task list",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it a \"game\"? No, not really.\nIs it lo-fi and cozy? Yes, yes it is.\nDoes it help me chill while doing other stuff on my computer? Yes, yes it does.\nDoes it help me set a mood for my personal space? Yes, it does.\n\nWould I recommend this to someone else looking for those things?\nYes, I very much would.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's cute and a nice thing to open when you're reading or working, while Lo-Fi Music plays in the background, with a cute to-do task notepad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cute and super chill, Mini Cozy Room: Lo-Fi is a highly-customizable productivity app with in-game goals that encourage you along your focusing journey!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the Best Relaxation, Music and Task involved game that I have come across.. Its not too big nor too flashy on its \"gameplay\"and the musics are just right for the right mood of the day...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the chillist fun little games i have ever played. Brings me alot of joy to customize everything and listen to the awsome lofi tunes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the coziness of this game, its great to have on when doing tasks and being able to customise the room and change scenery is a nice touch too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Creative design and a very cute game, helps to stay focus and sits in the background as you work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mini Cozy Room: Lo-Fi turned out to be a pleasant surprise. Its simplicity, calm atmosphere, and soft lo-fi ambience make it an excellent companion for office work or focused tasks. The experience feels smooth and non-intrusive, offering just enough stimulation to stay engaged without overwhelming the senses.\r\n\r\nWhat stands out most is how easy it is to use. The interface is intuitive, the tools are straightforward, and everything flows naturally — making it ideal for productivity sessions. Another big plus: there are no paywalls or aggressive monetization mechanics. Everything feels accessible and honest, which is rare and refreshing.\r\n\r\n✅ Pros\r\n\r\nSimple and easy to work with: The interface and tools are intuitive, making the app quick to integrate into your workflow.\r\n\r\nGreat for office or focused work: The relaxing visuals and cozy design help create a productive environment.\r\n\r\nNon-invasive audio: The lo-fi background sound is calm, subtle, and doesn’t distract from tasks.\r\n\r\nNo paywalls or intrusive monetization: You can enjoy the full experience without being pushed to spend extra money.\r\n\r\nSmooth experience overall: It delivers exactly what it promises — a calm and cozy productivity companion.\r\n\r\n❌ Cons\r\n\r\nMay feel repetitive over time: The core routine (decorating, listening, focusing) doesn’t change much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice ambience, and it's fun designing the different rooms once you accumulate enough points. \nIf devs read this, please add landscape / scenery to Room 2 and Room 3! The fully white windows are killing my room vibe.\nGreat idler, instant purchase at this price point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty cool application to run in your background, I waited to review when I maxed out all the rooms and character model of things I wanted to give a completed experience review. I designed my character model based off my girlfriend because why not. It feels rewarding to unlock things over time from just doing what you are used to doing if you like feeling rewarded for doing what you are already most likely simply used to doing. It has a nice Timer, To do list and Memo application. I mainly use the web browser extension mechanic with youtube on it to listen to whatever I mainly want to. I think the game is worth it if you like chilling on your pc alot and you could make use of the tools it comes with as I use them sometimes for gaming or task related purposes. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute little side helper for my pc. I use it for D&D most of the time, as well as when I am drawing. I use the alarm and timer to help remind me when to get water or get something to eat. A feature I'd love in this is a journal area. Would be super cool! \r\n\r\nLove it regardless though! Its amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "actually really nice. \nnotes, timer, to-do list super cool.\ntimer one is pre-set to the 20-5 too for breaks and such (you can change it) :)\n\nmusic is just relaxing. integrated youtube is cool too (wish it could read from the un-integrated yt music, and if it can that didn't work for me)\n\nbut yaya super cool.\nhaven't checked it out but custom albums that you can upload would be cool too. see there is an upload section but just haven't tried it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's actually not a full game, it's just a music player with customizable little cozy room.\r\nPretty cute and nice fibes, nice chill music too!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Giant library of music tracks to cycle through - even without the DLC! And it's good music too! If you love putting on some Lofi in the background while you work, THIS GAME IS FOR YOU. Literally, this is the best idler with the largest variety of included Lofi music that I've found. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah I uhh, I think my hours speak for themselves.\n\nReal talk though, this is absolutely fantastic if you've got a laptop. Here's to more updates in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mini Cozy Room: Lo-Fi is a cute app companion for your chill gaming or music session.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bahasa Indonesia,\r\nAplikasi yang bagus untuk menemani kerja,disamping bisa memutar lagu Lofi,juga ada timer,note,dan list. Itu sangat membantu sekali untuk Pekerja seperti saya.\r\n\r\nMungkin tambahan fitur.adakan Waktu Sore dan Malam,untuk penganturan cahayanya.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Lo-Fi music and sounds for study and relaxing with cute pixel mini room.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This one really works for me. simple and cute and not taking up spaces and easy to left idle on the back ground while easy to fetch at the same time. The youtube embeded really have potential, I use it a lot, I wish the fav can be saved to on the favorite tab to be clicked right away but overall already good. Keep it up! I like the train and manor one very much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice Game to have that builds as you spend more time. I tend to have it in the corner with calming music playing and I'll add to my lovely houses. I would appreciate if it would work on my macbook however.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glad I bought this game, since then my work effectiveness has gradually increased!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty music and it doesn;t get in the way so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good interface, nice music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like my little room!! definitely need more furniture and clothes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fine. Love my cozy burrow. \nI want morreeeee decorations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fact this supports local music files instantly elevates this game(?) from alright to literally my main music player.\nIt is a little buggy though (as of writing this):\nSteam Cloud Saves cause the local music files to stop existing, even if you open the game once on another device, then go back to the device with the music on it.\nA beneficial bug is that when previewing an item for your room, switching to another room will permanently place the previewed item in your room without needing to buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is probably the best focus tool I've used, I love how many customizable options there are for rooms, music, ambiance, pets, and the character. There's notes, to-do list's, and a timer/stopwatch option as well. It's cool that you can pick many options on the alarm sound for starting and ending, so it makes it more fun to do pomodoro method. There's also multiple colors to choose from for the pop out tabs which is cool. I also think it's super cool you can add your own music and change the background for the main game tab. I don't know if it's silly but I'm really impressed with how much I like this! It's not SO much that I'm TOO distracted, which is what I felt with Gogh, but still enough that it's fun and not so basic! Also not a whole lot is blocked by a paywall like how a lot of focus apps are on the phone, so that's cool too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is exactly what it looks like on the packaging. Perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This can be hardly considered a game but I like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun little game while being productive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very cute background noise kind of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's nice to have on when you're mindlessly shopping online",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the perfect little background game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "literally the most adorable game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything in this game is mini. The pet? Mini. The Switch? Mini. My will to live? Also mini.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "So relaxing, so calm. Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I entered the cozy room to relax… now I live here. Please send snacks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has become my bestfriend on my pc <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cutest Mp3 player on the market, me likey",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play it practically all the time^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ultimate work companion :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice working companion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak thing to use when writing or such",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yummy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best gift ever got",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel super relaxed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love ts game<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice PixelArt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SIT BACK AND RELAX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chillig, Cute was will man mehr. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sooo cuteeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the train. big fan of the train.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Chill. I'm 'bout it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lofi >.<",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "simply awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gato",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cute.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dfrhyg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has everything I need for a mini-checklist, memo, and timer. Plus the worko buddy gives some sense of relief and companionship as someone who suffers from an anxiety disorder. I hope for more room decors in the future!",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "Has everything I need, for productivity. Wish there was an activity that my avatar would be cleaning though. And a full screen mode would be nice.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Really adorable game! If you're into idle games and clickers, this game is for you. You can edit your little room, add pets, and fix many things to make it even cozier. Highly recommended if you like idle games!",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "When I tried the demo, I actually wasn't too sure it'd be my thing. Before now, I've only ever used one other program to act as my cozy, lofi, chill ambience (gogh). But the other day, I fell down a rabbit hole and discovered that there's a decent amount of these 2D/low resource utilities. This is probably my favourite alternative to gogh!\n\nI love the selection of music-especially the classical songs.. I bought the 'all-in-one' bundle, but i think the music that comes in the base game is fine, too (i used the demo for about 2 nights before deciding to buy and I was unaware that it even had any DLC until that point).\n\nInitially, I was a little upset at how level progression works. Leveling up will earn you huge chunks of currency you can use to customize your experience further. And you  unlock things like new pets and rooms at certain level milestones. You can only really level up by listening to music.I remember feeling a little upset thinking \"man, it's gonna take forever to get everything!\" and i just read a negative review to that same effect.\nbut I realized... that's kind of the point of a utility like this, no? it's meant to sit to the side and look cute while you focus on your work or tasks. there's a lot to customize, but its primary function is not to be a dress-up game, haha!\nSo, after I stopped harping on the leveling and simply focused on my work/projects. I had a good time hearing the music and the time seemed to fly by! I felt like the level-up boxes were coming in non-stop. I really like this thing!\njust take it easy~",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Foreword:\n\nMini Cozy Room: Lo-fi has an interesting concept. I bought it at full price while owning two other “productivity-enhancing tools” simply for the music downloadable content that intrigued me (classical and jazz ones specifically).\n\nAesthetics:\n\nThe game has beautiful pixel art and a ton of customization options for your character and your room. You can unlock more rooms the higher level you are, which then unlocks more customization options.\n\nThe music is very good. I listened to all the albums (including DLC) and really enjoyed the Jazz and Classical music albums.\n\nFunctionality:\n\nThe leveling system is fairly simple. Each second grants you experience; the higher level you are, the more experience (and rewards!) you get. You can be away from the keyboard, but you can only bank a maximum of five levels.\n\nYou have all the expected productivity-enhancing tools (timer, memo, etc.).\n\nEnjoyment:\n\nI did not use it for work, but I really enjoyed my time with Mini Cozy Room.\n\nConclusion:\n\nMini Cozy Room: Lo-fi can be categorized as part of the new wave of work productivity enhancers or just a cute, innocent distraction. The pixel art and music were extraordinary, definitely a steal even at the full price.\n\nOther Notes:\n\nNone at the moment.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I have tried several of these lofi games/apps over the last few years and this is by far my favorite. \n\nMy Pros:\nIt has 3 sizes and the smallest is like a little inoffensive toolbar you can slide wherever without blocking the screen.\nIf you get the complete pack it has (at least right now) about 300 songs and over 50 ambient sounds you can mix and match until you have something you can enjoy.\nYou can create multiple different cute pixel art rooms with various kinds of furniture and customizable backgrounds\nThere are some really fun and cute outfits to choose from.\nThe new timer feature is quite nice and has 30 options for noises to make when it is time to take a break or get back to doing something. \n\nMy Cons\nThere just doesn't seem to be enough options to unlock and items to decorate the rooms. \nIt would be nice to be able to customize the colors of the various beds, chairs, rugs, shelves, ect to make a really nice room that matches individual tastes.\nA similar feeling with clothing as there needs to be more customizable options and color choices. \nThe memo and to do list don't feel complete to me. They are new features and helpful, but I feel like there should be at least more pixel art within them or the ability to perhaps add little pixel stickers or icons to the parts you interact with (like the check boxes) because they just feel out of place when I load them up.\n\nOverall feelings:\nThe pros are more powerful than the cons. I have never had one of these apps where I just decided to hook it up to my portable speaker so I could have it playing while cooking and cleaning the house. It's cute and fun and gives you way more for a much lower price compared to the other lofi players I have personally used!\n\nEdit 15 October 2025\n\nToday marks a large update with lots of extra drops which I feel has solved several of the cons listed above!\nThey added in a huge number of new customization options for previous rooms and your wardrobe. Previously, most room options only had 2-5 choices for wall/floor colors, furniture pieces, and various props. Now there are several times that amount in the decor sections of each room. Different colors and styles are available now to match up with a larger range of tastes and I feel like it will just keep getting better and more diverse as future updates drop.\n\nThe ability to save three different versions of each room is another great update for the pro column as now you can easily change moods of the rooms to match how you feel. This also helps because with the new decor options, I have a difficult time deciding what to make the rooms look like.\n\nThe only issue I feel is left is the lack of customization of the to do list and memo sections, which are both quite plain. However, these are brand new features and I imagine that they will be updated sometime in the future to match the level of personalization that the main rooms give you.\n\nTLDR: \nI have been using this for a while and what was originally my favorite lofi player and ambient background sound generator is quickly pulling ahead to be one of my most used programs/games on the steam platform. \nMy previous review still stands in that I cannot recommend this enough to everyone! It is cute and fun and has such a huge variety of songs and sounds built in that I rarely feel the need to use the embedded streaming service they are currently testing out with youtube.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Absolutely love this little tool. The aesthetic is lovely and cozy, music options are excellent, tools are great for what I need, display options are versatile so it's non-obtrusive when I'm working. I basically use it all the time. The Ambient noise mixer is probably my favorite thing next to the pixel art. \r\nThis latest update absolutely knocked it out of the park for me with allowing presets for ambient noise mixes and presets for room designs along with all the other new customizations and fixes. I'm excited for whatever else they come up with.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Needs to have WAY more and in depth customization options (Better backgrounds, more things to do, more animations). I got all the dlc, good music. I really hope this DEV delivers. \n\nThis game is like Spirit City: Lofi Sessions, but optimized for a laptop. This is a super niche but NEEDED game. The productivity tools are insane to help me study at my university library with headphones.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Awesome, cute and adorable.\nBesides being a very nice tool for listening to lofi music or your own playlist, it becomes your daily routine, your own world, even if limited to its features.\n\nI'm so glad I got recommended this, it's always so nice to come back to it every night.\n\nWill probably spend countless more hours on this :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Finally no need to use YouTube for lofi mixes. Not only that but the cozy vibe of the art paired with the music is perfect for long coding sessions. Amazing piece of software.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Using it for studying purposes and honestly i love it. Features are all useful and i love its pixel art styleee.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Cozy idler with a beautiful lo-fi soundtrack and plenty of features! Includes a memo, a to-do list, and a timer. Customize your room, add a pet, and more — definitely worth the price!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Helps me focus and a lot of customization options",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing sounds and simple game play. It is super sweet.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really cute cozy game. Two of my friends already bought it too because I kept going on about how much I like it! The rain and thunder noises make me feel super cozy <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love it soooo much!\r\nLots of ambient sound which is possible to mix with lo-fi, wardrobe nice, items are cool and cozy :)\r\nBut it will be great to add the possibility to add something on the table since it feels kinda empty, especially when character is not sitting there at that moment + possibility to change weather behind the window and more surrounding/landscape variations for other rooms, like on the first room.\r\nIt would be nice :3\r\nBesides that everything is nice and pretty :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "OMG! I love this game! It is so cute and fun! It helps me get work done! I cannot recommend this game enough! Money very well spent! Please give this little gem a try!!! Thank you devs for such a great fun experience, and please keep adding more rooms/decorations/clothes!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 4 hours of playing I can say that I strongly recommend this game!\nIt's small, cute, has all the necessary gadgets(to-do list, timer and memo pad) and not only the lo-fi, but the jazz playlists. Since I'm a big fan of jazz, and it really helps me to concentrate - this is the killer feature :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cozy idle productivity game! 🌸 Keep organized with to-do lists, notes, and timers while decorating your room and character, having your own pet, and enjoying relaxing lo-fi music or ambient sounds. The aesthetic is warm and charming with versatile display options; you can even minimize it to a corner of your screen so your character and pet are always nearby without getting in the way, a truly delightful touch. I love how you can design your room and your character however you like, plus the sound mixes are really nice! Totally worth it! ( ˶^-^˵ )/₊˚⊹♡",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bagus untuk relaksasi sekaligus mengerjakan tugas kantor serta menambah mood dalam bekerja 100%",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is an issue with the button that you can click to earn points, it is literally stuck so you cannot earn any points at all. The levelling in this game is also increasing exponentially, so getting more points is almost impossible unless you run this game for many hours on end.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a definitely cute game. Cute house design, cute clothes, cute characters. I would like to give a positive review until the following problems happens again and again. \r\n\r\nHowever, for the functions, it crushes so many so many times. Whenever I want to use the notes to records something, it will crushes and no responding. This is horrible, 'cause it will also not allow me to use other applications until it completely crushed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC가 벌써 6개나 생긴 거 보니까 추천 못 하겠음.\n게임이 무료인 것도 아닌데...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers are unresponsive and forums are dead as well, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}