{
  "positive": [
    {
      "review": "I started Wuthering Waves about a month after its Steam launch, and honestly, I haven't missed a single day since. I’m writing this after hitting 100% completion on absolutely everything: the map, every quest, all holograms, and even the end-game modes. And after all that, this game is a solid 10/10 for me. I’ve spent countless hours on Destiny 2 and Dota over the years, and Wuthering Waves has still managed to be the game I've spent most time playing this year.",
      "voted_up": true,
      "votes_helpful": 92
    },
    {
      "review": "A mixed experience of a gacha game for me, but overall I would recommend. The game's best in the 'honeymoon' period when you haven't run out of content to do yet or characters to level. \n\nPros:\n1. Visually stunning. Your thermals might take a hike, but the game looks breathtaking at higher settings, especially in 4k. Cut-scene direction and camerawork is great and dynamic, especially in the later quests. \n2. Voice acting in the later patches is stellar: despite there being quite the uproar over subpar voice acting when the game released, the recent patches have not only fixed the issue, but gone above and beyond. I play in EN audio, and especially the VAs of Iuno and Carlotta have done a stellar job of it.\n3. Combat is fun and diverse enough. Didn't axe mechanics like perfect dodges and perfect counters, as some gachas do when they're also on mobile. Character animations are often visually great and creative.\n4. Some of the story is good: although the whole picture is kind of mixed. The story is at its worst in those first stretches of quests, but gets exponentially better as time goes on.\n5. Amazing music: especially the scores in Rinascita.\n6. Relatively challenging endgame: this will vary depending on skill level, character investment and how much you might have whaled, but generally there's a good amount of challenging content to work towards.\n7. Somewhat generous gacha. Not ideal by any means, but has some nice things that competitors don't, like buying a copy of a limited character you've already got (albeit for quite a bit of currency) and not having a 50/50 or 33/67 on the weapon banner (*cough cough* Genshin).\n8. Fun characters. Some are same-y, but most have something unique about them or their stories that makes them at the very least briefly interesting.\n\nCons:\n1. It's a gacha game. It updates periodically, so there will be powercreep, and the main goal will always be to get plays to swipe for characters.\n2. Teams locked behind spending. A lot of characters lately come with 'best partners' - limited, of course - that make a massive difference to damage output. Doesn't mean the characters are unplayable without their partner, but they're a lot complete (Zani-Phoebe, Cartwheel-Ciaconna, Augusta-Iuno, Phrolova-Cantarella-Qiuyuan, etc.)\n3. Very few four-stars. Not a problem unique to this game, but a problem nonetheless. Most four-stars are not very good (with some exceptions, of course) and there are not very many of them. \n4. Gooner elements: which is not a secret to anybody. The women in this game are sexualized to sometimes a comical degree, such a jiggle physics jiggling through a solid piece of METAL chest-plate (lookin' at you, Augusta), and overall looking incredibly uncanny, like they're made of water and not flesh. Standard levels of stupidity in character design, as well (most of the women are half-naked, even when it doesn't make any sense). Most will also simp for the MC or have narratively unearned romantic moments, which gets annoying somewhere after the third time.\n5. For people who enjoy having playable men, this might not be the best game. They are very few and far between, and often end up relegated to supporting roles (or, for example like in Qiuyuan's case, their DPS playstyle is locked behind several copies).\n6. Nothing to do once you've caught up to the story. A usual problem for live-service gacha games. Events are often boring and one-note, and once you've logged in, done dailies and farmed mats, there's not very much left to do. This is perfectly fine if you play casually and have longer bursts of playtime whenever a new update comes out, but if you're looking for something to play regularly, you might be disappointed in how little there is to do after a certain point.",
      "voted_up": true,
      "votes_helpful": 75
    },
    {
      "review": "10/10 – I Don’t Even Know Why I’m This Hooked\n\nI’ve got over 30 hours in Wuthering Waves so far, and I still don’t really understand what kind of magic this game has on me. All I want to do is log in, grind, explore, and fight more bosses.\n\nThe world is massive and surprisingly alive — the music, the combat flow, the character animations — everything just clicks. The combat feels insanely good once you start chaining dodges, parries, and echoes together. It’s like every fight has its own rhythm.\n\nI told myself I’d just do a few daily quests... next thing I know, it’s 3AM and I’m farming echoes or trying out new team comps for the tenth time.\n\nIt’s not perfect — the early game pacing and some voice lines can be a bit rough — but it’s improving fast, and honestly, I don’t even care. The game just feels good to play.\n\nIf you love open worlds, stylish combat, and games that pull you in without you realizing how much time has passed — Wuthering Waves will eat your free time and make you thank it for doing so.",
      "voted_up": true,
      "votes_helpful": 66
    },
    {
      "review": "[h2] As someone who has never been into the anime universe, this game is exceptional. Here are the things that impressed me after spending 100+ hours of playtime: [/h2]\n[olist]\n    [*] Smooth combat & gameplay\n    [*] Responsive controls, both on keyboard/mouse & gamepad  (I use the keyboard more because it gives me better control and flexibility in fast-paced combat, but I switch to the gamepad when I want to sit back and chill)\n    [*] Stunning visuals & animation\n    [*] Unique character design\n    [*] An immersive open world to explore\n    [*] Good storytelling with emotional depth established through the characters\n[/olist]\nThe standard of this F2P game can easily match modern AAA titles, and it's really worth the time to play and invest in, especially with the continuous updates, new contents, and new characters.\nWell done, KURO GAMES!\n\nOh, and by the way... if you're a cat person like me, keep in mind that you can even pet and feed the kitties! ^^\n\n⣿⣿⣿⠟⠛⠛⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢋⣩⣉⢻\n⣿⣿⣿⠀⣿⣶⣕⣈⠹⠿⠿⠿⠿⠟⠛⣛⢋⣰⠣⣿⣿⠀⣿\n⣿⣿⣿⡀⣿⣿⣿⣧⢻⣿⣶⣷⣿⣿⣿⣿⣿⣿⠿⠶⡝⠀⣿\n⣿⣿⣿⣷⠘⣿⣿⣿⢏⣿⣿⣋⣀⣈⣻⣿⣿⣷⣤⣤⣿⡐⢿\n⣿⣿⣿⣿⣆⢩⣝⣫⣾⣿⣿⣿⣿⡟⠿⠿⠦⠀⠸⠿⣻⣿⡄⢻\n⣿⣿⣿⣿⣿⡄⢻⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣾⣿⣿⣿⣿⠇⣼\n⣿⣿⣿⣿⣿⣿⡄⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣰\n⣿⣿⣿⣿⣿⣿⠇⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢀⣿\n⣿⣿⣿⣿⣿⠏⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿\n⣿⣿⣿⣿⠟⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⣿\n⣿⣿⣿⠋⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⣿\n⣿⣿⠋⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢸",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "[h1] Definitely Worth Playing Gacha Game [/h1]\n\nWuthering Waves is easily one of the best action-focused gacha games out right now. The combat is insanely smooth, responsive, and genuinely skill-based — dodges, parries, and combo swaps feel so satisfying that even normal enemies are fun to fight.\n\nThe world is beautiful in every region, with stunning landscapes and stylish cities that make exploring a joy. The music fits perfectly too, adding atmosphere whether you’re gliding through a valley or fighting a boss.\n\nCharacters? Gorgeous. Every new banner feels like the devs want us to keep “gathering wives,” and honestly… we’re all happily doing it.\n\n\n[b]Cons[/b]\n\t•\tWell, Its GACHA.\n\t•\tStory pacing can feel slow in early chapters.\n\t•\tSome open-world puzzles and mechanics can feel repetitive.\n\t•\tOccasional performance issues on weaker devices.\n\nOverall: If you want a gacha game with top-tier combat, great visuals, amazing vibes, and characters you’ll definitely fall in love with, Wuthering Waves is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "It’s good, the quality is noticeable, with updates every few weeks and new characters and content. Combat feels great, not too hard, not too easy.\n\nBut at the end of the day, it’s still a gacha. The monetization can be predatory, and if you’re someone who struggles with spending too much on these types of games, you should probably stay away.\n\nFor low spenders or F2P though, it’s surprisingly chill, you can enjoy pretty much everything without feeling forced to swipe.\n\nGreat game overall, just play it responsibly.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "Wuthering Waves is a game that not only impresses with its graphics and story but also makes the process of acquiring new characters and weapons easy and enjoyable, without the need to spend real money. As a F2P title, the game allows you to obtain new heroes and powerful gear through gacha pulls, events, and other in-game mechanics, without feeling pressured to pay to progress. Thanks to this approach, you can enjoy the game and get the most out of the content without any restrictions.\n\nThe soundtrack is more than just background music—each melody reflects the emotions of the characters and deepens the atmosphere, creating a real sense of magic around you. And the graphics? They’re simply breathtaking: the worlds, the details, the characters—everything looks incredible, and it's impossible not to be impressed.\n\nAs for the story, it captures not only the main events but also the deep personalities of the characters. You’re not just following the plot—you’re living it alongside the heroes, each with their own unique traits.\n\nRating: 9/10 — Wuthering Waves offers an amazing experience without the need to pay, with stunning graphics, an excellent soundtrack, and a captivating story!",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Though I’m not a big fan of gacha games this one hooked me for much longer thanks to its great combat, fun characters and vast beautiful world. I highly recommend it especially well its free.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3614931130\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3601588904https://steamcommunity.com/sharedfiles/filedetails/?id=3601588904",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Some of the best combat in any gacha game. The fights feel smooth, responsive, and rewarding, with perfect-dodge counters, combo chains, and flashy abilities that make every character fun to play. The world is beautiful, the movement feels great, and exploring the map is genuinely enjoyable. There’s a good amount of content, lots of characters to build, and the game keeps improving with updates.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Fun combat, beautiful landscapes, cute girls, a few cute guys, but not enough.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Game is stunning and a lot has changed since its release (visuals, sound effects, voice acting, performance), but what surprises me the most is that other gacha games failed to keep invested, something this one does with ease.\nThe combat reminds me a lot of a hack n slash, but also expecting mixing combos with other character in your team. It's a good feeling that I didn't have when playing Genshin Impact, for example, where everything felt more focused on spamming skills and sitting on it.\nThe post-apocalyptic environment is a plus for me. Observing the remnants of a civilization and the ruins of cities as we explore, creates more depth and highlights how impactful the enemies are in the story.\nOf course, since it's a gacha game, once you are done with the quests and events you will feel like there's a lack of content. If you plan on playing regularly, you probably will feel disappointed. \n\nWHAT I DON'T REALLY LIKE:\n- Gacha: Although it seems quite generous to get points as a F2P player, you won't have everything and will rely on luck for a lot of pulls. It is what it is.\n- Lacking male character: Used Calcharo for a long time because of his looks, but he underperforms a lot. Most male characters either are boring to play with, don't look good or both.\n- Some oversexualized female characters: Yes, a lot of games has it, it isn't new, and the point is to attract more attention (positive and negative), but the game looks stunning already, with different visual effects, dresses and how each character has a unique trait associated to it. The designers and developers already proved to be more than capable to create something superb and decent.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "very good visuals, combat and animations.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "After hearing some of my friends rave for days on end about how good this game is, I eventually [strike]was forced[/strike] decided to give it a try. The beginning of the game is similar to what I expected from a Chinese gacha game, with the story taking place in a post-apocalyptic civilization with destroyed modern cities full of monsters. These monsters, named Tacet Discords, are the main enemies you usually find throughout the game, sporting some of the coolest and most unique designs in the game, ranging from beastly to biomechanical abominations.\n\nSimilar to what happens with FFXIV, the initial Jinzhou storyline has some pacing issues, probably due to limited resources from the developers during the release of the game. However, once you're done with the Jinzhou zone, the game really opens up and the story picks up the pace. I was pleasantly surprised by how many different influences from western cultures converge in this game, including French, Italian, Greek or Roman aesthetics in some of the later zones. The characters' motivations and stakes grow as the storyline progresses, with multiple plot twists and really complex concepts and problems these characters need to understand and solve in order to move forward. These problems are never waved away for the sake of convenience, and at times it really feels like everything can go to shit at any minute during the MSQ if the protagonist doesn't lock in.\n\nThe soundtrack includes some real bangers, with a mix of trance, techno, rock or pop music depending on the context of the quests and zones in the game. I can't explain with words how good the background and combat songs for the [spoiler]Septimont[/spoiler] zone are, it is something you need to experience yourself.\n\nRegarding the playable characters that appear throughout the game, I was pleasantly surprised to discover that, even though some of them are somewhat sexualized, they are ACTUAL CHARACTERS, with personal development and personalities, instead of being reduced to plain eye candy similar to what happens in other gacha games. Every frame in each of these characters' animations is clearly crafted with love. The models are really high quality, and the skill design and artstyle are legitimately outstanding, especially for later units such as Cartethyia, Quiyuan or Chisa.\n\nSince this is a gacha, yes, you need to pull from banners for some 5-star units (resonators) and weapons, with some of them being time-limited, and requiring players to wait for the banner to come back if they miss it or don't get the unit before it goes away. There is a hard-pity system in place which ensures that you are guaranteed to get a 5-star resonator within 80 pulls. However, there's a 50% chance you get the banner-specific resonator, making it painfully annoying if you \"miss\" this 50/50 and need to keep pulling... However, the game is pretty generous with Astrite, the premium currency which can be obtained throughout the MSQ, side quests or open-world exploration chests and bosses, allowing for multiple pulls before you even need to spend any money if you have any semblance of patience.\n\nThis game is an absolute banger, really addictive, with a really solid story and fluid gameplay. The aesthetics are completely outstanding, with intense orchestral music, and cinematic, exciting and at times even challenging bosses. I am honestly surprised this game is only a year old with the huge amount of high quality content it already has. Additional props to the English translation team, which managed to adapt the game to western audiences, sneaking in later zones some easter eggs and somewhat obscure references to western media in quests and dialogues, it certainly got a chuckle out of me. Really recommend this game if you are willing to completely destroy your sleep schedule for the better part of two weeks or so.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This is the best gacha game and the evolution its biggest comnpetitor \"Genshin Impact\"\r\n\r\nDon't get me wrong, both gacha games are great, but as a year long Genshin player, I can say that WuWa is superior in many aspects.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A free game where you really don't have to spend to enjoy (you can though if you want of course). Devs put a lot of love into it and listen to the community (except apparently when it comes to adding more male characters D:)\r\n\r\nGood game, sometimes I can't believe this is also on mobile... like what?!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Despite Wuthering Waves being a gacha game, this never holds it back. The gameplay, characters, world, exploration, and music are of extremely high quality, and with every update, it delivers richer and more dynamic features that further immerse you in this innovative world. \n\nPersonally, I play this game for the story and characters. I have absolutely fallen in love with the narrative Kuro is trying to convey. It is undoubtedly one of the most visually stunning, thematically rich, and emotionally resonant stories I’ve encountered in a video game. It offers everything that matters to me in a story and so much more.\n\nThis game has an overwhelming number of qualities that I couldn't do justice to in just a brief review. Rover feels authentic, natural, progressive, flawed, and grounded. While some might say this story is about \"gathering\" wives, that couldn't be further from the truth. Rover's thematic journey revolves around fate versus free will. Can they unite humanity and overcome the fated end that the Lament poses? There are many deep and intricate layers to their character, how they tie in with the world itself, the people they save, and the overarching narrative. \n\nOn top of Rover, the antagonists in this story are some of the most metafictional, creative, well-written, and engaging characters I’ve ever seen. They consistently deliver in terms of presentation, which only makes you more invested. They challenge Rover in a way that makes you question the choices they've made throughout their journey, as well as the core values of the world and humanity itself. I won't spoil who they are or what they do. I simply urge you to find out for yourself.\n\nThe side characters are also fantastic. Especially from Rinascita (2.0) onwards, they are all brimming with life. The 1.0 story and its characters are still great, but the storytelling is weaker, which has led to less investment from people, and I completely understand that. However, every side character in 2.0 onwards has amazing dynamics with Rover. They genuinely feel like their own individuals, with emotionally cathartic backstories, realistic ideals, and world views. While some of the female characters have romance, it never detracts from their individuality. They are not reduced to mere accessories - they have their own ambitions, motivations, and ideals separate from Rover. Kuro makes an active effort to demonstrate this, and they have accomplished it fantastically.\n\nGameplay-wise, it only complements the story being told. It becomes deeper with each update, the character kits become more complex, and they continuously add unique and engaging mechanics that breathe EVEN more life into the system, enhancing its incredible addictiveness. The exploration throughout the game is amazing and serves to connect the world while building upon it. The only gripe I have so far is in the later regions, where it is admittedly quite hand-holdy. Other than that, the game is stunning, rich, and keeps you unlocking quests, hidden secrets, and amazing lore that's scattered across this vast world. \n\nIn terms of the Gacha system in this game, it is relatively fair. I've managed to pull every character I've wanted, and they are quite generous with the amount of pulls you receive as a F2P player. The best thing about the Gacha system is that the weapon banners are guaranteed. This means that when you reach 80 pulls (pity), you are guaranteed to receive the weapon of your choice. Unfortunately, characters still have a pity system, but it's a lot less taxing when you don't have to worry about losing your 50/50 on BOTH the character and weapon banners. Whilst there is still a bit of grinding, I wouldn't say it's tedious if you're a casual player. Especially since the in-game rewards system for levelling is generous, so you earn lot of pulls from simply progressing the main story. \n\nAll in all, this is absolutely a F2P game worth getting invested in. Kuro games consistently makes the game better, listens to player feedback, innovates, improves the world, gameplay, and narrative. If you love anime or manga series like Bleach, Re:Zero, Steins;Gate, Cyberpunk (Edgerunners/2077), or even if you simply enjoy romance stories, I think you'll definitely find some value in this game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "English - EN :\r\n\r\nWuthering Waves is absolutely stunning! The graphics and combat system blew me away. Easily one of the best mobile games ever.\r\n\r\nThe combat feels insanely smooth and satisfying. Every character has a unique playstyle that feels amazing.\r\nThe open world is gorgeous and full of detail. Exploring the map never gets boring.\r\nGreat optimization! The game runs surprisingly well even on mid-range devices.\r\nThe story hooked me from the very beginning. The character designs are just top-tier.\r\nFrequent updates and events keep the game fresh and exciting every single day.\r\n\r\nIf you love action RPGs, Wuthering Waves is a must-play masterpiece.\r\nOne of the best mobile RPG experiences I’ve had in years. Totally worth every minute.\r\nThe combination of visuals, sound design, and gameplay feels incredibly polished.\r\nThe more I play, the more I fall in love with this game. Definitely game of the year material.\r\n\r\nPersian | پارسی :\r\nواقعا ودرینگ ویوز یکی از زیباترین بازیهای موبایل نسل جدیده! گرافیک، موسیقی و گیمپلیش محشره. کاملاً اعتیادآور!\r\nبه نظرم سیستم مبارزات بازی فوقالعاده روان و لذتبخشه. هر شخصیت حس خاص خودش رو داره.\r\nمپ بازی طراحی بینظیری داره، هر گوشهاش پر از جزئیات قشنگه. واقعاً دنیای بازی زندهس.\r\nاپتیمایز بازی عالیه، حتی روی گوشیهای معمولی هم اجراش خوبه. توقع نداشتم اینقدر روون باشه!\r\nداستان بازی تو همون چند ساعت اول آدمو درگیر میکنه. شخصیتهاش فوقالعاده جذاب هستن.\r\nاضافهشدن آپدیتها و رویدادهای جذاب باعث شده هر روز انگیزه داشته باشم بازی کنم.\r\nاگر عاشق بازیهای اکشن و اوپنورلد هستید، اصلاً نباید ودرینگ ویوز رو از دست بدید. شاهکاره!\r\nبهترین تجربه RPG موبایل توی چند سال اخیر برای من همین بازیه. واقعاً ارزش وقت گذاشتن داره.\r\nترکیب صداگذاری، گیمپلی و طراحی کاراکترها یه تجربه کاملاً حرفهای و متفاوت ساخته.\r\nهرچی بیشتر بازی میکنم بیشتر عاشقش میشم. یکی از بهترین بازیهای سال بدون شک!\r\n\r\nبازی ودرینگ ویوز یکی از بهترین تجربههایی بود که توی چند سال اخیر روی موبایل داشتم.\r\nترکیب گرافیک چشمنواز، شخصیتهای فوقالعاده خوشساخت، مبارزات نرم و سریع، و یک دنیای بزرگ و پر از جزئیات باعث شده بازی حس یک عنوان کنسولی رو روی گوشی منتقل کنه.\r\nنقشه بازی پر از راز، مأموریتهای جانبی جذاب، دشمنهای متنوع و محیطهای منحصربهفرده.\r\nموسیقی و صداگذاری هم به شدت حرفهای و باکیفیته و تجربه بازی رو چند برابر بهتر میکنه.\r\n\r\nسیستم مبارزه ودرینگ ویوز واقعاً شاهکاره.\r\nضربات کاملاً روان، جاخالیهای دقیق، کمبوهای جذاب، و مکانیکهای خاص هر کاراکتر باعث میشه هر نبرد فوقالعاده لذتبخش باشه.\r\nهر شخصیت حس و سبک مبارزه متفاوتی داره و همین موضوع باعث میشه گیمرها همیشه تنوع و هیجان داشته باشن.\r\nبازی حتی وقتی چند ساعت پشتسرهم انجام میشه، خستهکننده نمیشه!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Genshin Impact in better, playing this game since the release :)\n\n(Level 80 + Allianz-Ep 1465000/9999999)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best gacha game I’ve ever played just we need more male characters lol and we'll be masterpiece",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game itself nice and quite nice design and gameplay is quite nice and engaging but I quit it due to gacha system hit me hard along with storage, I still advice you to play it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Depois que você joga constantemente o Wuwa, você fica mal acostumado jogando outros gachas pela qualidade de vida que este oferece.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best open-world action-adventure hack and slash gacha game on the market right now. Sadly, the co-op is very much an abandoned feature at this moment, and it features the horrendous 50/50 rates for characters (thanks Hoyoverse for popularizing it...) however it's more generous that one would expect. Overall, a very good game, despite the gacha",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Wuthering Waves is SUCHHHH an amazing game, like genuinely, from stunning graphics to the storyline to general gameplay, such as fast-pace combat mechanics etc. IT'S JUST SOOOO GOOD, I'M PRETTY SURE MY HOURS SAY ENOUGH LMAO IT'S JUST SO ADDICTING, and it's free !! I mean, yeah, sure you could spend on the in-game currency to get a character you really like, but in my opinion it isn't really needed, it's soooo f2p friendly, in ALLL these hours I've only spent about $5 total lolz, AND YEAHH THERE'S JUST SO MUCH TO DO !! IT'S SUCH A SUPER FUN AND AMAZING GAME, I THINK EVERYONNNEEE SHOULD 100000000% AT LEAST JUST ONCE GIVE IT A TRY !!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Chill, full of interesting character stories, main story is amazing, Phrolova arc was my favorite. \n\nWould recomend to many people if they liked games like these, full game's story-line may take ~120hrs+ to complete ( without skipping dialogues )",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really enjoy Wuthering Waves for its story and its BGM.\nIf you like good storytelling and great soundtracks, this game is worth playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is not just default \"gacha\". This game has interesting characters, nice visual and sounf desing and pretty nice combat system. But the most beautiful about WuWa is the main story. As for me this great example of interesting story in f2p game. I'm really offer to play this game as default single player game and don't look at gacha system if you're not fan of it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very good game overall!  very stunning visuals, crazy fun combat, not p2p very f2p friendly. Also always doing quality of life changes basically every update. The game is getting better and better every patch! Definitely recommend trying it.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "It's a gacha game, so you should know what you're getting into with regards to monetization. It is expensive should you wish to grab every character so be wary of its pitfalls. Manage your expectations and plan accordingly. For a free 2 play player though you can still enjoy every piece of content without feeling the need to swipe.\n\nPut that aside, and you have yourself an amazing game with good combat, beautiful soundtrack, and a great narrative (once you're past the rocky intro). Combat has great variety and surprising depth to it should you engage with its technicalities (team combos, animation cancels, animation swaps, etc.) \nEvery aspect of the game is improved with time which can be seen as you progress through the story and visit new zones. Updates are frequent with no shortage of quality of life to boot. Daily loop is short, so once you are caught up on content it's quite low maintenance. Of course, you can always tackle harder content or challenge yourself, such like playing with the UI off or trying solo runs with your favorite character.\n\nA great game overall to sink a few hundred hours into (and your wallet, it sure grabbed mine)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The characters are amazing, and so is the lore. \r\nBreathtaking views \r\n\r\nElyssa approved 10/10 -- Would buy if it was paid XD",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Every patch has a QOL update. Characters(Resonators) that doesn't disappoint. Forgiving gatcha system compared to other games. Not a perfect game but progressively improving towards it. Amazing animations, cut scenes, and story(main quest). I'm a day 3 players and never stopped playing since.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "one of the best gacha combat gameplay I've ever played, if you have ever played games like Honkai Impact 3rd, Punishing Gray Raven you'll definitely love this game first before talking about the pros and cons I wanna talk about how gacha system works as this is technically the only thing matters to most people :\nGacha :\n* there are character banners and weapon banners in the game 1 limited per 20 days and standard banners that will have no deadline and these are the numbers that you need to bear in mind :\n- both 5* characters and weapons will only have 0.8% chance to aqquire and you'll get 4* or 5* per 10 pulls/in the 10th pull and the max count to pull for atleast 1 5* is 80 pulls\n- the character system is similar to Hoyo games the first time you pull on a banner you'll have 50% chance to lose to a character that you don't want but if you try to pull again after you lose a 50/50 you'll get a limited character guaranteed\n- for the weapon however there is no 50/50 you'll definitely get the weapon you want as long as you have the gacha currency ofc\n- also keep in mind that gacha/pity count will carry over to the next banner so don't worry about losing 50/50\n- the standard banners are quite generous BUT PLEASE DONT GET ENTICED ALMOST NONE OF THE STANDARD CHARACTERS ARE WORTH YOUR TIME except Verina (Support healer) if you're new player choose her for the beginner banner\n\nother monetization :\n- there is 5$ monthly pass which gives you extra gems daily \n- there is battle pass from free, 10$, 20$ (not necessary compares to the 10$ version)\n- there are gacha currency top ups and they'll have double bonuses on first top ups\n- there are costumes that will cost around 10-15$\n- there are other unnecessary packs that will give you gacha currencies and gameplay materials (STAY AWAY FROM THEM UNLESS YOU'RE RICH) \n\nPros :\n+ Story slowly keeps getting better despite its bad 1.0 launch\n+ combat is amazing annd even whales could still lose to hard contents like Hologram bosses (hardest content in the game)\n+ LOADS AND LOADS of QOL and they're fast at fixing and/or adding them\n+ new ELMENTS (keep this in mind 'cause old one still needs stamina) gearing system doesnt require stamina\n+ you can Fly from 1.0 - 2.7 maps (we might not able to in new 3.0 region 'cause they're about to give different kind of transportation)\n+ great character designs espically from 2.0 if this isn't a gacha game I'll be playing them all already\n+ great music Kuro and Hoyo have been cooking with their music \n\ncons : \n- the direction of character's kit is getting worse everyone will have crit on their build A.K.A everyone will become dps from minor to major \n- most of daily activity contents are like Hoyo games (Genshin and Star Rail which isn't a good example)\n- the monetizations are similar to Hoyo games\n- like any gacha game most activities are time gated \n- like any gacha game one day you'll run out of contents and resources and have to wait for the next patch or events so touch grass this is the most critical moment where your gambling addiction will be tested because you no longer have anything to play \n\noverall : 9/10 at the end of the day no matter how good it is, this is still a gacha game with its predatory gambling mechanics don't get attatched too much or you'll lose money without you even realized lmao and one more thing STAY AWAY FROM THE COMMUNITY I dont care if you're Hoyoshills or Kurobots y'all just the same",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a Gacha game. But the story is entertaining and the combat/exploration is fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuthering Waves was my first gacha and despite playing probably 10-15 others since, it's the only one I'm still playing. I initially gave it a chance just to see how the combat and customization would be; which didn't disappoint. But it's really taken me by surprise with it's story. I didn't think I'd be convinced to \"gather wives\", but I'll be honest, I may have spent more than I initially thought I would. Worth it for me and I don't mind giving these dev's some money considering the cinema they've given us.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best open world gacha game i've ever personally tried. it has a rough start story wise but if you stick with it, it gets SO much better. \r\n\r\n10/10 waifu collector",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing this game since launch, and it has improved a lot with every patch, especially from version 2.0 \"Rinascita\".\nI really like this open-world action RPG because it has fun gameplay (both exploration and combat), and looks pretty cool.\n\n[b]Gameplay[/b]\n[list]\n    [*]Exploration is fun, because it has \"parkour\" mechanics, and you can even fly after unlocking that feature.\n    [*]Combat is fast-paced with parry/counter mechanics that make them exciting.\n    [*]There are optional special battles with certain mechanics (need to be parried, linked enemies that heal each other, etc.) that should be beaten by learning their pattern and strategy.\n[/list]\n\n[b]Story[/b]\n[list]\n    [*]I find the story entertaining, and cinematics are good looking.\n    [*]If you don't care about story, there's a skip button with a quick summary, so you can go straight into playing.\n[/list]\n\n[b]Extras[/b]\n[list]\n    [*]The game has time-limited events with unique mechanics, including:\n    [list]\n        [*]Combat challenges with buffs/debuffs\n        [*]Roguelike gameplay\n        [*]Co-op combat or competitions (like racing)\n        [*]Completely new mini-games such as TCG, board games, fishing, photography, and even recently there was a \"Vampire Survivors\" game mode.\n    [/list]\n    [*]Some events become permanent in a \"Standard\" section so you can replay them later (with fewer rewards).\n    [*]The game includes references and easter eggs that make it more fun and enjoyable.\n[/list]\n\n[b]Even though it's a gacha game…[/b]\n[list]\n    [*]It has been generous, giving a pair of 5★ characters for free in early versions. They no longer do that, but they provide enough pulls each version to try for new characters.\n    [*]You get two free 5★ weapons: one of your choice at Rank 45, and one sword from Rinascita's story.\n    [*]The Beginner Standard Banner lets you choose which 5★ character will be guaranteed, and the Weapon Banner guarantees the exact 5★ weapon you selected (something many other gacha games do not offer).\n[/list]\n---\nEstá buenardo, juégalo. Tiene buenas waifus.\n\nFIBI CHUPI.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I knew devs will cook with Wuwa since I played Punishing Gray Raven before, all the characters are great, peak visuals, peak combat, good story, lot's os QoL updates. And if you are a Genshin player I can tell you this game treats like as a player and not a livestock made to eat slop",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is just out of this world , please you cant expect nothing more from a free game . I am glad my time with hoyo was cut short cause i got scammed . Now I can truly witness real masterpiece",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun game - 1.0 story isn't anything to write home about but after 2.0 it is good. Map and exploration is great and so are the VAs and the combat. So far i don't feel the need to pull for the latest characters at all, seems like whatever i want to do i can with just characters that seem fun to play to me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "way better than any other gacha game i have played. has the best story, 2.5 and 2.8 main quest are my fav.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game, story-driven and the combat isn't boring. My score is super awesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The GOAT of open world gacha games, amazing gameplay, story etc.\nCharacter design is a bit hit and miss, may be a dealbreaker for some people...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is very fun the intro and outro mechanics has potential, would recommend to my friends but they are mentally stable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game when you have a great character and also bad game when you got verina",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely love this game because of the devs that always listen to their players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game should actually be called gathering wives. After playing it for a bit and getting the characters and seeing the character rotation I have only seen women and maybe a guy, which is cool, BUT I would like to see some better character designs other than gooner slop. The grinding is good in my opinion, but I still hate having to keep getting the same material as a different rarity instead of having to just get it and be done, but I guess you do you. Its good, I like Lupa and no one can change my mind on that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this game on day 1 of release in 2024, I played for a few months and then stopped because initially, the game was incredibly laggy, voice direction wasn't the best, the open world seemed quite lifeless, and the story was a bit confusing. I played for another few weeks when it released on steam, but quit again. After returning to the game properly this week, I can safely say all of the issues I previously stated have been greatly improved upon.\n\nHonestly, the best graphics I've ever seen in any game to date (especially in Septimont). The combat is fun and dynamic, the animations are incredible. The story is much more immersive, understandable, and there are SO many cutscenes. Even general conversation with characters has unique animations, each scene is very well made. The voice direction has also improved from what I've seen in Rinascita so far, especially with characters such as Cartethiya, though some could still use some work (Roccia). \n\nOverall, in comparison to other gachas which I have played, Wuthering Waves is the best at:\n-Exploration\n-Combat and open world combat animations\n-Graphics\n-Gacha system (80 pity instead of 90, no 50/50 on weapon banner) \n-More generous rewards \n-Developer listens to player base more than other gachas",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An extremely good game, well driven story, nice graphics, beautiful designed characters, great optimisation. Honestly for a gacha it's genuinely the best i played so far, the devs listen to their community all the time. Would 100% recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the better genshin impact\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a hardcore genshin player, i really recommend this game. The mechanics are super similar but there is a lot of different (and engaging) content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very generous and has super fun exploration and combat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "extremly high quality character models, animation, voice acting and world design. Have been playing since day 1 of release 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "love this game, great story and graphic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This Game is very good ,The Combat is very rewarding and The story is one of the strongest selling of this game Main character is not stupid and useless ,I love that many time they don't tell you outright of what happening they didn't treat player stupid.\n\nVisuals and landscape in this game is so beautiful \nVoice acting has difference accent(Eng)\nGacha is kinda all right \n\noverall very good game however this is game not perfect",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game have so many good aspects such as storytelling, graphics, music, optimization, etc.\r\n\r\nBut, once you get into co-op mode, you will start uttering the first three letters of the game name. During my co-op playtime my mate (host) and I try to get an achievement done by slaying boss 50 times, his achievement start progressing until 48/50 and didn't even budge after slaying more than 10 times, and mine didn't even increase a single progress. After that we decided to swap host, this time my progress counted meanwhile his is not counted a single progress.\r\n\r\nFor now this game is only good for single player meanwhile co-op is so broken from the first time I play (patch 2.4) until now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best gacha game I've ever played is better than Genshin Impact.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best gacha game ever! (in my opinion)\n\nMajor things that makes the game quite bad is the lack of optimization for low end devices. Kuro games thinks everyone is rocking a 5080 on their pc. The game is good in terms of story, combat but as an f2p, i never struggled in the gacha game. Yes of course everyone has different opinions regarding this game. Game is good but ass optimization...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rich story, likeable character designs and NPC, and dev keep improving the game for each patch although not so big improvement",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its like genshin but it has jennifer english so its ultimately 10000x times better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably one of the best free to play games I’ve played alongside with warframe, you can see the compassion they put into the story\nThe gameplay is extremely fast compared to other games similar to this like genshin impact, haven’t played a whole lot other stuff in this game mainly story and side stuff, but so far I’m enjoying it a lot.\n\nAlso the aesthetics of the game are real nice\nIf you have a oled hdr panel it will look amazing fr.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has Manhua codded Aura farmer character called Qiuyuan and i love whatever is wrong with him",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don’t usually leave reviews, but this game is genuinely enjoyable. My only frustrations are the daily reset system, the limited options for leveling and farming, and the restriction on flying everywhere, which makes the world feel less free.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, great and addictive plot, so I recommend it to everyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tops Genshin Imapct in so many ways and I hope it doesn’t go down the same path as Genshin did, by forcing you to get a specific character to clear anything in this Game.  \n\nThe Cutscenes and the Music it just tops whatever Flopshit did.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A Masterpiece in Every Sense: Wuthering Waves Reaches New Heights in Gaming\r\n\r\nWuthering Waves is nothing short of a revelation. From the first moment you step into its atmospheric world, you're swept away by the raw beauty and haunting charm of the landscapes and characters. This game doesn't just offer an adventure—it presents a vivid, living experience where every corner you explore, every battle you engage in, and every story you uncover feels like it’s part of something much grander.\r\n\r\nThe world-building in Wuthering Waves is unparalleled. The setting—a mix of stormy skies, dramatic cliff faces, and lush valleys—feels deeply immersive and unique. It's a world that breathes, where the environment reflects the emotional tides of the story. Every location feels meticulously designed, from the smallest cottage to the vast, open fields, creating a perfect backdrop for the intense drama that unfolds.\r\n\r\nBut it’s not just the setting that impresses—it’s the characters and their emotional depth. Each character, from the enigmatic protagonists to the complex side figures, is beautifully written and developed. Their journeys are unpredictable, layered with both personal growth and the weight of past traumas, making them feel incredibly real. The dialogue is sharp, thoughtful, and often laced with moments of genuine emotional resonance.\r\n\r\nThe gameplay itself is thrilling and satisfying. Whether you're in the midst of intense combat or solving intricate environmental puzzles, the mechanics flow seamlessly, making every interaction feel natural and rewarding. Combat sequences are both strategic and action-packed, offering just the right balance of challenge and fun. The progression system is intuitive, with the right amount of complexity to keep you hooked without overwhelming you. It's the kind of game where you can't help but get lost in the mechanics, coming back time and time again to discover new ways to approach the game world.\r\n\r\nWhat truly elevates Wuthering Waves is its underlying themes. The game isn’t just about surviving a tumultuous world—it explores the depths of human emotions, relationships, and the choices we make in the face of adversity. The story is as much about personal redemption as it is about the epic struggles that define its universe, and it’s this emotional core that will keep you thinking long after you’ve finished playing.\r\n\r\nThe sound design and music deserve a special mention. The haunting score perfectly complements the tone of the game, shifting seamlessly from moments of serene beauty to intense, pulse-pounding sequences. The ambient sounds of the world—whistling winds, distant thunder, the rustling of leaves—immerse you completely in the game’s world, creating an atmosphere that’s impossible to escape.\r\n\r\nIn short, Wuthering Waves is a triumph in every sense. It combines stunning visuals, deep narrative, and polished gameplay into a cohesive experience that sets a new standard for storytelling in video games. Whether you’re a fan of action, narrative-driven adventures, or simply appreciate the artistry of game design, Wuthering Waves is an experience you cannot miss.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice art style, but lacks on the UI.\nFun free 2 play experience, but it gets better if you spend money (like any other gacha).\nThis game has a great exploration and questing gameplay, and a great combat system.\nI do recomend this game, if you don't mind the gacha system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "truly one of hte best gacha games. incredible work of art and you can tell that the dev team actually pours their passion into improving the game patch by patch. even non gacha gamers should give this a try",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuthering Waves is an impressive action RPG with an open world that pleasantly surprises with its atmosphere, dynamic gameplay, and attention to detail. The game immediately immerses you in a dark yet captivating post-apocalyptic world filled with mysterious creatures and hidden stories.\n\nThe combat system is one of the strongest aspects: fast combos, perfectly timed dodges, and parries all feel smooth and genuinely engaging. Each character has a unique fighting style, making team-building fun and varied.\n\nThe graphics and music create a strong emotional impact. The soundtrack stands out especially - it enhances the scale and atmosphere of every region.\n\nYes, the game still needs some polishing in terms of optimization and certain mechanics, but it’s clear that the developers are actively improving the project.\n\nOverall, Wuthering Waves is a great game for fans of open worlds and fast-paced combat. It delivers new emotions and a strong sense of adventure - especially for Genshin Impact fans who are looking for more dynamic gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "beautiful art design and graphics, amazing soundtrack, good QOL, generous, always improving, actual good story, all characters are good and useful, best main character of all gacha games, fun dodge/counter mechanics, honestly feels like a steal that this is free, if u are whining about the gacha system you should've known what you are playing in the first place, you are not supposed to get every character and max them out, if u want to then pay up, f2p is already strong enough, if you are still struggling that's a skill issue",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "why this? explanation: \n\n0. there is a fckin \"SKIP BUTTON\";\n1. wall sprint & flight (everywhere on anyone, damn);\n2. way nicer odds of gettin someth other then in gensh;\n3. no need to spend over 1000+ hours farmin shit cuz there u got it in crates supplys (or whatever).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the story, F2P Friendly, Love the combat, Love the Waifus, Love the exploration, the game just keeps getting better and better! <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive had a long history with Genshin Impact and later Honkai Star Rail. Both games thousands of hours invested in aswell as a shit ton of money put into both. After some time, I got severely burned out especially from Genshin but later also Honkai. Last time I played Genshin was when they released Fontaine and I never touched it since then. The slow pace of the game and hollow world just made the game boring for me, hoyoverse always disappointed when it came to primogems. The story also got very niche in Fontaine. The Desert map was probably the main reason I got the genshin burnout. That part was just soulless and a pain to explore. Also worth to mention how older units in Genshin a lot of people put money into are now just useless and cant compete anymore. I tried out Wuthering Waves on release day, got Verina and Jiyan and then played till Yinlin came out (got her in a 10pull 50/50 very early). After that I took a break from gacha games due to irl problems and mental health. I never managed to come back. I did follow posts about Genshin, Honkai and Wuwa over time.\n\nI've started spending my time on Wuwa again a few days ago. Mainly because I needed some games to play again and because I heard a lot of good stuff on it and the overall generosity of Kuro and because I couldnt stand to go back to Genshin.\n\nExploration and movement is one thing Wuwa does sooo much better than Genshin. No Stamina Consumption when not in combat, Wall Running, the new gliding mechanic they added later on. All of this just makes world exploration so much more enjoyable and prevents burnout more efficiently.\nOverall graphics are top and really outshine the comic art style from Genshin.\nCombat on the other hand is a matter of taste. I like it, its more fast paced.\nThe Gacha System is just way better executed here. No 50/50s on the Weapon banners, a currency for the weapon banner itself. Not that many 4* chars and way quicker reruns of limited 5* characters.\nI cant say anything about endgame content yet, because i'm just union rank 30 right now but I might update this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game since release. Have been popping in and out between patches and enjoying the storyline throughout the game's life.\r\nWriters really are cooking something up with all these patches and callbacks to each chapter.\r\nGameplay? Constantly becoming better and better. \r\nAnimations? From slightly boring animations to over the top animations that feel like a FATE movie.\r\nI will say this game has got me hooked for the foreseeable future",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is pretty good,\nIts a solid 8/10, better then most Gacha game's i've played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Day 1 player from before this was on Steam.\r\nThis is a gacha game. If that automatically turns you off, fair enough, just go play something else.\r\n\r\nI have been putting off writing a review because I wanted to see how this major story arc finishes before passing judgement. And now that Rinascita (the current region as of this review) has been completed, I can confidently say that this game has surpassed my expectations and is comfortably in like, my top 5 favourite games (on which it would be the only gacha game). It has done nothing but improve from it's infamously rocky launch a year and a half ago till now, and to me that improvement is more than sufficient to keep supporting it.\r\n\r\nCombat, story, music, voice acting etc are all things that I find amazing especially since Rinascita began, but I don't think I can adequately review these things so I won't. But for me, I love all of it. If I HAD to complain I'd say the story is a little too shonen-y, and complex factions and relationships are insufficiently expanded on in my opinion (so far at least), but that never detracts from the sheer fun of watching these stories play out.\r\n\r\nHonestly there's not much else I can say. Even this lacking review is this long now. But I truly recommend you try it, even if you don't want to engage in the gacha shit. You don't have to log in daily and spend stamina (and if you do it's very quick like 5 minutes including load times), just play when you like and experience the game. You control your gaming experience. Don't just fold under FOMO and you'll enjoy this (and other gachas too) a lot more.\r\n\r\nIt's quite a sizeable download, but it's free. Give it a shot, and hopefully you'll enjoy it. And if you do, then I'll happily welcome you to Solaris-3, Rover.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good, story picks up after 1.0 patch. Game runs better for me on Steam so I switched over, if you want to top up use VPN strat on their official website.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuthering Waves continues to prove itself as one of the most ambitious action RPGs on the market, and the 2.8 update is a shining example of how well the game is evolving. The newly introduced Chronorift Metropolis is both atmospheric and visually striking, offering a fresh sense of scale and mystery. New Resonators like Chisa and the upcoming Buling add real flair to team-building, with unique kits that make combat feel more dynamic than ever.\n\nQuality-of-life improvements — such as one-click Echo absorption and streamlined upgrading — make day-to-day gameplay noticeably smoother, while performance enhancements help the world feel even more immersive. The new story chapters also deepen the lore in meaningful ways, giving players plenty to sink their teeth into.\n\nOverall, Version 2.8 is a thoughtfully crafted, content-rich update that shows just how committed the developers are to refining and expanding the Wuthering Waves experience. It’s a brilliant step forward and a joy for both new and returning players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 game. All story after version 1 are really damn good, especially Rinascita finale. Can't wait for Lahai-Roi",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its your typical gacha action-adventure game with run-of-the-mill exploration, unlocking new areas etc. As usual, too many currencies, items and unnecessary tech terms. Story is a bit too slow with boring dialogue. Upside: combat is more engaging than genshin.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I came here after playing genshin for years, and honestely in this short of a time they manage to improve on a lot of things genshin hasnt.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For all its problems and shortcomings, this is still the best gacha on the market. (Generally) superb story telling, character designs, combat, music, and world exploration.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful game, wonderful atmosphere, very unique in many ways. Feels like an old Final Fantasy game (without the turn-based gameplay). I truly enjoy this game and there are few good games released in this modern age of gaming. I DO NOT like anything anime-related but I can't deny how good the story and cutscenes are in this game. I love this game so much, which really caught me by surprise.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Look at the end of the day it's a gacha but compared to its competitors it's aaaalot better like the movement is so much better and faster the world is filled with tiny contents alot of side quests the free characters are really strong some of them are better than paid characters the graphics are eye candy and the parry / dodge mechanic feels pretty good all in all it's a free to play game but a free to pay game aswell so take it as you will",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuthering Waves stories with their cinematic storytelling, offering the ease of an open world,\nfun combat, beautiful landscapes, cute girls.I'm eagerly awaiting v3.0.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Wuthering Waves was the second gatcha game I played and is extremely good and definitely the best gatcha game I have played.  \r\n\r\nStory:\r\nI will admit the story in this game, same with most gatcha games in the sense that it starts off pretty bad and boring but trust me later on it gets extremely good. The Shorekeeper part is an absolute masterpiece and is when the game starts to really get going with the story. It's definitely my favourite part. Then the part with Cartethyia is also very good and debatably better. So to summarize the story starts off really slow and boring but the wait is worth it as later on it gets very good and keeps getting better with every update.\r\n\r\nGameplay/Combat:\r\nThe gameplay/combat in this game is very enjoyable and very fun. Obviously the 5 star characters are the most fun and the coolest to play. Even the older 5 stars are still not only really fun to play but most are viable as well. A lot of gatcha games struggle with power creep but thankfully this game doesn’t really have it or at least not badly. Obviously the newer characters are a lot more flashy with their attacks and are sometimes a lot cooler but the older ones still hold up very well and are not only viable but also really fun. Like personally Carlotta is my favourite character and she was added almost a year ago and is still very viable and very powerful. Another character who I use and has been in the game for more than a year is Shorekeeper who's still the best support in the game and a very cool character. Now back to the actual combat, it's very fun and satisfying and every character feels unique from each other especially the newer characters who have very crazy flashy attacks which makes them feel even more unique from one another. \r\n\r\nAnother very great thing about this game is the people who make it, they actually listen (for the most part) and have actually made a gatcha game that feels fair and fun. This is 100% the best gatcha game I’ve played and I really don't think anything can compete. I would definitely recommend this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "From the positive sides:\r\n\r\n- Probably one of the best gacha game visually as of now\r\n\r\n- Really good character animations and details\r\n\r\n- Music that you can vibe to \r\n\r\n- A story that has mostly ups and some small downs, just like any gacha game, tbh (Shorekeeper and Chisa's story was cinema)\r\n\r\nFrom negative sides:\r\n\r\n- This game really needs more QoL implementations it feels a little bit worse compared to games like Genshin. Like, you can't syntonize multiple objects at once, instead you have to do it one by one\r\n\r\n- The world is locked behind quests, which feels bad. Every new character you get, you have to progress through 4-10 hours of story just to unlock material needed for them, like flowers, so for that reason, you have this big, beautiful open world, yet it feels like you're in a cage trapped by quests, which makes the open world feel rather linear\r\n\r\n- Events that are locked behind areas that are not yet unlocked.\r\n\r\nOverall it's a great game for a free game that you can experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just play it, and you know how good the game is, beside gacha, story and BGM is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 – I Don’t Even Know Why I’m This Hooked\n\nI’ve got over 67 hours in Wuthering Waves so far, and I still don’t really understand what kind of magic this game has on me. All I want to do is log in, grind, explore, and fight more bosses.\n\nThe world is massive and surprisingly alive — the music, the combat flow, the character animations — everything just clicks. The combat feels insanely good once you start chaining dodges, parries, and echoes together. It’s like every fight has its own rhythm.\n\nI told myself I’d just do a few daily quests... next thing I know, it’s 3AM and I’m farming echoes or trying out new team comps for the tenth time.\n\nIt’s not perfect — the early game pacing and some voice lines can be a bit rough — but it’s improving fast, and honestly, I don’t even care. The game just feels good to play.\n\nIf you love open worlds, stylish combat, and games that pull you in without you realizing how much time has passed — Wuthering Waves will eat your free time and make you thank it for doing so.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game because:\nGameplay. It's an action RPG with gacha, but the battles are exciting. Each character has their own animations and rotations.\nThe story, I'll be honest, wasn't very interesting to me at first, but with each update they've improved it, learning from their mistakes. Now I'm captivated by the plot, and I'll say it's a beautiful story, like a wonderful fairy tale.\nThe boss battles (holograms) are engaging. They have several mechanics and they're never the same. With each attempt to kill a boss, I learn their moves and only then defeat them.\nThe visuals are simply stunning! It's a shame the developers didn't improve the visuals of the old locations, but the new ones are very beautiful and create an atmosphere. Interacting with the environment really immerses you in the world.\nThe character designs are varied and unique. They have their own body proportions and recognizable clothing designs that define them.\n\nWith each update, in addition to new characters and story additions, the developers also improve the graphics and add more interactions with the environment.\nIt's clear the developers love their creation, and I love this game and the developers for their efforts. They managed to create a gacha in which I spend time with pleasure, and don’t launch it just to complete dailies and pull a character from banner.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game has the best real-time cinematic sequences and is one of the best open-world action games within the anime-themed genre (gacha & non-gacha) despite all debates and criticisms about its monetization system. The dev has been pouring their hearts in the game, consistently listening to community feedbacks and improving the game after its initial rough launch. The game now looks and plays completely different after the 1.5Y of content updates, and its music is also very enjoyable. \n\nThe only small problems I have with the game: 1) the difficulty curve is not well balanced -- most of the main story quests and game modes are way too easy for average players, but Hologram could be challenging for them; 2) it lacks a compelling end-game mode that people can use their newly pulled characters during content-drought periods; 3) the game is currently not very well optimized, as the dev keeps lifting up the quality of in-game assets / weather system / interactive objects. \n\nI would recommend Wuthering Waves to people who have self-control in gacha mechanics and enjoy anime stories + single-player open-world action games. The game values your precious time and gives enough resources for F2P players to enjoy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this game for several reasons. It is fun to play even tho sometimes the characters talk too much. It is easy to learn, the graphics are good and the world is quite big. So as long as you can avoid buying things, for a captcha game this one stands out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "don't be fooled by my time played. i've put a few hundred hours into WuWa on PS5 and that time will only continue to grow as i don't see myself ever stopping as long as they will support the game\n\nthe open world is massive and only continues to expand with almost every update. it's not just an empty world either, there are a ton of different things to find and little minigames to play. the story started off kind of rough, but the quality absolutely skyrocketed as they actually took player feedback seriously. you can tell they want to make a genuinely good game\n\nas for the gacha elements, this is easily one of the most f2p friendly gacha games there is. you will get a ton of the pull currency just by playing and exploring. and even if you're the type of person to be choosy with who you pull, all the f2p characters are absolutely viable to use even up to the current patch (2.8 at time of writing)\n\nthere's also some really great QoL features, especially when it comes to upgrading your characters. if you're like me and aren't great at character building, you can auto equip most things which is all based on recent data from players so it doesn't just throw random items at you. they really allowed for all styles of play\n\ni know a lot of people will just write off gacha's as cash grabs, and honestly a significant chunk of them are sadly, but this isn't one of them. you can get hundreds of hours of fun out of this game without spending a single cent",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuthering Waves is one of the most impressive action RPGs of recent years. From first minutes, it impresses with the scale and attention to detail: from the incredible graphics and detailed locations to the emotional plot, which really makes you worry about the characters. Atmosphere of the post apocalypse is perfectly conveyed - world seems alive and filled with mysteries.\r\n\r\nCombat system deserves special admiration. Each fight feels epic: smooth combos, gorgeous animations and powerful ultimate abilities create a sense of real drive. Switching between characters in real time adds dynamism and depth, and customization of builds allows u to play the way you want.\r\n\r\nAttitude towards F2P players is especially encouraging. Almost everything can be safely farmed out here without investing money, and astrite is much easier to mine than in many other gacha projects. This makes the progression honest and enjoyable, and development team really deserves respect for such generosity.\r\n\r\nCharacters are a separate art. Their design, animations, and voice acting create the feeling that each character is unique and lives their own story. Coupled with amazing ults and music, fights look not just spectacular, but almost cinematic.\r\n\r\nWuthering Waves is a game that knows how to surprise, inspire and capture. It's rare to find a project where everything from visual to gameplay works in perfect harmony. >w<\r\n\r\nOf the disadvantages, I can only mention the instability when RTX is enabled. 50/50 scheme in convene is annoying, fortunately it is not on weapons... and multiplayer suffers too much, it needs global remake.\r\n\r\n11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Need more male characters and co op content, other than these really good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best gacha tbh, more mature than Disney Channel Gaeshet Simpact! \n\nTake it with salt, I still like that game too, but recent updates made me take a break of it, this one on the other hand, is more mature.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not the biggest fan of gacha games but this game has me on a hold ever since I started it! much recommended! Smooth gameplay, amazing combat, Unique character design and an immersive open world to explore",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the visuals of the game and gameplay so much. I would get every character if I could but my luck has never been a good friend for me. The moment I realised I loved the game was when I suddenly stopped exploring and watch the scenery.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TL:DR - Amazing and highly praised story elements that deeply impact its players. Outstanding and unbelievable gacha win rates (alleged 65/35 rather than 50/50, and weapon banner is guaranteed, no 50/50 luck). Polished and wonderful combat mechanics, with fresh and interesting gameplay changes. Parrying and counter attacks feel satisfying. Graphics are astonishing, Realism and interactability is highly focused and perfectly executed. Graphic-Framerate issues due to intense graphics and lighting effects (UE game, doing UE things). \r\n\r\nFinal Verdict: Highly recommended game, for the story and graphics alone, without even going into the f2p-friendly gacha system.\r\n\r\n\r\n**FULL REVIEW** \r\n\r\nAs a lore-dedicated and immersed player, Wuthering Waves has one of the best, if not the best stories I have ever experienced in a gacha game. Each story feels more exciting and more improved than the last. Most of the stories, especially the recent ones are so well animated, you may even consider them as anime episodes. Though be prepared to given an increasing dose of depression as you progress through the main story.\r\n\r\nFor you gamblers and gacha enjoyers, it has been mathematically proven that your account's first 50/50 has a higher winning chance than any other game, and winning the 50/50 gamble it self is much easier than it actually seems, with an average (at least according to my experience, observations, and calculations) of 65/35 gamble rather than the supposed 50/50. Additionally to this, the weapon banner has no 50% of winning once you obtain a 5* star. You are guaranteed a win no matter what.\r\n\r\nAs someone who has played since WuWa came out (beginning on the official launcher and only porting over to Steam recently) I have won 7 out of the 9 featured banner 5* star characters, that is about ~77% winning chance on a 50/50 roll in a gacha, which is crazy good, especially for someone who grew up playing FGO, and played every MiHoYo game since their launch (except HI3).  \r\n\r\nThe combat mechanics are excellent. As someone who deeply praised souls-like games, PGR, Ghost of Tsushima and Yotei, as well as realism in games, I am in love with the way Kuro Games has dealt and polished the combat in this game. Perfectly timed and wonderfully polished counters, timed attacks, QTEs, parries, and much more. Weapons and attacks have near perfect hitboxes and actually seem realistic and makes sense, no glitches, asset teleportation, hitbox errors, and such. Combat mechanics feel fresh and rewarding. For average gamers, you would think of constant attacks towards your enemy, but no, here you actually have to learn parrying, counterattacking, QTEs, proper team setups and rotations, the likes. \r\n\r\nLastly, for those seeking graphic feedback. The graphics are outstanding and highly polished. Most of the environments and objects are perfected and beautified just the right amount. Interactable environments, like breakable objects (boxes, crates, vases, stones, etc.), moving foliage (i.e. grass/flowers move as you go through them), attacks, especially those that include or control wind/air move light objects like leaves around or makes them go up in the air. Furthermore, the lighting is magnificent. Shadows are highly effective and accurate, even on the lowest graphic settings. Subsurface scattering (basically, imagine how light passes through your fingers) looks quite realistic. Ambient lighting works so well with the environment it is placed in. \r\nNow, I am aware that the game does run poorly on a lot of devices, especially on mobile devices. Yes this is a major issue, as the game would be better if it was more accessible to way more players (I play on a decent gaming laptop which runs the game on moderate graphics pretty well, but I am aware of how badly it runs on worse devices as I also play it on my *potato* off a phone, barely getting 20 frames on the lowest graphic settings). Unfortunately, I do not have the power to fix these issues, and I can't really recommend any other tip or advice to players experiencing such but:\r\n\r\n*For PC players: (not in any order)\r\n1.) Make sure you run the game on DirectX11 (this setting is found on the official launcher under the 'launch game' button, and on steam during first launch)\r\n2.) Just lower your graphic settings, don't burden your pc/laptop too much, its better to play on worse graphics with more frames than realistic graphics on a slideshow.\r\n3.) Try to ensure that you do not have too many background applications or programs, especially those that are gpu heavy (editing software, model generators, etc.)\r\n4.) Ensure that Wuthering Waves is set to use your dedicated (or best gpu) in your pc's gaming setting (just look up how to do this, its quite simple)\r\n5.) Double check that you are on your best performance setting on your pc/laptop, and if you are using a pc, please ensure that your monitor is connected to your dedicated gpu (if available) and not the cpu's gpu (igpu).\r\n\r\n*For Mobile players: (not in any order)\r\n1.) Lower your graphic settings, especially for phones that aren't built for graphic-intense games. Remember this is a UE game, it is known to be unstable and resource inefficient. \r\n2.) Double check if you have a setting/setup on your phone that enables *Game Mode* or *Ultra Game Mode* or maybe even *Esports Mode*. If it does, ensure that Wuthering Waves is tagged as a game under this list. These setups allow you to dedicate your phone's resources to the game so that it *hopefully* runs smoother.\r\n\r\n*For Console players:\r\n1.) Not really sure what I can give to help you, as consoles don't really allow for a lot of graphic setting changes, as consoles basically all have the same specs..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sadly my PC can't handle wuwa so I don't play it as often as I want, tho whenever I played was good.\nStory is fine but if you dislike it you can just skip it which is big plus. Events can be played later (not all tho) so you aren't forced to grind 24/7 :D",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The combat is too good, it makes it difficult to goon at the same time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not for me, but if you like Elden Ring and want plenty of gacha rewards like in Zenless Zone Zero, it is quite good and fun!\r\n\r\nThere are a few visual glitches and bugs, but they're funny.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Hi.\nI'm just a 30 year old normie, I do not follow social media actively, I do not watch influencers either, I came across this game when I had lot's of free time and quit my previous gatcha game because they devs made bad decisions.\nI dropped about 220 hours on thisgame in about 3 weeks. I login sometimes but I went from playing the game all day and night to pretty much not playing at all.\n\nI would also like to mention I tried to play genshin 3 times in my life, not once I made it past the tutorial, that thing is way too boring so no I'm not a genshin fanboy hating on wuwa.\n\nI like the game but most people on youtube are beta males and can only review the game on a surface level because if you don't focus on the flashy issues you can't get views, so I'll focus on those in my review.\n\nNegatives:\n- Three times the charm?: The devs are obssed with forcing you to do everything 3 times. At first this was allright, but forcing me to do every annoying thing/chores 3 times too is just too much, it gets bothersome quickly.\n- Waveplates: Altho due to having solvants I never really ran out (I often opted for not playing insted of using them tbh because people suggested to me to save them), I would still mention this as annoyance, having to manage a resource just because the developers wanted to make sure to timeg gate me is really annoying, farming in itself already takes time I do not understand why you have to stick to this so much, an unnecessary limit from an inferior game (Genshin), most people agree with me at least on the fact that this is an outdated and bad system\n- No quests so what?: When I cought up with the story and did all quests, I found myself not having anything to do. Lack of content may sound funny to you, but when all events and quests are done there really isn't a reason to be online. I do not find this game that crazy good where I would login just to do a boss battle for fun. They need something that doesn't include a short time frame limit or a lot of rewards, and can be played anytime so when you don't know what to do when you have free time you will be like \"Hm ig ill login wuwa and playe some X\"\n- Game startup: I would go as far and say that 15-20 seconds is too much (SSD) but it's acceptable, more importantly the game can't autologin for me, mising QoL.\n- Patching: Not only is hilarious they make you redownload so much (20-40GB patches every month) they also can't restart the game on PC. It just says \"restart needed\" and you have to Manually restart it, bro just send a request to windows to start the app again, is it really that impossible?\n- Mouse repositioning: They have an obsession with it, when I start the game it randomly takes my mouse away then positions it in the middle of the screen, like I'm alt tabbed, don't touch my mouse when I'm browsing the internet. Then they do this in every cutscene ever, I saw people complain about this on reddit too, they never fixed this, has to be on purpose. Very bad deicision imho, extremly frustrating that you always reposition it, just leave it alone don't take control of my mouse for no reason just because I gave admin perms to your game on startup.\n-Character CDs are often not reset when reentering instances like Sonoro Sphears or challanges, such as skill CDs or echo skills.\n- Obsession with slow walk session in story: Really bad. During Lupa i was keeping a finger on W and I was literally closing my eyes I was so bored, so uninteractive all the while they were playing the actually good story (Flashback cartwheel) in the BG. Don' make me hold a button for 2 minutes.\n- Can't use your characters in story: This really should be an option. I spend 200 hours making my characters playable, grinding out the mats for them and you tell me I can't even play them in the story mode.\n- Quest dialog cutscenes always switch to player character, my issue is I want to see my other characters in the dialoge cutscene, is it really that hard? There are occasions when they are not replaced by the palyer char so it is possible and man it feels so much better seeing shorekeeper in a sidequest than the ultrageneric looking mc girl\n- This is just personal opition but: Story gets flashier (Lupa, Aug, Iuno) but not better, ever since cartwheel it has been a downhill for me, they made all the septimont girls hotheaded/dumb but people eat it up because they slap 2 big melons on them and make them bend 135 degrees backwards. Lupa was allright in retrospective but it was a 6/10 for me still, a far cry from 9/10 cartwheel and 10/10 shorekeeper. Not sure about the rest, i skipped Iuno all together, I muted the game and watched youtube on the unskippble cutscenes.\n-Make cutscenes skippable. If I don't care I won't care even if you force me to, you can't fix that by making it unskippable you just make me mad.\n- Would be nice if clicking skip had an option \"Do not ask me again today\" so I don't have to confirm it all the time\n-Scripting: They devs said in Q&A they love scripting they want to use it to enchance player experience. Well they fell over the other side of the horse. In story it is often more annoying than fun at this point. Quicktime events are sleepovers, where you can literally close your eyes go to sleep press a button once every 30 seconds. Boring, uninteractive, made it for the sake of having a scripted event but overall desined poorly.\n-Slow character acquisition: Just like any gatcha you'll spend several weeks before you can get a new character. I played CatFantasy gatcha, they release a lot more chars but they also give you about new chars for free every month. These popular gatchas really excpet you to play the game with the exact same characters for 2-4-6-10 month before finally getting a new one you like, this game is not that versatile/replayable.\n- Bad coop: Your coop partner loses 1 character, you loses 2. What? I think they made it so the lvl120 bosses don't feel easy? But you do get 2 characters out at the same time so it is easier. Anyhow it feel terrible I can't use a proper combo because I do not have the characters I need for it. Coop could be such a driver for this game, player interactions is really nice but not only I have no reason to play coop even If I do there isn't much to do, there also a lot of restrictions on it, mainly to prevent botted farms I think? Another gut punch to the player just to fight bots, altho it's funny because they have kernel anti cheat no? Why bother keeping it if you can't even stop botting with it. Get something else.\n\nNegatives that are more than likely won't change because they would need to admit Ls on corpo level:\n- Skin costs: Japanese viewed 30 dollars as cheap, well Just because your parents always beat you up as a kid and that's the only thing you know doesn't make it good. For 30 dollars I can buy satisfactory or a figure of the character, I see it as a scam and no point in buying any. Most of them are also pretty mid imho, some are allright like Carlotta and Jinshi is okey I guess, but they lack the balls to make actually good skins and are definetly not making enough, like 4 skins a year is not good, maybe that's why the price is so hight to create artifical scarecity? Or at least the feeling of it. They have a lot of players, they could make them cheaper and release more but they only make a few politcially correct skins.\n- Star up costs: I mean, what is it to max a character, 5000$? I could buy a good used car for that money, or a full gaming PC. Sure you need sinks so whales can piss in it, but I find it funny you lock most of a character's \"meant to be played state\" behind star ups that costs that much. Old gatchas like azur lane just wants you to get one copy and then you can use the free star up material\n-50/50: Frustrating.\n-Lootmapper:Just make it cover the map or increase limit, why do I need a 3rd party website to properly track chests?\n\n\nGood game but a lot of small issues add up + avoid gatcha in general.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After Genshin we get another game that doesn't have the common decency to let us skip any cutscene. Maybe if it was an interesting fight that we had to watch, but no, it's just characters walking and talking. Have some self respect next time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decided to try this on because I never really played a gacha game and everyone was hyping it up.\nI had some fun until I realized what was awaiting me if I continued to play this game. \n\nSo first of all, the gameplay is fun, but I can see it becoming stale over time. The story was mostly ok. I quite enjoyed exploring the word and doing these minigames/challenges.\n\nHowever, the thing that pushed me away from this game was realization how ungodly amount of time or money(or both if you are unlucky) would it take to get minimum 2 good characters and that's assuming you would include MC in your team as well.\n\nSo, you watched a YT video or read a guide on which character is good/meta/whatever or you simply liked the gamplay? Well, that's unfortunate, because the \"banner\" for that character isn't up, so you have to wait god knows how long until it's back up again.\nYou managed to pull a character you like? Great, now pay additional money so you have a chance of getting a weapon for said character or she(not many \"husbandos\" in here anyway) will underperform without it. Not to mention that according to the guides there are characters that \"pair up\" with another characters so don't forget to spend time/money on them as well. When I realized that this game is designed to just suck money out of me I immediately uninstalled it.\n\nNow some people on the internet will say that you can still complete some endgame content without these characters or carefully crafted teams, but then again, what's the point of playing this game if I can't play with the character I want? So either I spend money and hope the banner is up or play f2p with characters I don't fully enjoy or login every day and for every little event so I can get some scraps of a currency so I can have some hope to pull the character WITHOUT the weapon. \n\nPerhaps it is different if you played the game from the start but as a new player there really isn't anything in here that could keep me playing it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didnt get the character. all i want is just the character to play. i dont care much about limit breaking the character. just want to play the new charge blade girl and the game didnt give to me. t-rash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game just fucking sucks ass now. And everything is breaking. I can't even fill out surveys or see my previous summons anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Flashy yet fundamentally uninteresting. Tries to mix the daily brain-off busy work of the gacha model with a character action game, and ultimately fails at delivering either with much success.\n\nEnjoyable if you're a Genshin Impact refugee (an even worse game) but if you've actually played good character action games then this game's pale veneer of it will often feel very surface-level and even annoying at times.\n\nThe gacha side of things does not fare much better, the daily busy-work it has you do takes considerably longer than the better gacha games out there, and its pull rates are abysmal. \n\nFree pulls are given out sparingly like the last rations on a stranded ship, with the standard hoyo slop pull system of not only pulling for characters but dozens of meaningless scrimblo  'weapons' which are guaranteed to prevent you from getting a character you like properly levelled up. Paying doesn't even help, the shop bundles are insanely expensive and a lot of the time 20$ will not even score you a 10 pull. In other gacha games those same 20$ will get you 40 pulls with better rates than this game would ever dream of.\n\nThere are better character action games, and there are better gacha games, there is no need to play this title and slog through the dreadful opening story chapters. At least there is a cutscene skip I guess.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "do take alot of time to FARM, really good graphic (laggy), good theme. I quit because of the gacha its really hard to get alot of asterite for guarantee round",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is literal slop bro why would u subject urself to play this??? storyline is dookie, credit given when due some character designs r cool and they do put work in their fighting animations but still, that can't save a game from pure dookiness",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Я еще играл при выходе, при первом эвентовом баннере закрыл всю сюжетку.\r\nКароч. Типа геншина, с приколом тем что ты можешь собирать покемонов в виде всех боссов, от рядового противника до серьезного босса, и юзать их посреди файта, перевоплощаясь в них или призывая их. Мир выглядит уныло, ток местами постарались. Боевка немного топорная, бывает эффекты заслоняют весь экран, и ты тупо не понимаешь что происходит, из-за чего сражаться становиться не возможно, и ты начинаешь ловить урон. \r\nВнешка на вкус и цвет, но как по мне, тут одни из самых уродливых лиц среди всех гач. Не у всех, но всеж. \r\nКароч, проходняк как по мне, быстро наскучивает...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It breaks my heart! Tears it in to pieces!\n\nI have been playing since year one, and it is sad to see where this game is going. Like your best friend who has turned to crack cocaine.\n\n\n\nEver since the release of Employee of the Month Zani, they have been making characters hyper-specific too each other. Compare this to year one where there was a lot of free flow because characters can be joined based on the buff type (Element/Attack type). It meant that cool players like me can mix and match to whatever I felt like and the optimal team was not based on numbers, but on the actual gameplay of the characters. For extra understanding for the boys in the back (I know you like to watch me but you don't listen!), Year 1 subdps = Buffs Havoc damage, Year 2 Subdps = buffs half havoc damage and half attack damage and gives characters with a specific dodge more damage... 3 months later, release the only character who does havoc and heavy damage and the ONLY character in game with that specific dodge? Year three will be like this = buff character that starts with the letter O and ends with the letter y and speaks in a southern Drawl.\n\nThis makes me feel incomplete when playing! Now my heart feels incomplete when I use the not best compatibility match ups! This is a negative feeling and I do not like negative feelings!\n\nAnother thing I do not like is that every character is a groupie! They throw themselves at Rover and are discarded and forgotten once the Rover bus leaves town! Where is my sweet heart water nymph Shorekeeper? Where is my flower with her thorns pricking my belly Camy? I want to see these two girls fight over me! Not the 5th Bend-over-4Rover groupie I will soon forget!\n\nOne last thing, the costumes are so fucking expensive! Holy cow! Maybe I am just a poor girl (oh yes, I am.) But please have mercy on me! Oh well, no good costumes (only carlotta  ) for characters I have anyway. I was a little annoyed that they stopped making coop content, but maybe that is for the best because it means that I should just use mods instead since I will  be the only one looking at the Changli and Zani from very specific camera angles.\n\nOnto the good! Because I like to be fair.\n\nEverything looks beautiful! The areas are really nice and I like taking pictures! The characters all look amazing. I have several poses of of the Employee of the Month  on my wallpaper! I want her to come and do my homework while I serve her hot coffe, not that can crap!\n\nI read that for most people, the events are hit and miss. I personally enjoyed at least 70% of the events, maybe I'm weird, maybe I'm crazy, but that's okay. But they stopped doing coop missions.\n\nI enjoyed the story when it focused on a character (Jihnsi,Phrolova) and not boring warm water Rover! I don't care phrolova killed a million nameless faceless npcs! I would kill twice as many to bring her back!\n\nAnd finally, the best part, the combat! I played mostly on mobile and then in order to maximize my skill, I started to play on pc! Its more beautiful on Pc and more fun as well! Depending on your team, you can play by swapping between all characters during their animations, or rely on the buffs to pass it on to the main dps hypercarry. Both are fun, but as I said, this freedom has been diminished since they choose to make characters like parts of a one lego set. Good luck having fun with just the wheels of Optimus Prime!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the story might not be that good for everyone, but it does have several really cool moments in the msq. the animations and visuals are top notch, if not the best in its category.\n\nalmost everything is simplified in this game, which is a good thing. but unfortunately, that also applies to the content.\n\noutside the daily chores and the same repetitive endgame loop like a regular gacha, you’ll occasionally get events that are really fun and full of potential, that you will never ever see again in the future (literally). or you’ll just get shallow simplified events and sometime it also feels like a cheap copy of another game. \n\nthe game also has almost no social features, coop might as well be deleted cus there's really no reason or benefit to do it. except doing photo with your friend or an event that occur once every 6-7 months.\n\noverall, it’s a solid game for super casual players, or anyone who’s looking for something simple as a side dish.\n\nbut if you’re the type of player who craves a lot more things to do, i honestly wouldn’t recommend it, or at least don’t invest too much. because the lack of contents, you’ll most likely end up finding another game that’s more engaging and addictive that you eventually just drop this one as time passes.\n\nthis game has a lot potentials, but the dev choose to play safe.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, the gacha system is no good.  Throwing time and money at a gacha system where you need at least about 80 pulls to get something (5-star item or weapon, with chances of getting a duplicate) means you're spending either around $160 per 5-star character or item, or approximately 173 hours to farm 12,800 astrites.  For people with full time jobs, I would definitely not recommend this game because you're better off paying for your monthly or weekly food expenses.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "(dont mind the low playtime because i have played the client version since 1.0  before it get into steam)\r\nI was once a huge fan but the current state of the game make me uninstall:\r\n\r\n- no interesting combat events (in a game advertised as combat-focused ???)\r\n- characters gameplay is too simple, especially the ultimate skills which are just \"nuke into the enemies' direction\"\r\n- story attached to the self-insert Rover, some how every problem that other characters face have to wait for Rover to solve.  \r\n-  1000-0.5 female to male ratio in character debut\r\n- the character will be almost eliminated from screen time once their story quest is done\r\n-the female character design gets more and more fetish-focused, even a gooner like me has to shake my head\r\n- 50/50 roll system bullshit, the amount of pulls the game give you each patch is not even close to guarantee a character, let alone their weapon\r\n\r\nThe game would have been way better if they stick to the post-apocalypse and sci-fi atmosphere from the first beta test and make more complicated combat features than just ladies in revealing outfits",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Wuthering Waves is a waste of time, and I regret all the time I spent on this game.\r\n\r\nFirst, to be clear, I am not going to spend any time complaining about the genre. It's a gacha game, we all know this, and it doesn't bother me. I play plenty of gacha games, and I have spent money on plenty of them too. That it is a gacha game has nothing to do with me giving it a Not Recommended. The problem is that it's a bad game.\r\n\r\nWhen you start playing, if you go in blind, it has just enough potential that it feels like it's going to get good at some point. That the quests will become engaging, that the combat will become well developed and fun, and that there will be plenty of stuff to do. But it never gets to that, and it forever stays below even mid.\r\n\r\nThe quests and writing in the game is wildly varying in quality, but overall it's really bad. There are a few standouts that tricked me into thinking it would be worth sticking with it, like the companion quest for Encore, one of the characters you can get, which was really good. But outside of maybe 2-3 quests, the writing is 50% boring, and 50% absolutely awful. Much of the main story is so bad that it reads like some absolute bottom tier fanfiction, with a completely uninteresting mary sue main character, constant deus ex machinas and \"... and then this other thing happened\" storytelling, and antagonists that are basically just saturday morning cartoon villains. Something you might hear said about the writing in this game is that it gets better as you progress, but it actually just gets worse. The game starts out boring, sure, but it ends up god awful. You should NOT play this game for the story. If you are considering it, play literally anything else instead. I promise that whatever you choose, it will be a better choice.\r\n\r\nHowever, for me who didn't start playing for the story anyway, the BIGGEST problem with this game is how it uses its combat and characters. This is rather big topic, because the combat system itself is actually pretty good, but the problem is that it's never used for anything interesting or worthwhile, and neither are the characters. Whatever effort or money you put into getting a character and levelling them is wasted, as there is almost nothing to do with them outside of running around in the overworld and just looking at them.\r\n\r\nThe main attraction for me in this game was the combat, and the moment you get far enough to understand it, where you learn attack rotations, etc, you learn how to blow up regular enemies in seconds. The only challenge in the game will be a handful of timed challenges and bosses, and that is literally all you get. \"End game\" as it were, consists of one mode that pretends to be a roguelite-thing, that resets weekly and is so easy that you can probably do it blindfolded in less than 10 minutes; two modes that reset monthly that are mainly DPS checks (with one also being just a hard check for whether you have a character with a skill that sucks in groups of enemies); and a set of hologram bosses that are powered up versions of story bosses.\r\n\r\nOnce you get to these, you quickly find that the modes that reset are incredibly monotonous and boring. You either have a good enough team for them, or you don't. Either way, they take 15-30 minutes each after each reset, and then you are done with all combat content for that month. The hologram bosses are genuinely challenging and also require extremely good teams to do their strongest versions, so they are a more interesting, but they are one-and-dones, so it's not really something that keeps you entertained, and they are definitely not by themselves enough to be worth spending hundreds of hours (and probably money) to get to.\r\n\r\nSo outside of those, what is there to do in this game? Nothing that uses the combat system for anything. You can farm materials for levelling up characters, but only a few times a day because of the extremely limiting stamina system, and the farming is the most boring thing. You either fight a boss or a group of enemies, but they are super weak, so you can just button mash and be done in 10 seconds and get your reward. It's mindless and doesn't require anything from the combat system at all. So if you have spent time and money building a good team, those are the things you can do with it. There is nothing else.\r\n\r\nYou MIGHT think that you would find use for your team for example in story quests or in the \"events\" that are part of each patch, but that would be wrong. In story quests, you are always GIVEN a team, usually of characters you don't know how to play. Usually the main character plus the new character. And since you don't know how to play with them, the combat content in any and all quests are absolutely trivial, because the devs do not want you to get stuck. All the big quests are either just about mashing through boring combat, or they do not have combat at all.\r\n\r\nAnd as for the events, I started playing this game earlier this year, and I think there has been a SINGLE event where I had to use any of the teams I built. Events are basically always non-combat events, or they are fake \"combat\" events, like some bad Vampire Survivors-clone that has nothing to do with the actual combat.\r\n\r\nSo once you get to the point where you feel that you have finished building a good team (which I thought was the goal), there is nothing to use it on. You log in, spend 3 minutes doing boring dailies that you could have done with a solo free character, and then log out. Once or twice a month you can log in and spend 15 minutes on whatever reset, and then log out.\r\n\r\nThe ONLY goal after that, is to save up for a new character, build a new team, and then again run out of things to do. Which is maybe by design. Hmm, maybe I am complaining about it being a gacha game after all.\r\n\r\nAnyway, in conclusion, I can not recommend this game. Don't make the same mistake I made and think this is going to get good, because it's not. If you want a good story, play literally anything else. If you want action and combat, ALSO play literally anything else, because you don't get any combat here anyway.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an okay game but the Devs (support) are the worst\nConstant disconnects, server is very unstable even when not playing in Coop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Go to the website and grab their launcher instead. this game runs like buttcheeks through steam.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "This game is bizarre, confusing, and mostly boring.\n\nThere are dozens of items, menus, reagents, power-ups, and currencies and they are all incomprehensible and needlessly complicated. It feels like I need to watch hours of videos explaining what anything does to understand how they help at all.\n\nThe story is slowly paced, and the diaglogue switches between droning technobabble about utter non-sense to characters repeating/reviewing everything that was just explained to a point of frustration.\nIt constantly feels the need to stop any gameplay to make you go through painfully boring quests of talking to pointless characters that might be interesting if I had the patience of a saint, but I don't.\n\nWhen you actually get to do combat, the game doesn't inspire any confidence either.\nPress attack until enemy dies, sometimes you get to pick up items from their corpse, or grab their ghost to apply some kind of upgrade that for the life of me I cannot really understand.\nThe controls are 50/50, I find climbing awkward, flying is a chore, and combat and movement in general just sort of average at the best of times.\nI enjoy soulslike games and have played all of them for many hours, this game does not match that tag whatsoever.\nThis is MMO combat with a parry button that feels sticky and unreliable.\n\nThe game mostly seems built around the monetization of characters, and of course they are all overtly sexualized. It isn't obscene, but it is laughably childish.\n\nI don't like this game, I find it immature, boring, and tedious in the worst way.\n\nThe graphics are a big postive, characters, environments, and creatures all look great (the latter is a bit generic, but not bad in any way).\nThe voice acting is not bad either, with the biggest issue really being the inane convulted dialogue.\n\nI've seen in other reviews that the game gets much better after the \"intro\" but I'm 3.5 hours in and nothing really makes me want to continue playing so far.\n\nYou'll probably decide if you wanna play this game based on the screenshots or if you enjoyed other games in the sub-genre of \"open world-ish anime fighting gatcha games with 12 different currencies\".\n\nFor me, its a big no. Don't bother.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "bum ass game making me go through the entire story just to level up my character fuck you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I went into Wuthering Waves with a lot of hype, but honestly, it didn’t land for me. The world looks great and the combat tries to feel dynamic, but the overall experience ends up feeling hollow. The story didn’t pull me in, the characters felt forgettable, and the pacing dragged more than it should for a game that’s supposed to feel fast and fluid.\n\nExploration is beautiful at first, but quickly becomes repetitive. The game keeps teasing depth, but never actually delivers anything that sticks. Even the progression felt like a grind without real payoff.\n\nOverall, it’s not terrible, just… bland.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A gacha is a gacha, better than others sure. Its still terribly predatory, do not support these games.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "If I have 50/50 chance getting character I want then the game have 50/50 chance I will uninstall it. Uninstalled, don't waste your energy and time on dark pattern games.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "As a Genshin player, I found this a very refreshing take initially.\n\n+ Better stamina management (regular running doesn't use stamina; you can wallrun up cliffs etc)\n+ Interesting Echo system\n+ There is one daily quest (not four...)\n+ Pulls feel more generous - you get a guaranteed 5-star after a certain amount of pulls on most banners\n\nBut not all is sunshine and roses:\n- Camera management in battles is a disaster. Close up, far away, rotating, it's incredibly chaotic and there's no way to change it.\n- Why no fullscreen mode without forcing screen resolution!?\n- The world doesn't feel super alive at times.\n- This is the gacha of it all I suppose, but there are faaaar too many events at one given time. Unless you are someone who can devote the majority of their time to this, this is just a constant nagging overwhelm.\n- Wall-running doesn't use stamina, BUT the characters get stuck on ledges all. The. Time.\n- Especially after the recent update, loading times have become ridiculous. It takes upwards of ten minutes to actually start the game, also because most days there's yet another patch to be applied and about 50% of the time the game won't start at all. Like yes, this game is more respecting of my time than Genshin, but if I spend 12 minutes trying to get the game to start up, that's not really very good either, is it. (It does perform better on Steam Deck, but even then, the constant patching and having to re-start from launcher is getting annoying.)\n\nI bought the premium Podcast thingie when I originally purchased the game, but am not sure if I'll buy a second one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "My computer isn't super expensive or deluxe, it's an Acer Nitro 5 from 2020. So by no means do I expect to run every game smoothly or easily. But it does the trick and can manage games like BG3 at ultra graphics. So why is it, that when I boot up the steam port of a *mobile game* am I unable to run this with high graphics? And when I open up the graphics menu even with all of them off or low, I am told by the game to expect laggy performance? This isn't an issue with my PC this is an optimisation shit show.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game sucks ass, the story is poorly paced, boring, filler dialogue.\nIt's combat is formulaic, gacha characters have interesting movesets but it get's stale real quick. The enemies are button mashing easy, with the only difficulty being in level differences, in which you deal only a pixel of damage, in otherwords a test of patience. Combat isn't interactive, enemies most just stand there dolling out attacks, you occasionally time a perfect dodge, or a parry, but combat feels more like you are picking which animation/cutscene to do damage with. It isn't really satifying, enemies should stagger to attacks more easily/ be more reactive to your attacks.\n\nIt's exploration is really the highlight for me, beautiful graphics, gorgeous sceneries. Kuro games really did well with making a grand and massive setting.\n\nBeing a step above genshin, yes... But that is a real low bar. \nGameplay is meh, only good for a gacha really. 6/10\n\n/23/11/25/ Review will update as I get reach end game. If you think my takes are shit, comment why.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One last Goodbye to this Greedy ass paywalled content Gatcha bullshit which doesnt appreciate the time and money you dedicate to it. Where winds meet is finally here and it's not only totally f2p but also better in every aspect.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Predatory pay to win game the 50/50 system can only milk you dry to make you lose more. Don't support Kuro games and anything related to Tencent. These companies only care squeezing it's customers. What's sad is that there are other gacha games that are more F2P friendly. I would recommend this game only to those i hate more. \nEven Kuro's niche game Punishing Gray Raven is becoming more predatory.\nI would even go far as to say League of Legends gets screwed by Tencent. LoL isn't dying only thanks to it's toxic/based fanbase but not every gaming community can be loud like them",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried playing Wuthering Waves on Ubuntu Linux. It installed and ran perfectly — I registered, logged in, and even entered the game. But shortly after, it stopped with a message about active anti-cheat protection and closed.\n\nSeriously? Since when does anti-cheat block normal Linux players? That’s ridiculous. I don’t recommend this game — it’s unplayable because of this issue.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game hits the mark on many things and completely misses on countless others like:\n\nThe TLDR for those that dont care to read everything under here: Game wise its good and i enjoy some parts of it but if you're here for the story just don't. \nEven if i prefer this game over Genshin as Genshin locks its story behind pointless grind that story at least when i played it years ago was decent and interesting this games story is actual dog sh*t.\nFor those that played this game and likes the story great im happy for you but for me its painful.\n\nThe Pros:\n\nThe characters are quite nice at least visually for both the guys are girls and their attacks are stylish and flashy.\n\nAfter finishing a short quest early in the game you unlock wings you can fly on which is amazing and i wish more open world games have them nothing bad to say about it other then getting more stamina to fly is quite a few hours and 2 continents away locked behind world exploration making you have to live with the default stamina amount for a long time other then that the flying its great.\n\nThe Cons:\n\nFirst and foremost the story its boring, its forgettable and the cutscenes are long, boring and many quite often many of them back to back making you skip each one by on, some cutscenes cant be skipped other bug out and only the sound plays but the cutscene itself dont happen making you have to listen to grunts and noises for a few mins as you just wish for it to stop.\n\nSome missions dont care about your team and upgrades you collected and gotten and instead just giving you a premade team thats usually alot weaker then your own characters with preset levels and Echos making grinding good characters and levels for your team utterly pointless in some cases as you dont get to steam roll your enemies even tho you should be able too.\nA horrendous gacha that even if you get the 5 star character its a 50/50 if you actually get the one you wanted or a random one.\n\nEven if you get the character you wanted the characters weapon is in another gacha pull seperate from the character with a 0.8% droprate on 5 star stuff or 80 pulls which comes out to around $200 USD per 5 star character/weapon or $400 for both.\n\nThe game also assumes everyone is brain dead as every single thing in the game is over explained and each \"quick time\" event pauses before you actually suffer a failure and in longer missions the characters most likely forced upon you will explain the same mechanic every singe time you encounter it OR they talk so slowly you already ran past it or are no longer standing where the game wants you to stand to use the mechanic.\n\nThe combat its flashy and has great style but its mostly button mashing with some skills thrown in there is a stagger system for alot of bigger enemies and world bosses you find is specific locations BUT only in some missions are you allowed to use a finisher move to deal heavy damage to staggered enemies think Elden ring or darksouls stagger and finisher moves but you cant always making the game inconsistent.\n\nThe dialogue is uninteresting and the overworld voice lines is very few making the characters just say the same 1 maybe 2-3 voicelines over and over again.\n\nConclusion: \nThe game got massive potential but there is so SO many design and gameplay decisions i just cant wrap my head around as to why is the actual living hell they where made.\nThe game has a good foundation to stand on but, the combat needs expanding, the story needs cleaning up, the story writers need to stop assuming every player was in a car accident and got a brain injury with the dialogue and over explanations, and while everyone has their own opinions about gacha systems in games there is absolutely NO reason whatsoever that a 5 star pull should be 50/50 if you get what you are pulling for or not for something thats already $200 + $200 more for the weapon which is also 50/50 if you get the weapon you want or not.\nI dont hate the game i just wish it was better and i still play it even after all this complaining in this review.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Best of it's genra but the genra is an abysmal pile of Sh**. I started on release and my hours are way above the 44 shown on steam. The combat mecanic is great but you got no serious content to appreciate it on, the characters are marvelous but the 50/50 take all the fun from you every single time. The team made some good improvment since the start but I wish we had things to do after building the units that are not \"mobile style\" mini games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nice visual, gameplay is ok, can't comment on story since still early in the game, but it's a slog, that's about it. Other than that, it's just another gacha(derogatory)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a ZZZ player, i find it hard for me to enjoy games like these since personally i am just not a big fan of open world games, i mean i play genshin during its release but i got bored after a week and i had to force myself to play 10 hours of this game so i think its just up to my personal liking in my own genre, I do play certain open world games but then rarely it grabs my attention and for this game it didnt. \n\nDid i skip through most of the dialogues? i didnt at the start but somewhere in the middle i kinda got bored with the stories that i skip like i couldnt care about it since i felt asleepy too much.\n\nDid i enjoy the gameplay? i guess its ok but sometimes felt the timing is off but i mean i guess i dont play soulslike games that much that i had to rely on ZZZ flashing attacks so i guess i am just used to some help with timing.\n\nSkills issues? honestly i do in some games, i am just impatient and has issues with timing then yeah, since i truly enjoy turn based gameplay or RTS games i guess i got old.\n\nDid the characters makes me goon? honestly i dont since i found them anonying enough that i literally had to mute most of the dialogue audio so yeah i guess i am not gonna goon at this game like others.\n\nGraphics? idk ok i guess...\n\nWhy i am ranting? its 5.30 am, i got nothing to do but to wait for new gacha games to be released so i can try it out, i do have ZZZ but because how fast i finish it, i got burn out that i had to wait it out a little bit more.\n\nWhy negative reviews? was gonna positive but then i would rather be that guy whos an asshole about it, if steam allows a 1-10 rating, i would it give 5-6 in my own opinion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It maybe more generious than most gacha games from what I gather.  I haven't played any others.  It is still a gacha game though and still very grindy.  Shame really if it weren't a gacha it would be amazing to play because it does have a lot of good things going for it; art, animations, story, character abilities etc.  But the grind is to much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, this game kinda sucks as a newbie. If you pulled any of the characters that showed up late in the story, I hope you like not using them past level 50, because one of their ascension materials are locked behind the location in the story where that character was introduced. Oh yeah, and the story forces enemies to level up at some points, so it's not a matter of if, it's a matter of when. This game is a better Genshin but it still has all the problems of Genshin, I love some of the QoL features in comparison but this game still feels like a job to play and it takes forever to get resources and complete the story. I'm probably not coming back to this one.\n\nAlso the story sucks ass and is basically indecipherable for the first few hours unless you have the wiki open to translate all their bloody improper nouns. (Note: Still not out of the first arc)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It looks like something that would be fun, but then it just throws technobabble at you, bland stereotypes, and a level of handholding that I didn't even need when I was a small child. If you have more than a dozen braincells, I'd skip this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for over 237 hours.\n(200 on playstation)\n\nI used to love this game.\nFor a time it was great.\n\nThe combat is the best thing about this game, but only if you have good units.\n\nI have spent around £160 in total since the games started.\n\nJust on the monthly 4.99, then the 9.99 monthly pass.\n\nI have around 70% total completion in all of it. Story is done.\nThe end game stuff is impossible, even with built characters correctly I don't do enough damage.\nIt is built for whales or no lifers who spend every day practicing combos and attacks and defence.\n\nThe world, the characters I love. I absolutely love them.\nIt is a complete cop out that we cannot romance any of them. \nIt is basically follow around rover like a love sick puppy simulator most of the time.\n\n\"NEW PATCH NEW WAIFU\" was a meme and now it is a reality.\n\nChisa is the final straw for me. 2.8 has killed any interest in the game. I have also lost my last 50 / 50 - this system needs to be binned. Just give us a featured character of every banner in 80 pulls. Even if its once only, and then it goes to 50/50 after.\n\nI spent money only to be shafted AGAIN. With useless base characters that are so weak its not even funny.\n\nChisa is a great character, but she loves Rover, and it is just skipped over. The thing is she actually looks great with both male and female rover. \n\nIts heavily implied she loves him, but nothing is ever done about it.\nOur rover?\n\nMight as well not be ours at all.\nThey are one dimensional, saying all the wrong things and most of the time are a silent protagianist. It is just awful to sit and listen too all the time.\n\n2.7 Will still be the greatest story in all of Gatcha. That ending will never be beaten. Septimont was the best this game will ever do. The characters, the story, was great.\n\nNow we are going to a college? gimme a break.\nAlso Rover is a lot younger than i thought they were. He was a student at this academy, Chisa also went there (which why it makes sense they should be together) \n\nThe story isn't really the problem for me anymore.\nThe gatcha system is.\nThe lack of rewards for playing the game is.\nYou cant even grind enough to get 40 pulls each patch. \nThe game has gotten harder and its ruining the game for me.\n\nI have level 90 characters. I have some of the best characters in the game and their weapons, no dups thou. But because you have to USE MULTIPLE CHARACTERS in the end game, I cant do it, because the GRIND required to get them all up to par and geared is INSANITY.\n\nSeriously who has that amount of time?\nThe drop rates are garbage, the random stats are just a bane on this game.\nLet me buy the gear, or give me a fight where the stats are FIXED for us to farm.\n\nThis game needs to be a proper RPG and let us romance who ever we want.\nLOOK AT BALDURS GATE 3 KURO GAMES.\n\nThis netural new waifu new patch has ruined this game. I have no interest because the game is not rewarding to play. No good events, no rewards, barely any in game currency how exactly is this rewarding to play?\n\nAfter all this time I am hanging up my account boots.\nOnce my monthly sub and battle pass is done im uninstalling and never returning to this game.\n\nI am looking forward to Anatana or the other hoyoverse game coming out.\nRIP wuthering waves.\n\nUnless they add more events, more rewards, make characters actually romancable and interactive, and also have them appear in the world following us like a REAL party would. SO many characters should be in this game, but they always STAY in there little pocket of the universe, even thou they say they will follow Rover or always help him. (Iuno, Augusta, Lupa for example) - Lupa should be following Rover there is no reason for her to stay in Septimont and Iuno. It is just stupid at this point.\n\nDon't invest in this game, once the intintal rewards are given for playing the early levels the game is a GRIND that is not helpful or fun to do, plus the stamina system needs doubling or removing completely. \n\nI am all waved out on this game.\nHaving made so much content on this game too, it is with a heavy heart.\nI say.\n\nGoodbye Gathering Wives simulator.\nI wont miss your 50/50 bs.\nI wont miss your grind.\nI will miss the world and the characters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As a new f2p player this game is rough. U have to play the same team for half year before u can build anoither team and enjoy a different kinda gameplay. If u enjoy the story this game is good but if u play the game for combat it gets so boring after playing the same chracter and same team for months and months on end. When was the last time they even released a good A rank ? Guess WUWA just dont care about new players. Fells just like Star Rail. In trials S tier character have good kits but i cant wait for Half a year. Loggig in daily just to play with the same 3 character, so that i can try a new character after like 2 months and then wait another 2 to 6 month depending on what banner they are currently on to build a team that i enjoy playing. I rally like the visual the story but ig devs forget its a Game and Gameplay is 80% of the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As a gacha it's not a bad game but they censored the game before, this game should have been rated +16 or +17",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat is nice, so is the story, graphics and character designs but it's a gacha so I didn't have any big expectations but I hate RNG, Pokemons/echoes shouldn't be so random with their stats its so annoying. I'm aware its a random stats gear system and still in my opinion its just a bad annoying system to force players to waste their time on farming without the guarantee of obtaining what they want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wuthering Waves is a great game, especially for a F2P gacha title. It comes close to Expedition 33 in style and music, or even other AAA games. However, it has three major weaknesses: the 1.x stories haven’t been polished for a while, there’s a lack of end-game content, and the UIs are poor made (turn off the UIs in Septimont and Ragunna to see how good this game could be without those UIs). Even so, with its current foundation, it deserves better.\n\nLeaving a negative review after paying and playing and for a long time feels contradictory, but I hope the developers notice that most new players struggle to make it through the 1.x stories because how boring it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My account has not worked in over a month. The error message reads \"too many failed log in attempts\" which is bs because i logged in first try. I contacted support, after two weeks it finally looked like i was gonna get my account repaired or whatever is wrong with it since they finally asked for my device information. Since then two weeks have passed. I already wrote two emails asking for an update which were completely ignored. Basically the support is ghosting me and has been for over a month. A real pity because i really like the game but this unprofessional behavior has ruined it for me. Also wrote them that if they cant repair my account i at least expect a refund, completely ignored. That’s for real the level of unbothered i strive to achieve one day. So no the hell i dont recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sadly giving a negative review for this game.\n\nThe gameplay is good and is the reason I’m sad to give this a negative review, the story I don’t know about because I had to skip everything to not waste even more time farming the currency to pull characters.\n\nIn 50 hours I was only able to pull one 5 star character from his up banner, and tried but couldnt even get his weapon, didn’t spent the currency in anything else. \n\nThe gameplay is good, but I would only recommend this game if you have unlimited free time or money to spent, because as every gacha, everything is way too expensive, it’s basically a full price game for every character that you want, it’s made for whales.\n\nIf you want a character F2P like me, you will skip every dialogue to speed things up, since the story is very slow and some missions are way to long for what they give you, so you might as well just go around the map opening chests that give 5, 10, 20 or rarely 40 of the currency, which you need 1600 to pull 10. The gameplay is so good tho that it took me long enough to quit this game after just farming the currency.\n\nIt’s basically 3 hours or more of nonstop farm to pull 10 times (1600 of the currency).\n\nSo yeah, would recommend if you are a whale or have unlimited time, else, find other games to play, stay away from gachas.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought the monthly lunite subscription bundle, i thought why not support the devs eventhough i wasn't sure i would keep on playing the game. I got busy and couldn't login so when i eventually logged in couple of days later i thought i would get the unclaimed Astrite in mail BUT NOPE if you skip the day you DON'T GET the unclaimed Astrite so basically you waste your money in a sense. This game is definitely an uninstall for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EDIT: Ever since the 2.8 update this game has been unplayable for me. Almost 10mins to load the main menu and about 30mins to load into a map. I dont have time for that. I have DDR5 RAM and every other game loads just fine, so I may just give up on this one. RIP. \n\nStoryline: 3/10. the delivery absolutely is terrible but the overall lore is good. \nGameplay: 10/10\nAesthetic: 10/10. music sounds great, game looks great. \nGatcha: One of the more generous Ive seen. \nSteamdeck: barely playable 20-30fps during fights at lowest settings (but at least it looks good?). IF you can manage to even login.\n\nthis game has everything going on. nier automata/souls like general gameplay with elements of zelda and ofc the gatcha. I think this one has set a new standard in open world games. \n\nits not too difficult but there are difficulty spikes for sure with some fights.\ngetting the game to run can come with some login issues and there still needs to be some improvements with the steamdeck compatibility. \n\nwuwa gameflow: cutscene, then you get to walk to another cutscene. followed by another cutscene then you get to have one fight that lasts about 2mins tops. followed by another 1 or 2 cutscenes. so be prepared that this is how its going to go. the storyline is mostly just you sitting there watching an anime and having to press buttons sometimes. (protip: bind esc to a mouse button for faster cutscene skips)\n\nThis is the single issue with this game, dialogue and cutscenes. about 90% of it could be cut (Kuro games, instead of 7 cutscenes in a row could you just have 1?) I found myself skipping cutscenes becos of the useless nothingness that occurs in so many of them. GET TO THE POINT. there is a saying in game design \"show dont tell\" and there is SO MUCH telling going on here. Im here to game, immerse myself in a world where i have agency, not watch a cartoon. And yes, there are unskippable cutscenes (fortunately most the unskippables actually show you things of substance). There is good lore here its just theres a lot of filler, repetition and being bombarded with 6 or 7 cutscenes which you have to walk between before you get to any game play is quite common. Oh and whats with the dialogue choices? why is there at times only one option to pick from? i feel like i am being trolled everytime there is ONE dialogue option. how about, the character just says it? lol... (EDIT: In chapter 2 things improve for a few acts, but only for a few acts) (Another EDIT: toward the end of chapter 2 there is some segue quest, i have never clicked that skip button faster). \n\ndespite feeling like i am stuck on a train with noisy children for some dialogue, when i am out in the open world flying around killing stuff and collecting things, i love it. the combat and collecting things is ez 10/10. the actual gameplay is great, they need to work on how they deliver the story but i doubt that will change. this is like watching a cringy anime that has good meta lore. they are going for the \"quantity over quality\" tactic with the lore. it would be great to see quality over quantity in the future, but thats not gonna happen lol. its the amount of cutscenes that ruins the fun. \n\nI'll be sticking with this one for a while but thank god there is a skip button. (EDIT: Skip button also gives a summary for most the scenes you skip)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overrated crap. First off the switching characters thing I HATE it. I wish I knew that was part of it before I started playing this garbage. Un-skippable dialog makes it boring as heck I'm not into the story the characters. At first I thought it was decent but then got to the switching characters horse crap and then the madly boring dialog. I hope I can delete my account I don't want you having my email or time. (edit) Can't delete the damn account unless your in game. So not only does this company not respect my f'n time. I gotta reinstall it just to delete my account. INSANE. Will NEVER touch another title from these a-holes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "un fucking playable on steam, just play it on the actual client, piece of shit port thx",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First off, music is great. Second, I've tried playing this game for about 7 hours between Steam and mobile, and I can't get into it. There is so much dialogue and basic fetch quests that I had to put it down for good after trying multiple times to play. The most combat I saw was in the first 45 minutes which is the only reason I continued to play. Combat is fun, but there is very little from hour 1 to hour 7, maybe even longer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Barely any pulls in this game for f2p you'll never get a 5* limited character, practically no male limited 5* characters and 2 of them are the same element.\n\nIt's just your average gacha greed slop with shitty pull rates, stay clear from this game it's pay to win as hell \"they gotta make their money somehow\" Yeah? With £150 to guarantee characters? Lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Recommended? Mixed / Still Deciding..\r\n\r\nI’ve loved Wuthering Waves ever since launch, even with all the early bugs and lag spikes. Back then I actually uninstalled the game from the official launcher because the issues were pretty rough, but I always planned to come back. Fast forward a few months.. I reinstall, only to run into a weird problem where Microsoft Edge couldn’t read the game files. So I decided to play on Steam instead, hoping it would be smoother. Sadly… not really. The game technically runs, but loading into the world takes 5–10 minutes, and half the time it tells me I’m offline even though everything else on my PC works perfectly. What makes this even more frustrating is that half a year ago, this game ran flawlessly for me on the same machine. I’ve even invested around $800 upgrading my PC for this and other games, and yet Wuthering Waves in particular just refuses to cooperate. I genuinely enjoy this game’s story, world's exploration and combat, but the performance problems make it really hard to stay invested. I’m hoping future updates fix whatever’s going on, because I want to keep playing..right now it’s just rough :/\r\n\r\n(I guess back to Genshin Impact for now..)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "theres nothing to do when youre not a new player all they give you is login events .... boing af its like the devs fell a  asleep",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Story went to the dogs. They copy Honkai Star Rail / Hoyo games too much, the world building is poor and now character quests disguised as story quests. The combat is the only good thing about this game, but sadly the direction which the game is taking does not build upon that strength anymore. It's childish events and braindead puzzles just designed to make you keep coming back for astrites. Echo farming continues to be tedious and unfun. There's a good game here but it's buried under layers of crap.\n\n---\n\nI've been a day 1 player - before this game was on Steam - so my playtime is much higher than what it shows here. They had a very rocky launch, but they followed it up with optimizations, built on top of their good combat system, released great characters that were snappy, flexible and fun to play. Story was never stellar, but at least, it used to somewhat make sense. The events felt fun and exciting, and exploration was also pretty nice. It used to feel like a faster, snappier soulslike (when your chars weren't leveled up and resources were limited). \n\nFast forward a year. They clearly don't have any idea of the story or the world they're trying to build, and are just making it up as they go. Rover can be an all powerful god, full of flaws, or even a weakling, whatever the story demands. Rover's lines are atrocious. Every \"story quest\" is just designed to shill the newest shiny character. \n\nSpeaking of characters, they're no longer flexible and sandbox-y in nature. They're made with specific teams in mind and they work more or less only with that team. This takes away player agency, the fun of slotting chars any which way to make team building interesting. Instead it just forces you to pull characters you don't really want to make the characters you like work properly. The teams and combinations are prescribed by the devs, there's no real strategy or 'gameplay' element here apart from just executing the same combos over and over. The DoT mechanics (Spectro Frazzle, Aero Erosion, etc.) don't serve any real use except limiting what characters you can use in what teams. They're not a valuable combat mechanic - they do negligible damage. E.g. Zani without Phoebe is practically a wet noodle, Ciaccona only works in Cartethyia teams, etc. Recently they made a character (Iuno) only buff characters which gain small amounts of shields repeatedly - there's only one character (Augusta) who fits that requirement. Pretty asinine stuff.\n\nThey're copying the hoyo gacha playbook by the letter, instead of leaning into the uniqueness of their own systems.\n\nCombat events are gone, instead we have mass appeal saccharine leisure events with plushies and chibis. \n\nThe post apocalyptic setting is now a plain old fantasy setting. The quality of everything has gone down. Echo farming with RNG continuous to be tedious and unfun (no substat selector still). Exploration is no longer fun, because there's no real challenge or sense of wonder. Once you are in the endgame, enemies are basically paper. Endgame events are just designed to be \"solved\" by the newest shiny characters, making your favorite characters obsolete. They're just pretty much the same rinse and repeat. If you have the new character, you'll clear, otherwise you'll get a few less stars. It's not really a challenge to optimize and figure out, it's just the same thing gacha games do. Now, it's slowly going to its roots - terrible optimization - just like at launch.\n\nThere just isn't much to do after a while playing this game and reaching the endgame. Instead, just start watching the characters you grinded for slowly become obsolete, killing your motivation to build new ones.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The only good feature this game has is the ability to skip the uninteresting story.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] SPOILERS AHEAD UNTIL 2.7 [/h1]\n\ntl;dr WuWa's only as fun as the sponge fest grind that holds it back. And for pure F2P players like me, that grind is no longer sustainable.\n\nI've been playing WuWa since launch (1.0), long before its steam debut (2.0 I think, don't remember), safe to say I've poured in a fair bit of time into the game and I've had the chance to play everything there is. My actual playtime exceeds 200+ hours, Steam shows less since I linked my account late. I'm not going to highlight much on the story, since it's pretty much an echo (pun intended) of what everyone else would tell you; underwhelming at the start, leaves you gripping your seat and screaming \"Absolute Cinema\" in the later arcs, at least until the end of Carte's Ragunna arc for me (2.5). \n\nWhat I am going to talk about is how grindy the game has become in recent times. Let me make one thing clear; I'm a really stubborn F2P player. I never spend on any game that I play whatsoever, mainly because I just don't have the money to spare, ever. I don't ever touch on any of the high-level combat game modes like Tower of Adversity or any of the other combat related events. Don't get me wrong, combat in WuWa. \n\nBut the thing that irks me is how UNGODLY levels of spongy the enemies can get. Not a skill issue on my part (I’ve cleared every story boss and hard-mode content with just Spectro-Rover C6/ Sanhua C6/ Shorekeeper C3). Now you might be inclined to tell me to just build a better team instead of sticking to one, that there's a lot of variety. To which I will reply \"That's cool and all but where do I find two months of grinding for a team that’ll only marginally ease temporary event content?\". Like you might have the willpower to grind all 4 Major locations in WuWa to 100% completion, but I just don't have that kind of energy. The collection grind is monotonous, echo farming that can clearly be automated is manual every SINGLE time and to make matters worse, any and all casual events are padded all to hell. At most, 10 minutes of fun into 3 hours of filler (Riccholi fishing event or Solaris Film Festival). At this point, WuWa feels less like a gacha and more like a modern Ubisoft title. If I wanted to grind that bad, I would've just opted to play Warframe.\n\nThat brings me to the second point, let's say I did grind a long while and got all the resources together. What about the emotional burnout it takes on me when I literally fail on two different banners for a new team that I've wanted to build? What do I do when I grind all of Ragunna for Zani but Instead of Zani I get a Verina dupe that turns into extra corals because I already have Verina at C6? Can't get Pheobe anymore either because not enough time to. No issue, just grind for Ciaccona and Carte. I get Ciaccona and then I go to grind for Carte, long time to her banner btw so I'm stacked on pulls for her. Whoops, too bad you get an Encore dupe. \n\nSo now I got 48+ hours of playtime for absolutely nothing and not even a decent team out of it. I really don't think any whalers or grinders will understand how debilitating it is to feel that loss because they'll just pull their wallets out when in doubt or grind everything till hell freezes over. Me? I'll just stop playing I guess. Like I get it's a 50/50, and I genuinely understand that's the odds I'm playing at. But it really feels debilitating when the game you've spent so much time enjoying gives you the real shocker that it's just an advertisement for new characters in the story that'll probably have 0 role in the story post event. Their entire role becomes disillusioned like this, like the story wants me to care for them deeply as characters only to have them disappear post-banner.\n\nThe pacing is all over the place, not to mention how me not being able to get Carte actively hindered me from enjoying the story because that was on my mind the entire time, and I just wanted to get through it as quickly as possible so I could catch up content wise. I will say the ending to the Septimont arc (2.6) was really well executed. Even with all my banner losses looming over me, I genuinely enjoyed the final arc and all the fan service they put in.\n\nBottom line, I love WuWa. But in recent times, it's gotten really hard to stick with it because now it's focusing more on padding content out for player retention and making things generally harder so that players whale more. F2P friendly doesn't mean it's satisfying to play as a F2P, it means you can clear the entire game from start to finish with any of the free characters available to you, but to get to a point where they are all decently powered enough to ice you through everything is a long stretch. \n\n[b] If you're someone who doesn't see grinding as a problem, this game is for you. [/b] If you're someone like me who's not only short on time to play games but also plays them for fun, it's not for you.\n\nEdit 1: Typo fixes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pros\n-Graphics are great\n-Big boss fights can be fun (some are Spongy)\n-Switching between characters in fight is very fluid\n-Dodge/counter also felt pretty fluid\n\nCons\n-Only really cared for the fighting style of the main character. I didn't try every character but ones I got or tested out not great\n-Some 4-star characters you can tell their 4-star character so much less flare \n-Story is boring\n-Standard gacha game with way to many tabs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great story, astonishing graphics, has very great and complex game mechanics and has a wide varity of quest and characters to keep you entertained. Overall game 10/10\n\nReasons why I gave this game a bad review is because of:\n-Very bad optimization\n-Buggy game sometimes the game glitches out.\n-Also still didn't get chisa after 100+ pulls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My gripe with this game is its trying to be a lot of current and past gacha games on the market and cramming them into one. The story and game direction makes absolutely zero sense in where and what they're trying to do. With that its really telling me \"play only for the characters and the gameplay\". While there are still a lot of positives that this game does compared to their competition (even though its basically more akin to dark souls), It's hard to recommend a game that seems like the devs are throwing whatever they find cool into a game rather than actually making a coherent game.\n\nIf you're willing to look past this glaring issue then it's a good game and worth checking out",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game fucking hates me. I never won a single 50/50. Uninstalling, it's unbelievable. Don't even get me started with my 5-star pulls being hard-pity, EVERY SINGLE TIME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is not an open world game, not even a game, this is an interactive movie. You watch 1 hour of cutscene just to walk 5 meters and watch another 2 hours of cutscene and dialog. You can not even understand what is going on since the game has a made up word for every item, event, feature, it is like you are reading gibberish at some point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played most of the game on phone not for the combat but for the story; it disappointed me the entirety of the 1.X story is unplayable from how bad and boring it is the EN voice acting was a torture to listen so I immediately changed to JP.\nThe combat is okay at best; I normally focus at the choreography in the combat, but in this game it only focusses in big and flashy gloom effects nothing more, but there are a few characters that are actually cool to look at (example Lupa).\n\nMy biggest disappointment comes from the fact that the devs said way back before the launched that they changed %80 of the story just because people were complaining and after the game launched no one talked about the story and if it improved they only talked about the compensations given for the bugs at launch. To me the most important in any game is story and characters(personality and looks) and this game disappoints in that as well. \n\nThe story was so bad that I skipped everything and didn't bother trying to understand. It lost me the moment it started with all the characters immediately wanting to suck you dry just for existing.\n\nThe characters are 4/10 most of the time. These were the most bland characters I ever had to know no personality look bland or just wearing next to nothing(the sexualisation is not the problem is just that the when the devs try to convince you to pull a character just because they wear almost nothing of clothing seems as a lazy tactic; a good example of how to do it right is NIKKE they have characters that don't immediately love you and some that like other characters, but even if they like you the protagonist, most of them look and have a better life story than any WuWa character).\n\nIn summary I thought that WuWa was going to the best gacha for all the hype that it was having but no it is just another 3d open world gacha game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unbearable exposition dump filled slop with one of the most generic characters, just repeating exposition keywords over and over again for the absolute low IQs who would enjoy this. The people who play this utter waste should question themselves: why am I playing this and not the huge library of thousands of good games that are out there and easily accessible? \n\nThis is actually sad.\n\nThe only decent thing about this slop is the graphics, although even those are lifted from Breath of the Wild, which came out about ten years ago at this point.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I dont recommend to even start playing this game, it's a rng on top of rng on top of rng on top of even bigger rng! You want to build one character? forget it, after spending 200+hours i can't build decently my havoc rover and it is a basic character!!! You are farming echoes with havoc or attack main stat- forget it, on 100 farmed echoes i got few with that stat, rest is DEF, HP or other \"element\" it's bullshit. You have 10 farmed echoe's with main stat You want? BUUUM!!! In your face: def%, def, hp%, flat hp or  flat attack substats and it all costs materials that are energy or time gated like tuners or items for leveling your echoes. It's not worth Your time or money. After another day of getting shit echoes and shit substats im just done.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every time I wanna play this heap of trash it wants me to restart the game 6 times for updates.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so my account got deleted because i didn't play for a while? darn sad not doing all that again ill just uninstall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I saved up for over a month after getting this a couple months ago for the new character(Qiuyuan), the ONLY reason I downloaded it because I don't like the designs of all of the other characters.\n\nNot only did I lose my 50/50 twice, but the methods to get more Radiant Tide are overpriced and give me no chances.\nNone of my progress did anything. While some stories are amusing, playing through the main story feels like a chore rather than playing a game for fun.\n\nJust play Honkai Star Rail, this game failed me on literally all levels",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Soooooo Much Talking!!!! Oh... and then they talk more... and then they talk some more... This is a visual novel not a game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be fun until they broke/removed the ability to invert the y-axis for mouse.  Now it is completely unplayable.  Worthless garbage.  If the developers would pull their heads out of their butts for 10 minutes and re-enable this (since it is literally part of the game engine), this game would be playable again and I would happily support it.  Instead, they ignore us and leave money on the table.  Not going to waste my time.  Uninstalled.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Chinesse developer+ 2 password protected files deep within the log level files of the kernal level anti cheat that are not os oriented/nor app oriented? That tells me not worth my time and its nothing but a data mining game. Good thing I don't keep any data on my gaming system and my network connection is a isolated one. That has no connection to any sort of cloud based saving mechanism of any data repository. Goes to show you the Chinesse cannot be trusted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "is gacha game and is boring af the gameplay is minigames for retarded people \nthe only positive i found is the characters are very creative and goodlooking but nothing special",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yet another one of those F2P anime waifu games ported over from the mobile space, and unfortunately just like many others, pales in comparison on the PC platform.\n\nThe gameplay is the typical switch between 3 characters that is very common among these types of games like Genshin or ZZZ. But I'd argue ZZZ does a better job at combat than Wuthering Waves. \nBut all that still does not hold a candle to more purpose built PC games like DMC or even older Assassin's Creed games (Brotherhood, Black Flag, etc).\n\nFor gacha/paid, I understand it being a F2P game needs to keep the servers up, but just like Hoyo games, it follows the same format as pulling duplicate characters to make them more interesting to play. Try Cygames Princess Connect or Nexon's Blue Archive on how to handle duplicates far better.\n \n\nOverall I cannot recommend this game whilst there is better games on PC for an third person action game. The only demographic that I can see this game sells to is for people who likes waifus and can't afford or refuse to buy DMC/Granblue Relink on a discount. Uninspired with better options out there on PC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The \"new player\" banner for your freebie 5* is rigged so that you can get 23/24 with reasonable grind and the 24th requires ungodly grinding. Says it all about this game's design really - the entire game is filled with psychological manipulation like this.\n\nKind of a shame because I felt the game was pretty chill without all the fake urgency.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We get it Kuro, brown people are scary beings that only exist in real life. They shouldn't exist in this amazing fictional world you created. God forbid melanin exists. What cool and amazing chinese beauty standards that are totally not rooted in racism and bigotry.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad performance, not a pretty and user-friendly ui, terrible fonts, still no russian language. but game is good, much playable then genshin, its a good way to while away the time while waiting for Ananta",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are beautiful, the characters are diverse and wonderful, but the story is a yawn fest. Couldn't keep me invested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sucks, breaks on linux, from what i understand It could work on linux if they accepted to use the ACE on a normal level and not on the kernel level. We already have compatibility issues of games because of that (ex: Riot Games and Battlefield 6). I just want to play games man, surely kernels devs could make an api to let apps ask to preserve their memory safety (no write allowed from other programs on the app reserved memory for instance). This would stop this bs quite fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another harem gacha type deal...\nI am in love with dynamic battle system and those artists who work on a visual side of the game with the music creators are chads!! But...\nDropped this game after that healer butterfly girl update on Epic and decided to give this game another chance on Steam and what do we have here? Exact same problems as they were when I played (for me ofc) Rover is a magnet for all girls, it's mandatory for them to flirt with him ALL THE TIME, he's one and only, allmighty, super duper, always wins, never make mistakes and yada yada yada (classic main hero syndrome)\nAnother issue is naked girls, don't even get me started on this! I mean even the female Rover has half the clothes than the male Rover, I  am sick and tired of this and won't support games that deliberately choose to do this. I don't care about gooner's opinions and wont listen to you anyway lol, don't even bother to justify these moves! \nGacha systen is kinda brutal, if you lost that 50/50 chance, welp better luck next time I guess. or pay money, but you know it's a gacha so they are all predatory anyway",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Harshest gatcha I've ever seen, even genshin's gatcha as harsh as it may be is still better. Seems like it is trying to force my hand to spend but I wont because 50/50 losses at high pity are the worst, especially if it's from pure grind. \n\nThe game does not make it easier to grind astrites as well since the highest amount you can get at once is 100 but even then those are 2 to 3 hour quests. To farm more currency faster you need very well built characters and a ton of skill, and also your life because level 90 is required for most of the high paying content and the trial characters are mostly shit.\n\nThe game does not value time spent in it because I started a month ago and for (50(Shaft)+50(gurantee)+20+77+70) for a total of 263 pulls i got 2 banner 5-star resonators 1 signature weapon, yes 70 in and i still dont have the signature. Seeing my friend get everything in 90 pulls hurt my soul. So I refuse to spend money in a game that doesn't value my time.\n\nSo I'll be speed running to lvl 90 skipping everything cause i don't want to hear nothing from characters I won't be getting.\n\nIf you are F2P I wish you the best luck so you'll enjoy the game because this past month I haven't, only reason I'm continuing is cause a friend got extremely lucky and it became his favourite. I'll put my money in HSR cause my time is valued there and as you know...\n\nTIME IS FUCKING MONEY",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’d like to share my honest experience with Wuthering Waves, and unfortunately, it has been far from positive. I approached the game with solid, modern hardware that handles demanding titles without any issues. Yet somehow, Wuthering Waves manages to push my system to the brink before gameplay even begins.\nThe core problem is the extremely resource-heavy file compilation process that the developers decided to run directly from the loading menu. Because of this, my CPU temperature skyrockets, the fans go into overdrive, and the entire system becomes stressed — all during what should be a simple loading sequence. It’s baffling that such a critical and hardware-intensive task is executed in this manner.This isn’t just an inconvenience; it makes the game practically unplayable for me. I genuinely wanted to dive into the world of Wuthering Waves, but instead I’m left monitoring hardware temperatures and worrying about long-term damage. No player should have to choose between enjoying a game and protecting their PC.\nAs it currently stands, I am deeply dissatisfied with the technical state of Wuthering Waves. Until the developers address these optimization issues — especially the unnecessary CPU-heavy compilation step — I cannot recommend the game. It’s a promising title held back by avoidable and potentially harmful design decisions",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game runs even worst than before, there's even more stuttering in the overworld when flying and it crashed my PC trying to close the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No clue if it’s good. All I know is it has an obnoxious amount of unskippable dialogue and cutscenes, so I’m not interested in finding out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Turkish gameplay\nChing Chong Ping Pong Story\n\n100 Pulls - 1 Shota shit character -> Deleted account \n\nGG WP",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gameplay is fun. thats it. theres nothing worth caring about in the way of story or characters, the english voice acting is some of the worst ive ever heard (who thought it was a good idea to hire the woman who voiced yangyang? shes awful). i only even started playing this again after the first time i tried it is because i heard Jennifer English voiced someone and i wanted to see that. this game has nothing going for it aside from sex appeal (which, without any other redeeming qualities, is just the hallmark of a lazy, boring game) and gameplay (which is basic af anyway). go play zenless or something, it has better gameplay, actually good VAs, and theres a story worth paying any attention to.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played through Epic Games.\nThe game turned into typical [gay]shit impact, became another harem game, with 10 female characters for every 1 male character, not to mention the chances of getting anything from the banners. It ended with a tower defense-style event, where there is discord that simply cancels out all your defenses, which is completely absurd.\nThe game held on with its combat system and the vibe of the locations, but no more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't work on linux.\n\nYou know, anti cheats never anti cheats, only blocks players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat system is clunky. The camera is jank. The game performance is subpar. The story has way too much dialogue and talking and talking and talking and talking and talking and none of the words make sense to an actual human being. Its all just word salad. Then the Gacha is horrible. But that doesn't matter because the combat is so bad. Like good luck hitting the T key during combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to play this game but Tencent cannot Mine Crypto on my Linux machine so the Game shuts down when i click on the Waifu at the startup screen and tells me the AntiCheat has blocked access.\n\nIf they remove the Tencent Anti Cheat, then i will play otherwise i will continue to Play Zenless Zone Zero because their Anti Cheat works for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ll admit upfront that I barely played this game but honestly, it didn’t take long to see that it was a disappointment. At least it only cost me a bit of time and not any of my money.\n\nThe small portion of the story I experienced was completely forgettable and painfully generic. Nothing about it managed to spark even the slightest bit of interest.\n\nThe combat doesn’t do the game any favors either. It’s extremely simplistic and becomes boring almost immediately. The enemies? I’ve seen hamsters that were more threatening than these glorified target dummies. Maybe they really were just tutorial fodder, and under other circumstances I would have pushed on for another hour but that’s not where the real problem lies.\n\nWhat truly put me off was discovering that you can’t meaningfully create or customize your character. One of the things I enjoy most in games is shaping my own character and defining my own playstyle. Here, you’re stuck swinging a dull sword with floaty, unimpressive anime-style moves that have no weight or impact. It’s incredibly underwhelming.\n\nYes, you can supposedly adjust your playstyle through the other characters in your party, but I found them annoying, and I have zero interest in controlling pre-made characters. If I wanted that, I’d play Mortal Kombat or something similar.\n\nAll in all, this game failed to impress, amuse, or interest me in any substantial way. Harsh criticism, I know, especially considering I didn’t give it much time to shine, but my time is limited, and unfortunately, so is this game’s potential.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ALT+F4 and uninstalled the second the game told me to switch to a different character, im so sick of these stupid RPG games where you have multiple characters and need to switch between them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Idk man I tried but ts took longer to get running than it took to download. Uninteresting and bland. Visually stunning when you're standing still but crashed on me four times and never stayed at a stable framerate or ping no matter what settings changes I used.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont waste your time or money. Game will lure you with some early luck only to make it very hard for you to get the characters you want without spending alot of money later on as your luck will become terrible once you start spending some money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Couldn't get into it. All those Chinese names were so outlandish to me, it got confusing fast with all the characters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GAME KONTOL SETIAP GACHA B5 LOSE 50/50 HARD PTY MULU BANGSATTTT NGENTOT ANAK DAJJAL",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "100% of the npcs are sexualized characters with boring dialogue",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The anti-Cheat is completley incompatible with Linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gameplay is good but story haremslop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My solo RPG game is unplayable with a 160ms ping and a required remote server.  Very unhappy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasted 50 minutes of my life on a loading screen. I don't want to be harsh but i don't see an alternative. The game just doesn't work on my pc, and I don't have terrible specs. I had to restart it several times, and one of those times was because it had a pop up menu that could not be closed without a restart. I'd be willing to try this game on pc again if they made the game snappier and actually work. I had my settings on Performance btw and never made it to the actual game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "STOP MAKING ME RESTART GAME EVERY DAY FOR STUPID SMALL UPDATES ITS ANNOYING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time playing WuWa, maybe during 1.X to 2.4 it was a pretty good game, but since then it is just truly a gacha with barely any game content. \n\nMy experience playing this game since 2.5 (Half a year since then) started has only been grind, pull and then discard the pulled Resonator, repeat. Barely used ever again, because there is really not much content to do with those pulled Resonator. \n\nNote; Play WuWa only as a gacha for gambling addiction, don't expect it to be something you want to play as a game. \n\nThank you sincerely for reading and as a day 1 player I have decided to leave WuWa and be warnt newcomers do not be trapped in the gacha loop. (Grind, Pull, Discard. REPEAT)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "t-rash game. cant skip intro cutscene. very annoying. cant even get the new charge blade girl. idc much about limit breaking the character. i just want to play the new charge blade girl and the game dont want to give it to me so fthis game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Early game: do some fun stuff\r\nEnd game: Log in, dailies, log out. \r\nGame has good combat but the endgame content is ahh, and the combat events are rarely good. What is wrong with the dev team, like, why won't they focus more on making good and challenging combat content? Oh yeah, gacha game. They cater to casuals. Oh well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game looks awesome and the story is pretty good, but the ray tracing on pc is very unstable. I keep getting dxgi device hung crashes and have tried everything to fix it but it just would not go away. Ray tracing looks really nice in this game but it needs some improvements on stability.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}