{
  "positive": [
    {
      "review": "this game would be absolute peak if it had an actual save option, so i wouldnt have to commit 2+ hours in one sitting to a climb. if you are concerned about the save option diminishing the accomplishment of beating the game, then just auto delete the save option the moment you continue on it. this is the main reason why i dont play this game more often even tho id love to, especially when wanting to play with friends its very challenging to find enough time to play this game together.",
      "voted_up": true,
      "votes_helpful": 443
    },
    {
      "review": "PEAK was a peak experience indeed. \n\nWhen I first started, I hopped into the official Discord to find a group. Most runs were hit or miss, but eventually I teamed up with this guy named 'Dex.' We managed to get our first win together, and since it was a first win for both of us, we knew we had to keep going.\n\nWe pushed through until around Ascent 3 or 4 before calling it a night. Little did I know, Dex would become a regular. Over the next week, we grinded the badges and ascents, spending nearly 30 hours together, and finally beat Ascent 7. \n\nThis dude stuck with me all the way like a mad lad.\n\nDex, if you see this, you're a real one.\n\n10/10 would random queue again.",
      "voted_up": true,
      "votes_helpful": 114
    },
    {
      "review": "I once nearly fell off a tall mountain during a trip, and my friend pulled me back at the very last second. Ever since that day, seeing a hand reaching out from above fills me with a strange mix of trust, fear, and adrenaline. Maybe he has forgotten about it by now, but for me it was a moment where I truly believed my life was ending. I’m still grateful he was there, and I’ll never forget what he did for me.\n\nPEAK brought that feeling back. It captures the fear of slipping, the comfort of teamwork, and that rare moment when you know someone is there for you. A simple idea delivered with beautiful clarity.",
      "voted_up": true,
      "votes_helpful": 363
    },
    {
      "review": "I bought PEAK so we could become a team. Now we're a team, that screams at each other from different ledges",
      "voted_up": true,
      "votes_helpful": 53
    },
    {
      "review": "Very funny and challenging co-op game about climbing a mountains. PEAK gaming, ladies and gentlemen.",
      "voted_up": true,
      "votes_helpful": 51
    },
    {
      "review": "I'm in love with PEAK. Nearly played it since release and always looking forward to seeing updates with new maps, achievements or mechanics. \n\nIt's obvious how much time and effort \"Team PEAK\" has put into their game. The devs are very community-oriented, respond to player suggestions and improvements and fix minor bugs and errors within a few days. I haven't seen any bug that negatively affected the gameplay which hasn't already been removed, except the well-known backpack glitch. Backpacks ragdolling under the map as soon as we put 'em down. Very rare, but still happens. (Mostly in the tomb, when the entrance is nearly fully covered by sandstone and you're putting down a backpack to get past a little hole, you got a huge chance you'll never see that lil baggy again. Since the tomb is optional, not that dramatic, but still room for improvement.)\n\nAnother thing I'd love to see is the ability to create lobbies larger than 4 players without the need for mods. I personally love to use mods in general, but since PEAK is also a very family-friendly game and many people don't like using mods, I'd like to see the option to create bigger lobbies without them. Especially because we all know that new game updates + old mod versions aren't the best friends, and PEAK literally gets updated nearly every week.\n\nAll in all, PEAK is an incredibly funny game and I can highly recommend it to anyone who's searching for a quirky alternation with friends and randoms, or an adventurous, almost meditative single-player experience. Not to unmention the various ascents (difficulties). They force you to try different packing methods, adapt your typical climbing tactics, use new paths to reach the peak, and in the end, get another cool cosmetic as reward for each ascent, which also definitely increases the replayability.\n\n[b]No matter if you just wanna reach the Peak a few times with your friends, or go all in for achievement hunting and the full adventure trip, it's worth the price with or without a discount.[/b]",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Peak is one of those games that looks super simple but ends up being way more addictive than you expect. It’s chill, cute, and really easy to sink time into without even noticing.\n\nRuns perfectly fine for me, no issues at all. Just smooth and relaxing.\n\nIt’s also way more fun with friends — everything gets dumber and funnier, and it makes the whole game feel even better.\n\nHonestly a really nice little game. Fun, comfy, and super easy to recommend.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "A little game about climbing a mountain together with friends - what a sweet game and slightly chaotic!\n\nYou start out thinking it’s calm and peaceful, and a few minutes later someone is yelling for help while another slips off the edge in slow motion. I’ve rarely had so many funny and random moments in a game before.\n\nRegular updates and achievements keep it fresh, and the difficulty on normal feels just right, enough challenge to keep you focused, but not enough to make you throw your controller. If you want more, harder challenges unlock as you progress.\n\nFor this price, it’s an easy recommendation. Cozy, unpredictable, and great fun with friends. Peak really reaches new heights!",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Fun game with friends. Maddening at times, but fun!",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "⭐⭐⭐⭐⭐\n\nThis game is pretty much perfect. It's mountain climbing with friends. A very simple concept but with tons of different items with unique effects and uses, multiple biomes and a map that changes every 24 hours, it's endless amounts of fun. There is just something so satisfying about finding your way up the mountain even in times when it may have seemed there was nowhere to go. Some of my most memorable and funny gaming moments this year happened on Peak with the boys and I can't wait to see what gets added in the future.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Best multiplayer game of the year, what group games should be (fun, unserious, chaotic :p)",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "PEAK taught me that gravity is undefeated, but the laughs and triumphs shared with friends make every fall worthwhile. Summit or stumble, each climb becomes a joyful journey alongside fellow adventurers.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game is peak. But seriously, it's funny climbing game you should buy. I have no regrets of buying it. ⛰\n\nShort story long: there are certain biomes with their rules like rain that slows you or sun that burns you but everyday map changes, it's RNG made paths, so every day you have a new rocks to climb. Also, cool badges and cosmetic system that allows you to show off with small challenges that you did as these badges shown on your character's belt and you get cosmetic item for it.\n\nIt looks simply chilly but it's intense. I'm fully focused on the run if I'm alive, if I'm a ghost I  can enjoy my tea and rest, letting my friends to climb up to resurrect me or at least, their attempts of climbing up. It's truly better (and funnier)  with friends.\n\nI think it's not challenging for regular PCs at all. Visual style of this game let it run fine for me on medium settings. I've had lagging issues one time but that was when the game just came out on Steam so it's fine. \n\nIn the end, I bought it  with a thought that I'd play it for a few times and that's it, but I want to go back and play more. I was surprised and not disappointed with this game. Definitely a good one for co-op playing.\n9/10 would climb again soon 🏔",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Peak ended up being the most fun I had this year. It’s an easy game to pick up, but somehow becomes ten times funnier when you play it with friends those chaotic moments and shared laughs just make it unforgettable.\r\n\r\nOne of my favorite parts is collecting the scout-style badges (aka achievements). They add this extra layer of motivation that keeps you coming back for “just one more.” Whether you're casually messing around or seriously trying to earn every badge, Peak nails that perfect blend of lighthearted fun and satisfying progression.\r\n\r\nIf you want something simple, social, and surprisingly addictive, this is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The game is so good that it reminded me of my Celeste journey...\r\nBoth are fun and engaging in their own right, though I will say my one gripe with PEAK is that Roots is very painful to go through.\r\nOther than that, I had a great time playing it, and I encourage others to get it too! ...just make sure you get a friend or two into it too",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game have me questioned friendships 10/10s would ruin my friendships again\n\nGotta win best multiplayer this year",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Didn't really think I'd be into it much until I got gifted the game.\nIt's really great solo as well!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[i]PEAK[/i] is a mountaineering, survival platformer. Balancing resources, helping one another in co-op, and taking risks to ascend up towards your goal is all part of the fun. There is a lot of artistry and effort put into this wonderful game with its straightforward objective to reach the top. While the game is designed with multiplayer in mind, it is also incredibly good even when trekking it alone.\n\nThe game is well crafted visually in its daily random map generation and character designs. Biomes have distinct aesthetics which come with their own unique set of hazards. They challenge players with different kinds of environmental obstacles -- including various fauna -- and weather conditions. The terrain for each biome never look out of place due to the excellent use of shadows and lighting, and objects and flora are seamlessly integrated into the environment. In addition, the sound design really lends itself to the tone and atmosphere of each biome in its ambience. The music, or lack thereof at times, also emphasizes the feelings of isolation (especially in solo expeditions) or the pressure to continually move upwards and onwards or face dire consequences. A lot of care was also put into characters as well with player characters having charming and expressive designs. Their colorful, cartoony look makes players easy to spot from the environment. The effort put into making visible responses for various player actions and gameplay movements make things feel more natural in co-op sessions. Mouths that move while using proximity chat and eyes that follow you when you're close are nice touches. The addition of emotes and the ability to point things out for everyone are appreciated.\n\nAs a survival platformer, the game can be unforgiving. You and your group's pathfinding skills will be put to the test as you ascend towards the peak. Whether going in alone with no others to rely on or as part of a group of friends (and setting aside any hijinks between players), balancing cautiousness and speed will be essential and you must use items and tools as efficiently as possible and take risks when necessary in order to proceed. The goal of reaching the summit can be a puzzle all on its own while minimizing injuries but there are also various ways how each biome can throw debuffs at you with its challenges such as hunger or poison. They will impede a player's stamina which makes climbing more difficult. In later difficulties the game not only makes climbing harder to do, but it also adds pressure on players with a long-term doom counter that forces players to race against time as well or die. Yes, dying sucks but the variety and ways players can overcome challenges keeps things interesting. In a group it's best to work together, share resources, and help each other by literally lending a helping hand to pull friends up. But if someone does die and have not yet been revived, then it's not the end for them. Dead players will return as ghosts to haunt your friends. Though ideally they'll help their living counterparts by pointing out the best routes or items. (Who packs a [i]cannon[/i] in their luggage anyway? On a side note though, I love how the game incorporates the tutorial by way of minigames and the player lobby seamlessly into the game's world. I also love how Steam achievements are directly tied to the badges on a player character's sash.) Thankfully, the game eases players into the world of [i]PEAK[/i] with smaller challenges before the bigger, do-or-die challenges found later. Players always start on the \"Shore\" after waking from the plane crash to get them rolling. Reaching the end of a biome allows players to recuperate a bit and revive any dead party members before pressing on until the players ultimately reach \"The Kiln\", the final area before the peak, which requires players to use all their honed skills and items to overcome.\n\n[i]PEAK[/i] is an excellently designed game for both single player and multiplayer. The game makes players think about their pathfinding and how to use any found tools in the best possible way. The game can be difficult and can sometimes be frustrating, but when you or your group finally reach the peak there's always a sense of relief and joy. And always remember \"Rule 0\", my friends, [b]never abandon a friend in need.[/b]\n\n* [i]PEAK[/i] was gifted to me by a friend. Thanks buddy! I'll make sure to always pull you up (or carry your body) if I can help it. :D Thank you for the privilege of your time by reading my review. All the best and cheers!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I open the game\nI call two friends\nWe enter a mountain\nOne of them falls off the mountain into the first biome\nWe hear him scream\nThe scream gets quieter until it's silent\nHe died\nThe third friend advances along a completely opposite path from mine\nMy screen starts to go black\nA giant creature appears\nIt throws me off the mountain like a sack of sh!t\nThe friend who died sees my fall live, like a ghost\nStarts laughing in my face\nI die\nThe third friend gets close to the end\nHe runs out of energy and falls off the mountain\nHe died too\n\nIt's Peak! *crying*",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "TL;DR: Fun and colourful but sometimes frustrating coop game about climbing and finding your way through worlds that change daily. This review is written from a \"pre-finished\" viewpoint (at the time of this review, I haven't played through the whole game).\n\nFrom Team PEAK and the publishers Aggro Crab and Landfall comes PEAK, a coop climbing/find your way game for up to four simulatenous players.\n\nThe premise of the game is that you and your fellow players board a plane and tragedy strikes. The plane crashes and you're stranded on some unknown island. Suddenly, you're fighting for your survival and trying to reach civilization once again.\nNot only do you have to scale difficult terrain, you also have to find some food to keep going. The better you're fed, the more stamina you have to tackle your challenges. And on top of that - at least with the Roots update - you will also encounter enemy-type creatures that are out to get you. And then there's some additional \"natural\" obstacles and conditions like heavy wind which will hinder your progress, so you'll have to learn how to deal with that. Also... you can slip on some objects, so watch your step!\n\nYou have to get to know your surroundings, learn which plants might be safe to eat or which herb does help in certain situations. There's some help if you keep your eyes peeled: you can find some written tips to help you understand what's what. You can also find items that may help you on your way through the game - or some that might just be cluttering your inventory, depending on your playstyle. Think of ropes you can use to help your fellow players reach areas they might not be able to climb anymore because they are hurt or out of stamina. Or think of noisy little trumpets you can use to annoy your friends. \"Ah, there's an inventory?\" you might ask. Yes. But it is limited to three slots plus a backpack. And you have to search for those backpacks, since they're not too easy to come by.\n\nThe graphics are colourful, the player characters being depicted in a cartoonish style with some customisation options like diverse facial expressions or different clothing (some of which needs to be unlocked by playing the game). The areas you reach are kind of themed, starting you in a rocky beach area and encountering others like a huge mushroom forest (this came in with the roots update) or lava areas - among others. Each \"biome\" has its own difficulties and quirks you have to\nmanage.\n\nI have to say the music seems relaxing most of the time and since the situations can get a bit tense that's very welcome. As I use to say: if the sounds don't feel out of place for you, they did a good job. And as of now I don't feel that the sound effects are misplaced at all. Also I didn't notice any \"too loud/too silent\"-type problems. Aaaaaand of course the game has microphone capabilities, so... just mute your discord if you want to use the in-game voice chat options. This is fun because sometimes you get lost or separated and can listen for the voices of your fellow players in the distance. Or listen to their screams when they plummet to their deaths.\nYes, there is a \"death mechanic\". Players who suffered heavy injuries will KO and be able to follow the other still alive players around and talk to them, so you're not completely out of the game. If your friends reach certain areas you can get revived and continue the stressful journey.\n\nEarlier I wrote that the game can get \"frustrating\". Yeah, I've stood in front of some walls/mountains and asked myself: \"How? How in the hell should this be possible?\". And I'm not sure if every scenario is \"doable\", but that's kind of the design I guess.\nYou will fall. You will reach dead ends. There will be environmental hazards that will neutralize you at the worst timing possible. If you can live with that, you're fine.\n\nAt the time of this review, the devs still care for the game, putting out bug fixes and additions to the game. We all like that, don't we? For you achievement hunters: currently there are 54 steam achievements you can work towards and none of those seem too over the top, although a lot of them are circumstancial.\n\nThe friends I'm playing with and me still have to finish the game, so I don't know everything yet. There's still a lot for us to find out about the game so I guess this review isn't too \"spoilery\".\n\nThanks for reading,\nOssel\n\nPS: I might edit this review if there should be any questions or if I should feel like I forgot to mention something.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Кинул в друга кокос, он прилетел ему в голову, и откинул на 20 метров вниз. Обожаю",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I’m scared of heights, so playing PEAK is honestly funny. every time I fall off the mountain I’m just screaming while my friends laugh at me.\n\nthe game is super cute, fun, and the style is really unique. it gives you that little mix of fear and trust when you’re trying not to fall and your friends are trying to save you.\n\ni do wish we could have bigger lobbies without needing mods, like 5 or 6 people would make it even better. and a save feature would be really nice too, so you don’t have to sit there for 5+ hours doing one climb in a single run.\n\noverall, it’s a really fun game to play with friends, even if you’re scared of heights like me. such a PEAK game fr.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Peak: A Brilliantly Absurd Alpine Tragedy\n★★★★★ (5/5)\n\nPeak is a masterclass in combining punishing cooperative survival with slapstick comedy. This physics-based climbing game puts you in the boots of a stranded nature scout who must scale a procedurally generated mountain or die trying. And dying is very much part of the experience.\n\nThe Climb That Breaks Friendships\nThe game's greatest strength lies in its commitment to both calculated strategy and chaotic mishaps. You'll find yourself ascending hostile terrain with up to three other players, ostensibly working together to reach the summit and call for rescue. The cartoonish physics, proximity voice chat, and deliberately punishing stamina system create a brilliant framework for emergent comedy that never feels forced.\n\nThe survival mechanics are deliciously challenging, requiring genuine teamwork and constant risk assessment. Whether you're gambling on poisonous mushrooms for stamina buffs, managing your limited inventory of climbing gear, or trying to revive a teammate who slipped on a jellyfish, every decision feels like a high-stakes gamble. The friendly sabotage opportunities add both tension and hilarious moments of accidental (or intentional) betrayal, perfectly fitting the game's slapstick tone.\n\nDaily Disasters\nWhat sets Peak apart is how its procedurally generated mountain resets every 24 hours, ensuring no two climbs feel identical. From the rocky Shore to the hazard-rich Tropics, through the frostbitten Alpine zones to the volatile Caldera and finally the molten Kiln, each biome introduces fresh challenges while maintaining the game's brilliantly absurd tone.\n\nThe progression system keeps you engaged through a badge collection system and the intrinsic motivation of mastering increasingly difficult terrain. Each new piece of equipment—ropes, climbing spikes, pitons—opens up tactical possibilities, though the limited inventory forces brutal choices that keep gameplay tense even after many hours.\n\nHighlights\nExceptional cooperative gameplay that rewards coordination\nBrilliant physics-based comedy and emergent moments\nChallenging stamina management and risk-reward decisions\nDaily mountain variations keeping content fresh\nOutstanding slapstick physics and cartoon-like movement\nProximity voice chat enhancing sound immersion\n\nMinor Drawbacks\nTechnical bugs and lag can occasionally ruin runs\nCan be punishingly difficult for solo players\nLimited content variety after extended play sessions\n\nPeak is a rare gem that succeeds both as a comedy generator and as a mechanically demanding survival climber. It's a must-play for anyone who enjoys cooperative gaming, physics-based chaos, or just really likes failing spectacularly with friends on a mountain, one poisonous mushroom at a time.\n\n🏔️",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "really fun game, just add more maps and stuff like environment objects enemies and so on, will be much cooler, great game to play with friends ( also if they increase the player limit it would be really nice :)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun coop or solo game, better coop as it's funny seeing your friends' blorbos wobbling around. I love that the devs keep updating the game and adding more to it, and the achievements feel rewarding in game and not just out of it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really unique and a ton of fun. It truly captures the essence of what gaming is meant to be. The story behind how this game was developed is also genuinely great. The gaming industry needs more of this type of mindset. Gather your friends and enjoy. Buy them copies if you have to, it's well worth it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Sometimes I just open the game and let the airport lobby music play",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I really enjoyed playing PEAK with my friends. The visuals are beautiful, and the co op gameplay makes every moment fun. Helping each other climb and laughing at the slips creates a great experience. Its a simple but very enjoyable game, especially with friends <3",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "PEAK Comedy am i right?\r\nlately indie games are producing top tier games such as  this one PEAK.\r\nYou climb in different biomes contunie to advance further as it becomes harder,\r\nThere are some blocks along the way, spiders, poison, hunger, lack of stamina and teammate that wants you dead...\r\nThis is fun a game good co-op experience with friends i deff will suggest this to group of friends if they dont wanna stay friends.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "لعبة تضحك مرة واستمتعنا فيها أكثر مما توقعنا، تفكرها لعبة تسلق لطيفة؟ أبد وانت تتسلق فجأة تشطفك جثة خويك طايحة من علو 200 متر، فكرة اللعبة تهربون من الجزيرة وبعد كم محاولة تبدأون تعدون المناطق بسهولة ، تصميم العالم رهيب ويعطي جو مغامرة\nأكثر لحظة ما أنساها: وقفنا كلنا فوق صخرة صغيرة متحاشرين ونشوف الصخور تتساقط حولنا داخل الحمم البركانية ... بعدها بدأنا نطيح واحد ورا الثاني وانتهت بخوينا وهو يغرق بالحمم ببطء و يطلع بوق صغير من شنطته عزف معزوفته الأخيرة\n⭐4\\5",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "What will happen if you bring yourself and your other 3 brain damaged friends on the mission to reach the peak?\n\nJokes aside, dev should give players an option to opt out global seed and use random localized seed so the host doesn't need to wait for the global seed to change and play it with their chosen seed.\n\nOtherwise it's a good game (if you have friends), 9/10 Roots is (still) a garbage biome, right behind Mesa.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "PEAK is a chaotic, physics-based co-op climbing game where you and up to three friends attempt to scale a dangerous mountain on a mysterious island. Originally launching with five regions, it now features seven, and their layouts shift daily to keep every run fresh and replayable. PEAK is enjoyable as a solo adventure, but its best moments are undeniably shared with others—and with mods, you can even increase the friend limit without disrupting the game’s balance. PEAK is also fully playable on the Steam Deck, making it accessible and perfect for those who want to climb a mountain from the comfort of their bed.\n\nThe experience is made even better by its excellent dev team, who stay actively engaged with the community and consistently fine-tune the game without sacrificing the fun. I really look forward to their updates and what more they'll add on as the game ages.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Huge rocks, tough climbs. Fun to play in co-op, really great with friends. Some folks fall all the way down - very sad. But when you make it to the top, it's a massive win.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game can be very fun with the right friends, that is, friends who are naturally funny and laugh and scream whenever the situation calls for it.\n\nIn single-player mode, however, it's very challenging. I'm a bit of a newbie so far, but I have trouble going past the second stage of any map alone. Mostly because I have no idea where to go and there's loads of environmental variables that just make your path harder. I also tend to fall a lot, so there's that.\n\nI really like the design, colours and overall feel of the game. Almost anything is cute here.\n\nBe aware that the launch option can really impact the graphics of the game, Initially, I couldn't see that much of the game on my screen (maybe 30-40%) when using the DX12 or DX11 options, although I still played it like that because I thought the problem was on my end (my PC isn't exactly a gaming one). But selecting Vulkan completely fixed the issue.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I still have yet to summit the mountain of Peak, but I hope that will not remain true into 2026. Call Peak what you want: streamer bait, friend slop, etc. That doesn't  the fact that this is a great game. The climbing mechanic isn't super robust but it's fleshed out enough to make for an interesting core gameplay loop. The environments are varied and change up gameplay and the devs have been consistently adding new environments, items, and enemies.\n\nIt's fun to hear a friend fall to their death. It's fun to help a friend up a cliffside. It's fun to watch a friend be chased by a zombie. It's just fun",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "peak is really good if you have friends, if you do not have friends, add me on steam and we wont play any games together but we'll see each other on steam awkwardly for the next 20 years w/o talking.   it'll be nice.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I... ate them all.... I made it to the peak but at what cost..... I have lost everyone I loved because of this game.....",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Just absolutely peak. Fun with friends, fun alone, just fun! The devs seem to really care and listen to the community and keep adding awesome stuffs! 10/10 Would Peak Again",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "PEAK on Steam is a shining example of what indie co-op gaming can be: simple to pick up, but with real depth and risk. It’s not just a climb — it’s a survival story, a shared experience, and a laugh-inducing mess when things go wrong. If you’ve got a few friends (or don’t mind trying to find some), PEAK is absolutely worth it. Even solo, it’s a solid ride — though the magic truly kicks in when you’re all trying to help each other not fall.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you want to go for an Adventure then this game is for you... But, game feels good when you play with your friends/team... Biggest problem of this game is you have to complete the whole adventure in one sitting.. there no save the game option available...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Writing this as a sketch for the Steam award. But I like the game, it's tense and meaningfully encourages cooperation while not being a total bore alone. For 7:dollars you get a much fresher and mechanically sound (despite some bugs) experience than a lot of the AAA coop games.\n\nRoots are bullsh*t though",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is undoubtably part of the \"friendslop\" genre, but it is the best of them. Some might even say the Peak of them. It is a very enjoyable game, and with the map changing daily, as well as multiple new biomes, it has immense replay potential. I have spent a not small amount of time playing this game with my friends, and it is often the first I recommend when we're trying to decide what to play. Ascent 7 is Hell though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Start new game, cook coconut, start climbing, fall, be too damaged to climb, die. Start new game. 10/10 would climb again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The perfect multiplayer game, that just happens to have single player functionality. It asks of you one big thing, and that's to reach the PEAK. It's *almost perfect.\r\n\r\n* Some bugs will obliterate the experience on a run by run basis, they are uncommon, but not rare or exceedingly rare.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun to play with friends or on your own. Just...don't accidentally abandon your friends when they stay in once place to talk (for way too long) because you will be punished. Also...watch out for spiders :( they're my weakness now",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "+ Regular updates\n+ Good team play\n-+ Entertainment for a few hours, but no more\n- Controls are sometimes imprecise and annoying to use\n\nI can recommend this game if you have other people to play with. The price/performance ratio is good, but it really shouldn't be any more expensive, as there are clearly more well-rounded co-op games with more content\n\n\n(DE:\n+ regelmäßige Updates\n+ gutes Teamspiel\n-+ Unterhaltung für ein paar Stunden, aber auch nicht mehr\n- Steuerung immer mal wieder ungenau und nervig zu handhaben\n\nIch kann das Spiel empfehlen, wenn man andere Leute zum Zusammenspielen hat. Preis/Leistung stimmt, aber teurer dürfe es wirklich nicht sein, da es eindeutig rundere Koop-Spiele gibt mit mehr Inhalt.)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is incredibly catchy, with the style, the gamplay or even the difficulty!\nIf you have a bit of time and some friends and you want to scream at them while falling down a mountain you climbed for the last 30 minutes, this is the game for you!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game so much and am enjoying all the updates as they continue to grow the gaming experience. The graphics are adorable, gameplay is pretty straightforward, and the replay ability is peak (๑>•̀๑) I only wish there was a public matchmaking option already, since it can be hard to find enough friends to play with at one time, and I don't really enjoy playing alone. Fingers crossed this feature may be added in the future!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "very niceu game to play with friends but you can also choose THE MANLY ROUTE and be better than everyone (me the best climber eu) RELAAAAAAAAXXXXXXXXX",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Peak combines perfectly the genre of platforming and survival.\n\nAlmost every item has some utility, stages are challenging and varied, achievements feel great to get, the customization of the characters is simple and pretty (and all in all the game's aesthetics are very cute) and developers always make sure to communicate clear with their userbase.\n\nIn addition you can either go bollocks with your friends online or have fun alone. I tried both experiences and had fun in both of those.\n\nExceptionally good, should  try the crab game as well :p",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun co-op game, kinda relaxing at times too.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An excellent cooperative experience that embodies the fun of discovery while also providing intense moments of stress and worry. Trial and error teaches you how to play while creativity and taking risks rewards you with excitement and relief. Difficulty level setting allows casual and hardcore players to both enjoy the game in different ways. Daily map rotation is unique and compelling. Every content patch has made the game better and added so much. The achievements are all pretty fair and can be used as motivation to play!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's been said a million times but I'll say it again because it is true. This game is PEAK! The perfect balance of chill and relax but also lock-in and focus on the challenge at hand. Either solo or with friends. Though it is a lot more fun with friends, not saying it can't be fun alone however. I have all of the achievements (as of the roots update) and still enjoying every bit of it. Highly recommended to any player to at least try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "cute visual style and sounds. not too repetitive. lots of ways to challenge yourself all the while remaining comical as hell, especially with friends. interesting lobby and social elements. love the decorative sash which shows off your achievements and ability to complete harder runs. bing bong arachnophobia mode is just so tea. items are mechanically interesting and the different biomes/daily seeds keep the game interesting and re-playable. constant bug fixes and nerfs show that the devs care.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely one of the more replay-able co-op multiplayer games. The devs have been doing a wonderful job giving us consistent updates, new maps, and new items and features. Really fun if you have a good group of friends to play with. Hoping they get the recognition they deserve!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Silly little funny game that deserves its praise. I think I found myself laughing to tears more than once while playing with friends. TLDR: Proximity chat is the greatest thing ever created.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it's PEAKKKK! all jokes aside, this game is one of my absolute favorite comfort games of this year! (it got several nominations from me) me and my bestie got it when it first came out and it has been a pleasure of watching it evolve over the few months it has been released to where it is now! and i only hope it continues to get better from here, cause it is so much fun to play solo duo or a full squad :) also i don't normally write reviews so it means it's THAT good hehe!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A simple but flawlessly executed concept. I had a blast playing this with my friends this year, and no matter how many times I've climbed this dang mountain, every run we encounter something that makes us giggle with joy, or scream with frustration. A perfect group game for casuals and hardcore players alike, and at only $7 it's honestly a steal. I'm rooting for this game to win all the 2025 best multiplayer awards.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For a co-op game, PEAK offers a great single player experience, especially after the ROOTS update and the addition of the checkpoint flag. So if you don't have any friends (or feel too anxious to find groups on a forum) and hesitate checking PEAK out, GO FOR IT!\nThe only issue i have with the game is that because of the biome rotation and a new map every day it can be challenging to get some achievements. It would be nice if the developers added a permanent map or two that would allow you to save a lot of time and nerves. Also, an indicator of which biomes to expect on today's map would be nice as well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Got a little bit peckish ended up eating a friend alive. Awesome game with friends would eat em again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "PEAK is a great multiplayer game with your friends. This indie game deserves the \"Better with Friends Award\" for The Steam Awards. Possibly Game Of The Year Award as well. Simple to play, yet addictive and fun for a great price. Highly recommended! \n\nWorks flawlessly on Steam Deck.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very cute mountaineering game with plenty of fun mini-challenges to complete whenever convenient (with or without friends) and character customization items to collect. It's also just a very easy game to launch and play. The inherent randomization makes unexpected deaths less frustrating (just blame the seed!) and each trip reasonably unique (with a nice array of tools and snacks to choose from). And the devs keep updating it, so if you take a break you'll find upon your return something new to try (or work towards). Still, it's worth keeping in mind that PEAK is not the most well optimized thing on Steam (with a lot of massive particle explosions that never fail to increase the temperature in my room by at least a few degrees). If you are looking for a game to play with friends or something to play alone with YouTube up on a second monitor (or music in your ears) or just an application you can utilize as a convenient space heater through the long winters, PEAK should more than suffice. If you don't mind sometimes meanly generated maps (with some annoying biome obstacles, like harsh winds and cacti) and can appreciate the simple but addictive process of holding down your mouse button to carve a path through the noise, you might even enjoy yourself!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My wife hates this game. I truly love it. Both game and my wife's hatred towards it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "8.5/10 \r\n\r\ncute, fun game to play with friends, whether its for the general experience or for the badge hunting! the updates keep me wanting to play more to see what's new, and it feels more long-term than expected for co-op games of the similar kind :D",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really fun game if you’re not playing with your wife who prefers to become a cannibal for an achievement instead of playing with me >:(\n(still love the game)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "cute multiplayer climbing game. hearing a loved one hurl off a mountain to thier demise is a expiriance you wont forget",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm getting over It but without Bennett Foddy, Instead there are voices and glimpses of my past",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "PEAK is a cooperative climbing adventure where you and up to three fellow scouts attempt to conquer a massive, ever-changing mountain. Blending physics-based movement with light survival elements, the game creates a mix of chaos, tension, and unexpected comedy. From scrambling up cliffs to scavenging strange food and yelling at your friends through voice chat, every climb becomes its own story.\n\n[b] Summary [/b]\nAfter your scout troop becomes stranded on a mysterious island after a plane crash, you awaken at the mountain’s base with only minimal gear and questionable rations. Ahead of you lies a towering summit shrouded in fog, divided into four distinct biomes—each more unpredictable than the last. With stamina dwindling, hazards lurking, and the environment shifting daily, you and your fellow scouts must climb, slip, fall, laugh, and improvise your way toward the Peak.\n\n[b] Overall [/b]\nPEAK is charming and chaotic. The physics-driven climbing feels tactile and fun, especially when paired with friends who can rescue or sabotage you and daily rotating mountain layout help keep the game experience fresh. Though the survival mechanics are intentionally light and solo play can feel tougher, the game delivers a memorable co-op journey packed with emergent moments and shared laughter. For its price, PEAK is absolutely worth it.\n\nRating: 10/10\n\n[url=https://store.steampowered.com/curator/44706088/] [Follow Curator] [/url]\n\n[url=https://steamcommunity.com/groups/Grand_Frontier] [Steam Group]  [/url]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i'm not sure if this game made me wanna reparent my friends and guide them through the map or throw them into the pits of hell because they are not as good as me. or that i'm not as good as them. or maybe we all just suck. but hey, at least we can eat each other!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played for about 6 hours so far and I’m really enjoying Peak, especially when playing with friends. It’s fun and engaging, but the difficulty can spike pretty hard at times, making some parts feel tougher than expected. Still, the challenge keeps it interesting, and I’m keen to keep improving as I play more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's so simple but so good, the characters faces and movements are so funny that me and my friends already made a lot of beautiful screenshots",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Peak is a thrilling co-op climbing adventure that combines teamwork, challenge, and fun. Every climb feels unique thanks to the daily-changing maps, and the sense of achievement when reaching the summit is unforgettable. Highly recommended for anyone who loves cooperative survival games!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really funny to play with friends and alots of golden laugh, trust me :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Peak is one of the best games to just play with a group of friends and constantly burst out into laughter because of all the chaos going on constantly. The game plays amazingly and certainly requires some skill. But the big variety of items help a lot along the way to the top. They are constantly updating the game too with new area's items and more. And you can feel the passion for the game. For this low of a price it is definitively a must have for friend group game nights!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i really enjoyed this game, especially when playing with my friends. it’s simple, fun, and kinda addictive XD definitely worth trying",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is Peak gameplay.\r\n\r\nFirst time playing we were struggling really bad at a certain point and I was starving to death, here I am staring at a cooked chicken standing right next to me. So, instinctively I ate the chicken and it happened to be my friend. We ended up surviving to the next campfire then dying but my friend never played the game after that... 10/10 would eat my friend again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Such a simple game, yet insanely cool. Once again I’m reminded that indie titles can hit just as well, sometimes even better, than big AAA stuff.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the funniest multiplayer games I've played in a while. You're definitely in for a great time - and probably  also some major frustration.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm not exaggerating when I say it might be the best multiplayer game ever made",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very Love this game and best game to play with friends,so much fun and adventure,i like the goofy graphy and cartoonies look, just buy it take you controller and sit play an enjoy with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely one of my favourite games at the moment. Get ready for some yapping.\n\nI moved really far abroad for work just over two years ago (like almost 10,000 km far), and since then, I haven't been able to play most games with my friends because of the atrocious ping. I don't know how or why, but this is the first game in those two years that works absolutely fine, and has been nothing short of an absolute joy to play with my friends. I know it might sound cheesy, but I mean it when i say this game has genuinely improved my homesickness so much, and has brought back something that I thought I wouldn't be able to do until I move home in another 2 years. I struggle to put it into words how positively this game has affected my life. Playing games together makes me feel closer to home and my friends than ever.\n\nIf you're looking to have some fun with friends, this game will be a great fit. If you want to play with more than 4 players, modding it is easy. Sure there's a few bugs here and there, but honestly nothing massively game ruining, and patches come out frequently enough to fix things. If anything, some of the bugs tend to make the game funnier at times.\n\nNot sure if they'll ever see this review in particular, but it needs to be said. \nFrom the bottom of my heart, thank you so much to the devs from Landfall and Aggro Crab for such a wonderful product. <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I play solo, and it's been alright so far. It's got a good balance between challenging parkour & \"turn your brain off and climb stuff\".\n\nUpdate: this game too hard bruh",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic game to play with friends. The latest update, Roots, also seems to have updated terrain for the Shore (unless I just don't play often enough to have seen it before).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i can pull off some of the most insane batshit crazy plays in peak that i can't pull off in other games. if you get creative with the hand you're dealt, you're going to have a good time. even losing in this game is fun sometimes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If I could just play peak, I would. This game might be one of the greatest games released in modern times. Thank you for delivering such a great game.\nIf u struggle with any achievements, I d even love to help you out with it. <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Playing this alone reminds me of playing minecraft on a sick day off while youre alone infront of the tv, it feels like a very liminal place.\nPlaying this with friends is great, hearing their screams echo between the mountain is hilarious. Your friends will be the thing that will turn this game into something really fun. The same goes for any friendslop game really, its like an aight drawing on its own but your friends are like adding the detail and shading it and such.\nVery fun overall!\n\nAlso I love the ways you can express yourself the costumes and emotes are really adorable",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game's flow is extremely enjoyable. Can be fun for even solo play, although team play is of course preferred. The daily map rotation is a stroke of genius, you can retry your current peak for alternative routes or scout it out for a high difficulty run, or just try again a different day if it is more preferable. It combines replay ability from two angles: static enough to allow retries, dynamic enough to change when you want. Brilliant stuff and free content updates ensure the game will continue to be fresh and enjoyable. Can not recommend enough if you have a group to play it, and can still be enjoyed in singleplayer if they don't play often",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "such a perfect game. i love to play it with friends and solo climbs can be challenging but peaceful.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So long as you have people who are willing to play a silly game for a couple of hours, you will enjoy every minute of this game. It's silly, challenging, very cute and fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Virtual team-building exercise, the best format of cooperative games. It can feel really punishing and unfair (particularly the post-release maps), but you'll often find that through the power of friendship and teamwork, you can get through the most dire situations, and maybe even make it to the PEAK",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "С друзьями это чисто конвеер мемных ситуаций. Если у вас есть быстрая запись последних 30-60 секунд, то готовьтесь забивать диск видосами",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "literally the game i wanted to play my entire life, sadly it wasn't there while i was a child",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is PEAK fun. Simple, cute and addictive :p",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "PEAK choice to play with friends, vanilla is perfect but you can mod it to the max if you feel like it, devs are awesome and keep in touch with the community, you can't go wrong with this title.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Something originally thought to be just another game that you play with your friends a handful of times has very quickly become one of my favourite titles of 2025, with over 70+ hours in game (currently) I can say this game is worth every penny and more",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best co-op games of all time.\nFun; Funny; and Intense. \nEven fun solo. \nOne of the best under $10 games on steam.\nAchievements being badges is insanely genius and more games need to think of achievements like this.\nReally can't recommend enough.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As games like lethal company are starting to pop up everywhere, this one stands out to me. The maps change daily adding a ton of replay-ability. It’s been great planning out routes with your group and making on the fly decisions on how to tackle different obstacles that popup. Would highly recommend trying this one out with friends, especially for the price point.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game to play with friends or just to relax after hard day. Recommended.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "very friggin fun and vvery nice to play w friends even tho half of them doesnt it have it installed and have to install the game every time we wanna play",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "My feelings on this game are really mixed as someone who bought and played mostly before the Mesa and Roots updates.\n\nI originally loved this game as a much more chill variant of the recent proximity chat multiplayer genre. I enjoyed playing games like REPO with my friends, but the aggressive/spooky nature made it a little more stressful than I'd like. Peak, on the other hand, provided a challenge, but could be set to allow for a more chill approach. If you were playing Tenderfoot, there was nothing rushing you, and nothing coming after you. You could just enjoy working your way up the mountain with friends.\n\nAfter the new biomes were added, this wasn't necessarily the case. Now, the threats and challenges are considerably more mobile, so even on tenderfoot I have to keep my head on a swivel and not explore one place for too long. Frankly, it's just no longer for me.\n\nIt's hard for me to say I don't recommend it, because I think for many people, this game is still really fun. But it's sad that the updates have changed the game in a way that takes away what appealed to me personally. Since steam doesn't allow a more nuanced option, I'm voting no.",
      "voted_up": false,
      "votes_helpful": 381
    },
    {
      "review": "Games shouldn't be allowed to update or add EULA after you purchased the game and you're past the return period.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "This new biome ruins the game. Why is absolutely everything trying to kill you even in tenderfoot? Spiders, Mandrakes, Infected survivors, beetles, gas, poison plants and exploding plants and if thats not bad enough the constant wind trying to kill me as well.....who thought this was a good idea?! I thought nothing could be worse than the desert biome but you guys out did yourselves with this one. The direction you're pushing this game is not the fun climbing game we all fell in love with. You're turning this into a survival game with no way to defend yourself besides constantly trying to run away.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "The game is super fun and great to play with friends. BUT: the new Roots update completely ruined it for me. The combination of zombies (which can CLIMB, deal extreme spore damage, and knock you back), beetles that can also knock you back, spiders that poison and fling you around, spores everywhere that make it impossible to stay in one place, wind that blows you away and drains your stamina like crazy while climbing—and generally having no safe place to retreat from all these dangers—makes it unbearable.\n\nI won’t play this game again until I get my jungle back (which, by the way, I used to hate, but now I’d gladly take back with open arms).",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "My first negative review and I hate to do it.\nDidn't know you couldn't just join a random lobby but you have to go through their Discord, Level Up by messaging and ask into the void of the LFG channel if anyone wants to join or join them when you don't wanna solo. I have no doubt that there's great people there but as someone who's already socially anxious af and willing to play a co-op game that requires talking, I'm not taking these extra steps..\nIt is indeed a multiplayer but the barrier of entry is having friends that play this game/ trying to make them through a 3rd party program. I genuinely don't understand this decision.\nFor everyone screaming \"But the trolls!\", I honestly don't think it would be a major problem in this community and if it were, just make a checkbox for private/friends only lobbies while creating. Also never stopped any other co-op game from existing with the same design choice.\nStraight up deal breaker for me.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Roots for the second biome ruined the experience and took all the fun out of the game. Difficulty spike is too sudden. Putting it in the beginning was a mistake.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is nothing but endless frustration, grabs that should have worked but didn't, fall damage that you shouldn't have taken, and nonsensical physics that are more of a threat to your life than any actual hazard in the game.\r\n\r\nIt already has me.\r\n\r\nSave yourself before it gets its hooks in you.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Roots is a terrible biome and is a horrible 2nd level. Its way to hard for new players. It has left such an awful taste in my mouth that even though its being swapped out on the 17th, I wont be playing this game again.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is fun! Unfortunately the new forest update has way too high of a difficulty curve. Spiders, poison mist, mushroom zombies, and winds. Choose a struggle. Way too much at once! If anything. get rid of ONE of those things and it'll be more playable. So difficult that it takes the fun away!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Gave it a fair shake. Sorry just not my cup of tea. Another streamer meme game that feels hollow. Played it with friends and it feels like all the others that got popular. Nothing really special here. Glad other folks found it to be fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well the game was the right amount of calm and challenging but the developer has completely botched the latest update and ruined the game. The second biome \"Roots\" is downright impossible to play. Confusing geometry, toxic spores you cannot avoid, zombies, spiders, beetles, etc. What was once a fun, chill, and interesting game is turned sour. Second biome should only introduce one new mechanic not 3 at the same time.\n\nRoots is the epitome of a poorly designed series of mechanics that were never balanced. I cannot in good conscious recommend any buy this game until wind and spore clouds are removed.\n\nDO BETTER.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "roots map design is unbearable. like the devs didnt even try the map at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I thought this was a relaxing climbing/exploration game, but it's not. There is a time limit encouraging players to move briskly, but also the 2nd biome (Roots) has too many frustrating mechanics. So for me, Peak would be essentially only the 1st biome.. Also, it's a \"daily\" game; i.e., there's only one layout per day. So when you do your run, that's it. \r\n\r\nSolo experience not too compelling, and group play isn't viable for mic-less users; there should be in-game text chat and gestures aside from pointing.\r\nThe group play doesn't feel cooperative to me. It's easy to lose track of others, and ways to help others are limited. You can be placed in situations feeling like there's no way to help someone who's behind, which feels bad. If someone dies, they end up doing nothing for the remainder of a climb to the next checkpoint. There is an easy \"tenderfoot\" mode, but it's not enough for casual play. \r\n\r\nOverall, this feels more like a chaotic streamer game, which I guess it is supposed to be, than a chill co-op game. I do not recommend it if one is expecting that.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "In my opinion, this game should be a cozy, slop, coop game that you play with your friends to have fun but unfortunately this is not the case...\n\n1) You can't save, every single progress you make is going to get lost if you can't finish the entire game in one sitting (It's going to take you and your friends multiple hours, 2/3+ hours in a row on average, especially if you're new)\n\n2) Even in Tenderfoot (Easy Mode), the game is not easy at all, EVERYTHING is trying to kill you and the game is trying to make your experience as frustrating as possible.\n \nFrom poisonous fruits of any kind, to poison bombs on the ground, to strong winds making you fall, to multiple insects trying to kill you, to freezing winds making you freeze to death, to the scorching sun burning you alive, to zombies chasing you with infinite stamina to the very peak of the game, oooof... \n\nI'm way less stressed playing any FromSoftware game than this and i'm not even joking.\n\nAll of this being said, i can't personally recommend this game.\n\n- if you want to sweat for 3+ hours in a row, micromanaging everythig that you and your friends do, while also praying the RNG gods for some good loot, this game is for you.\n\n- If you want to just have fun with your friends, have a laugh and playing a good old coop/slop/cozy game, this definitely NOT for you!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The entirety of the challenge in this game comes from the fact that the controls feel sluggish and unresponsive and the physics are clunky. So basically, it's like the vast majority of these indie friendslop flavor of the month games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can confirm that it's not PEAK. Whoever designed and thought of including the ROOTS biome, I am cursing you.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "the updates for this game feel completely different from the rest of the game. the mesa is such a difference in difficulty and just all around design with scopions and dynamite. the new roots map follows this trend with mandrakes, beetles and spiders, and items that quite frankly useless. the cheakpoint flag is pointless. if you have a scout effagy it just doesnt respawn you. the milk is pointless outside of the messa, along with sunscreen, the grappling hook needs to not ragdoll the user, it makes it near impossible to use effectively outside of mutiplayer. the updates NEED to add things to, if not all, more than one enviroment outside of items, the ice map is basically a joke at this point, and the starter map could use some love. overall I can\"t see myself playing the next update, it feels like the updates are just to dissconnected, if it added more mountian to climb that would be ineresting but it just doesnt feel fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I only found the first full run fun after that it gets pretty repetitive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY THIS GARBAGE SPENT BETTER MONEY ON PORN.\r\n\r\nFuckass game has random generation meaning you either get a normal way to the top or an impossible traverse through satan's colon to fall halfway down because the generation didnt feel like being possible today. Fuck this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played on a lower end PC. The lobby and game itself loads as just the background skyline without any terrain even after messing with the settings. Found a similar issue reported on Reddit. Game is unplayable this way and wouldn't recommend with a lower quality PC or until the bug is fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no respawn points no saves so u have to start at begining every game! very irritating! #sns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PLEASE PLEASE PLEASE!!!!! Nerf the damn 2nd level!! there's way too much stuff on level 2 for the game to even be fun anymore!! I'll play again after the next update until then I'm good on this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This was a fun game until they updated the second stage now I find this awful and genuinely not fun to play anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I know that there are modes for saves but having no save in the standard game is diabolical....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "NOPE!!! it continues to kick me out saying error! literally was almost to the last checkpoint and it kicked me. Im uninstalling the game. Waste of my money!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is good but it has a huge issue: singaleplayer. The main problem is that wile players in multi player get a LOT of revives singale player rounds have only ONE atempt and if you played the game you might say that they have chekpoint flags but the chekpoint flags are not iven good because: number 1 every campfire removes all plased flags and number 2 by the time you die and respawn the fog is alredy their to kill you it is  just UNFAIR for single player rounds. And the only good thing is that their is more food wich their is alredy too much.\r\n\r\nin the sumery don't buy this game unless you have someone to play it with.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I Loved (LOVED) this game it was fun chill and all around a great game its no longer a great and fun game those fucking zombies i know im a easily scared person and i cant change that so pls make the zombies their own gamemode or setting to disable those fuckers i dont want to play tenderfoot but i also dont want to get inappropriately touched by a zombie every fucking match thx:3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is good but it crashes every 10 minutes so i always have a bad experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm gonna first start off with, this isn't a bad game at all. This is just my personal take on it.\r\n\r\nAs much as I wanted to love this game, I just couldn't. I liked the colors and cute art and characters in this game, but that's about it for me. I just found the premise of this game kinda boring ngl. I love playing games with friends, but having sessions with friends starts out fun for the first few minutes, but then wanting to find a way to shut down the game without making them upset. Even though I find playing with friends a lot of fun, it just couldn't hide my hatred for wildlife survival games. \r\n\r\nI'm really not sure if this was a problem on my part or not, but the controls felt really clunky to me as well, to the point where it started to kind of annoy me. I like to try and overlook this though, and just call it a skill issue on my part.\r\n\r\nBuy this game if you want to. It's just not for me. Love seeing it win awards though, and I love the teams behind this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Landcrab is competing with Arrowhead to see who can make a more buggy broken mess, and they somehow won. Every time I open this godforsaken game, some stupid bug hinders the experience for me or my friends, whether it's voice chat breaking, getting disconnected mid-game, falling through the map, and more. In fact, I was inspired to write this essay after getting disconnected near the top of the kiln and falling to the bottom before I could even do anything after rejoining. I'm also going to complain about how long you have to wait sometimes to play again after dying, even though I play plenty of other games like that. I pray any other developer sees the issue and makes a similiar, better game to replace this because I dont know how much longer I can pretend its fine. Ts game is like D tier friendslop as it is, just play lethal company or repo or something. That RV There Yet game probably has less bugs than this. Fuck Israel",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a really good game, but incredibly buggy. Many of the bugs are game-breaking. Sometimes items, like the bag or even the players fall through the ground; network problems; the physics is terribly buggy in general; etc.\r\nIf you get disconnected and reconnect, the server will teleport the player through all the maps that have been completed, thus achieving their completion, without the burning/freezing status effects (this unlocks achievements). If someone experiences temporary network problems, their characters might be catapulted to the sky....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything in this game is designed to waste your time. Being poisoned, hungry with no food left, or waiting for teammates all result in wasted time. After two hours into a run, everyone ends up dying in the volcano—another huge waste of time. The game clearly does not respect your time, and its terrible ragdoll physics do nothing to improve movement or accuracy. Additionally, it want's players to use in-game microphones with no audio filtering—just a basic volume slider. There are no options for gain, clarity, or suppression, making the audio features largely useless.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am posting this review to take or tweak the new map. The new mushroom map is the worst by far. In a single run I ran into the spores, because that red shit is everywhere (especially where you want to climb), then my friend fell and I have to deal with the scout master. Then, after I jumped off the map onto a vine, I was chased by a zombie. Then after healing the bite and avoiding the spore mist, I got attacked by a spider. Then I got done with the spider, then the wind started and I had nothing to hold onto. I like the game, but that run made me hate the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely insane difficulty spike on the second peak in the first two runs ive ever done has completly killed my excitement for this game. Devs seem to think bullshit mechanics are \"funny\" and dont seem to care if the game is actually any fun. IDK how this is nominated for a steam award with the state its in. Uninstalled and uninterested.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I got this game about 2 hours ago and I'm not having a fun time at all. Whoever decided to make the Roots biome the second area in the game is a moron. This is way too difficult and not fun or interesting. The first area was a blast and made me really hopeful for the rest of the game. I'd love to see the rest of the biomes but this is so tough that I really am not interested in trying the game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "New map is a game killer, harder than every other map but it's stage 2. Maybe they will nerf it and change the rarity of alternative stages but yet we have to play roots every day and no fun allowed even on easy mod.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really loved this game before Roots, and I think it is a super cool biome that has a lot of potential. But WOW, it needs to relax with the amount of threats it throws at you.\n\nTL;DR: The Tropics were tough, but manageable and learnable. Roots is downright cruel and unforgiving and doesn't give players, especially new ones, the chance to learn anything without being completely overwhelmed. I can't really recommend this game anymore since it's has such a high skill ceiling now.\n\nLong Review:\nFor context, the Tropics give you 6 hazards to deal with: exploding clumps, poisonous clumps, poisonous plants (bushes and thorns), rain, waterfalls (but they were never really in the way imo) and lava (which was never really a threat, tbh). The Tropics were tough, but not impossible. You had to survey your climb, plan things out with companions, and strategically work through winding paths and be willing to risk back-tracking to find better options. Rain was annoying but never actively hurt you. Waterfalls and lava never obscured paths. The clumps were big hazards but were avoidable. The change in difficulty from Shoreline to the Tropics was tough, but doable after you started learning what to look out for.\n\nRoots, on the other hand, is almost impossible to beat in its current state. You have the same exploding clumps as before, spore clumps that do the same amount of damage as poison but linger much longer, CLOUDS of spores that BLOCK routes to the actual climb, wind that actively tosses players around EVEN IF you're hiding from it behind rocks, trees, or INSIDE CAVES (the caves lead nowhere more often than not, by the way), spiders that linger and catch you, bugs that follow you and toss you around, waterfalls that actually block viable routes ON THE GROUND, and ZOMBIES THAT CAN CLIMB AND FOLLOW YOU AROUND for Christ's sake. That's 8 hazards, by the way (2 that actively obstruct your exploration and **3** that actively pursue you and endanger you if you are within earshot).\n\nIt would be one thing if new to only semi-experienced players like me had issues. But I'm seeing friends and reviewers who have 50-100+ hours in the game struggle and clearly have a hard time. It'd be one thing if this was all balanced with all the food around in Roots, but new mushrooms give you spores and lower your stamina for a significant amount of time, making it harder to brace for the wind, run from zombies and climb. It'd be one thing if zombies only spawned in ascension difficulties and/or could only follow you on the ground, but they spawn at ALL difficulties, CAN CLIMB, FOLLOW YOU, LUNGE AT YOU, AND CAN INFECT YOUR FRIENDS TO ADD EVEN MORE THREATS TO THIS MAP. With all of that happening and ruining climbs, how could anyone learn what to do in this map, let alone be encouraged to?\n\nMy husband, friends and I just got this game in the autumn sale this year and have clocked in so many hours already. Two of us even reached the Peak! We were making plans to start tackling achievements. This update makes us not want to touch this game ever again. Devs, please do something to balance Roots - we really want to love this game again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game so badly but between the Roots update making it too hard for my nephew to play with me and the weird EULA I can't really recommend it. I was going to get this for all of my friends for Christmas so we could climb together...and now Tenderfoot is too much work for what it's worth. I might change this if they change things but I don't think I'll play more than the 3 hours I have on here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The uneven feeling of difficulty between each biome really made for a jarring, tilted gameplay experience. I question whether the devs even playtested the Roots biome. The idea and graphics and gameplay are cute, but if the biomes are procedurally generated, are they also checked to ensure they are *completable*? The controls also leave much to be desired, I died repeatedly when my character refused to cling after a jump, even with full stamina, when I had done 50 such easy jumps before no problem.\r\n\r\nI did not play this game for long but considering my enjoyment of it was a steady downward curve from the first minute I don't think bashing my head against a wall is going to feel better for having done it longer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun idea, for a little awhile but it can be really inconsistent and frustrating. Sometimes the random maps feel impossible without items which are random. Not sure how you're supposed to learn the game when you play for 40 minutes just to get stuck and have to restart. I wasn't a waste of money, but I won't be playing much more of it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's becoming more and more difficult to recommend this game to friends. I loved this game at first because I loved being able to converse with my friends and have silly moments, now it's become this crazy difficulty climb that I didn't ask for. I don't want to struggle and scream at my computer because three zombies and the wind made me fall into another exploding spore bush thingy. I want to be challenged by the terrain. I was looking forward to this update because, after the mesa, I was hoping this would kinda be a return to something a little more relaxed in tone because it is an alternative to the jungle, the second stage, but no, it is not balance nor fair nor does it make sense in some aspects. There's SO MANY new features added that make this new biome inhospitable, and the generation we tried to play on had nearly no viable way up that wouldn't require either the luckiest people on the planet or modding the game to get the items you wanted. I want like this update, I do, but as it is, I can't.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is fun, but in its current state, it is too buggy, causes people to randomly disconnect and the game breaks far too easily, requiring one to restart the entire game to fix temporarily. The game is also very poorly optimized. This game needs to be massively ironed out.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun until you get to the roots what were the devs thinking there are way too many hazards and not enough room to climb and similarly Kiln but I give it a pass since its not the first or second area. Also it bricked my pc even though I had it on the medium settings and my pc is pretty good and can run a lot of heavy games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fun but there are some drawbacks. I can handle the no-checkpoint gameplay HOWEVER there is no option to continue from where you left off. I think there should be an option for that. No matter how fun is the game, if you have to take a break or wanna leave because you have some stuff to take care off you are cooked. Back to beginning. I think that is an easy option to add in the game. That's the main reason why i don't recommend it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not a big fan of the game after the Roots update. The biome is just too hard for me. I really liked the difficulty of the game on launch. I wish I could disable the new biomes",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the game but man does it not run well on computers. It runs incredibly poorly. Multiple times when, I played the new update. I got a black screen on my monitor and nothing. I did fixed it until. I restarted my computer. \n\nThere's something wrong with the game. Not only that. How does this game keep my gpu so insanely hot?\n\nI can play doom eternal on 4k max and that games runs cooler than this damn game on my cpu and gpu temps. I play on 1080p resolution on this game btw. \n\nUntil this game is more optimized and runs better on most systems. I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Terribly optimized. Every time I run it it's a coin toss whether it restarts my computer. Constant crashes, absurd cpu/gpu use. If they ever fix the performance I'll review the actual game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is annoying bullshit: the game. Despite not being a survival game, it has the most tedious and annoying stamina and survival systems I've ever seen in the genre, and I've played a lot of early access survival trash. If you pass out, you become a burden for the rest of your group and your carried items fly around everywhere because of the shit physics system. Then when you die you get a permanent stamina debuff because fuck you.\n\nTL;DR: Game was developed by a dude who loves cock and ball torture.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i've seen plenty of insightful reviews for this game, positive and negative. since it's unrelated, i won't divulge my full thought on what others make of this game, but i will talk about experiences of my own and those i know. \n\nas with many games, opinionated criticisms related to quality are in abundance. we have bugs that are discovered with the game's development over time, inconsistencies between biomes, accessibility issues, and other problems people have with the game's functionality... a large fraction of what i listed, while not entirely unreasonable to address, are liable to change with enough collective userbase complaint. \n\nas someone with a steam deck, a more unavoidable issue is the fact this game is near inoperable on any device with specs that aren't remarkably high-end. \nfrom what i've seen, the divide this can create is almost oppressive. i say this because i've experienced many people (including my own friends) have the complaint of \"i bought this game, but i can't run it\" only to gain the response of \"what are *your* specs? why don't *you* get a better graphics build and adapt?\" if a game is meant to be enjoyed on a large multiplayer scope, i think that's a redundant argument. \ni also don't appreciate that this game lacks lan support. planned obsolescence for this game in particular seems to be a misplaced decision by the peak team, especially as landfall/aggrocrab as companies seem to understand how it feels to make a game with passion, or at least *for* people to be passionate about playing. \n\nif games like peak are intended by the devs to be enjoyed, i would *hope* that attention breached the longevity of whatever \"live service\" marketing seems to be going on with peak at the moment. \n\nmechanically, peak is one of *the most* fun games i've played in years. this is the main reason it's earning game reward nominations after having only released half a year ago. however, i think it's shallow to overlook the glaring problems caused by the companies' attempt to expand on a quick opportunity since the game has succeeded so quickly. it's only my specific circumstance (my specific device and internet plan) that allow me to enjoy this game in its full scope. while many others are equally as fortunate, several more unfortunately aren't. it creates the sort of atmosphere that is (from personal experience) reminiscent to this: those who are continuously able to play nintendo games, paying for their services, being fully aware they'll become null in the future- vs. those who cannot afford it, and still have to watch as the perpetuation of this kind of system rooted by economic growth in gaming industries tends to cycle. \nwhile i enjoy playing the game, it's difficult to recommend to most, so overall i can't pass the blue thumb in good conscience. there are plenty other multiplayer games with excellent mechanics, designs, and worldbuilding that are more user-accessible, as well as *less* costly to begin with. \ni do have some hope for the circumstance of this game, but i can honestly see its future going either way-- lasting, if its developers fully listen to their community, or fizzling out as if it were some other aaa game designed to move on from. as it stands now, this game is purely beneficial for those who can afford it. it's unfortunate how many users have already wound up disappointed with the results of such a thought-out game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game but I can't join anyone's games it always gives my client timeout and I have done everything to fix it so it has just been a waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Incredibly simple game with incredibly complex implementation of gaming, working together, and exploration all wrapped in goofiness that can be both fun and VERY challenging at the same time!\n\nJust one problem.....\n\nDESPERATELY NEEDS SESSION SAVES\n\nI would play this game SO MUCH MORE if I could block off times for sessions saves with friends that allows me to save my spot at campfires between each game section.\n\nToo much time to dedicate 2+ hours to actually finish a climb to the PEAK.  Please, PLEASE implement this and I'll happily change my review to positive!!!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Until they modify or remove biomes (ROOTS) that massively spike the difficulty regardless of their location this is going to continue to be percieved as a rage bait type streamer game. Being able to make it all the way to Caldera on normal difficulty yesterday but unable to today because Roots - with it's cornucopia of anger inducing stage hazards that are more plentiful than any other biome and sound like they were generated by chatgpt, picked out of a hat, and feel as if they were implemented without any consideration as to their balance - was the second biome I encountered, really showed me that Roots is as bs as I thought.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I legitimately despise this game. I have played through multiple times with friends because they want to go through it, and I just don't see the appeal to it. I'm glad other people enjoy it, but it is absolutely not for me. \n\nThe newest update made me leave this negative review. Zombies, spores, beetles that push you off, spiders that web you up and poison you, wind that strongly pushes you unless you know about it beforehand. The game was already annoying enough, so what do the devs do? Add more garbage mechanics to make it less fun. Why add things that make the game more fun when you can just piss off your players? Awful developers. What an annoying game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game before the Roots biome. This game used to be about tackling the mountains at your pace, goofing around with friends and still usually completing all the mountains (on regular difficulty) now even on the easiest difficulty the second biome is too challenging. They added like 15 new things onto this 1 biome instead of spreading it out across other biomes. Ruined the game for my friends and I and we we're hyped for this new biome",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ok. This game is almost very good. Almost.\nGive me a save option.\n\nI died after 40 minutes. I'm not going to walk this distance again. And with maps being randomized each day it manages to combine rogue-likeness and FOMO - you want to beat this map? You have just several hours left! Better hurry. Sorry bro not this time.  \nIf you want to check my opinion about rogue-likes check my older reviews. \n\nIf you think that option for saving/checkpoints is lame/defeats the sense of challenge... I'd like to inform you that you control buttons you press. You would be free to not use the feature.\n\nI could just git gud, but I'm playing the games to have fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR: very unfair game.\r\nDo not play this. It is an unpolished, incomplete mess not worth your time nor money.\r\n\r\n1. Graphics. Graphics are not optimized, so most people would be forced to play on lowest settings, which feels absolutely terrible: glitching textures, pixelated low definition fire, and really hard to see far, which directly impacts gameplay, and not in a good way.\r\nThis is such a let down, since graphics are not really that impressive, even on best settings. It would've been really easy to make them accessible for any machine.\r\n\r\n2. Game pace. Since The Roots update, there's no denying that the difficulty of this level is comparable to the last one. This is obviously not a valid way to balance the gameplay. This difficulty spike is the main reason for deaths of runs of mine and my co-players.\r\n\r\n3. Customizability. This is done very poorly in this game: very little options of starting difficulties don't provide enough flexibility for everyone to enjoy the game. I would suggest adding a system to configurate rarity of chests, abundance of food throughout the level, which level to start with etc.\r\n\r\n4. QoL. There's basically none, which could be understandable, since this is a surviving game, but still - no save button to pick the game up after a break? No way to turn off the freezing mist?\r\n\r\nI'm tired of writing this, so to conclude: I just hope devs will fix all of this. Until then I can't really recommend this game, that has truly a lot of potential to be really, really neat and great.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this was just. not an enjoyable experience at all\nplayed it with a few friends, the forest area just Threw Stuff At You too quickly and it got wayyy too overwhelming\nthe final area is confusing af, went in a loop because nobody knew where to go\nand the bugs. oh my god the bugs\nfor some god awful reason, whenever we reached the statue thingy and everyone got revived, one of us would always get flung to hell and die for No Reason At All\ni genuinely had more fun in the lobby screwing around than i did actually playing the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "玩撚咗廿個鐘，仲未登過頂呀屌你老母!!\r\n成日無啦啦跣腳，搞到我高處墮下死亡。\r\n行行吓又俾肚餓嘅手足JAP咗，食完我之後仲要同我棚骨打卡留念。\r\n棉花糖又俾啲賤種收埋晒，俾我捉到仲講大話。一打開個背囊，嘩! 塞撚咗幾廿枝喺裡面，仲要枝枝都燒到金黃色香噴噴咁。咁多枝都肯唔開心些牙，你留返嚟登高祭祖，燒俾你先人食呀?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Yet ANOTHER of the games \"Better with friends\" or otherwise \"friend slop games\"  because they are sloppy made.[/h1]\n\nLook, game has very unique concept but it is YET AGAIN WASTED because of extreme difficulty even for the first level, the over reliance of having a team, the obsession of such games where you need to read the wiki like it is exam. Because every item, can only be understood by reading the wiki. There is no way in-game to see what the item does unless you use it and then if. \nSo trial and error, that is \"friendslop\" games. You must watch guides and wikis to understand what is heck is going on and of course the game doesn't provide any info or a book to read about what items does.\nOr a text from the scout saying an immersive flavour text of an item so  you will have some idea what the item does.\n\nThe first level should have been easy especially if you're solo. i can't understand why games aren't easy especially on solo play. Is this supposed to be a \"friends game\"? Why everything is hard and trial and error like?  At least make solo play easier so people can see if they like it or not. If you won't like solo play, you will not like Coop.\nThe second level roots has Wind which pushes you down and you are given no chance to know that beforehand. Is this  supposed to be fun? Why we must learn everything by trial and error or from the wiki?\nAnd the game is tedious when you don't know even 20% of the game.\n\n[h2]I had enough of those stupid games. \"REPO\", \"Lethal Company\", even \"Don't starve together\". \nCute games but they have a hidden bad side behind that mask that pull you into your worst possible nightmare with your friends and if you even dare to play solo, to the void of empty silence.  [/h2]\n\ni thought Coop games were supposed to be fun, easy, something casual, for the kids. But what is this? Why? i can't even have fun playing solo to understand game concepts and you put me into this madness?\nThink of the kids! What is this?\nWhy such \"casual\" games have to be so unforgiving? Just why?\nNo, i am losing my mind. This is enough.\n[h1]The game  doesn't respect the player, that is enough to understand at a glance.[/h1]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I did all ascents before 9 hours, when will they add elden ring bosses so the game actually feels slightly hard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Braindead game where you can't get close to past shore even with 35 minutes of playtime. Custerfuck of a map full of dead ends. Purely dependant on rng, spawned in with ZERO food, all the wild crops were poisonious. Was literally impossible to climb anything without close to full levels of stamina.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You are completely unable to have fun in this game unless you play it with other people. And joining your friend's games is stupidly difficult. You have to plan each session ahead of time. If you try to join in the middle of a climb you have to kill yourself to catch up with your peers. It's so fucking stupid.  I hate this.\nThis is a glorified chatroom for people who have nothing better to do with their time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One thing that always impresses me about these types of co-op games is not just how bad they are, but how tons of players who have single-digit hours of time on the game give it a positive review. You maybe got one good night of fun out of the game and you genuinely think it is really worth a positive rating? Or are you just giving it a positive review just because your favorite streamer played the game and you had an hour of lolz watching them play it with other streamers?\n\nGive us the ability to change biomes/zones or practice on different levels.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun, but I can barely play with all these Photon disconnect errors that I have been getting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basic game mechanics are broken (e.g. backpack falling through the ground, wind blowing through a solid wall, etc.), and they have been unfixed for so long it is obvious the developers don't care.\r\n\r\nThey have also added mechanics e.g. the zombies which clearly indicate they have no understanding of why the game is fun in the first place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its very fun at the start but gets progresively boring after some weeks or a month",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PEAK is a fun and challenging game, but without save checkpoints it’s too demanding. I have family and work, so I can only play 1–3 hours per night. I never have time to get past the second peak. I would enjoy the game much more if progress could be saved at campfires",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PEAK is a game that for the majority of players, is a co-op experience for giggles and enjoyment. The problem I have with this game is that there seems to be a disconnect, where the players want the silliness and feeling of progression with the climb with some challenge, but the developers want to make it harder and harder. The result is that when watching people play, many of them are struggling to progress at all, some unable to clear a run after several hours, and yet they want to make it even worse for these poor players. I have disagreement in the direction that balance changes, and introduction of new biomes, appears to be taking, in that there is a priority on punishment through difficult additions to the game rather than a priority on people enjoying themselves and being able to win. There is also removal of things that were fun and generally harmless.\r\n\r\nFirstly, I want to put in perspective that I'm not a new player, and can win the majority of my runs. My concern is not for myself, but for the newer or less experienced players. I'll list some things I didn't like below.\r\n\r\nThings players did for fun are removed: \r\nBag + scout cannon making you fly further was severely limited to prevent glitching.\r\nCannot put dynamite in your bag.\r\nCannot put scorpions in your bag.\r\nCannot put mandrakes in your bag.\r\n\r\nThe player is nerfed in ways that are unfun:\r\nIncreased heat gain over hot rocks in the kiln.\r\nIncreased heat gain from caldera hot rocks.\r\nHeat has a longer delay before it begins to decay.\r\nCan't change perpective to another scout while unconscious.\r\nIncreased amount of curse gained on becoming a skeleton.\r\nIncreased the weight of eggs.\r\nCannibalism gives more curse.\r\n\r\nWhen the community manager talks to the playerbase they are sometimes writing in inflammatory language.\r\nOn nerfing their overpowered zombies on roots biome launch, they said \"yes, we did playtest the zombies. I guess the playtesters were just too good at the game ;)\" (on twitter, they ended this with a painting nails emoji, which is even more inflammatory)\r\nThis sentence puts down anyone who was struggling and seems very unprofessional and written with a lack of compassion.\r\nThey also were observed writing \"part of me says good, suffer\" regarding Mesa being difficult. This shouldn't have been added into the writing as it appears to display the true feeling of the developer as that they don't want us to have fun, and are only nerfing their biome due to backlash in the feedback.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I dont have any freinds, dont know why i bought it, would refund it if i could.\r\njunk game without anyone to play it with.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gifted from a friend. Loaded game, alt tabbed, Full screen went to a teeny tiny box mostly off screen (top left corner??). Had to close from taskbar. If I had bought it I would have refunded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crashing on me and i don't know why it's too bad cause the game looks fabulous",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game with 4 people, but the lack of matchmaking or server browser just sucks. I had to complain many times on discord about this, but my voice just get buried in everyone else chatting in general.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Anyone else just not play when the roots are in rotation? Challenging is fun, but roots are just annoying. Other than that, good game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you give us save at campfire options than i will rate it a 5 out of 5 but with my friends we don't want to restart the whole game when we die.. We just wanna enjoy the game finish it and move onto the next one. Tried to mod campfire save into it but the mod did not work....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tried playing it but i cant get it to work. sucks cause i was super excited. if i use dx12 or dx11 launcher the game flows great looks great too except the floor and everyone's heads don't load. so yeah cant play a climbing game if i cant see the ground below me. then tried vaulken and it fixes the no floor or head issue but the game becomes so unbelievably blurry that i cant read any of the text and the lag is so bad its practically unplayable as a single movement of my mouse takes about 3-5 seconds to register. i checked the specs for the game and i know i only have a regular laptop and not a high end pc or anything but my laptop is still better than the recommended specs for the game so I have no clue what the issue is. hope it gets fixed cause I really wanted to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game, but incredibly glitchy :(\nthis is my first negative review",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lately it keeps disconnecting at random times and all the work we spend hours on just goes to waste. all my friends start disconnecting one by one too and honestly today was the last time I logged in I really cant tell anymore if we play this game to have fun or just to get frustrated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No settings for the voice, the cosmetics are gender bender woke jokes, the game is repetitive as heck and it's just unfun to play. Even playing with friends, it's just bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix this game either my teammate are glitched and their avatar is stretching and glitching or when i rejoin i get flinged and get damage because i go flying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun and all but idk how i can play it if the maps refuse to load properly since the latest update. not to mention ESO (a bigger and more demanding game) runs better on my laptop on high settings compared to this buggy mess on its lowest settings",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Arkadaşlarla oynanır belki ama tek kişi kesinlikle zevk vermiyor. Arkadaşlarla ise oyun zorluğu nedeniyle birbirimizi koruyamadığımız için yine tek kişi oynuyor gibi oluyoruz. Kısacası hoşuma gitmedi. Eğlenmek için çok oynamak gerekiyor ama bu süreçte eğlence 0.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun, unfortunately several key points prevent me from recommending it:\n1. No saves, not for people with jobs I guess. Honestly even tried mods but none are really relavant to both map and inventory saves and just feels janky and annoying for something so basic.\n2. Crashes - Played for like 2 hours straight just to have my game completely freeze and my friend disconnect at the same time, was not pleasent to lose all of that progress, could have been much nicer if there were saves!\n3. Some frustrating mechanics but I guess that's probably part of the game. Maybe it would be nice to have more difficulty options regarding the map itself instead of just stamina and dmg.\n\nI think this game has a lot of potential but honestly it's not very mature nor accomodating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super good game both alone and with other people.\nThe reason I cannot recommend it right now is because of the new biome, Roots. The performance is abysmal when it has the most active dangers (hostile enemies) of any biome in the game, which does not make for a good experience.\n\nThe way the game works is it's basically a roguelite with a new map every day. So if the map on day you want to play has Roots, and you aren't well above the recommended specs, well you might want to check back another time, because the lag spikes are guaranteed to come at the worst possible moments.\n\nP.S. The Roots biome is also the worst to play by far, no exaggeration. If this was in the game when I bought it, I would have refunded it, it's a completely different experience from any of the other biomes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game breaks its own rules after establishing that you need to eat to survive. Then gives you no food in the magma region.\r\n\r\nFixed map makes me not want to start over and over again, as I could just watch a youtube of someone finishing the game for the same effect.\r\n\r\nThe only real 'strategy' is to hope the random items in the item boxes are of more use than on the previous run.\r\n\r\nFor a party game, it's far easier to play if you forsake your teammates and keep the useful equipment for yourself.\r\n\r\nI did like the visible badges to show your achievements, otherwise...meh.\r\n\r\nDon't fall for the hype. Streamers aren't like normal people.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, negative review until they do something about roots. Absolutely funked level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I baught this game for me and a friend he said he would play it with me more than once and he is yet to play it again. he got made bc i didnt jump off cliff to save him after he died btw i was almost dead myself honesdtly it was skill isue on his part smh\n\nalso to expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't really like this game, but only for one reason. That reason is MULTIPLAYER, the multiplayer in my opinion sucks. Because nobody I know has steam, let alone this game, and there is no online multiplayer, so I have nobody to play with. So the moral is, if you don't have friends, don't play the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst game I have ever played.Optimize this multiplayer mode,plz.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like how the game works when climbing, but dislike how each map is made by AI who hasn't pretested this. Sometimes climbs are legit impossible, which makes this game a must refund before its too late.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The devs need to fix the game, stop using ai to make the maps without testing them. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game really needs a check pointing mode. I just want to play casually with friends and not for a single 4 hour session.\r\nThe dev's acknowledged this suggestion on the 22nd June but have done nothing. Just add a mode where you save the game at campfires. There's even a mod to do this showing how much desire there is for this ability. Its a really fun game to mess around with friends - needing to try hard the game in a single session just doesnt make sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy this unless you have friends to play with or you like walking sims with danger. Maybe if you thought the climbing in Breath of the Wild was the best part of the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, found it fun on my two playthroughs. After that the game just got boring and nothing new to see or to do. Honestly I dont see the hype behind the game. Really dissapointing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is amazing! But also a seriously unoptimised game. \nThere's a bug sometimes where either you or someone else would very violently shake-fly in the game and knocks you away really, really hard, the only way to fix it is to leave and re-enter the session, or prepare to get your amazing fall damage from them which no one else would understand.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting game. Name is funny, but it has quite a learning curve. I wish it was slightly easier so you could just sit back and relax and climb. It becomes not fun after the beach climb, and just turns into annoying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with friends. The scheduling to get to play it with said friends is well harder than the game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will say, this game is really fun, ive had a lot of good times with my friends on it, however.. I am not having fun with certain mechanics that I would very much like changed.\r\nFor starters the snow storms, they need to be adjusted because of how common they are it makes it almost impossible to get the badge, a good example is when I was going for the badge with my friend and not even 2 seconds into the biome and the snow storm started and instantly filled our bars with frost damage and we could not hide because we were not even fully into the biome.\r\nAnother thing being the damage received from falling, I have noticed that the damage is really scuffed cuz I will fall from a small height and take a lot of damage but then ill fall the same height again on a different run and I take not even a chunk of damage.\r\nI hope this Review gets seen and some things are adjusted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It gets repetitive after one or two playthroughs. I wouldn't recommend it personally, but it's certainly not a bad game! Just not quite my style. But this review doesn't mean I won't still hop on with buddies once in a while. :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game literally burned my motherboard because it has unlimited FPS turned on by default while having PS1 graphics. In 30 minutes it destroyed my ASUS ROG Strix G16 (I had noise cancelling headphones, I didn't notice the noise) and since it would cost almost 1000 dollars to buy a new motherboard, I decided to just buy a desktop instead because it would be cheaper. It is so poorly optimized that I have no idea how a human being would code that. I asked for a reimburse because I REFUSE to support a game that destroyed my hardware due to lazy devs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is ass I always get asked to play and all I ever want to do is stall just let a fella stall you dumb clankers",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}