{
  "positive": [
    {
      "review": "The Nemesis system still rocks. Building your own orc army and watching rivals come back for revenge is peak gaming chaos.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Released on October 10, 2017, Middle-earth: Shadow of War is an action RPG developed by Monolith Productions. Set in the rich universe of J.R.R. Tolkien's Middle-earth, the game continues the story of Talion and Celebrimbor as they forge a new Ring of Power to combat the Dark Lord Sauron.\n\nStrengths (Plus Points)\nEnhanced Nemesis System:\n\nThe game builds on the innovative Nemesis System, allowing players to create unique and dynamic interactions with enemies. Each orc has its own personality, strengths, and weaknesses, leading to memorable encounters.\nExpansive Open World:\n\nShadow of War features a vast and beautifully crafted world, including regions like Gorgoroth and Nurnen, filled with quests, collectibles, and lore that enrich the gameplay experience.\nEngaging Combat Mechanics:\n\nThe combat system is fluid and satisfying, combining melee attacks, ranged combat, and special abilities. Players can execute combos and utilize various skills to defeat enemies creatively.\nRich Storytelling:\n\nThe narrative is engaging, with well-developed characters and a plot that explores themes of power, betrayal, and the struggle against evil. The interactions between Talion and Celebrimbor add depth to the story.\nFortress Siege Mechanics:\n\nPlayers can engage in large-scale fortress sieges, which add a strategic layer to the gameplay. Capturing fortresses involves planning and utilizing your orc army effectively.\nWeaknesses (Minus Points)\nRepetitive Gameplay:\n\nSome players have noted that the gameplay can become repetitive over time, particularly in terms of side quests and enemy encounters, which may lead to fatigue.\nMicrotransactions:\n\nThe inclusion of microtransactions for in-game currency and loot boxes received criticism, as it can detract from the overall experience and feel exploitative.\nPacing Issues:\n\nThe game can suffer from pacing problems, especially in the later stages, where the grind for leveling up and completing objectives may feel drawn out.\nAI Limitations:\n\nWhile the Nemesis System is impressive, some players have found the enemy AI to be inconsistent, leading to predictable behaviors in certain situations.\nTechnical Issues:\n\nA few players reported bugs and performance issues, particularly on launch, which could disrupt the gameplay experience.\n\nConclusion\nOverall, Middle-earth: Shadow of War is a worthy sequel that expands on the strengths of its predecessor while introducing new mechanics and a rich narrative. Despite some repetitive elements and the controversy surrounding microtransactions, the game offers an engaging experience for fans of action RPGs and Tolkien's universe.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Definitely and improvement over the first game, I really like the territories and the forts, a shame most of the players use cheats for them online lame-ass idiots...\n\nStill: fuck you Warner, Fuck you for patenting one of the greatest mechanics in videogame history.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Like the first one this game is amazing. Overall i like the darker atmosphere the first one had. I like all the added stuff in this one. 10/10",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Monolith no longer existing is one of the games industries biggest sins. Shadow of War holds up incredibly well in 2025 due to the Nemesis System, the best arkham style combat, and a well crafted setting that uses the LOTR license to its fullest.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "let me first start off by saying pls make the next one i want it so bad and this gmae may be a bit old but like it fun trust me i dont say that offen and yea i take brakes from it but that cuz i no lifed it \n\night let me lock in  \n\nis my scaling right no but it is helpfull idk \n\nworld view 8.9/10\n\nplayblity 9.2/10\n\ninslaving 10/10\n\nstory 7/10 its there just idk\n\nlore 10/10 had to play the first \n\nover all /9.7/10 \n\ndont give me point idk what to do with them",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of my favorite game in all time ,the game is better then the it's Movei ,fully optimised, scale resolution upto 8k without lag if you have good system.\nGame is like Assassin's creed but it's better then that.\nMovement are great.\nMusic are great.\nAi system great.\nSide by side different story.\nRpg and open world.\nGood controls.\nPhoto mode.\nWB games are always.\nAchievements \nSkills not good like middle Earth required every time what type of skill do you want.\nUi better",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Shadow of War is a clear step up from its predecessor. Combat is more fluid, faster, and more expressive, with smoother movement, better parkour flow, and a larger set of viable builds through skills, gear, and runes. The Nemesis system is top-notch: unique personalities, shifting ranks, memorable rivalries, and genuinely hilarious orc lines that made me smile regularly. Regions are diverse, encounters varied, and the whole experience delivers a good sense of momentum. \n\nIt remains a shame that Warner Bros. sits on the rights to the Nemesis system and keeps this brilliant mechanic locked away instead of letting other studios build on it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best middle-earth game after the strategy game. More history before Trilogy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible game with a meh ending that could've been done a little better it felt like it was going somewhere good for it to end abruptly. Nemesis system is pretty insane and gameplay loop is heavily addictive, would still recommend anyone interested to try this out as I had decent fun with it and it is a general improvement over shadow of mordor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 166 hours in Middle-earth: Shadow of War, I can say without hesitation: I absolutely love this game. Few titles manage to hook me for this long, but Shadow of War delivers a mix of action, strategy, and storytelling that kept me coming back night after night.\r\n\r\nThe siege missions are easily my favorite part. Every assault feels massive, chaotic, and cinematic. Building your army, customizing your assault forces, and watching the battlefield unfold with your hand-picked captains never stops being satisfying. No two sieges feel the same, and the Nemesis System continues to produce hilarious, intense, and unpredictable moments.\r\n\r\nThe cutscenes and story beats are surprisingly engaging. Even after dozens of hours, the game knows how to deliver hype moments, emotional turns, and some seriously stylish character introductions. It feels like you’re living your own sprawling Middle-earth saga rather than just playing through a scripted plot.\r\n\r\nAs for the play style, it’s everything I want in an open-world action game: fluid combat, fun movement, and tons of tools to experiment with. Whether I’m stealthily dominating captains from the shadows or tearing through orc hordes in all-out combat, the gameplay never loses its charm.\r\n\r\nAfter 166 hours, the game still has that “just one more mission” pull. If you enjoy dynamic battles, memorable enemies, and the feeling of commanding your own unstoppable army, Shadow of War is absolutely worth your time.\r\n\r\nRating: 10/10 – A game I’ll keep coming back to.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "You will spend around 100 hours rushing around trying to sneak up on orcs and convert them to run off into Arkham-style clickspam fights with hords of orcs, but you'll do it because getting an orc to recognize you from the last time you almost killed them and set their hair on fire is amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What can I say about Shadow of War? It's a game. And a bloody good one of that. We live in age of gaming where pretentious developers can no longer find the thin line between making a fun game, or just straight up making a movie. Shadow of War is the sequel to 2014's Shadow of Mordor, and while the plot may not be as strong (not that the plot was anything to write home about in the previous game)? It more then makes up for it with it's superb gameplay and army building system.\n\nI've played this game twice on the Steam Deck only, and it runs incredibly well at 50FPS with some dips to the mid 40s on a mix of medium and low settings. I know this game had a rough launch when first released, around the time microtrasanctions and loot boxes were gaining some momentum, but with all that scrapped and the Definitive Edition routinely on sale for as low as £5? You could buy worse Tesco meal deals for that price.\n\nYou truly feel you're at the boots and powerhouse of Talion, The Gravewalker. Combat is tight, addictive, fast and rewarding. Loot along with the varied skill tree system allows any player to have freedom of expression while dominating the Orcs/Uruks of Mordor. \n\nSpeaking of Domination, the Nemesis system heightens the playtime to all new heights. Every Orc fight has always played out differently for me, with each their own quirks, personalities, strengths and weaknesses. From building the perfect army to raiding real life player Fortresses? Shadow of War blends action gameplay, stealth, RPG, real time strategy and the great lore of TLOTRs into a truly brilliant package. P.s. Shadow Mounting a Dragon will never ever get old. Buy this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game so good that I don't mind that it's entirely terrible fan fiction.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "similar to shadow of mordor but bigger and better. combat animations, camera, sound effects and visuals feel better in first game but almost everything else is better in this one. especially cuz it has difficulty options so it isn't too easy like shadow of mordor.\r\ncan be a bit grindy after a while but nowhere near as bad as some other actually grindy game.\r\njust wish we could disable the awful mouse smoothening and acceleration.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game over all i've enjoyed it since it first dropped and i come back to it every now and then fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, especially when the monsters have adapted to our movements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't finished it yet but damn i thought that \"Shadow Of Mordor\" was awesome but this game was some next level stuff, more added and fun ways to fight and thingy.\r\nNice rise from the older game in both mechanics, fluent fighting mech and new places to go.\r\nI really enjoy the \"city\" maps, feels like Assassins Creed but LOTR.\r\nAwesome game, will eventually play through it soon!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, hope the people who made it can make more great things wherever they work now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gravewalker difficulty is ridiculously unfair. You'll die in just one or two hits but it takes tons of hit to be able to kill one enemy. Level up is fucked up, enemy's just eliminated you can level up 10 times while you take forever to climb up 1 level. DON'T try it until you get familiar with the game mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of War is a chaotic, fun, power-fantasy playground full of orc-bashing, fortress sieges and emergent stories thanks to the Nemesis System. Its story and polish aren’t perfect — some missions feel redundant after a while, and the systems get overwhelming — but if you enjoy building a personal orc empire and carving your legacy in Mordor, it’s absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game I haven't beaten but I've played through the start multipule times and each time the game felt new with the enemys lifelike reactions realitation blood brothers cheating death it all makes the game feel real.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand the hype behind this game, ngl, going slow, but feels like the first part was better?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much. all of the dlc included.\r\nlove the gameplay, the story is so so but the gameplay is such a fun thing to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So fun and a great combat system along with the nemisis system this is just a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing both the middle earth games and they're great despite their age. i wish the nemesis system where your opponents rank up according to your and other enemy power hierachy member actions wouldn't be trade marked so we could see more games with different implementations of it. \r\n\r\nif you dont have it get it now while it's being sold extremely cheap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me preface: I am a huge LOTR fan. I’ve read all the books, seen the movies (extended editions), and have read numerous essays on Tolkien and his works. This game is 100% fan fiction. Is this game as good as Shadow of Mordor? Gameplay-wise, yes. Story-wise, no. The story can be a bit ridiculous at times, especially when they start revealing the identity of the Nazgûl, but it’s still a fun ride. I’d recommend this game to any LOTR fan or anyone who enjoys a good fantasy game. Solid 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of War feels like a bigger and louder version of Shadow of Mordor. The Nemesis system works great, especially when you start building your own armies that can compete in online pit fights or Sieges, which adds a lot of fun outside the main campaign.\n\nHowever, at a certain point in the game you have to grind quite a bit to level up and improve Talion to match the power of the next zone, which can get a little annoying.\n\nIn the end, I’d recommend this game to anyone who enjoyed the previous title, likes action-packed open-world games, or is a fan of the LOTR universe.\n[ MY RATING — 8/10 ] **",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "epic game, good and rich story. hilarious and sometimes very annoying enemy rivalry system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, its fun and a lot that you can do in it as well. good story to it and not only that it was a great follow up of the first game tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super addictive gameplay, nice story, good graphic. Overall a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "omfg this Nemesis system is insanely cool...\r\nwish those greedy B's didn't patent it...\r\ncuz how cool would a SUPERHEROE or ROBOT/MECH\r\nwith a similar system become!!!\r\n(also wish for a RAYTRACED REMAKE even if today it still looks great)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow. I have never played a game that is this good and captivating before. I got it for a really good deal, and I don't regret a single cent. Graphics are good, story is good, easy to learn but hard to master parkour, amazing setting, cool character design and voice acting, stays true to the LOTR theme, and I love the army building mechanics. Perfect 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Must play game I would recommend this game because Ingame mechanism is different from other games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "These games may not be canon, but Talion and Ratbag are the goats of the LOTR series, with Aragorn in second place.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shadow of War is the game where you, a mildly unhinged undead ranger, terrorize orcs so thoroughly that they start forming entire support groups about you. The Nemesis System is still the star of the show nothing beats the emotional roller-coaster of having an orc swear revenge because you accidentally sneezed on him, only for him to come back later wearing new armor and a bigger attitude. It’s like Pokémon, except all your Pokémon hate you and occasionally sing about it.\n\nThe combat is gloriously over-the-top, letting you flip, stab, explode, dominate, and occasionally emotionally devastate orcs with the finesse of a supernatural gymnast. Fortress assaults feel like someone handed you the keys to a medieval fireworks factory and said, “Go nuts.” And you do. Because why wouldn’t you attack a castle by riding a dragon while your personal hype-orc shouts insults at the defenders?\n\nIn short, Shadow of War is chaotic, dramatic, unintentionally hilarious, and endlessly entertaining. If you ever wanted to feel like a vengeful ghost-ninja with a very complicated relationship with orcs, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so peak, my only complaint is that you can only have ONE SAVE. ONE. That is trash, I had a really fun save that was 68 hours long and I wanted to play the beginning again, so I hit \"new game\" and it deleted my progress, I haven't had the motivation to play after that. But yeah other than that this game is REAL fun, good stealth, great difficulty options, ok story, real fun combat similar to the batman arkham games. I give it a 8.2/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Add crack, Arkham batman combat mechanics and Lord of the Rings and you got this, its pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not exactly true to Tolkien canon, but a fantastic game nonetheless. I have been playing since it came out, and am happy to recommend as a Tolkien fan. Middle Earth has no fantasy peer, and Monolith (rest in peace) left a good legacy in the Shadow duology.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever I play this game since my childhood now I am adult this game never disappoint me.... Trust me you like it.. I am waiting for new game+.. but it never comes.. sorry 😐😐😐 it never comes equal.. sorry 😔😔",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Middle-earth: Shadow of War is a massive and ambitious action game that delivers an epic sense of scale. From single stealthy murders up to the never-ending fortress battles available via online play, Shadow of War is a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't have many words to describe this great game...\nI can only say that it's a work of art from beginning to end, and its multiplayer is a lot of fun. Even at a certain point, you compete to gather the best orcs when attacking other players' fortresses online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the combat but the keybinding very bad and some times it buggs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great graphics, great story!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect army building game with amazing story and its not even a army builder game mainly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arkham meets Assassin's Creed meets LotR, whats not to like. Also nemesis system is cool and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's absolutely brilliant. The stories that naturally emerge out of playing are some of my most treasured gaming memories. I will carry the names of my favorite orcs with me forever, and think of them often: Lorm the Friendly, Horza the Literate One, Borgu the Surgeon, and so many more.\n\nAnd of course my greatest nemesis, Ghura the Unashamed -- we met many times on the battlefield. He bested me over and over and over again, and would taunt me with vicious reminders of my past shortcomings whenever we crossed paths. I savored every moment of his demise at the hands of some of my best captains.\n\nThe Nemesis system is pure genius, and I've never encountered something quite like it in all my years of gaming: even when you **know** how it works, and you understand that ultimately it is just tracking certain gameplay states, assigning weights and values to interactions you have, it doesn't matter and **it's still magical and you still get lost in it.** The suspension of disbelief the game is capable of giving you is immersive and delightful. \n\nAs a quick note: the first act is painfully long and you must persevere through it to get to the 'good stuff' (aka, collecting Orcs). Stick with it, I promise it gets better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mechanics, I love LOTR so that already a plus, it has aged well considering how it started. Too bad the Nemesis System has been patented just to be left in the shelves instead of creating or allowing more creators to use this awesome mechanic. \r\n\r\nThat Aside, this game is actually really fun, and it offers a lot of content that feels worth your time. I recommend giving it a try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "В целом даже сейчас, почти в 26 году, играется очень приятно. Не обошлось конечно без различных багов управления, да и вариаций анимаций не особо много, но играется хорошо и интересно. Думаю тем, кто фанатеет и разбирается в лоре средиземья даже больше интереснее. 4 акт - или эпилог - в игре затянут и не интересен, разве что, но даже так я бы поставил игре твердую 7.5\\10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is by far the best game I have I first bought it on my old xbox one a month after release and the game is so fun can never get bored of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game that is unlike any other, only issue is that to 100% the game you need to buy DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got this game when it first came out. So add 500 plus hours. \n\nMonolith got a lot of hate for the in games micro transactions and rightly so. Thats since been removed so putting that aside.  Shadow of War, takes almost everything from the first game and improves it.\n\nCombat has been expanded. Overlords, Castle Sieges, Drakes, Ologs, Followers, Bodyguards, The world has more maps, Unique Uruk Tribes....You can easily sink 100hrs into this and miss 3 days of college.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved playing Shadow of mordor so got shadow of war and loved every minute of the game being able to play through middle earth and explore and conquers regions was super fun. Running the online conquest was also super fun to do and see what kinda insane champions everyone have conquered. Find myself going back and coming back to the game time and time again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is stupid, make no mistake. Does not fit with the books, the movies or anything else and the plot is mediocre. However, it has the best gameplay of any of the 300+ games I have played in my life. The combat is brilliant, the stealth is brilliant, and the army management is brilliant. I love this game more than I love skyrim, and that's saying something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this game is amazing. The story and ending were something else, and the armor is the most beautiful fantasy armor I've ever seen. The combat is WB slop perfected.\n\nThe biggest issue is that not only do late-game conquests feature hacked orcs, but sometimes whenever you reach an overlord, you will fall through the floor, failing the conquest. This is an exploit that hasn’t been fixed, so after spending 80 hours collecting the finest orcs only to have them go up against hacked orcs, it makes you feel like you’ve wasted your time even collecting them.\n\n I've completely given up moving up the ranks in conquest because theses exploits have made it impossible to win for no personal gain of the person using said exploits. \n\nEmbarrassing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game Nemesis system one of the best game mechanics \r\nyou love RPG games then you need to absolutely play this game\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely Tons of fun with i, seems to be working well on my Trash PC still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Franchise, worth playing just for it's story, the rest of the content is a nice bonus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game: good fighting mechanics, graphics still hold up in 2025, interesting story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a peak game. The characters and their actors performances are excellent, the story is pretty good and the combat system mixed with the nemesis system is just chefs kiss.\r\n\r\nWorth the purchase",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Continuation of Shadow of Mordar. This is really a good game, a lot of new things to do compared to its first game (SOW). The story is quite fascinating. The only frustrating part is when we are about to fight a bosses, we always have to listen to their speech first and it takes around 10-20 seconds without having an option to skip it. Its kinda frustrating considering that we always have to fight bosses from time to time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If like the game, that gives you lots of freedom in choosing how you want to play, than this is for you. Choose the play style you like and immerse yourself into the world of Middle Earth. Great balance of challenging fights and great story, this game just sucks you in and you do not notice how you spend hours.\r\nHighly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the most innovate game since Skyrim, everyone appreciated the new gameplay, compabt etc yet the innovations were not adopted by any other game since. This one remained a sort of white unicorn. A game probably too advanced for its time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No idea what the story is and I don't care, but apparently I've finished it.\r\nI just like killing and torturing Orcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's repetitive but fun and cathartic in a way so, if you're coworkers are getting to you - Kill an Orc, If your spouse is getting on your nerves - Kill an Orc, if your mom or dad or both are just plain annoying you - KILL AN ORC!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best games of all time, really good writing and the domination mechanic is so so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. The single thing to complain is that in the snow map when the weather is rainy it rains instead of snowing . I very recommend this game.Also try the shadow of Mordor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game. if you liked shadow of mordor, you'll like this. freaking uruks that kill you that start to taunt you is the best system to ever exist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game that never ends. \r\nLove the Nemesis system. \r\nDLCs are super short.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has an epic vibe and the combat is fluid, fun and beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story isn't the most lore acurate, but im still enthraled and moved by it. It's the best LotR game i have played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of War is a great game for every Lord of the Rings fan. The gameplay is fun, and the Nemesis System is one of the coolest systems ever created—it’s just a shame that the studio patented it and isn’t doing anything with it. I really enjoyed playing the game, but it does get repetitive toward the end. The story is pretty alright. The 100% wasn’t that bad either, until I got to the DLC, which was awful. The game gets a 6.5/10, and the 100% gets a 5/10.\n\nThe Nemesis System being patented should honestly give this game -3 points, but I didn’t account for that in the review. Just know that I’m still mad about it. I’m still waking up from fever dreams about that system to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is awesome and all the sidequests are not simply quests, they also add to the story. More importantly, the overwhelming variety in Ork captains that you can fight is insane. People say the Nemesis system is being abandoned, that doesn't mean it's disappearing, just means it's not going to get better. For what it currently is, its pretty damn epic. You always have someone to fight, on the way to fighting someone else, or in between missions.\r\n\r\nI'd recommend this game, 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for an RPG to satisfy that Witcher 3 itch, this one is sufficient. Not a full open world kind of experience like Witcher 3, and combines elements from board game war craft ish kind of feel which are interesting, but it does scratch that itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nemesis System is just WAY TOO OP no matter how many times I win or complete this game I always come back for it.\n\nNot just that even still I find new commanders new dialogues and everything. Just awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so good. I specially enjoyed the Desolation of Mordor DLC as it felt like a Dune inspired LOTR adventure.\n\nGive it a try if you haven't!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is bit weaker experience than previous game (that was 10/10 experience).\n\nFirst the good things:\n- very good soundtrack and main music theme\n- graphic and level design\n- several nice and distinct open world maps\n- combat is still fun\n- main missions and main characters\n- orcs characters\n- multiple summonable  mounts (including Graugh and Drake)\n\n\nNow bad things and why the experience is worse:\n- too much repetetive tedium with Nemesis system and Castle siege, in previous game, it was fine with doing it twice, here you have to do it SEVERAL times.\n- currency system, GUI animations and design reeeeks cheap gatcha game.\n- unskippable orcs monologues that are WAAAAY TOOOOO LOOONG and frequent.\n- climb/jump/parkour system is still clunky and often unresposive.\n- my character go blocked/stuck in way too many places for no apparent reason.\n- game is longer, but majority of it is a repetetive filler content.\n\nOverall it's 8.5 / 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is fun and the story a great shocking follow up from the first entry. Savor it this is one of the few rare good ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I ran around Mordor swinging a sword and cutting orcs. They did not appreciate. I had fun though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wish it was longer. I feel like the game has great bones but not a lot of meat on them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, but story is a little mediocre and combat is to easy so max out difficulty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved this.  Really excellent use of the open world format that's just fun and engrossing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very good game with a good story and the combat mechanics are very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive and worth buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good game and i love the nemeis system. its very fun and i love the orcs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing combat and story narrative. If you do not like it you just are not into quality RPG action games clearly lmfao.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game here. You can tell that they really improved upon Shadow of Mordor with this one. There is a much bigger open world, you can command armies to attack forts, and complete the main storyline. If you are a Lord of the Rings fan I recommend. If you like those multiplayer games where you run into a fight, get a kill, then get killed, then repeat for 2 hours, you will not like this game lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]On winds and waters may you cross\r\nSee mountains white and blue\r\nBut on your road, lest not forget\r\nThe love I have for you [/i]\r\n\r\nReally decent LOTR story and side quests, nice standout element of captain orcs system and diverse enough (albeit a bit tiresome after a while) gameplay. All in all, great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get ambushed by some random guy you killed near the beginning of the game during a mission that takes place way before the actual start of the game\r\n\r\nabsolute cinema",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game, but to elaborate, I love this game's gameplay and the Nemesis system in particular. The story is super mid but the setting is fantastic, seeing as it's LOTR. Otherwise, Tallion and Celebrimbor are a fantastic pairing, but everything surrounding them story-wise is boring, predictable and uninteresting.\n\nWhat makes the game interesting for me are the Orcs that you can find around the different regions with their unique looks, traits, voice lines, etc. I love going around hunting for some cool looking orcs with strong skills so I can recruit them into my army.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm so glad I found this game, it's so good! It has similar aspects as Assassin's Creed but with better movement and combat. Here my ratings:\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☑ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slightly woke compared to the original but still a solid game with a decent conclusion to Talion's story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As  a Lord of the Rings fan this is an absolute blast. I love the DLC and the upgraded graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good sequel with plenty of improvements on the previous game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still want a third title with Celebrimbor as the main villain and maybe Baranor or Eltariel as the PC... Also nemesis system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beat the game twice on xbox the bought it for 5 bucks here def worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman with swords and magic. Radical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shadow of War is essentially an orc eugenics simulator while you wait for some hobbits to throw the one ring into mount doom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great story and combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so sad to see people not metioning this game as much but this game was my childhood and i always played it and i just wish that people who play this game got an update for this game or even better: more people would play this. anyways thank you shadow of war for everything old and new, 11/10.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Fun at the start, then it gets insanely repetitive. The unskippable taunts from orcs gets old REAL quick and boy do they talk so much.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I tried so hard to like this one. Shadow of Mordor was so good and fluid but this is just horrible. Every 3 seconds you're pulled out of the action by some forced cut scene or cut to an inventory menu or explanation of something. It's so jarring and un-fun to lose control of your character in the middle of the action to watch some stupid orc say things for 20 seconds. Combat feels way more janky with a focus on gear level and AOE attacks and powers as opposed to actually using your sword. It's just way less fun and way more frustrating of a formula than the first game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h2]The game was fine, but I'll be honest, the Collect-a-thon elements and repetitiveness meant it got stale rather quick. DNF[/h2]\n\nBy hour 9, I'd captured my first fortress with my orc army, moved to another new region, and realised I had to do it all again, probably 3-4 more times at least before the end... I'd had enough.\n\nI'd say it no longer holds up to more modern gaming standards. Far too padded out with filler, for me. If your tolerance for that sort've stuff is low, give this a miss.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have grown to hate orcs like no other species on middle-earth. The intros are beyond annoying!\nAlso, I have never in my life said \"Oh my gooooood-\" this often. Talion would always attack the wrong enemy and ,instead of dodging, my guy would just stand there and take hits! The game mechanics as a whole just seem really bad. \n\nThe story itself, is as always, more like a crazy fanfiction. The beginning was great, although I would have loved to have more actual story than combat. The main story feels so terribly shallow and short, much like the characters that fight alongside Talion.\n\nIt just felt like a chore. Though for the price of just 3€...\nIf you are a big fan of Lord of the Rings then feel free to play it!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "On sale, for example now, a Black Friday sale, yes, but otherwise a hard NO, because definitely,  while the gameplay and gaphics are cool, narratively it stats great but ends so bad, both games have a geat stat but a very mediocre final.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I find this game to be extremely mid, it doesn't completely suck but it's far from good. Luckily I bought this for a 1€ and for that price I can recommend it if you're interested.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game's great. I played the after-campaign endless sandbox on my PlayStation 4 for probably at least 500 hours. Just mindlessly killing and recruiting uruks and ologs like it was a fidget toy while listening to podcasts.\n\nThe reason for the negative recommendation is because this port is bad, I guess. I have a good computer, a verifiable rocket ship by the standards this game had when it came out. I've tried every fix I could find online and no matter what I did, I could not stop the game from Stuttering and hanging frames. Seeing as this game's difficulty is 90% reaction time, the game stopping to stutter in the middle of even low intensity fights with only a handful of orcs, much less the huge horde warfare that the game is partially famous for, makes it a hard pass for me.\n\nPretty sure you can still snipe this title on Consoles, I'd recommend that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mechanics are doodoo.  I've been most frustrated with the game just willy nilly deciding who you're attacking next, regardless of the direction you're trying to move.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game its is ok so far; Its just so hard to launch and keep the game running.  Launch 3 times, failing all 3.  Adjust an overlay, or other setting. Finally launch the game; then crash on load in.  This goes on and on. Don't forget the crash every time I travel.  Having to research each time I crash is time consuming. Finally I completed all the recommended steps, game won't launch. I9(14k),RTX 4090, 128G ram, SSD.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont remember before i used to play this game,but whatever you did to it since then its become a trash,there is absolute no mechanics in the game that works against captains except scaring them and killing them stealthy,the adapt to everything and u cant even fight normal yet alone use any of the skills,if u get into a group of captains,wich you will because every 15 minutes of the game there is \"cheated death/ambush\" and they adapted so you cant vault them,they are arrow proof,imune to stealth and enraged by everysingle thing in this game. Complete and utter stupidity of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shadow of modor was good but this game after starting to play kinda stucks at the loading ....unable to play ....\r\nseems like devs are not interested in fixing this issue and its a major issue cant play the game at all .......read a lot of reddit post and i came into the conclusion that my peace of mind is important soo im uninstalling the game just after 3 hours of playing......good luck if you already bought it.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun for like the first 10 hours, but after that it's just repetetive and the cutscenes drive you crazy. The dlc's add some cool content but not really worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed Shadow of Mordor. The game looked great, the nemesis system was cool, and I just had a ton of fun with it. So when the sequel rolled out I thought \"neat!, a sequel\"(that's me being super excited).\n\nGothic sexy Shelob aside, this felt like a basic return to form. It was familiar, it added a few new touches, and it ran perfectly on the Steam Deck with the default settings.\n\nNow for the bad stuff.\n\nShadow of Mordor took a lot of liberties with its story but it still kept me hooked. Shadow of War did not pull that off for me. Even with the addition of the goth hottie, the story just never grabbed me. I pushed through for a while, cleared areas like I did in the first game, and right when I thought I was close to the end the map opened up a ton and I just checked out. What felt fresh in the first game felt repetitive here and the story just was not strong enough to keep me going.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat and stealth of akrham combat and movement of assassins creed sounds good until you remember that his is in the LOTR universe so they gotta go out of their way to make it suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth the time it took to download. Honestly very hard to get into if you are not a die-hard LOTR fan. The game plays like a batman copy re-skinned into Mordor. Save your money if you are looking for a leading-an-army kind of game, this is not it. Gameplay wise a third person view game with a simple combat formula of timed based hit and run mob fights as you've seen it with other games (e.g. Arkham City). Monologues by forgettable generic characters (none of which you can skip)  occur mid-combat and way too often - completely at random and breaking immersion. The repetitive combat is quickly becoming tiresome, and there is simply no variety to the gameplay. Playing this game is simply put not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hello,\nI have a bug, that the game doesn´t save my progress, every time i quit, i start new from chapter 1. That makes it  unplayable. A little research shows, it´s a known problem. I hope they´ll fix it, becuase it looks promising. Until then thumbs down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did not finish. What a piece of shit game. Coming back to add more I'm actually astonished at how ass this game is steam should have a policy that if WB games releases something they should allow you to return it if you've played under 30 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game mek i want evry timed playing this i spent it crying me eyebawwls out dewd it isnt the fun game pls thx darling xxx love",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is shit and was made by retarded people. Everything besides gameplay is cool. Should have been a movie or something, playing it is a fucking torture.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A repetitive of Shadow of Modor, don't expect more! What a letdown!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gotta hand it to all of you LOR fans - you have a ton of patients and imagination. I own Shadows of Modor, payed it about an hour and gave up. Hoped this one would improve... nope. Same complicated game play, annoying in play overlays (orks and such), falling to your death or being totally blindsided by whats not revealed. It feels like a  cross between a cartoon and an attempt at lifelike gameplay. Story pushes you rather than guides you and you die a whole bunch just to respawn the start of a mission with (as far as I tell) no game saves for current progress. I can see how after potentially days and weeks of playing one might start to see progress. Graphics are good, story has potential, but there are just  way too many distractions for me. But to be honest, I'm not  really a fan of the starwars games either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]I bought it, I tried it, I uninstalled it. Maybe good, but not for me[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated Mess inferior to it's predecessor.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no voice audio in the very first cutscene of the game (not sure about the rest of game), tried everything possible without success.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sound quality is so bad that it blew out my headphones. WB owes me a new headset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fucking ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the orc intros are so fkn annoying",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same as the other one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"This is not the end I have fought for.\"\n- Talion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "woke devs, fvck 'em.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Please let me buy more DLCs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm enjoying this game and it is fun BUT it is constantly trying to phone home. I block everything on my firewall that really has no business connecting to the internet but this game is constantly trying to do so AND refusing to run unless I do. In addition to this the terms of service clearly state you don't own the game you bought.\n\nIt is fun, I will play it to the end and enjoy it but do consider those two points and whether you want to support those business practices.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Fun at the start, then it gets insanely repetitive. The unskippable taunts from orcs gets old REAL quick and boy do they talk so much.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "You can ignore this review if you plan to play the game on any of the easy difficulties. \r\n\r\nAfter basically finishing the game on Brutal - i recommend against getting this game, and you should know that playing this game is akin to killing your sanity through a thousand paper cuts in the form of an egregious amount of bad design decisions. \r\n- Captains with certain combinations of modifiers are borderline unkillable and not fun to interact with, this is amplified when they don't have a meaningful weakness and even more so due to the adapt mechanic and enemy self healing. \r\n- There is a modifier called \"No Chance\" that just straight up nullifies the safety-net of reviving after being downed, this is the most un-fun modifier there is and serves no purpose other than to ruin your run immediately. If you add a safety-net and remove it, you might aswell just not add it in the first place. \r\n- Captains introducing themselves should be skippable, it gets really obnoxious after some time. Dialogue being obnoxious is amplified to the extreme when you fight against the reanimated captains as they sometimes just stand in silence for 15+ seconds without saying anything. \r\n- Captains SHOULD NOT be able to initiate dialogue while you're downed, locking you out of control while the QTE runs in the background. (this happened to me exactly once)\r\n- Certain actions should give the player invincibility frames, dialogues, inspections and such can leave you with a timeframe where you can't control the character which leads to unfair hits and deaths. \r\n- \"Broken\" Captains can only be shamed and recruited, but not killed when drained, this sucks. \r\n- As with most games where you can climb, you can get stuck on ledges. Climbing sideways sucks extremely and the inability to jump off from the middle of the wall rather than to \"fall\" feels bad. \r\n- Ranged enemies shouldn't deal more damage than meele ones as they have less counterplay. \r\n- Ranged enemies \"warning\" that they're shooting is too short in comparison to the \"counter\" prompt for meele enemies,  \r\n\r\nThe game basically has a lot of the same issues as the first game did, but now in Nemesis flavor. (Its basically the same game, but more content)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Amazing setting and graphics.They fcked up the satisfying killing of orcs tho somehow and it really just falls short from the first one.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Game's great. I played the after-campaign endless sandbox on my PlayStation 4 for probably at least 500 hours. Just mindlessly killing and recruiting uruks and ologs like it was a fidget toy while listening to podcasts.\n\nThe reason for the negative recommendation is because this port is bad, I guess. I have a good computer, a verifiable rocket ship by the standards this game had when it came out. I've tried every fix I could find online and no matter what I did, I could not stop the game from Stuttering and hanging frames. Seeing as this game's difficulty is 90% reaction time, the game stopping to stutter in the middle of even low intensity fights with only a handful of orcs, much less the huge horde warfare that the game is partially famous for, makes it a hard pass for me.\n\nPretty sure you can still snipe this title on Consoles, I'd recommend that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried so hard to like this one. Shadow of Mordor was so good and fluid but this is just horrible. Every 3 seconds you're pulled out of the action by some forced cut scene or cut to an inventory menu or explanation of something. It's so jarring and un-fun to lose control of your character in the middle of the action to watch some stupid orc say things for 20 seconds. Combat feels way more janky with a focus on gear level and AOE attacks and powers as opposed to actually using your sword. It's just way less fun and way more frustrating of a formula than the first game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As someone who very rarely doesn't finish a game and someone who loved Shadow of Mordor this is a hard one. There is a great game in here, the game play loop is very fun, but its so bloated with unrefined systems and trying to do too many things at once. \n\nHowever, that alone would make it a 6/6.5/10, buy it on sale (like i did), or only if you are a huge fan of the Arkham style combat. That being said, the UI runs great for 45 minutes, and then it just decides to have an anurism and do the most insane shit for no damn reason, targeting people off screen or running up a wall in the middle of a fight. \n\nThe Nemesis system too, is overhyped. In SoM it was new and innovative (and the game had far less bloat from being an actual game and not a microtransaction sim like SoW was on release, that was 1/10 trash), but now it feels forced and stale. Theres nothing interesting or cool about 3 mini cutscenes mid battle because more captains just showed up, its artifical dificulty spikes for the hell of it. \n\nFinally on the lore. I actually dont mind as its SO off the rails that it doesn't even resemble Lotr in a lot of ways. This isnt even a negative, just view it as a cool fantasy story and not canon and its perfectly cromulent.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont remember before i used to play this game,but whatever you did to it since then its become a trash,there is absolute no mechanics in the game that works against captains except scaring them and killing them stealthy,the adapt to everything and u cant even fight normal yet alone use any of the skills,if u get into a group of captains,wich you will because every 15 minutes of the game there is \"cheated death/ambush\" and they adapted so you cant vault them,they are arrow proof,imune to stealth and enraged by everysingle thing in this game. Complete and utter stupidity of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I find this game to be extremely mid, it doesn't completely suck but it's far from good. Luckily I bought this for a 1€ and for that price I can recommend it if you're interested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shadow of modor was good but this game after starting to play kinda stucks at the loading ....unable to play ....\r\nseems like devs are not interested in fixing this issue and its a major issue cant play the game at all .......read a lot of reddit post and i came into the conclusion that my peace of mind is important soo im uninstalling the game just after 3 hours of playing......good luck if you already bought it.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mechanics are doodoo.  I've been most frustrated with the game just willy nilly deciding who you're attacking next, regardless of the direction you're trying to move.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun for like the first 10 hours, but after that it's just repetetive and the cutscenes drive you crazy. The dlc's add some cool content but not really worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed Shadow of Mordor. The game looked great, the nemesis system was cool, and I just had a ton of fun with it. So when the sequel rolled out I thought \"neat!, a sequel\"(that's me being super excited).\n\nGothic sexy Shelob aside, this felt like a basic return to form. It was familiar, it added a few new touches, and it ran perfectly on the Steam Deck with the default settings.\n\nNow for the bad stuff.\n\nShadow of Mordor took a lot of liberties with its story but it still kept me hooked. Shadow of War did not pull that off for me. Even with the addition of the goth hottie, the story just never grabbed me. I pushed through for a while, cleared areas like I did in the first game, and right when I thought I was close to the end the map opened up a ton and I just checked out. What felt fresh in the first game felt repetitive here and the story just was not strong enough to keep me going.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "late game is too repetitive\r\ncap last fort > every other fort under siege > retake > under siege > retake > under siege\r\nearly / mid game is fun \r\norcs that are immune to almost everything is annoying making this simple combat even worse\r\ncharacters are kinda bland with everyone just being power hungry, at least ratbag is unique\r\nthe core message of the story is good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, sadly it permanently crashes, would be great if this wasn't the case",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, if you dont like games like Rust, or most any pvp style game.  Odds are you will struggle to like this game.  I got 100 hours in game atm.  litteraly 40 hours of that has been spent in the game menu, sorting/ scrapping gear, upgrading, and so on.  As well as char skills changing them time after time as situation needs.  because there is no quick, easy way to do any of this.\n\nCons \n\n1 Game menus and item management.\n2 Loot drops are random, with random stats,\n3 no good way to lvl orcs in a fun, meaningful way.  Like having them be your body guard and do missions and gaing lvls quickly.  and no way to pick any of their skills without paying in game money.\n(yes u can get orc body guard, yes it will follow and sometimes converse, and IF IT gets the final hit kill, it will gain 1...... single, lvl. 1......  making it so slow and agonzing to lvl more than 1 orc in any meaningful way.\n4.  the open world is stale.  just orcs roaming.  u recruit, u kill. rinse repeat.........  no real interactions, u just go out, farm orcs to  collect, or kil, while farming in game money, and drops.....  \n5 much like 4.  u go online and do conquests....... which for me were ok, or fun at times but once u get to where people know what they doing the fun goes down hard. to the point i rage logged.  no fun for me to fight multiple boss orcs at once that are god like stats, with 10+ other orcs on u as well.  \n6.  no real endgame.  no real explaination of anything.  u have no clue how to setup assaults, defenses, how pit fights work. and on and on. like the nemesis system.  why do some turn why dont some?\n7 the pit fihts.  have 0 purpse.  no exp gaings, no anything.  and pit fighter champ means nothing to little in big battles.\n\nPros....... the fighting early or in normal pve is fun enough.  and of course the nemesis system and voice acting.  \nstory is fine enough\nwhat world there is to see is nice to look at.  but u seldom really get a chance to stop and look.  always being hunted or attacked or something....... \n\nConclusion..... its fun enough for me for stickin to pve single player mode.  mid game it crashes hard in fun mode value for many other reasons that its poorly designed for fun.\n\nthis was built for profits.......  not fun.  they removed the loot boxes but left all the loot box mechanics in the game anyways.  all that bs grind is still here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is nonexistent (and extremely far from original works). Gameplay is tedious, bloated with junky mechanics.\r\nShame. Because shadow of mordor was actually quite enjoyable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth the time it took to download. Honestly very hard to get into if you are not a die-hard LOTR fan. The game plays like a batman copy re-skinned into Mordor. Save your money if you are looking for a leading-an-army kind of game, this is not it. Gameplay wise a third person view game with a simple combat formula of timed based hit and run mob fights as you've seen it with other games (e.g. Arkham City). Monologues by forgettable generic characters (none of which you can skip)  occur mid-combat and way too often - completely at random and breaking immersion. The repetitive combat is quickly becoming tiresome, and there is simply no variety to the gameplay. Playing this game is simply put not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game mek i want evry timed playing this i spent it crying me eyebawwls out dewd it isnt the fun game pls thx darling xxx love",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is like doritos. Engineered to be addictive, but no nutritional value whatsoever, and if you're not feeling bad about yourself after eating the whole bag, then I don't know what to tell you man.\n\nPS. If like me you were curious about the AMAZING NEMESIS SYSTEM (TM), then let me tell you, it's a shitty and boring gimmick they built the whole game around. A few random weaknesses and strengths thrown onto each guy, along with some \"personality\" (they will always give some speech before you kill them, sometimes funny I will admit). Glad I spent only £3 on it, I'd be furious otherwise. Now I'm just sad they stole 10 hours of my life.\nAnd the story sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is shit and was made by retarded people. Everything besides gameplay is cool. Should have been a movie or something, playing it is a fucking torture.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A repetitive of Shadow of Modor, don't expect more! What a letdown!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gotta hand it to all of you LOR fans - you have a ton of patients and imagination. I own Shadows of Modor, payed it about an hour and gave up. Hoped this one would improve... nope. Same complicated game play, annoying in play overlays (orks and such), falling to your death or being totally blindsided by whats not revealed. It feels like a  cross between a cartoon and an attempt at lifelike gameplay. Story pushes you rather than guides you and you die a whole bunch just to respawn the start of a mission with (as far as I tell) no game saves for current progress. I can see how after potentially days and weeks of playing one might start to see progress. Graphics are good, story has potential, but there are just  way too many distractions for me. But to be honest, I'm not  really a fan of the starwars games either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]I bought it, I tried it, I uninstalled it. Maybe good, but not for me[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no voice audio in the very first cutscene of the game (not sure about the rest of game), tried everything possible without success.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sound quality is so bad that it blew out my headphones. WB owes me a new headset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh, I just got bored",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the orc intros are so fkn annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same as the other one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"This is not the end I have fought for.\"\n- Talion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมกาก",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please let me buy more DLCs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm enjoying this game and it is fun BUT it is constantly trying to phone home. I block everything on my firewall that really has no business connecting to the internet but this game is constantly trying to do so AND refusing to run unless I do. In addition to this the terms of service clearly state you don't own the game you bought.\n\nIt is fun, I will play it to the end and enjoy it but do consider those two points and whether you want to support those business practices.",
      "voted_up": false,
      "votes_helpful": 107
    },
    {
      "review": "Fun at the start, then it gets insanely repetitive. The unskippable taunts from orcs gets old REAL quick and boy do they talk so much.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Amazing setting and graphics.They fcked up the satisfying killing of orcs tho somehow and it really just falls short from the first one.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "You can ignore this review if you plan to play the game on any of the easy difficulties. \r\n\r\nAfter basically finishing the game on Brutal - i recommend against getting this game, and you should know that playing this game is akin to killing your sanity through a thousand paper cuts in the form of an egregious amount of bad design decisions. \r\n- Captains with certain combinations of modifiers are borderline unkillable and not fun to interact with, this is amplified when they don't have a meaningful weakness and even more so due to the adapt mechanic and enemy self healing. \r\n- There is a modifier called \"No Chance\" that just straight up nullifies the safety-net of reviving after being downed, this is the most un-fun modifier there is and serves no purpose other than to ruin your run immediately. If you add a safety-net and remove it, you might aswell just not add it in the first place. \r\n- Captains introducing themselves should be skippable, it gets really obnoxious after some time. Dialogue being obnoxious is amplified to the extreme when you fight against the reanimated captains as they sometimes just stand in silence for 15+ seconds without saying anything. \r\n- Captains SHOULD NOT be able to initiate dialogue while you're downed, locking you out of control while the QTE runs in the background. (this happened to me exactly once)\r\n- Certain actions should give the player invincibility frames, dialogues, inspections and such can leave you with a timeframe where you can't control the character which leads to unfair hits and deaths. \r\n- \"Broken\" Captains can only be shamed and recruited, but not killed when drained, this sucks. \r\n- As with most games where you can climb, you can get stuck on ledges. Climbing sideways sucks extremely and the inability to jump off from the middle of the wall rather than to \"fall\" feels bad. \r\n- Ranged enemies shouldn't deal more damage than meele ones as they have less counterplay. \r\n- Ranged enemies \"warning\" that they're shooting is too short in comparison to the \"counter\" prompt for meele enemies,  \r\n\r\nThe game basically has a lot of the same issues as the first game did, but now in Nemesis flavor. (Its basically the same game, but more content)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I tried so hard to like this one. Shadow of Mordor was so good and fluid but this is just horrible. Every 3 seconds you're pulled out of the action by some forced cut scene or cut to an inventory menu or explanation of something. It's so jarring and un-fun to lose control of your character in the middle of the action to watch some stupid orc say things for 20 seconds. Combat feels way more janky with a focus on gear level and AOE attacks and powers as opposed to actually using your sword. It's just way less fun and way more frustrating of a formula than the first game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h2]The game was fine, but I'll be honest, the Collect-a-thon elements and repetitiveness meant it got stale rather quick. DNF[/h2]\n\nBy hour 9, I'd captured my first fortress with my orc army, moved to another new region, and realised I had to do it all again, probably 3-4 more times at least before the end... I'd had enough.\n\nI'd say it no longer holds up to more modern gaming standards. Far too padded out with filler, for me. If your tolerance for that sort've stuff is low, give this a miss.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have grown to hate orcs like no other species on middle-earth. The intros are beyond annoying!\nAlso, I have never in my life said \"Oh my gooooood-\" this often. Talion would always attack the wrong enemy and ,instead of dodging, my guy would just stand there and take hits! The game mechanics as a whole just seem really bad. \n\nThe story itself, is as always, more like a crazy fanfiction. The beginning was great, although I would have loved to have more actual story than combat. The main story feels so terribly shallow and short, much like the characters that fight alongside Talion.\n\nIt just felt like a chore. Though for the price of just 3€...\nIf you are a big fan of Lord of the Rings then feel free to play it!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "On sale, for example now, a Black Friday sale, yes, but otherwise a hard NO, because definitely,  while the gameplay and gaphics are cool, narratively it stats great but ends so bad, both games have a geat stat but a very mediocre final.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I find this game to be extremely mid, it doesn't completely suck but it's far from good. Luckily I bought this for a 1€ and for that price I can recommend it if you're interested.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game's great. I played the after-campaign endless sandbox on my PlayStation 4 for probably at least 500 hours. Just mindlessly killing and recruiting uruks and ologs like it was a fidget toy while listening to podcasts.\n\nThe reason for the negative recommendation is because this port is bad, I guess. I have a good computer, a verifiable rocket ship by the standards this game had when it came out. I've tried every fix I could find online and no matter what I did, I could not stop the game from Stuttering and hanging frames. Seeing as this game's difficulty is 90% reaction time, the game stopping to stutter in the middle of even low intensity fights with only a handful of orcs, much less the huge horde warfare that the game is partially famous for, makes it a hard pass for me.\n\nPretty sure you can still snipe this title on Consoles, I'd recommend that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mechanics are doodoo.  I've been most frustrated with the game just willy nilly deciding who you're attacking next, regardless of the direction you're trying to move.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As someone who very rarely doesn't finish a game and someone who loved Shadow of Mordor this is a hard one. There is a great game in here, the game play loop is very fun, but its so bloated with unrefined systems and trying to do too many things at once. \n\nHowever, that alone would make it a 6/6.5/10, buy it on sale (like i did), or only if you are a huge fan of the Arkham style combat. That being said, the UI runs great for 45 minutes, and then it just decides to have an anurism and do the most insane shit for no damn reason, targeting people off screen or running up a wall in the middle of a fight. \n\nThe Nemesis system too, is overhyped. In SoM it was new and innovative (and the game had far less bloat from being an actual game and not a microtransaction sim like SoW was on release, that was 1/10 trash), but now it feels forced and stale. Theres nothing interesting or cool about 3 mini cutscenes mid battle because more captains just showed up, its artifical dificulty spikes for the hell of it. \n\nFinally on the lore. I actually dont mind as its SO off the rails that it doesn't even resemble Lotr in a lot of ways. This isnt even a negative, just view it as a cool fantasy story and not canon and its perfectly cromulent.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game its is ok so far; Its just so hard to launch and keep the game running.  Launch 3 times, failing all 3.  Adjust an overlay, or other setting. Finally launch the game; then crash on load in.  This goes on and on. Don't forget the crash every time I travel.  Having to research each time I crash is time consuming. Finally I completed all the recommended steps, game won't launch. I9(14k),RTX 4090, 128G ram, SSD.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont remember before i used to play this game,but whatever you did to it since then its become a trash,there is absolute no mechanics in the game that works against captains except scaring them and killing them stealthy,the adapt to everything and u cant even fight normal yet alone use any of the skills,if u get into a group of captains,wich you will because every 15 minutes of the game there is \"cheated death/ambush\" and they adapted so you cant vault them,they are arrow proof,imune to stealth and enraged by everysingle thing in this game. Complete and utter stupidity of game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shadow of modor was good but this game after starting to play kinda stucks at the loading ....unable to play ....\r\nseems like devs are not interested in fixing this issue and its a major issue cant play the game at all .......read a lot of reddit post and i came into the conclusion that my peace of mind is important soo im uninstalling the game just after 3 hours of playing......good luck if you already bought it.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun for like the first 10 hours, but after that it's just repetetive and the cutscenes drive you crazy. The dlc's add some cool content but not really worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed Shadow of Mordor. The game looked great, the nemesis system was cool, and I just had a ton of fun with it. So when the sequel rolled out I thought \"neat!, a sequel\"(that's me being super excited).\n\nGothic sexy Shelob aside, this felt like a basic return to form. It was familiar, it added a few new touches, and it ran perfectly on the Steam Deck with the default settings.\n\nNow for the bad stuff.\n\nShadow of Mordor took a lot of liberties with its story but it still kept me hooked. Shadow of War did not pull that off for me. Even with the addition of the goth hottie, the story just never grabbed me. I pushed through for a while, cleared areas like I did in the first game, and right when I thought I was close to the end the map opened up a ton and I just checked out. What felt fresh in the first game felt repetitive here and the story just was not strong enough to keep me going.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat and stealth of akrham combat and movement of assassins creed sounds good until you remember that his is in the LOTR universe so they gotta go out of their way to make it suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth the time it took to download. Honestly very hard to get into if you are not a die-hard LOTR fan. The game plays like a batman copy re-skinned into Mordor. Save your money if you are looking for a leading-an-army kind of game, this is not it. Gameplay wise a third person view game with a simple combat formula of timed based hit and run mob fights as you've seen it with other games (e.g. Arkham City). Monologues by forgettable generic characters (none of which you can skip)  occur mid-combat and way too often - completely at random and breaking immersion. The repetitive combat is quickly becoming tiresome, and there is simply no variety to the gameplay. Playing this game is simply put not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hello,\nI have a bug, that the game doesn´t save my progress, every time i quit, i start new from chapter 1. That makes it  unplayable. A little research shows, it´s a known problem. I hope they´ll fix it, becuase it looks promising. Until then thumbs down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did not finish. What a piece of shit game. Coming back to add more I'm actually astonished at how ass this game is steam should have a policy that if WB games releases something they should allow you to return it if you've played under 30 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game mek i want evry timed playing this i spent it crying me eyebawwls out dewd it isnt the fun game pls thx darling xxx love",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is shit and was made by retarded people. Everything besides gameplay is cool. Should have been a movie or something, playing it is a fucking torture.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A repetitive of Shadow of Modor, don't expect more! What a letdown!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gotta hand it to all of you LOR fans - you have a ton of patients and imagination. I own Shadows of Modor, payed it about an hour and gave up. Hoped this one would improve... nope. Same complicated game play, annoying in play overlays (orks and such), falling to your death or being totally blindsided by whats not revealed. It feels like a  cross between a cartoon and an attempt at lifelike gameplay. Story pushes you rather than guides you and you die a whole bunch just to respawn the start of a mission with (as far as I tell) no game saves for current progress. I can see how after potentially days and weeks of playing one might start to see progress. Graphics are good, story has potential, but there are just  way too many distractions for me. But to be honest, I'm not  really a fan of the starwars games either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]I bought it, I tried it, I uninstalled it. Maybe good, but not for me[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated Mess inferior to it's predecessor.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no voice audio in the very first cutscene of the game (not sure about the rest of game), tried everything possible without success.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The sound quality is so bad that it blew out my headphones. WB owes me a new headset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fucking ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the orc intros are so fkn annoying",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same as the other one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"This is not the end I have fought for.\"\n- Talion",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}