{
  "positive": [
    {
      "review": "Legit would not be surprised if they try removing this game to force people to get the 4x as expensive bug riddled ai mess of a remaster. I hope that doesnt happen but remember this is the better version",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "experience really enhanced with modding.\n\nthat doesn't mean the vanilla game isn't good, because this is probably one of the best games I've had the pleasure of experiencing.\n\nin short terms, you shouldn't ask if plants vs zombies is worth your time, you should ask yourself if you're worthy of plants vs zombies' time",
      "voted_up": true,
      "votes_helpful": 40
    },
    {
      "review": "10/10\nI still vividly remember that midsummer of 2009, when the sky was so azure and clear, and the sunlight so bright and dazzling. Back then, carefree and still young, I wore a cool short-sleeved shirt, sitting intently before my computer screen, listening to a magical sunflower sing “There's a zombie on your lawn.” Time seemed to move so slowly back then, each day simple and carefree. Sixteen years later, it suddenly dawned on me: I wasn't just playing a game all along—I was constantly looking back at those irretrievable, youthful days.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Objectively a perfectly executed gem of a game. Infinite charm, zero fat, just pure tower defense fun.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "[h2] Plants Vs Zombies really is something special [/h2] \r\nI have played this game ever since i was a little child, so it holds a lot of nostalgic value to me. I consider this one of my favourite comfort games\r\n\r\nThe aspects that make this game so great are well known, but i'm still gonna go through it real quick:\r\n-The gameplay is simple, yet satisfying and infinitely replayable (even if the stages can feel slow at some points)\r\n-The art is so cute.\r\n-The music is so so good and iconic (especially [spoiler] \"Zombie on your Lawn\") [/spoiler]\r\n-The comedy is so charming\r\n-The plants and zombies are so varied and have really cute designs.\r\n\r\nThis game is a timeless classic for a reason. No matter how hard future installments might fumble, they will never take away from the sheer quality of the first game. Despite how \"not good\" of a remake Replanted was, i have to thank it for bringing my attention back to the original, so that i could experience this game again. \r\n\r\nI would also like to thank the developers and give them the spotlight that Replanted didn't give: \r\n-Thank you, George Fan, for directing this masterpiece\r\n- Thank you, Tod Semple, for your programming that made this game possible\r\n- Thank you, Rich Werner, for your wonderful art\r\n- Thank you, Enrique Corts, for the beautiful backgrounds\r\n- Thank you, Laura Shigihara, for the amazing and iconic music and sound effects\r\n- Thank you, Matt Holmberg, for the consistent UI\r\n- and Thank you, Stephen Notley, for all the charming text\r\n\r\n[h3] Thank you all so much for your wonderful work. I will no doubt replay this game many times in the future. [/h3]\r\nSo yeah. You should totally play this game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "brains!\r\nHella dun game and hella fun to 100%.\r\n\r\nwould be hard to play if youre into crazy dave tho!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Plants vs. Zombies: Get To The Garden! (Full Tactical Debrief)\r\n\r\nListen to me now! I have seen a lot of action, I have crushed many enemies, I have saved the future, but I never thought the greatest battle for Earth's survival would be fought with a lawnmower and a big sunflower! This is not some kindergarten garden club! This is total strategic warfare against the decaying forces of the undead, and you are the only hope for the brain!\r\n\r\nYou need to know something: this game is FANTASTIC! It is simple, it is deep, and it has enough action to make Rambo look like a waiter! It requires strength, intelligence, and the will to survive. You must be relentless!\r\n\r\nPhase I: The Arsenal—More Than Just Vegetables\r\n\r\nYour enemies, they are relentless, they are slow, but they are stupid! You must build your defense, and your plants? They are not plants, they are WEAPONS OF MASS DESTRUCTION! Every single seed packet is a bullet, a bomb, or a brick wall. Choose wisely!\r\n\r\nThe Economic Engine (The Sun Power!)\r\n\r\nThe Sunflower (The PUMP!): You need the sun, GO GET IT! This little guy is the engine of your economy. Without the sun, you are finished. You must plant him first, and you must plant him deep behind the lines! He is the fuel for the fight! Double up, triple up! Maximize sun production, or the war will be lost before it starts.\r\n\r\nThe Twin Sunflower: This is the upgrade! Two suns for the price of one tile! When your economy is established, you transition to these high-output generators. Efficiency is key to victory!\r\n\r\nThe Line of Fire (Attack Specialists)\r\n\r\nThe Peashooter (The Basic Cannon): He is the grunt! The soldier! He shoots straight and hard. Get to work, you sissy! You need him in every lane! A good foundation is built on peashooters!\r\n\r\nThe Split Pea: Double the trouble! Two barrels of justice! One pea forward, and a massive shot backward for those sneaky Digger Zombies. He is your anti-infiltration specialist!\r\n\r\nThe Repeater: Two peas in rapid succession! When the battle turns intense, you upgrade your peashooter to this weapon of continuous fire. Maximum devastation!\r\n\r\nThe Snow Pea (The FREEZE-GUN!): Not only does it hit, it slows them down. This is crucial tactical support. It keeps the zombie mass controllable. You slow them down, you control the pace of the battle!\r\n\r\nThe Close-Quarters Combat & Traps\r\n\r\nThe Wall-Nut (The IMPENETRABLE SHIELD): Look at this big, dumb brute! He stands there and he takes the punishment! When the big zombies come, you put this Wall-Nut down and you say, \"Hasta la vista, baby!\" He buys you time. Time is the power! Replant him instantly when he cracks!\r\n\r\nThe Chomper (The Hungry Beast): He's greedy, he's hungry! One bite, and then he needs to recharge! Use him wisely, or you will be sorry! He eliminates a heavy target instantly, but he is defenseless afterward. Put him behind a Wall-Nut, always!\r\n\r\nThe Potato Mine (The EXPLOSIVE TRAP): The patience of a hunter! You plant him, you wait for him to arm. CLICK! Then BAM! Total destruction! It's like a Predator trap! Use these in the early game to save sun.\r\n\r\nPhase II: The Roster of the Dead—Puny and Predictable\r\n\r\nThe zombies, they come in waves. They think they are tough because one has a cone on his head, and one has a bucket. I say, PUNY defenses! They walk, they eat, they stumble. They need to be terminated.\r\n\r\nConehead and Buckethead: Simple infantry. They have armor, but armor is temporary! Focus fire, and they will crumble. The Buckethead is tough—you need a Cherry Bomb or a Jalapeño for him sometimes!\r\n\r\nPole Vaulter Zombie: He thinks he's a gymnast! He jumps over the first plant! This is deception! You need to hit him with two layers of defense! He jumps the Wall-Nut, but then he must face the Chomper!\r\n\r\nDigger Zombie: He comes under the ground! This is a covert operation! No problem! Use the Magnet-shroom to rip off his gear, or use the Split Pea to shoot him in the back!\r\n\r\nZomboni (The Ice Machine): This is a serious tactical threat! He drives the Zamboni! He turns your grass into ice and then the plants slip and slide! You must stop him with the Jalapeño or Spike Rock before he destroys the infrastructure and creates a skating rink for the undead!\r\n\r\nDisco Zombie: The party is over! He brings his backup dancers. They think they can distract you with the hustle! You terminate the main guy quickly, the dancers are finished too! FOCUS YOUR FIRE!\r\n\r\nGargantuar (The BIG GUN!): The big, smashing monster with the tiny zombie pilot! He takes massive punishment. You hit him with the Cherry Bomb! You hit him with the Squash! When he smashes the Wall-Nut, you must rebuild, or he will enter the base! This is the ultimate test of your firepower!\r\n\r\nPhase III: The Training Modes—Mastering the Terrain\r\n\r\nYou must know your environment. You cannot fight the same battle in the day and the night!\r\n\r\nAdventure Mode: This is the long war! Day, Night, Pool, Fog, ROOFTOP! Each location demands a new strategy! Adapt and overcome, like the T-800! Day levels are easy, but Night levels demand the use of the Mushroom Brigade because they are cheap! The Pool requires Lily Pads! The Rooftop requires Flower Pots! You must adjust your thinking!\r\n\r\nMini-Games: Short, sharp training exercises! Heavy Weapon, Zombotany, Vasebreaker—they change the rules! Keeps the mind sharp and the adrenaline pumping! Don't get comfortable!\r\n\r\nSurvival Mode: This is the ultimate test of strength! Wave after wave! Only the strongest survive. This is where you separate the man from the boy! You must build a permanent defense that can withstand the final massive wave. It requires perfect lane management and maximum sun production!\r\n\r\nPhase IV: COMMANDO TACTICS (Strategy & Execution)\r\n\r\nYou need to think like a general, not a civilian!\r\n\r\nSun is Money: Spend your sun wisely, but spend it fast in the beginning. The faster you build your Sunflower economy, the faster you can deploy heavy weapons later. Invest early to dominate late.\r\n\r\nLane Integrity is Everything: You cannot let one zombie pass! Every plant must cover the lane it is in. Use two rows of attackers! The first line to slow them, the second line to destroy them!\r\n\r\nUse the Right Tool: Don't use a Wall-Nut to stop a Digger Zombie! Don't use a Peashooter on a Zomboni! Use the Jalapeño for the ice, the Magnet-shroom for the metal, and the Cherry Bomb for instant, localized termination!\r\n\r\nAlways Have a Backup Plan: Get a plan B, C, and D, because the zombies, they are coming for you from everywhere! When a Wall-Nut crumbles, you must have the sun ready to replace it. When a lane is overwhelmed, you must use your explosives immediately!\r\n\r\nFinal Verdict\r\n\r\nPlants vs. Zombies is a masterpiece of strategy and destruction. It takes real planning, real timing, and real muscle to succeed. It makes you feel strong, it makes you feel smart, and it is highly addictive. It’s like a workout for your brain!\r\n\r\nI give this game TWO THUMBS UP! Now stop reading, go back to your screen, and GET TO THE CHOPPA—the fight is waiting!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "ill tell you what. this game has a satisfying gameplay loop, and isnt AI upscaled to boot!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Another childhood favorite of mine! Simple but fun, only needs a mouse / controller to be played, soundtrack is great, would def recommend :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "green thing violently and brutally shoots another green thing until one of them drops dead",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Childhood masterpiece! Still good with awesome nostalgic gameplay and soundtrack \r\n\r\nPerfection..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun Game. It has all the same bells and whistles as the Replanted edition, just without the janky visuals, audio, and gameplay held together by duct tape. It's honestly remarkable how a game from 2009 is an overall better experience than the so-called \"remaster\". Who knew you could have the same amount of fun for a fraction of the price? \n\n10/10. Save yourself 15 bucks for a game that actually works.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The developer wanted to create his own tower defense game where enemies could actually interact with the defending towers - but who could've imagined that would turn into corn shooting from behind a walnut on a suburban rooftop? And somehow, it works perfectly.\n\nA simple yet surprisingly clever concept made Plants vs. Zombies a global hit for a reason. All you need to do is plant your defenses and stop waves of zombies from reaching your house. The variety of plants allows for endless combinations and strategies, keeping the gameplay fun and creative. PVZ redefined what a tower defense game could be.\n\n+ Pros:\nGreat variety of plants and strategies.\nHigh replay value thanks to mods.\n\n- Cons:\nLevels become repetitive towards the end..\n\n★ ★ ★ ★ ★ ★ ★ ★ ☆ ☆ (8/10)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Revisited this after 18 years to finish the adventure once and for all. I popped my first achievements in 2007?  Nah, those have to be some sort of placeholder.  But apparently that was on a different build of the game.  No idea what was added since then but this was a fun romp.  This game is designed around visual limitations so playing whether playing in 4:3 with black bars or 16:9 with glorified borders it's the same experience.  If the remaster was priced appropriately I would've been happy to give it a go.  Oh well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Classic game. Better than mobile version. I bought this game so I can play with mods. Tbh never mind the supposed remastered version.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Zombies will eat your brains, play the game in order to avoid this terrible fate!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought this today and played for the first time in years. Safe to say i'm now addicted to this game like the first time I played it back in 2009... Some things never change!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "why is it no longer on sale ever? are y'all that salty nobody wanted to buy the ai slop rerelease?\n\nbut yea pvz absolute classic\n\njust go get it off internet archive lol",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty good, and it was not made with AI!.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a really great time killer, just boot it up, turn off your brain, and watch as the British men get annihilated by fruits and vegetables.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a great game only because of the funny music, plants and etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kick back fun and some laughs, always. I go back to it every so often, fairly often because it's a hoot. Get your kids to challenge you in it that's hilarious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy this over Replanted.\r\n\r\nYou get basically the same game for a quarter of the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can be a littler difficult and slightly hard to commit to, but just as a game to play when you're bored, I recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so addicting that i love it, best tower defense game in my entire life! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "plants vs zombies is best game that ever play since childhood i definitely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game's adventure mode to technically last about 3 worlds and probably 4 hours (4 levels with 2 variations and one \"final\" level at the end.) I think this game's greatness comes from AFTER you beat the main game. Its very fun to understand NG+ so much more when the game's difficulty ramps up and now you have to figure out what plants to work with like your just chilling with Crazy Dave just killing zombies on a daily basis every time you boot up the game.\n\nBut I think the most important part of this game's legacy is what this game COULD have lead to, being a very simple but very deep casual game that just gets harder every time. With so much of the casual game market basically spread over so many platforms with shady micro transactions, PvZ is feels like a unique Battle Chess game with several complementary game modes and a future that we could have had with these kind of games going against the AAA market we have today.\n\nPositives:\nSee Above.\n\nNegatives:\nThis game being from 2009 can lead to crashing at times on modern systems. This isn't a fault the game has naturally, although I could remember this game crashing even back then. Also, without mod support, you aren't gonna be seeing this game in full screen as even with the 4:3 ratio it will look incredibly stretched so be aware of setting up mods to making it look nicer, although I got through the entire game windowed just fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great, the graphics and story are charming, the music is amazing, and the gameplay is pretty fun (albeit a bit easy at times, but I'm not sure if that's because I've played the game a lot or because I grew up)\nThis variant of Plants vs Zombies is currently one of the best officially available versions of the game (some of the older console versions are a bit better, but they are naturally less accessible due to being locked on an old console). It lacks certain features from Replanted, but Replanted has a lot of bugs and visual issues not present in most other versions, so I'd only recommend it if you need something specific (such as Steam Deck optimization)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helo,\nDis game is sooo EZ!!\nU dont even need plantz or anythin.\nJus sit… wait… do nothing…\nSincerely,\n-NOT the zombiez",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how you experiences plants vs zombies that replanted crap is a disgrace to this games name. I can always get on a get a few hours of fun to pass the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah this game is pretty cool you place plants and shit and you like defend from zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best trips down memory lane in my life. 10/10 would play agian, this game is one of the highest quality games to come out in its era and it just shows,.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game for childhood, simply phenomenal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly blast from the past experience. Purchasing this instead of Replanted was an incredible decision and it was money well spent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak game, cob cannon the goat, cattails OP, I HATE I ZOMBIE a bum gamemode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plants vs. Zombies: GOTY Edition is a perfect mix of strategy, humor, and fun. The quirky zombies and clever plant defenses make every level exciting, while the variety keeps the gameplay fresh.\n\nThe music is super catchy, from the sunny intro tunes to the intense “final wave” tracks, making every victory feel epic.\n\nPlus, the game is packed with nostalgia, funny zombies, charming art, and quirky sounds that bring back memories for longtime fans. Even years later, it’s still fresh, humorous, and endlessly entertaining.\n\nIn short, Plants vs. Zombies: GOTY Edition is a timeless, fun-filled game you’ll keep coming back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Witnessing the monstrosity of PVZ replanted, I decided to come back to the cheaper and better version of the game. Did not regret my decision.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is like smoking crack but instead of smoking crack you're playing Plants vs. Zombies: Game of the Year Edition",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good thing i got dlc mod for this, this makes the game 100x better and there's more to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. Don't buy that other bs AI upscaling game that cost 20+... waste of MONEY!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Still holds up today. I wouldn't pay 20 bucks for it, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been my favorite game for many years now. I do ignore the sequels, i think they lose the core of what i like in the original game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "actually peak game, have come back to it many many times over the years.\n\nalso the zen garden is fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best original tower defense games, still holds up well with a wonderful modding community for this game and many of its other games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timeless classic the gameplay and humor will never get stale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, but doesnt work on big sur mac or older because of 32 bit stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Replanted, the Garden Warfare games, the Heroes mobile game, and the third installment are all inferior to this one.\n\nMaybe not PvZ 2 or GW 2, but still.. nothing beats Plants vs. Zombies the original.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beloved angry pumpkin plant versus zombie <3\r\n\r\nI love sunflower plant versus zombie :)\r\nThey give 25 sun\r\nIf i get 100 sun i get pea shoot.\r\nI also love pea shoot plant versus zombie :)\r\nBut not as much as angry pumpkin plant versus zombie\r\n\r\nangry pumpkin plant versus zombie kill zombie\r\nThey mean and scary\r\nI no like zombie plant versus zombie\r\nThey pisses me off >:(\r\n\r\nWhen Me no use angry pumpkin plant versus zombie\r\nMe lose game which make me sad :(\r\nI love angry pumpkin plant versus zombie\r\nHe protect me from zombie plant verses zombie",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PvZ:Goty Its just like i experince when i was a kid its felt good, not only i be able to play it but also 100% the game from start to finish\r\n\r\nthe original pvz team should be proud even years later..!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there's no such thing as a perfect video game, but damn is this close. it's an amazing feeling placing down all your plants and tearing through lines of zombies like an industrial saw to cotton candy. it gave me many hours of entertainment, but also gave me ass trauma because I like to eat while playing games 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, extremely fun better than replanted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game ever since I was a kid. I developed a fixation on it which lasted years and have owned it on several platforms since then. To this day, I still think it has aged extremely well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best games from back in the day!\nThe fog portion of the game is garbage though lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very impressive they didn't take this offsale, forcing players to buy the remaster they fumbled. anyways buy this instead of the remake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u want to spend 100 hours and still not succeed on 15 streak vasebreaker yes play this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reminds me of those good old dayz when the games were produced with some captivating art and simplicity and no creator of the art form used to be double crossed & screwed over with ai. This is a must have for gamers any genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a classic tower defense game that's fun and easy to play. It has a good amount of variety, especially after you beat the campaign as you unlock a bunch of different challenges and minigames. An easy recommendation if you like tower defense or would like to try the genre out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An old classic, I remember playing this on my Grandma's computer. Still better then 3/4rds of the games made today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I see no reason to buy the new PVZ Replanted when the original is so much better with a much more reasonable price. I love this game and no matter how many times I pick it up it continues to be amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a masterpiece. For just $5 you can get one of the best games ever made, much better than that garbage replanted version. This game has so many plants and zombies, and you can approach defending your home in many different ways. Plus, after you beat the main campaign there's so many minigames and puzzles to complete and they can get very challenging. Even people who don't like tower defense games might like this. Its cheap, but there is also a demo, so you should totally buy or try and see if you like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing fun game and the music is banger, THE PVZ FRANCHISE ALWAYS HAS BANGER MUUUSIIIICCCCCCC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always wanted to try out PvZ, and with the whole ordeal with Replanted going around, i went ahead and got this game, and needless to say this has become my new favorite thing. Do better, EA.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wOw nostalgia \ni missed this game so much and im having (too) much fun on this game\nwhen i was a kid im so bad at this game cuz i dont understand shet but now i understand what to do and it was so fun and addicting\nthis is SOoooOOOOoooooOOOOooooOOOOOOOoooo fun\n^_^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just a good game. can get repetitive but still really fun, and also a classic :D (also the song at the end slaps)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You never fully appreciate what you have until the big greedy company tries to emulate it with the bare minimum effort to make it a cashgrab",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is goated. It may look like not the best tower defense game but it is. The variety of mini-games is   amazing and the adventure mode is great, I thought this game might be bad at first until I bought it and it was amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cult classic with play, graphics, & charm that has (much like the heirloom plants I have at home) grown larger over the last decade. \n\nYou'd have to be brainless to shuffle past this title without taking a bite. \n\nBe wary though, that old saying \"if its rooted well, dont replant it\" has never been more true.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game cause serious dependency! It´s really old classic. But never have a single moment of doubt, that it wasn´t a great buy, to get this game for less than 5 bucks! Wort every penny, for sure. Playing last weekend, one day almost 12 hours in a row, can´t stop it, till i finish it. In the end, i have to stop, because probably from long time sitting in one position, i become a pretty hardcore backpain, must stop, take some pills a nd go to bet. But next time, when i continue ga,ming this game, i´ll try to finish at any costs! It bring a lot of fun and enjoying. Simply a good game. I can only reccomend it to you all!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game its cool and i like the garden planting aspect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plants vs Zombies: Game of the Year Edition is a fun and addictive game that is definitely worth playing. The simple strategy of defending your house with different plants keeps the gameplay interesting while still being easy to learn. The humour, bright colours, and creative designs make the game enjoyable for all ages. The extra modes and mini-games in the GOTY edition add even more value and give you more reasons to keep playing. Overall, I am very happy with this game and it is absolutely worth it.\nAlso my Zen Garden is like STACKED with flowers yo.\nI dont like zambies on my lawn >:(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is better than PvZ Replanted.\r\nThis is very unique strategy game with whacky towers and enemies. Every level gives you new stuff to play with making you hooked all the time.\r\nOnly problems that I encountered is low resolution sprites and game being in 4:3 format.\r\nBut I couln't care less about it when there is so much to do in this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game! though i wish i could adjust the windowed version 'cus its too small, and the full-screen version makes it too pixelated\n\nmaybe i actually can do so and im just a big dumbdumb",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cute little game where you kill zombies and defend your house using plants. The characters and art style are very charming and clever. There's a diverse selection of plants to choose to defend your home and a wide array of zombies that you have to plan ahead for. There's also mini games, puzzles and alternate game modes\r\n\r\nI think the game is pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgia filled, fun, simple, and it could run on a pregnancy tester if you wanted it to.\n\nAlso miles better than the 20 dollar slop fest of replanted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was very fun to play sure it's a somewhat small game but worth the 5 dollars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There has never been a better time to give my cash to the legends that made this masterpiece than after PvZ: Replanted has shown us how much of a watered down, AI upscaled, careless mess it is. Go support the original game and crew!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plants vs. Zombies is one of those games that somehow never gets old. You open it “just to play one level,” and suddenly an hour is gone. The mix of strategy, humor, and simple gameplay just works perfectly.\n\nEvery plant actually feels useful, and every zombie has its own weird personality. The game keeps things fresh too—first the lawn, then the night levels, then the fog, the pool, the roof… it never feels repetitive. And when Crazy Dave shows up with his pots and random shouting? That’s peak gaming right there.\n\nThe best part is how easy it is to get into. Anyone can play it, but it still makes you think, especially in the later stages. Plus, the soundtrack is insanely catchy and the art style still looks great today.\n\nIf you grew up with it, it’s pure nostalgia. If you’re playing it for the first time, it’s honestly still better than most modern mobile games.\n\nPlants vs. Zombies is just a classic. Simple as that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a masterpiece, the art style is so beautiful, the gameplay is so dam fun, this is a classic game that is a must try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In only three hours I got through almost half of the worlds and this game had a very calming gameplay but at the same time,it exites you and is sometimes addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game overall, but some minigames will make you go crazier than Crazy Dave. (I especially hate wallnut bowling)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA and their AI up scaling BS can suck it. For 5 bucks you get a game made with some soul compared to 20 bucks for game that didn't even get the music right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What else can I say about Plants vs Zombies that hasn't already been said? It's one of the best tower defense games ever made, extremely creative, massively re-playable, and just about as perfect of a game as you can get.\n\n10/10. One of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game its so fun all the plants zombies so fun especially the zomboss fight i loved it overall 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a great game! You know it will be sad\nIf EA made a 19.99 eruos shity remake\nWith ai and bad art but that is't real",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game just like the version I played 10 years ago but with better graphics and quicker movement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Objectively best version of PvZ to play on PC. Do NOT waste your money on the remaster, as they did not hire or ask for help from the original artist, creating bad renders of the original art style. \r\n\r\nThis edition is the only one worth getting, it hasn't been updated since its release date and it doesn't need it. \r\n\r\nThe new remaster didn't even have the same sound track system and had to be updated due to fan pressure. \r\n\r\nSo: best version of PvZ, stick to this copy, solid OST and art style. Game play is very repeatable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game may seem like your average tower defense, BUT OH BOY, once you get past the night levels you REALLY start to get into it. Even if you finishd the game already theres still so much more content, from zen garden to playing as the zombiees, to fighting red eyed COLOSALS of gargantuars. It truly has it all 8.5/10 Its a must-play.\r\n\r\nDon't buy replanted tho buy this instead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a near perfect game. The GOTY version is arguably the definitive edition of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a lovingly crafted game, just a shame I can't say the same for the remaster...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish it had the option to select levels like in the mobile, but still a much better buy than PvZ Replanted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Help for Plants and Zombies Game: When the Zombies show up, just sit there and don't do anything. You win the game when the Zombies get to your house. \n-this help section brought to you by the Zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an epic game, P.S. if you  don't already own PvZ, just buy this version over replanted before its very possibly gets delisted! THIS VERSION IS BETTER!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy replanted!!! This is way cheaper and better. If you do want a replanted like experiences, download a PS3 emulator and Get a PS3 copy of the game\n\nMy recommendation Is RPCS3 emulator and Romspedia for the PS3 edition. It's free and way more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite childhood game. I just randomly downloaded it from the internet when I was a kid and I absolutely loved it. With the recent release of PvZ Replanted, all the memories came back. Everyone said Replanted is really bad, so I just decided to purchase the old one. I just couldn't stop playing it and completed all the achievements in a single day. The game is very short but for 5 dollars it's enough content and the replaybility of this game is insane. I've completed the game multiple times when I was kid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took me 3~ years to 100% on steam from 2021-2024, the first ever game I played back in around 2009 or 2011 on mobile that got me into gaming alongside pocket god when it was still getting updatess and minecraft pocket edition, awesome OST and really humble music dev, unique and eye-candy pixel art, good sound design, great comfort (or rarely rage depending on mini-game) game, indie team/game  ̶f̶o̶r̶ ̶t̶h̶e̶ ̶t̶i̶m̶e̶, adore this game as one of my faves of all time & can thank it for allowing me to growing to where I am today (from how much it's helped me through, the people I've met and the opportunities it's allowed me to grow).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PVZ is a iconic master piece in video game culture. Its game style was super unique when it first came out. It became one of my childhood games i can never fully put down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best tower defense game ever. Amazing replayability and banger soundtrack. 10/10 and way way better than the cashgrab ai slop that is replanted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. I recommend it, very much, despite the fact that it runs at the resolution of a vending machine terminal. \n\n[spoiler]F*ck Vasebreaker. I wanna take the god-damned mallet and beat the game designers to death with it. I hope someone shoves those f*cking vases up the a-hole of the cr*tin who decided you have to get past 15 f*cking rounds of this dogsh*t RNG clusterf*ck of a minigame to get the achievement. FFS, none of the challange levels in PVZ2, which were designed specificaly to frustrate and make you buy premium plants, came close this level of sadastic BS. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember playing this game on my late aunt's laptop as a kid and accidentally resetting the game data.\n\nSuch a nostalgic moment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm going to be honest after all this time I never realized how short this game was. It's also pretty damn easy overall. It is fun though. You could do worse for $5 but definitely left wanting for more.\r\nYou've got zombiiiies on yooour laaaawn~",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Before saying anything, I should make clear that I definitely recommend this game over Replanted, its remaster. However, that being said...\n\nThere's really no reason to play this version of the game over a console version if you have access to it. Both the Xbox 360 and PS3 versions are superior in every way, featuring more content and much higher resolutions.\n\nGOTY Edition on PC runs in a native 800x600 resolution with no way to change it, and the lovely artwork is butchered as a result. This port was crapped out in a poor state and quickly abandoned. This especially stinks because, in my experience, the game also likes to crash. Due to this, I actually removed the game from my account years ago, after having only purchased it on sale for a buck as a novelty.\n\nIf you have no other way to play PvZ, then I'd say go for it, but get it as cheap as you can - none of the money you pay will be given to the people who poured their passion into it. Instead, it'll go to one of the worst corporations in the business, EA, and new leadership at PopCap that frankly have no idea what made this game special and don't care. And make no mistake, PvZ is a wonderful game with a lot of charm. It offers many, many hours of playtime to those who desire it. This version just doesn't do it proper justice in my opinion.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I wish the game was easier, actualy fun and I also wish the mods for this game would actualy work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand why people love this game so much, but for me, this is mid asf. Mainly because in adventure mode, the pacing is so unimaginably slow that I damn near fall asleep. I think the minigames are pretty cool, but for adventure mode, that is very boring to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "100%'ing this was a pain\n\nupdate: 20 more hours in and PopCap took my balls.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bro its basically a flash game... why sell this i can play it online free 🙄 i can get it on my android for free 🙄 i feel riped off 🙄",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game dose not run, just pirate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant put saplings in the sunflower",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i hate fog. cant get past 4-4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ПРОКЛЯТЫЕ ЗОНДБЕ, НЕНАВИЖУУУ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Before saying anything, I should make clear that I definitely recommend this game over Replanted, its remaster. However, that being said...\n\nThere's really no reason to play this version of the game over a console version if you have access to it. Both the Xbox 360 and PS3 versions are superior in every way, featuring more content and much higher resolutions.\n\nGOTY Edition on PC runs in a native 800x600 resolution with no way to change it, and the lovely artwork is butchered as a result. This port was crapped out in a poor state and quickly abandoned. This especially stinks because, in my experience, the game also likes to crash. Due to this, I actually removed the game from my account years ago, after having only purchased it on sale for a buck as a novelty.\n\nIf you have no other way to play PvZ, then I'd say go for it, but get it as cheap as you can - none of the money you pay will be given to the people who poured their passion into it. Instead, it'll go to one of the worst corporations in the business, EA, and new leadership at PopCap that frankly have no idea what made this game special and don't care. And make no mistake, PvZ is a wonderful game with a lot of charm. It offers many, many hours of playtime to those who desire it. This version just doesn't do it proper justice in my opinion.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I wish the game was easier, actualy fun and I also wish the mods for this game would actualy work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand why people love this game so much, but for me, this is mid asf. Mainly because in adventure mode, the pacing is so unimaginably slow that I damn near fall asleep. I think the minigames are pretty cool, but for adventure mode, that is very boring to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "100%'ing this was a pain\n\nupdate: 20 more hours in and PopCap took my balls.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bro its basically a flash game... why sell this i can play it online free 🙄 i can get it on my android for free 🙄 i feel riped off 🙄",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game dose not run, just pirate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant put saplings in the sunflower",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i hate fog. cant get past 4-4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ПРОКЛЯТЫЕ ЗОНДБЕ, НЕНАВИЖУУУ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Before saying anything, I should make clear that I definitely recommend this game over Replanted, its remaster. However, that being said...\n\nThere's really no reason to play this version of the game over a console version if you have access to it. Both the Xbox 360 and PS3 versions are superior in every way, featuring more content and much higher resolutions.\n\nGOTY Edition on PC runs in a native 800x600 resolution with no way to change it, and the lovely artwork is butchered as a result. This port was crapped out in a poor state and quickly abandoned. This especially stinks because, in my experience, the game also likes to crash. Due to this, I actually removed the game from my account years ago, after having only purchased it on sale for a buck as a novelty.\n\nIf you have no other way to play PvZ, then I'd say go for it, but get it as cheap as you can - none of the money you pay will be given to the people who poured their passion into it. Instead, it'll go to one of the worst corporations in the business, EA, and new leadership at PopCap that frankly have no idea what made this game special and don't care. And make no mistake, PvZ is a wonderful game with a lot of charm. It offers many, many hours of playtime to those who desire it. This version just doesn't do it proper justice in my opinion.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I wish the game was easier, actualy fun and I also wish the mods for this game would actualy work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand why people love this game so much, but for me, this is mid asf. Mainly because in adventure mode, the pacing is so unimaginably slow that I damn near fall asleep. I think the minigames are pretty cool, but for adventure mode, that is very boring to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "100%'ing this was a pain\n\nupdate: 20 more hours in and PopCap took my balls.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bro its basically a flash game... why sell this i can play it online free 🙄 i can get it on my android for free 🙄 i feel riped off 🙄",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game dose not run, just pirate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant put saplings in the sunflower",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}