{
  "positive": [
    {
      "review": "After playing BO7 through gamepass... Perhaps you were treated too harshly. \n\nlol",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "After the tragedy that was BO6, I bet we can all lower our standards a bit and appreciate this game for what it is. I'm glad there are still a lot of active players. I know this game is hated by many, but I actually like it a lot.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "The campgain isnt as bad as people say, Its like a 7/10, The campgain story was understandable, Some missions were lacking some cinematic gameplay, I have played myself CoD MW2 (2009) and MW 1, MW2 (2021) And this campgain is the worst one, but not that bad.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I was a fan of Modern Warfare 2019, and this game seems to be a direct upgrade and enjoyable in many more ways. I think shipment 24/7 being in the rotation constantly is straight cancer but very fun at the same time. \n\nThe graphics still blow my mind and to be honest I think this Call of Duty is the best in terms of looks and realism, if we are not counting the lasers DLCs and the fact that you can see a banana man along with Nicki Minaj and Rambo running around shipment with riot shields and an auto shotty. The amount of detail in the reloading animations alone shows that they were not playing around.  To be honest, 2019 graphics were already admirable, but these ones.. this is next level. The game, surprisingly, runs smooth. Sucks that every CoD after 2019 being shit brings down the perception of this one.\n\nAlso, the vast amount of attachments for each gun is amazing -- can try multiple builds for a single weapon.\n\nThe unlock system is straight buns. Why do i need to do challenges with weapon B to unlock a single attachment for weapon A that I will try once and probably hate? why TF do I need to do daily challenges to unlock the ability to equip a killstreak. I am almost level 200 in Multiplayer and I still have many killstreaks locked. \n\nAs for camos, getting mastery camos does not seem too tedious compared to DAMASCUS from 2019 (kill me) so I guess thats a good thing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Love every second of playing this call of duty and it's one of the best modern cods we have gotten in years, even black ops 6 and 7 is not as fun as this one. Thank you for making this game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "best cod in recent year, in terms of multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily best CoD that came out after BO3, its like MW2019 if it had 10x the amount of content, and had 10x better maps since every single OG MW2 map is here, along with a great selection of new maps made specifically for this game, and the camo grind is insannnnne, it can keep you busy for a very long time which is what I feel makes a CoD game better since it gives you something to actually work towards.  Also it takes up less space than MW2019, clocking in at 90 GB, so that's nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is A resubmission of my review I posted when MWIII was part of the COD HQ\r\n================================================================\r\nFIRSTLY - So it may come as a surprise to many of you to know that MWIII is not an InfinityWard game it's a Sledgehammer Games game which was a huge surprise to me as well but overall SG did a fantastic job on this 1 even if it felt rusty to start off with.\r\n\r\nSECONDLY - Unshackled Baby!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "multiplayer = plaything game in 2023 wasnt so fun it was constant focuses on battle passes and small events , coming back to it at the end of 2025 is not to bad the game is less battle pass focused and is more fun in my opinion . \nthe shipments game mode is very fun same cayos but with diffrent map styles so you dont get board whilst camo grinding . on that subject camo grining is more atchivable for us who have so little time , having 4 simple challenges instead of 20+6  hard ones like in cold war or mw 2019 . \n\nthe attachment system in a bit better in my opinion , i hate the idea of having to daily challenges to unlock wepoons / attatchments but i also semi like it so you can get accses to attchments \nearier than exspected   . \n\ni havent exspirance many hackers if i have then there not over doing it like in ww2 or b03/2 rn . most of the reviews are based on how the game was on releace and dont reflect so well on the current state of the game . \n\nzombies : its not so good more like a rerelased dmz with zombies direct copy from what i can tell , as a die hard fan of zombies it was a bit disipointing playing it i hate theres no single player and your stuck with co cop with other players being able to kill you . thankfully in bo6 they didng bring this along so if your in it for the zobies id recomend that or go back to cold war . the camos are actualy really good but i just cant bring my self to play it \n\ncampain : iv not played much but from what i can see it looks good , compaired to mw 2019 its not as good but id need to finish it to be able to judge it so dont take what i say as ghospil . \n\nim very glad they decided to seporate it from the call of duty launcher since i really hated that idea it makes no point having all games in one spot other than trying to tempt you to buy the newest one so this desition was defently a up from me activision :) \n\nyes i have brought stuff from there store becouse i love the desighnes of some of the things they sell the devs put work in to what there selling specialy the packs for 16.99 its worth it becouse it comes with 16.99 worth of cod points including a skin and usualy 2 guns with tracers so id indorce it any day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of the better CoD games to come out in recent years. Is it overdone? Yeah. Is it overpriced? Yeah. But the game plays well, has all of the MW2 maps, and is extremely well optimized (except for the size). Even a Steam Deck can run this at medium settings, so there's that. This game is mediocre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kind of hard to recommend as the MP and Zombies remain active but not active as one might hope especially for a cod title that is as recent as this one.\n\nMWZ was the biggest surprise for me personally, it's the only offshoot of traditional round based zombies that I've ever found to be actually fun and engaging. I genuinely really enjoy being able to control the difficulty and pacing, game to game. Being able to chill in Tier 1 areas and farm exfils, or if you have good luck at the start being able to push into Tier 2 or 3 areas very early on.\n\nThere are tons of camos and weapons to grind, and overall the gameplay is incredibly solid. I find the multiplayer to be really satisfying, especially hardcore. I was a big fan of MW 2019 (other than it's incredibly drab and gray color palette in some maps) when it released, and this game feels like a really good hybridization of MW 2019 and MW2 2022.\n\n(Supposedly) generative A.I. was used in this game but only for the generation of concept art for cosmetics. That aside this might be the last cod game fully made my human beings. Speaking of which this game has the most horrid paid cosmetics I've ever seen in a video game. Genuinely horrific dogshit.\n\nBlack Ops 6 and on, I would consider the true death of the franchise unless Activision decides to revert from using generative A.I. and hopefully consider allowing future call of duty titles more than a single year of development. I think that's the only thing they can do at this point to try and get people interested in Call of Duty as a franchise again.\n\nMy take is that if you buy it with a 50% discount, it's worth buying and playing. I'm looking forward to grinding it over Christmas break instead of buying and playing Black Ops 7, I would encourage you to do the same if your looking for a newer call of duty game to sink your teeth into and you didn't get around to playing this. \n\nHowever if you did play Modern Warfare 2's multiplayer already and invested a lot of time into it, then it's more of the same here so you are probably better off skipping it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The campaign is fast-paced, explosive, and packed with variety. It delivers some great set pieces and keeps the action moving, blending classic cinematic missions with more open-ended ones where you can approach objectives your way. The characters are still a highlight, and it ties together the reboot’s storyline in a satisfying way. It’s a shorter ride, but a fun and polished one, definitely worth playing if you enjoy the modern MW campaigns.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The campaign was pretty good, i really liked how good the movements were in this game, ending sucked tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this with on of my friends the game is good as it can be the multiplayer is not so bad but the campaign is lazy i can see why people dont like this game due to having a rough launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't a terrible COD. Now is it the best? No not even close, but it's not terrible. Just like with the other CODs do not let the mixed reviews deter you from trying these games. This is a competitive game so people will give bad reviews just because they suck at the game. \r\n\r\nNow for me this COD isn't terrible. The movement system feels really nice and the guns have lots of customization options, I almost never play on the same map twice and there are tons of maps giving a nice variety (although I quit some matches depending on the map cause some maps are just designed for campers and those games are boring as crap), and people choose these stupid really bright skins that makes them easy to spot and easy to hit so I tend to get more kills because of that. \r\n\r\nNow there are a lot of negatives but honestly it just depends on you on whether you think it's bad or not. The gun progression system is annoying and a big pain in the butt for me (I don't like having to use 3 different assualt rifles just to unlock one smg that I want to use), earlier I talked about the campy maps that are really annoying and boring, the skins ruin the immersion sometimes and other times they are just funny, if you play at night get ready to fight the no-lifer discord moderators who play this game more than they call 13 year old girls kitten, unlocking modifications for guns are really annoying, and the campaign is kind of just meh. \r\n\r\nI choose to play this COD because I love the modern warfare series and in my opinion modern warfare is so much better than black ops (besides black ops 2, no cod will beat that) and I like having the nicer graphics and the nice movement systems that the old CODs just didn't have. Before this COD I really really enjoyed modern warfare 2019 and would only play it (Besides the movement system I like mw2019 more). So if those are things you value I'd say try this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The zombies mode in this game is underrated. I enjoy this form of zombies over Black Ops 7 zombies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The coop is the best. The campaign is good in veteran mode. If you can find players in Coop it is worth the $30 that Black Friday sale has. Also multiplayer is still viable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "don't think this deserves the hate it's recieved. Zombies is an enjoyable experience (when it runs well). Being booted from a lobby does suck. But using the scorcher and progressing throughout the campaign of zombies and running contracts with friends is a good time.\n\nMultiplayer is a good time, can't complain. Doesn't feel as sweaty as BO7 or BO7. \n\nHaven't done the campaign. I just like zombies and multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, untill you get your game to be gliched and you have to restart from the start of the mission!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as bad as people say but i only play multiplayer and zombies so idk about story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's probably the better game in the recent franchises for me, I really enjoy the multiplayer. I cannot speak for the other modes though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my only complaint was when all the games where all in one menu and it took 300 GB of space but that has been fixed so i have nothing against it anymore, it is expensive but i got it on sale for 50% off its not a bad game if you just wait for a sale, multiplayer is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this on PC but never finished it. I personally liked this game, the action, visuals, and gun play plus how the weapons functioned.  I liked the missions, but I can understand that people didn't want the open world styled layout. People want a linear story, not open world Warzone layout.  I didn't mind it, but I'm not a Warzone player. \n\nPeople that are long time call of duty fans, say that Price, Soap, Shepherd, basically all characters were dumbed down and ruined.  I may just be blinded by good action and visuals, but I didn't find them all that horrible. I agree Makarov isn't how he used to be portrayed, but I thought the campaign was still decent. \n\n  Now, I have a hard time seeing a good story from a poorly written, and lazy worked one. I just play the games because I find them fun. Now people will say, the devs were lazy and didn't put much effort into making a good story, and it was way too short and it is basically a DLC. \n\nI agree that much stuff was changed and making it mediocre was a bad choice. I still enjoyed it. People anymore get called shills or criminalized for liking stuff others do not. I understand the hate, but sometimes nostalgia isn't always good.  Now I'll get hate for saying that, but I know Activision isnt a very good company, and all they care about is money, I know. Boycotting isn't what it used to be.\n\n   Call of duty isn't what it used to be. And some say call of duty died after black ops 4 or even modern warfare 3, the original. Activision has been making very stupid decisions, and no one but a small percentage like cod anymore.  But if having cod dying completely is what it takes to make the og fans get a good game, so be it. But I don't see it happening. \n\nAs for the online, I thought it was really good, and they did well. Do I recommend this game? I recommend for players that couldn't careless about the hate. Play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly really enjoy this game. The campaign is a bit different from the others because there are some missions where you are put into a big area with multiple objectives and you can choose how you go about doing those and which ones you do first. I understand why some people don't like it and it took some getting used to for me, but I actually quite welcome that change because it brings something new to the table. The multiplayer is fun. Not really much for me to say there, and the zombies mode is fun too. It took me a while to warm up to the zombies mode because it's different from previous installations. It is not round based like before, but like the campaign, I welcome that change. You choose what weapons you bring in, you spawn into a big map with different areas, some tougher than others, and you complete contracts and other objectives that you choose to do and then, (if you don't die before then), exfil. I know why people dislike this game. Makarov is such a downgrade from the original MW series, the missions are much different from previous games and that might not sit well with some people, I heard many people saying the campaign was too short, etc. But I believe that is personal preference. I would highly recommend, just with an open mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Campaign.\n\nZombies is probably the most fun thing about this game but gets boring over time, no content updates since release and almost zero variance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sad to say last ok game cod put out but ruined with the superi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My recommend is mostly if the game is on sale. At this point, its not worth full price. I did enjoy the campaign and eventually the MWZ grew on me as well. NGL a lot of the zombies players are really chill and helpful. Since the MWZ is uses matchmaking, you'll often run into or meet new players that can help you or do later content with. Many times I'd find myself farming kills and some random would come over and drop a bunch of good loot to me, jump up and down, then fly away with the scorcher lol. There are definitely better COD games out there, but for a decent price, this is worth the play time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth it on sale, probably the best modern Call of duty since Modern Warfare 2019 by far, and pretty chill now that all the unemployed are on the newer CODs, and in a way the definitive modern COD.\n\nYou have 40+ maps, 100+ weapons, and 100+ aftermarket parts to convert the weapons into other stuff. Unlocking the post launch content is also much easier than previous CODs, because you can just do daily challenges/win games to unlock them instead of doing whack challenges. Grinding every individual gun is also much easier, because each gun has universal attachments and about 20-30 weapon levels instead of 50+ like every other new COD.\n\nThe gameplay plays like Modern Warfare 2019 with faster handling speeds basically, but it's also possible to play fast without spamming slide cancels like BO6 and BO7, meaning you can play as chill or as sweaty as you want.\n\nThe maps contain all of MW2 2009's 16 launch maps, plus about 24 post launch maps which are the typical modern COD three lane maps, although they are pretty good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Campaign is pretty ass, but the MP is the best we had for a few years. Its also better than Bo6 and Bo7 ngl.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The zombie mode is the only worthwhile feature; however, the campaign is very short and not worth playing. The multiplayer is decent, so if you want to play zombie mode or DMZ, then buy this game; otherwise, consider purchasing Call of MW2 instead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best bot mode ever!!!! 20 player matches, tons of customization, and sixty five fucking maps!!!?!?!?!?!?!? Are you freakng kidding, ass on the flooor throughout the whole ordeal. DNA bomb, freaking NUKE, are you kidding?\n\nOnly problem is the always online, but beyond that, it's remarkable nowadays.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Compared to recent titles, this is the most polished version. The movement feels more direct than the omnimovent they introduced with bo6 and now bo7. There it feels like you're on skates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, kinda anoying, and a lot of murderers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my fav new gen cods, far better than bo6 and 7, this cod gave me hope for bo6 then bo6 made me hate the series again so another 10 year break from cod it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great COD, i prefer this movement compared to the newer COD's, Overall a solid COD!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok ,but the campain is not good as old call of duty.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun gameplay and many guns to use",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best cod multiplayer in recent years",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fast not so acurate but worth trying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Modern Warefare 3 is the best one to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Multiplayer is great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Muito bom,melhor MP dos últimos anos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "last good cod since 2019",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best cod for camo grinding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS SO FUN BUT IT DOES NOT HAVE WARZONE ANYMORE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Multiplayer: Good;\n\nZombies: What on earth is this? Still quite enjoyable tho;\n\nCampaign: *Crickets*",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Greatest Warzone era cod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME BUT PLEASE REMOVE WERIDO SKINS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best modern Mulitplayer COD Game by FAR",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its soo good and naice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "warthunder better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still better than Battledad 6",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "slide cancel my buttocks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than black ops 6",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best second modern first modern 16",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best modern cod by far",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its a an excellent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game 7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool game with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its what was paid for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love it ...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game too ez",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's not bo6!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun till u see a camper",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "over hated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME LOVE IT YAAAAAAAAA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good good yes good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "W sigma game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best cod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very goode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rlly fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what I will ask you is, can you give me one more day? Im not asking for a week, Im not asking for a month, Im not asking for a year. can you give me one more day?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just great campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its decent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mwz best zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god teir",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "boyfriend trauma",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good not bad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "worth in sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Heck yeah, Modern Warefare has won",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ggoodd",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I cannot recommend this game because Microsoft doesn't deserve a fucking dime, even though MWIII is technically a great release for a cod game.\n\nDon't bother with the campaign or zombies, multiplayer is the real highlight here. Loads of weapons to unlock with multiple unique attachments that can basically turn the weapon into something entirely different, many of which are nods to previous cod releases (Turning the MK2 Carbine from MWII into Akimbo Model 1887s for example). All of the base MW2 2009 maps and a bunch of new (and returning) maps that play very well. Movement is quick, ttk steady, and plenty of modes to mess around in (Demolition being a highlight, personally). There are several ways to counter riot shield users, varying from under barrel flamethrowers and chainsaws, and a sword that can just delete shielders even if they are facing you.\n\nSledgehammer deserves better for delivering such a solid and fun experience. It's irrelevant now but it could be noted that during the game's \"lifespan\" or active seasons, Sledge did a fantastic job supporting the game. I played from the beta all the way to the last update, completed each weekly challenge, and still didn't feel completely burned out like the camo grinds and FOMO events of the past. There have been many cod releases where I'd find an issue and it wouldn't get fixed for literal months or even not at all, whereas Sledge fixed most issues days after they came up. The only thing I dislike or don't care for is that the player skins can be ridiculous or dumb and don't really look like they're all from the same series (even disregarding crossover skins). It lacks a clear visual identity, which can be said for pretty much all modern cod releases outside of Cold War, which stuck mostly an 80s/90s adjacent aesthetic.\n\nOnce again, the entire team at Sledge deserves better.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I haven't played many COD games, mostly MW3/Black Ops 1 on 360, and, Black Ops 3 on PC. A friend bought me this later in it's life (1-1.5 years after release lole). I've never played the campaign. This is solely my multiplayer opinion. \n\nGame is what you would expect of a 2-3 year old modern COD game at this point. If you play more than an hour or two, you usually replay the same lobbies. Kind of annoying when you get groups of players trying their best when you're looking for a goof around game. Or, when you get another lobby with someone obviously cheating multiple times per play session. That has been the experience I've had my last few plays. Besides stated, the community in this game is not great, but is what is expected of a modern COD game. It's either no one talking until they're losing and blaming others, or racial slurs off the rip for no reason and no in between. \n\nI've had about 4 battlepasses worth of \"content\" in this game before devs stopped making content for it. There were no map packs or traditional style DLC \"packs\", but new maps and weapons were implemented alongside battlepasses. New weapons were free along with map access. To unlock the weapon, you would need to level your battlepass to the required level. I never paid for the battlepass (unless I had saved enough points up from the free battlepass) so I didn't mind this system, but can see why people dislike it (pretty expensive for skins in my opinion). Also battlepass lole.\n\nDespite complaints, the core game/engine is pretty nice and enjoyable. Movement is pretty nice other than not being able to shoot while diving. However, I feel the cons out weigh the pros, especially considering the price. \nOh, and the zombies is poopoodoodoo. \n\nI would leave this neutral if possible. 4/10, can't recommend.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "(9 hours review)\nThe only reason I got this game is to play it with my friends. There is a bug where I can't join a multiplayer party. And it is annoying as all get out. I read online that the devs didn't have time to fix it. It is one of the biggest blockers from making this game an enjoyable experience. We have to do a convoluted process to even get to play together. It is rage inducing.\n\nI understand it would take time and resources. When thousands of people are facing the same stop gap. It is worth it to pause a moment to fix it, especially if you want to expand your player base.\n\nAs of right now, I can't fully recommend the game. There are too many bugs. The campaign is fine so far. The art looks good. Just multiplayer cross play, which was a marketing feature, is broken.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would maybe recommend it if not for constant and obnoxious bugs; execution animations mutilating your character model, guns floating over your character's dick, and shaders that render in giant black squares instead of properly rendering.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The thing is broken, no meaningful updates so exploits run wild. Don't get it now, wait for the next good cod to come out",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so goddamn boring, call of duty used to be good, do not buy this game. Hoping Black Ops 7 is better, but I have very low expectations after Black Ops 6.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Activision, Raven and others apart of the team do not care about this game. However, if I could get BO7 that would be cool. this game was fun and now is a pile of shit covered in cum by lazy fat nerds.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Activision has given up on moderating this game - would not recommend in 2025. Cheats and glitched guns are rampant",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was having fun until i got shadow banned for no reason. i guess people just cant be good at the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+Can use MW2 weapons and operators\n\n-Poor, unbalanced match making\n-Unstable, often crashes during games\n-Extremely long shaders pre-loading time\n-Long TTK and unbalanced weapons\n-Worse animation and gunplay for MW3 weapons\n-Cringe skins and operators\n\nJust another piece of garbage made by trash company Activision.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game always crashes for NO REASON. i cannot play a game and have had issues for 2 years!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I gave it an honest try, but got complete whiplash coming from MW22. There's a lot of content present, even disregarding whatever seasonal content it had. Plus it has local play, which is obviously missing from the last two releases. I was able to push for high kills pretty easily in MP, but it's just too damn fast for my enjoyment and too iterative. Never mind the terrible campaign",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got both mastery camos in the game. Overall game was just so forgettable. Borealis was so boring I watched all of the Boys and some other show while doing the grind. I did NOT do the MW2 weapon grind in zombies because it took me () hours to do MW3 weapons and I was not gonna double that. Multiplayer was a step up from the previous year of Dastardly bad MW2. Thank god they took out those longshot kills from the mastery camo. Overall 5/10. I had pretty good fun doing the grind. I remember it more the other cods but still sloppy as a Joe. I swear in 2 years if we got a MW4 I will tweak. \n\nLvl:462?\nPlaytime:\n73 Hours Multiplayer\n145 Hours Zombies (Borealis only)\n218 Hours Total\n\nPlaytime is messed up because of now MW3 not being a DLC and a standalone game now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is unbalanced trash full of cheaters with trash optimization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It fails to load itself, its entire job is to load itself but it fails. Wouldn't doubt that there is no campaign considering how cheap this company is, can't load the only thing I bought the game for smh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought for single player. It sucked. They changed all of them around. I don't recommend at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is my 2nd time writing this review, the first time was when the game was new and a part of the COD HQ. Now it is a separate listing again. For context, this review was written in November 2023. It also comes with a new Achievement listing, and if you played the game when it was in the COD HQ, your achievements that you unlocked on the HQ will re-unlock here when you launch it, atleast it did for me for MW2 2022 anyways. Unfortunately though, the MW3 2023 achievements in the COD HQ achievement list are now unobtainable. Also worth mentioning that I played this game when it was on the HQ and I primarily played on the PS5 version, so I have a lot more playtime. I had to launch this relisted version to rewrite my review.\r\n\r\nIn case if anyone is confused, this is the 2023 MW3, not the 2011 MW3. If you are looking for a great game, the 2011 game is the game for you.\r\n\r\nOld review from 2023:\r\n\r\nCampaign, Multiplayer, Modern Warfare Zombies (MWZ), Warzone 2.0 (or 3.0 or whatever it was called at this point, I never paid attention to Warzone at this point) & the other game modes all either suck or are mediocre at best.\r\n\r\nYou can literally play the Campaign, beat it, then refund it on Steam before your 2 hours are up. If you took the campaign and characters from the 2011 MW3, or just the original MW trilogy in general, and made them as terrible as possible, MW3 2023 is what you get. Makarov for example, the original Makarov set off a nuke that killed 30,000 soldiers, carried out a terrorist attack at a Russian airport, killed your American character that he knew was a secret CIA spy, invaded America, started World War III, gassed and then invaded Europe all the way to Paris in 6 hours, almost always knew where you were, Kidnapped the russian president and his daughter, killed every major character except Price and more. This new Makarov? An absolute failure who gets captured and fails at committing attacks.\r\n\r\nAs for Multiplayer, this game was originally gonna be DLC for MW2 2022 and it shows. Everything is basically copy and pasted, Activision even said at first that, after MW2 2022 released, that game would be a 2 year game as apposed to the traditional 1 year, meaning we weren't supposed to get a new COD game until Black Ops 6 in 2024. We were instead gonna get some kind of DLC for 2023. They changed their mind last second and this is the result.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very bad matchmaking, not even at all. you can lose 1 day straight being the first one in the team..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics look dogshit and too many sweats, give back my 50$ plz",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stopped working on msi claw pc, its showing grey back ground unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when i play call of duty campaigns i expect a linear but cinematic storyline. I understand trying to innovate but using WARZONE as a blueprint for most of the campaign missions is sort of a drag and downright lazy developing. Including the fact that it feels like the AI has been stripped down to stupid mode just to make the big map sandbox a tad bit easier. Definitely the weakest one in the whole trilogy. \n\nRandom fact though, Brian Bloom (the voice of Kane from Kane & Lynch) wrote the reboot Modern Warfare trilogy and was the lead narrative director. \n\nStill firmly saying 2019 Modern Warfare was peak in terms of the campaign missions and story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is terribnle and should never be played because it's fiulled with the worst teammates imaginable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Вылетающий на ТОПОВОМ ЖЕЛЕЗЕ кусок дерьма не достойный ни цента ни названия MW",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "beacuse instead of fixing the game they still sell to you knowing they have all these hackers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Haven't truly played any of the new Modern Warfare campaigns, so this was my first. I hated how the campaign just felt like an offline battle royal match. All you do is go around a small open world map and find loadout like fortnite. I hated it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game gives me error code \"negev\" and my other PC runs it fine it is the servers...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have 4 hour of just trying to get my graphics to work and they dont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just bought this game. F the new Call Of Duty Launcher. I lost my patience. I waited 10 minutes to get in the f-ing game. I wish I could curse but I can't. F this game. This is why bf6 and the older call of duty titles were better. Now just want to unify everything and turn individual games into \"DLC's\" so that it shows in the charts that people play your games. This game sucks. I have an RTX 4060, 32gb ddr5, i5 8cores, 9tb nvme, and can barely run the COD launcher. Not even one hour in and I am already refunding this pos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well well i cant believe i am saying this but this game is one of the best in the last couple of years and that not good because this game was fucking dogshit it has its moments and at times it is fun but in general its a very mid game all together i skipped bo6 and no that bo7 is released and has no sbmm i hate it idk why i cant quite put my finger on it i love the fact that there is no sbmm but thats about it its slugish the gunplay feel boring slow and just boring and i cannot believe it but i was wishing i was playing mw3 instead of bo7 and i hated mw 3 this company keeps suprising me i genuenly though it couldnt get any worse than mw3 and now i have been proven so wrong\nThis game is a 6/10 compared to the 2/10 i would give bo7 still not worth it pls just buy bo3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As always, the developer made some shit.\r\nActivision could never make anything good before, but this time it’s such absolute crap... Every single aspect of the game (maybe except for shooting) is made to be uncomfortable. The interface is completely fucked — there’s a ton of stuff yet zero actual information.\r\nEspecially genius of Activision was selling MW as a DLC — and if you’ve played the free Warzone, you can’t even refund MW, even if you never launched it at all.\r\nThe game isn’t worth the money at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game was the worst cod of all time until bo6 had a worse game 😭",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes a lot but other than that its fine have a great day:3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash i played this 2 years ago and its honestly a 70 dollar dlc fuck avtivison",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer better than bo6. Campain made me kms.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lots of bots, very annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this at 50% discount. Still not worth it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "how is this not an mw2 dlc? worse, why'd i buy it for the campaign!?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SBMM is to high game is a waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "snipers made this game unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "soap and ghost didnt make out",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "dont buy this game , its scary !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "casino based first person shooter",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Call of Duty: Modern Shaders 3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is kicking me out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it keeps crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS FUCKING GAME ALL TIME\r\n CRASH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not a COD but it works",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keeps crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst purchase of my life.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a lot of bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Let's just kill Soap again for no reason.\" - IW",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if u like a game to not crash every 10 matches dont get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hot Garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "call of cheating :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Better than BO7",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "were are all cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "auch schmutz",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "كلها شداقن مهكره وهاكات لحد يشتريها",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "terrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DOGSHIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wank 3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "💩",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ehh. ehh. ehh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "غ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ";/.;;.p..jiujhkojp",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign - Bad.\n\nZombies - Mostly bad, some genuine good to enjoy though. Not the worst.\n\nMulti - Great, just visually messed up due to the cartoonish and out of place in-game store crud.\n\nGame's worth like 10-15 bucks at this point.",
      "voted_up": false,
      "votes_helpful": 212
    },
    {
      "review": "Its a game... that exists, only thing worth a damn is zombies...... uhhh, looks worse than MW2  somehow, no campaign.... yeah, just dont get it.",
      "voted_up": false,
      "votes_helpful": 275
    },
    {
      "review": "I get constant crashes with this game, terribly optimised and can't get through more than 2 single player missions before crashing. This game is a joke, if I could refund it, I would.",
      "voted_up": false,
      "votes_helpful": 128
    },
    {
      "review": "The company are bastards — my account has been around since 2020. I’ve leveled up absolutely everything, all the camos in every part. All the calling cards. All the events, all the Black Sectors. And yesterday, without any explanation, I just get hit with a ban. I even wrote that I’m ready to provide access to my PC. On my PC I only have G Hub, Armory, Nvidia Experience, and Discord. No response. That’s -500€. Now think for yourself if you need this.",
      "voted_up": false,
      "votes_helpful": 215
    },
    {
      "review": "Devs are so layz they didnt even bother putting dialogs or proper missions. they call it \"open combat mission\" what you do is feels like play againts bot in an empty multiplayer server. Trash story and misions.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "One of the most frustrating games I have ever had to deal with. If it's not having to wait who knows how long for any new pre-shaders to install so I don't have to deal a delayed stuttering mess during online play, it's dealing with game crashes at the most inopportune times. I feel paranoid going into any zombie matches now that the game will crash and make me lose all my perks and then I have to start from scratch, and work my way back up to what i had while I feel like a burden trying to catch up.\r\n\r\nOther than that, it's a the tried and true COD formula. Mindless but enjoyable fun. Triggering the super high level players with low level kills will never not get old. Haven't finished the campaign but I for sure checked out after 3 missions and just checked my phone whenever a cutscene came on.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "Campaign is half-baked slop, multiplayer gameplay is fun but cosmetics are stupid",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Pretty fun multiplayer except all the small maps make it feel super same-y. Zombies is ok but extremely grindy. Where did we trade fun for grinds? Womp womp.\n\nDon't recommend though because you can't even play offline with bots or campaign on Linux due to no anticheat support for Wine/Proton.\n\nEdit: Says I have 2.6hrs on record but that's after the split. I have ~400hrs on record.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "I cannot recommend this game because Microsoft doesn't deserve a fucking dime, even though MWIII is technically a great release for a cod game.\n\nDon't bother with the campaign or zombies, multiplayer is the real highlight here. Loads of weapons to unlock with multiple unique attachments that can basically turn the weapon into something entirely different, many of which are nods to previous cod releases (Turning the MK2 Carbine from MWII into Akimbo Model 1887s for example). All of the base MW2 2009 maps and a bunch of new (and returning) maps that play very well. Movement is quick, ttk steady, and plenty of modes to mess around in (Demolition being a highlight, personally). There are several ways to counter riot shield users, varying from under barrel flamethrowers and chainsaws, and a sword that can just delete shielders even if they are facing you.\n\nSledgehammer deserves better for delivering such a solid and fun experience. It's irrelevant now but it could be noted that during the game's \"lifespan\" or active seasons, Sledge did a fantastic job supporting the game. I played from the beta all the way to the last update, completed each weekly challenge, and still didn't feel completely burned out like the camo grinds and FOMO events of the past. There have been many cod releases where I'd find an issue and it wouldn't get fixed for literal months or even not at all, whereas Sledge fixed most issues days after they came up. The only thing I dislike or don't care for is that the player skins can be ridiculous or dumb and don't really look like they're all from the same series (even disregarding crossover skins). It lacks a clear visual identity, which can be said for pretty much all modern cod releases outside of Cold War, which stuck mostly an 80s/90s adjacent aesthetic.\n\nOnce again, the entire team at Sledge deserves better.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "It's okay as an game... But for an 70$ triple A game it's an joke and nothing else.\r\nFirst bugs and there are alot of them. Second u can only access an tiny amount of the maps that should be in there. Third only unfair gltiches stay. Additionally they don't care about the user as long as they pay. U can see this on Patches even when gamebreaking stuff is happening. U can't sue we don't care. On top is this basicly only An expanded version of mw2... Not Recommend buying over 30$. 30$ should be max price.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I haven't played many COD games, mostly MW3/Black Ops 1 on 360, and, Black Ops 3 on PC. A friend bought me this later in it's life (1-1.5 years after release lole). I've never played the campaign. This is solely my multiplayer opinion. \n\nGame is what you would expect of a 2-3 year old modern COD game at this point. If you play more than an hour or two, you usually replay the same lobbies. Kind of annoying when you get groups of players trying their best when you're looking for a goof around game. Or, when you get another lobby with someone obviously cheating multiple times per play session. That has been the experience I've had my last few plays. Besides stated, the community in this game is not great, but is what is expected of a modern COD game. It's either no one talking until they're losing and blaming others, or racial slurs off the rip for no reason and no in between. \n\nI've had about 4 battlepasses worth of \"content\" in this game before devs stopped making content for it. There were no map packs or traditional style DLC \"packs\", but new maps and weapons were implemented alongside battlepasses. New weapons were free along with map access. To unlock the weapon, you would need to level your battlepass to the required level. I never paid for the battlepass (unless I had saved enough points up from the free battlepass) so I didn't mind this system, but can see why people dislike it (pretty expensive for skins in my opinion). Also battlepass lole.\n\nDespite complaints, the core game/engine is pretty nice and enjoyable. Movement is pretty nice other than not being able to shoot while diving. However, I feel the cons out weigh the pros, especially considering the price. \nOh, and the zombies is poopoodoodoo. \n\nI would leave this neutral if possible. 4/10, can't recommend.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "its a dying game with hackers and terrible servers that crash constantly",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Should be called Crash of Duty because it crashes on every match. Battlefield 6 here I come!",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "rather be subject to intense physical labor to no end than have to play this ever again",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Campaign is a joke by scenario.\nMultiplayer is a more big joke with 5 minute matches and then 5 minutes of forced search for a new lobby with all this scoreboard screen and loadings that you can't skip.\nNot worth the price they sell this, not recommend to buy. For sure they're just trolling people by keeping it on the market with such price and mechanics.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the worst campaign\r\nthe worst multiplayer\r\nnever let Sledgehammer make a CoD game ever again.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "(9 hours review)\nThe only reason I got this game is to play it with my friends. There is a bug where I can't join a multiplayer party. And it is annoying as all get out. I read online that the devs didn't have time to fix it. It is one of the biggest blockers from making this game an enjoyable experience. We have to do a convoluted process to even get to play together. It is rage inducing.\n\nI understand it would take time and resources. When thousands of people are facing the same stop gap. It is worth it to pause a moment to fix it, especially if you want to expand your player base.\n\nAs of right now, I can't fully recommend the game. There are too many bugs. The campaign is fine so far. The art looks good. Just multiplayer cross play, which was a marketing feature, is broken.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is made for controller losers and is full of arabs abusing the modded mx guardian",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "only played campaign and it crashed but i have better than the minimum requirements to play. warzone runs better than this game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I would maybe recommend it if not for constant and obnoxious bugs; execution animations mutilating your character model, guns floating over your character's dick, and shaders that render in giant black squares instead of properly rendering.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The thing is broken, no meaningful updates so exploits run wild. Don't get it now, wait for the next good cod to come out",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so goddamn boring, call of duty used to be good, do not buy this game. Hoping Black Ops 7 is better, but I have very low expectations after Black Ops 6.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Activision, Raven and others apart of the team do not care about this game. However, if I could get BO7 that would be cool. this game was fun and now is a pile of shit covered in cum by lazy fat nerds.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too laggy and very un-optomized mess tbh. Playing cod black ops 6 is night and day difference, buy that instead!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Activision has given up on moderating this game - would not recommend in 2025. Cheats and glitched guns are rampant",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was having fun until i got shadow banned for no reason. i guess people just cant be good at the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+Can use MW2 weapons and operators\n\n-Poor, unbalanced match making\n-Unstable, often crashes during games\n-Extremely long shaders pre-loading time\n-Long TTK and unbalanced weapons\n-Worse animation and gunplay for MW3 weapons\n-Cringe skins and operators\n\nJust another piece of garbage made by trash company Activision.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}