{
  "positive": [
    {
      "review": "I bought a shooting game and ended up playing a horror stealth simulator.\r\n90% of the time I’m listening for footsteps, 10% of the time I’m getting one-tapped by someone I never saw.\r\n10/10 would peek a corner and die again. 😂😂",
      "voted_up": true,
      "votes_helpful": 48
    },
    {
      "review": "The ultimate Stockholm syndrome simulator. You hate the cheating sweats, braindead teammates, and laggy clusterfucks more than your absentee dad, but you'll simp for that next round like a cuckolded incel. 10/10 would play again.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "The Siege community is the only place where someone will teamkill you, type “my bad” in chat, and then blame you for walking into their bullet.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Bought game , \r\nLoaded in played my first match\r\nFirst round got headshotted while looking at the building\r\nSecond round got headshot for entering a door\r\nThird round i was read or so i thought.... ended up killing two teammates with C4\r\n10/10 would defo recommend",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Game is fine and well balanced for what it is but it's multiplayer and filled with people better than you \nDon't play this game unless you have emotional support with you \nOn the bright side you'll always have something to complain about",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I played this game on and off for quite a while.\r\nYes, this game has downsides, a lot in fact. Yes, I sometimes call it a piece of garbage but that is due to Ubisoft Disconnect and its problems.\r\n\r\nIf you are a fan of shooters that make you think 3d (as opposed to 2d thinking in CS2), this is the game for you. If you expect a tactical shooter, then this game is not for you. \r\nThink valorant but more vertical and with a lot more people un-aliving you from spots that you never thought of (while 3 km away from your position) or holes the size of your fist.\r\nEven if you don't have a good aim, this game will provide you with enough opportunities to even the grounds with your enemy. Probably this is the only game where camping (being a rat) is a viable tactic, anyone who says otherwise did not do good recon before entering the room, game provides you with enough possibilities to check the enemy positions.\r\n\r\nAnyhow, I recommend this game for being a fun thing to play (at least for me)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I don't like siege x but besides that its a good game, kinda like chess or clash royale",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "if you want to get rage-baited, then I'd recommend getting this game. \nafter all, it's a pretty fun game with friends to see which ones of them are idiots and which aren't.\nalthough I have to say I would not recommend people in a relationship play this together.\n(there is a high chance you might be single after the match but only if ur asssssssss)\n\nget the game or sum like that",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awful game. i regret buying this and playing it with every fiber of my being. words cannot describe my pure resentment towards this vile awful game. i really wish i could travel back in time and stop myself from seeing an egirl on instagram cosplaying as ela that sparked my interest in the game. to my friends who i asked to get the game and play with me, im sorry. i wish i could take it back. i wish i could undo the damage that was done by this god forsaken game. to the ones ive lost to this game, remember i will always be with you. hanging onto the memories i have with you. you will always have a place in my heart. to all you people considering adding this game to your library, ask yourself this; is it worth is? the pure pain and suffering, the terrors you will face day in and day out once you open this game for the first time. is it worth the invisible tear it will cause between you and the ones you hold so close to you. this game isnt just a fun thing to pick up and playing on a saturday night with your friends, its a disease. its a cancer that will start small and unseen, and once the infection is seen, it will be too late. please i cannot express my caution enough to you. please tread lightly with your thoughts of playing this game.\r\n\r\n10/10 will play again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For creative fps players. Don't be afraid of the \"one shot headshot\" mechanic. It is a terrible mechanic but don't be afraid to be an aggressive player. Not COD aggressive though. That is dumb.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "literally the best competitive shooter game you can play thanks to its fundamentals. Having an above average aim can only get you so far. You need to learn to adapt to your surroundings, find the gaps, create your own opportunity if you need to. It's the mix of environmental knowledge, decision-making and mechanics ofc.\n\nBeen playin it since Para Bellum on and off, it's sad to see how badly they're managing this game at its current state. Still would recommend to newbies but it can be pretty hard to learn, it might take some time to actually see that you're improving.\n\n#SaveSiege",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun like the consept lots of agents",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the matchmaking, especially when it gives me 1 copper player, 2 bronze players and a silver, against 2 emeralds, 2 diamonds, and a champion player. Mr Ubisoft really thought it was a balanced match. :thumbs_up:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, a perfect mix between arcady shooter and tactical milsim. took a bit of a learning curve but its really good, much better than valorant",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is a very skill-dependent game, if the teammates are idiots, then that's it. The opposing team will do their best to take away the tape and you won't do anything. in general, the game is very good, Ubisoft has tried for 10 years.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Rainbow Six Siege is a tactical shooter built on tension, patience, and razor-sharp precision. Every round is a fresh mind game: slow steps, distant audio cues, intel that can flip your plan in an instant. One wrong angle and you’re gone—one clever read and you turn the entire match on its head.\n\nWhat truly sets Siege apart is how much your decisions matter. Your aim matters. Your communication matters. Discipline and creativity go hand in hand, and every Operator becomes a tool for clutch plays or unforgettable failures.\n\nRounds shift from quiet standoffs to explosive chaos in a heartbeat, and no two matches ever feel alike. With a coordinated team, Siege becomes one of the most satisfying competitive experiences out there. Solo queue? Still brutal, still tense, still addictive.\n\nIf you want a shooter where knowledge, timing, and nerves decide everything, Siege delivers that thrill every single match.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I'm bad at the game. I don't like the game For some reason I keep playing the game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love 6 Seige, great game to play with friends. Graphics are amazing. They keep adding new stuff to keep the game current and relevant.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game! Can't stop playing since i started. highly recommended for shooter/ stealth gamers!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Rainbow Six Siege is tactical anxiety with a side of explosions. You prep, breach, and pray your drone saw everything. One pixel peek and you're gone. It’s not run-and-gun—it’s think, listen, and sweat. Every round feels like a heist with five operators and zero trust.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Rainbow Six Siege is a tense, tactical shooter where teamwork and strategy matter more than raw aim. Its destructible environments, deep roster of operators, and responsive controls make each 5v5 match dynamic and rewarding.\nThe game has a steep learning curve, and solo or uncoordinated play can be frustrating. Some technical issues like hit registration and matchmaking quirks can appear, but ongoing updates have improved maps and modes.\nOverall, it’s one of the best team-based shooters on PC for players who enjoy strategy, coordination, and high-stakes gameplay, though casual or solo players may find it challenging at first.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Siege has aged like a fine wine, it is fun even after many years from its launch and i kinda look forward for Ubi to Support this game further.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "got called the n word then i got banned for a week, 10/10 game recommend playing",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Much more fun with a group of friends but can be stressful as a first time player, especially if you're not used to first person shooters\r\nI'm still a total noob at this game but I'm getting better and better every time and I still manage to have fun while getting absolutely smoked by enemy teams LOL",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you ever become unemployed with 0 future job prospects and at least a thousand hours on your hands then you might have a tiny bit of fun on this game once in a while",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1,000 hours on the game. This season is ass don't recommend playing this game until they rework ranked, matchmaking, and balancing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tom Clancy's Rainbow Six® Siege X is a First Person PvP tactical shooter by Ubisoft.\n\nThe game has cross-platform play; it uses the Ubisoft Connect launcher. I play on PC with mouse & keyboard. My review will be mainly based on my experience in Quick Play and Standard matches. As of this writing there are 76 unique playable operators including the most recent being Denari. You play as teams of 5v5. There are operator speciality roles to fill such as anti-entry, crowd or map control, support, intel, anti-gadget, breach, trapper, front line.\n\nThe gameplay mechanics are fun. R6S has a lot of tactical depth and destructibility. You're rewarded for teamwork. Many floors, walls and hatches can be breached. Strategy is very important as well as aim. The gunplay feels responsive. And movement has the right amount of weight to make every action deliberate. One of the main positives is enormous roster of operators. Everyone has their distinct tools and fills their own niche that allows for experimentation. It keeps the gameplay fresh and encourages you to learn multiple roles. When you die, you can still operate observation tools and help your team with call outs. While there are balance changes through patch to patch, Siege manages to maintain fairly decent balancing. The meta is constantly evolving. The environments are detailed but functional, operators are recognisable. Audio plays a main role. The sound design is great. You can hear footsteps, gadgets, and gunfire which carries meaningful information. Although Siege is mainly a multiplayer experience, Ubisoft has managed to build a surprisingly rich lore around the operators. There's a lot of replayability, no two matches feel the same. Even after hundreds of hours. On PC, Siege runs pretty well. It's well optimised and offers a lot of accessibility settings like colourblind modes and customisable HUD elements. From launch until this day, the game has been constantly evolving. It keeps it from being stagnant. The monetisation isn't too bad. While R6S does include cosmetic bundles, seasonal passes and premium skins, the core gameplay and all operators can be unlocked through play. However, not all operators are available from the start. They need to be unlocked through points. It is a little tedious to get enough points to unlock the operators but I'm not awfully upset at that. Matchmaking doesn't take very long to queue most of the time. \n\nFor the cons, despite Ubisoft's efforts - balance can still swing wildly between seasons. Certain operators or weapon combinations can dominate the meta until a patch arrives. The constant shifting can be frustrating for long-term players who invested time into mastering an operator just to see them get nerfed in a later patch. While the maps are well-crafted they can still suffer through awkward layouts or cluttered sight-lines. It may be difficult for a new player to know the map layout unless they've put hours into gameplay. Some of the maps feel like a maze. There is a map layout gamemode where you can learn maps though, I'll give them props for that. The core modes - Bomb, Secure Area, Hostage; have been around since launch and while they are well-designed, the experience can feel repetitive. R6S has near-infinite replayability but the steep learning curve can be overwhelming for newcomers. Understanding operators, gadgets and map call-outs can take dozens of hours. Matchmaking can be inconsistent. Pairing veterans with new players or creating unbalanced lobbies. There is new content released regularly but some players feel there isn't enough added or that community feedback isn't always heard. Some design changes can feel out of touch with what the player base wants. While Siege's roster is undeniably diverse, the way some of the operators are presented can feel like corporate pandering rather than genuine representation. Ubisoft prioritises showcasing an operator's identity traits rather than integrating them naturally into the World. As a final point, I'll mention their QB / BattlEye AntiCheat. It has some privacy related and practical concerns. It also requires mandatory updates to be difficult to install, especially over unstable internet connections. I've been locked out of playing the game because I can't install the update and I've had some major issues around that. This only started happening more recently, which is rather disappointing. As of this writing, the issue persists for me. I would also like it if the game included more options for Offline and Single-player.\n\nOverall, the game is challenging and rewarding but suffers from balance shifts, steep learning curves and some technical issues. I do enjoy coming back to play it when I'm able to. It is one of my favourite tactical shooters. I love the environmental destruction and using gadgets or rappelling from rooftops. There isn't another game that scratches the same itch for me. Even if I have a sort of love-hate relationship with the game. I do come back for the new updates and when I'm not having technical issues and playing with friends I'm having a lot of fun.\n\n[b]7/10[/b]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Such a versatile game, one thing ubisoft did well was making different operators with different capabilities conduct attacks and defensive measures. For the most part I'd say the maps are decent with wide variety of peak and sneak tactics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a good game not that many cheaters since they have a good anti cheat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, takes a while to understand what is happening/ why you keep dying but fun once you get the hang of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is colon cancer to the max SLUTGHER ALL MY TEAMATE FOR A LAUGH W GAME FORT LOKWEY ASS HATE THIS GMAE AND FORT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been Rap*d by ever single person in this entire game, and I have every single STD known to man, because gold players just SUCK ASS bro.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game to play with friends, the match making is meh and it's 50/50 if you get good teamates or braindead ones",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like 434 hours on this game is a lot, then I look at friends and other players, I am still a noob. \r\n\r\nOtherwise great game, would strongly recommend if ever you are willing to balance your sanity of a thin line.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u hate ur life , love raging and playing with a team of a combine IQ of a parrot , this game is perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game may or may insert suicidal thoughts into your head and make you hate every random you come by because they play like a fucking toddler, maybe even still in the womb. Cant join a non ongoing quick match and the community is very nice and family friendly, myself included. (i dont have four hours, i play via Ubisoft connect)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hard at first to get the hang of. This is the first game i properly player for a long period of time and i think its pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun untill, definitly didnt make rage quit multiple times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im not gonna pour out my heart and soul, the leaning around corners is fun, leveling up to unlock new operators for their unique skills is fun, the skills and gadgets are fun, all i can say is all around fun. i did click the box for \"received this item for free\" even tho im not sponsored by ubisoft(hmm, maybe i shouldnt click the box, it might be for \"paid\" games, not free demos, of course i got this game for free, because it's free) since it used to not be free from what i heard, i guess there is a demo now(i thought it was always free? am i dumb?) and now you have to pay for ranked and uhh, i think it's a tournament or esports cup. we casual/REAL gamers don't need it. leave it to the sweaty esports soy boys. did i pour my soul out, or did i ramble? please dont play if your not good.-Whackadoodle420",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic it is definitly widely considered a calm game that never inflicts any kind of rage.  The community is also very friendly and uses loving words to show their appretiation for your work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy fun game exept for sweaty ass men and hackers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rainbow Six Siege is one of the most rewarding tactical shooters out there. Every match feels different, every decision matters, and the level of strategy this game demands is incredibly satisfying. The operators all have distinct abilities that genuinely change how you approach each round, and the destruction system keeps the gameplay fresh even after hundreds of hours.\r\n\r\nThe game shines the most with teamwork—coordinating with your squad, setting up defenses, or executing the perfect breach never gets old. Ubisoft continues to add new operators, maps, and balance changes, keeping the experience feeling alive and evolving.\r\n\r\nYes, the learning curve can be steep, but once things click, Siege becomes one of the most intense and enjoyable competitive games you can play. If you like tactical gameplay, communication, and clutch moments that get your heart racing, this is absolutely worth it.\r\n\r\nA must-play for fans of strategic shooters.\r\n\r\nI allways seem to find my way back to playing this game. tho there is some bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fuck this fuck ass game i cant play because of your shitty servers there people calling me the nigga word yous need to fix it. i hope this szn is better than that last fuck ass szn your stupid nigga i will still play this game becasue i love it but this game is fucking shit nigga fix it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lwk game is pretty cool hwever if u get shit teammates whos brains are the size of an ant the game turns into the biggest pile of doodoo ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game when playing with friends but also by your self and its worth the money if your not gonna give up three games later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "theres a anal probe in my ass digging into my nerves that gives repulsive feelings of face fucking when i play this god forsaken game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super awesome game love it. Honestly does not deserve to be Free. Its way better with a game like this I would expect it to be around 30$ like COD. This game is great it is very hard. At first many people may not like it becuase you always get killed super fast and dont get much kills. I feel like it took me about 30 in game hours to get to a point where it was a lot more fun and I was consitently getting kills. HIGHLY recomend playing with friends makes it way more fun. Sad that this game is dead. Overall this game is great and I highly recomend.,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is a massive ballache, Needlessly complicated and endlessly needy. Imagine if such expertise were used to make something other than diabolical ranked strats.\r\n\r\nI love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SO fun i get to kill tm8s and that just carries the game other than that the game is buns",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so, after playing this game for a long time i think that this game is like a dru6, youre hyped with expectations before playing it and then when u play it 99% of the times your allies are the equivalent of a dead opossum in jail because he tried to grape my little sister, then after being chatbanned you decide to leave ok. THEN YOU START STARING AT THE SCREEN THINKING OF WHAT DID YOU DO BAD IN LIFE, so you hop on again looping this whole shi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game very addicting and easy and not a pay 2 win game such a good game for anyone honestly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game so much it makes me want to cry i love when blackbeard cums in my fat ass with his big black cock and then some other prick comes out of nowhere and puts there big dick in my mouth. \r\nuibsoft needs to fix this game or im buying cheats:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive been playing siege since 2019 and ever since then my mental health has dropped so much ive been to a mental asylum every time i try to quit i cant its agony buuuuuut its lowkey fun with friends a plus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is probably the best free game on the market and it is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a team game exept zesty cavera who leaves me to 1v5 and is sceaming down the mic to get better but still very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It''s a good game that definitely has flaws, but can be a lot of fun if you dont take it too serious",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Switched over from Playstation just for this game!!! I absolutely adore this game however it is very frustrating at times such as Siege TImings( same as cod timing) but still I love it and I guarantee you won't find another game like this. \r\n\r\nIF YOU'RE NEW BEWARE THIS GAME IS HELLA FUN BUT YOU HAVE TO TRULY LOVE IT TO STAY AS THIS REQUIRES TIME AND DEDICATION AS MAPS ARE HARD AND THIS IS A SIEGE YOU HAVE TO BREAK!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fucking uninstall this shit right now its so fucking ass id rather lick my own shit than play this game again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, but the players are toxic and it ruins the game. if players behavior was better it would be great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rainbow Six Siege is an outstanding tactical shooter that keeps you on edge from the very first to the very last minute of every round. Each match feels unique thanks to the diverse operators, smart gadgets, and complex maps that encourage strategic thinking. It’s not just an ordinary shooter; it’s a game that rewards communication, planning, and strong team coordination.\n\nThe graphics and sound design are top-notch, and the dynamic environmental destruction adds a layer of realism and countless tactical possibilities. The community is active, and Ubisoft constantly updates the game with new operators, reworks, and events, keeping the experience fresh and engaging.\n\nIf you enjoy games that focus on strategy, cooperation, and skill, Rainbow Six Siege is one of the best choices out there—an excellent blend of adrenaline and tactical depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actually fun and it involves skills and being tactical not just running around like a traditonal fps game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“10/10 would breach through my own drywall again”\n\nI loaded into my first match of Siege X and instantly realized the game was too realistic.\nNot because of the graphics, no no—because every time I tried to peek a corner my character tripped over absolutely nothing, just like I do in real life. Immersion = unmatched.\n\nTried to plant the objective, but my teammate was arguing with his microwave in voice chat, someone else was breathing like a vacuum cleaner on max power, and our last guy was role-playing as a Roomba by spinning in circles on the floor.\nPeak tactical gameplay.\n\nI got wallbanged by someone who wasn’t even facing me, my drone fell down the stairs and died (??), and somehow I got kicked for “suspicious movement” when my controller drifted a little too hard. Honestly, that one might be fair.\n\nBut besides all the chaos, just a heads-up: some of my friends who owned the original game said that after Siege X came out, they couldn’t play ranked unless they had PlayStation Plus. Not really an issue, just kind of a weird concern they ran into.\n\nOverall: Great game. Terrifying teammates. Perfect experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game very fun if you keep loseing just lock in and get better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best FPS games ever IMO.\n\nDon't play anymore because my ubisoft account is messed up & most of my hours are on my xbox. Haven't played for a while either so I can't even comment on the current state of the game but it WAS great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun and in my opinion more real looking and more real then cod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent game with friends,my all time favorite game ubisoft is great game company with great talented people.\ndeveloper please give option as defender to remove renfored wall on game,if someone mistakly renfored please.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game proves that the anti-Christ has risen among us to wreak havoc in our society, i lost my virginity to a shield rush and ever since the i never pooped the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took them 10 years to add Steam achievements. XD\nNice toxic game tho, except for the forced crossplay on PC ranked...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Walls are optional.\n\nMy teammates aren’t.\n\nBut somehow they still leave anyway.\n10/10 would get flashbanged by my own team again.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "guide for game\r\n\r\nleft click shoot\r\nmove mouse look\r\n\r\nthank later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HONESTLY DONT PLAY THIS GAME IT LITTERALY SUCKS THE SOUL OUT OF YOU JUST TO JOHNNY SINS FACE FUCK YOU AND MAKE YOU ITS OWN BITCH. Overall though it's alright..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is not for the employed . some sweaty smelly nolifers here are just different breed of mouth breathers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a competitive shooter i have lost nearly 5k hours across... [spoiler] 6 accounts,,[/spoiler] ... cough cough.\n\nI wont hand hold and say its easy to learn, its a 1 shot kill kinda game. the community is toxic. [i] HOWEVER [/i] when played with friends its both a sweatfest and a fun time. just dont take the angwy people seriously. as for tips, the only one i can give, is to observe how you died and learn from that. its good to be humble when learning this game.\n\nenjoy it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not much to say... This game will always be in my heart because I've made a lot friends over the years playing it on PS4 back in the day. Also my little brother who unfortunately passed away recently, had played the game alongside with me (on the same account I mean) since 2018 when we entered the game and made many connections and friendships,  even though Rainbow 6 wasn't and still isn't very popular here in my country, we still encountered many cool persons, both regional and international. Hell, might be one of the reasons I can write this in english and not to mention the game was so much fun back then.\n\nAnyway, on the other hand I hate how this game has become and the stage it is currently in. For the new players who wants to buy the game and wants to be grinding the higher ranks, I'd recommend to just play it on console because it's much light on cheaters, if not well you can take your chances on PC, this is not an easy game and definitely not for everyone but if you're patient and watching some tips and tricks videos or content creator and getting into the community, you'll get the hang of it in no time. This game can still be fun under certain circumstances",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I either play cheaters, no life losers with no jobs or social lives, randoms that dont have eyes or ears or hands, or a random that is actively sabotaging for lord knows what reason. Dont expect anyone you report to get banned. The names they say in the top right that get \"Banned for cheating\" are fake and are generated randomly to make you think that ubisoft is doing anything to actually make their game playable. Overrun with cheaters. Overall 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I played religiously, this game was riddled with cheaters using various means to just be a degenerate human being and it would always frustrate me.\nGet past that and get hit with the people who are disgusting at the game and it would always frustrate me.\nGet past that and get hit with a decent game of search and destroy.\nThis game frustrates me. 7/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games super fun. Only problem is artwork community being only gooners",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "least toxic fps ever ive ever played. awesome maps, great mechanics, and i love the positive energy from my teammates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like putting 10 unregulated bulls in a bright red room and strapping guns to the back of them\n\nits like as soon as the round starts, your teammates instantly fall into their base human instincts and forget all manner\nof direction or coordination.\n\nGuns in this game have a harder mood swing than your bipolar mother after watching\ntwo episodes of Greys Anatomy.\nI once tried shooting a shotgun point blank into an enemy's head, only to be met with a punch in the face Ubisoft likes to call \"hit rejection\". \n\nI dont have too much to say about the maps or characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely abysmal game, teammates are consistently terrible, love every second. this game is a canon event for all and ranking up feels like trying to saw my arms off with a butter knife. 100% recommend. whether or not this game is objectively is is wrong but the memories and fun I've had with my friends on this game compares to nothing else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thanks to Rainbow 6 X, I have depression and a gambling addiction. Peak game, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WORD to my deads, you would never win a 1v1 against me. you'd have better luck begging a 304 city girl not to give her hoochie up for some clout from an atlanta rapper who barely breaks even on spotify. besides that amazing game, you just suck uninstall.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "AWESOME GAME!! i love fps games and this one is peak! I love the mechanics and graphics, and Jaeger is my favorite <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1. boot up the game\n2. load into casual\n3. get a kill by chance\n4. get yelled at by a 30 yr old still living with his parents for aiming at the wrong pixel of a doorway\n5. get TKed\n6. boot up another game\n7. Repeat\n10/10 wouldnt recommend for sane people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game it highly relastics and doesn't make a new game every year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont make the mistake of downloading it i have been addicted for 2 years then i quit. Its addicting because of the different strats u can try out each game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game where you get to play with lobotomised ret@rd5 and on the enemy team is an unemployed f0ck tard that doesnt get off the game, if you think about getting this game, defo do cuz like, its so fun :) every game i end up hitting the issac thumbs up ifykyk, all in all great game would recommend :thumbs-up: spent over 1100 hours on this game most on playstation and i love this game. i love playing with f@9s that cant aim for sh1t and make me cry :tumbs-up:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "started playing this game as a healthy, straight A student, now I have down syndrome, aids, testicular torsion and all F's on my last report card. DON'T FALL FOR THE PROPAGANDA!!! (sike ts game is actually so tuff boii)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Strategie game need a high IQ but also need a Good server's cuz they are a big prblm for player's it's like u get kicked out from the game cuz they have a prblm in there server but guess what u also get a penalty cuz u left the game a cuz of them and that is a really a big prblm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best fps games i ever played and i would like to add that this need your total focus and hearing ability,its not like some other battle royal or fps not an average gamer's game tbh.\r\nIts realistic and immmersive and you might even give give up before you get started lol...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good enough gameplay if you've been playing fps games long enough, lots of interactions with the environment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very tactical and strategic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but hate the level 50 restriction for ranked",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, the game features are truly revolutionary like droning, breaching and leaning mid movement, the controls always feels good and responsive, probably the best fps I've ever played. But for god sake the anti-cheat is non-existent, feels like >UBISOFT< is playing a prank on you, u encounter cheater every 2-3 games in queue and even when they are banned afterwards u only get a fraction of your points back. I probably don't even need to say this but the game is way better played with friends, both for the fun and tactical aspects of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game requires tactics and is a fun overall to pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if playing a custom or against legit players, hope the future bings down the cheaters for good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me it is like really hard to progress and become better in this game, but i still really enjoy playing it from time to time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever made if you have chronical depression and if you are a absolute racist",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really good game if you have normal average iq and smartness teammates but if you dont which is most likely the games that you will play with them you can experience a feeling opposite to the rage room that you go in and relief your anger and stress in R6 you fill yourself anger,stress and bunch of other bad factors many cheaters many bots but i love this game since 2016 its like a addiction 0/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rainbow Six Siege is one of the most impressive long-running tactical shooters ever released, and it continues to refine itself into something even better year after year. What makes Siege truly stand out is its commitment to strategy and tension. Every round feels like a fresh puzzle that demands smart decision making, patience, and teamwork. Instead of relying on chaotic run-and-gun gameplay, Siege rewards players who think ahead, communicate, and use the environment to their advantage.\r\n\r\nThe Operator system is one of the game’s biggest strengths. Each Operator brings a completely unique gadget and playstyle, and the roster has grown into a diverse lineup that supports creativity and experimentation. Whether you prefer aggressive entry fragging, support roles, or defensive utility, there is always an Operator that fits your style. The balance between attackers and defenders feels deliberate, and even the smallest gadget choice can have a massive impact on the flow of a match. Because every character is so distinct, no two rounds ever feel the same.\r\n\r\nEnvironmental destruction is another defining part of the Siege experience. Being able to break walls, floors, ceilings, and barricades adds a level of depth that very few shooters ever reach. The map is not just a backdrop, it is a tool. Creating new sightlines, opening vertical angles, or reinforcing key entry points completely changes how you approach each engagement. You’re constantly thinking about how the space around you can be used to outplay the enemy. It makes every round tense and unpredictable, especially when you hear the subtle sound cues of someone breaching a wall or creeping through a newly made hole.\r\n\r\nThe pacing is also a major highlight. Siege knows how to build suspense. Rounds start slow, with drones scouting, defenders preparing, and players quietly positioning. Then everything can flip in seconds, turning into controlled chaos where quick reactions and sharp communication decide the winner. That slow-to-fast rhythm keeps the adrenaline high and makes clutch situations incredibly satisfying.\r\n\r\nThe developers have consistently supported the game with new content, balancing patches, event modes, and quality-of-life improvements. Siege has grown without losing its identity, which is rare for a live-service game. Even maps have been reworked over time to improve clarity and competitiveness. The result is a game that feels modern, supported, and always evolving.\r\n\r\nWhat ultimately makes Rainbow Six Siege so compelling is its high skill ceiling and replay value. You can play for hundreds of hours and still discover new angles, new strategies, and new ways to approach situations. Learning the maps, mastering your favorite Operators, understanding rotations, predicting enemy habits, and improving your mechanical skill all come together to create a genuinely rewarding experience.\r\n\r\nFor players who appreciate tactical depth, communication, strategy, and intense moments that actually feel earned, Rainbow Six Siege remains one of the best competitive shooters you can play. It’s a game that challenges you, pushes you to improve, and gives you unforgettable moments that stick with you long after the match is over.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "1. boot up the game\n2. load into casual\n3. get a kill suprisingly\n4. get yelled at by 26 year old living with his parents still for aiming at the wrong pixel of a doorway\n5. get TKed\n6. uninstall and dont touch it for the next 6 months\n7.Repeat",
      "voted_up": false,
      "votes_helpful": 214
    },
    {
      "review": "I was once completely hooked on Rainbow Six Siege. I played it for years, invested plenty of money, and truly enjoyed it. But eventually that passion turned into nothing but frustration and resentment toward the game and the people behind it.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Zero Chromosomes \n\nNoah's Ark couldn't carry these dumbass animals that are my teammates, my teammates lack a frontal lobe and seem to have been lobotomized.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "once an original game started chasing trends like so many others , L",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Picked Monty. Spawn in with a pistol, and a shield on my back that I cannot equip. Great game, love this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ubisoft account stolen for a cheater to use it and boost another dude for money. I was made aware of my account being stolen just because I got a ban notice on steam.  I did not play this game for ages nor did I connect to ubisoft in nearly a year...\n\nUbisoft is using third-party companies to do their tech-support and those people steal innactive account and sell them.\nUbisoft will never aknowledge the issue is on their side. \n\nNow i'm stuck with a ban notice on my 15 yo steam account. Thank you Ubishit",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game was great, but it has been abandoned. Cheaters have too much impact on the state of the game. Game-breaking exploits are also rampant.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s honestly so frustrating that Rainbow Six Siege got rid of Terrorist Hunt, one of the main reasons a lot of us bought the game in the first place. People have spent real money on operators and skins thinking the game would keep all its core modes around, and now a huge part of it is just gone. It feels like such a slap in the face to long-time players. At this point, I really hope there are laws one day that stop games from removing stuff people actually paid for. Seriously, avoid this game — it’s turned into a battle pass and microtransaction nightmare.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Despite having had so much Fun with the Game over the Years i cant recommend it at its current state. Making a Game like Rainbow Free To Play and not implementing sufficient Anti Cheat Framework and Penaltys was the biggest mistake Ubisoft could have done. \r\n\r\nThe Game is full of cheaters who dont have to fear any consequences. Account banned after 4-6 Weeks of Cheating? i just make a new one. \r\n\r\nMeanwhile the Devs: OMG Guys look at our new Mode X(that no one plays) and this sick new Skins for 20-30€ (that no one asked for)\r\n\r\nFIx your broken Game and i come back gladly; because there  is no game like Siege. But man its current State is the worst it has ever been.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought r6s about a year ago, hardly played it. But last month my passwords got leaked, and so I had to delete my Ubisoft account, because I couldn't get access to that account. The account has now been deleted, and now I can no longer play r6s, even though I have it in my steam library. Ubisoft support team will not help at all with this problem, and it is far too late for me to refund the game on steam. I am left with no options. I cannot rebuy it. I cannot reinstall it, I cannot refund it, I cannot play it. \"\"Enrich players' lives by creating original and memorable gaming experiences\" -Ubisoft",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Truly one of the best multiplayer FPS games of all time succumbed to ouroboros because of imbecile devs and rampant hackers. There is a pattern of decline with zero show of greener pastures and I wish for nothing but for this game to be \"playable\" again but going FTP cemented infinite accounts for hackers and a dev team with empty promises on anti cheat time and time again. It will always remain an all timer game but its going out like your alcoholic uncle.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game was fun before but now they updated it and it feels horrible and they added a blank loading screen that you get to stare at for 30 seconds every round",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "keeps crashing, and you get ap enalty for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What changed?\n\nThis game used to be my favorite (many years ago). However, the battle pass progression burnt me out (it can take multiple hours for one tier). I played hundreds of hours on console, and some on PC, but can no longer recommend this to anyone, despite it being my favorite game for years. The new operators look terrible and push boundaries of realism in ridiculous (not fun) ways. Beloved maps are thrown out of the window and replaced with terrible new ones. Operators who worked great before have now received reworks that contradict their entire character (i.e Thatcher). Reduced time in matches means a playstyle that is less strategical and more like Call of Duty. Terrible anticheat and mishandling of friendly fire. Collaborations that shouldn't exist (I love Master Chief, but why is he in this game???). There really is just too much wrong with this game to name it all.\n\nThe community is miserable, so prepare to be miserable if you join in on it. I highly advise people wondering if they should get the game to not do so.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont install unless you like cock and ball torture",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you have a 50/50 between the most bitchless unfun players or just cheaters. not really worth playing anymore",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played this game on Windows 10 until end of support and it was working fine with no crashes. \n\nFinally decide to update to Windows 11 and then reinstall siege.\n\nCrashes happen every min and takes 5+ mins to start up game. Lost multiple ranks trying to get the game to work.\n\nThanks for reminding to quit playing siege Ubisoft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played this game religiously back in the day but now its a shit stained, pride, seizure inducing, ass destroying pile of hot dogshit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is like cigarettes, its not good for you but you get addicted so dont start",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Takes about 2 years to reach ranked mode. I dont give a flying shite about unranked or casual. \r\nGame is filled with weeb-outfits & hackers. \r\nWhat happened to the 2016 SWAT game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "stop playing this game now it's just endless grind and literally nothing have changed in the game now. I thought after siege x something will change but it still looks the same with no graphics improvement no new maps are being added so what's the point. And ubisoft will just provide new skins to keep this going on well this will not work now. Bring something more and better enough time wasted on this. Time to move on, I can hardly find any player rank to play on matchmaking takes like forever now,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst game of all fucking time. do not waste your money buying it. the golden age of Siege was a decade ago and it's now just a goofy parody of itself.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have 3k hours on ubi, i love this game, i really do, but not the game itself, i love the memories i have with it, so i don't recommend you to open, try or think about playing, go away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to love Rainbow Six® Siege X, but it’s hard to ignore just how disappointing it is. The game promises a realistic tactical shooter experience, yet it often feels anything but. Matches are chaotic, unbalanced, and at times downright unfair.....far from the strategic, team-based gameplay the series is known for\n\nnew mechanics seem halfbaked, with clunky animations and inconsistent hit registration that ruin the flow of play. The maps, while visually impressive, feel overcrowded and poorly thought-out, making tactical planning almost impossible. Add in the frequent server issues and you’ve got a game that’s more frustrating than fun\n\nIt’s frustrating to see a franchise with so much potential release a title that feels rushed and unpolished. Unless major improvements are made, this one will only appeal to die-hard fans willing to overlook glaring flaws",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please add more paywalled guns and not fixing the crashes, it makes me sooo happy to see that you guys care so much about the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "would rather cut my balls off with a rusty chainsaw infused with aids and sell it locally to my neighbors as processed meat than even think about playing this game again within this lifetime. it's truly astounding how the matchmaking system consistently pairs me against 9 enemies regardless of when i queue or who is on my team. a guy will go 0-9 on my team and be the biggest possible ape known to man until i match up against the same guy the very next game where he will then proceed go 23-2 and become the best player in the world. as if the game was not dying and bad enough with every update the amazing company ubisoft does, ranked 2.0 and siege x became a thing, turning the game into a mobile game and basing ranks on how many games you play rather than how good you actually are. I can play 130 games and be hardstuck emerald/diamond stuck with apes while little jamal plays 400 games a season hits champ and has the best teammates ever. probably would not even recommend to my stupid neighbor whom i despise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yeah so basically the devs gave up on the game a long time ago , it always takes 2 to 3 buisness days to open the game , if youre an OG and youre coming back ... plz dont ... youll regret it .. deeply",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is bugged af, ranked without cheaters is impossible, rank system sucks, lack of content, same events without changes. Let this game die, and hope some competent developer will buy and fix it in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just getting back into the game after a long break. A few matches in teammate was being extremely loud and disruptive so I said \"I'm fucking muting this guy, he's loud as hell.\" Muted him and went back to playing.\n\nMaybe a minute later get a pop-up that \"disruptive voice communications were detected 34 seconds ago,\" Now I'm muted for 20 matches and can't communicate with my team.\n\n10/10 amazing work Ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you can have a better game and life \ndont play this game\ndont play ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game to ever exist, I hate that this is in my library and that I spent money on this hot pile of garbage before it became F2P.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a masterpiece that had been an integral part of the industry since 2017 began to die a slow, painful death in 2021 because of ubisoft managements greed, laziness and LGBTQ+ agenda (Im not saying its bad, but it to make things difficult on purpose). Its sad to watch the r6s team spend all their time reused cosmetic items and milking everything they can to make at least a penny, stagnating out of fear of taking risks and barely fixing the holes in the anticheat. Its genuinely painful to launch the game only to quit shortly afterward because of the broken matchmaking system and the endless cheaters.\n\nwe really hope that investors or the chinese will eventually remove YVES GUILLEMOT from leadership and restore the companys former [b]glory, innovation, fun and the vibrant games that gave us real memories[/b]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont do it to yourself.. Get a job and a family. This game has given me schizophrenia and i dont even know how thats humanly possible. I constantly hear prox alarms when i walk through a doorway. Save yourself, for your family and never play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes, Crashes, Crashes. Tried EVERYTHING including clean windows install, and upgrading to windows 11, still nothing fixes these nonstop crashes. Unplayable, as it crashes every game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ja fick dieses spiel oder so ubisoft fix your bitch ass game nichts diese skins patch notes \n\n\nPs merkel mach den preis von kebap auf 3 euro danke jungs \n\nnicht recommended oder so vertraut",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so you see it WAS good until i bought the elite edition and now have to open the game from the folder instead of just directly from steam because it said \"i dont own the product\" so i had to buy it again on ubisoft for $30 instead of steams $20 just to play ranked a game mode so pretty much spent $50 total for a game mode and cant get a refund but is a good game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you spawn, you die, you spawn again, you die. This game is just repetition of death with the occasional 'fun' moment",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game has been awful, i cannot even team kill during prep stage. fix your game ubisoft, i wish blackbeard had a bikini skin variant, that would be baller.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game was so good before siege x as someone with 800 hrs in total siege x has ruined the audio making it practically useless as of before it was a necessity to play safer and smarter now audio is completely absent which ruined this game as well as sbmm being atrocious. This game was amazing then they made a vital part of siege broken ruining the experience severely",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Might as well start selling cheats in the battle pass, games a landfill for fatherless kids.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good but ubisoft security is a joke. I have 2 step activated but still they allowed someone else to log in",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The memories i have on this game are found and priceless. I do not post this review as a someone who wants to see this game die, only to flourish, however like a neglected mold numerous underlying issues from optimization all the way to just packet and server stability has been fucking awful. Maybe things would  become better in the future but rn this game is ass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Learning curve of about 500+ hours to hit emerald by only playing ranked. Good luck soldier.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "300+ hours in Rocket League toxic people? Not too bad.\r\n\r\nFirst match on Siege? Genuinely horrific.\r\n\r\n\r\nCan be a fun game, just... toxic...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ranked 2.0 is so dogshit ur better off playing a comp gamemode on any other game, they need to bring back placements and make your displayed rank matters before this game goes anywhere back to its old peak",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game fucking sucks. I played it once and i can confidently say it is the worst game of all time and i will NEVER touch this game ever again in my life. This game was a waste of $20 of my hard earned money and playing it was equivalent to Chinese torture methods. There is NO anti-cheat with hackers in almost every game, ruining the experience for everyone. The skill-based matchmaking is quite frankly, atrocious as you will be a new player matched up against champs. Furthermore, the map's designs are inexcusably awful, most maps are hated by the entire player base and are HELL to play on. Under no circumstances, should you get this game. DO NOT BUY THIS GAME.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ive played 400 hours of agony on this game. my ranked teammates pose to be from a special learning facility. dont buy game unless you want to end up with depression. dont get to level 50",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "horrible game with 0 fun, if u want to be in hell on earth just play ranked and or casual.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "siege is the most try hard frustrating game ive ever played the past 6 months have made me realize that iq is iq is indeed just a number the teamates i get in ranked shock me utterly shock me in many ways mentally physically always a new experience never a smart moment in siege if there was a number below 0 some siege players would achieve it very quickly by the way even if you do -0 whatever is the furthest below that is the average ranked siege player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "used to be fun then the try hards joined now any match you play feels like writing your final words before hanging yourself its just depressing the state the game has come to loved it on ps4 played it after getting a pc and regret every second i spent playing it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck ass game whats the fucking point of the reconnect button if it never fucking works fix your fuckass game cunts",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is so ahh and also fun. Though, ahh part is the heavier part. After the last update there are countless bugs and glitches and cheaters which ruin your experience completely. Just got banned because my game crashed in the middle of a ranked game which we were winning 3-1, LOL. Stay away from this game which not only gets you addicted and also makes you a sociopath.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game time out my brother for *rage quitting* meanwhile his game crashed and the system counted the crash as a rage quit\r\nshitty system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please save yourself, went 11 n 4 in a game and it was game point (4-4). ts made me exit out forcely and made me update this fucking shitty ass game. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game made me throw my cats balls into a blender that was owned by my nans managers personal trainer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would rather get skull fucked by a big brolick black man then play this dogshit game again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I mean how far does the player count  have to drop before these developers care about what the community says. Time to replace this game with a small development studio. Bring back the little man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So many little kids shouting in your ear, it all starts with a friend saying \"Play this game called Seige\" you listen and as soon as you hit level 50 your life isnt the same. Ranked lobbies make me want to commit every single game. Dont recomend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have 1100 hours on pc and a total of 7 years played across accounts and this is still the best shitty game i ever played dont believe ubisoft they talk mad shit when they say they fix anything \"we are going for scripters\" i have seen more cheaters at the start of year 10 S4 than i have seen in all of siege combined like wtf i hope this game sinks just so they can do a better job when they realise the fucked up like \"Gamers dont play games anymore\" NO they do just not your AI garbage with the same slop storyline 40 times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game keeps crashing.... Please ubi fix your game i cant even go on practice tool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this game when it lunch as free game my account has lose and Ubisoft doesn't reply or take action  to me fuck this company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lost most of my well-earned achievements, and I can't even play the darn game cause the mouse curser won't go away!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have over 1000 hrs on this game, and over the years I have watched it slowly deteriorate. Im sad to see such a good game get utterly bent over by the devs. it has gotten worse over pretty much every update in the last few years. The nerve of the devs to add pay to win through the battlepass system is sad. this game deserves the slow paintful death it is receiving.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is genuinely horrible, Ubisoft puts on a front that they're going to fix the cheating but every single game is full of them, 0/10 worst community, worst developers, DO NOT PLAY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Latest update has completely bugged my launcher and now it doesn't show up or run on any of my displays no matter what",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of cheaters and now ruled by Chinese overlords. Pay to play and devs couldn't care less. Dropped a new gun on it's 10th anniversary and you must pay to use it. What a joke of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not only did I originally spend money for the game, making them switching from free to play so much worse, but they turned this game from gold to goop fast after they announced this game would continue for another 10 years.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is gut wrenching, I've actually never played a game more worse than this. Dare I say VALORANT is better than this fucking hell of a game. I'm going INSANE playing this fuckass I hear prox alarms in school and my eyes are pouring out blood. Thank you tom, you're the goat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Save Siege:\n1. Adding new weapons to the battle pass is terrible. Skins, operators (temporary) — fine, but weapons?\n2. New season and ten years of gameplay — very little content.\n3. Very strange balance change between operators (Kill Mute).\nUbisoft, you need to listen to the players and fix these problems!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In the season Operation Tenfold Pursuit, the update that brought most notably the rework to Thatcher's ability, also introduced a new DMR called the PMR90A2. In this update you cannot use the new gun for the first 30 days of it's release without paying for the premium battle pass. This has been done for new ops in the past but for it to be done with a new gun made available to several different operators is downright greedy and disgusting. The only reason I can even imagine they would do this is because they know people won't buy their battle pass for any other reason than to have access to the new gun because Ubisoft knows no one will buy the battle pass for it's low effort skins, so Ubisoft uses this paywall to get away with low effort trash as cosmetics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fucking greedy ass company, how am i getting 10 renown for losing a game, and 50 for winning a game, literally impossible to unlock operators.\r\nIt's like they do this so I have no other choice other than I gotta use my money to buy boosters and battle pass so I can finally get some decent renown gain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "full of cheaters, ubisoft i think its time to shut the servers off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a Ubi game. Shit game and no support to the players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chromosomes of teamates incapable of holding simple angles? tactical sim game nahh chromie central",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely the worst game i have ever played. if you reach above the rank of gold good luck getting a single legit game. this terrible creation of an fps shooter has the worst anti cheat ive ever seen in a video game not to mention for a game that has a 1 shot headshot mechanic the hit registration is AWFUL, so bad infact that because they cant fix the shit hit reg the just added a small noti at the bottom of your screen to tell you that your hit was rejected and didnt count instead of fixing it. I would only recommend buying this game for someone that you want to give crippling depression and su1c1dal thoughts to. DO NOT BUY THIS DOG SHIT!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is so much wrong with this game its baffling. Absolute communication police, having a 18+ rated game where you MURDER PEOPLE yet you cant swear? The rank system is terrible. Why is cross-play mandatory? The map picking system is worse than Overwatch2 somehow. Oh, and the skins are mostly trash. Classic Ubisoft (lack of) quality. \n\nTo fix the game:\n- Allow free speech, there is a mute function for a reason, allow the snowflakes to use it.\n- Let me pick what maps are with 30 minutes of my time, stop forcing me to play Labs or Club house.\n- Don't queue me based on hidden mmr in comp, ranks exist for a reason.\n- Hire a new arts director. \n- Don't queue controller with PC, at all preferably. But if people queue with each other even when they don't play on the same console, fine, but don't put me on those matched ffs.\n- The main menu is messy, clean it up. Seriously.\n- Fix the server connectivity. I mean how is that people (in the great 2025) get randomly disconnected with any local internet issues (spikes or outage etc)? No other game I own (other than For Honour which is a Ubisoft game...) will kick me for \"connectivity issues\". Get better\n\nNo one should be surprised when Ubisoft's value dipped below 1 billion, Jesus Christ.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft is dogshit but if you can get past that, the other people in the game will ruin your time. Maybe its just a skill issue for me or maybe its the low iq individuals I get paired with frequently. Game is making me suicida",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a good game owned by the wrong company. so many cheaters its honestly unplayable. 10 year old game and their anti cheat gets worse every year. i have 12,000 hours across all platforms and this is the worst siege has EVER been.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got banned for my game crashing. Ubisoft is awful.\n\nGame is fun enough with friends, but if you're looking at reviews to decide whether or not to start this? Especially alone? Just don't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IF you like being absolutely bummed by a multiple shield units or b sweaty people who play the game for 17 hours a day this would be the game for you it also gave my nan the ability to shaiko peak my nan",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bilgisayardan çok anlamam konsol oyuncusuyum  oyunla ilgili birçok sorun yaşadım tam ekran yapamama oyun çökmesi bug vs sistemimde sorun yok ama ona rağmen sorunlar bitmiyor.Ayrıca bazen sıkıyorum ama gitmiyor internetle mi alaklı bilmiyorum ama saçmalıyo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+best tactical shooter because you can destroy most of the walls, there is Ray trace sound and a lot of abilities of operators\n-Most greedy company so the game has all membership, battle pass, special paid currency and gambling (Pack's) but I must say you can get every operator for free but it will take you time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy terrible game battle eye has to be the worst anti cheat ever created",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so butt everytime i launch it i have to relogin and the social menu doesnt even work. Every player has 0iq i swear. Dont play ts ima go play it now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UBSOFT IS TRASH AND HAS BACK LOGS WITH EMAILS THAT Are no longer link to the acc. so it bricked the game will never launch without access to an old deleted email.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst f**** game ever, so dumb, id rather play Fortnite while getting lobotomized with an ice pick without anesthesia. I got it for free and still felt scammed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game, but it is very skill heavy. If you do not learn fast I do not recommend this game. If you have bad reaction time, I do not recommend this game, If you have bad ears or things like that, I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game; can't find any good reason to play it.  Don't spend your money on it, it's worth more being spent on like robux or some shit like that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game gives you the most understandable brain deformation available and its like a fishing line ready to snap somehow it handles on and brings your back. Great game would recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is just not for me. Never was a big fan of abilities in a shooter. Also i think they are focusing to much on paid content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game but the fact it doesn't work on Steam Deck / Linux in general SUCKS.\nI'm not buying this game on console with online for a one week long itch to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ranked matchmaking sucks, not fun getting stuck at a rank because there are constant smurf accounts... Do better with vetting your players in Ranked, it cant me that hard to figure out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is just straight up dog crap this game use to be good but now this game is just garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please fix matchmaking,\r\n\r\nMe playing versus 2 higher ranks than me and having in my team literally with cousins born from relationships inside family. I am not that good, but to equalise matchmake me with good players, not birdbrain (TikTok and Skidibi toilet enjoyers) players.\r\n50 +  50 = 100. Not 50 - 50 = 100 (The person with enough brain will understand it). I hope so.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nAt least I learned Quick match can be ranked too (Navy Seal).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shits ass game. fell off. friends made me play. NOT beginner friendly. NOT fun friendly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks so bad but because there is no other game like it i can't stop playing it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every time you open this game, you have to undergo the absolute displeasure of viewing the ubisoft logo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so bad, you wont have fun when you play, I get 2 hour bans all the time for abandons that I didn't even choose to leave the game is just not good, do not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant even enter my game it keep going from start to stop and from stop to start im realy mad cus it a fun came",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable as solo queue. either u get matched up against cheaters, or players 10x ur rank because the game is dead and MM is trying to fill lobbies and mix all the ranks which only benefits the higher ranks and kids with skidmarks because they havent left their room in 20 days",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}