{
  "positive": [
    {
      "review": "CAMPAIGN REVIEW\nLoved the new elements added to this one and the voice acting is top notch! \nIf you care for the campaign/story, it's pretty good with plenty of new mechanisms.\n\nI am not touching multiplayer with a 10foot pole",
      "voted_up": true,
      "votes_helpful": 60
    },
    {
      "review": "Call of Duty campaigns are my guilty pleasure I always enjoy playing through them at least once. Modern Warfare 2 is no different. It’s not amazing, but it never drags, has top notch production quality, and serves as a great introduction to the game’s weapons before jumping into multiplayer.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "I see why so many people have poor reviews of this game. The game is far too big. 220 GB for a single game is really insane af. but I really enjoyed this game, in contrast to others. To be clear, this is based on the fact that I primarily play the campaign.  I've played the oldest title of Call of Duty before, but this one is the best game I've ever played. If you like multiplayer, it might not be for you.  When it's on sale and you have at least eight hours to download it, I'd strongly suggest it if you prefer the plot and characters than multiplayer.",
      "voted_up": true,
      "votes_helpful": 42
    },
    {
      "review": "Cool game, graphics are nice.  Campaign isnt too bad, co-op is pretty fun.  Multiplayer is pretty bad with cheaters and glitchers but if you can look past this you might enjoy it.  DMZ mode a really nice extraction shooter but its sadly infested with cheaters due to the free aspect of the game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Last good COD, Warzone 2 was an absolute gem. I'd still play it today, such a shame they decided to make warzone fortnite skins and console kids with borderline aim hacks and 80 round SMG meta guns.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "DMZ is one of the best game modes in Modern Warfare 2. It’s fun, intense, and always different. You can play however you want sneak around, loot stuff, fight other teams, or just try to make it out alive.\r\n\r\nThe maps look great, the missions keep you busy, and the whole risk and reward thing makes it super exciting. It’s the kind of mode that keeps you saying “one more round.”\r\n\r\nIf you haven’t tried DMZ yet, you’re missing out.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I was eager to play this back when it was first released because I loved the original MW2 but this one was lackluster of a sequel. Here's my experience with this game so far, I've been playing it from release when it was on the god-awful CoD HQ thing.\n\nFirst, the campaign was good but didn't live up to the hype. Still not a bad campaign at all and introduced new characters, new elements, new mechanics, but Infinity Ward's choices regarding certain character development aspects were not the most ideal.\n\nMultiplayer was fun & hard to master. Which to me was great considering that I hate Treyarch's omni-movement thing that made everyone running around, jumping and sliding with almost 100% aiming accuracy which is fucking insane.\n\nThis game also came with a co-op mode divided to co-op missions or (special ops) and Raids. The co-op missions were like normal MW co-op we've seen before, they were basically multiple missions that continue on the story and can be played with your buddies. Raids however, were something different and I personally like it so much. The Raids were spread across 4 episodes, each episode can be played on normal difficulty or veteran difficulty with each one granting different rewards that can be used in-game. The gameplay was tactical and requires syncing with your squad mates to solve puzzles and coordinate objectives. And each episode bridges the story gab between MW 1 (2019) and this one (MW 2 2022). The only obstacle I had is that it must be played with two other players, you can't just solo it by yourself. 3 players go in with each one choosing a class between 3 classes.\n\nAnd my personal favorite was the DMZ mode. This one remained in beta for the entirety of the game, still to this day in beta even. It was basically a PvPvE extraction shooter with a CoD flavor. It still get recycled to this day with the MWZ mode in MW3 and End Game mode in Avalon for Black Ops 7 currently. This mode would've been a killer mode if Activision gave it a bit more caring and more attention but I guess they were just experimenting stuff.\n\nOverall, the game is good. Don't expect too much from it if you come from the OG CoD era, you'll be disappointed. Currently, the game looks dead, multiplayer doesn't have much players except for the Shipment playlist and couple other modes. DMZ still have some popularity and co-op/raid modes are basically unplayable if you don't have friends to play with.\n\nPersonally, I would give this one a 7.5/10 even though I liked it overall. But it could've been way more enjoyable.\n\nI wanted to lay out all the specifics of the game here for anyone thinking to get this game on sale (definitely don't get it for full price) hope this helps. :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not sure why all the later Call of Duty games are getting bad reviews but it pretty much set the standard in the action FPS genre. Like the game that came before it, Modern Warfare 2 has awesome graphics, great story, and tight controls. The multiplayer is bar none when it comes FPS style video games. For the PC version, you definitely need a rig with solid gaming specs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After the tragedy that was BO6, I bet we can all lower our standards a bit and appreciate this game for what it is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic Campaing as good if not better as MW2019 plus a lot more varied. Typical OK multiplayer with a bit more interesting way to upgrade your weapons . Some technical  issues with the shaders not loading fast enough or correctly some times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is rated as it is only because of cheaters in Multiplayer... The game as Single player Campaign mode is Overwhelmingly good... When it comes to realistic tactics and movement and all the other aspects of realism, this game is not just a game... 10/10 GOOD JOB!!! I am rating it as a armed force unit...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played only campaign, it is good, although it has glitches here and there (unfixed glaring in \"Ghosts\" mission).\r\n\r\nCampaign time is around 9 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gunfight. i just love gunfight. please someone make a gunfight competitor and i'll buy it day one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the way how they implemented new ways of shooting. Great story. Some lighting source came through the walls and other objects, it was annoying. But otherwise it is a great FPS game with epic moments",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tbh i hated in this game a bit too much but if we take out multiplayer (not dmz not co-op JUST mp) the game is actually a solid 7 although i wish movement from the beta was still around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only DMZ. good game, but sadly full of cheaters and bugs etc. still worth it tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the campaign and overall shooting experience was quite amusing. but alas, won't be touching multiplayer because of many infamous reasons...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fine. I genuinely don't know why it's got such negative reviews. Everyone thus far who I've seen complain of the so-called \"hackers\"... are just ppl who are bad at the game an are sore losers who have no life outside of COD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most enjoyable CoD games (but not as good s Ghosts, IMO). Can barely get away with a lot of the other CoD games, but this really hits the spot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like multiplayer, fun modes and good guns",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked the campaign very much. The campaign was the main reason i bought this game and tbh i really liked it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely do not understand the hate for this game. Is it as good as MW 2019? No, definitely not. Is it still a solid COD title? Yes. Are the cosmetics stupid? Yes they are.\n\nI think the hate comes from the slow pace of the game, but even then I'm confused as I know a lot of people who prefer the slower-pace of this game over Black Ops 6 or MWIII.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Impossibile to play 7/7 matches all killed by cheaters,so why do we buy this game ? i mean u ask for money for what reason exactly? i paid the dmz 70 usd for playing fairly,in al mazrah every point u are from the begging of the match it doesnt take more than 5 moinutes and cheaters they find u imidiatly i got headshot from 700 m away with pistol,from a aimbot hacker.i udnerstand that they are soem really good players arround but this is shit game from 7/7 matches no exctraction no playing more than 5 10 min.even if u hide somewhere els they find u ! i  DONT RECOMAND !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not as ambitious as 2019 modern warfare campaign, and realism mode is hard locked until finishing it on any difficulty whereas 2019 MW the option was already open however I want to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best COD game ever, played the campaign more than 5 times in different difficulties. Done all challenges for campaign mode and still trying the co-op challenges...It is hard to do it with strangers without mics, but will still try so. Wanna play MW3 also but i dont want to see Soap die so imma just stick to mw2,,,,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Activision made money for developing Black Ops 7 by selling cheats to children under 10 in Modern Warfare 2.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My first cod in 2022 after nearly 10 years away, they came back to steam and it was awesome times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Call of Duty of all times\nAnimations are so realistic and smooth\nGraphics and visuals are the best, especially I like cloudy Vondel, just peak 🙌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game, it definitely had its bugs but overall amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It grows on you, except for the security camera missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fabulous campaign and great multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Call of Duty: Modern Warfare II – Tactical, Cinematic, and Incredibly Addictive[/b]\n\n[i]Modern Warfare II[/i] delivers one of the most polished and refined shooter experiences in the franchise’s history. From the moment the campaign begins, the game showcases its mastery of tension, weight, and immersive action. Each mission feels handcrafted, cinematic, and grounded, blending stealth, urban warfare, and high-stakes global operations with seamless pacing and emotional impact.\n\nTask Force 141 returns better than ever. Ghost, Soap, Price, Gaz — every character has purpose, chemistry, and memorable dialogue that builds on the legacy of Modern Warfare while paving new ground. The writing keeps the story sharp and unpredictable, and the character interactions feel natural rather than forced. This is a campaign driven not just by explosions, but by personalities, loyalty, and strategy.\n\nGameplay is fast, fluid, and incredibly satisfying. Gunplay has weight and precision — every trigger pull and reload animation feels meticulous. Whether you’re breaching buildings, clearing oil tankers, sniping from extreme distances, or navigating stealth-focused operations, the game constantly shifts tone and playstyle without ever losing intensity. Enemy AI is aggressive and tactical, forcing you to adapt and think rather than simply run forward.\n\nVisually, the game is stunning. Lighting, weapon detail, character models, night vision, and weather effects push immersion to another level. Combined with the outstanding sound design — punchy gunfire, echoing footsteps, and powerful explosions — the campaign feels cinematic from start to finish.\n\nMultiplayer and co-op modes reinforce the experience with deep progression, smooth movement, and some of the most polished maps in recent COD history. Weapon customization through the Gunsmith system is addictive and promotes experimentation without overwhelming complexity.\n\n[i]Call of Duty: Modern Warfare II[/i] succeeds because it respects both intensity and realism. It’s not afraid to slow down for stealth, speed up for chaos, or hit hard emotionally when it counts.\n\nThis is COD at its sharpest — cinematic, tactical, and endlessly replayable.\nA must-play for campaign lovers and competitive shooter fans alike.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsDPUk6t7j7ZUh8KNbHaumOB]here[/url][/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Respectable in the Call of Duty Franchise. Everything plays great on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the new tactics. the new interface not so much at beginning but its kind of growing on you with time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just kicked me out but good game campaign is really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but players are allergic to moving",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best cod in recent years, don't listen to TrashArch fanboys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A polished and action-packed campaign that continues the reboot’s strong storytelling. The missions are varied and creative, with some real standout moments. The characters are great, and the production quality is off the charts. A very enjoyable single-player ride from beginning to end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "campaign is good and dmz used to be really fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its atleast better then whatever the fuck black ops 7 is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with still lots of players, especially for those on older systems.  Great multiplayer live action.  Shipment, WAR, etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My review will only touch on the Campaign portion of the game. \n\nCall of Duty: Modern Warfare II (2022) is a solid sequel that offers another rich, action packed gameplay experience. The story differs in setting from the first game, offering a chance to experience new locations that the franchise hasn't really explored before. While the majority of the characters from the first game return, a handful of new ones are also introduced (both allies and enemies). The cut-scenes and voice acting are once again top notch. The game isn't very long, it hits that 8 to 10 hour COD campaign sweetspot. While COD campaigns can be hit or miss, this one is of high quality and is executed well. It'll keep you engaged the entire time, and doesn't lull or slowdown. It does what you have come to expect of a good Call of Duty campaign mode. \n\nWhile I do recommend this game for the campaign alone (and the co-op experience, if you can find a lobby or friends to play with), I find it hard to recommend at the current sale price of $35.99 CAD (~$27.99 USD). It would seem that the days of Activision discounting Call of Duty games to under $20, is gone. My opinion is that $20 is what it's worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "graphic : 9/10\r\ngame play & game physics : 9/10\r\ngame support for handle players reports in game ( cheats & glitch) : 1/10\r\npsychological & social security in DMZ maps between players : 5/10\r\n(not suitable for kids under 17) other wise u get aggressive & psychotic behaviors from your young man.\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\n\r\nthe percentage of people getting addicted to this game is high despite the existence of cheaters \r\nmost of the players die by cheaters in this game so rage is ultra high among us . if u hate your self welcome to DMZ ....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ahh these funny men and their nifty knife skills\r\n\r\n(i only play campaign)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is such a good game\r\none of the best call of duty games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like this game, people dont use their brains and then get mad they died",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "That is one of the best cods I have ever played!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is great to warm up before playing bo6 or 7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i] \"Simon...\" [/i]\r\n[i] \"MMHM! That's right John. We've gone dark. Welcum to Guerilla warfare...\" [/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is by far the best story games that I have played. It almost feels like a movie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like playing this game it's really fun for my first time play COD game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dmz is fun but a lot of cheaters",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DMZ is the best .... love it !  we need it in warzone !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last great COD before its downfall",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "DMZ is the best game mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cinematic game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, love killing families of 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one mode makes this game ...DMZ",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the best game eve dmz",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is the best game! it is free to!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was kinda good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the most goat game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just the camping",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GOONIES NEVER SAY DIE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "powerfull but we need more maps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very good FPS game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very niceeee love it too much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "noice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DMZ is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amezing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good campain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good qual",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i need servers or teams to play more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great gme",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wwoooooooooooowwwwwwwwww game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great way to waste my life away!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love COD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MÜK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "balewr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dmz da besttttt",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "No updates, constantly crashing, taking up over 100GB on my drive, and consistent bugs since day 1. I spent $120 on this game, and I'm never doing it again. Activision and all of their associated titles are never getting another cent from me or anyone I can convince otherwise. \n\nI've racked up hundreds of hours in this game. So please listen devs, management, and prospective customers when I say this:\n1. The menus seem to get more complicated every 6 months for no apparent reason, with the actual game modes getting more obfuscated and harder to find. Imagine the Hulu UI, but worse.\n2. The \"permanently online\" thing is a terrible idea that constantly drops me from games, and I'm starting to think its the game servers more than my internet connection. Even in \"safe mode\" the game will still crash, and not show any sort of error report.\n3. When I bought the game (for an obscene price), it would regularly tell me that I needed to \"purchase a pass\" to access the thing I'd bought. Sometimes it would let me in, sometimes it would boot me and crash my game. I don't believe this is a me issue. \n4. Your cheater/issue submission system is a joke and goes nowhere, with people still consistently cheating and getting away with it. If you do submit an issue/bug, you don't get any form of correspondence to say so, which makes me think it all gets sent immediately to the recycle bin.\n5. Your inability to have any of your products work with 2 monitors is bewildering. Every, and I mean EVERY other game I own can easily Alt+Tab into another window to say change music, or an episode, or do something without causing everything to go black and run the risk of a game crash (or a system crash, which I've had a few times, and I'm confident my system is stable so it's likely the shitty product)\n6. This new direction with AI generated art? What's going on with that? Nobody wants overpriced AI generated garbage from a company owned by a major asshole\n7. The install size. Please. Why does it need to be so big. Please for the love of all in this world stop blowing up the file sizes. It increases system storage needs, system load in operation, and most people can't even render it properly. Why?\n\nAs far as I can tell, all of your products are developed in the least efficient way imaginable, and it causes deep issues in the final product that greatly impacts the users overall.\n\nNever buying a game from this company again and I hope this review has helped you to come to the same conclusion. Eat shit Activision.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Who the fuck decided that it is okay to kick me out of the campaign if the server decides to sign me out of my profile?",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Game uncontroled full of cheats and glichers",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "whoever the fuck got this game for free, dont get hyped for it, dont bother downloading to \"play the campaign only\", all you get access to is the dmz shit. no campaign, no nothing else unless you purchase the full game.\r\n\r\nfuck you activision, fuck you to anyone who decided this is a good marketing strategy. wish you all kinds of miseries in life and when you need money the most you have none.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is my 2nd time writing this review, the first time was when the game was new before it turned into the COD HQ. Now it is a separate listing again. For context, this review was written in June 2023, the part where it says :3 years ago\" (from June 2023, not November 2022, still applies) Is now 5 years ago... I'm getting old. It also comes with a new Achievement listing, and if you played the game when it was in the COD HQ, your achievements that you unlocked on the HQ will re-unlock here when you launch it, atleast it did for me anyways. Unfortunately though, the MW2 2022 achievements in the COD HQ achievement list are now unobtainable. Also worth mentioning that I played this game when it was on the HQ and I primarily played on the PS5 version, so I have a lot more playtime. I had to launch this relisted version to rewrite my review.\n\nIn case if anyone is confused, this is the 2022 MW2, not the 2009 MW2 or its 2020 Campaign remaster (the remaster isn't on Steam). If you are looking for a great game, the 2009 game is the game for you.\n\nOld review from 2023:\n\nCampaign, Multiplayer, Special Ops, Warzone 2.0 & the other game modes all either suck or are mediocre at best. On PC, people have been banned for no reason, or for using software that makes the LED's on their fans and RAM work. We have also been lied to by Activision numerous times, such as this being the last COD game until 2024. Only good thing about MW2 2022 is that it's better than COD Vanguard. I'm essentially doing the same exact things I did 3 years ago in Modern Warfare 2019, except this time there is no pandemic to give me loads of time to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Loaded with cheaters. i've seen 4 cheaters on 1 team before.. people who've i've seen cheat before several times; Grouping up together on 1 team to ruin the whole game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is just my opinion about the campaign mode, it feels like just a tutorial for the multiplayer/online one, the og Modern Warfare still much much better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah nice game nice story, a lot of bugs tho... like having to either restart your game or the checkpoint any many more like going to a place where the game shows u to go and then you get a mission fail since you left the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the amount of cheating in dmz is so ridiculous and the fact activision or whoever won't do one thing about it just speaks to what they feel about us. Since the cheaters buy skins I guess that's the companies only desire. Warzone plays like ass so i'm not switching to it. But by God lets protect the lgbtq community and not say bad words. get mental help",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its in my library but everything is locked behind 70$ except dmz because apparently i dont actually own this game so waiting 2 hours for it to download unable to play even the campaign",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashing and random disconnects are way to frequent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ruined by cheaters using hacks and exploiting glitches in game. RIP DMZ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DMZ has too many cheats/Hacks/Glitches players are using to get the advantage over other players. Skills are irrelevant. I'm starting to question if I'm buying DMZ 2026.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah this game and franchise fucking suck balls and ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not even Worth it just straight campers and people who sit in corners using Shotguns all day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The budget for this game must have gone to graphics only, because this is literally one of the worst games I've ever played. The campaign's plot is incoherent and runs pretty much entirely on bad cliches and worse level design. I would literally have paid money to NOT have played this campaign, and actually just walked off sometimes to grab a drink while my character respawned and died repeatedly. There were multiple bugs that routinely prevented progression, and even attempts to skip cutscenes and get the garbage over with faster didnt always work. I hope whoever they hired to write this, whoever designed the levels, and whoever approved them all find fulfilling careers in anything OTHER than the video game industry. Buy literally anything else unless all you care about is the multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+Decent gunplay and weapon animation\n\n-Poor, unstable performance, often crashes\n-Extremely long shaders pre-loading time\n-Lack of content\n-Insane weapon progression system\n-Ridiculous Co-op mission designs\n-Poor map designs\n-Cheaters all around in multiplayer\n\nA good looking, but actually crap game made by trash company Activision.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes constantly, its like they are making it worse on purposed.  when its not crashing all you see are cheaters. Support is none existent. don't waste your time and money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "***DON'T BUY THIS GAME*** ***BROKEN CAMPAIGN***\n\nIf you buy these games for the campaign, there is a game-breaking lighting glitch that makes the shadows pixelated. This doesn't sound like a huge deal, but if you look up images you will see just how awful it is. In some sections of the game you can just ignore it, even though it is quite jarring and takes you out of it, but in other sections it makes the game downright unplayable. The shadowy pixels are so big and awful that you can't tell what is an enemy and what is \"dark\". \n\nI couldn't recommend a game that has been broken for so long since release, 3 or so years now, and really seems to have no plans for a fix. It seems like the developers and publishers are happy pushing out garbage as long as you buy it. With this long of the campaign being broken, I can't imagine it'll ever be fixed. \n\nI wouldn't buy this game if it were free. I recommend to avoid this game at all costs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is THE BEST CALL OF DUTY TO EVER EXIST... but my negative review goes beyond that.\r\n\r\nin 2022-2023 the game was incredible, good missions, good achievements, good community and the pvp engagements were tactical/meaningful\r\n\r\n2024 support for DMZ ended and the game started gettingpretty average when people found the use of 1shot shotties\r\n\r\n2025 the game is filled with people with zero sense of personal pride, everyone just wants to get the cheapest kills by any means nescessary. These same people also have no sense of time, they will kill 1 person and sit on the dead body for over 20 minutes because they are simply not confident in their personal ability to have another fight and win.\r\n\r\nBesides the community being made up of 90% brain dead people, it is riddled with cheaters, dupers, glitchers, teamers and toxic groups.\r\n\r\nEven if you are good at the game, you will instantly get called a cheater and you will get reported then temporarily banned, whilst the real cheater run around free with no consequences.\r\n\r\nDo yourself a favour, don't pick up this game in 2025 or after. It's better for your mental health",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aim assist and whatever aim-assist cheats have ruined this game.  You can often find people just sprinting around with a sniper rifle or shotgun care free, just racking up kills.  It's not fun. Part of the fun is lining up shots and getting better angles on other players.  That's just gone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game isn't so bad, but the anti-cheat is terrible. I was playing with my friend in DMZ when some random guy started no-clipping under the map, and he killed us when we couldn't do anything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is shit. Full of Cheaters. Anti-cheat software doesnt work. reporting or blocking does nothing. avoid. its crap now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "at first i have been enjoying this game alot back when it first came out: but ever since they made DMZ free and a standalone game. it has been infested with cheaters left right and centre. i have played on all maps. doing contract and every time no matter what map or time. i always die by a cheater. i have reported them but Activision is doing NOTHING about this problem ATALL. i DO NOT RECOMMEND THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed playing this even with cheaters then I played Arc Raiders and then I said, lets play CoD today and in the 1st game, a cheater in the enemy team. Uninstall. This game is not cheap and this is what I get, it sux. \nWell, back to Arc Raiders.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scammed played for less than 2 hours not refunding because it counts as dlc didnt know that thanks activision",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cheaters are in each match. Guys, if you can not maintain your game, save yourself from such a shame, delete it from steam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many blatant hackers and the DEVs do not care it never gets any better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage with vermin idiots cheating and trying to trash talk all day, also explicit suggestive content and the allowance of children to play in such an environment is criminal. Enjoy a paedophilic child grooming organisation that boasts nothing but a press of a button and a mentality of retarded children screaming at a padded cell.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A bit dead, unforturnate that invasion and ground war don't work anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ill never forget the devs. - kept bots on max difficulty and taking a three week vacation through christmas after breaking the dmz. \ni hope the final fantasy sequal goyslop stops soon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "misiunile sunt grele. Camping e o dezamagire totala scor 2/5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign plays like Dragons Lair with guns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paid full price to play solo and download 96 GB of disappointment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game doesn't even work, just crashes. thank hell I got this game for free..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The campaign is A-M-A-Z-I-N-G!\n\nThe rest is pure rubbish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great campaign but too much cheaters/hackers in multiplayer, feels like devs dont even want to do something about it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I purchased it and had to refund it. I have a system which is 9800X 3d and 4070 TI super and had nothing but audio issues. I Couldnt even get past the start of the game without having  Terrible lag in CAMPAIGN. Not playable at all ( I had the worst experience from Acitivision resolving this and were no help at all ) 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DEAD game, no matches.Because you had to combine no recoil degenerates aimbot(controller players) with k&m.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game Crashes every after few minutes in campaign mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game crash in single",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid, ugly operators",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggiest AAA Game Ever Played",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even free game is better then this CRAP!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constantly crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you will find more cheats in DMZ than you can find on tinder",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game not lunching",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash ahh game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash keeps crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was the last COD i'll ever buy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cheater everywhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is chopped full of hacker and shit if you have atleast 6 or more dollars in the bank jsut purchase engineowning and your then gonna have fun so yea thank me later",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "F this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "am yordamı oyun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Utter rubbish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "multiple bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is bugged to hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I won't buy another COD after this. It is clear they do not care about cheating, exploits, or quality of life for their players. It is all about micro-transactions and streamer support. I have been put under review 10+ times now. Each time I get a week or more where I can not play the game. Never banned. I do not cheat. I get killed by a cheater nearly every night and they do not get banned. I see the same names all the time. I am a above average player and the lack of support is sad. I have become really disappointed in the COD franchise. I have bought ever COD over the past 20 years or so. Not again. This game has turned into a wasteland.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Garbage game ruined by the fact that you can just spam report someone to get them banned. If someone doesn't like you or you kill someone, they will just spam report you until you're banned for 2 weeks.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "\"Purchase Modern Warfare 2 to access this content.\"\nThis is a shameful beggers decoy by activision to make you think you are getting COD MW2 for free but inside everything is locked behind the full price of the game, this is just a waste of time time and data, Steam and I both lost 50GB+ of our bandwidth, I also lost 50GB+ SSD read and write health, also wasted time and electricity waiting for this shameless prank by activision to finish downloading,\nThis is my feedback to Activision ( ︶︿︶)_╭∩╮",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "When DMZ first launched, it brought something truly fresh to the Call of Duty series a tactical extraction shooter built on Warzone’s foundation, combining open-world missions, PvE + PvP combat, and looting systems with immense potential. Unfortunately, over time that potential has been squandered due to severe negligence in player security, exploit control, and developer support.\n\n---\n\n1. Rampant Hacking and Lack of Effective Anti-Cheat\n\nDMZ has become overrun with cheaters, making legitimate play increasingly impossible. Despite the presence of the Ricochet anti-cheat system, it has proven largely ineffective:\n\nHackers routinely join multiple games without any bans, even when they are blatantly using aimbots, wallhacks, and ESP tools.\nWhen bans do occur, they are meaningless. Since the game is free to play, cheaters can simply create a new account and re-enter within minutes there is no deterrent or accountability.\nNo paywall = no consequence. Without even a minimal entry cost, bad actors can exploit the system endlessly, ruining match integrity for everyone else.\nPlayers have repeatedly reported these problems through official channels, yet there has been little to no visible improvement.\n\nThis creates a cycle where legitimate players are punished by an environment that rewards exploiters and discourages long-term investment in the game.\n\n---\n\n2. Glitches and Exploits Left Unaddressed\n\nIn addition to cheating, DMZ suffers from a staggering number of gameplay-breaking glitches that have persisted across multiple seasons:\n\nItem duplication exploits allow players to infinitely duplicate contraband weapons, killstreaks, and rare items.\nMission and extraction bugs frequently cause players to lose progression or crash mid-match.\nMap and terrain exploits enable unfair visibility or invulnerability advantages.\n\nThese issues are well-known within the community, and yet patches and developer updates rarely prioritize them. Players exploiting these bugs gain massive unfair advantages while honest players suffer repeated losses and frustration.\n\n---\n\n3. Lack of Developer Support and Communication\n\nThe silence from the developers has been perhaps the most damaging aspect of DMZ’s decline. Once promoted as an evolving, supported mode with regular updates and balancing, it now feels abandoned:\n\nThere are no consistent balance changes, bug fixes, or community updates.\nPlayer feedback regarding cheating and glitches has gone largely ignored.\nCommunity trust has eroded due to broken promises and minimal transparency about the mode’s future.\n\nIt’s disheartening to watch a game that once showed such promise fall into neglect simply because support and accountability disappeared.\n\n---\n\n4. Impact on Player Experience\n\nThe current state of DMZ is demoralizing for long-time fans. What was once a tense, strategic, and rewarding extraction experience has devolved into chaos and exploitation. Legitimate players now struggle to find fair matches or meaningful progression. Many have left the game entirely, turning to other titles with stronger anti-cheat systems and active developer engagement.\n\n---\n\n5. Suggestions for Improvement\n\nIf DMZ is ever to recover, the following changes are essential:\n\n1. Implement a paywall or access requirement even a small purchase barrier would significantly reduce the influx of new hacker accounts.\n2. Strengthen and actively monitor anti-cheat enforcement with real-time detection and permanent hardware bans.\n3. Prioritize exploit and duplication fixes with transparent patch notes and consistent maintenance.\n4. Re-establish developer communication with a dedicated DMZ team providing regular updates and community Q&As.\n\nWithout these steps, DMZ risks total collapse as its player base continues to erode.\n\n---\n\nConclusion\n\nCall of Duty: Modern Warfare II’s DMZ mode had the foundation to become one of the best extraction shooters in the market. Instead, it has been crippled by rampant cheating, unpatched exploits, and a lack of developer accountability.\n\nIt’s heartbreaking to watch something that once brought players together for strategic, adrenaline-filled sessions become unplayable due to neglect. With proper attention, DMZ could still be redeemed but until real action is taken, many loyal fans have no choice but to walk away.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "No updates, constantly crashing, taking up over 100GB on my drive, and consistent bugs since day 1. I spent $120 on this game, and I'm never doing it again. Activision and all of their associated titles are never getting another cent from me or anyone I can convince otherwise. \n\nI've racked up hundreds of hours in this game. So please listen devs, management, and prospective customers when I say this:\n1. The menus seem to get more complicated every 6 months for no apparent reason, with the actual game modes getting more obfuscated and harder to find. Imagine the Hulu UI, but worse.\n2. The \"permanently online\" thing is a terrible idea that constantly drops me from games, and I'm starting to think its the game servers more than my internet connection. Even in \"safe mode\" the game will still crash, and not show any sort of error report.\n3. When I bought the game (for an obscene price), it would regularly tell me that I needed to \"purchase a pass\" to access the thing I'd bought. Sometimes it would let me in, sometimes it would boot me and crash my game. I don't believe this is a me issue. \n4. Your cheater/issue submission system is a joke and goes nowhere, with people still consistently cheating and getting away with it. If you do submit an issue/bug, you don't get any form of correspondence to say so, which makes me think it all gets sent immediately to the recycle bin.\n5. Your inability to have any of your products work with 2 monitors is bewildering. Every, and I mean EVERY other game I own can easily Alt+Tab into another window to say change music, or an episode, or do something without causing everything to go black and run the risk of a game crash (or a system crash, which I've had a few times, and I'm confident my system is stable so it's likely the shitty product)\n6. This new direction with AI generated art? What's going on with that? Nobody wants overpriced AI generated garbage from a company owned by a major asshole\n7. The install size. Please. Why does it need to be so big. Please for the love of all in this world stop blowing up the file sizes. It increases system storage needs, system load in operation, and most people can't even render it properly. Why?\n\nAs far as I can tell, all of your products are developed in the least efficient way imaginable, and it causes deep issues in the final product that greatly impacts the users overall.\n\nNever buying a game from this company again and I hope this review has helped you to come to the same conclusion. Eat shit Activision.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Pros:\n-A dozen game modes that fit most playing styles (when they work)\n-Lots of weapons to choose from\n-Can choose to stay with a lobby of players you find (doesn't always work)\n-Activision FINALLY lets you just run only the game you want to play.. About time ya weird shmucks\n\nCons:\n-That CEO at the Coldplay concert would love this game.. It's a cheaters wet dream! They are EVERYWHERE and reporting does absolutely nothing.. I've reported at least 50 in the past weeks, and they still play all the time. Headshots across map, through walls, not even aiming down sights.. what a joke, and not a funny one either. \n-It got even WORSE. Lose frames constantly, graphics not loading even on \"extreme\", stuttering and lag with 25 ping. What an absolute mess..\n-With the MW3/BO cash grab coming out, the amount of cheaters has skyrocketed..it's insane how many there are now\n-Way too many attachments with minimal/useless/illogical effects on weapons\n-Glitchy to the point of unplayable at times\n-Can be laggy even with a good internet connection\n-No way to go offline so your activity is always shown\n-Cringe events, i.e. bunny heads, celeb skins, etc. makes it feel more like Fortnite than COD\n-gmod functions better than this game\n-I bought Battlefield because of how terrible this game is.. BF is no treat sometimes, but hey, at least it functions and runs better than this dog water dumpster fire\n\n-Update 25NOV2025 STILL the buggiest, cheater infested game I've ever played, absolute DOG WATER..  The amount of blatant cheaters is INSANE, they don't even hide it. If you haven't bought it yet, don't. Play a game from a company that actually cares about it's product and users.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "was excellent game 2y ago, now full of cheaters, cheater vs cheater",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Who the fuck decided that it is okay to kick me out of the campaign if the server decides to sign me out of my profile?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "There are some fun missions. But where I draw the line, there is a boss battle...in a cod game...jesus christ devs. This isn't dark souls where you need to learn the patterns, this is call of duty...or used to be, now it's just this shit show.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "This game is the new TF2 - Over 50% of the playerbase uses obvious aimbot and Activision won't do anything",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Bought on discount for the single-player campaign.  This game forces you to run a launcher to access it, which will be a lot, because it has more crashes than every freeway in India.  That launcher requires an internet connection to access it.  There's a game-breaking lighting bug that isn't a full-on showstopper only because of a workaround requiring repeated restart voodoo.  It randomly CTDs on deaths.\r\n\r\nGiven the age of the game, it's pretty shameful how bad this all is.  The impression I get is that the company is openly hostile to single play, so much so that I'm wondering if I would have had a better experience if the game was a cracked pirate version.\r\n\r\nShame, too.  The campaign itself is quite cinematic and entertaining, if only it wasn't being hamstrung at every step.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Campaign's graphical settings is butchered beyond belief. Do us all a favor and fix it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game uncontroled full of cheats and glichers",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Call of Duty: Modern Warfare 2 (2022) is a dependable sequel that delivers a solid campaign, enjoyable co-op content, and a polished multiplayer experience that runs smoothly. Infinity Ward clearly focused on refining what worked in Modern Warfare (2019), making small but effective tweaks. However, this cautious approach means the game feels familiar rather than groundbreaking, offering reliable entertainment without taking any bold creative risks.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This is my 2nd time writing this review, the first time was when the game was new before it turned into the COD HQ. Now it is a separate listing again. For context, this review was written in June 2023, the part where it says :3 years ago\" (from June 2023, not November 2022, still applies) Is now 5 years ago... I'm getting old. It also comes with a new Achievement listing, and if you played the game when it was in the COD HQ, your achievements that you unlocked on the HQ will re-unlock here when you launch it, atleast it did for me anyways. Unfortunately though, the MW2 2022 achievements in the COD HQ achievement list are now unobtainable. Also worth mentioning that I played this game when it was on the HQ and I primarily played on the PS5 version, so I have a lot more playtime. I had to launch this relisted version to rewrite my review.\n\nIn case if anyone is confused, this is the 2022 MW2, not the 2009 MW2 or its 2020 Campaign remaster (the remaster isn't on Steam). If you are looking for a great game, the 2009 game is the game for you.\n\nOld review from 2023:\n\nCampaign, Multiplayer, Special Ops, Warzone 2.0 & the other game modes all either suck or are mediocre at best. On PC, people have been banned for no reason, or for using software that makes the LED's on their fans and RAM work. We have also been lied to by Activision numerous times, such as this being the last COD game until 2024. Only good thing about MW2 2022 is that it's better than COD Vanguard. I'm essentially doing the same exact things I did 3 years ago in Modern Warfare 2019, except this time there is no pandemic to give me loads of time to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is just my opinion about the campaign mode, it feels like just a tutorial for the multiplayer/online one, the og Modern Warfare still much much better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "1. Now the game it self is pretty much a copy of the past titles.\n2. Activision has a kernel level client-side anticheat which is basically a spyware\n3. Activision bans normal hardware, virtualization and security tools, even when they are not running and they ban you if you try to play it on linux (I saw a few forum post about the linux ban)\n4. The community it self is shit with low moral standards\n5. Activion itself doesn't care about people how have problem or might need help.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "whoever the fuck got this game for free, dont get hyped for it, dont bother downloading to \"play the campaign only\", all you get access to is the dmz shit. no campaign, no nothing else unless you purchase the full game.\r\n\r\nfuck you activision, fuck you to anyone who decided this is a good marketing strategy. wish you all kinds of miseries in life and when you need money the most you have none.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "They absolutely had something incredibly special with DMZ, and they just decided to abandon it to invest in more slop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is very good but please dont support these breast milk stealing ai replacing scumbags we all agree we dont want ai slop in our games so just buy older cods nothing past bo 6",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am one of of the sickos that likes the campaign. Unfortunately this is a DO NOT BUY.\r\n\r\nWhile I do enjoy this game it is just not worth the price. If you can get it for more than 70% off then go for it, otherwise avoid.\r\n\r\nThe gameplay is great, the voice acting is great, the graphics are great. It's simply not stable! Even after all this time (2025 playtime for me) it crashes literally 3 times a night. They got my money so who cares if it is a huge time suck, right? And this is the campaign, not multiplayer. Just goes to show: they do not care, they want money.\r\n\r\nNot worth it unless you can get it for a significant discount. Do not pay 60-70 bucks for this. Get it for 15-20 bucks and maybe it is worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would give this Thumbs up, but it's really bad in terms of content. I really love the campaign, and honestly, if there's one good thing about the game is campaign. Spec ops is just alright but MP is where I have a massive issue. There's severe lack of content in the multiplayer. The maps suuuuuckkkk and there's so very little of them that it really makes it hard to play. Once you play couple of MP matches, you seen it all. That's the biggest issue that's dragging this game down IMO. There's no content, no maps. A good majority of maps that are in the game suck ass as well, in terms of layout and such. Even funnier how, already from a small map pool, some maps got removed due to copyright issues as well. It just get boring very fast playing mp due to it. I thought it's okay, they gonna add it post launch, I mean we do have 2 year cycle this time right.....RIGHT? \r\nWrong, new COD coming out 2023, and it's clearly obvious they decided to pull resources away from post launch of main game to push out another one in 2023. That's another big reason why I really dislike this game. I could probably excuse a bit lack of maps due to promised 2 year cycle, but they walked back on it and like mentioned before, clearly post launch support overall suffered due to it. We get 1-2 maps (so far, remakes of old maps only) per season and it's just not good enough. I really want to play more MP, i really do but it's hard to get into it when I know it's gonna be same bad boring maps over and over again. On top of that, ground war as well is awful compared to 2019 MW. The Ground war maps are horribly designed and boring as well. Verdansk was such a better map IMO (tbh, WZ2 main map also sucks due to this). But the way ground war maps have been adapted from WZ2 are just awful. Even worse, some normal MP maps are also small areas copy-pasted from WZ2 map as well. I really liked ground war in MW 2019, I absolutely hate one in MW 2022 just purely due to maps featured alone, those maps just do not work in ground war environment (and, from what I gathered, most people agree with me there).\r\nSpec ops raids are interesting idea, however, it's way too complicated. Rather than it being relatively straight forward, they decided to went sorta zombies easter egg steps route which just sucks if you do not have friends or group of people that you know to play it with. I hate how they approached that, since with normal spec ops maps, you can relatively easily do it with randoms, that is impossible with raids however, due to multiple complicated steps involved in completing it, it has high bar of entry when it comes to communication and teamwork, and even worse they have that stupid ticket system where if you fail, you lose your ticket and have to earn it back next day or something.\r\nAgain, the only good thing about this game is the campaign, but I regret purchasing this one. Again, I purchased it mostly due to promised 2 year support no cod during 2023. Tbh, it's activision and I should have known better, I will definitely not purchase another COD unless treyarch does something good amazing with zombies (like adding workshop support again or something)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Activision could not care any less about the people who play their games. the cheating is ridiculous and there is zero attempt to fix the problem. These games use to be great and something fun to look forward to. Now they're filled with people who enjoy ruining the game while Activision supports it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loaded with cheaters. i've seen 4 cheaters on 1 team before.. people who've i've seen cheat before several times; Grouping up together on 1 team to ruin the whole game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game costs a lot more money than it's worth. After years and years, the campaign mode only has graphical bugs that make the experience not only bad, but also impossible to play (I'm talking about the lights bug). It's not worth buying to play MP (old game) and it's not worth the bad experience in SP.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the most shit game ever.. full of cheaters , nobody does nothing about it !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I in fact know that I have way more than 0.7 hours in this game... so what in the actual F is going on here? I just played this about a week ago and all my stuff was still there... I am NOT buying this game again or ruining my SSD fluff installing it again just to watch people hip shoot me from across the map and through walls and shit.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah nice game nice story, a lot of bugs tho... like having to either restart your game or the checkpoint any many more like going to a place where the game shows u to go and then you get a mission fail since you left the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Still the same trash game design. Still putting players in matches already in progress. Still runs your Xp time while searching for a lobby. I got 1 full game with an hour of XP boost. All the other matches were in progress or almost over. I was not given a chance to utilize the xp boost. Trash, DO NOT SUPPORT THE COD FRANCHISE!!!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the amount of cheating in dmz is so ridiculous and the fact activision or whoever won't do one thing about it just speaks to what they feel about us. Since the cheaters buy skins I guess that's the companies only desire. Warzone plays like ass so i'm not switching to it. But by God lets protect the lgbtq community and not say bad words. get mental help",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its in my library but everything is locked behind 70$ except dmz because apparently i dont actually own this game so waiting 2 hours for it to download unable to play even the campaign",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why do i need wifi, why do i need wifi just to start the game. All cod games cant run without it even campaign. cant play on console from not having subscription. waste of money on dead company making the same game as an update every two years. Stop buying brand named junk from these guys.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Purchased the game but REFUSES to let me play it keeps telling me I need to REPAY for it! Anyone know how to resolve this problem?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashing and random disconnects are way to frequent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ruined by cheaters using hacks and exploiting glitches in game. RIP DMZ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DMZ has too many cheats/Hacks/Glitches players are using to get the advantage over other players. Skills are irrelevant. I'm starting to question if I'm buying DMZ 2026.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah this game and franchise fucking suck balls and ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not even Worth it just straight campers and people who sit in corners using Shotguns all day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The budget for this game must have gone to graphics only, because this is literally one of the worst games I've ever played. The campaign's plot is incoherent and runs pretty much entirely on bad cliches and worse level design. I would literally have paid money to NOT have played this campaign, and actually just walked off sometimes to grab a drink while my character respawned and died repeatedly. There were multiple bugs that routinely prevented progression, and even attempts to skip cutscenes and get the garbage over with faster didnt always work. I hope whoever they hired to write this, whoever designed the levels, and whoever approved them all find fulfilling careers in anything OTHER than the video game industry. Buy literally anything else unless all you care about is the multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+Decent gunplay and weapon animation\n\n-Poor, unstable performance, often crashes\n-Extremely long shaders pre-loading time\n-Lack of content\n-Insane weapon progression system\n-Ridiculous Co-op mission designs\n-Poor map designs\n-Cheaters all around in multiplayer\n\nA good looking, but actually crap game made by trash company Activision.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes constantly, its like they are making it worse on purposed.  when its not crashing all you see are cheaters. Support is none existent. don't waste your time and money",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}