{
  "positive": [
    {
      "review": "Didn't play this game when I was younger so I played this with zero nostalgia and I have to say I was surprised by how good it was. The amount of leveling up you do with the spheres too is just insane, I would never of thought a game this old would be that good. It's another game that I would happily play again.\r\nI'll make note that all my hours are in X and I have 0 hours in X-2, so I am basing this review on one out of the two games only.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "People die, and Yuna dances. When will she stop dancing? When will it stop? Yuna won't stop dancing—not until Sin is gone.\r\n(\"real emotion\" starts blasting from the background)",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I almost stopped my Final Fantasy-playthrough at IX, but people convinced me to play X.\n\nAnd thank god I did. FF-X is a great game with a great story and nice sidequests. Near the end is because slightly less interestjng, but the finale is good.\n\nThe sphere grid is complicated if you think to much about is, but perfection is not needed at all for a casual first playthrough.\n\nFF-X2 however... I like the concept and the more comical presentation. But it is not my cup of tea. Somehow it feels like a spin-off and more of the same Also the slow battlescreen (the one at the end of battle) didn't help. Not recommended for now.\n\nHow would I rank all 11 games so far?\n9, 6, 10-1, 4, 8, 7, 3, 5, 10-2, 1, 2",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The best Final Fantasy game I have ever played, yet it's not my favorite. This is one of the games that made me and easily one of my favorite games ever [/i]even though it is not my favorite Final Fantasy game. The thing I love the most about this game is the endgame. Capturing monsters, fighting superbosses, obtaining celestial weapons (even though some of them are a right pain), maxxing out the sphere grid, the works. It is one of the only times I didn't mind grinding my butt off to be super powerful. But whether or not you go that far with the game, the story is utterly remarkable and a true gem of its time. The characters are all memorable and the villains are all superb! The traditional turn based combat is awesome and I never get bored of hearing that iconic battle theme! There are so many twists and turns throughout the story that you never know how it's gonna end until you get there. It constantly keeps you on the edge of your seat! All of this and more, Final Fantasy X is the last Final Fantasy I ever had tons of fun with with and I can only hope and pray one day we'll get a remake of this beautiful piece of art like Final Fantasy VII did!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game, x and x-2, one of my favorites Final Fantasy, finish like 5 times and now 1 with full achivments, very good",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[b]Only about [i]Final Fantasy X[/i]:[/b]\n\nThis is going to be a [i]pretty lukewarm[/i] recommendation.\n\nEven though the game has aged better than most of its competitors and still manages to offer, to some degree, a captivating and inspiring experience—enough for me to recommend it to young genre enthusiasts trying to get familiar with the classics—I also think that, for the majority of players, nostalgic veterans included, it simply doesn’t have [i]much[/i] to offer nowadays.\n\nWhether in spectacle, narrative, or gameplay, time moved on, and what was once one of the most impressive productions of its era now has [i]nothing[/i] that hasn’t been surpassed by later titles, especially when we look at other genres.\n\nThe magic of [i]Final Fantasy[/i] hasn’t been exclusive or novel for at least two decades. Pretending that this is still something [i]indispensable[/i] for JRPG fans would be disingenuous.\n\nIt once was—back when the game alone could justify buying a PS2. It isn’t anymore. [i]Simple as that.[/i]\n\nStill, in one way or another, the magic is there. \n\nIt’s still very easy to be transported into its world when the introduction combines a exciting visually well-crafted universe with memorable melodies pushed right to the forefront. It’s [i]pure poetry.[/i]\n\nThis sense of aesthetics remains one of the franchise’s most defining traits—an irresistible invitation to a universe overflowing with charm and unforgettable moments. \n\n[i]Final Fantasy[/i] never failed to pull you into the adventure.\n\nBeing such an ambitious production for its time means that even a modest remaster like this still offers a competent presentation. Despite stiff animations, kinda expressionless faces, and awkward scenes typical of games this old, the world overflows with detail everywhere you go: NPC outfits, stylized character models that aged surprisingly well, memorable environments, striking monster designs, and the prerendered indoor dioramas that lend every location a convincing atmosphere. \n\nIt’s a rich and vibrant universe that once showcased enviable technical mastery.\n\nAnd the FMVs are still excellent!\n\nIf there’s something I’ve noticed about the franchise over the years, it’s that they never let common sense or practicality get in the way of something [i]cool[/i]. Maybe that’s why visually the games always look so unique, regardless of how incoherent what you’re seeing might be.\n\nCombat animations and effects are a highlight. They have clarity, impact, and that gratifying snappiness that sells the spectacle without wasting your time with scenes you’ll watch [i]thousands[/i] of times.\n\nOverall, the game has a sense of a cinematic language that, while not extraordinary by today’s standards, was one more step among many the franchise had already taken toward making the player feel like they were watching a [i]playable movie.[/i]\n\nThe pacing is excellent, respecting moments of calm while keeping the story moving forward with frequent changes of scenery, well-crafted locations, and occasional gimmicks that keep things fresh.\n\nBut unfortunately, all that quality comes with severe writing issues and gameplay limitations inherent to the genre, which are by far what aged the [i]worst[/i] in this package.\n\nBeyond being a melodramatic young-adult story aimed at early-2000s teenagers—full of strong themes, iconic moments, and a kind of innocence and positivity that will [i]never[/i] return—the execution has clear problems. Beneath the pomp, the narrative falters in a [i]very[/i] frustrating way.\n\nThis is one of those stories where the script overrides character agency. No matter how forced, incoherent, or contradictory something is, it happens [i]because the script demands it[/i]. The result is a narrative full of loose ends and artificial mysteries, because characters consistently avoid asking obvious questions even when they have every reason—and opportunity—to ask them.\n\nOften, answers are [i]right there[/i], embodied in friendly characters the protagonist interacts with constantly, yet nothing is revealed organically. Scenes end abruptly, characters forget important events, or ignore them outright, only to revisit the matter hours later.\n\nA major example is Tidus—still as insufferable as I remembered—whose agency is repeatedly stifled. His personality is sidelined whenever something crucial to his motivation could be addressed. He avoids asking about [i]anything[/i] in detail, even while surrounded by allies willing to clarify things. \n\nIt’s not avoiding the elephant in the room; it’s acknowledging it in [i]installments[/i], piece by piece, solely because the script dictates it.\n\nMysteries need a purpose. When the answers are literally one very obvious question away, the whole thing is just stupid and frustrating. It feels like an amateur tactic to hide how shallow the story is. \n\nThe dialogue doesn’t help: aside from a few iconic lines, it’s weak, awkwardly delivered, and written with a sense of humor that wouldn’t land even for a toddler. Many characters are one-note archetypes with little group chemistry, relying on charisma they don’t always have. They are not more than the sum of their parts.\n\nYuna is the only remotely interesting and developed character for most of the first half. [i]That[/i] says a lot.\n\nThe story may have high points and solid pacing, but it’s clear that [i]this[/i] is the element that aged the worst. And it being an major part of the experience, greatly hinders the appreciation of the work.\n\nAnd about the gameplay… well… it’s as polished as you’d expect—and just as exhausting and repetitive.\n\nThe mechanics are straightforward and intuitive, remaining nearly identical to their early variations—only refined to create a smoother, more pleasant flow.\n\nCombat encounters are well crafted, often feeling like small puzzles that encourage you to switch strategies (and characters) constantly. Bosses are equally well made, each with some kind of exclusive gimmick or special mechanic that keeps the fights genuinely fun.\n\nThe progression system, in turn, promises customization but becomes a tedious process of filling nodes rather than making meaningful decisions. For more than half of the game, you’ll barely see its real potential and will likely dread upgrading all seven characters. \n\nI liked the simpler equipment system and how they prevented gear from becoming useless as the game progresses by removing vertical numeric upgrades and replacing them with specific bonuses. This makes carrying different weapons and armor worthwhile instead of selling them, with satisfying payoffs whenever they allows you to squeeze out an advantage.\n\nUnfortunately, this isn’t enough to mask the genre’s inherent repetition or the fact that the combat isn’t truly strategic. Most decisions boil down to elimination and efficiency rather than planning. The game is well balanced but generally easy, meaning you rarely need to explore every mechanic.\n\nWith random encounters paced poorly, they eventually feel like [i]jumpscare simulators[/i], draining your patience. Before you reach the halfway point, you’ll have heard the same battle theme [i]thousands[/i] of times.\n\n[i]FFX[/i] starts strong, but soon the interruptions become overwhelming and features like speeding up gameplay or disabling battles become tempting. \n\nA game that makes me want to avoid a core part of it has, in my view, [i]failed.[/i]\n\nExploring an area for 40 minutes when it should take 5 without interruptions feels like a joke… but it isn’t.\n\nSo... that’s it.\n\n[i]FFX[/i] still has charm and surprising quality even today, but its flaws and limitations are more visible than ever. People have an irrational attachment to the franchise—myself included—but not everything was perfect. Far from it.\n\nTo enjoy this, you'll need a lot of time and tolerance, which may very well not be worth it in the end.\n\n[i]Proceed at your own risk.[/i]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I remember when this game first released on the PS2, it was a great game then and it remains an amazing classic that will never grow old. An aamazing story, a very in depth sphere grid that paved the way for many games in the following years. I wish they would have kept the ability to switch out you team mates in battles in future ones. I always thought that battle mechanic was amazing.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is a classic. I've loved the series since the O.G. But this one just hits...different!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'll never forget how much of an impact this game made on me when I was younger.  This was absolute peak cinema when it first came out.  Still is a great story with some sad stuff and everything you'd expect from a final fantasy. One of the perks with X-X2 HD Remaster, is the system that allows you to fast forward battle time in case your really grinding the monster arena stuff and you want to expedite the process.  The true endgame in this one is to fight Penance in the monster arena.....massive grind overhauling your sphere grid with the better stat spheres.  \n\nThe music in this game will hit you hard! So good!\nThe voice acting is siiiiick.  Sir Auron probably my favorite.\nJust buy the damn game and realize you've been missing out on one of the gems of the past.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still holds up great, be sure to use the FFX fix mod for FFX to fix crashing, but not for X-2 which crashes more with it installed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Awesome Epic RPG of All Time. Loved the Story and Characters, and overall a awesome 10/10 game saga.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is dated but the story and worldbuilding is timeless. So if you don't like the characters or whats happening in the story you probably won't like it. Still highly recommend to give a try. It is a classic among PS2 games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I remember spending over 1000+ hours playing this game on PlayStation as a kid, Final Fantasy was the only reason I bought a PS. I'm so happy I no longer need a PS and can play it on PC.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "FFX is extremely nostalgic for me so I admit I am willing to overlook a lot of the clunkiness. I got this on a crazy steal so I'm pleased.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely great version of the game.  Plays exactly like the PS3 version from back in the day.  Highly reccomend a controller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A mixed bag of voice acting, and blitz ball is just awful. But, overall been very enjoyable so far!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Loved the story and characters 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great characters, cool creatures, sweet loot, but most importantly.... epic story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "These games are not perfect by any means, many gameplay elements can feel dated by modern standards. However, the story is what keeps you going. The Sphere Grid system is quite unique and allows you to customize characters with different abilities. Overall, it's a solid Final Fantasy game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review for X only --\r\nLook I enjoyed it enough, including enough to grind for the end game content, it is a main line FF game after all. But I don't get the hype around this one. It's extremely linear, the story is not nearly as buttoned up as other entries, and there are like 12 monster types that are just reskinned throughout the game. I understand this was being developed at the same time as IX, and that one seems like it got more love and attention; perhaps the higher level of graphics used in X pulled resources away from other areas. In the hierarchy of Final Fantasy games, this one is just \"Okay\" for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite games of all time growing up, and indeed to this day sits solidly in the round table of my top 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is peak nostalgia for me. The first game I had over 100 hours in on my PS2. Playing it again feels like putting on your favorite coat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have owned this game on almost every system it released on. I had it on PS2, the PS2 International version, PS3, and PS Vita. Now I bought it again on PC mainly because of the cutscene remover mod. This game is one of my all time favorite games ever made. Back in the day I literally begged my dad for a PlayStation 2 just so I could play this. Even now it still hits the same every time I replay it.\n\nSome of my complaints come from how buggy the PC version can be. The crashing gets annoying fast. But after installing the UnX mod, using CSR for skipping cutscenes, and applying the 4GB patch, it seems to be running way better. So far it has fixed most of the issues for me. Fingers crossed it stays that way.\n\nIf you already love this game, the PC version with mods is a great way to replay it. If you are new to it, this is still one of the best JRPG stories ever made and absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4GB patch has helped with FFX so far, have not started FF X-2 but reading lots of issues with it. but this is pc, we typically find a way to fix. gonna have a killer blast going through this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite Final Fantasy game ,good soundtrack and battle system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the Final Fantasy game that EVERYONE can play. Great story, simple mehcanics, wonderful details, and the new music is amazing! Everyone should play this game at least twice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FFX is a classic. The story is cool, but the gameplay is cooler. I love the combat system, aeon summoning, long story followed by hundreds of hours of post-game content. Blitzball is neat, a shame it's so poorly balanced.\n\nFFX-2 is... fine. The gameplay is okay, but the writing is... needlessly campy. I liked it on PS2 when I was younger, but playing it again as an adult I realize how terrible the writing is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first FF and I just gotta say... way too much yapping. Unskippable cutscene after unskippable cutscene. Power of friendship ahh story. But Blitzball is awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best of the saga if you consider all, story, graphics, soundtrack and all content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great game and an awesome story. It has many hours of playtime, so I am glad that I was able to replay this game since I played it when it first came out years ago.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Story Best Character Best Leveling Best Emotional Rollercoaster. If you haven't played it you're missing out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Final Fantasy ever made.\r\n\r\nThe first game obviously. Not X-2. Could you imagine? Hahahaha.\r\n\r\nBut no, clearly I was talking about the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Found 10-2 back in 03 and I had so much fun playing it on the ps2, lvling up the dresspheres getting new skills, new animations, trying to get 100% completion which you could fail if you skipped a cutscene. Wasn't till about two decades later I would find myself finally able to play 10 AND 10-2 and it's so amazing that these games come in a bundle because the first game was a lot better. \n\nAfter playing the first, the second game is effectively what did the group do after the first game and well, they just goof around and hunt dresspheres which can coincidentally hold memories? I'm not sure Yuna is looking for Tidus via looking for dresspheres and Pain is there and angsty and Riku has returned to show everyone she can wear thongs now. The combat is fun, the game is stable, there are lots of dresspheres skills and items to find in the world. The first game is fun, (Yuna is a summoner/sacrifice the first time around), so the story is a little dark , the combat is engaging The characters are interesting with several of them making another appearance in the second game. Would I play this instead of ff15? No. would i play this instead of FF7? No. Would I play this instead of FF7Remake? No. Would i play this instead of FFtype 0? Yes. would i play this instead of ff16? Yes. \n\nTLDR: If you looking for another FF to dig your hands into and have been eyeballing this one. Do it, but there are other options you should probably exaust first.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the few remasters that was improvement overall on the original, but add some mods and you fix the few shortfalls.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Story, characters, combat, landscape...amazing. And dont get me started on the soundtrack..",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The story is remarkable and fantastic. The platforming is a little outdated and one \"trial\" in particular made me physically nauseous. Gameplay mechanics during fights is very intuitive and does not require too much thought. Endgame bosses are quite difficult and I suggest researching the fights beforehand ... The talent system aka Sphere Grid is straightforward but you can easily go in the wrong direction if you don't do any planning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for people with daddy issues and religious trauma",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the visuals and music so far. yuna is sooo pretty too but specifically the ps2 version idk what they were thinking making her look so different in the remaster i had to use mods to make her look normal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "11/10 - i've bought this game on so many platforms. one of those game i come back to just about once a year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FFX is my favorite Final Fantasy that I have played but I will say I had problems with his port the cut scenes go to a green screen for some reason which is a real shame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ohhh my goddddd \"dont give up, someday you'll hold the record!\" (ノಠ益ಠ)ノ彡┻━┻\n\nstupid birds and stupid trainer, i'm glad all the [spoiler] chocobos died [/spoiler] because that race is abhorrent, whoever was on the storyboarding team that suggested we had to do this to get [spoiler] Caladbolg [/spoiler] needs to be fired. because why put half of the balloons out of bounds and let buddy skip a good thousand frames in front of me on that ramp. I WAS THERE FIRST. and then the heat seeking missile birds with hitboxes bigger than the titanic....\n\nother than that game is peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wakka - Racist\r\nRikku - Just ignore her\r\nKimahri - Blue Mage lol\r\nAuron - That arm works btw\r\nLulu - I dropped something\r\nYuna - Top\r\nTidus - HA HA HA HA HA HA HA HA HA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've loved FFX since I was a child. It remains a good game decades later!\r\nJust know some of the mini-games are nightmarish.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great classic game, brings back memories. Great for when you just wanna sit back and relax playing something solo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of those \"comfort\" games for me.  I game I can go back to and play again and again.  Obviously it doesn't show it on Steam, but I've played through this game a few times on Playstation and even on Switch.  Just a beautiful story and great turn-based combat.  It has its hiccups here and there, but what game doesn't honestly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a classic for a reason. I just replayed it with my wife watching. Its a beautiful game, unfortunately it is capped at 30 fps  this is the ONLY time i will advocate for using frame gen. 60 fps feels much better. if you arent sure how to use it on nvida or amd you can use lossless scaling on steam. unfortunately the game is also kinda buggy be sure to save often when grinding. it wasn't too often but it can crash. the story and gameplay is much worth the risk. ive nearly completed the game now 10/10 would reccomend. this is really one of the best turn based RPGs of all time. now, im going to replay Claire Obscure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The combat mechanics are pretty good. It isn't as good as 8, but beats everything past 11 by a long shot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for years, and have beaten it several times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the greatest game of all time, no joke. \r\n\r\nWhy the hell did they remake 7 first?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story 9/10\r\ngraphic 8/10\r\ncombat 7.5/10\r\nui and sphere grid system 9/10\r\n\r\nhighly recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "just play it i was doubtful but damn it people are right about this being peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game even after several years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this was my childhood fav it game!! I have lost count how many time i played this as a kid!\r\nDONT WAST TIME GET IT!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game. thats all. have fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its final fantasy 10 what else is there to add",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This might be the greatest game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game ya! Too bad you need machina to play it. It's a sin ya know!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "happy game where nothing bad happens.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had to dust off my almost never-used tissue box...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game oat with a mid ass port",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time playing. So far, so fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WE, TEEM G3ENNGUYY AGREE THAT THIS IS COOL.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is PEAK Final Fantasy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great games but grindy as hell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best stories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved playing this. Kept coming back for more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games ever made",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Final fantasy X is a X/X obviously",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game ever made",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good Story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "greatest game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dude square just knows how to hit",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like. Picasso. Art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love very much this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "veldig bra. tommel op :^)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buy if you want to cry .hope this helped",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best FF 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute cinema",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever made. That's it..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "FFX is one of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WAHNSINN !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fav final fantasy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh yeah iss goog yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in the top 5 of all time for me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Epic!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "2026 FFX Remake?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"I'm the best\" - Deadbeat Dad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*whistles loudly*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HA! HA! HA! Ha! HA!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kupo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it when Ichigo, Zoro and Itachi, teams up to save the world\r\n\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡼⠀⠠⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣨⠇⣐⡇⢀⠜⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠆⠀⠉⠐⠿⣠⡗⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠰⠀⠀⠀⠀⠀⠀⠘⠆⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⢼⣿⠆⠀⠀⠀⠀⠀⠜⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠠⠒⠂⠄⠀⠀⠀⠀⠀⠂⠀⠀⠀⠀⠀⠀⠸⡿⠀⡨⠁⠀⠀⠀⠀\r\n⠀⠀⠀⠀⢀⠂⠈⠀⠀⠀⠈⠐⠀⠄⠀⠀⠀⠀⣤⡀⠀⠀⠀⡰⠂⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠃⠀⠀⢐⠄⢀⠀⠤⡘⠀⠀⠀⠀⣼⡟⠀⠀⠀⣠⠃⠀⠀⢀⠔⠀⠀\r\n⠀⠀⠀⡌⠀⠀⠀⠌⠀⠀⠁⡆⠀⠀⠀⠀⠘⠛⠀⠀⠀⢰⡋⠀⠀⢠⠆⠀⠀⢀\r\n⠀⠀⠀⠃⠀⡀⠘⠀⠀⠀⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡆⠀⠐⠀⠏⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠁⠀⠀⠀⠀⠀⠀⠀⠀⢀⠋⢅⡀⠠⠀⠈⠀⢀⠈⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠠⢡⠀⠀⠀⠀⠀⠀⠀⠀⢠⠆⠀⠀⠈⠀⠀⠅⡀⠄⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠆⠈⢡⡄⠀⠀⠀⠀⠀⢀⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⡰⠀⠀⠀⠠⠀⠀⠌⠀⠀⢸⣄⣰⡀⣠⡤⠒⠐⠤⣀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⢇⠠⠀⠀⠀⠐⡸⠀⠀⠀⡼⡏⠉⠻⢄⠉⠢⢀⠀⠀⠈⠢⡁⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠁⠢⠀⠢⢠⠀⠀⠀⡰⠋⠀⠀⠀⠀⠀⠑⠠⡈⠀⠀⠀⡆⡆⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠈⠂⠆⢀⠰⠡⠀⠀⠀⠀⠀⠀⠀⡠⠁⠀⠀⠠⠁⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⢀⠂⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⢀⠀⡀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I'm shocked that this game has very positive reviews and its now clear to me the people who have reviewed this positively are people who are only saying how much they loved it back in the day - I adored ffx and its one of my favourite final fantasy games but this port is absolutely dogsh*it and completely unacceptable for a giant bloated company to not even put the time into porting this game properly.\r\n\r\nIf you want an unbias review read this one because the positive ones for a game that constantly crashes, green screens cutscenes and has a plethora of other issues shouldn't be rated this highly and its just people nostalgia reviewing - I've been trying to fix all these issues for days and having to turn to a community instead of the people literally PAID for this to just completely ignore the persistent issues of this game is a reflection of how much they care about their own consumers.",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "Holy shit, its 2025 and people cant make a working game? Greenscreen, crashing but its ff (insert emoji) so that ok right? No, save your money tbh.,",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "SquareEnix is the new Microsoft. They ruin everything they touch.\r\nCutscenes are broken, game keeps crashing. What the fuck is going on with these ass-backwards companies ruining shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just emulate it, It crashes CONSTANTLY, freezes and sometimes the screen will just go green during a cut scene. It's yet another crappy \"remaster\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The constant crashing makes the game insufferable. It crashes even with the mod. The game(s) are good, but you quickly lose the immersion after crashing several times in first 2 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Man what an absolute garbage fire of a port, The game constantly crashes, Green screens on cutscenes. downloaded a supposed fix only for it too halt my from saving and the save not functioning, lost an hour of progress TWICE!!.\n\nIf you wanna to play the game just emulate it or rip it from somewhere. THE GAME IS AWESOME, the port....no, not worth it. Totally unacceptable for a game that is so old.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First off, the part that makes me thumbs this down: This HD remaster is frankly a bit of a mess. It crashes regularly under all manner of different circumstances, game will occasionally softlock into a black screen when entering a combat encounter, character models have blacked out during cutscenes (which is kinda funny but it kills the gravitas of a scene quite dead), and FMVs will occasionally just green screen, forcing me to reboot the game and endure a whole chunk of gameplay/cutscenes before getting back to the bit I need to see.\n\nWhile the problems do not impede the totality of the experience from being enjoyable - and of course some of these problems can be fixed with end user tinkering I don't need to be told about this - these are issues that presented themselves across three different devices (one of them the Steam Deck) and feels a little unacceptable for the product out of the box, especially as compared to memories of playing this game on the PS2 where obviously there was no such performance hiccups, and of course some of these crashes can occur at extremely inopportune moments. There are some other issues as well, which may or may not matter to you depending on how much you care about fidelity to the original product - this game could be said to be more of a reconstruction than a remaster of the game since a lot of the original game data was lost by the devs, and so it doesn't quite ***look right***. These are differences that are ultimately minor and won't matter to the vast majority of players unless you played the PS2 original or you care about authenticity with your experience to the highest degree, but if they matter to you they'll matter a lot.\n\nThe games themselves? Excellent JRPGs, of course, and I don't feel obliged to elucidate on their qualities and flaws in here given how much has already been written about them - they peak at phenomenal while occasionally cratering to tedious, but overall I wholeheartedly recommend experiencing them if you are a fan of the JRPG genre or the Final Fantasy franchise in specific, but I would not rate this particular port as the must-go method of doing so, even with fixes and mods applied.\n\nTL;DR an acceptable port if you're patient, but hardly ideal.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ABSOLUTE TRASH-GARBAGE PORT OF THIS GAME. DO NOT BUY THIS PORT.\r\nSquare Enix should be embarrassed that this is what they’re selling.\r\nI have a strong gaming PC. I run modern games on high settings with zero issues. This game crashed six times during my playthrough. Three different cutscenes didn’t even play, they showed up as solid green screens. \r\nThe port is fundamentally broken without mods. The game doesn’t even run in real fullscreen. The built-in Vsync does nothing. Enjoy screen tearing and stutter unless you go install UnX or other fixes just to make it behave like a normal PC game in 2025. Menus run at one framerate, gameplay at another. Frame pacing is a mess. None of this should be the buyer’s problem.\r\nThis PC port being THIS BAD is honestly depressing.\r\nThis is a poorly handled, technically sloppy port that doesn’t meet even basic expectations.\r\nFinal Fantasy X is one of my favorite games of all time. I played it when it first came out, when I was very young, and it left a real mark on me. The story, the music, the world, the characters all of it still holds up. I love this game. I do not recommend buying this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is good, the port is terrible.  Crashes, green screen cutscenes, controllers inputs don't always register, just emulate it and play the original.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game constantly forces closed and is impossible to play.  Complete waste of money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FFX and FFX-2 suffer consistent crash errors. FFX may be fixed with the 4GB patch, but this is not a guaranteed solution. FFX-2 has no fix and is effectively unplayable. This collection is a scam. Emulate the games on PCSX2, they look better and will not crash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought to reexperience the game today. No experience to be had... Have to revert the settings on your computer to windows 97 levels of performance just to get the game to make it passed a cutscene and its still a massive variable. Garbage cash grab port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Although I really enjoy this game, I don't think the remastered version received a good port. The screen is a set size; the character models have been redone, but they are not as expressive due to the new modules and their tight budget for redoing this game. The movies have a chance to green screen on you so, you either get to watch them or you just deal with it, and the only option to maybe see them is to close the game and relaunch it. I also think having cheats from the start of the game is a bit of a downer for me. I liked playing and unlocking them, but having all the items and unlimited Gil right off the bat. My biggest issue might be the AI doing auto-battle. It just uses standard attacks and doesn't do much else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Love this game but the port to PC is horribly broken and glitchy as hell.  Dont waste your time and money and get it for consol.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Despite being a Remaster, this keeps a forced 30fps cap that is not removable with mods. The framerate cap also does not have correct frame pacing, both in gameplay and in cutscenes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love and adore X and X2, unfortunately on Steam the games don't work. Every cutscene is just a screen colored green and X2 crashes every five minutes. A fan made 4 gigpatch fixes the color green, but not the crashes. PLEASE BUY ON OTHER SYSTEMS OR EMULATE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start by saying I loved playing X as a kid, and the nostalgia potential was too strong not to pick this up on Steam. Unfortunately, while the nostalgia held up, the port did not. X crashed on me quite often on Steam Deck, so I saved frequently. Eventually, I found that I could not enter a particular building to pick up Wakka's celestial weapon without the game crashing every single time. So, I loaded up my cloud save on my PC, entered just fine, and I continued playing on my Steam Deck. Well, eventually the game wouldn't boot and I received notices that something was wrong with the game files. I validated, and no problems were detected. Huh, odd. Not one day later and my Deck's NVMe, the one the game was played on, died. Whether the game was at fault, I cannot say. I can say that my cloud saves were corrupted and I lost all my 70+ hours of progress. So, there's that.\n\nIn all, love X to pieces. I just wish the port were more stable on Deck. As for X-2, some people love it. I'm not one of them, but I can see the appeal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will get absolute hate for this review but this is by far one of the worst starts to not only a JRPG but any RPG I have ever played. The characters are bland (MC with Daddy issue and another that falls in love with him within 10 seconds). To top it off the expose of characters is all over the place due to an absolutely butchered localization. I am sure this game was probably somewhat fun when it came out but the dialogue between the characters is borderline cringe and nothing about this game holds up or is a good first time playthrough. This game is recommended by troves of people with nostalgia goggles who do not realize how truly awful this game is for anyone who didn't grow up playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only possible explanation for a port THIS bad is that they kidnapped a drifter, forced him to port the entire project solo while administering random electric shocks amidst sleep deprivation, immediately pushed it to market, then killed the drifter to cover their tracks. Cutscenes are green-scened, random crashes every 10m or so, occasionally black-screening during scene transitions requiring a reset ... Jesus H. Yevon. On a minor note, good luck figuring out how to use the Boosters, because absolutely nothing in the game or Store page will tell you (it's F1-F5 on the keyboard).\n\nI mean, I'm still gonna play it because I got it 60% off and I'm a sucker for nostalgia, but I refuse to enjoy it. That'll teach 'em. I am very smart.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the love of god, why did the remaster not include a way to skip the literal hours of cut scenes in this game. And before you say you can... you can only skip the pre-rendered cut scenes all the in-engine cut scenes cannot be skipped. which totals literal hours.... I want FF not a fucking movie.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wasn't digging it very much in the first 45 minutes of gameplay.  I heard positive things about the game so I thought I'd check it out.  I did enjoy the combat elements -- much better than other older games in the genre.  It was cool with the various QTE elements and it was pretty fast paced which I enjoyed.  I wish they'd get better English voice actors -- man they're really bad at times.  My biggest reason for the 'No Recommendation' is the game is unstable and crashes  -- which is insanely frustrating for a game that requires manual save points and doesn't autosave.  Mandatory unskippable cutscenes are also a huge turnoff.  I grew up on FF6 and FF7, but never tried FFX. I think I'll stick with the ones I know.  I really don't have any desire to keep playing with what I've currently seen and with the crashes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too many cutscenes that CANNOT be skipped.\nyou play 5 minutes, then there's a 10 minute long cutscene. i played for almost an hour according to steam, but I actually played for like 10 minutes tops (not including cutscenes)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay sucks but story is really good. Better save money and watch it on youtube",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buy this game anywhere but Steam. You can only play it on a little tiny window you can barely see and despite being a Switch game cannot be played using a Switch controller for whatever reason. This game is a scam on this platform",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Square Enix needs to fix the god damn cutscenes turned into blank green screens!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "green screens during majority of the cutscenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crashes every 5 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please fix the green screen and the crashes. It`s such a beautiful game that deserve a bit of love.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "I'm shocked that this game has very positive reviews and its now clear to me the people who have reviewed this positively are people who are only saying how much they loved it back in the day - I adored ffx and its one of my favourite final fantasy games but this port is absolutely dogsh*it and completely unacceptable for a giant bloated company to not even put the time into porting this game properly.\r\n\r\nIf you want an unbias review read this one because the positive ones for a game that constantly crashes, green screens cutscenes and has a plethora of other issues shouldn't be rated this highly and its just people nostalgia reviewing - I've been trying to fix all these issues for days and having to turn to a community instead of the people literally PAID for this to just completely ignore the persistent issues of this game is a reflection of how much they care about their own consumers.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Cutscenes are broken flat green screens.\r\nCrashes after every 1 and half hour.\r\nBeen an issue for years. Its ruining my favorite FF like they do to all their games.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Holy shit, its 2025 and people cant make a working game? Greenscreen, crashing but its ff (insert emoji) so that ok right? No, save your money tbh.,",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "SquareEnix is the new Microsoft. They ruin everything they touch.\r\nCutscenes are broken, game keeps crashing. What the fuck is going on with these ass-backwards companies ruining shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I Highly suggest people avoid purchasing this game. Unless I am the only one, I am not the only one, with issues with crashing, green screens and disappearing NPC's, then there is something seriously wrong with this game. I have deep nostalgia and great memories playing this game but playing it now has been nothing but frustration and annoyance as I have to restart every 20-30 minutes. I even downloaded a highly recommended 3rd party patch and the game still has issues. Shame  on Square Enix for releasing this on Steam in the condition that it is in. Literally ruining my adolescent memories.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "FFX was great. I did not like FFX2 as much as its predecessor but it did introduce some interesting mechanics like the garment grid and dress sphere. I hated the mini games though. As for why I won't recommend this remaster, well I don't actually see the HD remaster part. The green screen, missing cinematics, game crashes, really did not contribute to a good rpg experience. With all the problems aside, if you still wish to experience FFX, FFX2, FFX2 Last Mission, I would suggest waiting for a sale to get it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Final Fantasy X is an amazing game. Truly one of the greats despite some faults and everyone who likes RPGs should give it a play.\r\n\r\nBut not on PC. This is one of the laziest, worst ports I have ever seen. Here are the glaring issues I've experienced.\r\n\r\n- Constant crashing. Game crashes after about an hour, maybe 2. There doesn't seem to be any real pattern, it mostly crashes in battle transitions but I've experienced crashing in cutscenes, world map, and in menus. Autosave helps...sometimes but considering a lot of the end game especially is grinding, you better do it around a save sphere.\r\n- Speaking of cutscenes, FMV cutscenes often just turn into a green screen and you can't see them.\r\n- Autosave is nice for the most part, I don't remember it being in the PS4 version but I could be wrong. However, the game decided it would be a great idea to autosave before a cutscene I accidentally triggered that is a mandatory super boss fight. This is mostly my fault for not knowing where I was and not saving manually, but just a cautionary tale. Don't rely on autosave.\r\n- There's no way to soft reset or load a save. Make a mistake you wanna reload for? The only way back is to game over or close out the game entirely.\r\n- On that note, there doesn't seem to be any way to actually close the game either outside of the crashing or Alt F4. Why is this so common in PC ports of console games????\r\n\r\nFFX is a terrific game but do yourself a favor and find a PS4 copy.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really enjoyed this game when I was a kid and I really looked forward to playing it. Unfortunately, I continue to get random green screens during the cutscenes. I am very disappointed as I can play the game thus far, but I am missing parts of the story. Bummed!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game constantly forces closed and is impossible to play.  Complete waste of money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game freezes up too often. About once every couple hrs. Always loosing progress. Very annoying. Besides that it's a great remaster. Unfortunately it's a buggy mess.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As is well documented in many, MANY threads on the Steam forums, Reddit, etc. (which I unfortunately did not find until after purchasing), this game just does not run well on modern hardware. Most notably (but not the only issue this game has), the pre-rendered cutscenes frequently display with sound but no video, instead just displaying visually as a solid green screen. There are several documented fixes for this issue, but they only sometimes work. In particular, the fixes often stop working after 30-60 minutes of play time, requiring the player to close and restart the game once or twice an hour just to make it work properly. This is doable, but is a pain and quite frankly should not be necessary.\r\n\r\nIt's not uncommon for games from the early 2000s to require effort on the part of the user in order to make them run well on modern hardware, so in some sense this game is not unique in that regard - but this game is unlike, for example, the original Star Wars: Knights of the Old Republic, in that it takes [i]much[/i] more effort to get this game working and to some extent this one is just never going to run well no matter what you do. I've been through three or four different threads of people discussing the issues with this release and I've tried half a dozen different fixes, and some of them work to some extent but I still need to reboot the game at every save point. This is especially egregious because unlike KotOR (for which the version available on Steam is the original version from 2003), this version of this game is ostensibly a \"remaster\" and was released in 2013 (2016 for Windows PCs); in some sense, this version is not even an \"early 2000s\" game!\r\n\r\nFFX is an absolute classic, and this abominable release does not do it justice. I've paid for it and so I'll still play it, but I happen to know the versions of this \"remaster\" on pretty much any other platform do not have the issues of this Steam version. If you want to play this game, do yourself a favor: Buy it on Switch, or on PlayStation, or on literally any other platform.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn’t play Final Fantasy X back in the PS2 days. Twenty years later, I finally jump in with the HD Remaster, thinking I scored a steal. Thirty bucks gets me not just FFX, but also two sequels. Three games for the price of one—sweet deal, right?\nYeah… no. Big mistake.\n\nI’ll be real: I expected to hate FFX. Everyone and their cousin swore that’s when the franchise lost its soul. No world map, no open wandering, just a straight railroad until you get the airship, which is basically just fast travel. \n\nAnd yet… the damn thing grew on me. Blitzball? Awesome idea, but let me play it, not just sit there with an RPG inside my RPG. Kimahri? Doesn’t deserve the hate—he’s weird, sure, but Blue Magic being nerfed was the real crime. Tidus? Thought he was a lobotomized manchild at first, but I ended up loving him like everyone else.\n\nThe ending? Genuinely gut-punch bittersweet—first time a Final Fantasy ending ever hit me like that. The Sphere Grid? Best innovation in the game. Way better than old-school level ups, to the point I can’t imagine going back. \n\nOverdrives were mid, though—spamming Quick Attack was more effective than pulling off flashy moves. And once you hit that “break damage limit” wall, it’s just bloated HP numbers and longer, more boring boss fights. Still, the cast worked, the story had weight, and Wakka, Auron, Kimahri, and Rikku carried the whole damn thing. Loved it, flaws and all. Solid 8/10.\n\nThen I made the mistake of booting up X-2.\n\nOh my god. It’s like they looked at FFX and said: “You know what people loved? Let’s throw all that in the trash and replace it with glitter and grind.” Dresspheres sound cool, but in practice? Snooze. The combat got slower, the grind got dumber, and the story… Jesus. Characters you loved suddenly turned into caricatures. Rikku? Childish. Yuna? Bland. Brother? Full-on clown shoes. \n\nAnd the game forces you into minigames so bad they’d be cut from Mario Party. To get the “true” ending, you basically need a PhD in guide-following. And the payoff? Revive Tidus for a Disney Channel happy ending that straight-up ruins what made FFX’s ending great.\n\nAnd just to put the cherry on this dumpster sundae: the “Defeat Vegnagun” achievement—aka the final boss, the thing everyone has to beat to finish the game? Only 3.3% of players have it.\n\nThree. Point. Freaking. Three.\n\nThat means if you actually finish this game, you join an elite club of masochists who willingly crawled through this glitter-coated poopoo show and came out the other side with PTSD and a trophy no one asked for.\n\nSo congrats, you’re not just a gamer—you’re a gimp.\n\nLast Mission? Meh. Eternal Calm? Undo button. Sin’s back, none of your choices mattered, thanks for playing. I closed the app.\n\nSo here’s my hot take: this “HD Remaster” is really just FFX + trash DLC. Let’s do some math. These things usually go for about $30. That’s $10 a game. Which means FFX is an absolute bargain at ten bucks, and X-2 plus Last Mission are overpriced coasters. Or, more realistically, the full $30 is only for FFX, and Square just dumped the other garbage in as “bonus content.” Either way, just play FFX, enjoy the ride, and pretend the rest doesn’t exist.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunately, this version of the game runs too poorly and most likely won't let you finish even the first hour of the story. Buy it somewhere else and enjoy. \n\nAlso it's not quite fit for a keyboard so if you are still wiliing to give it a try then prepare a controller.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "every so often the game freezes and crashes and also some videos dont get visualized and its just a green screen with the audio underneath.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is hopelessly broken. Frequent crashes cause lost game time. Cut scenes are just green screen. For such an incredible game this is an overpriced disappointment and I've requested a refund. I'll just play on my playstation...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FFX and FFX-2 suffer consistent crash errors. FFX may be fixed with the 4GB patch, but this is not a guaranteed solution. FFX-2 has no fix and is effectively unplayable. This collection is a scam. Emulate the games on PCSX2, they look better and will not crash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Despite being a Remaster, this keeps a forced 30fps cap that is not removable with mods. The framerate cap also does not have correct frame pacing, both in gameplay and in cutscenes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love and adore X and X2, unfortunately on Steam the games don't work. Every cutscene is just a screen colored green and X2 crashes every five minutes. A fan made 4 gigpatch fixes the color green, but not the crashes. PLEASE BUY ON OTHER SYSTEMS OR EMULATE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start by saying I loved playing X as a kid, and the nostalgia potential was too strong not to pick this up on Steam. Unfortunately, while the nostalgia held up, the port did not. X crashed on me quite often on Steam Deck, so I saved frequently. Eventually, I found that I could not enter a particular building to pick up Wakka's celestial weapon without the game crashing every single time. So, I loaded up my cloud save on my PC, entered just fine, and I continued playing on my Steam Deck. Well, eventually the game wouldn't boot and I received notices that something was wrong with the game files. I validated, and no problems were detected. Huh, odd. Not one day later and my Deck's NVMe, the one the game was played on, died. Whether the game was at fault, I cannot say. I can say that my cloud saves were corrupted and I lost all my 70+ hours of progress. So, there's that.\n\nIn all, love X to pieces. I just wish the port were more stable on Deck. As for X-2, some people love it. I'm not one of them, but I can see the appeal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playable on the steam deck. Really? it keeps on saying filenot found when i click on x2. if your going to sell a game. MAKE SURE IT RUNS FIRST. Dont buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Green screen bug during CGI cut scenes. Done a couple fixes but its very annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love Final Fantasy X. It one of my favorite RPGs to play of all time. Unfortunately Steam has given me a very lousy version of it. Maybe my Dell Precision Laptop is not enough to run the game but I've done all the stuff that the internet would suggest to fix all the problems but they don't work. I continued to run into parts where stuff just disappears on a random whim as you play the game or glitches off to who knows where; and every cinematic cut scene is nothing but a green screen. It also took me too long to figure out that i needed to dumb down my resolution just to get the game on full screen. I wanted to put the game on my computer for convenes but I'm sorry, i just cant play this game like this. Your better off buying the game on an console than a computer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lots of crashes and missing cutscenes. No skip cutscene feature exists for any of regular ones (large majority). Not a great experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic pair of games. Utterly dreadful on Steam. I get crashes when loading, i get crashes while playing, I get crashes during cutscenes. I have had to face the SAME boss like 5 times because its crashed SO much. If you want to play these games do NOT get them on steam. Play them on console. Anything but steam. It takes 2 or 3 attempts to just get INTO FF-X as it crashes while trying loading the game SO bloody often. \n\nFantastic pair of games, wasted on Steam due to just how unplayable it can be at times. The crashes can be when you load up the game while playing the game, while watching cutscenes. Its just a bloody mess. Given how long its been out i highly doubt they will come back and fix the MANY issues which is awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I will get absolute hate for this review but this is by far one of the worst starts to not only a JRPG but any RPG I have ever played. The characters are bland (MC with Daddy issue and another that falls in love with him within 10 seconds). To top it off the expose of characters is all over the place due to an absolutely butchered localization. I am sure this game was probably somewhat fun when it came out but the dialogue between the characters is borderline cringe and nothing about this game holds up or is a good first time playthrough. This game is recommended by troves of people with nostalgia goggles who do not realize how truly awful this game is for anyone who didn't grow up playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only possible explanation for a port THIS bad is that they kidnapped a drifter, forced him to port the entire project solo while administering random electric shocks amidst sleep deprivation, immediately pushed it to market, then killed the drifter to cover their tracks. Cutscenes are green-scened, random crashes every 10m or so, occasionally black-screening during scene transitions requiring a reset ... Jesus H. Yevon. On a minor note, good luck figuring out how to use the Boosters, because absolutely nothing in the game or Store page will tell you (it's F1-F5 on the keyboard).\n\nI mean, I'm still gonna play it because I got it 60% off and I'm a sucker for nostalgia, but I refuse to enjoy it. That'll teach 'em. I am very smart.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the love of god, why did the remaster not include a way to skip the literal hours of cut scenes in this game. And before you say you can... you can only skip the pre-rendered cut scenes all the in-engine cut scenes cannot be skipped. which totals literal hours.... I want FF not a fucking movie.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wasn't digging it very much in the first 45 minutes of gameplay.  I heard positive things about the game so I thought I'd check it out.  I did enjoy the combat elements -- much better than other older games in the genre.  It was cool with the various QTE elements and it was pretty fast paced which I enjoyed.  I wish they'd get better English voice actors -- man they're really bad at times.  My biggest reason for the 'No Recommendation' is the game is unstable and crashes  -- which is insanely frustrating for a game that requires manual save points and doesn't autosave.  Mandatory unskippable cutscenes are also a huge turnoff.  I grew up on FF6 and FF7, but never tried FFX. I think I'll stick with the ones I know.  I really don't have any desire to keep playing with what I've currently seen and with the crashes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too many cutscenes that CANNOT be skipped.\nyou play 5 minutes, then there's a 10 minute long cutscene. i played for almost an hour according to steam, but I actually played for like 10 minutes tops (not including cutscenes)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay sucks but story is really good. Better save money and watch it on youtube",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buy this game anywhere but Steam. You can only play it on a little tiny window you can barely see and despite being a Switch game cannot be played using a Switch controller for whatever reason. This game is a scam on this platform",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Square Enix needs to fix the god damn cutscenes turned into blank green screens!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "green screens during majority of the cutscenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crashes every 5 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please fix the green screen and the crashes. It`s such a beautiful game that deserve a bit of love.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "I'm shocked that this game has very positive reviews and its now clear to me the people who have reviewed this positively are people who are only saying how much they loved it back in the day - I adored ffx and its one of my favourite final fantasy games but this port is absolutely dogsh*it and completely unacceptable for a giant bloated company to not even put the time into porting this game properly.\r\n\r\nIf you want an unbias review read this one because the positive ones for a game that constantly crashes, green screens cutscenes and has a plethora of other issues shouldn't be rated this highly and its just people nostalgia reviewing - I've been trying to fix all these issues for days and having to turn to a community instead of the people literally PAID for this to just completely ignore the persistent issues of this game is a reflection of how much they care about their own consumers.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Cutscenes are broken flat green screens.\r\nCrashes after every 1 and half hour.\r\nBeen an issue for years. Its ruining my favorite FF like they do to all their games.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Holy shit, its 2025 and people cant make a working game? Greenscreen, crashing but its ff (insert emoji) so that ok right? No, save your money tbh.,",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "SquareEnix is the new Microsoft. They ruin everything they touch.\r\nCutscenes are broken, game keeps crashing. What the fuck is going on with these ass-backwards companies ruining shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just emulate it, It crashes CONSTANTLY, freezes and sometimes the screen will just go green during a cut scene. It's yet another crappy \"remaster\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I Highly suggest people avoid purchasing this game. Unless I am the only one, I am not the only one, with issues with crashing, green screens and disappearing NPC's, then there is something seriously wrong with this game. I have deep nostalgia and great memories playing this game but playing it now has been nothing but frustration and annoyance as I have to restart every 20-30 minutes. I even downloaded a highly recommended 3rd party patch and the game still has issues. Shame  on Square Enix for releasing this on Steam in the condition that it is in. Literally ruining my adolescent memories.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "FFX was great. I did not like FFX2 as much as its predecessor but it did introduce some interesting mechanics like the garment grid and dress sphere. I hated the mini games though. As for why I won't recommend this remaster, well I don't actually see the HD remaster part. The green screen, missing cinematics, game crashes, really did not contribute to a good rpg experience. With all the problems aside, if you still wish to experience FFX, FFX2, FFX2 Last Mission, I would suggest waiting for a sale to get it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really enjoyed this game when I was a kid and I really looked forward to playing it. Unfortunately, I continue to get random green screens during the cutscenes. I am very disappointed as I can play the game thus far, but I am missing parts of the story. Bummed!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The constant crashing makes the game insufferable. It crashes even with the mod. The game(s) are good, but you quickly lose the immersion after crashing several times in first 2 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is good, the port is terrible.  Crashes, green screen cutscenes, controllers inputs don't always register, just emulate it and play the original.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Man what an absolute garbage fire of a port, The game constantly crashes, Green screens on cutscenes. downloaded a supposed fix only for it too halt my from saving and the save not functioning, lost an hour of progress TWICE!!.\n\nIf you wanna to play the game just emulate it or rip it from somewhere. THE GAME IS AWESOME, the port....no, not worth it. Totally unacceptable for a game that is so old.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First off, the part that makes me thumbs this down: This HD remaster is frankly a bit of a mess. It crashes regularly under all manner of different circumstances, game will occasionally softlock into a black screen when entering a combat encounter, character models have blacked out during cutscenes (which is kinda funny but it kills the gravitas of a scene quite dead), and FMVs will occasionally just green screen, forcing me to reboot the game and endure a whole chunk of gameplay/cutscenes before getting back to the bit I need to see.\n\nWhile the problems do not impede the totality of the experience from being enjoyable - and of course some of these problems can be fixed with end user tinkering I don't need to be told about this - these are issues that presented themselves across three different devices (one of them the Steam Deck) and feels a little unacceptable for the product out of the box, especially as compared to memories of playing this game on the PS2 where obviously there was no such performance hiccups, and of course some of these crashes can occur at extremely inopportune moments. There are some other issues as well, which may or may not matter to you depending on how much you care about fidelity to the original product - this game could be said to be more of a reconstruction than a remaster of the game since a lot of the original game data was lost by the devs, and so it doesn't quite ***look right***. These are differences that are ultimately minor and won't matter to the vast majority of players unless you played the PS2 original or you care about authenticity with your experience to the highest degree, but if they matter to you they'll matter a lot.\n\nThe games themselves? Excellent JRPGs, of course, and I don't feel obliged to elucidate on their qualities and flaws in here given how much has already been written about them - they peak at phenomenal while occasionally cratering to tedious, but overall I wholeheartedly recommend experiencing them if you are a fan of the JRPG genre or the Final Fantasy franchise in specific, but I would not rate this particular port as the must-go method of doing so, even with fixes and mods applied.\n\nTL;DR an acceptable port if you're patient, but hardly ideal.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ABSOLUTE TRASH-GARBAGE PORT OF THIS GAME. DO NOT BUY THIS PORT.\r\nSquare Enix should be embarrassed that this is what they’re selling.\r\nI have a strong gaming PC. I run modern games on high settings with zero issues. This game crashed six times during my playthrough. Three different cutscenes didn’t even play, they showed up as solid green screens. \r\nThe port is fundamentally broken without mods. The game doesn’t even run in real fullscreen. The built-in Vsync does nothing. Enjoy screen tearing and stutter unless you go install UnX or other fixes just to make it behave like a normal PC game in 2025. Menus run at one framerate, gameplay at another. Frame pacing is a mess. None of this should be the buyer’s problem.\r\nThis PC port being THIS BAD is honestly depressing.\r\nThis is a poorly handled, technically sloppy port that doesn’t meet even basic expectations.\r\nFinal Fantasy X is one of my favorite games of all time. I played it when it first came out, when I was very young, and it left a real mark on me. The story, the music, the world, the characters all of it still holds up. I love this game. I do not recommend buying this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love this game but the port to PC is horribly broken and glitchy as hell.  Dont waste your time and money and get it for consol.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game constantly forces closed and is impossible to play.  Complete waste of money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game freezes up too often. About once every couple hrs. Always loosing progress. Very annoying. Besides that it's a great remaster. Unfortunately it's a buggy mess.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As is well documented in many, MANY threads on the Steam forums, Reddit, etc. (which I unfortunately did not find until after purchasing), this game just does not run well on modern hardware. Most notably (but not the only issue this game has), the pre-rendered cutscenes frequently display with sound but no video, instead just displaying visually as a solid green screen. There are several documented fixes for this issue, but they only sometimes work. In particular, the fixes often stop working after 30-60 minutes of play time, requiring the player to close and restart the game once or twice an hour just to make it work properly. This is doable, but is a pain and quite frankly should not be necessary.\r\n\r\nIt's not uncommon for games from the early 2000s to require effort on the part of the user in order to make them run well on modern hardware, so in some sense this game is not unique in that regard - but this game is unlike, for example, the original Star Wars: Knights of the Old Republic, in that it takes [i]much[/i] more effort to get this game working and to some extent this one is just never going to run well no matter what you do. I've been through three or four different threads of people discussing the issues with this release and I've tried half a dozen different fixes, and some of them work to some extent but I still need to reboot the game at every save point. This is especially egregious because unlike KotOR (for which the version available on Steam is the original version from 2003), this version of this game is ostensibly a \"remaster\" and was released in 2013 (2016 for Windows PCs); in some sense, this version is not even an \"early 2000s\" game!\r\n\r\nFFX is an absolute classic, and this abominable release does not do it justice. I've paid for it and so I'll still play it, but I happen to know the versions of this \"remaster\" on pretty much any other platform do not have the issues of this Steam version. If you want to play this game, do yourself a favor: Buy it on Switch, or on PlayStation, or on literally any other platform.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn’t play Final Fantasy X back in the PS2 days. Twenty years later, I finally jump in with the HD Remaster, thinking I scored a steal. Thirty bucks gets me not just FFX, but also two sequels. Three games for the price of one—sweet deal, right?\nYeah… no. Big mistake.\n\nI’ll be real: I expected to hate FFX. Everyone and their cousin swore that’s when the franchise lost its soul. No world map, no open wandering, just a straight railroad until you get the airship, which is basically just fast travel. \n\nAnd yet… the damn thing grew on me. Blitzball? Awesome idea, but let me play it, not just sit there with an RPG inside my RPG. Kimahri? Doesn’t deserve the hate—he’s weird, sure, but Blue Magic being nerfed was the real crime. Tidus? Thought he was a lobotomized manchild at first, but I ended up loving him like everyone else.\n\nThe ending? Genuinely gut-punch bittersweet—first time a Final Fantasy ending ever hit me like that. The Sphere Grid? Best innovation in the game. Way better than old-school level ups, to the point I can’t imagine going back. \n\nOverdrives were mid, though—spamming Quick Attack was more effective than pulling off flashy moves. And once you hit that “break damage limit” wall, it’s just bloated HP numbers and longer, more boring boss fights. Still, the cast worked, the story had weight, and Wakka, Auron, Kimahri, and Rikku carried the whole damn thing. Loved it, flaws and all. Solid 8/10.\n\nThen I made the mistake of booting up X-2.\n\nOh my god. It’s like they looked at FFX and said: “You know what people loved? Let’s throw all that in the trash and replace it with glitter and grind.” Dresspheres sound cool, but in practice? Snooze. The combat got slower, the grind got dumber, and the story… Jesus. Characters you loved suddenly turned into caricatures. Rikku? Childish. Yuna? Bland. Brother? Full-on clown shoes. \n\nAnd the game forces you into minigames so bad they’d be cut from Mario Party. To get the “true” ending, you basically need a PhD in guide-following. And the payoff? Revive Tidus for a Disney Channel happy ending that straight-up ruins what made FFX’s ending great.\n\nAnd just to put the cherry on this dumpster sundae: the “Defeat Vegnagun” achievement—aka the final boss, the thing everyone has to beat to finish the game? Only 3.3% of players have it.\n\nThree. Point. Freaking. Three.\n\nThat means if you actually finish this game, you join an elite club of masochists who willingly crawled through this glitter-coated poopoo show and came out the other side with PTSD and a trophy no one asked for.\n\nSo congrats, you’re not just a gamer—you’re a gimp.\n\nLast Mission? Meh. Eternal Calm? Undo button. Sin’s back, none of your choices mattered, thanks for playing. I closed the app.\n\nSo here’s my hot take: this “HD Remaster” is really just FFX + trash DLC. Let’s do some math. These things usually go for about $30. That’s $10 a game. Which means FFX is an absolute bargain at ten bucks, and X-2 plus Last Mission are overpriced coasters. Or, more realistically, the full $30 is only for FFX, and Square just dumped the other garbage in as “bonus content.” Either way, just play FFX, enjoy the ride, and pretend the rest doesn’t exist.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunately, this version of the game runs too poorly and most likely won't let you finish even the first hour of the story. Buy it somewhere else and enjoy. \n\nAlso it's not quite fit for a keyboard so if you are still wiliing to give it a try then prepare a controller.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "every so often the game freezes and crashes and also some videos dont get visualized and its just a green screen with the audio underneath.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is hopelessly broken. Frequent crashes cause lost game time. Cut scenes are just green screen. For such an incredible game this is an overpriced disappointment and I've requested a refund. I'll just play on my playstation...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FFX and FFX-2 suffer consistent crash errors. FFX may be fixed with the 4GB patch, but this is not a guaranteed solution. FFX-2 has no fix and is effectively unplayable. This collection is a scam. Emulate the games on PCSX2, they look better and will not crash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought to reexperience the game today. No experience to be had... Have to revert the settings on your computer to windows 97 levels of performance just to get the game to make it passed a cutscene and its still a massive variable. Garbage cash grab port.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Although I really enjoy this game, I don't think the remastered version received a good port. The screen is a set size; the character models have been redone, but they are not as expressive due to the new modules and their tight budget for redoing this game. The movies have a chance to green screen on you so, you either get to watch them or you just deal with it, and the only option to maybe see them is to close the game and relaunch it. I also think having cheats from the start of the game is a bit of a downer for me. I liked playing and unlocking them, but having all the items and unlimited Gil right off the bat. My biggest issue might be the AI doing auto-battle. It just uses standard attacks and doesn't do much else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Despite being a Remaster, this keeps a forced 30fps cap that is not removable with mods. The framerate cap also does not have correct frame pacing, both in gameplay and in cutscenes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love and adore X and X2, unfortunately on Steam the games don't work. Every cutscene is just a screen colored green and X2 crashes every five minutes. A fan made 4 gigpatch fixes the color green, but not the crashes. PLEASE BUY ON OTHER SYSTEMS OR EMULATE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start by saying I loved playing X as a kid, and the nostalgia potential was too strong not to pick this up on Steam. Unfortunately, while the nostalgia held up, the port did not. X crashed on me quite often on Steam Deck, so I saved frequently. Eventually, I found that I could not enter a particular building to pick up Wakka's celestial weapon without the game crashing every single time. So, I loaded up my cloud save on my PC, entered just fine, and I continued playing on my Steam Deck. Well, eventually the game wouldn't boot and I received notices that something was wrong with the game files. I validated, and no problems were detected. Huh, odd. Not one day later and my Deck's NVMe, the one the game was played on, died. Whether the game was at fault, I cannot say. I can say that my cloud saves were corrupted and I lost all my 70+ hours of progress. So, there's that.\n\nIn all, love X to pieces. I just wish the port were more stable on Deck. As for X-2, some people love it. I'm not one of them, but I can see the appeal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playable on the steam deck. Really? it keeps on saying filenot found when i click on x2. if your going to sell a game. MAKE SURE IT RUNS FIRST. Dont buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Green screen bug during CGI cut scenes. Done a couple fixes but its very annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I will get absolute hate for this review but this is by far one of the worst starts to not only a JRPG but any RPG I have ever played. The characters are bland (MC with Daddy issue and another that falls in love with him within 10 seconds). To top it off the expose of characters is all over the place due to an absolutely butchered localization. I am sure this game was probably somewhat fun when it came out but the dialogue between the characters is borderline cringe and nothing about this game holds up or is a good first time playthrough. This game is recommended by troves of people with nostalgia goggles who do not realize how truly awful this game is for anyone who didn't grow up playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only possible explanation for a port THIS bad is that they kidnapped a drifter, forced him to port the entire project solo while administering random electric shocks amidst sleep deprivation, immediately pushed it to market, then killed the drifter to cover their tracks. Cutscenes are green-scened, random crashes every 10m or so, occasionally black-screening during scene transitions requiring a reset ... Jesus H. Yevon. On a minor note, good luck figuring out how to use the Boosters, because absolutely nothing in the game or Store page will tell you (it's F1-F5 on the keyboard).\n\nI mean, I'm still gonna play it because I got it 60% off and I'm a sucker for nostalgia, but I refuse to enjoy it. That'll teach 'em. I am very smart.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the love of god, why did the remaster not include a way to skip the literal hours of cut scenes in this game. And before you say you can... you can only skip the pre-rendered cut scenes all the in-engine cut scenes cannot be skipped. which totals literal hours.... I want FF not a fucking movie.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wasn't digging it very much in the first 45 minutes of gameplay.  I heard positive things about the game so I thought I'd check it out.  I did enjoy the combat elements -- much better than other older games in the genre.  It was cool with the various QTE elements and it was pretty fast paced which I enjoyed.  I wish they'd get better English voice actors -- man they're really bad at times.  My biggest reason for the 'No Recommendation' is the game is unstable and crashes  -- which is insanely frustrating for a game that requires manual save points and doesn't autosave.  Mandatory unskippable cutscenes are also a huge turnoff.  I grew up on FF6 and FF7, but never tried FFX. I think I'll stick with the ones I know.  I really don't have any desire to keep playing with what I've currently seen and with the crashes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too many cutscenes that CANNOT be skipped.\nyou play 5 minutes, then there's a 10 minute long cutscene. i played for almost an hour according to steam, but I actually played for like 10 minutes tops (not including cutscenes)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay sucks but story is really good. Better save money and watch it on youtube",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buy this game anywhere but Steam. You can only play it on a little tiny window you can barely see and despite being a Switch game cannot be played using a Switch controller for whatever reason. This game is a scam on this platform",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Square Enix needs to fix the god damn cutscenes turned into blank green screens!!!",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}