{
  "positive": [
    {
      "review": "I really don't understand the hate this game gets.\r\nInteresting story, very good graphics, well designed side charachters and the 3 extra missions are spectacular. On top of that you get some great great music while playing.\r\nI faced some bugs here and there but nothing too often or too bad.\r\nEasily the best out of the mafia trilogy imo, highly recommend especially on discount.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Always had a soft spot for this one. Tried playing it at launch back in '16 but had to shelve it owing to the flashy 14 fps I got out of it with my laptop. To this day it struggles to run at 60 locked. Underrated? Maybe. Could it have reached the status Cyberpunk has if the devs locked in and addressed all the glitches and the severe lack of polish? Not quite since Mafia 3 has a repetition problem.   Mafia 3 is severely repetitive with its mission design but I don't think it's as soul-lessly repetitive as something like ubisoft's latest installments. \nThese Racket missions all have you running around and causing a specified amount of damage/loss to take down the businesses. It being grindy and repetitive is an understatement but the thing is a lot of the level design seem distinct enough, the set pieces all look pretty unique from eachother most of the time and the shooting mechanics is crisp af with stealth being viable as well, so ultimately, the pacing of the narrative throughout these missions is what made it a slog to get through for the better part of the game. I found it extremely annoying when the game forces you to revisit the same locations you’d already been to earlier just to kill or recruit one of the racket bosses. They shouldn't have opted the ubislop route of not just having a kill list but also making it grindy af to the likes of something like Wildlands or Odyssey. It might be a better experience to play the game slowly and avoid the repetitiveness get to you, but it's a Mafia game, you play it solely for the narrative.\nRockstar has the same tedious mission design of moving from A to B to kill someone. But what makes their games stand out is that the focus on narrative is never lost, they keep expanding and developing on their characters and plot, so it makes these repetitive ass missions playable to a great degree which is something that Mafia 3 forgets to do. And the thing with M3 is that you know where the plot is heading towards right at the start of it all, so it has no reason to stretch itself like it did, there was no gotcha moment at the end, Lincoln accomplishes exactly what he sets out to do and his character barely changes during it. Now the execution of Sal and Giorgi's ending was amazing but not sure if it was worth all the grindy parts of it preceding that. All the character bio was so nicely written, just hope they had infused all that into the story in the form of cutscenes/driving conversations. I say this as someone who loves third person shooters the most out of all genres, TPS has gotten stale and monotonous, so you need to make it linear and have a neat narrative tied along with it. There's a reason why no one else attempts to do a full fledged open world TPS other than rockstar nowadays. So yeah it was a poor decision on hangar 13's part to bury a decent story under all that repetitiveness when they could have gone the same route as the previous games or paced the story well to fit the open world. I like how you get benefits out of all the racketeering that are actually pretty helpful when it comes to gameplay. Really wish they hadn't abandoned some of the mechanics introduced here in Mafia Old Country. The driving felt really good but the pedestrians resembled those from GTA 3 where they dive into the car to kill themselves instead of just walking like a normal human being 😭. Also I found the driving to be disgusting when I first picked it up but that was all because of the performance. And to think of it narratively it makes absolutely no sense why THREE underbosses would uselessly and shamelessly depend on a single guy to toss all the districts and rackets to them and be ungrateful pricks about it. Speaking of it, I really hoped Vito would have had a bigger presence in the story instead of being one of these obnoxious underbosses I mentioned. Also I don't think they should've teased Joe like that in the ending, kinda removes the impact and ambiguity of the 2nd game's ending. Overall the endings were neat tho some where outright hilarious like the one where father james randomly plants a bomb under Lincoln's car. M3 had it all,  be it the amazing driving mechanics, satisfying gunplay, a stellar soundtrack or a captivating premise but it all gets buried under a grindy mission design and a few game breaking glitches here and there. Might check out the dlcs soon enough.\n\nIf you’ve made it this far, my sincerest of apologies to all the non-existent readers for my repetitive use of the word “repetitive.” 🙏🏼",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Pros\n- Visceral combat. Both you and enemies go down fast, making for some intense gunplay, kills aren't always clean too, with enemies lying wounded, begging for their lives or groaning, emphasising the brutality, though for you you do get adrenaline shots you can use to recover from near-death and buff your health back, but that only goes a little towards making you less squishy until you get late game upgrades for it.\n- Memorable setting and story. A Southern US city with French influence, diverse range of gangs (Hillbillies, KKK, Mafiosi, Haitians, Irish), and easily hateable racist scumbags trying to hold back the march of the civil rights era, and a narrative told in several formats, the 60s, which acts as your character's present, and flashforwards in some cutscenes to 2 different forms, a 1970s Senate hearing and a 2010s documentary, speaking about your crime spree in past tense with the characters reflecting on it, those characters are certainly interesting too, both friends and enemies, well voice acted with excellently mocapped cutscenes. Plus the radio music rules.\n- Sit Down system. Mafia 3 is all about conquering the city, the basic gameplay loop is this, you have 9 districts to take over by killing their bosses, each district has its boss (representing the whole district) and 2 underlings (representing its 2 rackets/businesses), the first 3 districts are automatically assigned to your 3 different ally gangs, but after that you get to decide who gets what, earning cash and unique perks from the allies you provide for, each offering 4 district’s worth of perks and 3 district's worth of loyalty missions which add a little extra story at the end of the chain. First you can decide rackets individually, but once you kill the boss you assign the district as a whole, giving all of its rackets to your chosen ally. Each ally always wants the turf, but their hunger for it will be impacted by 2 things, whether you already gave them rackets in that turf, and their overall loyalty (based on if you give them turfs previously, or did post-turf loyalty missions for them), you can keep them all happy and make lots of cash together if you play your cards right, but if you don't they'll ditch you and become a problem to be dealt with and a hole in your wallet. The only real flaw it has is there’s no real reason to assign any rackets to a boss you don’t plan to give the turf to, as it just pisses them off with no benefits, making that choice basically irrelevant.\n- Quality DLCs. The DLC missions, included free in this edition, are great fun with proper plotlines and unique missions, best played in between waves of district conquering to break up their monotony.\n- Smoother controls driving. Taking an even further step in this direction from M2 the driving is fast and it’s easy to make turns, making for really nice cruising round the city that only really is lost if you pick a really shit vehicle or it gets so shot to bits you don’t have any tires left to cruise with. On foot it’s easier to snap in and out of cover too.\n\nCons\n- Repetitive gameplay loop. To draw out a district boss you have to kill their underlings and to draw out the underlings you have to meddle with their rackets, you do that by doing assassinations, interrogations (just a takedown where you hold instead of press the button), thefts, property destruction and the occasional hostage rescue, these get very repetitive very fast. That gets added to once districts are taken over, where you have delivery jobs to do to increase their income and the loyalty missions (which include more collectathons and assassination jobs), although those are at least optional. These generic, repetitive, plot lite, bite sized jobs make up the vast majority of missions, with only the Prologue, District Bosses*, Finale and DLC content including unique encounters.\n- Wonky takedown system. Takedowns can either be lethal or non lethal, but rather than being 2 different keybinds or a press/hold distinction, lethality has to be toggled in the options menu, underling bosses can also only be spared if you do the arbitrary extra step of wiretapping their area, otherwise Lincoln will automatically kill them.\n- Occasional tanky enemies. In general combat is fast paced, but some enemies have artificially buffed health, being able to take dozens of Tommy Gun rounds to the chest with nothing but a generic shirt on and still turn round and blast you as you reload, not fun. This becomes a non issue around half way through the game, when upgrades to your health restoring Adrenaline make you the tanky one.\n- Lacking interactivity. Except for car shops all of the game's stores can't be bought from, with resources instead handled through mobile dealers you can call, although those dealers make for great convenience the lack of stores, makes the city feel pretty barren of things to do. You just have the car dealerships, mission content, planting wiretaps and robbery, a step down from M2.\n- Mission bugs. Sometimes missions don't appear when they're supposed to, forcing a restart to get them to appear, and sometimes icons for them can show up on the map when they're not actually available, leading you towards red herrings.\n- Lacking faction variety. The early game gives the impression you’ll be up against a variety of factions, introducing the Haitians and Dixie Mafia as early rivals, but in reality almost the whole game has you fighting against the Mafia, with the Haitians joining you and Dixie only appearing in filler missions after the prologue. Though you do face the KKK styled Southern Union in select other encounters.\n- Loss of collectivity. In M1 you were part of a gang, very frequently working with other mobsters like Paulie and Sam as well as regular goons, in 2 you swapped from family to family but were constantly with your buddy Joe and sometimes others like Henry and Tony, in 3 there’s almost none of that except for the prologue, where you work with several allies to rob the Federal Reserve. After that Lincoln has people in a support role like the 3 allied gang bosses and their associates, plus his spook ally Donovan, but the actual dirty work is done by him on his own, even though it’s his crime family. His own gang he was part of before, the Black Mob, is also completely forgotten about after the prologue. A nearly entirely one man war, Rambo style, is a departure from the series that just makes the immersion harder to maintain.\n- Simplified police system. Cops don’t try to arrest you anymore, they either ignore your shit or shoot, and they don’t enforce most traffic laws unlike M1 and 2 where they’d try to fine or arrest you for speeding or running red lights, I don’t mind not being harassed by that given how much driving there is to do, but the option would be cool, especially for this setting where these racist cops would pull you over for any little thing irl, they also don't remember you/your vehicle’s look after being wanted.\n- Outfit choice not respected. Because most cutscenes are pre-rendered, Lincoln will always appear in cutscenes in his veteran jacket, rather than what you chose to wear.\n\n*District Bosses are usually 1 mission, but the last set of bosses have 2 missions, having you take down an accomplice of theirs too\n\nFor much of my first 9 hours with the game (where I conquered the first 3 districts) I really hated it, drained by its constant repetition, but after playing one of the DLCs, getting a breather, when I came back to the main game I found I wasn’t bothered as much, since the combat and driving is a solid core, in the end enjoying the game despite its faults, especially since more weapon and vehicle unlocks sped up those repetitive rackets, letting me get to the more substantial parts faster.\n\nThe fact that they barely bothered to include proper missions really keeps it down, leaving it as just good, rather than truly great, but on balance, I’d say it's worth a play.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "The game itself is good, feels more like a game than a narrative driven experience compared to the other 2 DE games.\r\nThe biggest issue with it is the bugs introduced with the Definitive Edition. If you care about achievements and stability, I recommend following one of the guides to downgrade the game to version 1.09, you still have every DLC and the achievements will work.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Mafia III doesn’t quite feel like a true “Mafia” game since it strays far from the tone and style of the earlier titles. The gameplay can get repetitive at times, with missions often feeling similar. However, if you love the atmosphere, music, and aesthetic of the 1960s and 70s, this game might be right for you. It feels more like Cyberpunk 1968 and 1970 driving simulator, while also capturing the style and mood of Once Upon a Time in Hollywood and American Gangster.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I'm not sure why there are so many bad reviews of this game. After playing the first two in the series this is a huge open world by comparison, the driving is excellent and the gun action is top notch, love the music and the characters too, there's a lot to do, really enjoying it. 17 hours in and I'm just getting started (where the first two games are complete after 15 levels and just 10 hours or so.) Recommended. Runs like a dream on my PC.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its a incredibly good game. A lot of it is about kill racist and sexist pricks so that makes it even more fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "6/10 – Ambitious but Flawed Entry in the Mafia Series\n\nMafia III: Definitive Edition is a bold departure from the classic Mafia formula, offering strong storytelling and a powerful setting, but ultimately falling short of the high standards set by Mafia and Mafia II. While the game delivers emotional weight and compelling themes, its repetitive gameplay and technical issues prevent it from reaching its full potential.\n\nSet in the beautifully realized 1968 city of New Bordeaux, the game introduces a fresh protagonist—Lincoln Clay, a Vietnam veteran seeking revenge after the brutal destruction of his adopted family. The story is gritty, mature, and told with an impressive documentary-style structure. The voice acting and cinematic presentation are some of the best in the series, and the soundtrack perfectly captures the era with legendary tracks from the late ’60s rock and soul scene.\n\nHowever, compared to previous Mafia titles, the gameplay loop becomes predictable quickly. Missions follow a repetitive structure of clearing districts, destroying rackets, and confronting lieutenants—lacking the tight pacing and memorable set pieces of Mafia: Definitive Edition or Mafia II. While the gunplay and driving are solid, the world often feels large but empty, missing the intentional, story-driven design that made earlier games so special.\n\nComparing with earlier Mafia games:\n\nMafia: Definitive Edition delivers a tightly crafted, emotional narrative with classic gangster atmosphere.\n\nMafia II: Definitive Edition combines cinematic storytelling and unforgettable characters with a richly immersive setting.\n\nMafia III: Definitive Edition reaches high narrative ambition but sacrifices gameplay depth and pacing, leading to a less cohesive experience.\n\nDespite flaws, Mafia III deserves credit for exploring deeper themes like racism, trauma, and loyalty with maturity and intensity rarely seen in the genre. But the repetitive mission structure and technical issues hold it back from greatness.\n\nA powerful story trapped inside an uneven game.\n\n6/10 – Respectable ambition, but not the definitive Mafia experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a little clunky, I'm not far into the game (finishing up Thomas Burke) and I can kind of see why people say the missions are repetitive. However, I'm still having a lot of fun. I do wish car customization/fleet vehicles could include the more common cars and not necessarily locked behind quests, but there are mods for that. Speaking of, such a shame the modding community for this game is so small. I really enjoy the setting and time period of the game. So far it's one of the few games I pick up where I look forward to getting on the computer and playing it! Only had about two or three others this past year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was waiting for my 2nd playthrough to write my review, but I just finished watching my GF complete her full playthrough, and I felt like now was a good time.\n\nI highly recommend this game.\n\nWhile the narrative does deviate from the original Mafia and Mafia II, this game very much holds its own in the trilogy. It has the most complex narrative of all the games. It is a revenge story against the mob, but it also utilizes the time period and southern, New Orleans setting to mix in themes of racism, corruption, and consequences. I adore Mafia and Mafia II, but if they were every to make a film of one of these games, Mafia III has to be top for consideration. It is the most cinematic and well-written script.\n\nIt tells a story of revenge, of being a Veteran returning from Vietnam. It teaches about the corrupting nature of our actions, and how our actions (even those with good intentions) can have negative consequences for people we care about (Hollis Dupree trial, for example). It really captures the attitudes in the south in the 1960s U.S.\n\nThere are legitimate criticisms of the game, which I understand. The main one being the \"repetitiveness\" of the game's main mechanic, going from district to district, attacking rackets and taking them over. While I do see where this complaint comes from, I do not fully agree with the sentiment. This game and it's setting are so immersive, it did not affect me. I kept thinking that at some point, it would tire on me, but that moment never came.\n\nInstead, I found New Bordeaux (New Orleans, 1960s) so immersive and fun, I wanted to squeeze out every possible second I could from the game. I just simply did not want it to end. I found taking each district, racket-by-racket, and choosing HOW I carved up New Orleans and WHO I gave control to for each district to be very, very fun.\n\nAdditionally, the inclusion of the three DLCs are fantastic and can be played interwoven at any point in the story once they become available. They are not too long, and they offer fantastic rewards (amazing vehicles, guns, abilities). The weed growing is fun and a great way to make additional money. The DLC stories themselves also deal with the overall game's narratives and themes in a way that serves to elevate them further.\n\nThe setting, music, atmosphere of this game is 10/10. \n\nI am from New Orleans, and I love seeing it depicted in video game media. It's such a unique and interesting city. So old, full of history, and so many cultures have immigrated to this city over the centuries, and all have left their mark on it. From Italians and Cajuns/Creole, to the Irish and Spanish. It's arguably the most unique city in the U.S., and this game does it justice. New Bordeaux and RDR2's St. Denis, gotta love them as great video game representations of NOLA.\n\nAll this to say, I highly recommend this game. It's emotional, introspective, full of fantastic characters with the voice actors giving their absolute all to every role in this game. I guarantee that if you sink yourself into this game and it's narrative, it will stick with you for a while afterwards.\n\nThis game is different than Mafia and Mafia II, but not in a bad way. While those other games show the mob wreacking havoc (as they often did in reality), it's a nice, unexpected change to see a character say, \"You know what? Fuck them.\" and force them to watch as their empire gets dismantled from under them, bit by bit.\n\nMadonn, this might be my longest review ever. \n\nAnyway, I've said my piece. Get you a muffaletta and play this like a real New Orleans paisan.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Mafia 3 is the only game where I paused the cutscenes just to breathe. The storyline is so good it made Netflix look like it needs to study harder. Lincoln Clay walks around with the confidence of a man who has absolutely nothing to lose and a shotgun that solves 99% of life's problems. The action is so realistic that after a few missions I started checking corners in my own house like I owed the mob money. Driving feels like you're either a professional stuntman or a man seconds away from insurance fraud—no in-between. And the takedowns? Chef’s kiss. Even John Wick would take notes. \r\n10/10 would join Lincoln’s revenge tour again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game's atmosphere, music, and songs were perfect. It truly felt like playing in those days. New Bordoux was very well-designed. While the story and gameplay fell short, it wasn't bad. I was expecting a game as solid as other Mafia games, especially in terms of story. But it's not as bad as people say.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After playing Mafia: The Old Country, a fourteen hour cutscene marathon pretending to be a Mafia game, Mafia 3 feels like stepping into an actual world again. And before I talk about how good Mafia 3 is, let me deal with a few of the unbelievably bad takes floating around Steam.\n\nCalling Mafia 3 “GTA” because you can drive a car is ridiculous. Saying Lincoln has “no charisma” just means you expected a Marvel quip machine instead of a serious character with weight and trauma. Crying about a GTX 1650 struggling in a big open-world game is not a Mafia 3 problem, that is your GPU waving a white flag. The people who claim they get 35 FPS on a 3080 or that the gameplay is “atrocious” sound like they either played with settings from 2016 or were too confused to try stealth, guns, explosives, or anything besides running in a straight line. And the “data mining” panic is nothing more than standard analytics every modern publisher uses, but apparently Mafia 3 is where some players finally discovered the internet collects information.\n\nNow that the nonsense is out of the way, let’s talk about the actual game, because this is where Mafia 3 absolutely shines. The story is fantastic and paced like someone who actually understands narrative structure. Lincoln Clay is one of the strongest, most believable characters in the entire franchise. The documentary-style storytelling adds tension, weight, and atmosphere in a way no other Mafia title has ever attempted.\n\nThe gameplay is where Mafia 3 truly pulls ahead. Combat is brutal, impactful, and fun every single time. Stealth works beautifully if you use it properly. Gunplay feels heavy and satisfying. Driving feels like real 1960s muscle instead of the loose toy-car feel some games go with. And the missions? Actually engaging. Actually structured. Actually worth doing. This is not a walking simulator like Old Country. This is a full criminal rise-to-power.\n\nThe world itself is alive and dripping with personality. Taking over rackets, assigning districts to lieutenants, deciding who you trust, and dismantling Marcano’s entire empire piece by piece creates a feeling of progression the series has never delivered at this scale. It feels like you are building something, not just watching events happen.\n\nAnd performance? With a Ryzen 7 7800X3D and a Radeon 7900XTX, the game runs perfectly. Smooth, clean, no issues. Anyone claiming modern hardware cannot run it needs to troubleshoot their setup instead of reviewing the game.\n\nMafia 3 is not perfect, but it is stylish, violent, story-rich, and absolutely worth your time. Compared to the confused, rushed disappointment that was Old Country, this game feels like a full course meal. Mafia 3 does everything a Mafia game should do: immerse you, challenge you, and pull you into its world until you don’t want to leave.\n\nIf you think Mafia 3 lacks something, the issue is not the game.\n\nThe issue is you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A flawed work of art - this game is infuriating because it could have been a masterpiece. The story is compelling and kept me interested to the end, the music is fabulous and the sense of immersion as you drive through New Bordeaux is a major success for the game.\r\n\r\nBut I can only assume that the developers had to rush their work towards the end, along with the QA team, because there are far too many significant bugs and unfinished features. There are train and tram lines throughout the city but no trains or trams, various shops that have no apparent purpose among other things.\r\n\r\nDespite all these faults, something made me replay major sections and repeat grinding missions so there must be something of worth hidden within the bugs. I actually thoroughly enjoyed the game play and with various community mods you can avoid some of the most repetitive missions. Despite the incredibly annoying bugs, I do recommend this game and I found the conclusion of the story to be worth the pain. I would strongly suggest that you regularly make a backup of the three savegame files so that you can restart after a bug without losing too much ground, but stick with it - there is a potential masterpiece hidden withing this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "150 years of kay kay kay just to witness the aftermath on this game is surreal,. white pipol bak then are skeri. Shiver me timbers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I loved Mafia II and when I got this game, I thought it was good too. It is pretty repetitive but that doesn't really bother me. So far, I haven't gotten any game breaking glitches, so that's good.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game, great story, really good dlcs. the game takes a bit of time to pick up its pace, but then its really good. the repeatitiveness of this game as in the reviews is exaggerated.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "NO!!!! This game does not deserve the hate that it gets at all. It is the type of game where you need to work hard to achieve something and think smartly to plan the attacks. Yes it is probably is the 3rd best but its definitely not bad. The story is well made even thos its not a fully czech game anymore. The repetitivness didnt bother me much neither. I am also from Czech republic and yes i finished this game today Mafia 1 few months ago (which almost made me cry. really the best story of them all) and finished mafia 2 for like 10th time last year. (i grew up on it). This game deserves apology after Mafia: Hovnovina came out. (yes i know what the real name is). I honestly love the game even tho it has 3rd place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've already had a hard time deciding between Mafia 2 and Mafia Definitive Edition as my favorite. Recently played this one and gameplay wise it's the best out of three.\n\nSome of the NPC interactions should have been rendered cutscenes, especially the Underboss side mission briefings, as they add a lot to the story.\n\nWish they fixed the achievement progression too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game - top notch world-building, storytelling, and gameplay all wrapped up in one. Deeply discounted on Steam sales. This one is a no-brainer. I'm buying the other Mafia games now too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just completed this game and i would say i hae always been a fan of mafia series be it mafia 1, mafia 2 or mafia 3 and anybody who loves to enjoy a great story and game i would recommend this game to them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has a massive problem with the repetitive missions, but the story was golden and had me wanting to see how it played out in the end. All the DLC were great too, one of them even feeling like a tactical espionage game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Titles in the Mafia Series. One of the best prologues I have ever played! Action packed. Good soundtrack too, unless you hate the sixties.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i find this game good but not better than other mafia games ,sure its got better gameplay, better graphic and new bordeaux is very beautiful,  but it get so repetitive and you start getting bored. me i played it with the dlc so not so much repetition and i found it pretty enjoying , the story telling was very good and story it self was intresting .\r\nIn my opinion i think it worth buying when it on sale and of course playing when you have time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far from a perfect game, but a great one nonetheless. The narrative, weakened by some of the gameplay loops, is truly one of the best any AAA game ever provided, and the way it tackles racism is damn near a masterclass (take notes, Rockstar Games) . \nHonestly, the weaknesses of the gameplay should not deter you from this experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, need more games like this, all the expansion was pretty well done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got this game for £7 when there was a sale on, so of course, that has shifted my threshold for enjoyment more than someone who spent £60. I'm also not someone who cares or even notices if games aren't 60fps and amazing performance. \r\n\r\nIt's a Mafia game, incredibly cinematic with interesting, flawed characters. The format of the storytelling being a documentary about the main character is cool from a storytelling point of view - but quite a few times it does spoil the fun from a gameplay point of view. You're just starting to have fun and then it cuts to a talking head interview. \r\n\r\nOverall, if you liked Mafia I and II because of the storytelling and the period environment, rather than just because you like that era of gangster movies - then I think you'll enjoy this game. Maybe wait until the next time it goes on sale. If you're wanting mod bosses and tommy guns, then you'll hate this.\r\n\r\nI'm only 3 hours in - so I'll update if I encounter anything that ruins the game for me. But I've not had any performance issues or anything that has been noticable to me. Same for all the bugs mentioned in other reviews, at one point, a stool in a bar decided to start vibrating and bouncing around the floor - but other than that, nothing too dramatic.\r\n\r\nThe music and the timing of the musical cues is brilliant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok, so all the negative reviews are not telling the whole story, nor are they accurate because many reviewers have had CTD's and failure to launch issues. DO THIS IF YOU CAN'T LAUNCH THE GAME - find your game EXE and open it's properties menu, then the compatibility tab. TICK the checkbox 'Disable fullscreen optimisations'. This is NVIDIA's fault and the game is too old for them to give a damn. Also tweak the graphics to get the game to run better (turn the FPS setting down to 30FPS as this game was a port & turn off bloom - I do none of this using a i9 & RTX4080super) It also helps to smooth out the driving if you drive in 1st person view.\nThe Game: Is a realistic environment in the Bayou during 1968 including Racism! so be aware of that if you get BUTT-HURT easily. The main character Lincoln Clay, is very much like Franklin from GTA5, and the city, country and atmosphere is also very 'GTA-like' but with old classic cars and guns etc - all upgradable. And those cars can be stolen and/or earned, cops hate you just for being black/mixed and will stare at you just walking by them, hang around & they will shoot you. The local yokel-rednecks also dislike you but will not attack, the Irish will get along with you, and you do some work for them. The MUSIC is all licenced and you may find yourself just sitting in your car listening for an hour!\n\nGet this one if you can handle the issues above, and love a good story. (It does get repetitive but so do most games these days)\n(remember this: alligators will hunt and eat you, but also make for a great body disposal lol)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this game 10 years after release, I think it's much better than people gave it credit back in the day. Repetitive and similar to plenty of titles that had the same open-world concept. But still under the hood it has its charm, and interesting story. Although, I prefer definitely the direction which originals and Mafia the Old Country went. If you have spare time and can get the game in good discount, like I did, it's still worth it and it's fun to play :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not that hard or too bad to play. once i learned how the game played it is easy. not the best mafia game but not the worst",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 3 is unexpectedly a decent enough game to try and beat. Since its release, it has not been favored among some Mafia fans, and it's viewed as the bottom of the three (probably better than Mafia 4 now, since its recent release). I'll say this: when I started playing the Mafia games, I knew of the warnings the fanbase had with this third installment, and I kept some low expectations from things like technical glitches in the game causing assets to not load properly, to downright crashes, all the way to the narrative of the story. I will say, there has been an effort made when making this third game. The world is humongous, attractive, and very interesting to explore in pretty much every aspect. Without spoiling much, one thing that took me off guard is the simple perspective that this does not feel like a traditional Mafia game. It's just me, but when I was thinking of Mafia games, I was thinking of the Italian New York and Chicago-like settings from the previous games, with more Italian mob family struggles. Having the story take place in a late 60s New Orleans southern setting with a PTSD infused Vietnam vet seeking revenge against racist white people is definitely new... It's pretty much a Vietnam Rambo Assassins Creed Hill-Billy Redneck slaughterfest simulator. It's not so much Italian but rather, as the game puts it, \"Dixie\". You are against the Dixie Mafia, essentially. There are elements that connect to other games that answer questions, but I wouldn't be surprised if it alienates the fedora-and-trenchcoat fans out there who were seeking something else. That being said, it's still not a bad game, and it is definitely a good decade to visit mob life. I liked all the characters, the classic rock music, and the overall soundtrack slaps as to be expected, the driving and the vehicle selection is definitely improved, and there is overall a lot of customization in the character and weapon design and various perks given to you in different stages of the game that make playing the game very creative, goofy, and fun. Really gives me the Assassin's Creed vibes in some ways. There are a lot of things to do in this game, from racing to the very interesting DLC missions you encounter. While this game is so long to beat, I have to reiterate that the game devs did put a lot of love into this project so it is work a playthrough. We shall see how Mafia 4 stacks up against the rest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am really surprised I am writing this review but even though I started off hating this game I really got into it. At first the cutscenes annoyed me a lot because they were so frequent and the gameplay was pretty mid. But I got kind of addicted to trying to stealth the missions. It’s pretty fun to melee kill an off guard enemy and headshot everyone with the stealth pistol.\n\nThe Pros; the game is fun to stealth, the driving actually felt pretty good to me most of the time… I finished all races in first. The DLCs are short but fun so far, I only did stones unturned. Some characters are well made, but all are a little cliche. Some cutscenes are pretty entertaining. I like to customize my cars.\n\nThe Cons; Here is the one that pisses me off the most to start, why the hell are benches, light posts, transformers, and trash cans all destructible but hitting a bush is like running into a parked freight train… the hell bro? It rains in the city way too fucking much, it’s like every other day. Cutscenes are often too frequent and annoying and mixed in are immersion breaking ones where my character switches outfits. Even though in the same chain he will sometimes be wearing one. The language in this game holy, I got a sailors mouth and this shit makes me cringe. It’s g*d damn this g*d damn that n******r this n******r that and every other racist scummy thing. Sometimes I kill people and they freeze animation. Also a major problem that’s not too bad because of auto saves is major glitches that stop gameplay like not being able to talk to someone or a missed npc animation like opening a door, but reloading last checkpoint has always fixed.\n\n\nAnyways I bought this for friggin 6$ it’s a steal at that price and it’s 10/10. But at full price I’d give it a 6.5/10. Recommended on sale for sure!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This story deserves an oscar. Really enjoyable storytelling. Despite some bugs I came along, the gameplay was also original and advanced. Enjoyed the return of some familiar characters from old games. Absolutely recommending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keybinding capslocks as default almost made me not recommend this, some real space cowboys on the dev team.\n\nGrab on discount for the awesome soundtrack (\"all along the watchtower\" as the menu screen, had me pumped before pressing start), decent driving mechanics and solid story.  \n\nCombat is largely distilled into sneaking around and using a silenced pistol that one (head)shots and is available at the start of the game. In contrast, a sniper rifle requires you to click an additional button to enter scope mode, then press shift to time holding your breath, to then deliver a shot that will probably still miss the target, do less damage than the headshot pistol, and alert everyone and their grandma to your presence. They managed to make both the newer tommy gun (Trench 1938) and sniper rifle lame, shame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good:\r\n- Story was great, typical Mafia revenge story. Even though the MC is not Italian, it is definitely a mob game.\r\n- Gameplay was fun.\r\n- Graphics are great - it still looks good in 2025.\r\n- Driving was also very good.\r\n- Soundtrack is basically greatest hits from this era.\r\n\r\nBad:\r\n- Repetitive side/main missions - it feels like the game drags on a bit. The main story is divided in stages and you have to slowly take over the city. It feels like there is a lot of filler here.\r\n- Too much driving - even though I enjoyed driving, a lot of the game is \"drive here, talk to this guy, drive there, shoot these people, drive back, talk to the guy again\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels unfair that this gets such mixed reviews. Certainly, it's overlong, can get repetitive, and is occasionally buggy. And if you're expecting a re-run of the first 2 Mafia games, it's different. But it really drew me in, and I kept coming back for more until completion. On the whole, I enjoyed the hell out of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "doesn't deserve all the hate it gets\nit's not the best open world game\nit IS highly repetitive which I enjoyed however because the gunfights are fun and satisfying\nstory is decent \n\nI couldn't recommend this game to all but \nI just wanted to make clear it's a decent game for some\nonce again this game doesn't deserve all that hate shown above in the reviews",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From first starting it few years and getting bored to now loving it. Cant say what it is. Its buggy and requires often restarts and looks like garbage most of the times, but boy is it satisfying to play and the story is actually interesting. Big grindy, but it does reward it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game got the original game in 2016 then got a Steam Deck and decided to replay the game.\n\nedit finally finished it have played all dlc i still play this game almost every day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8.5\\10\nits a great story, great narration, all good\nthe only thing is it feels repetitive , but still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT BUY FOR FULL PRICE | DO NOT BUY IF YOU WANT ALL ACHIEVEMENTS\n\nWhew, what a game! I was kinda 50/50, because I am an achievement hunter and there is the big CON for this game: Some achievements do not track progress, which means you gotta grind them in ONE playthrough. Which is big bullshit and almost impossible if you dont care about letting your PC and the game running 24/7 until you finished the game and got all achievements... \nMissions also get kinda boring, because you basically do the same over and over again, just in different locations.\n\nBut now the Pros:\nGreat story and great music! Even though it gets kinda repetitive after some hours. \n\nBecause the game is on discount quite often for like 3€ (or even cheaper if you get the bundle), it is the only reason why I give thumb up. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia 3 was fun—I enjoyed it. Lincoln is a cool character to play, and his story is actually really interesting. Gameplay-wise, it’s a bit repetitive, but overall pretty good. The game itself is a 7/10; the 100%, however, was not fun—4/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just too many bugs all known and well discussed around the internet.  No fixes by the devs, just work  arounds that sometimes work and sometimes do not.  Play the other 2 and just skip this jankfest.\n\nI wanted to like it I thought the story was an interesting twist, but it just sucks so badly.\n\n---\n\nUpdate - ok so I watched all the videos and read all the ways to fix the MANY MANY bugs and I got through this because I thought the story was interesting.  As such despite the massive amount of bugs and HAVING TO WATCH 15 ******* minutes of credits (wtaf), I am going to say that this might be worth it if you get it at no more than a few dollars.  It is old tired and buggy, but the story while simple is pretty good, as good as the other films.\n\n5/10 on its best day and deepest discount",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated game.\nThis game has one of the best, most fun and satisfying shooting mechanics and driving physics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good campaign, the missions are a bit redundant bt overall its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has one of the best, most fun and satisfying shooting mechanics and driving physics in open world games, quite boring story and absolute terrible performance and stability. Story for about 45 hours took me over 60 hours because of all bugs and crashes I had to overcome. When I've finished it I was so damn happy, it felt like completing some type of Armageddon Run and I've made it alive. Would I play it again? No. Do I regret playing this after so many years hanging on my backlog? Not either. Can I recommend this? Well, it's not for everyone. You really should want to play this exact game to enjoy it and you should know about technical issues beforehand. So I'd say it's up to you.\r\n\r\nP.S. I had to watch all cutscenes on youtube as game freezed my screen on first frame 90% of time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs alot smoother than on ps5, only few hours in but hope its not filled with as many bugs as there was tons and even game ending glitches, fingers crossed it wont be same here on steam. graphics are 100x better too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fully finished the story, and honestly, it turned out way better than I expected. A lot of people said this was the “worst Mafia game,” and not gonna lie it's not that bad, at first I kind of believed them — but after sticking with it, I actually ended up enjoying it a lot more than I thought. \n\n✅ Driving & Setting\nThe driving in Mafia III is super fun probably one of my favorite parts. Cars feel heavy in a satisfying way, and drifting around New Bordeaux at night feels amazing. southern US vibes is cool and atmospheric, even if the world isn’t as interactive as other open worlds.\n\n Mission Structure & Perks\n\nWhat I liked most was the way missions are divided into rackets, underboss territories, and district takeovers. It makes progress feel rewarding.\nAnd the perks you get from underbosses? Another nice touch that adds strategy to how you want to play.\n\n❌ Repetitive Missions\n\nPeople weren’t wrong about this part. At the start, I immediately noticed the repetition, and honestly, I regretted buying the game during my first two days. A lot of missions follow the same pattern\n\nKill a lieutenant\n\nDestroy property\n\nInterrogate someone\n\nRepeat\n\n\nBut… once I pushed further into the game, it actually grew on me. The repetition became less annoying as the story and characters pulled me in.\n\n❌ Minor Bugs\n\nI encountered some small but annoying bugs:\n\nPrompts telling me to “Press X” wouldn’t work\n\nMission markers that became unresponsive\n\nNeeded to reload saves to fix it\n\n\nNot game-breaking, but definitely irritating.\n\n✅ Graphics & Atmosphere\n\nThe graphics are solid — not the newest or sharpest, but very stylish.\nBut the rain? one of the best I’ve seen in an open-world game. The reflections, the mood, the way the city looks during storms Mafia III absolutely nailed that atmosphere.\n\nHonest opinion \nMafia III is far from perfect. It has repetitive missions and some bugs. If u alr play the first & sec mafia. Maybe u wont like it much since its kinda diff. But if you stick with it, its act not that bad and its fun and cool experience underneath. The driving, characters, and setting really carried the game for me, and by the time I finished it, I was glad I gave it a chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I held off on buying this game based on the mixed reviews but when it came up on sale for £2.49 I figured that was as good a time as any to give it a try for myself.  \r\n\r\nHonestly, £2.49 for this game was an insane bargain!  \r\n\r\nIt looks great, even for a 9 year old game!  The game world looks great and the cutscenes look amazing and are really well acted.  \r\n\r\nOne thing that was always brought up was the soundtrack but I wasn't quite prepared for just how many dead-set bangers this game served up!  I don't think I've ever played a game with such a brilliant set of licensed music in my life, and the way they use certain tracks for key moments / missions / set-pieces is sublime!   \r\n\r\nThere's a good cast of characters, some who I liked and some who I,,,tolerated...but they had their uses and that's fine; not everyone is there to be liked.   \r\n\r\nSpecial mention must go to the Faster Baby! DLC which, as well as giving us a very sweet car (the game's El Camino equivalent, the weed-growing side-gig and a very useful silenced SMG, it was also several barrels of bonkers good fun to boot!  I was grinning like an idiot throughout most of the missions in this DLC!  \r\n\r\nDonovan's DLC is more serious but is also a really compelling and exciting story with some great set-pieces.  \r\n\r\nI still have to the Preacher's DLC but if it's as good as the other story DLC's then I am up for it!  \r\n\r\nThere's also a lot of other nice touches and details hidden throughout;  the headlight covers on Lincoln's Drifter operating at night, gear changing animations (so many games don't bother), the rear view mirror feature, the virtual roadsigns that appear at intersections so you don't have to keep glancing at the mini-map...and so on...\r\n\r\nI'm sure there's other stuff I missed but rest assured I loved this game and I aint done with it just yet!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A terribly undercooked and a little bit underappreciated game. I don't know if I'd ever get into it and manage to stick with it for as long if not for my absolute love for 1960s stuff. The story is pretty great, some of the cinematic moments are just awesome, many of the characters I think are fun and well written. The city is well designed and detailed, satisfyingly big and complex. There's a lot of attention to detail in general. The nostalgic 60s atmosphere is just oozing out of the screen.\nI think devs really cared about this game, but bit off more than they could chew. Some things are just clearly not fleshed out. For example anything related to car combat and car chases is incredibly frustrating. More often than not you have your tires shot out and get dogpiled by guys with shotguns and automatic weapons in seconds. Running away from cops in a car is extremely hard cause the game spawns cop cars in your way, restoring the heat. All shops have icons matching their trade, which makes it look like there was supposed to be more nuance to them than just having a robbable cash register, so I imagine they planned for them to let you buy things like in Mafia 2 but scrapped it. Also pretty sure there were supposed to be trams, but were also cut from the final product. The night vision scope on that one late game rifle is completely useless, it's too bright even at night. The only thing that saves this weapon is that it's very accurate in the regular aim mode.\nThere's much more but I don't wanna sit and recount everything, who's even gonna read all that?\nI'd recommend to buy it on some sale just for the story and vibes. Also I'd recommend to wait through the first bit of end credits. It's short and worth the hidden scene.\nOh also the mini campaign with the nuke is more fun than it has any right to be imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a double edged sword, it looks amazing even to date imo. The story is really well told, gameplay is fun and as always with mafia a great soundtrack. The downside was setting up the takeover of racket bosses felt tedious and there are so many of them. Overall good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the games a 8/10. the story is good the character too. the graphics are great too. the only thing that makes it slightly boring is that we have to take control of the districts and thats a long day. other than that its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is just the Punisher set in civil rights america in the deep south and I mean that in the best way possible. I enjoyed the hell out of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on deck, and it ran great. The game, for what it is, is rough and repetitive. Get it on sale usually like $3, and just think of it as a punisher game and you'l have a good time. Driving is solid, shooting is fine. Executions although really abundant and not many variations are still cool. \n\nMoral of the story, just get on sale and go in with minimal expectations, and you might just find yourself having some fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my favourite in the series from the ones I have played. Gets a little repetitive, but delivers on the vibe and tells the tale of revenge well. Make sure to limit the FPS and disable V-Sync to prevent physics shenanigans however",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow it was perfect\r\nthe only think bad about this game is it's repetitive gameplay but it was worth it\r\nthe ending (at least the one i chose) was really good and [spoiler]on the mission where you kill sal i was so happy to see joe alive omg he is alive and is leo galante's driver[/spoiler]\r\nalso don't miss the cutscene that plays mid credits",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No a traditional Mafia franchise game, most of the gameplay is easy to enjoy, very good acting. Wish there were better weapon options or mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not without its bugs and glitches but if on sale and into the mafia franchise, give it a go. It ain't all that bad!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Repetitive but stealth crossed with brutal takedowns is addictive, Music and story line is very good!\nShame to have completed it 8/10 overall Would play again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story is good, gun game is decent, NPC is blind as a bat, driving is bias on controler lmao.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i ever played, i bought it in a sale for only 3 bucks. Normal its like 30 and it is worth 30 bucks i highly recommend it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☑ 7\r\n☐ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, good quality and best story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but after playing it twice its the worst out of the mafia games theres so many missions  that are exatly the same after awile its boing but the end is great so its like a 7.5 out of ten",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: Mafia III tells one of the best stories in the series, with great characters, atmosphere, and music. It was once called repetitive, but on replay, it shows real depth through its world, missions, and design. The city is beautiful, the cars handle wonderfully, and for me, it rivals Mafia I in storytelling while finally giving Vito from Mafia II the justice he deserved.\r\n\r\nWhen Mafia III released in 2016, it was ambitious, with a fresh setting, a new protagonist, and a deeper social backdrop. Set in New Bordeaux, a fictional version of New Orleans, the game replaced the classic mob romanticism of Mafia II with the raw and turbulent reality of 1960s America, filled with racial tension, political corruption, and the echoes of the Vietnam War. \r\n\r\nI remember everyone, including my younger self, saying the game was repetitive. And yes, some objectives repeat, but playing it again now, I see things differently. The game is well crafted, and even when the mission structure follows a pattern, the city itself keeps everything fresh. New Bordeaux is stunning, full of character and detail, with each district feeling alive, from the neon glow of the French Ward to the muddy backroads of the Bayou. The mission buildings have personality, the interiors are varied, and the atmosphere pulls you in every time.\r\n\r\nDriving through the city feels fantastic. The cars have real weight, the handling is smooth but heavy in a satisfying way, and the period design makes every vehicle feel authentic. The sound of engines, the way the car slides through corners, and the look of the rain-soaked streets all make New Bordeaux a place worth exploring, not just a backdrop for missions.\r\n\r\nTo me, Mafia III rivals Mafia I when it comes to storytelling. I really like Lincoln Clay as a character, just as I liked Tommy Angelo. Both are grounded, human, and shaped by their choices and the people around them. The game also gives Vito from Mafia II a fitting continuation, finally showing him as the veteran mobster he was (maybe?) meant to become.\r\n\r\nThe cinematic presentation and soundtrack, featuring Hendrix, The Rolling Stones, Creedence Clearwater Revival, and many others, perfectly capture the mood of the era. The Definitive Edition from 2020 didn’t bring major changes beyond visuals and DLC integration, but it still holds up because of its powerful narrative, atmosphere, and attention to detail.\r\n\r\nIf you play Mafia III today, do it for the story, the city, and the experience of living through its world. It’s a game that grows on you, one that might have seemed repetitive at first, but with time, shows how carefully it was built and how much heart went into every part of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok. I get to shoot people so yeah thats fun. but its no mafia 1, game doesnt really have notable characters besides vito.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The opening scene is terrible! Hard to tell if your making progress; lost of repeat scenarios, missions are pretty much all in the same locations - over and over again. Graphics are great once you adjust the heck out of the game. Its really difficult to make money (at least enough to be of any use). The story seems to be sort of stuck in a revolving endless and mindless barrage of stealth and really confusing objectives. When you think you have completed an objective, you end of realizing you are going back to the same locations just to do the same objective again. Except for the main character, the others are really just \"fillers\" - no real connection to them. All said, I still would recommend the game to anyone who wants endless hours of play. There is no limit to side missions and such.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game appears to be the least-enjoyed installment of this series and I can understand why. This was actually the first game in the series that I played and, at the time, I was looking for something to play that might resemble GTA V. Well, they certainly succeeded in emulating an open world akin to GTA but the mission are a bit redundant. I found myself having to repeatedly drive across town to collect payments and meet with mobsters. The setting being in the sixties and in a town resembling New Orleans truly serves the story of a black soldier returning from Vietnam to experience the racism of the south. I had so much fun shooting bigots as they shout racial epithets at me.\r\nI really enjoyed it immensely but the producers obviously learned a lesson about changing up a beloved formula.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jack old ladies in the face and slam cops to the ground. What a time to be alive. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10 - This is a very transitional game in my opinion and is kind of the culmination of the late 2000s and early 2010s subgenre of open world GTA clones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New Orleans in the 60s is just fantastic. Killing kkk and dixies is pure bliss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good reminder of american social history of the south back in the hippie era.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mafia III — A Journey Back to 1968\n\nMafia III is a trip back to 1968 — the turbulent years of the Vietnam War. The story begins as the main character returns to New Bordeaux, a fictionalized version of New Orleans, seeking revenge for the brutal murder of his surrogate family.\n\nWhen the game was first released, it faced major criticism for its poor performance and overall technical execution, despite being built on the Unreal Engine. The newly formed Hangar 13 team struggled to fully realize their ambitious vision. They couldn’t quite deliver a true open-world experience, but even so, Mafia III managed to shine in certain aspects that left a lasting impression on me.\n\nWhat truly inspired me was the atmosphere of America in the late ’60s — the soul-stirring blues and rock soundtrack, the humid southern nights, and the richly detailed streets of the American South. The vehicles felt diverse and authentic, the gunplay was satisfying, and the story of vengeance kept me deeply engaged. Not all the characters were great, but some were incredibly memorable and well-written.\n\nYears later, after replaying the game on powerful hardware capable of running it at 144 FPS, I was finally able to appreciate its strengths and weaknesses in full. And despite its technical flaws — like the bizarre limitation of not being able to climb out of water onto land (seriously?) — I found that the positives far outweighed the negatives.\n\nI’d still recommend playing Mafia III, if only to experience its unique atmosphere — the damp, cool nights of Louisiana’s swamps, the rhythm of jazz echoing through the streets, and the sunlit avenues of New Bordeaux filled with life and soul. It’s a flawed masterpiece, but one that captures a time and place like few other games ever have.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "if you savor the opportunity to get revenge on racists this is the game for you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ITS REALISIM IS BETETR THE GTA 5 AND BETTER STORY MODE AND IT SUCH A GOOD GAME AND CHEAP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way too manu bugs, here are some I've encountered: Lincoln turned invisible. Car flipped around a corner and can't climb onto the car so had to rewind. After talking there's no starting mission, so had to restart game(This is the most annoying part) People stuck in cars and makes hella noise almost crashed my PC...... and so many minor ones not worth mentioning. Also too much driving around and gives me kinda Ubisoft farcry vibes, legit. But since the music is good I don't have much to complain.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The story of a man who's really mad at the mafia... And also likes to drive a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a vrey fun game i just wish some of the sounds e.g. the car's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played from 2K. Recommended for GTA players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "setting and gameplay is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and engaging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, solid story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ten bucks for 35 hours of content. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story climax I love the most, and fight squeal is 👍🏻",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as repetitive as people say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shockingly good despite the repetitiveness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, arguably the most fun in the OG trilogy....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "verry addictive ! loved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cheese and crackers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hated on for no good reason",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not the best but it is ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah! great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Family is not who you're born with, it's who you die for.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good ahh game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game **ONLY ON PC**",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very definitive",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "mafia 3 is sadly the worst mafia game in the entire franchise and it's not even close, this game is the definition of wasted potential and it's such a shame because I really like the setting and Lincoln Clay as a protagonist but the gameplay loop is atrocious and that alone is a huge turn off.\r\n\r\nI've already forced myself to finish this game on console since I love the Mafia franchise as a whole but this game is just not it, it's a genuinely terrible videogame and I do not recommend it at all.\r\n\r\nMafia 3 is worth 5€ at best and even then that might be too much for a low quality game, I don't know if I'll be able to complete this game for a second time, maybe in the future if I've got the patience for it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game crashes to desktop without errors. Unsure why this is available to be purchased as the game is unplayable. This should be removed from the store.\r\n\r\nThere are not patches or fixes for the crashes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is extremly repetetetive, it ditched the linear MAFIA style story line and it's basically GTA SA, you going around taking city parts and it's always the same : go kill, get info, destroy something and make damage for $$$, story is not great not terrible just classic revenge driven, the DLCs are okay. It feels like they spend 90% of the budget on music which is fantastic (but sometimes placed wrong type of music for the action) and didn't have money to do good gameplay.\n\nStory 7/10\nGun Play 5/10\nDLCs 5/10\nGameplay 2/10\nMusic 10/10 \n\nOverall I would do  4/10.\nBuy it on sale and play the story.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "2.5 / 5\nThis does not follow the same style as the previous games and feels 'open world' for the sake of being open world opposed to driving the game. The characters are alright, but not as good as previous installments, and the gameplay feels more like GTA than Mafia. I found myself repeatedly wondering why I continued to play, until I decided that its just not that fun of a game for the time it makes you spend travelling around the map doing the same thing over and over again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The good:\n\n[list]\n[*]Great voice acting and 60s atmosphere/soundtrack\n[*]Satisfying gunplay and driving mechanics\n[*]Interesting characters (happy to see Vito Scaletta again, although he was pushed into a one-dimensional supporting role)\n[/list]\n\nThe bad:\n\n[list]\n[*]Technical problems: crashes, infinite loading screens, and graphical glitches and bugs throughout my playthrough. I lost count of how many times I had to restart the game or reload a checkpoint. It almost made me hate “All Along the Watchtower.” Almost.\n[*]The main story is told in a very scattered, unfocused way. It’s buried under an endless pile of repetitive side missions.\n[*]The gameplay loop becomes tedious after a while. It has that “liberate outposts” feel, which is a Far Cry™ from the previous Mafia games. Locations and layouts are also reused way too often.\n[*]On normal difficulty, you die way too quickly. A couple of bullets and you’re dead. Tac vests might as well be made of paper.\n[*]Cops are on cocaine in this game. The slightest bump into a car near them and the whole department will chase you to hell and back.\n[*]Some DLC missions, like bounty hunting, are borderline unplayable and incredibly frustrating to complete.\n[*]Because of the sheer amount of driving, the radio songs repeat a lot. You can only listen to Jefferson Airplane or The Rolling Stones so many times before turning the radio off.\n[*]This game doesn’t seem to work properly with a PS5 controller. I had to troubleshoot for an hour before I could even start playing, and even after that, the controller stopped working regularly. From what I’ve seen, I’m not the only one with this issue.\n[/list]\n\nThis was not what I expected at all. The previous Mafia games had tight, focused storytelling and well-paced missions. Mafia III feels more like an abandoned Ubisoft open-world project that got rebranded into a Mafia title.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When i playing this game I am feeling like playing not Mafia, i feeling like i playing GTA. But unlike GTA, Main character has 0 charisma, physics is bad, optimisation is bad and NPC's artificial intelligence is bad too. I have 45 fps with bad frametime with GTX 1650 on LOW graphic preset, Mafia remake was better",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Mafia III: Definitive Edition is flawed attempt to polish a deeply ambitious crime saga — but it often stumbles under the weight of too many glitches. The open-world gameplay is repetitive, and technical bugs — including frequent crashes — can break the flow. The story is compelling and the setting atmospheric, but the achievement system is a real pain, many achievements are bugged and only reliably unlock if you play the entire game in one sitting without quitting. \nCant believe they didnt fix this\nTrash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mafia 3 is the game that after playing it I went to bed or watched YouTube after 2 hours. Objectively speaking about its minuses, there are a lot of them, first of all, it is of course its graphics, the game was released in 2016 and it looks very expressive, seriously even the 2020 reissue does not help. Secondly, the problem is the main character, Lincoln Clay loses a lot against the background of Vito and Thomas. Thirdly, it is the core gameplay, which is tied to the capture of areas, like what the hell, I went to play Mafia, not Far Cry. They also took away some mechanics that were cool in the previous parts, for example, the ability to turn on the speed limit so that the police wouldn't stop you or when in Mafia 2 you had to change the color of the car or if you were visible and your clothes so that the police wouldn't search for you, this is not there here and it's sad, it was replaced by slowmo while driving and shooting and the ability to call a car, a car with an arsenal and the ability to put money on the account.\r\nBut you also need to highlight the pluses, which unfortunately are not very many, for example, some story missions, such as Vito's quests, but the problem is that most of this is the merit of the second part. Another plus is the music, hearing Johnny Cash or the Rolling Stones is very cool, well, but this is not the merit of the developers. I also definitely want to highlight the final conversation with Don Marcano, it's incredibly cool, but presenting this conversation at the end of Mafia 2 would have felt a million times cooler. This game could have been many times better and the fact that it turned out like this is sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would have left the positive review, if not for the technical state. Numerous bugs, freezes, and missions not activating unless you close and re-open the game. For a definitive edition, it is unacceptable.\nInitially, I was skeptical about the negative reviews and overall negativity towards Mafia 3. However, after about 30 hours in the game, I realized they were mostly correct. The open-world formula is tricky to handle, and Hangar 13 did all they could to make it work; however, it still becomes a very monotonous grinding experience by the end of the day. If the game had only the cut-scene missions (that's about half or even one third of the overall volume), the game would have felt much better, but as it is now, it is very boring. \nThe story is good and promising, but without a deep focus on the main characters, it lacks refinement and development.\nMany believe that Mafia in the title is unnecessary, and I tend to agree. It took me a while, but I understood the essence of the games that Mafia represents and are still critically acclaimed: the constant presence of the organization, your \"colleagues\" and \"friends\" in this dangerous business. In Mafia 3, you are basically Tommy Vercetti or the guy from GTA 3 who is integrated into the Godfather 2 gameplay - a one man army, not the part of the organization. So it is truly not The Mafia many come to know and love.\nBy the end, the game would be simply mediocre at best, but the technical state gets it into the bad category with an awesome soundtrack.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This garbage shit doesn't support any controller of PlayStation, like DualSense or DualShock 4. Steam Input doesn't help, I have to install 3rd party software like DS4Windows to play this shit? no thanks. Even Mafia I, Mafia II can support my DualSense with Steam Input, but this game? nope. It's definitely worth my negative review",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "meh, gameplay is repetitive, go to X location on map, do the same objectives, \"fight\" 2 underbosses, \"fight\" boss, gg go next. (fight = kill generic ai, injure boss & interrogate)\r\n\r\nbuggy as fuck... game sound will randomly break in a variety of different ways, characters you need to talk to can't be interacted with, side \"missions\" (which are just vehicle fetch quests\" won't register completion, pedestrians jump into the road???\r\n\r\none of the dlcs is horror themed for some reason & it's boring as fuck, barely develops & feels so unrewarding in the end",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game breaking bugs galore - barely worth the discounted 4.99. badly made and badly written",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very horrible game has lots of problems could not even play a couple hours",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "being a big fan of the mafia games i was excited when this game was announced after playing mafia 1 and 2 for so long and when it came out it was buggy and too this day even on a high end gaming pc i still get crashes and errors \n\nthe game is just way too run and gun over and over the story is janky at best had potential but was doomed by the lack of gameplay over all i cant reccomend this one to anyone \n\n\noh and its locked to 60fps",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, if you have a console. Absolutely terrible controller support. I'm honestly not surprised given that 2K pretty much half asses anything they do. Every Mafia game on PC is janky in some way. Great job, morons.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dogshit clunky game. Not worth any sort of money. controls clunky, gameplay clunky, mechanics clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2nd worst game I've played in 2025\r\n\r\nThe game play is ok..... mid at, driving is good and that but the graphics and the copper tint is awful and probably one of the reasons (First time) that I had to stop playing a game cause of the weird tint and how bad it looks.\r\n\r\nThe story is mid and the constant racist talk between blacks and whites is just immersive breaking. When the game starts off with oh this is our history and how ashamed we are, well you know you are in for a treat and in my case it fell off rather quickly.\r\n\r\nMissions are repetive and I personally didn't mind, probably the only positive BUT with a lot of other factors it's hard to recommend such a mid game.\r\n\r\nMafia 1 remastered clear of this garbage\r\n\r\n*I almost forgot to add that in order to play the game fullscreen you will have to use NoMoreBorder as putting the game fullscreen made the game feel like I was playing in 60 or below fps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I still haven't finished it. I loved Mafia 1 and 2 so I was excited to see what this game had in store since it was newer. The story is intriguing but I can't get myself to get through it since the gameplay is so repetitive and tiresome. You go talk to someone, go sneak around an area, take out the bad guy, go back speak to someone again and rinse and repeat so far for every mission I have played. It just isn't fun other than the rare story missions that have character like the first mission where you rob a bank, that was fun. The game feels less like Mafia and more like a GTA clone. The collectables are the same collectables from Mafia 2, they couldn't even put new ones in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Look it isn't a terrible game and I will likely finish it. But it is very repetitive. It reminds me of all of the horrible trends in open world games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the Mafia II so I decided to try out this out but its definetly not worth it couldnt even finish this game because how repetitive and boring it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was really disappointing is in almost every way a downgrade from mafia 2, worse story, a lot worse graphics and worse controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3/5 Kinda boring and a slog.\nMafia 1 and 2 had clear fun missions or mechanics while this games best thing is the ambiance of being a snapshot of New Orleans and the 70s its not enough.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is bad\n- Mission keep replaying ( Assasination / Steal Car / Destroy something )\n- Alot of bugs ( Randomly object flying, mirror glight, ... )\nOverall, you buy the bundle for full mafia, don't play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sloppily made, rushed or ported, this game crashes all the time and has a lot of game-breaking bugs. I think it says a lot that it's just one more title treated as slop to be shipped and printed, zero respect for the story or the message made by the writers, which is admittedly very good, but buried under a mediocre game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A million years after its release, the game still has critical bugs. It seems like the game needed an extra six months to a year of development/support, but they happily gave a big black dick to that. You get high on the music and vibe. You get fucked up by the post-processing, shadows, and repetitive gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the world is absolutely dead, you can just shift+w sprint and Q everyone for face down takedowns on \"hard\" difficulty, civilians dont even call the police lol\n\nalso, there is like 5 cars that exist in the streets, which is extremely noticeable form the start, for a 2020 game that is just pathetic...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1] [b] If you have NO LIFE, you better play Mafia 3 [/b] [/h1]\nOne the most [b] Repetitive & Obnoxiously Implemented Mission Design Ever! [/b] Every next mission you'll play in this game is going to be [b] EXACT [/b] Replica / Copy-Pasted version of previously played mission, like what the hell was that formula? Hanger 13? I refuse to believe Mafia 3 was made by same people that worked of Mafia 1 & 2. Like what animosity is this? This game is prime example of how brilliantly you can ruin a game with huge potential.\n\nI tried so hard not to hate Mafia 3 The Game itself is NOT bad, no hatred for voice actor & character of Lincoln Clay, he is [b] AMAZING [/b] character but he got the worst & awful game, this game has [b] ZERO Mafia touch [/b] Just poor rip off of GTA formula even drive slowmo feature which Franklin uses in GTA 5!  Unfortunately Mafia 3 has no its own identity like previous two Mafia games had, there was always something to remember about Tommy Angelo or Vito Sceletta but here Lincoln is forgettable very easily and talking about Vito, Mafia 3 literally milks him in this game so much like why? it's good if he had made a cameo but nah!... With his presence Lincoln's significance is greatly reduced.\n\nSame repeated missions is biggest flaw of this game & awfully tedious, forgettable main storyline however DLCs were fun specially [b] Roxy and Donovan [/b] they had somewhat touch of Mafia taste but [b] Anna DLC [/b] is pure laughable like OMG a poor victim girl under cult being abused blah blah like what is this? [b] Are playing Mafia or Far Cry 5? [/b] Where did this cult thingy come from? However This game has [b] banger SoundTrack [/b] I'll give you that!\n\n[h3] [b] Mafia was always about Politics and Betrayal [/b] [/h3]\nSadly this game fails at both. \n[i] [b] (This game has been rotting in my library ever since I bought it like 2 years ago it's that repetitive) [/b] [/i]\n\n[h1] [b] Absolutely NOT Recommended 1/10 [/b] [/h1]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Leave it to Ubisoft to seriously fuck up gameplay of otherwise decent franchise. Story was interesting, goes right into the ugly history of America. But the gameplay is so fucking bad, it raises my blood pressure. Just classic Ubisoft garbage, to rush things, and give us half-finished products full of bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No ultrawide support, and the cutscenes/map/game menu is fucked with ultrawide.\nUnable to progress through the first 10 minutes of game where it asks you to use the map to set a waypoint, as the map controls/menu buttons are all hidden/justaposed on left side of screen...\nThe Mafia trilogy was a waste of money.  Mafia 2 was OK, other 2 are not worth playing in 2025.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot play it, because the crashes dont stop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wow, my memory has been too kind to this game lol. I thought It was bad with how repetitive it was, but NOPE, SO many bad things. It sucks, cause the ideas, premise, setting, are all there, but the execution ruins it. \n\n- Graphics is WAY too bad for a game in 2020. No Borderless, I am using \"Borderless Gaming\" and the mouse keeps getting out of the game (out of bounds), the game loses focus and I die ! \n- Story is boring. \n- Driving is bad-ish, you hit something and your armor takes it rofl. Car physics are insane lol, doing flips in the air with the racing car, should be an Olympics for it lol.\n- Everything physics is irritating, I fell from the 2nd floor of the bath house to the water beneath and I DIED! I had half an armor, full health (three bard), like what is that?? And lost me 13k! \n- Made the game annoying at every turn. So much driving to far places, didn't think to have a fast travel as a 'service', AND went and put so many missions and optional mission in the Bayou, which is far from everything .. Yikes. I swear they made that area just to waste your time going from and to it on meaningless side jobs!!\n- SO MANY bugs, glitches, even achievements, I have never seen a game regress lol, I didn't see that many in the first time I played it on console.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game, why am i black if its a game about fucking mafia and why should i give 2 shits about racism??",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had an NPC call me the n word on the street after grinding through part of this game's boring, tedious design.\r\n\r\nI think this game is so bad it actually characterises being a black dude stuck in a debt trap in real life.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy and poor graphic optimization when compared to Mafia II.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2K Games changed their privacy policy in November 2025. They now have an automatic data miner in their games, selling our information to anyone interested. No games from them. Don't play games you already own; let them go bankrupt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game Released at 2016 and Updated at 2021 after This ALL TIME Still have bug in mission after Underboss assassination . its awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. Great graphics\r\n2. Medium mechanics\r\n3. Great Story\r\n4. Same 4 types of missions on repeat - regardless if it's story missions or side missions\r\n\r\nWouldn't recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so. you want to play mafia III. WELL TO BAD. a large sum of your time played is watching the cutscenes to have any idea what is going on with the story. the other part of it will consist of you running around wondering why you do the exact same thing at every objective type and why you seem to only be able to steal cars to get around. (there is a call for a car option in the weapon wheel that I never noticed until I had all 3 territories unlocked) and then after you've gotten to the point of having the 3 starting territories, you WILL be flooded with several side quests and DLC. For me, I kind of like how it feels like a mafia assassins creed, even if stealth is optional. but the pain I get, is from the fact that I need to do EVEN MORE SIDE QUESTS, to get better guns and unlock upgrades. its just so much hassle for something so simple a feature. specially since I dont even think you NEED upgrades to finish the story. ive done all of the story so far, either full stealth or very minimal trying as  you can START THE GAME WITH GOOD WEAPONS. I personally use a sniper and shotgun. but thats the issue, I never bought them or unlocked them, they were there from the very start. meaning they made normal guns annoying as all hell to get, and the most immediately good options INSTANTLY AVAILABLE. like if you're going to torture me with side quests, at least make it WORTH WHILE to get my soul taken out. why even bother upgrading the territories? I even found that you can upgrade the cars to pretty much max upgrades, WITHOUT UNLOCKING THEM. but for a lesser upgrade, YOU GOTTA GRIND. either give me pain or give me ease of access. NOT BOTH.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I want some true Mafia experience, I will go back to Mafia 1 (non definitive ed.)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good story, terrible execution. Imagine a series that has 10 episodes in seasons 1 and 2, but in season 3 they suddenly make 40 episodes, and for every good episode, there are 3 boring fillers. That, my friends, is Mafia 3, where you’re forced to grind through filler quests just to progress in the main story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "full of bugs  cant be played the missions glitch like a f",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Runs poorly, very buggy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "THIS GAME WILL NEVER HAVE POSITIVE REVIEWS BECAUSE IT IS MID AS FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's completely broken. Absolutely trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "one of the shittiest game ever! 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is very repeatitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very bad Game Please dont waste your money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buy this game when discount only",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its more trash then mafia 1 and 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is just trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst mafia game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not install this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a slow game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow, to think people spent part of their lives making  this. I am not sure what is worse, the bugs or the poor graphics. Before you think of paying for this, look in the mirror and ask yourself, \"do I like paying someone to rob me?\" That is what Mafia III is all about!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "atrocious graphics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didn't like this one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hell nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I liked mafia III when it first came out on xbox but this fcking port can't even run fullscreen without bricking the game.",
      "voted_up": false,
      "votes_helpful": 106
    },
    {
      "review": "It’s a shame… this could have been the best Mafia in the series.\n\nAt first, the game hooked me: the setting, the atmosphere, and even the uncomfortable realism of racism in the 60s – you can feel it from the very beginning, with NPCs glaring at your character or making remarks. The story seemed promising too, but as I progressed, it dragged on and became painfully repetitive.\n\nMost missions boil down to the same loop: drive from X to Z, kill some guys, plant a bomb, or talk to someone. That’s it. No real variety. I honestly reached a point where I thought about quitting because the game felt more like a chore than an experience. The endless grind of expanding territories killed the momentum.\n\nCombat? At first, it’s fun enough – the movement is fast, shooting the USP felt decent (tap-tap headshots let you rush through missions quickly). But after a while, even that becomes dull. The AI is laughably bad: you can literally kill enemies one after another in plain sight, and their buddies won’t react. It removes all tension.\n\nThe only thing that kept me going was the driving – the yellow exotic car drifts like a dream and makes traveling across the map less boring. But that alone can’t carry the game.\n\nIn the end, it’s a wasted opportunity. Mafia I: Definitive Edition is still my favorite – shorter, tighter, and more enjoyable. Mafia III could have been great, but it just stretched itself too thin and lost what made the series special.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "You know your game is fûcked when you're literally FORCED to downgrade the game to an earlier patch in order to have a less bugged version and working achievement progress, not even my man Vito can save this headache inducing garbage.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I would say that I do not recommend this game until its fixed. I was eager to play mafia 3 as I have played mafia 1 & 2 before so I puchased it during this autumn sale. It turns out to be the biggest turndown for me. Gonna list out issues in points:\n\n1. The very first thing I see when I launch this game is a big a** ad for mafia the old country in the main menu, and that aint even a main menu. No options for settings, music, game etc. in the main menu. Though it is available in in-game menu, it should have been in the main menu. I can confidently say this that every player wants to go through settings first (specially graphical settings), setup their choice of settings, volume, sensitivity etc. and then head into the game. IDK whose idea it was to implement this style of UI but he/she needs to be fired.\n\n2. It has the worst texture blur ever, caused by TAA I have seen on any game before. I mean I have played games with worse TAA before but this, this makes them look like eye candy. TAA in itself is the worst AA yet it is being implemented in this game making the game look blurry as he**. I literally maxed out this game and yet it looked worse than gta 4. This texture problem along with that awful fixed color grading, those clouds, made me gave up on this game.\n\nI dont know if the pictures posted on steam store page are of orginal mafia 3 but if those are of definitive edition, then we are being cheated here.\n\nI even tried fixes posted on mod pages, guides, gaming blogposts but nothing worked upto expectations. Even with fixes, the game was still looking bad. Didnt even played for half hour and sadly uninstalled.\n\nPlease 2k, if you are seeing this, fix your game. There are fans of this franchise who are willing to play this. So I would say that I do not recommend to buy this game until its fixed. If and when it is fixed, I will go for it.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "probably top 5 worst games Ive ever played. which is really sad because I had high hoped considering the first 2 games were really good. I dont know what went wrong or who joined your team but what are we doing. recycled buildings and the same missions over and over and over and over and over and over and over and over and over. very sad I really wanted to like this game but you gave me no choice:( But i have to beat it or the grind w grind",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I want to recommend this game, because when it works its legitimately quite good. But its just so buggy and not with the graphics bugs everyone talks about. Those have been patched.\r\n\r\nI'm talking about how objectives don't update and don't complete unless you shut the game off. So many times I've finished a mission and had to restart my game in order to clear it from my quest log and get the next mission to become available. Main mission, side mission or DLC it doesn't matter it happens CONSTANTLY. And of course, there is no fan fix or patch available.\r\n\r\nRaces are also bugged but in a different way, some times the game just forgets to let your car accelerate after the count down. The only fix is to bail on the race, exit your car and get back in it, then restart the race.\r\n\r\nThese bugs are huge, its not like I am doing some obscure weird thing. I'm literally just trying to play the game as normal but I consistently encounter them around 70% of the time. If you can get this game on sale like I did for under 5 dollars its good. The game play is solid, the graphics and music are awesome. The story is a little cliche and I think some people REALLY over sold how \"racist\" it is. But I would recommend this game, if only I wasn't constantly having to quit out of it in order to fix a very obvious bug.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unplayable... Freezes whenever I try and put it in Fullscreen mode, and I have tried EVERY fix and freezes when I alt tab. The game looks so bad compared to Mafia 2. Such a shame as I was willing to give this a go.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I got it by a discount, $3. It doesn't worth more than that. The story is ok, but the gamplay is too repetitive. It's been the same 3 kind of missions in every distritc, with the same order and the same sense. I feel totally unhinged how different it becomes after MAFIA II. They had the technology to do it right at the moment they created it, but they worked in a repetitive sandbox, where there is no sense of progress at all. From the very beginning you can just get the best weapons and best cars, with a few not remarkable exceptions. They all dinamic with the liutenants its just superficial, and the enemies are the same 4 designs of guys that you can spot behind the walls and kill without efford. The police is probably the most dangerous enemie, but the AI is soo bad, that you can just shoot people in their back, and they still will need someone going to a public phone to \"call the police\". You can speed, open carry and hit cars in front of their \"eyes\", they will do nothing, or they will inmediatly try to kill you. They had a great system with the original MAFIA, got a little bit lighter in MAFIA II, but the MAFIA III police is far the worst in this kind of games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "meh, gameplay is repetitive, go to X location on map, do the same objectives, \"fight\" 2 underbosses, \"fight\" boss, gg go next. (fight = kill generic ai, injure boss & interrogate)\r\n\r\nbuggy as fuck... game sound will randomly break in a variety of different ways, characters you need to talk to can't be interacted with, side \"missions\" (which are just vehicle fetch quests\" won't register completion, pedestrians jump into the road???\r\n\r\none of the dlcs is horror themed for some reason & it's boring as fuck, barely develops & feels so unrewarding in the end",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Would  I recommend this game to other players? ABSOLUTELY NOT. I hate this because i genuinely liked the game. The atmosphere was good (aside from the video filter that made everything hazy), the cars, music, sound design, and character dialogue were great. Hell id even say that most of these problems that people normally associate with the game would go away if it wasn't called mafia 3. the reason i wont recommend the game is that it has genuinely game breaking bugs in it that have never been addressed.  I was at least 80% of the way through the game. 60+ hours gone. Just like that, with no way of recovering anything. Would i recommend \r\nTHE game?\" absolutely not.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Despite a community patch install, disabling full-screen optimisation as suggested & most of my time troubleshooting. This hot piece of garbage refuses to work. Full-screen refuses to work just staying frozen despite doing fixes and because there is no native border-less windowed I have given up even trying to play this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Very, very buggy, visually outdated, decent story, decent open world but man, the constant barrage of game breaking bugs and visual glitches really suck the life out of you",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really sad seeing such a good collections of games die. The 3rd game is 100% the worst and I cant event get myself to play it. Number 2 is the best, try that one out instead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is so repetitive it's not even intresting the mafia 1 and 2 was literally best out of all their mafia games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Recommended\nThis game has major technical issues that make it almost unplayable.\n\nFullscreen doesn’t work properly if it does launch in fullscreen, the moment you ALT+TAB and try to return, the game freezes and forces you to use Task Manager to close it.\n\nPoor optimization stuttering and bad frame times are constant problems, even on high-end PCs.\n\nMy experience  I’m running a Ryzen 7 5700X with an RX 6750 XT at 1440p High settings. Despite this, the game only gives me around 100 or 110 FPS, but with lots of stutter, which makes it feel way worse than the numbers suggest.\n\nI wanted to enjoy it, but with these issues, I can’t recommend Mafia III at all. And I’m not the only one many reviews mention the same problems",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Самая странная мафия, вроде запускается но работает странно, звук сделан под винтаж, но ушам от него дискомфортно и то же самое с графикой. Лучше поиграйте в первую часть, если фанат во вторую. А данную часть я вам посоветовать не могу.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Although I bought it on sale, it still is a bad purchase. It is not playable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This garbage shit doesn't support any controller of PlayStation, like DualSense or DualShock 4. Steam Input doesn't help, I have to install 3rd party software like DS4Windows to play this shit? no thanks. Even Mafia I, Mafia II can support my DualSense with Steam Input, but this game? nope. It's definitely worth my negative review",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Mafia III had potential, but the constant performance issues really dragged the experience down for me. The gameplay loop quickly became repetitive, and the story just wasn’t as intriguing as the previous entries in the series. What pulled me through to the end was seeing Vito Scaletta again and being able to choose his fate, which gave me some closure as a longtime fan. I wouldn’t recommend this game on its own, but for those who have followed the Mafia series from the very beginning, it’s worth finishing just to see the whole story come full circle.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No Main Menu? Only change options in-game or with a broken launcher? Having to fight a game simply to get it to work, only for to play it to be a painful experience. This is what you consider Definitive? How telling..",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, if you have a console. Absolutely terrible controller support. I'm honestly not surprised given that 2K pretty much half asses anything they do. Every Mafia game on PC is janky in some way. Great job, morons.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So ... Mafia III. Not gonna lie I had my expectations about this game. While it has many interesting missions and compared to previous Mafia games there is lot more to do in Mafia III, the overall feel of the game is pretty underwhelming. The whole main story feels more like an epilogue to an already extensive story. The way of progressing being the assasination of individual leaders of a local don. In short ... while the game introduces one of the most interesting times in modern American history, we are treated with subpar performance. \r\n\r\nThe magical spark that the previous games had is forever gone. In adition the very console-style UI makes me want to vomit. The Mafia III is in my eyes the worst Mafia game ... and we are poorer for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a abomination, this is a disgrace to the mafia series. The game has a plethera of bugs and other issue. I do not recommend this game to any mafia fans this is a game to skip.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very bad graphics. Mafia II was better. We need to do a lot to make it look a bit decent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The main reason I'm marking this as not recommended is because of the plethora of issues that are still left over from the original release of Mafia 3. This is in no way a \"definitive\" edition outside of having all the DLC in one place. But even then you could have bought the original with all the DLC for the same price. From the muddy textures. The muddy sky. Objectively it looks worse then Mafia 2. The game was under baked when it came out and it still shows almost 10 year later. This game deserved at least 1 more year of active development to shine. Bug are still present even after patches and you'll have to reload a checkpoint or restart the game from time to time.\r\n\r\nThe game itself is repetitive. You get 2 objectives in a district, usually kill or destroy x. Repeat about 9 times and you get a main mission after each clear of a district. Those are the only good content in this game. The main missions really are great. Its just a shame their so few and far between. \r\n\r\nThe DLCs are okay but they dont add much to the main story and are their own isolated stories. Gameplay wise the DLCs add to the experience with new things to do, like bounty hunting, racing and so on, that should have been in the base game. They also add new weapons and cars.\r\n\r\nIf you can stomach a lot of grinding, I'd recommend it. Saying that there are mods that cut down the grinding, however their not supported anymore as of the time of writing. If your only playing for the story, you can watch a YT compilation for a better experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oh Mafia 3 oh how much I love almost everything about this game from the map to the music to the characters it’s all good but I am leaving a negative review since this game is unstable enough that I just can’t continue forward I already have the Xbox version not work anymore with the freezing after a hour of gameplay and here on PC with and without mods I have the game crash randomly and losing some progression which is frustrating given how unnecessary bloated the game is with the racket system asking too much for how little it is worth I did used a mod to reduce this heavy but it just screwed up my game even more I really want to finish this game I really do but it needs patches and doubt Hanger13 will take a revisit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just awful game. combat movements worst than watchdogs. most of the missions are pointless",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i tried playing the story really, i really tried but the game got so repetitive, it got boring rather fast. i'll just watch Vito getting all the districts ending on youtube to be honest. \r\n\r\ni bought this for 6 bucks, so it was a good price for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The good:\n\n[list]\n[*]Great voice acting and 60s atmosphere/soundtrack\n[*]Satisfying gunplay and driving mechanics\n[*]Interesting characters (happy to see Vito Scaletta again, although he was pushed into a one-dimensional supporting role)\n[/list]\n\nThe bad:\n\n[list]\n[*]Technical problems: crashes, infinite loading screens, and graphical glitches and bugs throughout my playthrough. I lost count of how many times I had to restart the game or reload a checkpoint. It almost made me hate “All Along the Watchtower.” Almost.\n[*]The main story is told in a very scattered, unfocused way. It’s buried under an endless pile of repetitive side missions.\n[*]The gameplay loop becomes tedious after a while. It has that “liberate outposts” feel, which is a Far Cry™ from the previous Mafia games. Locations and layouts are also reused way too often.\n[*]On normal difficulty, you die way too quickly. A couple of bullets and you’re dead. Tac vests might as well be made of paper.\n[*]Cops are on cocaine in this game. The slightest bump into a car near them and the whole department will chase you to hell and back.\n[*]Some DLC missions, like bounty hunting, are borderline unplayable and incredibly frustrating to complete.\n[*]Because of the sheer amount of driving, the radio songs repeat a lot. You can only listen to Jefferson Airplane or The Rolling Stones so many times before turning the radio off.\n[*]This game doesn’t seem to work properly with a PS5 controller. I had to troubleshoot for an hour before I could even start playing, and even after that, the controller stopped working regularly. From what I’ve seen, I’m not the only one with this issue.\n[/list]\n\nThis was not what I expected at all. The previous Mafia games had tight, focused storytelling and well-paced missions. Mafia III feels more like an abandoned Ubisoft open-world project that got rebranded into a Mafia title.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Chat GPT could make a better remaster than this, no borderless fullscreen, blurry af, I got it 90% off and still want a refund",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely shocking, just pretend this game doesnt exist and stick to the first 2.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When i playing this game I am feeling like playing not Mafia, i feeling like i playing GTA. But unlike GTA, Main character has 0 charisma, physics is bad, optimisation is bad and NPC's artificial intelligence is bad too. I have 45 fps with bad frametime with GTX 1650 on LOW graphic preset, Mafia remake was better",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Mafia III: Definitive Edition is flawed attempt to polish a deeply ambitious crime saga — but it often stumbles under the weight of too many glitches. The open-world gameplay is repetitive, and technical bugs — including frequent crashes — can break the flow. The story is compelling and the setting atmospheric, but the achievement system is a real pain, many achievements are bugged and only reliably unlock if you play the entire game in one sitting without quitting. \nCant believe they didnt fix this\nTrash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a shame, this game had the potential to become a great game, the gameplay is very fun, and the story isn't bad, although the levels or missions become repetitive and boring after a while, but the graphics problem,bugs, random frame drops in random situations, and the terrible texture quality make the experience unpleasant.\nim not recommand unless its on sale.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game, I've played through it twice on my ps4. Was hoping the pc port would be good but its so bad, very annoying to play and it says my computer doesn't meet the minimum requirements even though I have a 4070. \n\nRuns very choppy, looks very bad on high settings. Mouse sensitivity is bad. Would not recommend this port at all.\n\nThe game though: Mafia 2 is one of my favourite games ever, this game is fairly different in a lot of ways but I still like mafia 3 too. It's a pretty good revenge story and you get to see Vito again, the soundtracks great and the combats the same as it usually is in mafia.  \n7/10 if it would run as good as ps4.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mafia 3 is sadly the worst mafia game in the entire franchise and it's not even close, this game is the definition of wasted potential and it's such a shame because I really like the setting and Lincoln Clay as a protagonist but the gameplay loop is atrocious and that alone is a huge turn off.\r\n\r\nI've already forced myself to finish this game on console since I love the Mafia franchise as a whole but this game is just not it, it's a genuinely terrible videogame and I do not recommend it at all.\r\n\r\nMafia 3 is worth 5€ at best and even then that might be too much for a low quality game, I don't know if I'll be able to complete this game for a second time, maybe in the future if I've got the patience for it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Literally the most repetitive game ever. Its like playing Fallout 4 but only helping settlements in need",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It would of been a great game if auto save wasn't MANDATORY!!! I've been wanting to do crazy things in the streets and when I done it once it auto saved it and now I don't feel like playing this anymore. I just want there to be manual save so when I want to go crazy again I can just click on my saved file so I can do what I want. I'll never play this auto saving maniac of a game ever again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly? I was enjoying it... Until i booted up the game & was told my saves were corrupted and deleted themselves. Waste of 12h",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2.5 / 5\nThis does not follow the same style as the previous games and feels 'open world' for the sake of being open world opposed to driving the game. The characters are alright, but not as good as previous installments, and the gameplay feels more like GTA than Mafia. I found myself repeatedly wondering why I continued to play, until I decided that its just not that fun of a game for the time it makes you spend travelling around the map doing the same thing over and over again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is extremly repetetetive, it ditched the linear MAFIA style story line and it's basically GTA SA, you going around taking city parts and it's always the same : go kill, get info, destroy something and make damage for $$$, story is not great not terrible just classic revenge driven, the DLCs are okay. It feels like they spend 90% of the budget on music which is fantastic (but sometimes placed wrong type of music for the action) and didn't have money to do good gameplay.\n\nStory 7/10\nGun Play 5/10\nDLCs 5/10\nGameplay 2/10\nMusic 10/10 \n\nOverall I would do  4/10.\nBuy it on sale and play the story.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}