{
  "positive": [
    {
      "review": "Rough start, but once you're a bit into the game and know the mechanics better, it's so addicting and so much fun. Battle Brothers is overall just a very well-rounded game and definitely worth checking out. Although the base game can get dull reasonably quickly. The DLCs are definitely a must-have here and add much more depth to the game.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Really scratches an itch I've been missing with tactics style games. Gritty and equally punishing as it is rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Difficult but rewarding. Excellent storytelling with a progression system that compels you to keep fighting even when you get frustrated. Wonderful atmospheric music and mob noises that add to the tension and the fear. It took me 4 runs to really figure out how to play the game well but I improved my tactics every run. By the time I beat the novice level on my 5th run I was thoroughly hooked. If you like turn based strategy with a fun storyline you will really enjoy this game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great overworld map, excellent turn based grid combat, soooo much crunch with unit customization. Amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This strategy game is a hardcore, low fantasy, life-is-cheap kind of experience. You WILL lose some guys, you WILL mess up a caravan mission, you will get mauled by monsters. Your mercenaries will take brutal, permanent wounds, leaving some without their noses, one of their eyes, or a bad leg. If you avoid save scumming, and enjoy making due with what the game throws at you; This is an easy recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Короч. Качайте мили атаку. Не будете качать - будете страдать (попадать начнете где-то с 70 с копьем). В остальном игра супер",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have you ever played feeding frenzy? Remember that last stage where there is barely any small fish to eat and grow from? The strategic map is that experience in its purest form. Also, you may lose growth even after eating a fish if you're not careful :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I keep coming back like an addict to a pipe. It keeps pulling me back in from the depth of gameplay to the art and flavor text. 14/10 recommend with all DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and divers, can play over and over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Difficulty curve is meh because you cant become OP with grinding. Frustrating at times with RNG. Cool concept and cool game otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battle Brothers is a layered tactical gem. The strategic depth, immersive worldbuilding, and room for role-play make every campaign feel unique. Its procedural nature gives it excellent replayability, and the old-school difficulty curve rewards patience and persistence. Brutal at first, but once it clicks, it becomes incredibly satisfying. A true indie jewel - aged, but absolutely worth discovering.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, love the low-fantasy setting and the combat is very enjoyable. Lots to love in the economy and balancing of power vs weight of items. Very good writing for all the scenes and quest lines as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.  addictive.  lots of crunchy numbers and gritty stats.  It will take a while to fully appreciate this game.  The you tube video guides are very helpful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While a relatively simple game to play, the nuance of building up your band, the individual characteristics and skills and the variety of opponents offer so much variation, which makes each campaign unique and varied.  I've enjoyed playing this game over and over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolute gem that shines with mods, the base game is a bit lacking. Overall still one of the best in the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely amazing, i can`t wait the implement new DLC or other version of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They turned Rimworld into Dungeons and Dragons\r\n\r\nNot my most detailed review, but my perfectionism keeps reloading the game every time one of my men dies.\r\n\r\nIt's ADDICTING\r\n\r\n8/10\r\nMy MVP is a kill stealer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun but very punishing. \r\n\r\nCombat is strategic, meticulous, and ever-evolving. The variety of enemies keeps it fresh. They all have a unique identity that makes you approach them differently, AKA they fight different. Among the varying enemies, they also typically vary in gear. This also changes the way you approach them.\r\n\r\nYou're almost never comfortable in this game because any simple mistake made in combat can quickly spiral. Your formation is key, shields are a must, and stay away from too many orcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game. It's everything I wanted in a turn based game. Multiple characters to control. Which is more then most games. complex enough stat system. Great difficulty scaling. With optional settings so you can pick and choose what you like and don't like. Great tiering of the enemy. Lets me know what's going to wipe the floor with my company.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play it! first it looks ugly i remember, but soon you see the art in it and love it too, give it a try, when you first time head off someone or hit a crazy shot, or tripple headoff in one strike :D ..u need to feel it to understand..or if you find good loot..or someone dies you liked..its a lot of fun. haha okay the last part isnt. (:\n\n@devs: please give us coop finally :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1900 hrs for a $30 game- what more can you ask for. Love me some Battle Brothers. I love putting hats on on my dudes.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Hard, Role Play, and a lot of green men. My kind of Friday night. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay gets boring after 187 hours but its lowkey pretty chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun to play and i play it for 2 hours a day and have played it for 2815 hours i recommend you show this to a friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is difficult, but quite satisfying. Overworld, on the other hand, feels a bit empty; a less developed mount and blade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battle Brothers is a low-fantasy, turn-based, open-world strategy RPG where you lead a band of mercenaries across a randomly generated world. It carries some Mount & Blade–like vibes, if you enjoy that series' blend of freedom, contracts, and faction dynamics, you’ll feel right at home here.\n\nYou’ll travel across a harsh, dynamic world taking contracts, completing quests, and siding with noble houses. A reputation system shapes how the world reacts to your company, and late-game crises introduce randomized events that can seriously test even seasoned players.\n\nManaging your mercenary company is tough but deeply rewarding, and the game delivers meaningful challenge at every stage. It’s worth every hour played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The ultimate punishing Warband experience.\r\nYou like your Tank? The game will surround him and murder him if you're not faster.\r\nLove your bannerman? Game will shoot him from afar. \r\nArchers? Get f*****.\r\nNew recruits? Welcome to Bootcamp.\r\n\r\nLoved every moment of it - 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10, would watch my battle brothers get their shit rocked by the undead again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bro got permanent brain damage and 1 ear loss. Still power through battles. 11/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely punishing and RNG, but fun nonetheless",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best indie games of all time. If you like strategy rpgs, buy this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Look past the artstyle and it's an amazing story generator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the Heroes of Might and Magic games, you'll probably this as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8 went in, none came out. Entire company wiped by spiders. Laughed so hard I cried crowns. Recruit, die, repeat. UNFORGIVABLE FUN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Early Game: That's a lot of bandits...\r\nMid Game: That's a lot of necromancers...\r\nLate Game: OH MY GOD WHY DOES IT HAVE SO MANY MOUTHS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tricky but great fun once you get the hang of the combat system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing deep sandbox tactics. Must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the hex-based combat and party management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put off getting this game for years because the screenshots dont look very good but its been an obsession since i actually got it, the graphics are simple but I think perfectly describe the gameplay, the artwork itself is very good, and the roleplay and tactical aspect really scratches an itch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've got around 2,000 hours in. If you want a tactics game where RNG and planning come together to challenge you, this is your game. When you're done with the base game, get the Legends mod and learn to struggle all over again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game if you love steep learning curve and rng",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like losing your dearest companions... this games for you!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "never going to a casino after playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My sergeant has brain damage. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It will tickle your autism in the right way",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great but not easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just play it, one of the best games of it's genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game humbles me every time I play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent but too reliant on DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never wrote a review for it when I played two years ago. 10/10 game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My spirit Crushed My Bros dead 100/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute PEAK of a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its quite good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Evil evil video game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "old but gold",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "gooooodddd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "900 hours for this game say it all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it was this",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My hours speak for themself.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I Like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game lots of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i hope they make more of this, love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is AMAZING!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Strangely addictive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3000 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "=)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“My god, this game is ugly” was my first thought when I opened this game. This rimworld/newgrounds aesthetic was so unappealing, I did not play this game for years. However, on one of my long trips, I was left alone with a steam deck and a desire to play a deep tactics game. My friend recommended this one. So, I pushed past my hatred and gave it a shot.\n\nThe game does not hold back, the battles are immediately challenging and units die often. My first company is poor enough that oftentimes I can only afford the peasants and the untouchables. A ratcatcher, a thief, a beggar, a cripple… whoever I can find to just hold a shield. My company is barely making enough money to feed themselves. But it doesn’t last long. I get ambushed in the woods, and a bunch of direwolves surround my barely forged company. It's over. What? Wasn’t this about medieval combat? Now there are zombies, witches, vampires, huge serpents?\n\nSo again, I started a new company. And again, and again, and again. Many barely get off the ground. The start is tough and uncompromising. I took a simple escort mission (so it said), and I got attacked by orcs. Fearsome warriors, nary an armor in sight, but they leap into my shield wall and shatter my formation. Another one where a bunch of necrosavants (vampires) fly into my back lines and rip through my forces. Goblins, weak things, but able to pick people apart in range and poison my units. Many more fall simply to the thieves, raiders, barbarians that run rampant in the wilderness. And slowly, through all of this, I start learning.\n\nThe thieves are just like my peasants. Barely armored, with some farm tools to rob passerbys. They provide a learning ground for all the different types of weapons that are possible in the game. A flail, a pike, axe, a mace, etc. All with their advantages and disadvantages, surprisingly varied for how limited it seems. But quite soon, they will be led by a raider. And a raider has a proper weapon and some armor. If only I could steal it… but in this game you can! Armor can be reused if it’s only lightly damaged. The way to do this is to surround him and shank him! But this is inherently dangerous, as you are keeping the most powerful unit with the best weapon alive… but I brought some nets. So you put him in a net, pray to the gods that he doesn’t chop off an arm and a leg as you shank him to death. Now you have proper armor and maybe his weapon as well! Well, usually at the cost of one or two people. Hopefully with only permanent injuries instead of lives if they are lucky. It is brutal after all.\n\nThat’s the essence of the game. The raider eventually becomes the new normal, and then you have to start facing bandit leaders. Perhaps you will raid the caravans of a noble house to get the valuable armor or supplies you desire. Or maybe you will help the villages and townsmen with the trouble in their area, helping their settlement grow by dealing with bandits or supernatural issues (if you can). Or maybe you will take simple courier missions because you value your life as you explore the unique map generated each run. Or maybe you will rob villagers yourselves. As your renown increases, you can take missions for the aristocrats, and hope to get a plated mail from an enemy knight you killed. The variety of enemies and the difference in each weapon manages to keep the game interesting. The southerners have guns, the northerners are barbarians with powerful javelins, the middle area has powerful armor and good melee weapons. And of course, the monsters, the zombies, etc. The terrains are also very different. Forests, snow, sand, swamps, hills, etc. Each has huge consequences on the tactics you can employ.\n\nAnd through it all is this tension that makes all of this [i]memorable[/i]. Variance is high, the consequences [i]lethal[/i]. Adapting to the changing circumstances is paramount. Each hit usually causes injuries, morale breaks, or death. Everything requires you to adapt.  I still remember my one cripple that held off a raider early on in my campaign. The only thing he could do was hold a shield, and I needed him to protect my right flank until my attackers could break through their line. The raiders swung and missed, and my entire left flank missed as well! So again he swings, and again my cripple blocks the blow, and again my entire left flank misses! Somehow he is able to hold for a third time, and my left flank is able to wipe out theirs, and I am able to save my company. Or my brave flank, much later in a different campaign, who had a rare panic attack after 8 ghosts ganged up on him, almost died as he ran away from the frontlines. But he was able to calm himself and came back to kill the last enemy. The fate of a company hung in the balance each moment, each moment seared into my brain.\n\nThe levelling system and hiring units take a similar design. The stat and stat gains are randomized, so a promising unit with good potential could end up disappointing you. A mediocre unit could roll a bunch of great rolls and become valuable for little cost. An oathkeeper is an expensive hire compared to a peasant, but there is no guarantee he is going to live up to his full potential. But he is of much better stock, so he will have higher stats, and won’t come with the same ailments the poor would (ie asthma, clubfooted, etc.) and has a higher chance of having good traits (ie brute). This adds much needed variance to replaying of the game while still giving you many reasons to keep trying new people once you have your core. And that’s not even getting to how much I agonized on what to level up when I was first learning the game. Weapons are similar. An interesting unique weapon can drastically change how you deploy a formation or build your units still hundreds of hours into the game.\n\nThe game also does a “good enough” take on trying to bring this world alive. The writing is handled from the perspective of a merc, so it’s a lot of base humor. But it’s fitting. The supernatural stuff is properly eerie. Many classes will have unique interactions with the world. A witchhunter will be able to figure out who the hag is. A brute will bully the elderly and kids in the villages. A thief might have a bounty on his head. It all makes sense, in its own way. Of course, this is not simulated that deeply, but it does bring this aspect of the game alive.\n\nAnd even the visuals, while not exactly good, portray the necessities of the game. Each face is pretty unique, and you can even give them new haircuts to differentiate them better. New armor and helmets are portrayed on the character. As are each of the weapons. An eye gouged out is reflected on the portrait, a missed arrow will show up on the ground, a hit will show up on an enemy. It portrays the violence in a good enough way that it’s satisfying, even if I would have preferred something more beautiful or intricate. But such is the life of the indie dev. The music is appropriately tense when fighting powerful foes, appropriately melancholic when butchering peasants (as aristocrats will ask you to), appropriately unique for the different environments.\n\nThis is one of the best tactics games that came out in the last decade, just try to make it past the visuals.",
      "voted_up": true,
      "votes_helpful": 60
    },
    {
      "review": "this is the best game i have ever played. i have put in 1429 hours into this game at the time of writing and i still turn to it when other games get old. battle brothers is my rock. when everything else goes wrong in life, i know that i can at least rely on battle brothers to distract me from my struggles.",
      "voted_up": true,
      "votes_helpful": 64
    },
    {
      "review": "Mount and Blade except with weird 2D chesspiece-shaped people. it's alright, the gameplay tends to get really unforgiving and samey to the point of tedium the longer you play though.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Super addictive if you are the right kind of player.\n\nWhat kind of player do you need to be?\n\nYou need to enjoy turn-based combat. \n\nYou need to be okay with simple graphics and little to no animation.\n\nYou need to enjoy setting your own goals instead of following a story.\n\nYou need to enjoy character-building and party-optimization.\n\nYou need to enjoy the challenge of a steep learning curve.\n\nI think if you are this kind player you can potentially get a lot out of this game and its DLCs.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Get it.\nBrilliant tactical combat combines legit ancient tactics like shieldwalls, high ground, and long polearms from the second rank with an engaging variety of fantastical opponents.\n\nBattle Brothers is a very brutal game, but it is one of the most enjoyable and fun games out there. The grind to get your company to be powerful is challenging but also rewarding. This game will take hours to fully learn and kill all legendary locations. Once you finally have a good company it can be a lot of fun to see what the limits are.\n\nOne of the best highly procedurally generated strategies I've ever played. The studio nailed the medieval theme. The challenge and tension is always there. The mechanics are very immersive and smooth. The customization and replayability is enormous.\n\nIf you like the \"hardcore\" experience and enjoy figuring out new strategies, character builds and gameplay mechanics you will probably have a good time.\n\n100% recommend, 100% recommend all of the dlc's as well!",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Rough start, but once you're a bit into the game and know the mechanics better, it's so addicting and so much fun. Battle Brothers is overall just a very well-rounded game and definitely worth checking out. Although the base game can get dull reasonably quickly. The DLCs are definitely a must-have here and add much more depth to the game.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This game is an absolute masterpiece of the genre. \n\nI could give a massive review at this point but I will leave it at that. \n\nJust a quick disclaimer, this game is hard. And it can get really frustrating to lose your best bros against unlucky onehits. But everyone who has played games like this, be it xcom or other contenders of this battle simulation style knows what I am talking about. And yes the 5% happen more often than you would think. \n\nIf you like turn based strategy games that revolve around managing around a mercenary group but focus heavily on the equipment/leveling/battle aspect of things, then give this game a try. \n\nIf you are easily frustrated and get really angry over things not goin as planned, maybe give this game a pass.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "An addictive turn-based strategy game based around low fantasy mercenaries turns out to be very fun and engaging! Also an modding scene exists for this game! Adding in more interesting mechanics and content to the base game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I've been playing this game for 8 years and it just came to me that I keep coming back to it over and over again. I can't seem to find another tactical game that scratches the itch, it's doing something truly special. If you like granular and gritty tactical games where everything you change alters small percentages that add up to decide victory or defeat, this is it.\nNow installing Legends for the first time, time to relearn everything...",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Very challenging game, you will lose mercenaries and some fights simply will be impossible so take your time and decide which contracts you want to take.  Sometimes you'll be given a task that may seem reasonable at the start but turn out to be harder to win without planning.  Don't let the 2d graphics fool you, the game itself is like chess except the board is always different, placement matters and understanding how to use the strengths of your mercs matters a LOT (and rng is involved so nothing is a \"sure thing\")\nHighly rated, great game and excited to see what their next game \"Menace\" is like after how great Battle Brothers is.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Battle Brothers is an excellent game from a German studio. The tactical gameplay is strong and engaging, the world is well thought-out, and character progression feels rewarding. I especially enjoy the open-ended gameplay that gives a lot of freedom without weighing the player down with an overly complicated story.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game knows what it wants to be and the core gameplay loop, while repetitive, is interesting and well-done if you like turn-based tactical combat.\r\n\r\nMy main complaint is that there's a huge \"meta-game\" element to Battle Brothers. Your first time through, you see enemies like 'some direwolves' or 'many brigand raiders' and you have zero idea how hard those enemies are, or how your squad will match up with them. And the only way to learn is to fight them, and die if you're outmatched. I don't know what they could have done differently but it's frustrating especially if you don't like to save scum.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Pretty much my favorite game ever. I can't really add much to what has already been said countless times. The modding community is fairly active and can really extend the gameplay. Just.... buy this game!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The best turn based strategy ever. Well balanced (not kidding), amazing visual, very atmosphere music, tons of content, variative gameplay. Actually this game is for hundreds and hundreds hours, every try - new adventure with new experience and new challenges. Absolutely recommended.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[i]Smashing A Peasant's Head In With A Big Hammer Because A Guy Will Give You Five Bucks[/i] is a great game with other features I have not yet paid attention to",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great overworld map, excellent turn based grid combat, soooo much crunch with unit customization. Amazing game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really scratches an itch I've been missing with tactics style games. Gritty and equally punishing as it is rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Difficult but rewarding. Excellent storytelling with a progression system that compels you to keep fighting even when you get frustrated. Wonderful atmospheric music and mob noises that add to the tension and the fear. It took me 4 runs to really figure out how to play the game well but I improved my tactics every run. By the time I beat the novice level on my 5th run I was thoroughly hooked. If you like turn based strategy with a fun storyline you will really enjoy this game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Thus far, this is brilliant. There's a learning curve and you need to be willing to lose at first but there's a ton of depth. One piece of advice: until you are oriented with the game, don't play Ironman. Mistakes get punished brutally, so you'll learn from your mistakes faster by allowing yourself to save-scum at first and replay fights to try out new tactics. There's no shame in it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was hesitant about BB. If I buy it, will I hate it? Will the difficulty be too much?\n\nWell, here is my answer: \nNo, I do not hate this game. I love it! Even though It hates me...\nYes, I hate the progression difficulty. I hope one day the mechanics all click and I 'git gud'.\n\nOverall, this is one of the best games I have ever played in this genre! So many nods to great classics from various media types and board games. Most all the DLC are worth it  but even the base game has its' own charm.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is an RNG-heavy tactics game, so take that as you will. However, I have rarely seen a game that allows you to employ contingency tactics this efficiently. I don't like RNG. I love this game. Astonishing effort from the devs and a very unique experience: Highly recommended.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I came to write a scathing review about the retire option since my mouse randomly double clicked on the dialogue prompt after the 2nd crisis (the retirement option is in the exact same position as the continue dialogue choice). So yeah, I'm livid right now. I just sat through 194 days of this campaign along with half a dozen failed campaigns leading up to it. I couldn't wait to see the rest of the endgame content. But as I wrote up to this point I realized nah I didn't \"sit through\" anything; it's been a great time. The game is too good, I can't give it a thumbs down.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best game in the genre, very challenging but satisfied once you figure out what to do, how to build a bro",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "Battle Brothers is one of the most fun games I've played, it's nearly a 10/10. Offering fun and deep combat with meaningful skills that alter the tides of battle, abilities for brothers that completely change the way they function on the battlefield, an Oregon trail style trek across a kingdom. It does so many things right, but a few mechanics are holding this game back. I regrettably have to give it a thumbs down because the truth is thumbs down get more attention and with Overhypes next game on the horizon I hope it doesn’t involve the same pitfalls as this game. \n\nIt's important to point out what Battle Brother is not, because on the surface it is an open world, company management simulation. You build a company, battle, loot, trade, upkeep equipment, etc. Pick your path and develop your company from humble beginnings to armed to the teeth veterans who have survived, despite the harsh world, many battles. This fantasy is dispelled once you have play time under your belt. After some in game time passes you begin hitting brick wall enemy companies that will soft lock you. You start over with your new knowledge of the world. Again. And again. And again. So what gives, why is my company consistently rendered obsolete? Introduce, in my opinion, Battles Brothers biggest flaw.\nUnder the hood Battle Brothers is a race against the clock. Difficulty is scaled by time, number of brothers and brother level. Forcing the player to use every second in the world efficiently. If you want any chance to win mid to late game battles you cannot play the game at your leisure. You must optimize your level ups and gear. There is one way to play Battle Brothers. It is a top speed grind to optimize. \n\nOn the menu screen it is noted that \"Battle Brothers is challenging. Losses and comebacks are part of the gameplay.\" This is true. You will fight hard battles and accumulate loses. Although the game isn't just challenging, it will consistently put you in situations that are game ending, leaving you to restart or save scum. Save scumming might as well be a mechanic in this game. In Battle Brothers reloading a save isn’t something you do to get the best outcome. It is a requirement. Personally I have no interest save scumming in a game like this because it breaks immersion and weight of managing a mortal company. \nMy last gripe is how cumbersome late game battles can be. It’s possible have 40+ characters in a battle. A large scale battle is a cool concept, but it just doesn't work in a turn based game like this. Worst case scenario requires you to watch 33 turns taken by the computer to your 12. \n\nIt’s a shame because the core gameplay is insanely fun and it’s what always brings me back. I deeply want to enjoy this game and I think that’s why these mechanics are so frustrating to me. The early to mid game is when this game is at it's best. This is a glimpse of what the game could be, before RNG, optimization and bloated battles consume your run. If the above issues don’t bother you then you will have a blast with the game. \n\nOverhype Studio is clearly a talented team with a strong concept of what makes a good game, despite some decisions I disagree with. Their next game, MENACE, has a promising demo that I’ve played many times and enjoyed. I hope that they go in a different direction with difficulty scaling and variance when it comes to the overall gameplay.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game is about 90% of the way there, but there is nonsense that makes the already difficult gameplay needlessly unfair.\nYou're hunting down a group of enemies, and you know they are their on the map, but somehow your company is caught off guard at the start of the battle? And your in a swamp, so you start out in the swamp itself and not on the solid ground merely 10 feet away? Also your way out of formation with the backliners infront of the frontliners? Presumably if I had any amount of control over my own professional mercenary company I would have them avoid bad terrain and travel in formation, especially since the world they are in is incredibly dangerous and they are actively on a hunt for dangerous monsters. I get the idea of \"making the best out of a bad situation\" and \"taking your losses\" but if I don't have even the simplest control over things that I would absolutely have control over in reality then I'm not willing to take these losses. \nI was really excited to play the game and was enjoying myself even with the brutal difficulty, but I found that I had to reload saves way too often for my tastes because of the aforementioned unfairness. Maybe if I had control of my guys up to the start of the fight I could say that the disadvantage that I start at is my fault, but the game randomly decides to put me at a huge disadvantage completely out of my control.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game is very fun and has a lot of features and mechanics that show the people who made this game really do understand medieval style combat and role-playing. It's important to know that progression in this game is very slow and all your effort can be undone very quickly. One bad encounter will hamstring your campaign and undo hours upon hours of slow progress. The idea is that you're not heroes - you're just normal mercenaries. I do think that more could've been done to allow skill and preparation to mitigate the grim reaper of fun - bad RNG. As of now I don't feel like there's room for masterful tactics to prevent some random monster shooting an arrow into your company leader's head and permanently injuring him or even killing him instantly. It takes too damn long to build him up for that to be acceptable IMHO",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "people mostly die in just 2 or 3 hits so very RnG heavy, also very slow paced, very shallow and simple both gameplay loop and combat (once even the intricacies are learnt) and just allround boring imo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "even with all mods removed, and the game resinstalled from scratch on 1.5.0 branch OR the main branch, it crashes when creating a world with a company named \"the grim reapers\" i have no clue why but its very frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fairly fun game held back by excessive grind and fustrating map mechanics. You basically lose the game if you aren't obsessively STARING at the map with your finger on the spacebar button whenever your party is moving, Its really a tedious game to play. You will lose more runs to bad pathing or not spamming the spacebar to pause the game and move away from an enemy party jumpscare that no one could possibly win against.\n\nIf you do choose to play battle brothers. Please use mods for auto pausing when enemy party is spotted and a fast forward mod so you dont just have to stare at the map for half the game because the spotting radius is so low its like chinese water torture being forced to stare on the blip on the map that is you for 10 hours out of a 20 hour playthrough only to get bored and look at a video while you are travelling to a town just for a 24 stack of greenskins to partywipe you. forcing you to play another 20 hours to get back to where you started from.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had fun, but this game is cursed by a long development time and early access. Things don't immediately seem intuitive, and the combat is overdesigned and at the same time under-developed.\r\n\r\nThere are a lot of nice systems here, but the core of the game is RNG. That's just not a good system to build a game around. Most RNG heavy games that I'm familiar with do not straight up include dice rolls. XCOM has a hidden flip-flop mechanic so you hit at least SOMETHING SOMETIMES, Hard West has a very fun system where characters have a Luck bar. Dodging an attack reduces luck, and getting hit increases luck. Luck affects the chances to get hit by an attack.\r\n\r\nThis game is engaging, I've burnt quite a bit of time on it, but I don't wanna play any more. Combat feels like playing slots at the casino! It's just fundamentally broken.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game, put 114 hours into it came back to it multiple times but in the end it's just not that fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even on the beginner setting, doing the tutorial, this game is brutal. What the actual fµ©k?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really tried to like this game but it's very difficult and unfair in battles: enemies that revive infinity times, others that eat themselves and become way stronger, a single enemy that suddenly appears in one battle and he is like god and kills all your companions, to miss the hit over and over and over again no matter what stat you level up or which perk you pick... first everything is fine with a couple battles won and then all of a sudden everything goes wrong and all that you built was for nothing... it feels that you must follow a very strict path to win. The base idea of the game is not bad, but the game is not polished and very unbalanced, at day 80 a crisis breaks out then you must be prepared for it, but there are missions like deliver a package or escort a caravan to the other side of the map taking a few days and the reward in gold does not feels commensurate with the time remaining neither the better weapons and armor prices because these are way too expensive, so to give all your companions a decent weapons and armor will require like more than 50 missions well paid and more than 80 days, leaving you with no choice but to steal weapons and armor from enemies which not always is easy and here is pure luck, that feels very forced, because you must steal equipment from enemies almost without no other choice. Also at some point better armor reduce maximum stamina, and as the battle drags on your companions get tired and then you cannot spend your AP completely, so instead you can make two hits you only can do one, but the enemies never get tired and they always do two hits and sometimes they do up to three. The game is too unbalanced it does not worth it play it like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The obvious comparison for \"Medieval mercenary simulator\" is Mount and Blade, and Bannerlord beats this game on all counts. The world map is small with few features, trade goods are sparse, the quests are sparse, the combat is shallow, and once you visit a city once, you've seen everything that city has to offer. there might be a good game behind the initial early game grind but the gameplay loop isn't satisfying enough to keep at it for that chance, and there isn't even much evidence that there _is_ more to the game. \r\n\r\nto give you an example of what i mean, this is my experience so far: with 10 guys at lvl 1, it costs $100 per day, and travel between cities takes about a day. you get to a new city, only to find that it has no quests, so you spend another $100 going to a new city. this new city has a single quest and it's to deliver a package to the questless city you just came from, and they'll pay you $300 to do it. so you just broke even on this whole trip, not counting the food your party consumes. There probably won't be trade items to buy cheap and sell later for a profit, but if there is, there are only two available, and they'll net you maybe $200 profit after traveling for 3 days. you might think \"just hire fewer guys\" but if you have any fewer, you're probably gonna have guys die when you fight bandits, which lowers morale and makes people abandon you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute worthless game that only appeals to ♥♥♥♥♥♥ who think minmaxing, savescumming, and reloading for like 100 hours just to get a “good run” is gameplay, and then doing the same ♥♥♥♥ with a different weapon or armor is somehow “peak game design.”\n\nThese ♥♥♥♥♥♥ praise this game so much for no reason that it makes me think the only explanation is they’ve never played M&B and experienced an actually good medieval mercenary sandbox strategy game—they just glaze the ♥♥♥♥ out of this lackluster abomination. Seriously this game feels like it’s still in alpha with how barebones it is. Even Warband has like three times the options and mechanics, and here? You can’t even see the speed of parties on the map like what the ♥♥♥♥ is this game? There is no raiding, no interactions with lords or nobles, barely any dialogue or i should say meaningful dialogue, NO FUCKING HORSES. It's just \"go from village to village doing the same 3-5 quests\", going around random named locations and killing things or deliver cargo/guard caravan etc. and on the way kill something, fucking snoozefest of a game, literally nothing interesting it's so obvious and lazy. I did a patrol quest where the game was like \"just fucking walk around the map and kill anything you see idfk\" what a fucking joke, it would be somewhat acceptable if the game's world or combat wasn't equivalent to a dried up fucking desert.\n\nAnd of course, the cherry on top is a tutorial that’s barely there, so you have to scour Reddit posts and ♥♥♥♥ from fanboys just to learn the most basic ♥♥♥♥♥.\n\nThe only skill-expressive part of this game is positioning, which can either be insanely easy or ridiculously hard because the AI has bipolar disorder and does whatever the ♥♥♥♥ it wants.\nI have no idea how people can defend this game, I can play similar \"unforgiving\" games like Kenshi and spend 90% my time getting buttfucked and still end up enjoying the shit out of it because it's a good and rewarding game that also has anti-savescumming built into it which shows actual game design unlike this garbage piece of shit. \n\nAnd you reading this, if you are a fanboy of this dogshit then go and fucking buy Warband and play an actual fucking GAME instead of this \"me look percentage, not good, me equip speer\" simulator you fucking troglodyte.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Percentages are actual percentages. 4 70%s and all of them miss",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very dumb, game cheats to be \"hard\" endlessly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashing all the time shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much RNG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hexe enemy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is for a very particular type of person, someone who enjoys difficult games that require time and a lot of failure to learn and master. I thought I would be that type of person, but i feel this game loses something along the way, it stops becoming about learning or overcoming a challenge. For the first dozen hours I thought it was about that, but its not. I personally feel battle brothers is about failure, its about losing brothers, getting your face kicked in over and over again and learning you are not top of the food-chain. Full on dwarf fortress \"losing is fun\" style.\nA lot of games can do this idea really well, Darkest Dungeon, Kenshi ect. But i feel battle brothers focuses on the wrong aspects of what makes those games fun. I love Kenshi because every time you fail or get beaten down you get stronger and learn, its really about overcoming a challenge and becoming a badass. In battle brothers when you get beaten down you really don't gain very much... you just rebuild and go to the next fight, knowing that all your work could be undone again due to nothing but bad RNG. You can learn little tricks here and there but eventually it all just comes down to how lucky you get. A lot of games have a dependence on RNG but i haven't seen many that rely on it quite as much as battle brothers does. I think there could be a case for this type of design if the game paid more respect to your time, but everything in this game takes so much work to setup and prepare for that it just sucks all the energy out of me. There are plenty of people who don't mind this type of thing and find a lot of enjoyment in this game but if your looking for something else this might not be a fun game for you.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "Yes, I had some fun with. Yes, it was worth the money given the ten weeks of 40-hours/week (equivalently) that I played.  But the reason it does not get a positive review is because the primary game mechanic is a timer system, and honestly I hate those.  A timer-based difficulty system is a tool for unimaginative design: Iit is a development strategy for those who can't think of anything to make the game both challenging and fun, so they just make it hard.\r\n\r\nIn addition, after all the hours I played, I still don't know how to build and protect characters through the random number generator. A timer system forces you to accept luck that you don't want, and commits you to decision you may not understand are mistakes.  The second reason this game gets a dislike is because it's far far too difficult to learn the capabilities of your own people, of the enemies you face, of the skills and combinations that are effective, and of the way the various weapons, equipment, and skill can be optimized.\r\n\r\nAre there guides? Lots of them. But I'm not here playing tactical games like I'm back in undergrad.  If civilization can put civilopedia in game since the 20th century, there's no excuse for giving me a complete understanding and library of the stuff you put in the game.\r\n\r\nA third reason that I'm finally giving my negative review is because the game discourages exploration on maps that are clearly interesting.  I'd love to stock my team for a long-term expedition, but because of the timer, you have to stay hyper-focused on optimizing every single day.\r\n\r\nI'm leaving a negative review now because the game is about to spawn a re-skinned sci-fi clone that I have no idea will be just as lame and have the timer as well.  I stopped X-Com when it implemented timers in X-Com 2; I've never liked games with them, and this one reminds me, albeit after quite some time, why.\r\n\r\nI never made it to the end game. Do I sound illiterate? Do I sound like I have no experience with strategy games?  I gave this game a lot of consideration, and like I say, the value was there. But the game can be left behind now; it's not that interesting, and never really was. Cute, but not interesting.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "Battle Brothers is one of the most fun games I've played, it's nearly a 10/10. Offering fun and deep combat with meaningful skills that alter the tides of battle, abilities for brothers that completely change the way they function on the battlefield, an Oregon trail style trek across a kingdom. It does so many things right, but a few mechanics are holding this game back. I regrettably have to give it a thumbs down because the truth is thumbs down get more attention and with Overhypes next game on the horizon I hope it doesn’t involve the same pitfalls as this game. \n\nIt's important to point out what Battle Brother is not, because on the surface it is an open world, company management simulation. You build a company, battle, loot, trade, upkeep equipment, etc. Pick your path and develop your company from humble beginnings to armed to the teeth veterans who have survived, despite the harsh world, many battles. This fantasy is dispelled once you have play time under your belt. After some in game time passes you begin hitting brick wall enemy companies that will soft lock you. You start over with your new knowledge of the world. Again. And again. And again. So what gives, why is my company consistently rendered obsolete? Introduce, in my opinion, Battles Brothers biggest flaw.\nUnder the hood Battle Brothers is a race against the clock. Difficulty is scaled by time, number of brothers and brother level. Forcing the player to use every second in the world efficiently. If you want any chance to win mid to late game battles you cannot play the game at your leisure. You must optimize your level ups and gear. There is one way to play Battle Brothers. It is a top speed grind to optimize. \n\nOn the menu screen it is noted that \"Battle Brothers is challenging. Losses and comebacks are part of the gameplay.\" This is true. You will fight hard battles and accumulate loses. Although the game isn't just challenging, it will consistently put you in situations that are game ending, leaving you to restart or save scum. Save scumming might as well be a mechanic in this game. In Battle Brothers reloading a save isn’t something you do to get the best outcome. It is a requirement. Personally I have no interest save scumming in a game like this because it breaks immersion and weight of managing a mortal company. \nMy last gripe is how cumbersome late game battles can be. It’s possible have 40+ characters in a battle. A large scale battle is a cool concept, but it just doesn't work in a turn based game like this. Worst case scenario requires you to watch 33 turns taken by the computer to your 12. \n\nIt’s a shame because the core gameplay is insanely fun and it’s what always brings me back. I deeply want to enjoy this game and I think that’s why these mechanics are so frustrating to me. The early to mid game is when this game is at it's best. This is a glimpse of what the game could be, before RNG, optimization and bloated battles consume your run. If the above issues don’t bother you then you will have a blast with the game. \n\nOverhype Studio is clearly a talented team with a strong concept of what makes a good game, despite some decisions I disagree with. Their next game, MENACE, has a promising demo that I’ve played many times and enjoyed. I hope that they go in a different direction with difficulty scaling and variance when it comes to the overall gameplay.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "It's a really good game but RNG sucks the fun out of everything eventually.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is about 90% of the way there, but there is nonsense that makes the already difficult gameplay needlessly unfair.\nYou're hunting down a group of enemies, and you know they are their on the map, but somehow your company is caught off guard at the start of the battle? And your in a swamp, so you start out in the swamp itself and not on the solid ground merely 10 feet away? Also your way out of formation with the backliners infront of the frontliners? Presumably if I had any amount of control over my own professional mercenary company I would have them avoid bad terrain and travel in formation, especially since the world they are in is incredibly dangerous and they are actively on a hunt for dangerous monsters. I get the idea of \"making the best out of a bad situation\" and \"taking your losses\" but if I don't have even the simplest control over things that I would absolutely have control over in reality then I'm not willing to take these losses. \nI was really excited to play the game and was enjoying myself even with the brutal difficulty, but I found that I had to reload saves way too often for my tastes because of the aforementioned unfairness. Maybe if I had control of my guys up to the start of the fight I could say that the disadvantage that I start at is my fault, but the game randomly decides to put me at a huge disadvantage completely out of my control.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The game is ok I guess, but I'm over this whole \"losing is fun\" gimmick. Dark Souls came out like 15 years ago. I mean, look at the other negative reviews on here, \"go into battle mid game, completely stun locked, game isn't even interactive half the time\", that is typical. I was just camping outside a village, in what you would assume is the safest place you can be on the map, waiting for daylight to conduct buisiness; I'm in my own camp, with a full squad of 12 guys, fully healed and ready for battle, when I get jumped by some werewolves. Completely steamrolled, no chance whatsoever, and this is right at the start of the game. That's not difficult, its just rng nonsense, and youre wasting my time. What is the point of a game you just have to save scum or reload over and over to get \"desirable\" outcomes? How about you actually design a game with gameplay in mind. \n\nVery little story, procedurely generated, along with maps and characters.\n\nYeah man, just went back and tried to be extra patient, the game isn't hard, it's just dumb. Don't play this. I don't understand the point of this anymore. Reload simulator? Die / stat simulator? Wheres the actual game at? Half the time you aren't even playing, the battles are just overwhelming and you just sit and watch your men get slaughtered so you can reload and go do something else, or repeat the same batlte and just hope rng goes in your favor. It doesn't matter how many tactics you use, you can have overwhelming numbers of men against just a couple people, and I don't know how many battles now that I was completely dominating, down to just a couple hit points left on 2-3 enemies, thinking the battle was over, just to start missing over and over, or connecing and just doing no dmg for multiple rounds in a row, having an isolated enemy completely surrounded, and I mean completely on every hex, with him injured, bleeding, almost dead, and turn around and wipe out my entire party. Again, the game doesn't even feel interactive half the time. I even tried not save scumming and just accepting all losses, it's still just, like, idk man there isn't a real game here.\n\nI've tried, and tried again. I really wanted to like this game. I came back, took my time, worked my way up the missions a bit. Had all my guys in mid teir armor, went into a mid ranged fight that I should be able to easily win. Had a full shield wall, and I mean FULL sheild wall, my team just lined up nicely, with shieldwall set on each guy, in range so the enemy had to approach me, the enemy walks up and ONE SHOTS my guy, instant death. There is nothing more you can do. I had 10 fully armored, rested and healed men, in perfect lineup, at max range from the enemy, and they just one shot my guy. Thats not even interactive. I just sat there, like what more can I do? reload? Ok, but I would do the fight exactly the same again, so what's the point? I didn't do anything wrong. I don't get anything out of games like this. I want to level up my men, when they die, i completely check out of the game. I feel like I lost, and either I should reload, or just not care about any of my men. There is no leader, or player character, and that is jut boring to me. I've been playing every game under the sun for 40 years now, I purposely seek out the hardest and most unique games I can find, but this just doesn't do anything for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I want to like this game, but the balance is atrocious. It is one thing if i have a fighting chance. It is another if I can't interact with the battle at all. Stun locks, cheap shots, skipping initiative for no reason, teleporting enemies that munch each guy to death one by one in the course of a single round. Might as well be an autobattler the number of times I havent been able to actually play the game. And the quests have too much fluff. Sometimes it is hard to even tell what the quest is until you accept it and then your stuck.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is very fun and has a lot of features and mechanics that show the people who made this game really do understand medieval style combat and role-playing. It's important to know that progression in this game is very slow and all your effort can be undone very quickly. One bad encounter will hamstring your campaign and undo hours upon hours of slow progress. The idea is that you're not heroes - you're just normal mercenaries. I do think that more could've been done to allow skill and preparation to mitigate the grim reaper of fun - bad RNG. As of now I don't feel like there's room for masterful tactics to prevent some random monster shooting an arrow into your company leader's head and permanently injuring him or even killing him instantly. It takes too damn long to build him up for that to be acceptable IMHO",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "rng nightmare, devs missed out by not letting us have an actual player character. could have been like bannerlord where the death chance is low but you'll have to go from rags to riches.  the game is fun enough to draw you in but will end up just pissing you off once you can't refund it.  if you're looking for a brutal min-max RNG medieval turn based game that takes hours to master you'll probably like this. if you're like me and was expecting a mercenary company open world sandbox, this doesn't scratch that itch because you will constantly be starting over. no custom difficulty, no workshop, just you repeadtly sucking on the easiest difficulty.\n\nthe game is good, don't get me wrong. it's fun going into a town to see who and what it offers, the barbershop is cool and all, i don't mind my people occasionally dying. but the rng will seriously sting you. again, this game is for a certain type of people that love hard games and min-maxxing.\n\nUPDATE: After plopping down another 20ish hours, and even buying all of the DLC. I still can't recommend this as more of a \"fun game\" than a \"well made punishing experience\". I *really* wanted to love this game, and in a way, I do, but I can't get over just how much the game will bend you backwards and take the daylight out of you. I dove into guides online, Youtube, and advice from the game's subreddit. Even the mass fanbase on the subreddit encourages you to get cheat mods to play or save scum, just because even after you've minmaxxed every single party member, you've cheated tons of gold to outfit them with the best gear, and you have the absolute BEST gear to tackle on whatever you're about to fight, the game still decides if you win or lose at the end of the day. Yes, winning that one hard battle for 600 crowns is fulfilling, not because of the pay, but because your bros are still alive. What's not fulfilling is how unbalanced the game is. Common enemies that can simply *eat* you on a single turn, with a 0% fail chance. Hordes of enemies that can all cast a spell to make your ENTIRE party turn on each other. That isn't fun, it's unbalanced bullshit when the best I can do is armor up and save scum. This game is hard just for the sake of being hard, not for an immersive experience or a cool storytelling narrative, those are just side effects.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is constantly crashing and corrupting save files.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "people mostly die in just 2 or 3 hits so very RnG heavy, also very slow paced, very shallow and simple both gameplay loop and combat (once even the intricacies are learnt) and just allround boring imo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is so fucking hard it's ridiculous. You only have enough money to buy a few dudes and equip them with the starting gear and they'll get one shot in the first missions that you need to do to make cash.\r\n\r\nAnd yes, I'm at the lowest difficulty possible. If you like getting abused, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool game but occasional autosave file becomes corrupted and if you didn't manually save or are on ironman mode you will lose save completely. cant reccommend when a crash corruption bug exsists in the game and has partially ruined the game for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "even with all mods removed, and the game resinstalled from scratch on 1.5.0 branch OR the main branch, it crashes when creating a world with a company named \"the grim reapers\" i have no clue why but its very frustrating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had fun, but this game is cursed by a long development time and early access. Things don't immediately seem intuitive, and the combat is overdesigned and at the same time under-developed.\r\n\r\nThere are a lot of nice systems here, but the core of the game is RNG. That's just not a good system to build a game around. Most RNG heavy games that I'm familiar with do not straight up include dice rolls. XCOM has a hidden flip-flop mechanic so you hit at least SOMETHING SOMETIMES, Hard West has a very fun system where characters have a Luck bar. Dodging an attack reduces luck, and getting hit increases luck. Luck affects the chances to get hit by an attack.\r\n\r\nThis game is engaging, I've burnt quite a bit of time on it, but I don't wanna play any more. Combat feels like playing slots at the casino! It's just fundamentally broken.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even on the beginner setting, doing the tutorial, this game is brutal. What the actual fµ©k?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really tried to like this game but it's very difficult and unfair in battles: enemies that revive infinity times, others that eat themselves and become way stronger, a single enemy that suddenly appears in one battle and he is like god and kills all your companions, to miss the hit over and over and over again no matter what stat you level up or which perk you pick... first everything is fine with a couple battles won and then all of a sudden everything goes wrong and all that you built was for nothing... it feels that you must follow a very strict path to win. The base idea of the game is not bad, but the game is not polished and very unbalanced, at day 80 a crisis breaks out then you must be prepared for it, but there are missions like deliver a package or escort a caravan to the other side of the map taking a few days and the reward in gold does not feels commensurate with the time remaining neither the better weapons and armor prices because these are way too expensive, so to give all your companions a decent weapons and armor will require like more than 50 missions well paid and more than 80 days, leaving you with no choice but to steal weapons and armor from enemies which not always is easy and here is pure luck, that feels very forced, because you must steal equipment from enemies almost without no other choice. Also at some point better armor reduce maximum stamina, and as the battle drags on your companions get tired and then you cannot spend your AP completely, so instead you can make two hits you only can do one, but the enemies never get tired and they always do two hits and sometimes they do up to three. The game is too unbalanced it does not worth it play it like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute worthless game that only appeals to ♥♥♥♥♥♥ who think minmaxing, savescumming, and reloading for like 100 hours just to get a “good run” is gameplay, and then doing the same ♥♥♥♥ with a different weapon or armor is somehow “peak game design.”\n\nThese ♥♥♥♥♥♥ praise this game so much for no reason that it makes me think the only explanation is they’ve never played M&B and experienced an actually good medieval mercenary sandbox strategy game—they just glaze the ♥♥♥♥ out of this lackluster abomination. Seriously this game feels like it’s still in alpha with how barebones it is. Even Warband has like three times the options and mechanics, and here? You can’t even see the speed of parties on the map like what the ♥♥♥♥ is this game? There is no raiding, no interactions with lords or nobles, barely any dialogue or i should say meaningful dialogue, NO FUCKING HORSES. It's just \"go from village to village doing the same 3-5 quests\", going around random named locations and killing things or deliver cargo/guard caravan etc. and on the way kill something, fucking snoozefest of a game, literally nothing interesting it's so obvious and lazy. I did a patrol quest where the game was like \"just fucking walk around the map and kill anything you see idfk\" what a fucking joke, it would be somewhat acceptable if the game's world or combat wasn't equivalent to a dried up fucking desert.\n\nAnd of course, the cherry on top is a tutorial that’s barely there, so you have to scour Reddit posts and ♥♥♥♥ from fanboys just to learn the most basic ♥♥♥♥♥.\n\nThe only skill-expressive part of this game is positioning, which can either be insanely easy or ridiculously hard because the AI has bipolar disorder and does whatever the ♥♥♥♥ it wants.\nI have no idea how people can defend this game, I can play similar \"unforgiving\" games like Kenshi and spend 90% my time getting buttfucked and still end up enjoying the shit out of it because it's a good and rewarding game that also has anti-savescumming built into it which shows actual game design unlike this garbage piece of shit. \n\nAnd you reading this, if you are a fanboy of this dogshit then go and fucking buy Warband and play an actual fucking GAME instead of this \"me look percentage, not good, me equip speer\" simulator you fucking troglodyte.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Percentages are actual percentages. 4 70%s and all of them miss",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very dumb, game cheats to be \"hard\" endlessly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashing all the time shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much RNG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hexe enemy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is for a very particular type of person, someone who enjoys difficult games that require time and a lot of failure to learn and master. I thought I would be that type of person, but i feel this game loses something along the way, it stops becoming about learning or overcoming a challenge. For the first dozen hours I thought it was about that, but its not. I personally feel battle brothers is about failure, its about losing brothers, getting your face kicked in over and over again and learning you are not top of the food-chain. Full on dwarf fortress \"losing is fun\" style.\nA lot of games can do this idea really well, Darkest Dungeon, Kenshi ect. But i feel battle brothers focuses on the wrong aspects of what makes those games fun. I love Kenshi because every time you fail or get beaten down you get stronger and learn, its really about overcoming a challenge and becoming a badass. In battle brothers when you get beaten down you really don't gain very much... you just rebuild and go to the next fight, knowing that all your work could be undone again due to nothing but bad RNG. You can learn little tricks here and there but eventually it all just comes down to how lucky you get. A lot of games have a dependence on RNG but i haven't seen many that rely on it quite as much as battle brothers does. I think there could be a case for this type of design if the game paid more respect to your time, but everything in this game takes so much work to setup and prepare for that it just sucks all the energy out of me. There are plenty of people who don't mind this type of thing and find a lot of enjoyment in this game but if your looking for something else this might not be a fun game for you.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "Yes, I had some fun with. Yes, it was worth the money given the ten weeks of 40-hours/week (equivalently) that I played.  But the reason it does not get a positive review is because the primary game mechanic is a timer system, and honestly I hate those.  A timer-based difficulty system is a tool for unimaginative design: Iit is a development strategy for those who can't think of anything to make the game both challenging and fun, so they just make it hard.\r\n\r\nIn addition, after all the hours I played, I still don't know how to build and protect characters through the random number generator. A timer system forces you to accept luck that you don't want, and commits you to decision you may not understand are mistakes.  The second reason this game gets a dislike is because it's far far too difficult to learn the capabilities of your own people, of the enemies you face, of the skills and combinations that are effective, and of the way the various weapons, equipment, and skill can be optimized.\r\n\r\nAre there guides? Lots of them. But I'm not here playing tactical games like I'm back in undergrad.  If civilization can put civilopedia in game since the 20th century, there's no excuse for giving me a complete understanding and library of the stuff you put in the game.\r\n\r\nA third reason that I'm finally giving my negative review is because the game discourages exploration on maps that are clearly interesting.  I'd love to stock my team for a long-term expedition, but because of the timer, you have to stay hyper-focused on optimizing every single day.\r\n\r\nI'm leaving a negative review now because the game is about to spawn a re-skinned sci-fi clone that I have no idea will be just as lame and have the timer as well.  I stopped X-Com when it implemented timers in X-Com 2; I've never liked games with them, and this one reminds me, albeit after quite some time, why.\r\n\r\nI never made it to the end game. Do I sound illiterate? Do I sound like I have no experience with strategy games?  I gave this game a lot of consideration, and like I say, the value was there. But the game can be left behind now; it's not that interesting, and never really was. Cute, but not interesting.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "Battle Brothers is one of the most fun games I've played, it's nearly a 10/10. Offering fun and deep combat with meaningful skills that alter the tides of battle, abilities for brothers that completely change the way they function on the battlefield, an Oregon trail style trek across a kingdom. It does so many things right, but a few mechanics are holding this game back. I regrettably have to give it a thumbs down because the truth is thumbs down get more attention and with Overhypes next game on the horizon I hope it doesn’t involve the same pitfalls as this game. \n\nIt's important to point out what Battle Brother is not, because on the surface it is an open world, company management simulation. You build a company, battle, loot, trade, upkeep equipment, etc. Pick your path and develop your company from humble beginnings to armed to the teeth veterans who have survived, despite the harsh world, many battles. This fantasy is dispelled once you have play time under your belt. After some in game time passes you begin hitting brick wall enemy companies that will soft lock you. You start over with your new knowledge of the world. Again. And again. And again. So what gives, why is my company consistently rendered obsolete? Introduce, in my opinion, Battles Brothers biggest flaw.\nUnder the hood Battle Brothers is a race against the clock. Difficulty is scaled by time, number of brothers and brother level. Forcing the player to use every second in the world efficiently. If you want any chance to win mid to late game battles you cannot play the game at your leisure. You must optimize your level ups and gear. There is one way to play Battle Brothers. It is a top speed grind to optimize. \n\nOn the menu screen it is noted that \"Battle Brothers is challenging. Losses and comebacks are part of the gameplay.\" This is true. You will fight hard battles and accumulate loses. Although the game isn't just challenging, it will consistently put you in situations that are game ending, leaving you to restart or save scum. Save scumming might as well be a mechanic in this game. In Battle Brothers reloading a save isn’t something you do to get the best outcome. It is a requirement. Personally I have no interest save scumming in a game like this because it breaks immersion and weight of managing a mortal company. \nMy last gripe is how cumbersome late game battles can be. It’s possible have 40+ characters in a battle. A large scale battle is a cool concept, but it just doesn't work in a turn based game like this. Worst case scenario requires you to watch 33 turns taken by the computer to your 12. \n\nIt’s a shame because the core gameplay is insanely fun and it’s what always brings me back. I deeply want to enjoy this game and I think that’s why these mechanics are so frustrating to me. The early to mid game is when this game is at it's best. This is a glimpse of what the game could be, before RNG, optimization and bloated battles consume your run. If the above issues don’t bother you then you will have a blast with the game. \n\nOverhype Studio is clearly a talented team with a strong concept of what makes a good game, despite some decisions I disagree with. Their next game, MENACE, has a promising demo that I’ve played many times and enjoyed. I hope that they go in a different direction with difficulty scaling and variance when it comes to the overall gameplay.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "It's a really good game but RNG sucks the fun out of everything eventually.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is about 90% of the way there, but there is nonsense that makes the already difficult gameplay needlessly unfair.\nYou're hunting down a group of enemies, and you know they are their on the map, but somehow your company is caught off guard at the start of the battle? And your in a swamp, so you start out in the swamp itself and not on the solid ground merely 10 feet away? Also your way out of formation with the backliners infront of the frontliners? Presumably if I had any amount of control over my own professional mercenary company I would have them avoid bad terrain and travel in formation, especially since the world they are in is incredibly dangerous and they are actively on a hunt for dangerous monsters. I get the idea of \"making the best out of a bad situation\" and \"taking your losses\" but if I don't have even the simplest control over things that I would absolutely have control over in reality then I'm not willing to take these losses. \nI was really excited to play the game and was enjoying myself even with the brutal difficulty, but I found that I had to reload saves way too often for my tastes because of the aforementioned unfairness. Maybe if I had control of my guys up to the start of the fight I could say that the disadvantage that I start at is my fault, but the game randomly decides to put me at a huge disadvantage completely out of my control.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The game is ok I guess, but I'm over this whole \"losing is fun\" gimmick. Dark Souls came out like 15 years ago. I mean, look at the other negative reviews on here, \"go into battle mid game, completely stun locked, game isn't even interactive half the time\", that is typical. I was just camping outside a village, in what you would assume is the safest place you can be on the map, waiting for daylight to conduct buisiness; I'm in my own camp, with a full squad of 12 guys, fully healed and ready for battle, when I get jumped by some werewolves. Completely steamrolled, no chance whatsoever, and this is right at the start of the game. That's not difficult, its just rng nonsense, and youre wasting my time. What is the point of a game you just have to save scum or reload over and over to get \"desirable\" outcomes? How about you actually design a game with gameplay in mind. \n\nVery little story, procedurely generated, along with maps and characters.\n\nYeah man, just went back and tried to be extra patient, the game isn't hard, it's just dumb. Don't play this. I don't understand the point of this anymore. Reload simulator? Die / stat simulator? Wheres the actual game at? Half the time you aren't even playing, the battles are just overwhelming and you just sit and watch your men get slaughtered so you can reload and go do something else, or repeat the same batlte and just hope rng goes in your favor. It doesn't matter how many tactics you use, you can have overwhelming numbers of men against just a couple people, and I don't know how many battles now that I was completely dominating, down to just a couple hit points left on 2-3 enemies, thinking the battle was over, just to start missing over and over, or connecing and just doing no dmg for multiple rounds in a row, having an isolated enemy completely surrounded, and I mean completely on every hex, with him injured, bleeding, almost dead, and turn around and wipe out my entire party. Again, the game doesn't even feel interactive half the time. I even tried not save scumming and just accepting all losses, it's still just, like, idk man there isn't a real game here.\n\nI've tried, and tried again. I really wanted to like this game. I came back, took my time, worked my way up the missions a bit. Had all my guys in mid teir armor, went into a mid ranged fight that I should be able to easily win. Had a full shield wall, and I mean FULL sheild wall, my team just lined up nicely, with shieldwall set on each guy, in range so the enemy had to approach me, the enemy walks up and ONE SHOTS my guy, instant death. There is nothing more you can do. I had 10 fully armored, rested and healed men, in perfect lineup, at max range from the enemy, and they just one shot my guy. Thats not even interactive. I just sat there, like what more can I do? reload? Ok, but I would do the fight exactly the same again, so what's the point? I didn't do anything wrong. I don't get anything out of games like this. I want to level up my men, when they die, i completely check out of the game. I feel like I lost, and either I should reload, or just not care about any of my men. There is no leader, or player character, and that is jut boring to me. I've been playing every game under the sun for 40 years now, I purposely seek out the hardest and most unique games I can find, but this just doesn't do anything for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I want to like this game, but the balance is atrocious. It is one thing if i have a fighting chance. It is another if I can't interact with the battle at all. Stun locks, cheap shots, skipping initiative for no reason, teleporting enemies that munch each guy to death one by one in the course of a single round. Might as well be an autobattler the number of times I havent been able to actually play the game. And the quests have too much fluff. Sometimes it is hard to even tell what the quest is until you accept it and then your stuck.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is very fun and has a lot of features and mechanics that show the people who made this game really do understand medieval style combat and role-playing. It's important to know that progression in this game is very slow and all your effort can be undone very quickly. One bad encounter will hamstring your campaign and undo hours upon hours of slow progress. The idea is that you're not heroes - you're just normal mercenaries. I do think that more could've been done to allow skill and preparation to mitigate the grim reaper of fun - bad RNG. As of now I don't feel like there's room for masterful tactics to prevent some random monster shooting an arrow into your company leader's head and permanently injuring him or even killing him instantly. It takes too damn long to build him up for that to be acceptable IMHO",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "rng nightmare, devs missed out by not letting us have an actual player character. could have been like bannerlord where the death chance is low but you'll have to go from rags to riches.  the game is fun enough to draw you in but will end up just pissing you off once you can't refund it.  if you're looking for a brutal min-max RNG medieval turn based game that takes hours to master you'll probably like this. if you're like me and was expecting a mercenary company open world sandbox, this doesn't scratch that itch because you will constantly be starting over. no custom difficulty, no workshop, just you repeadtly sucking on the easiest difficulty.\n\nthe game is good, don't get me wrong. it's fun going into a town to see who and what it offers, the barbershop is cool and all, i don't mind my people occasionally dying. but the rng will seriously sting you. again, this game is for a certain type of people that love hard games and min-maxxing.\n\nUPDATE: After plopping down another 20ish hours, and even buying all of the DLC. I still can't recommend this as more of a \"fun game\" than a \"well made punishing experience\". I *really* wanted to love this game, and in a way, I do, but I can't get over just how much the game will bend you backwards and take the daylight out of you. I dove into guides online, Youtube, and advice from the game's subreddit. Even the mass fanbase on the subreddit encourages you to get cheat mods to play or save scum, just because even after you've minmaxxed every single party member, you've cheated tons of gold to outfit them with the best gear, and you have the absolute BEST gear to tackle on whatever you're about to fight, the game still decides if you win or lose at the end of the day. Yes, winning that one hard battle for 600 crowns is fulfilling, not because of the pay, but because your bros are still alive. What's not fulfilling is how unbalanced the game is. Common enemies that can simply *eat* you on a single turn, with a 0% fail chance. Hordes of enemies that can all cast a spell to make your ENTIRE party turn on each other. That isn't fun, it's unbalanced bullshit when the best I can do is armor up and save scum. This game is hard just for the sake of being hard, not for an immersive experience or a cool storytelling narrative, those are just side effects.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is constantly crashing and corrupting save files.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "people mostly die in just 2 or 3 hits so very RnG heavy, also very slow paced, very shallow and simple both gameplay loop and combat (once even the intricacies are learnt) and just allround boring imo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is so fucking hard it's ridiculous. You only have enough money to buy a few dudes and equip them with the starting gear and they'll get one shot in the first missions that you need to do to make cash.\r\n\r\nAnd yes, I'm at the lowest difficulty possible. If you like getting abused, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool game but occasional autosave file becomes corrupted and if you didn't manually save or are on ironman mode you will lose save completely. cant reccommend when a crash corruption bug exsists in the game and has partially ruined the game for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "even with all mods removed, and the game resinstalled from scratch on 1.5.0 branch OR the main branch, it crashes when creating a world with a company named \"the grim reapers\" i have no clue why but its very frustrating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had fun, but this game is cursed by a long development time and early access. Things don't immediately seem intuitive, and the combat is overdesigned and at the same time under-developed.\r\n\r\nThere are a lot of nice systems here, but the core of the game is RNG. That's just not a good system to build a game around. Most RNG heavy games that I'm familiar with do not straight up include dice rolls. XCOM has a hidden flip-flop mechanic so you hit at least SOMETHING SOMETIMES, Hard West has a very fun system where characters have a Luck bar. Dodging an attack reduces luck, and getting hit increases luck. Luck affects the chances to get hit by an attack.\r\n\r\nThis game is engaging, I've burnt quite a bit of time on it, but I don't wanna play any more. Combat feels like playing slots at the casino! It's just fundamentally broken.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even on the beginner setting, doing the tutorial, this game is brutal. What the actual fµ©k?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really tried to like this game but it's very difficult and unfair in battles: enemies that revive infinity times, others that eat themselves and become way stronger, a single enemy that suddenly appears in one battle and he is like god and kills all your companions, to miss the hit over and over and over again no matter what stat you level up or which perk you pick... first everything is fine with a couple battles won and then all of a sudden everything goes wrong and all that you built was for nothing... it feels that you must follow a very strict path to win. The base idea of the game is not bad, but the game is not polished and very unbalanced, at day 80 a crisis breaks out then you must be prepared for it, but there are missions like deliver a package or escort a caravan to the other side of the map taking a few days and the reward in gold does not feels commensurate with the time remaining neither the better weapons and armor prices because these are way too expensive, so to give all your companions a decent weapons and armor will require like more than 50 missions well paid and more than 80 days, leaving you with no choice but to steal weapons and armor from enemies which not always is easy and here is pure luck, that feels very forced, because you must steal equipment from enemies almost without no other choice. Also at some point better armor reduce maximum stamina, and as the battle drags on your companions get tired and then you cannot spend your AP completely, so instead you can make two hits you only can do one, but the enemies never get tired and they always do two hits and sometimes they do up to three. The game is too unbalanced it does not worth it play it like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute worthless game that only appeals to ♥♥♥♥♥♥ who think minmaxing, savescumming, and reloading for like 100 hours just to get a “good run” is gameplay, and then doing the same ♥♥♥♥ with a different weapon or armor is somehow “peak game design.”\n\nThese ♥♥♥♥♥♥ praise this game so much for no reason that it makes me think the only explanation is they’ve never played M&B and experienced an actually good medieval mercenary sandbox strategy game—they just glaze the ♥♥♥♥ out of this lackluster abomination. Seriously this game feels like it’s still in alpha with how barebones it is. Even Warband has like three times the options and mechanics, and here? You can’t even see the speed of parties on the map like what the ♥♥♥♥ is this game? There is no raiding, no interactions with lords or nobles, barely any dialogue or i should say meaningful dialogue, NO FUCKING HORSES. It's just \"go from village to village doing the same 3-5 quests\", going around random named locations and killing things or deliver cargo/guard caravan etc. and on the way kill something, fucking snoozefest of a game, literally nothing interesting it's so obvious and lazy. I did a patrol quest where the game was like \"just fucking walk around the map and kill anything you see idfk\" what a fucking joke, it would be somewhat acceptable if the game's world or combat wasn't equivalent to a dried up fucking desert.\n\nAnd of course, the cherry on top is a tutorial that’s barely there, so you have to scour Reddit posts and ♥♥♥♥ from fanboys just to learn the most basic ♥♥♥♥♥.\n\nThe only skill-expressive part of this game is positioning, which can either be insanely easy or ridiculously hard because the AI has bipolar disorder and does whatever the ♥♥♥♥ it wants.\nI have no idea how people can defend this game, I can play similar \"unforgiving\" games like Kenshi and spend 90% my time getting buttfucked and still end up enjoying the shit out of it because it's a good and rewarding game that also has anti-savescumming built into it which shows actual game design unlike this garbage piece of shit. \n\nAnd you reading this, if you are a fanboy of this dogshit then go and fucking buy Warband and play an actual fucking GAME instead of this \"me look percentage, not good, me equip speer\" simulator you fucking troglodyte.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Percentages are actual percentages. 4 70%s and all of them miss",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very dumb, game cheats to be \"hard\" endlessly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashing all the time shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much RNG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hexe enemy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is for a very particular type of person, someone who enjoys difficult games that require time and a lot of failure to learn and master. I thought I would be that type of person, but i feel this game loses something along the way, it stops becoming about learning or overcoming a challenge. For the first dozen hours I thought it was about that, but its not. I personally feel battle brothers is about failure, its about losing brothers, getting your face kicked in over and over again and learning you are not top of the food-chain. Full on dwarf fortress \"losing is fun\" style.\nA lot of games can do this idea really well, Darkest Dungeon, Kenshi ect. But i feel battle brothers focuses on the wrong aspects of what makes those games fun. I love Kenshi because every time you fail or get beaten down you get stronger and learn, its really about overcoming a challenge and becoming a badass. In battle brothers when you get beaten down you really don't gain very much... you just rebuild and go to the next fight, knowing that all your work could be undone again due to nothing but bad RNG. You can learn little tricks here and there but eventually it all just comes down to how lucky you get. A lot of games have a dependence on RNG but i haven't seen many that rely on it quite as much as battle brothers does. I think there could be a case for this type of design if the game paid more respect to your time, but everything in this game takes so much work to setup and prepare for that it just sucks all the energy out of me. There are plenty of people who don't mind this type of thing and find a lot of enjoyment in this game but if your looking for something else this might not be a fun game for you.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "Yes, I had some fun with. Yes, it was worth the money given the ten weeks of 40-hours/week (equivalently) that I played.  But the reason it does not get a positive review is because the primary game mechanic is a timer system, and honestly I hate those.  A timer-based difficulty system is a tool for unimaginative design: Iit is a development strategy for those who can't think of anything to make the game both challenging and fun, so they just make it hard.\r\n\r\nIn addition, after all the hours I played, I still don't know how to build and protect characters through the random number generator. A timer system forces you to accept luck that you don't want, and commits you to decision you may not understand are mistakes.  The second reason this game gets a dislike is because it's far far too difficult to learn the capabilities of your own people, of the enemies you face, of the skills and combinations that are effective, and of the way the various weapons, equipment, and skill can be optimized.\r\n\r\nAre there guides? Lots of them. But I'm not here playing tactical games like I'm back in undergrad.  If civilization can put civilopedia in game since the 20th century, there's no excuse for giving me a complete understanding and library of the stuff you put in the game.\r\n\r\nA third reason that I'm finally giving my negative review is because the game discourages exploration on maps that are clearly interesting.  I'd love to stock my team for a long-term expedition, but because of the timer, you have to stay hyper-focused on optimizing every single day.\r\n\r\nI'm leaving a negative review now because the game is about to spawn a re-skinned sci-fi clone that I have no idea will be just as lame and have the timer as well.  I stopped X-Com when it implemented timers in X-Com 2; I've never liked games with them, and this one reminds me, albeit after quite some time, why.\r\n\r\nI never made it to the end game. Do I sound illiterate? Do I sound like I have no experience with strategy games?  I gave this game a lot of consideration, and like I say, the value was there. But the game can be left behind now; it's not that interesting, and never really was. Cute, but not interesting.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "Battle Brothers is one of the most fun games I've played, it's nearly a 10/10. Offering fun and deep combat with meaningful skills that alter the tides of battle, abilities for brothers that completely change the way they function on the battlefield, an Oregon trail style trek across a kingdom. It does so many things right, but a few mechanics are holding this game back. I regrettably have to give it a thumbs down because the truth is thumbs down get more attention and with Overhypes next game on the horizon I hope it doesn’t involve the same pitfalls as this game. \n\nIt's important to point out what Battle Brother is not, because on the surface it is an open world, company management simulation. You build a company, battle, loot, trade, upkeep equipment, etc. Pick your path and develop your company from humble beginnings to armed to the teeth veterans who have survived, despite the harsh world, many battles. This fantasy is dispelled once you have play time under your belt. After some in game time passes you begin hitting brick wall enemy companies that will soft lock you. You start over with your new knowledge of the world. Again. And again. And again. So what gives, why is my company consistently rendered obsolete? Introduce, in my opinion, Battles Brothers biggest flaw.\nUnder the hood Battle Brothers is a race against the clock. Difficulty is scaled by time, number of brothers and brother level. Forcing the player to use every second in the world efficiently. If you want any chance to win mid to late game battles you cannot play the game at your leisure. You must optimize your level ups and gear. There is one way to play Battle Brothers. It is a top speed grind to optimize. \n\nOn the menu screen it is noted that \"Battle Brothers is challenging. Losses and comebacks are part of the gameplay.\" This is true. You will fight hard battles and accumulate loses. Although the game isn't just challenging, it will consistently put you in situations that are game ending, leaving you to restart or save scum. Save scumming might as well be a mechanic in this game. In Battle Brothers reloading a save isn’t something you do to get the best outcome. It is a requirement. Personally I have no interest save scumming in a game like this because it breaks immersion and weight of managing a mortal company. \nMy last gripe is how cumbersome late game battles can be. It’s possible have 40+ characters in a battle. A large scale battle is a cool concept, but it just doesn't work in a turn based game like this. Worst case scenario requires you to watch 33 turns taken by the computer to your 12. \n\nIt’s a shame because the core gameplay is insanely fun and it’s what always brings me back. I deeply want to enjoy this game and I think that’s why these mechanics are so frustrating to me. The early to mid game is when this game is at it's best. This is a glimpse of what the game could be, before RNG, optimization and bloated battles consume your run. If the above issues don’t bother you then you will have a blast with the game. \n\nOverhype Studio is clearly a talented team with a strong concept of what makes a good game, despite some decisions I disagree with. Their next game, MENACE, has a promising demo that I’ve played many times and enjoyed. I hope that they go in a different direction with difficulty scaling and variance when it comes to the overall gameplay.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "It's a really good game but RNG sucks the fun out of everything eventually.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is about 90% of the way there, but there is nonsense that makes the already difficult gameplay needlessly unfair.\nYou're hunting down a group of enemies, and you know they are their on the map, but somehow your company is caught off guard at the start of the battle? And your in a swamp, so you start out in the swamp itself and not on the solid ground merely 10 feet away? Also your way out of formation with the backliners infront of the frontliners? Presumably if I had any amount of control over my own professional mercenary company I would have them avoid bad terrain and travel in formation, especially since the world they are in is incredibly dangerous and they are actively on a hunt for dangerous monsters. I get the idea of \"making the best out of a bad situation\" and \"taking your losses\" but if I don't have even the simplest control over things that I would absolutely have control over in reality then I'm not willing to take these losses. \nI was really excited to play the game and was enjoying myself even with the brutal difficulty, but I found that I had to reload saves way too often for my tastes because of the aforementioned unfairness. Maybe if I had control of my guys up to the start of the fight I could say that the disadvantage that I start at is my fault, but the game randomly decides to put me at a huge disadvantage completely out of my control.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The game is ok I guess, but I'm over this whole \"losing is fun\" gimmick. Dark Souls came out like 15 years ago. I mean, look at the other negative reviews on here, \"go into battle mid game, completely stun locked, game isn't even interactive half the time\", that is typical. I was just camping outside a village, in what you would assume is the safest place you can be on the map, waiting for daylight to conduct buisiness; I'm in my own camp, with a full squad of 12 guys, fully healed and ready for battle, when I get jumped by some werewolves. Completely steamrolled, no chance whatsoever, and this is right at the start of the game. That's not difficult, its just rng nonsense, and youre wasting my time. What is the point of a game you just have to save scum or reload over and over to get \"desirable\" outcomes? How about you actually design a game with gameplay in mind. \n\nVery little story, procedurely generated, along with maps and characters.\n\nYeah man, just went back and tried to be extra patient, the game isn't hard, it's just dumb. Don't play this. I don't understand the point of this anymore. Reload simulator? Die / stat simulator? Wheres the actual game at? Half the time you aren't even playing, the battles are just overwhelming and you just sit and watch your men get slaughtered so you can reload and go do something else, or repeat the same batlte and just hope rng goes in your favor. It doesn't matter how many tactics you use, you can have overwhelming numbers of men against just a couple people, and I don't know how many battles now that I was completely dominating, down to just a couple hit points left on 2-3 enemies, thinking the battle was over, just to start missing over and over, or connecing and just doing no dmg for multiple rounds in a row, having an isolated enemy completely surrounded, and I mean completely on every hex, with him injured, bleeding, almost dead, and turn around and wipe out my entire party. Again, the game doesn't even feel interactive half the time. I even tried not save scumming and just accepting all losses, it's still just, like, idk man there isn't a real game here.\n\nI've tried, and tried again. I really wanted to like this game. I came back, took my time, worked my way up the missions a bit. Had all my guys in mid teir armor, went into a mid ranged fight that I should be able to easily win. Had a full shield wall, and I mean FULL sheild wall, my team just lined up nicely, with shieldwall set on each guy, in range so the enemy had to approach me, the enemy walks up and ONE SHOTS my guy, instant death. There is nothing more you can do. I had 10 fully armored, rested and healed men, in perfect lineup, at max range from the enemy, and they just one shot my guy. Thats not even interactive. I just sat there, like what more can I do? reload? Ok, but I would do the fight exactly the same again, so what's the point? I didn't do anything wrong. I don't get anything out of games like this. I want to level up my men, when they die, i completely check out of the game. I feel like I lost, and either I should reload, or just not care about any of my men. There is no leader, or player character, and that is jut boring to me. I've been playing every game under the sun for 40 years now, I purposely seek out the hardest and most unique games I can find, but this just doesn't do anything for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I want to like this game, but the balance is atrocious. It is one thing if i have a fighting chance. It is another if I can't interact with the battle at all. Stun locks, cheap shots, skipping initiative for no reason, teleporting enemies that munch each guy to death one by one in the course of a single round. Might as well be an autobattler the number of times I havent been able to actually play the game. And the quests have too much fluff. Sometimes it is hard to even tell what the quest is until you accept it and then your stuck.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is very fun and has a lot of features and mechanics that show the people who made this game really do understand medieval style combat and role-playing. It's important to know that progression in this game is very slow and all your effort can be undone very quickly. One bad encounter will hamstring your campaign and undo hours upon hours of slow progress. The idea is that you're not heroes - you're just normal mercenaries. I do think that more could've been done to allow skill and preparation to mitigate the grim reaper of fun - bad RNG. As of now I don't feel like there's room for masterful tactics to prevent some random monster shooting an arrow into your company leader's head and permanently injuring him or even killing him instantly. It takes too damn long to build him up for that to be acceptable IMHO",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "rng nightmare, devs missed out by not letting us have an actual player character. could have been like bannerlord where the death chance is low but you'll have to go from rags to riches.  the game is fun enough to draw you in but will end up just pissing you off once you can't refund it.  if you're looking for a brutal min-max RNG medieval turn based game that takes hours to master you'll probably like this. if you're like me and was expecting a mercenary company open world sandbox, this doesn't scratch that itch because you will constantly be starting over. no custom difficulty, no workshop, just you repeadtly sucking on the easiest difficulty.\n\nthe game is good, don't get me wrong. it's fun going into a town to see who and what it offers, the barbershop is cool and all, i don't mind my people occasionally dying. but the rng will seriously sting you. again, this game is for a certain type of people that love hard games and min-maxxing.\n\nUPDATE: After plopping down another 20ish hours, and even buying all of the DLC. I still can't recommend this as more of a \"fun game\" than a \"well made punishing experience\". I *really* wanted to love this game, and in a way, I do, but I can't get over just how much the game will bend you backwards and take the daylight out of you. I dove into guides online, Youtube, and advice from the game's subreddit. Even the mass fanbase on the subreddit encourages you to get cheat mods to play or save scum, just because even after you've minmaxxed every single party member, you've cheated tons of gold to outfit them with the best gear, and you have the absolute BEST gear to tackle on whatever you're about to fight, the game still decides if you win or lose at the end of the day. Yes, winning that one hard battle for 600 crowns is fulfilling, not because of the pay, but because your bros are still alive. What's not fulfilling is how unbalanced the game is. Common enemies that can simply *eat* you on a single turn, with a 0% fail chance. Hordes of enemies that can all cast a spell to make your ENTIRE party turn on each other. That isn't fun, it's unbalanced bullshit when the best I can do is armor up and save scum. This game is hard just for the sake of being hard, not for an immersive experience or a cool storytelling narrative, those are just side effects.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is constantly crashing and corrupting save files.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "people mostly die in just 2 or 3 hits so very RnG heavy, also very slow paced, very shallow and simple both gameplay loop and combat (once even the intricacies are learnt) and just allround boring imo",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is so fucking hard it's ridiculous. You only have enough money to buy a few dudes and equip them with the starting gear and they'll get one shot in the first missions that you need to do to make cash.\r\n\r\nAnd yes, I'm at the lowest difficulty possible. If you like getting abused, this is the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool game but occasional autosave file becomes corrupted and if you didn't manually save or are on ironman mode you will lose save completely. cant reccommend when a crash corruption bug exsists in the game and has partially ruined the game for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "even with all mods removed, and the game resinstalled from scratch on 1.5.0 branch OR the main branch, it crashes when creating a world with a company named \"the grim reapers\" i have no clue why but its very frustrating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had fun, but this game is cursed by a long development time and early access. Things don't immediately seem intuitive, and the combat is overdesigned and at the same time under-developed.\r\n\r\nThere are a lot of nice systems here, but the core of the game is RNG. That's just not a good system to build a game around. Most RNG heavy games that I'm familiar with do not straight up include dice rolls. XCOM has a hidden flip-flop mechanic so you hit at least SOMETHING SOMETIMES, Hard West has a very fun system where characters have a Luck bar. Dodging an attack reduces luck, and getting hit increases luck. Luck affects the chances to get hit by an attack.\r\n\r\nThis game is engaging, I've burnt quite a bit of time on it, but I don't wanna play any more. Combat feels like playing slots at the casino! It's just fundamentally broken.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even on the beginner setting, doing the tutorial, this game is brutal. What the actual fµ©k?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really tried to like this game but it's very difficult and unfair in battles: enemies that revive infinity times, others that eat themselves and become way stronger, a single enemy that suddenly appears in one battle and he is like god and kills all your companions, to miss the hit over and over and over again no matter what stat you level up or which perk you pick... first everything is fine with a couple battles won and then all of a sudden everything goes wrong and all that you built was for nothing... it feels that you must follow a very strict path to win. The base idea of the game is not bad, but the game is not polished and very unbalanced, at day 80 a crisis breaks out then you must be prepared for it, but there are missions like deliver a package or escort a caravan to the other side of the map taking a few days and the reward in gold does not feels commensurate with the time remaining neither the better weapons and armor prices because these are way too expensive, so to give all your companions a decent weapons and armor will require like more than 50 missions well paid and more than 80 days, leaving you with no choice but to steal weapons and armor from enemies which not always is easy and here is pure luck, that feels very forced, because you must steal equipment from enemies almost without no other choice. Also at some point better armor reduce maximum stamina, and as the battle drags on your companions get tired and then you cannot spend your AP completely, so instead you can make two hits you only can do one, but the enemies never get tired and they always do two hits and sometimes they do up to three. The game is too unbalanced it does not worth it play it like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute worthless game that only appeals to ♥♥♥♥♥♥ who think minmaxing, savescumming, and reloading for like 100 hours just to get a “good run” is gameplay, and then doing the same ♥♥♥♥ with a different weapon or armor is somehow “peak game design.”\n\nThese ♥♥♥♥♥♥ praise this game so much for no reason that it makes me think the only explanation is they’ve never played M&B and experienced an actually good medieval mercenary sandbox strategy game—they just glaze the ♥♥♥♥ out of this lackluster abomination. Seriously this game feels like it’s still in alpha with how barebones it is. Even Warband has like three times the options and mechanics, and here? You can’t even see the speed of parties on the map like what the ♥♥♥♥ is this game? There is no raiding, no interactions with lords or nobles, barely any dialogue or i should say meaningful dialogue, NO FUCKING HORSES. It's just \"go from village to village doing the same 3-5 quests\", going around random named locations and killing things or deliver cargo/guard caravan etc. and on the way kill something, fucking snoozefest of a game, literally nothing interesting it's so obvious and lazy. I did a patrol quest where the game was like \"just fucking walk around the map and kill anything you see idfk\" what a fucking joke, it would be somewhat acceptable if the game's world or combat wasn't equivalent to a dried up fucking desert.\n\nAnd of course, the cherry on top is a tutorial that’s barely there, so you have to scour Reddit posts and ♥♥♥♥ from fanboys just to learn the most basic ♥♥♥♥♥.\n\nThe only skill-expressive part of this game is positioning, which can either be insanely easy or ridiculously hard because the AI has bipolar disorder and does whatever the ♥♥♥♥ it wants.\nI have no idea how people can defend this game, I can play similar \"unforgiving\" games like Kenshi and spend 90% my time getting buttfucked and still end up enjoying the shit out of it because it's a good and rewarding game that also has anti-savescumming built into it which shows actual game design unlike this garbage piece of shit. \n\nAnd you reading this, if you are a fanboy of this dogshit then go and fucking buy Warband and play an actual fucking GAME instead of this \"me look percentage, not good, me equip speer\" simulator you fucking troglodyte.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Percentages are actual percentages. 4 70%s and all of them miss",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very dumb, game cheats to be \"hard\" endlessly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashing all the time shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much RNG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hexe enemy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is for a very particular type of person, someone who enjoys difficult games that require time and a lot of failure to learn and master. I thought I would be that type of person, but i feel this game loses something along the way, it stops becoming about learning or overcoming a challenge. For the first dozen hours I thought it was about that, but its not. I personally feel battle brothers is about failure, its about losing brothers, getting your face kicked in over and over again and learning you are not top of the food-chain. Full on dwarf fortress \"losing is fun\" style.\nA lot of games can do this idea really well, Darkest Dungeon, Kenshi ect. But i feel battle brothers focuses on the wrong aspects of what makes those games fun. I love Kenshi because every time you fail or get beaten down you get stronger and learn, its really about overcoming a challenge and becoming a badass. In battle brothers when you get beaten down you really don't gain very much... you just rebuild and go to the next fight, knowing that all your work could be undone again due to nothing but bad RNG. You can learn little tricks here and there but eventually it all just comes down to how lucky you get. A lot of games have a dependence on RNG but i haven't seen many that rely on it quite as much as battle brothers does. I think there could be a case for this type of design if the game paid more respect to your time, but everything in this game takes so much work to setup and prepare for that it just sucks all the energy out of me. There are plenty of people who don't mind this type of thing and find a lot of enjoyment in this game but if your looking for something else this might not be a fun game for you.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "Yes, I had some fun with. Yes, it was worth the money given the ten weeks of 40-hours/week (equivalently) that I played.  But the reason it does not get a positive review is because the primary game mechanic is a timer system, and honestly I hate those.  A timer-based difficulty system is a tool for unimaginative design: Iit is a development strategy for those who can't think of anything to make the game both challenging and fun, so they just make it hard.\r\n\r\nIn addition, after all the hours I played, I still don't know how to build and protect characters through the random number generator. A timer system forces you to accept luck that you don't want, and commits you to decision you may not understand are mistakes.  The second reason this game gets a dislike is because it's far far too difficult to learn the capabilities of your own people, of the enemies you face, of the skills and combinations that are effective, and of the way the various weapons, equipment, and skill can be optimized.\r\n\r\nAre there guides? Lots of them. But I'm not here playing tactical games like I'm back in undergrad.  If civilization can put civilopedia in game since the 20th century, there's no excuse for giving me a complete understanding and library of the stuff you put in the game.\r\n\r\nA third reason that I'm finally giving my negative review is because the game discourages exploration on maps that are clearly interesting.  I'd love to stock my team for a long-term expedition, but because of the timer, you have to stay hyper-focused on optimizing every single day.\r\n\r\nI'm leaving a negative review now because the game is about to spawn a re-skinned sci-fi clone that I have no idea will be just as lame and have the timer as well.  I stopped X-Com when it implemented timers in X-Com 2; I've never liked games with them, and this one reminds me, albeit after quite some time, why.\r\n\r\nI never made it to the end game. Do I sound illiterate? Do I sound like I have no experience with strategy games?  I gave this game a lot of consideration, and like I say, the value was there. But the game can be left behind now; it's not that interesting, and never really was. Cute, but not interesting.",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "Battle Brothers is one of the most fun games I've played, it's nearly a 10/10. Offering fun and deep combat with meaningful skills that alter the tides of battle, abilities for brothers that completely change the way they function on the battlefield, an Oregon trail style trek across a kingdom. It does so many things right, but a few mechanics are holding this game back. I regrettably have to give it a thumbs down because the truth is thumbs down get more attention and with Overhypes next game on the horizon I hope it doesn’t involve the same pitfalls as this game. \n\nIt's important to point out what Battle Brother is not, because on the surface it is an open world, company management simulation. You build a company, battle, loot, trade, upkeep equipment, etc. Pick your path and develop your company from humble beginnings to armed to the teeth veterans who have survived, despite the harsh world, many battles. This fantasy is dispelled once you have play time under your belt. After some in game time passes you begin hitting brick wall enemy companies that will soft lock you. You start over with your new knowledge of the world. Again. And again. And again. So what gives, why is my company consistently rendered obsolete? Introduce, in my opinion, Battles Brothers biggest flaw.\nUnder the hood Battle Brothers is a race against the clock. Difficulty is scaled by time, number of brothers and brother level. Forcing the player to use every second in the world efficiently. If you want any chance to win mid to late game battles you cannot play the game at your leisure. You must optimize your level ups and gear. There is one way to play Battle Brothers. It is a top speed grind to optimize. \n\nOn the menu screen it is noted that \"Battle Brothers is challenging. Losses and comebacks are part of the gameplay.\" This is true. You will fight hard battles and accumulate loses. Although the game isn't just challenging, it will consistently put you in situations that are game ending, leaving you to restart or save scum. Save scumming might as well be a mechanic in this game. In Battle Brothers reloading a save isn’t something you do to get the best outcome. It is a requirement. Personally I have no interest save scumming in a game like this because it breaks immersion and weight of managing a mortal company. \nMy last gripe is how cumbersome late game battles can be. It’s possible have 40+ characters in a battle. A large scale battle is a cool concept, but it just doesn't work in a turn based game like this. Worst case scenario requires you to watch 33 turns taken by the computer to your 12. \n\nIt’s a shame because the core gameplay is insanely fun and it’s what always brings me back. I deeply want to enjoy this game and I think that’s why these mechanics are so frustrating to me. The early to mid game is when this game is at it's best. This is a glimpse of what the game could be, before RNG, optimization and bloated battles consume your run. If the above issues don’t bother you then you will have a blast with the game. \n\nOverhype Studio is clearly a talented team with a strong concept of what makes a good game, despite some decisions I disagree with. Their next game, MENACE, has a promising demo that I’ve played many times and enjoyed. I hope that they go in a different direction with difficulty scaling and variance when it comes to the overall gameplay.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "It's a really good game but RNG sucks the fun out of everything eventually.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is about 90% of the way there, but there is nonsense that makes the already difficult gameplay needlessly unfair.\nYou're hunting down a group of enemies, and you know they are their on the map, but somehow your company is caught off guard at the start of the battle? And your in a swamp, so you start out in the swamp itself and not on the solid ground merely 10 feet away? Also your way out of formation with the backliners infront of the frontliners? Presumably if I had any amount of control over my own professional mercenary company I would have them avoid bad terrain and travel in formation, especially since the world they are in is incredibly dangerous and they are actively on a hunt for dangerous monsters. I get the idea of \"making the best out of a bad situation\" and \"taking your losses\" but if I don't have even the simplest control over things that I would absolutely have control over in reality then I'm not willing to take these losses. \nI was really excited to play the game and was enjoying myself even with the brutal difficulty, but I found that I had to reload saves way too often for my tastes because of the aforementioned unfairness. Maybe if I had control of my guys up to the start of the fight I could say that the disadvantage that I start at is my fault, but the game randomly decides to put me at a huge disadvantage completely out of my control.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The game is ok I guess, but I'm over this whole \"losing is fun\" gimmick. Dark Souls came out like 15 years ago. I mean, look at the other negative reviews on here, \"go into battle mid game, completely stun locked, game isn't even interactive half the time\", that is typical. I was just camping outside a village, in what you would assume is the safest place you can be on the map, waiting for daylight to conduct buisiness; I'm in my own camp, with a full squad of 12 guys, fully healed and ready for battle, when I get jumped by some werewolves. Completely steamrolled, no chance whatsoever, and this is right at the start of the game. That's not difficult, its just rng nonsense, and youre wasting my time. What is the point of a game you just have to save scum or reload over and over to get \"desirable\" outcomes? How about you actually design a game with gameplay in mind. \n\nVery little story, procedurely generated, along with maps and characters.\n\nYeah man, just went back and tried to be extra patient, the game isn't hard, it's just dumb. Don't play this. I don't understand the point of this anymore. Reload simulator? Die / stat simulator? Wheres the actual game at? Half the time you aren't even playing, the battles are just overwhelming and you just sit and watch your men get slaughtered so you can reload and go do something else, or repeat the same batlte and just hope rng goes in your favor. It doesn't matter how many tactics you use, you can have overwhelming numbers of men against just a couple people, and I don't know how many battles now that I was completely dominating, down to just a couple hit points left on 2-3 enemies, thinking the battle was over, just to start missing over and over, or connecing and just doing no dmg for multiple rounds in a row, having an isolated enemy completely surrounded, and I mean completely on every hex, with him injured, bleeding, almost dead, and turn around and wipe out my entire party. Again, the game doesn't even feel interactive half the time. I even tried not save scumming and just accepting all losses, it's still just, like, idk man there isn't a real game here.\n\nI've tried, and tried again. I really wanted to like this game. I came back, took my time, worked my way up the missions a bit. Had all my guys in mid teir armor, went into a mid ranged fight that I should be able to easily win. Had a full shield wall, and I mean FULL sheild wall, my team just lined up nicely, with shieldwall set on each guy, in range so the enemy had to approach me, the enemy walks up and ONE SHOTS my guy, instant death. There is nothing more you can do. I had 10 fully armored, rested and healed men, in perfect lineup, at max range from the enemy, and they just one shot my guy. Thats not even interactive. I just sat there, like what more can I do? reload? Ok, but I would do the fight exactly the same again, so what's the point? I didn't do anything wrong. I don't get anything out of games like this. I want to level up my men, when they die, i completely check out of the game. I feel like I lost, and either I should reload, or just not care about any of my men. There is no leader, or player character, and that is jut boring to me. I've been playing every game under the sun for 40 years now, I purposely seek out the hardest and most unique games I can find, but this just doesn't do anything for me.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}