{
  "positive": [
    {
      "review": "A little slow to start, but the story and gameplay get good after 500 hours.",
      "voted_up": true,
      "votes_helpful": 103
    },
    {
      "review": "someday i am going to splice a fake scene into a disney movie, post it on internet archive, and then mandela effect that scene into everyone's brain. just you wait.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "this game is perfect, the graphics get better the more you play it",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "Very cool, I am currently making High Quality shit in this. Awesome software and better than SFM.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "My genuine thoughts on this is that it is a highly generalized program. With the add-on support, and the fact that it is free, I do recommend giving it a shot if you want to create something. Though, if you are going for a more voxel look- I would have to recommend something else. (Blockbench is far better suited for Voxel models)\n\nAside from that, you can import models, textures, normals, videos, and even pictures.\n\nHere is my work flow (simplified):\nGet a 2D reference made -> import image to blender and scale it -> create rough outline of object/character -> sculpt\n\nThere is a lot more to it, including texturing and things of that nature- however, I do that part out of blender. So I cannot speak for the quality of that piece of the pie.\n\nI highly recommend animating with this program over something else, like SFM if you can help it.\n\nRemember, if you are willing to put in the time on learning this beast- you will be granted power to animate whatever the fu- heck you want.\n\nThis program also allows for video editing, photo editing, and many more things that you can get through add-ons. \n\nGive it a shot! After all, what is there to lose? (The answer is hours and sanity, but leave that for your rendering issues.)",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Use this software a lot to 3d model as a hobby and I prefer it a lot to other softwares such as Maya or 3Ds as its a lot easier to learn and use",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Free and really good software that you can use to create 3D models, animations, art, and characters for your own game, for example. At first, using Blender may be difficult, but after using it for a long time, it's easy.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the best software applications out there. Great for creative work in animation and games. Great for beginners and experts alike. and it is free!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "My favorite rune sequence is Tab-3-I-RMB-E and then move my magic wand a little.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The Dragon That Becomes Your Friend...\n\nBlender is a powerhouse. Yes, the UI is an initial shock—a \"wall of options\" for any beginner. But give it those first few hours, and you unlock its real potential.\n\nIts key strength isn't just that it's completely free and open-source, but that it's surprisingly lightweight and backed by endless learning resources. I was particularly impressed by the Subdivision Surface modifier; it made turning a basic mesh into my final detailed model (like a cup of tea!) incredibly satisfying.\n\nIt’s complex, but it’s an empowering complexity. For anyone serious about 3D, Blender is the absolute best, most accessible starting point.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's my most played game on steam.\r\n\r\nBlender is one of the best 3D modelling softwares readily available for you. Steam integration and automatic updates makes it the absolute superior software in relation to the other ones.\r\n\r\nother 3D softwares are slow, offer little to no advantages to blender, and cost a fortune.\r\n\r\nIf you can afford it, make a donation to blender's team that's working tooth and nail to make blender the best possible system on a shoestring budget. Any amount helps the free and Open Source community.\r\n\r\nThat's all I have to say. Blender is the best software there is, but it could be better if all users made a small donation to help it out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't afford Maya. But I CAN afford this! \n\nAlso there's about 3 billion free tutorials online. Just,  note that if you're coming from Industry-standard controls, while there is an option to switch to them, most tutorials will be using and displaying Blender controls, so you may just wanna suck it up and learn them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Greatest free and open source  3D software available. As you can see I've used it for over 7k hours at the time of writing this review (plus at least 500 more on the non-Steam version, also steam stopped tracking the hours a couple weeks ago when I updated to a different version a few weeks ago).\r\n\r\nIt's not just free, it's incredibly versatile too. 3D modelling, sculpting, rigging, animating, UV and texturing work, and that's just scratching the surface. You can use blender as a VIDEO EDITOR. You can use it as basically a really capable vector graphic editing and rasterization software to create logos. Oh and physics, fluid, and cloth sims. And Forward/Inverse Kinematics. I could go on for hours. We are blessed to live in a world where this software exists, for free, for everyone, forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me learn that are a ton of ways to make a doughnut and there are a lot of uses and techniques that you can learn from making that very same doughnut. A free game as well heck yeah! 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty neat. pretty hefty learning curve but once you figure it out you can do anything with it. hell yeah !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best modeling software there is. The amount of possibility with this is endless. It takes a while to learn, but if you have the time learn it. Like many other software's out there it comes useful in the real world. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Computer graphics, the field in which it is most acceptable to put a monkey in a blender",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best modelling software you can get. its free and open source, making it super useful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "takes a bit of teaking to get the game running, but still good.\nthe HUD can be overwhelming.\nfreaquent updates and bug fixes.\nlots of DLC and mods.\nit's free so why not give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and challenging, but the story leaves a lot to be desired.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent software, that gets better every update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing, intuitive (once it *clicks*), and a damn load of fun to learn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good app, its more complicated at first but whenever you get the hang of it it all makes sense. I was really confused but I learned and its really useful! I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blender is easily one of the best 3D modeling programs for beginners. The interface is simple, modern, and surprisingly easy to understand, even if you’re just starting out. Everything feels intuitive, and you can jump right into modeling, sculpting, or animation without feeling overwhelmed.\r\n\r\nCompared to older ass software like 3ds Max, Blender feels fresh and streamlined. It’s faster to learn, more user-friendly, and packed with powerful features—all for free. Whether you’re learning 3D for fun or starting your career, Blender is an amazing choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "starting my blender journey, so far so good. will update on whether or not it's peak later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the seven wonders of the digital world. Genuinely a gift from god (tireless open source devs).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a bit difficult but great for animating and creating 3D models.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "poured my blood, sweat, and tears into this game. love it !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good and it's a bit better than SFM. Although, SFM was easier for me to learn, Blender doesn't crash all the time like SFM does.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This software is a godsend for the beginner 3d artists, it almost does everything that maya can do and also have a very active and growing community. \nIf anyone wants to replace maya this is best option",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used this software as Microsoft Store app. Haven't encountered any issues until 5.0 dropped and broke caged baking. Couldn't revert back. Meanwhile Steam makes it borderline easy to roll back to previous releases, which solved my problem. Should have switched to Steam earlier to see the real hours played count, heh.   \r\n As for Blender itself, fire. Everything's there, total freedom and no licence needed. Probably the best thing that could have happened to my laptop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great software for developing designs. I use it on steam to help develop my games. Better then paid software. Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good software for advanced 3D modeling\n\n\n--{ DIFFICULTY }--\n☐ Very easy\n☐ Easy\n☐ Takes a moment to learn\n☐ Can take up to 1 week to know the controls\n☒ Need to watch many tutorials and use it for a month or 2\n☐ Hell\n\n*Note: depends on how do you want to use it, when you start it can be difficult ofcourse, but later you'll need to use stuff like nodes, scripting, etc. So if you're not skilled much in programming / computers it can take longer.\n\n--{ Price }--\n☒ Free\n☐ Should be more expensive\n☐ Worth it\n☐ Good if you're sure you're gonna use it often\n☐ OK\n☐ Not really worth it\n☐ Expensive\n\n--{ DISK USAGE }--\n☐ Can run on a nokia\n☐ Can upload save files / other stuff to a random 5 MB USB key you found in the bin\n☐ OK\n☐ A good disk recommended\n☒ Uses a lot of storage\n☐ Even a black hole can't hold it\n\n*Note: the software itself doesn't need that much storage, it's just the save files. Keep in mind that a .blend file of a small-sized model can be up to 250mb - depending on how much detail you put there. But large models can use up to 1gb.\n\n--{ PERFORMANCE }--\n\n☐ Can run on a potato\n☐ A school computer can have 120 FPS on this\n☐ Can use grandpa's old PC without lag\n☐ OK\n☐ Can run normally on a cheap PC\n☐ Use a good PC\n☒ Use a gaming PC\n☐ Ask NASA for a spare computer\n☐ 1 FPS on a NASA computer\n\n*Note: you won't have lag when you're creating a small model even on a slow computer, but after adding physics, particles, nodes, etc. It can be laggy, for example, I'm not on the best PC ever, and it works fine but I have like 10 FPS when using rendering preview or now when I'm making a map for my FNaF fan game, the material preview makes it like 30 FPS.\n\n--{ RATING }--\n\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☒ 9\n☐ 10\n\n\nAlso, almost everything depends on what you're creating, high quality & high detail scenes can take up to 2GB and have low performance.\n\nFeel free to ask me questions, I will respond!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Started using blender just to learn how to make effects for a game and then kinda learned a bit more still not good at it but blender will always be amazing after that learning curve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its so great for animating! really smooth i recommend it if you wanna animate or learn designing models! sure, the learning is a bit hard but its still good as a beginner i like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, even tho i haven't really made something worthy of earning money from it, i'm having a blast learning all the little things you can do, learning all the hotkeys, and modeling.\nAmazing software, it keeps on getting better and better.\n\nAlso f**k adobe!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's free and open source even when lots of other programs cost way too much money. Based.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST MODELING GAME EVER i am making a game and i need models and this is SO SO good would highly recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly easy to get a hang of the basics, just don't get overwhelmed and watch some tutorials",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say, Blender's been my main tool for a few years now and I'm glad to see it getting more accepted in games industry. It is so versatile and grows so fast that if you start with it you are in for a lifelong learning experience. Community is great and it enables me to do my dream job and meet other likeminded people while at it, what's not to like?\r\n\r\nWell sometimes the absolute coordianate system can be a bit annoying especially when animating, I still would say Cinema4D does such things better. Other thing is that some processes like simulations are taking very long to compute but well, it is what it is, with better tools people would push them to the limit and also complain they are slow. \r\n\r\nOverall 10/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing example of an open source project which listens to its users and improves on itself every iteration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bold move creating this software that competes with industry standard stuff and make it completely free and open source",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a fantastic modeling animating and rendering software ive used this for just under 500 hours when i write this it is amazing you can do so mutch plus its free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not an expert in this software but is the best option so far that is not even funny to compare to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100 horas depois, sinto que ao inves de um bebe jogado no escuro agora eu sou uma criança sem pais em uma casa assombrada que conheço vagamente os comodos. Recomendo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice and good software. It is quite advanced and hard to figure out, but when you start to get a hang of the basics, like editing and sculpting, it is a blast to work with Blender.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spent my first 2 hours staring at a cube, spent another 2 deforming it, 200 hours later i figured out how to build a house",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy to customize, lots of tutorials on other sites, the very basic 3d editor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Blender. Wish it had working simultaneous touch and pen display navigation like Maya does... it currently does not support touch screen pen displays.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I use it all the time for a variety of tasks around making models. Making layouts of interiors, making diagrams for theater and visualize lighting, and to make and edit 3D models for printing. I have worked on making models for import into 3D game engines as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great gameplay, easy to learn and hard to master",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best open source mesh-based 3D creation software ever. I use it for a lot of accurate modeling for FDM 3D printing.\n\nFor accurate modeling, people generally use other CAD software for parametric modeling, but in my long time using it, I have found that mesh-based modeling also has some unique advantages.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i use this for many different games, some require .DAE and update 5.0 removed it, i cannot use a different file so this is bad for me, so i have to stay on 4.5, other then that it works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "way too stupid and inexperienced to use this, but still good.\r\nP.S. I totally didn't cry for 30 minutes while watching a tutorial on how to use it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing story but the dae portion of the game is super hard cuz it kept crashing\r\nbesides that amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Provides everything you could need for 3D and 2D animation. Open source, completely free. Very helpful program, would recommend for aspiring 3D artist, new and experienced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for just about anything and its free so that adds to the positive side of blender",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works great. Quite difficult to learn for newbies but I'm slowly easing myself into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great app for modeling and rendering, learn it. Also underrated for sculpting.(Yes it's not Zbrush but you'll be fine for most situations)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game a lot. You have a LOT of character customisation, and the open world you can work with is huge! It lacks a bit of story, but otherwise this is great!\r\n\r\nalso add sex",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's nice to use, lots of tutorials, and I can actually make cool things,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good program thank now i can do animations and games and its wery fun.But its 1 problen you need really good pc do to somethink but don,t do anythink here if you play on toaster.i need around 1min to just klik texture paiting i don,t angry its a good program",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blender is the best 3D software for me, but you can also do other things with it besides 3D, because this application can do a lot of things, such as animation and 2D graphics. However, if you are new to this software, you may have some problems because it has many features and options, but if you want to, you can learn it. I can recommend it to anyone who wants to model or create something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spectacular modeling software. Very simple to use. And best of all, it is free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first 3D modelling experience. Hard to navigate at first, but my workflow feels smooth and seamless a while later. And considering that it's free software, Blender is just amazing with all the features that come with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free, open source, and for many purposes easier to use than industry standard paid software.\n\nThe steam release makes it easy to receive updates for any particular LTS branch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can basically do anything with this program its cool as hell. \r\n\r\nSo many great UI choices, its a little overwhelming at first but once it clicks its great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of if not the best free pieces of software ever made. There is so much you can do all under one program. It's constantly being upgraded and it is impressive how far it has come and can rival with extortionately priced competitors.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a lot of buttons and features. Comes without tutorial :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Blender [/h1]\r\n\r\nThis is not a game, more of a game designers place of work. This is where the magic to many games happen. Blender is a program, where you can make anything.\r\n\r\nMy experiance for this program has been long, i started 2021 and have 100 hours, and its worth the price (its free).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good for modeling animating and stuff like that and dont forget the rendering",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good. Has it's limitations however, and if you really want an optimised pipeline to creating assets for movies or sculpting, then Zbrush and Maya are pretty much a must. If however you are a beginner, novice or intermediate and are simply looking to understand how everything is made and done, then it's perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best free modeling software ever! i do all my modeling on here. Even CAD. Unlimited possibilites with addons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best 3D modeling and animating apps ever I seen, I didn't expect it will be in steam, I've been using this for straight hundreds of hours, this is my 11th hour in steam, I was using it at Microsoft store before.\r\n\r\nAPPROVED!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff. If you're on Linux, for the love of whatever you believe in, install it using your package manager - Steam version doesn't recognize ROCm HIP being installed on a system. Now sure how it is on NVidia GPUs, but if you can't use the GPU for Cycles rendering, then Steam might be the culprit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "high skill floor and ceiling, so it's tough in the early game, but it pays off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game dev is actually fun with this. Other 3d softwares piss me off but when i make something the neurons in my mind click and its so fkn satisfying. Plus free and open source. try it out please",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good for basic video editing and such. Haven't used it much for other stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blender is a thing. A free, open-source thing that exists somewhere in the mysterious digital void. It is both a software program and a test of human patience. People use it to create 3D models, animations, and emotional breakdowns, often all at once.\n\nWhen you open Blender, you are immediately greeted by a cube. This cube is not special. It is not a metaphor. It is simply… there. Sitting in the center of your screen like a smug little block saying, “You will never truly understand me.” Many people delete it instantly, while others spend their entire careers trying to make it into something meaningful, like a spaceship or a convincing donut.\n\nNow, let’s talk about the interface. Imagine sitting inside a cockpit made entirely of buttons, sliders, and menus — and every single one of them does something, but you have no idea what. That’s Blender. The interface isn’t so much “user-friendly” as it is “user-tolerant.” It doesn’t crash immediately, which is how it says “hello.” You might spend your first three hours trying to figure out how to move the camera, rotate an object, or even exit the program.\n\nOnce you’ve mastered the basics — which should take roughly the same amount of time as earning a degree in rocket science — you can start modeling. Modeling in Blender involves shaping polygons into forms that vaguely resemble things you’ve seen in real life. A chair, a car, a person, or an existential representation of your suffering as you try to fix a single misplaced vertex. The possibilities are endless, mostly because there are no limits on how badly things can go wrong.\n\nNow let’s move on to rendering — the sacred ritual of turning your chaotic mess of polygons into something that looks pretty. You hit render, wait for what feels like three presidential terms, and then realize you left the light off. Congratulations, you’ve just made the world’s darkest masterpiece. You try again, crank up the samples, and your computer starts making noises that suggest it’s trying to ascend to another plane of existence.\n\nBlender’s sculpting tools are a magical experience for those who enjoy pressing random buttons until something looks vaguely like a potato. You can mold virtual clay into anything your imagination desires — or into something unrecognizable that still somehow feels personal. If Michelangelo were alive today, he’d use Blender for five minutes, sigh deeply, and go back to marble.\n\nLet’s also discuss the node editor, the part of Blender where all logic goes to die. It’s a sprawling web of boxes and lines that make you feel like you’re hacking into the Matrix, except you’re just trying to make a piece of glass look slightly shinier. You’ll connect 47 nodes, and then suddenly, your object turns bright pink — the universal sign that you have angered the gods of 3D.\n\nBlender also includes animation tools, which is great if you’ve ever wanted to move something frame by frame until your wrist gives up. You can make a bouncing ball, a walking character, or a 45-second cinematic short that took six months of your life and now lives only on YouTube with 32 views and one comment from your cousin saying, “cool.”\n\nAnd then there’s the simulation system. You can simulate fluids, smoke, cloth, or even your will to live evaporating as the physics engine explodes your project for no reason. You spend hours tweaking gravity and viscosity only to watch your “realistic” water behave like jelly. It’s incredible, in the same way natural disasters are incredible.\n\nOf course, Blender has addons — small plugins that promise to make your life easier and end up making it slightly different instead. You’ll install a dozen of them, forget what half do, and then find your UI looking like an alien control panel. But that’s okay, because customization is key… even if it means you’ve accidentally turned your timeline into a spreadsheet.\n\nThe Blender community is another marvel of modern civilization. You’ll find thousands of artists sharing breathtaking renders that make you question every life decision you’ve ever made. “Made in Blender,” they’ll proudly say — as if those words aren’t also a warning.\n\nIn conclusion, Blender is not just a piece of software. It’s an emotional journey, a rite of passage, a philosophical experiment about human perseverance. You will love it, hate it, and eventually whisper “Ctrl+S” in your sleep out of sheer muscle memory.\n\nFinal Score: 8.5 out of My GPU smells like toast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "at first the gameplay is pretty bad and theres not really a storey, but as you continue the storey and gameplay start to cook.\r\n\r\nwould recommend this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "blender is easy\r\n\r\nstep 1: delete default cube\r\nstep 2: add cube\r\nstep 3: turn cube into masterpiece \r\n\r\nand done! Thank me later :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yea it's pretty cool and it doesn't make me any less poor so that's a bonus.\r\nDo I know how to make good models after 320 hours? No not really.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "remeber, no matter what the issue is, smooth shadign will fix it (works with relationships too I tried)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favorite psychological survival horror. Best played with a controller.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing software, not confusing and easy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "easy to learn, runs natively on linux, free and open source. pretty much all you could ask for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "altough i am starting to get it, i can't stop second guessing that i should have just picked up piano as a hobby instead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is nice to use on steam because clang fucks up my system's settings on linux",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used this for 11 years now and its only ever getting better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have hundreds more hours off of Steam with this program. Used it because it was free. Stayed because it was incredible. Trust the process. Take the time to learn the interface and you can make some really cool stuff.\n\nIncludes 3D hard surface modeling, sculpting, animation, texturing via paints and graph nodes, etc. All around an amazing software to be offered for free. \n\nThank you Blender Foundation!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best 3d tool in the market, for everyone, from starters to professionals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Evil bastard crashed my computer! If me and Blender weren't chill like that all the way back to version 2.0, I'd crash out. \n\nI love you Blender. Well, usually.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing program where you can unleash your imagination and create whatever you want, from a donut model to a beautiful animation :) Many hours in it and even more ahead of me :) I recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blender has a steep initial learning curve, but it's worth the effort to get familiar with it's workings. The application is so robustly packed with features, you could languish in just one field or gradually come to master several.  Once you understand the basic inner-workings, it feels intuitive to jump between the interrelated functions. And that knowledge may be beneficial to the novice who wishes to venture onward to industry-standard applications.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ever since I switched to linux mint I can't get HIP to work through steam however if I run it from a script it works which kinda defeats the whole purpose of having blender on steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible 3d modeling software, would strongly reccomend to others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blender is amazing and forgiving for beginners.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've spent a little time using blender and i recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "50% 3D modelling, 50% watching tutorials. You will probably need internet to use this program. But dang, you can do so much in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great 3D modelling software! Nice to have the option of keeping it up-to-date by Steam. But don't forget to support the project at https://fund.blender.org/ - Steam Workshop does it too ;-)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "After the 5.0 update, why can't I save a project by naming it, and instead the shortcut is pressed, for example when I give space playback, it runs in the background save As",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If only it was more user-friendly, then I could actually recommend it. At this point, Blender is still just for people who already know Blender, with no in-program tutorials or guides and extremely nested and confusing design choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "เวลา update ช่วยให้มัน load setting เก่า ไปเลยเหอะ แม่งกดพลาดไปที เสียเวลามาตั้งค่าใหม่ เสียเวลาชิบหาย หรือใครที่อ่านปัญหาของผมแล้วมีวิธีแก้ช่วยบอกหน่อย",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant rebind 2d pan in neither the steam version nor the non-steam version. I can rebind other functions, but this one, despite saying it can be rebound, stays on shift+mmb no matter what I change the bind to. Minimal results on google for the issue, annoyed the fuck out of me for like an hour, will use something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant wait to start modeling and having fun screwing around,i says before being bombed by the most confusing hell hole known to man.\n\nreally though,this is not made for someone starting out with modeling,its confusing as fuck and just overly hard, don't download this crap no matter how many youtubers use it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "wiki game :/, could be more intuitive... like, some yellow paint and stuff",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "never felt more suicidal in my life until this moment, please save yourself and don't try to learn blender",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Here's what's great about Blender: it's free. Building anything even remotely close to what's shown in previews...you're better off sealing yourself in a monastery and devoting your life to learning the arcane and mystical controls of Blender. You will spend umpteen hours trying to figure out why, in spite of video tutorials and reading...why it simply refuses to do anything you want it to. Coming from more productive (albeit more expensive) 3D engines of the past, I'm unable to do anything but very simple modeling in this engine. You won't even get to rendering or animation, likely, unless you devote yourself to hundreds of hours of study. It truly is impenetrable and unintuitive, and just seems to do whatever it wants. I learned AutoCAD easier than this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game isnt finished at all and it gets to a point where you have to make the graphics yourself which is just laziness from the devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This product ruined my life and stole 7,500 hours I will never see again. will make you hate everyone and everything. overall, It's pretty decent.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Didn't help me make projects like my VRChat avatars, and is more complicated in my opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too hard idk how to do anything in blender, the tutorials are crap, and my best friend is the starting cube",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5 hours of wasting my life, I created NOTHING, 5 hours of learning for NOTHING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "blender was made by stupid fucking chuds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the fucking worst programs ever made - IGN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts cant even run on my computer </3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weh get help doh kalau 3d toz XDDD AMIRITWE OR AMIRITE AKAAKKA helu?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use literally any other modeling/CAD software.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I mean its alright, like its overrated but its okay\" - cupcake man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring Latvian cat back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "still dont know how to use it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont get it :3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no sex included had to make it myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how do i  refund my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very insightful",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sigma sigma on the wall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blender >:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blender 5.0 is a buggy piece of shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Using blender is like having a child that pukes everywhere he goes\nYou kind of like him, you're greatful to have him but you always have to clean up his fucking mess, you'd throw him away but you're too attached to do it\nIf you haven't adopted this child. Do not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "richtig kake",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i already hate my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wa",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "q",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the 5.0 update, why can't I save a project by naming it, and instead the shortcut is pressed, for example when I give space playback, it runs in the background save As",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "functionality and navigability can coexist. the creators of this dont seem to be aware of that.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If only it was more user-friendly, then I could actually recommend it. At this point, Blender is still just for people who already know Blender, with no in-program tutorials or guides and extremely nested and confusing design choices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เวลา update ช่วยให้มัน load setting เก่า ไปเลยเหอะ แม่งกดพลาดไปที เสียเวลามาตั้งค่าใหม่ เสียเวลาชิบหาย หรือใครที่อ่านปัญหาของผมแล้วมีวิธีแก้ช่วยบอกหน่อย",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant rebind 2d pan in neither the steam version nor the non-steam version. I can rebind other functions, but this one, despite saying it can be rebound, stays on shift+mmb no matter what I change the bind to. Minimal results on google for the issue, annoyed the fuck out of me for like an hour, will use something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant wait to start modeling and having fun screwing around,i says before being bombed by the most confusing hell hole known to man.\n\nreally though,this is not made for someone starting out with modeling,its confusing as fuck and just overly hard, don't download this crap no matter how many youtubers use it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "wiki game :/, could be more intuitive... like, some yellow paint and stuff",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "never felt more suicidal in my life until this moment, please save yourself and don't try to learn blender",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Here's what's great about Blender: it's free. Building anything even remotely close to what's shown in previews...you're better off sealing yourself in a monastery and devoting your life to learning the arcane and mystical controls of Blender. You will spend umpteen hours trying to figure out why, in spite of video tutorials and reading...why it simply refuses to do anything you want it to. Coming from more productive (albeit more expensive) 3D engines of the past, I'm unable to do anything but very simple modeling in this engine. You won't even get to rendering or animation, likely, unless you devote yourself to hundreds of hours of study. It truly is impenetrable and unintuitive, and just seems to do whatever it wants. I learned AutoCAD easier than this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game isnt finished at all and it gets to a point where you have to make the graphics yourself which is just laziness from the devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This product ruined my life and stole 7,500 hours I will never see again. will make you hate everyone and everything. overall, It's pretty decent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't help me make projects like my VRChat avatars, and is more complicated in my opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too hard idk how to do anything in blender, the tutorials are crap, and my best friend is the starting cube",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5 hours of wasting my life, I created NOTHING, 5 hours of learning for NOTHING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "blender was made by stupid fucking chuds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the fucking worst programs ever made - IGN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts cant even run on my computer </3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weh get help doh kalau 3d toz XDDD AMIRITWE OR AMIRITE AKAAKKA helu?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use literally any other modeling/CAD software.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I mean its alright, like its overrated but its okay\" - cupcake man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring Latvian cat back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "still dont know how to use it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont get it :3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no sex included had to make it myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how do i  refund my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very insightful",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sigma sigma on the wall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blender >:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blender 5.0 is a buggy piece of shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Using blender is like having a child that pukes everywhere he goes\nYou kind of like him, you're greatful to have him but you always have to clean up his fucking mess, you'd throw him away but you're too attached to do it\nIf you haven't adopted this child. Do not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "richtig kake",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i already hate my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wa",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "q",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the 5.0 update, why can't I save a project by naming it, and instead the shortcut is pressed, for example when I give space playback, it runs in the background save As",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "functionality and navigability can coexist. the creators of this dont seem to be aware of that.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "เวลา update ช่วยให้มัน load setting เก่า ไปเลยเหอะ แม่งกดพลาดไปที เสียเวลามาตั้งค่าใหม่ เสียเวลาชิบหาย หรือใครที่อ่านปัญหาของผมแล้วมีวิธีแก้ช่วยบอกหน่อย",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun to mess around with but absolutely atrocious to start using as a new person and completely overwhelming with the amount of buttons and confusing unclear descriptions. I wouldn't actually recommend it to anyone starting out just because how frustrating and demoralizing it is to learn. I would really only recommend it to people who have many hours already in similar softwares.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant rebind 2d pan in neither the steam version nor the non-steam version. I can rebind other functions, but this one, despite saying it can be rebound, stays on shift+mmb no matter what I change the bind to. Minimal results on google for the issue, annoyed the fuck out of me for like an hour, will use something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant wait to start modeling and having fun screwing around,i says before being bombed by the most confusing hell hole known to man.\n\nreally though,this is not made for someone starting out with modeling,its confusing as fuck and just overly hard, don't download this crap no matter how many youtubers use it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "wiki game :/, could be more intuitive... like, some yellow paint and stuff",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "never felt more suicidal in my life until this moment, please save yourself and don't try to learn blender",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Here's what's great about Blender: it's free. Building anything even remotely close to what's shown in previews...you're better off sealing yourself in a monastery and devoting your life to learning the arcane and mystical controls of Blender. You will spend umpteen hours trying to figure out why, in spite of video tutorials and reading...why it simply refuses to do anything you want it to. Coming from more productive (albeit more expensive) 3D engines of the past, I'm unable to do anything but very simple modeling in this engine. You won't even get to rendering or animation, likely, unless you devote yourself to hundreds of hours of study. It truly is impenetrable and unintuitive, and just seems to do whatever it wants. I learned AutoCAD easier than this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game isnt finished at all and it gets to a point where you have to make the graphics yourself which is just laziness from the devs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This product ruined my life and stole 7,500 hours I will never see again. will make you hate everyone and everything. overall, It's pretty decent.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Didn't help me make projects like my VRChat avatars, and is more complicated in my opinion",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too hard idk how to do anything in blender, the tutorials are crap, and my best friend is the starting cube",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If only it was more user-friendly, then I could actually recommend it. At this point, Blender is still just for people who already know Blender, with no in-program tutorials or guides and extremely nested and confusing design choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "5 hours of wasting my life, I created NOTHING, 5 hours of learning for NOTHING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "blender was made by stupid fucking chuds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the fucking worst programs ever made - IGN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts cant even run on my computer </3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weh get help doh kalau 3d toz XDDD AMIRITWE OR AMIRITE AKAAKKA helu?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use literally any other modeling/CAD software.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"I mean its alright, like its overrated but its okay\" - cupcake man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bring Latvian cat back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "still dont know how to use it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont get it :3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no sex included had to make it myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how do i  refund my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very insightful",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sigma sigma on the wall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blender >:(",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}