{
  "positive": [
    {
      "review": "This is a bit of a guilty pleasure for me. Similar to Euro Truck Simulator 2, I'd classify this as a zen gaming experience.\n\nBad weather outside? \nPop on some headphones, open a podcast and learn something about trains.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Well, it's yearly TSW, with a free upgrade option (if you didn't sleep on it, if you did, just wait for the next year). There are several changes that are actually impressively pleasant, like random events or faults on non-expert trains. The full version is just paying for routes, and I love all three of the base routes of it. The extra trains are... fine, ALP-45DP is actually quite interesting, the rest is just fine.\r\n\r\nOverall, can recommend.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game isn't all too different from the past generations. Though the thing that makes me recommend this game, is the free starter pack. \r\n\r\nIf you're like me, and own older TSW games, the starter pack is great! You get the new game, just without any of the new trains (that's why it's free) but the good thing is, all your older routes transfer over! \r\n\r\nFor some of you who don't already own TSW content, you can simply purchase the game which is often on sale. And when TSW 7 eventually comes out next year, the content you got when purchasing TSW6 will transfer over. \r\n\r\nIf you haven't ever tried a TSW game, and don't want to purchase the game until you know you'll like it, the free starter pack comes with a small map that is almost like a training facility/sandbox. It has a few trains that you can play around with and test out, to see if you'll like the game or not.\r\n\r\nI'm personally not a fan of the devs practically re-releasing the same game every year, just with a handful of new routes. But as long as they keep the free starter pack as an option, I'd say the game franchise as a whole is decent.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "TSW6 is for all the new people if you have TSW5 you wont need a TSW game for another few years \n\nthe game is fun ngl, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its GREAT! There are a lot of routes and fun trains to drive with amazing graphics. There are also tons of DLC that keep me engaged.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good but buggy and hard on your computer, get it in a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crashed on me once but other than that, it's just a bit more polished version of TSW5. Nice of the devs to give it to me for free :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Train Sim World 6 is a relaxing and fun game. The trains look good, the routes are nice, and the controls are easy to learn. It runs smoothly and feels realistic.\n\nI recommend it if you enjoy calm and realistic simulation games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean it's alright, nothing better than TSW5 but I think they put the best train on a shortest route, the SBB RABe 523 which i think it NEEDS to be on some German routes of 50km+",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all, this isn't TSW6. It's TSW 1.6 and even then... The yearly new \"version\" is just a way to get online attention but adds so little to the game that other devs would be embarrased to even call it a major patch. There's nothing revolutionary about it. Whatever keeps selling routes, I guess.\r\nThen why do I still recommend it? Because despite all its shortcomings and scammy marketing, it's still a lot of fun. Yes there are better sims out there, but sometimes you don't want to go through a 15-page checklist to get your loc running. Hop in, close the doors and watch the scenery go by while you aim to be on time at the next stop or simply hold the speed limit on a downward slope. The learning curve is not that steep and things are pretty well explained, contrary to many more serious sims.\r\nSo if you're looking for a more relaxed train driving experience and don't run a potato, give it a try. Just don't be fooled by the all DTG's promises and \"exciting news\" that comes every year around August...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great graphics fun to just chill and play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite its flaws, still the most enjoyable train sim available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played TSW 6 much but to be honest it's fairly similar to the previous versions. I know everyone complains that they don't add much to the game each release but it's the same story for all the sports games that get copied and pasted each year. Besides that, it's a well made game. Very fun and relaxing to drive trains or even just sit in them for fun. Very easy for me to say as a huge railfan but it's so much more fun than basic Train Simulator which is also enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Haven't played that long by hours but it is very similar to TSW5 (which I have played for a amount of time I'm not willing to admit) and the new NJT routes are awesome. Also there are a lot more realism options. As far as I know every DLC compatible from TSW5 (and any you already own) are compatible and automatically install with the game. If you have TSW5 you can uninstall it and have this instead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always recommend this sim.  It is more immersive than Train Simulator Classic, (which I also play).  The graphics are better, if your computer can handle it.  However, I must warn that it is more centered around passenger operations.  US freight is severely lacking.  So it that is your main thing, TS Classic may be your game.  Hopefully, they will, at some point; add more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best train simulator out there, despite the needs for optimization, graphical updates, cheaper DLC, and no yearly release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fab game with so much stuff to do. If only routes and sounds were 10/10 and that they used Unreal engine 5!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty neat game if you like trains. Had fun rolling around the training grounds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TSW6 is my go-to game for unwinding after a long day :)\nIt’s not perfect—there are bugs and rough edges, and the quality of DLCs can vary a lot. I’d suggest grabbing most of them on sale.\nStill, the game is incredibly relaxing and occasionally can look genuinely impressive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is 10/10 amazing trains amazing maps and amazing graphics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely visuals and fantastic if you love trains. Base content is good this time around with some exciting lines form new countries on the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game runs decent. I dislike the many iterations each and every year, so only free starter pack is recommended in combination with old DLCs in sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TSW6 adds three new routes and a dynamic random events system with signal delays and train faults. The cab details are excellent and station announcements feel authentic. However, visual bugs like floating textures occur, and it doesn't feel substantial enough for a full new release.\nVerdict: Great for train sim fans, but if you own TSW5, wait for a sale. The improvements are nice but incremental.\nRating: 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but seems there's no major improvements each new release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you always enjoyed watching and driving trains, this is the game for you it has full mod support from train sim community website and a huge variety of mods to play from, i do must say the game is pay to win as if you want to drive a certain train you most likely have to buy the dlc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play Train Sim World 4 for the first time, didn't realize I was so obsessed with this game until now Trian Sim World 6 release. For me this game has many problem that should be fixed, and the most annoying problem is to stuck when I leave the chair and I always move onto the roof then I can't do anything, especially Bakerloo Line. Still even if there's a problem with this game, I still enjoy how realistic this game is, and it's teach me so many many things about how railway works. You won't regret buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As far as train sims go, it's pretty decent. Not sure why they decide to release a 'new game' each year when it could just be an update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but needs a lot of bugfixing and performance upgrades",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is cool and amazing. the game doesn't have a lot of Steam Locomotive with they only being 4 Steam Locomotive classes and Dovetail has stated that they won't being adding more Steam locomotive in to TSW due to the Issue they are having with teh Steam locomotive Physics but despite that the game is over haul great but they do release a New Train Sim world game every year. But overall the game is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite some bugs this game has within it, I really enjoy playing this game and I do tend to play it a lot.\nThere are a lot of things the DEV's could do, to make this game a lot better, such as:\nMaking the routes longer, as I enjoy long routes, instead of the standard 50 miles long and I do wish they would finish routes, from the beginning of the route, to the end, instead of starting halfway through a route.\nThis is one of those games, that your either interested in, or not.\nWould I recommend it? Only if this is your type of game and you don't mind some bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good start to a new game. most if not all DLC from the previous game transferred over to this one. waiting to see what they do next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, I recommend getting the Free version on release if you don't want the DLC in the Deluxe or Special editions or the standard version if this is not your first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b] Lets start with the good: [/b]\nThis overall is a very fun train simulator/game.\nBalances realism and playability well most of the time.\n\nYou can play with or without safety systems most of the time which makes the game/simulator more accessible.\n\nWorks well under the default Proton on Linux (Arch in my case) which is a nice bonus.\n\nQuality can be hit or miss depending on the DLC(s) you get.\nAs of writing this the only good European route not located in Germany for me is Zwolle - Groningen which is well made and works well overall.\n\nMost DLC have a good amount of services and things to do. There often are multiple types of services such as passenger runs, cargo runs and even shunting operations.\nThere also is the conductor mode which seemed like, and can be a fun addition. I tried it a few times and was rather disappointed with it; more on this below.\n\n\n[b] On to the not quite so good: [/b]\nUnfortunately the French LGV route is rather poor in quality and detail, especially environmental detail is lacking. It only includes one train type, the TGV Duplex 200 CM. This makes the route feel rather bland and empty at times. The safety systems are rather lackluster in terms of implementation (I am aware this is an older route from TSW2 but I still think this can be important to note as it is still on sale for TSW6 and some of its issues such as the buggy/wrong implementation of TVM and safety systems should be addressed)\n\nUnfortunately being made with Unreal Engine doesn't help this game as it has the dreaded stutters when loading in new areas while driving basically all the time.\n\nThe conductor mode is rather basic and quite buggy at times (think being unable to check tickets from certain passengers, a service not properly detecting you close the doors etc.) A lot of the issues with this also stem from the relatively bad passenger system, which should have been addressed before adding the conductor mode.\nThe conductor mode to me is more of a novelty and I personally would not care if it was never added or were to be removed entirely.\n\nThere is a distinct lack of custom controller support, which has been a community (and personal) request for quite a while. There now is the HTTP API, but it is rather hard to use as it is basically undocumented from what I could find.\n\n\n[b] Overall: [/b]\nOverall this game/simulator has a lot of potential to be really good, but it desperately needs more optimization, lots more bug fixing and a proper direction to go towards instead of trying to be everything at once.\n\n[b] I still recommend this as it currently is, for the average person it will still be a very enjoyable game/simulator as long as you stick to the better made/rated DLCs [/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most realistic rail simulator I have come across, with a variety of routes available, albeit for quite the price. I would only recommend to anyone already interested or invested into trains and railways given the steep price to add content, but it's still a very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Buy only relevant DLC or wait for sale to pick up DLCs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DLC's from TSW 2020 & TSW 2 doesn't work for me and I need to buy them again.\n\nOk, game is still good, but I'm very disappointed about DLC's library, that I bought before for early parts of TSW, not a single of many worked on TSW 5 or TSW6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy games then this is for you. Great routes, great attention to detail and 100+ add-on routes & locos to chose from",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is realistic like the real one but they need to fix some bugs the random fps drops and some other bugs that i cant explain (its not my pc) also for some players it will be hard at first but after some time you can play the game normaly i reccomend it to everyone!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great package. It allows you to have a train journey, and so much more! The details and graphics are so real and interactive. It also is very good for improving concentration... as there can be so much attention required to gaining skills and actions. If there are any dislikes, which are so few, these are the passengers and their movements. Robotic comes to mind; and unfortunately for me with my career on the infrastructure, spot lots of discrepancies... However these things do not spoil the adventure and enjoyment in traveling with such an amazing simulator. Well done to a great team at Dovetail, Train Sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't listen to the haters. This version is the best yet. I was skeptical because yearly releases are usually just a minor graphics improvement with the same old. Lots of reviews confirmed that. THEY WE'RE WRONG This version runs better, looks better, and has more DLC. Worth the buy in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so realistic for us train lovers, I recomend it to everyone that loves similations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the same game from Train sim world 5. Nothing has changed apart from announcements (which there are mods for) and train faults (which honestly are quite annoying). If you enjoyed tsw5, then you'll enjoy this. Only downside is the amount of bugs present in a 'new' game...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far a lot of fun. Its fairly straightforward and a relaxing way to spend an evening. Recommended,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☑ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There is no complain for the free upgrade. Just played the new British track, it looks good with seaside scenery. \nRemember to optimize the game performance by editing the engine.ini according to those train fans website.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I literally paid $50 - $60 just for NJ though the Santa Fe is my next I may still have to get as well Dovetail continues to make a habit of making the game count higher with no difference from the prior versions):",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "STUNNING as always. Compare to other train simulators, this is still outstanding in comparison of reality.\r\nWell done team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game looks amazing. The tutorial is easy to follow but my main complaint is that it's marketed as free, but once you start playing you realize that you can only do the tutorial. I will say the constant popups and ads telling you to buy the game are pretty annoying. Pretty good looking game, amazing gameplay, but way too high of a cost for anything useful. If you got the money, I recommend it, if not, no.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game and i will never hate it absolutly recomend it for all train fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please include Indian Railway network and locos as well. India's Alco WDG Diesel Locos are super cool. Also, Alstom is also working for Indian railways. Alstoms WAG12 is one of the most powerful electric Locos in India. Also the Konkan railroad route in India is really challenging. The game is super cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a great game enjoying the Riviera Line and the game as a whole is very stable. However, It is the same game as TSW4 Just re-released with new content which is expected of Dovetail with The train sim world series. I do not recommend getting TSW6 if you already own any Train sim world games from 3 and above since its the same game with the same graphics re-released each time, Apart from that great game And for new people wanting to try TSW great game to begin on!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Train Sim World 6 is Dovetail Games’ latest entry in its long-running railway simulation series, a franchise that has steadily evolved into one of the most immersive and detailed train-driving experiences available. Developed and published by Dovetail Games under the TSW label, this installment continues the studio’s commitment to authenticity, expanding on the systems and realism that have defined the series. Rather than reinventing the formula, it builds upon the foundation established in previous entries, refining features, introducing new mechanics like random train faults and station announcements, and delivering a fresh set of routes that take players across some of the world’s most iconic rail networks. For those who find joy in the rhythmic hum of steel wheels on track and the delicate balance between precision and timing, Train Sim World 6 offers a familiar yet deeper dive into the art and discipline of railroading.\n\nAt its core, Train Sim World 6 remains focused on recreating the genuine experience of operating real trains, from suburban commuter services to high-speed passenger runs and industrial freight operations. Each locomotive is rendered with meticulous attention to detail, complete with fully interactive cabs, authentic controls, and accurately simulated safety and power systems. The developers have painstakingly modeled real-world systems such as PZB and LZB in Germany, AWS and TPWS in the United Kingdom, and ACSES in the United States, ensuring that every button, lever, and indicator serves a purpose. The new Train Faults system introduces an additional layer of unpredictability, allowing various equipment failures such as lighting issues or turbo malfunctions to occur mid-route, demanding on-the-fly troubleshooting. This feature pushes the simulation closer to the unpredictability of real-life train operations, rewarding players who have taken the time to understand every aspect of their vehicle’s inner workings.\n\nThe game’s content selection is as strong as ever, shipping with three distinct routes that span multiple countries and operational styles. Players can navigate the busy NJ Transit Morristown Line in the United States, balancing tight commuter schedules through the metropolitan sprawl of New York and New Jersey. Across the Atlantic, the Riviera Line in the United Kingdom offers a scenic journey along the Devon coast, combining the relaxed beauty of rural England with the challenge of maintaining precision along winding tracks. Meanwhile, the Leipzig–Dresden route in Germany delivers high-speed ICE services and freight operations through one of Europe’s most dynamic rail corridors. Each route comes with its own locomotives, services, and challenges, offering a diverse mix of gameplay that keeps the experience fresh. The improved layering system ensures that trains from previous DLCs can integrate seamlessly into the new routes, creating a dynamic network where the player’s collection of locomotives feels increasingly interconnected.\n\nVisually, Train Sim World 6 achieves a level of polish that continues to set the series apart. The environments are richly detailed, with realistic lighting effects, varied weather patterns, and time-of-day changes that transform familiar routes into completely different experiences depending on the conditions. The interiors of train cabs are beautifully crafted, down to the texture of worn levers and the subtle reflections on glass panels. The passenger ambience has also seen noticeable improvement, with station announcements, crowd chatter, and realistic movement lending more life to the world. There is a genuine sense of place that the visuals and sound design together achieve—whether you are crawling through a foggy morning in rural Germany or racing through a thunderstorm toward New York Penn Station. Despite its strengths, however, performance can be inconsistent at times, with pop-in textures and framerate dips occasionally breaking immersion, particularly on older hardware.\n\nFrom a gameplay perspective, Train Sim World 6 walks a careful line between accessibility and authenticity. For newcomers, the game’s tutorials are a welcome starting point, guiding players through the complexities of train operation step by step. Yet beneath that surface lies a depth that will satisfy even the most dedicated rail enthusiasts. Learning to read the signals, managing speed limits, controlling braking systems, and dealing with random mechanical faults all require patience and concentration. The addition of a more dynamic passenger system and live station announcements gives context to your performance—miss a stop or mishandle a departure, and the world responds accordingly. Time management remains critical, as each route challenges players to balance efficiency with safety, and the tension of racing against the clock without sacrificing precision creates moments of genuine excitement. This installment doesn’t aim to be a casual game; it’s a meticulous recreation of railway operations that rewards persistence and attention to detail.\n\nCriticism of Train Sim World 6 largely stems from its evolutionary rather than revolutionary design. For long-time fans, the new features—while appreciated—may not feel like a substantial leap forward from the previous version. Much of the interface, physics, and presentation remain consistent with earlier titles, and some players view this installment as a refinement rather than a bold step. The learning curve remains steep, and the short selection of base routes means that the true value of the game is unlocked only when paired with additional DLCs. Nevertheless, Dovetail’s long-term strategy of building an expanding, modular ecosystem continues to pay off for those invested in the series. Each release builds upon the player’s existing collection, integrating older trains and routes into new environments, creating a sense of continuity and investment that few simulation franchises can match.\n\nWhat ultimately makes Train Sim World 6 stand out is its commitment to immersion and authenticity. Every journey feels deliberate, every control meaningful, and every successful arrival satisfying. The addition of minor systems such as random faults and environmental effects brings an organic unpredictability to an experience that could otherwise feel mechanical. There is a meditative quality to its gameplay—an almost therapeutic rhythm in following procedures, monitoring signals, and hearing the steady hum of the tracks beneath your wheels. It’s a game that asks for patience and precision but rewards both with moments of quiet triumph. While not a complete reinvention, it represents a steady evolution in the franchise’s pursuit of realism.\n\nIn the end, Train Sim World 6 is less about novelty and more about refinement. It doesn’t radically alter the series’ formula, but it deepens and enriches what already works. For railway enthusiasts, it’s another step toward the definitive train simulation experience—complex, immersive, and endlessly replayable. For newcomers, it remains one of the best entry points into the world of modern rail simulations, offering intuitive tutorials, stunning environments, and a tangible sense of authenticity. Despite some technical blemishes and the familiar Dovetail pricing model, Train Sim World 6 continues to uphold the series’ reputation as the gold standard for digital train operations—a world where every journey tells its own story, one mile of track at a time.\n\nRating: 7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great upgrade in graphics compared to the previous game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Train Sim World 6 takes the series to a whole new level with a beautifully crafted, deeply immersive railway simulation that feels both authentic and incredibly approachable. Whether you're a long-time train enthusiast or someone just stepping onto the platform for the first time, this game delivers an experience that’s as rich as it is rewarding.\r\n\r\nOne of the standout features is how well thought out the tutorials are. Every train you hop into—whether it's a powerful diesel engine, a sleek modern electric unit, or a classic steam locomotive—is introduced with clear, hands-on training that actually teaches you how to operate it properly. No guesswork, no frustration, just pure learning and satisfaction as you master each machine.\r\n\r\nThe shop system is another big highlight. Being able to purchase and expand your collection of locomotives gives you real freedom to tailor your experience. Want to relive the golden age of steam? Go for it. Prefer the smooth hum of electric trains or the raw power of diesel? It’s all there waiting for you.\r\n\r\nOn top of that, the routes, graphics, and attention to detail are better than ever. Weather effects, lighting, cabin controls—everything feels polished, realistic, and made with passion.\r\n\r\nIf you love trains, simulation games, or simply want something relaxing yet engaging, Train Sim World 6 is an absolute must-play. It’s one of the best entries in the series and easily one of the most enjoyable sim experiences out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another great addition to the Collection! Love how we get a yearly free big update and the possibilty to get a good deal to update our dlc’s!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like train sim world 6 and it has some good paid dlc like Zwolle - Groningen or Koln - Aachen.\nAnd for the people that yap about that its a stupid marketing thing i dont care its a free starter pakket and you don't lose anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my wallet does not like me and wants a divorce. but its a fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sounds and graphics. I really really wish they would have a longer route more than like 45 miles. It wouldve been awesome to have the NEC route extended to Philly over trenton",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️⭐️ A Major Step Forward — The Best Train Sim Experience Yet\n\nTrain Sim World® 6 truly raises the bar for modern train simulation. As someone who has played the previous titles, I can confidently say this installment feels like the most polished, immersive, and rewarding experience in the series.\n\nThe graphics received a huge upgrade — lighting, weather, and environmental details look stunning and add a real sense of atmosphere. Trains feel more realistic than ever, with highly detailed interiors, improved sound design, and smoother controls. The new physics system also makes driving feel more natural and challenging in the best way.\n\nWhat I especially appreciate is the refined UI and tutorials. Whether you’re a beginner or a long-time fan, it’s easier than ever to learn, explore, and enjoy each route. Performance is also noticeably better, making long sessions feel smooth and stable.\n\nThe variety of routes and locomotives keeps the experience fresh, and the attention to authenticity really shows. Each journey feels unique, and the added scenarios bring a sense of purpose and engagement.\n\nOverall, Train Sim World® 6 delivers exactly what fans were hoping for — depth, realism, and an impressive level of detail. If you love trains or simulation games, this is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love TSW but it would be nice if you could do more Southeastern routes, now we have the nuclear flask wagons dlc it would be nice to have the dungeness route. keep up the great work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable train sim, I like the new features and included route in this new version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing detail and the scale is pretty good exept the old island line train, the 484 is my personal best train",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like trains, or just want to drive them. This game is for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's trains from a First Person perspective. Can really interact with the trains.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive noticed this version seems to run a lot smoother.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great and love the new stuff coming soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a big upgrade from tsw5, and the new visuals, routes, and trains are really cool. I would recommend it if you're a train fan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice and fun, easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Same game, different DLC, mixed in with a sprinkle of more or less bugs (maybe)...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect funny game where you can enjoy everything the realism so big maps and what i love are layers. They really make this game realistic. TSW6 always when something doesnt go right they find a way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good. tho it could be an a addon for TSW 5 now a new whole game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lot better than past 5 still needs a little work but it a train game and if you like trains this is best out there better than run 8",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as long my saved from sim world 5 is on sim world 6 i should be ok so far good game so far",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great experience. Worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great game with a very good amount of fdetals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game with trains you get to drive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they really need to imrpove lightning on this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun. Thanks for free update to 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont know what to say, pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game mid performance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Same old TSW, at least the base game is free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the bugs i have noticed are gone so all good now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still buggy, but still the best.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Train Sim World 6: The Thrilling World of Applied Patience\nOverall Score: 10/10 (if you love staring at red lights)\nI've always wondered what it would be like to operate heavy machinery with the high-stakes excitement of watching paint dry, and Train Simulator 6 delivers on that promise\nand most important of all, it´s not League of Legends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game on god (doing this only for steam awards thingy)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best train sim available at the moment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game, way too much time spent there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to relax with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good graphics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun driving trains",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first game of this type, I'm enjoying it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is about trains!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, having fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best train game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This review is to get the Steam Awards 2025 badge.  \nI do like this game though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok the last review for this Dovetail money grab was TSW 2020. I gave it a thumbs down. I had numerous criticisms including graphics, realism etc. I have (and had) numerous train sims including Sim Rail, Train Life, Trainz, Train Sim Classic and yes going back to MS Train Simulator etc.  I stopped at TSW 2020 for the reasons I noted then.\n\nSo Why has TSW 6 finally gotten out of the doghouse for me?\nGraphics (?): Take a look at Sim Rail made with the Unity engine. This is a train sim related to Poland. But the graphics are lush and realistic. Again, TSW is using the same tired sterile graphics. The trees are laughable.  3d Postcards really. This will continue to be a negative for this game. The reflections, specular lighting etc. are all there on the trains but outside we still have the old tired graphics. It looks like the trees and plants, flowers were planted there as you would create a track environment rather than a lush and believable world. Some significant stuttering from time to time. The mountains encountered in the game look like they were pasted there. Nothing organic in this environment.\nThis could have finished it for me but as I played it a lot began to commend itself. The training facility, the train stations, where you can actually now wander in them and then go to the trains themselves. Certain tasks to perform. The ticket process to catch the train. The train stations themselves are now more alive with sounds characteristic of stations. The various facets of train/station interaction now take this sim out of the doldrums and more into reality. Complete the various training modules etc. and then head into the scenarios. \nI mean, the bottom line, if Dovetail continues to enrich the environment and rejigs the game engine this will enventually become a superb product despite the price gouging. Now it simply passes and is worthy of a thumbs up with the possibilities all there for the taking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun can drive trains around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Splendid,if you're interested in driving them,buy it.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I cannot recommend this game to anyone.\n\nTrain Sim World 6 continues the established predatory formula of Dovetail Games’ railway simulation series. I entered the franchise with Train Sim World 4, and even I have a difficult time discerning significant advancements in this iteration compared to its predecessors, including TSW5. While TSW offers a respectable simulation experience with visually adequate graphics and a diverse roster of both historic and contemporary locomotives, the core gameplay remains largely unchanged.\n\nThe annual release cycle is the primary problem. The game feels less like a substantial sequel and more like a repackaging of existing content supplemented by new, full-price routes. This approach has no longevity, as the game is designed to be superseded by the next \"platform\" 12 months later. The new DLC will not be compatible with previous releases forcing players to either get the 'Free Starter Pack' or pay in full for the new 'release'.\n\nFurthermore, there are persistent bugs present in earlier versions that CONTINUE to plague the experience. I am particularly frustrated about the availability of a specific DLC (the Japanese line) in the works, which is the reason why I purchased TSW4, and is more than likely going to be pushed to whatever latest TSW entry there is. After writing this review, I'll give up on waiting for that one DLC and will push on to other games.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "[h1] This is such a mixed bag [/h1]\n[i] I've only played German routes so far so my review will focus on that aspect. [/i]\nIt's pretty clear that this is a game first, simulator second. Almost every time you start a scenario, you're put into the drivers' seat with the locomotive already fully started and all safety systems turned off by default. There is no option in the settings menu to have all the safety features like PZB/LZB and SiFa turned on by default, and no true expert mode where you have to fully start up the train yourself. There is a so-called expert mode but it doesn't keep these systems turned on by default, which in real life would be illegal to cut out and grounds for getting fired.\n\n[h2] Then there are the bugs. [/h2]\n[list]\n[*] On multiple occasion you literally run into issues such as PZB magnets being placed incorrectly, or the 500Hz speed limit display not being accurate, forcing the train into an emergency brake sequence when you've actually been operating it correctly.\n[*] Signal aspects on German routes not being accurate and sometimes displaying entirely non-existent aspects that would make the signal to be considered faulty, especially in shunting order scenarios where substitute signalling (Zs) would be required to shunt past a Hp0 signal\n[*] Doors that can in reality only be opened from the outside but not closed again being able to be closed again (this occurs with several pieces of rolling stock across several DLC)\n[*] Many German routes don't implement the [H] sign so you never know where to stop without the overlay\n[*] Speed limit signage stating one speed limit while the game enforces another\n[*] PZB not activating speed limit indicators on the speedometer, requiring you to enable the overlay for the HUD\n[*] Rolling stock from different DLC not correctly detecting that coupling has occurred, leaving gangway plates raised and roller shutters closed, with some coaches not even having manual controls, so there is no way of making a mixed consist - it appears that there is no unified API for this so different rolling stock can't fully interact beyond basic the basic coupling process\n[*] Graphics can vary by route drastically - Each DLC route appears to have its own colour grading, meaning some routes may have a weird blue-green-ish tinge, others a weirdly orange colour bias, etc. You would basically have to use several different ReShade presets for each route to fix this. Some DLCs are worse than others with this\n[*] Blurry graphics at a distance - I can't say whether this is due to my very modest custom quality settings, but this is an ongoing issue for me. Objects and world geometry that is far away appears so blurry that it feels almost like I need new glasses...\n[*] The sound often glitches out with weird artifacts, like random buzzing\n[/list]\n\n[h2] Missing features: [/h2]\n[list]\n[*] a working EBULA on basically every locomotive and MU that supports it. The monitor is always empty and there is no way to operate with realistic helper options such as this, over the HUD.\nImagine the game had a built-in server with an official app that allowed your phone or tablet to connect to it and display the EBULA, or a client on the PC you're playing on can display it on a second monitor! While you're at it, you could allow for gauges and such to be displayed as well.\nThere's a certain simulator that has this features. Rhymes with INDUSI and starts with a Z.\n[*] There's no way to use rolling stock that didn't come with a specific map in a regular schedule on that specific map. Only prescribed rolling stock for you, or free roam!\n[*] an open interface for custom control desks - only the RailDriver is fully supported\n[*] You can't always interact with every button and window. Ie the cab windows on the ICE 3 can't be opened\n[*] There is no way of leaning out of cab windows to monitor the boarding process like you would as a driver normally\n[*] A lot of rolling stock doesn't natively allow you to walk through the engine compartment to change ends (BR 110 & BR 103) - you need to download mods to achieve this which may or may not stop working after updates\n[/list]\n\n\n[h2] The positives: [/h2]\n[list]\n[*] The atmosphere! Oh the atmosphere! Sometimes the graphics up close just nails it. Things like driving at night in the snow, or in the evening while drenched in the pink shades of dusk can be absolutely wonderful!\n[*] Realistic-feeling camera wobble - While at speed, the camera simulates an amount of train hunting and wobbling that just feels right. Not too understated, not too exaggerated. It very much adds to the feeling of being on a train at speed, even though you yourself aren't actually experiencing that physical movement like on a proper training simulator\n[*] Level of detail - I'm a 3D modeller myself and I'm really impressed with the level of detail of both the models and most textures of the trains at least. \n[/list]\n\n[h2] Conclusion: [/h2]\nDon't buy this if you're a really die-hard, sweaty engine driver who requires absolute realism with fully working PZB and LZB.\nIf you're not the former, only buy this and DLC at a discount. It's fun to play as a quick way of hopping onto a train and driving a service for the vibes, but don't expect perfection or a bug-free experience. I'd say this is only one step above an arcade experience.\n\nIf DTG put more emphasis on a bug-free experience with perfect simulation quality in mind, as well as open interfaces that allow for custom control desks, EBULA support on a second monitor or on mobile devices, fully accurate signalling and more attention to operational minutia of rolling stock and locomotives, this could be the best simulator there is. But right now, it's only a sort of casual sim game that can't be taken too seriously.\nI really want this to be great, but right now it's only \"sort of barely good enough\". If it took the simulation aspect more seriously, gave you the option for different difficulty settings for the grading at the end (right now it's far too forgiving of things like SiFa and PZB/LZB forced brake applications, rough driving style on passenger services and much more not being taken into account at all), and allowed you to turn off things like the stop markers and achievement notifications (the latter always blocking the horizon when they pop up so you might end up missing signals and signage) alongside other gamification features, this could easily be the best simulator there is. But right now, it just isn't. \nA lot of wasted potential here. I hope they get it right eventually.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Who knows what they do in the studio all day. There have been almost no changes since Train Sim World 2. That was 5 years ago and the bugs from that game still exist today. But yes, let's spend $55 CAD on a single DLC. Terrible company that only cares about getting your money!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Instead of making a new game every year, DTG could focus on revamping existing DLC, like Northern Trans-Pennines, which looked okay back when it released, but is visually underwhelming now compared to newer DLC, in addition to it having some strange bugs (WHY ARE BG COACHES USED FOR A POST TRAIN?)\n\nBut no, we get another TSW game, if you look in the files, out of the 2 folders in it, one of them references TSW2... Not very many changes since then..\n\n\nyes im still going to play it...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Very disappointing yet again. 6 is just another iteration that is rebirthed with smoke and mirrors ... irony is even the mirrors don't function. The use of increased contrast and other lighting adjustments makes the picture richer however it's all just incremental adjustments at great cost to the customers and great profit to the developers. Same trains bolstered up with a few unspectacular new ones, same focus on the northern hemisphere and even repaints to trick customers into buying something 'new'.\r\nThe passengers are the same random robots bouncing and ricocheting all over the place, the scenery is alike children's drawings, etc, etc .... And so many faults at release it's frustrating just listing them - Nothing remotely like a sim let alone a real train - given I was a train driver in Victoria, Australia operating goods, passenger and eventually iron ore trains in western Australia chances are I know what the difference is and how it could / should be if it was truly a decent train sim. Sadly, it's not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As usual, bugs, bugs, and still bugs. The old content aren't getting upgraded when it is very simple to do so, while new lines releasing are already full of bugs. Optimization are trash, and any scenery besides the rail are literally 2d or just a void. not only the lines are full of bugs, the menu are also full of bugs, including messed up time tables, messed up game modes, and community hub not showing correctly. I can go on forever.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Instead of fixing the hundreds of known issues, DTG just spit out a new version... like every year. And please don't be mislead by the word \"new\". It is exactly the same game as last year, it's simply an excuse to charge you again and not fix old issues because they are now \"legacy\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a total rip off by DTG. It's a money grab. The game performs considerably worse that TSW5. They never fixed the performance issues with TSW5 so they won't bother with this either. TSW5 is now a dead game. So for bug fixes you have to update, but THEY will never fix the performance problem, because they useless and don't know how! DTG are a terrible developer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Quite possibly the most boring gaming experience of my life. I have thousands of hours in ATS, ETS2 and Farming Sim but the tutorial for this game dragged on and on and was so slow that I actually fell asleep during it, it also glitched twice during the steam train part of it and I had to do the whole thing again. I ended up refunding the game. It's possibly just a me problem and I'm sure others will get something out of it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't possibly recommend it, literally just the same game they've been copying for years but for more money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dovetail made it again... I think its getting out of hand, EACH YEAR, this game is an abolute joke. Its basically TSW 5 (or even the 3 if you want) but they just replaced the number, also the Rivera line is quite good, but full of bugs, also the Mildmay line DLC extention to Richmond and Clappham Junction isn't there, and all the bugs there were in TSW 5 aren't fixed, they even kept the main menu from TSW 5, the only changed the color and the pictures. Now if you never been on TSW, maybe buy this game, but if you had TSW 5 or lower, don't take this, or wait for sales or new content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a joke.\nSame bugs, same shitty engine, same scummy practices sinces TSW2.\n\"Expect the unexpected\" my ass. \nThe have the guts to announce the Tadami line as a \"brand new line\" even tho it was announced since TSW4 if i recall correctly.\n\nStay away from this studio. Play real train games like Derail Valley or SimRail.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since Dovetail keeps copy pasting the same old game I'm gonna do the same with my review from TSW5:\nWouldn't recommend even to my worst enemy, flashy graphics and modern design as a cover up of the piece of garbage this game is. No modding support, incredibly scummy monetization tactics. This isn't a case of a good game being popular, it's a case of yet another market monopoly fueled by mediocrity and scummy monetization. This isn't just Dovetail's fault it's the fault of all train sim makers who either undervalue us train lovers or think we'll just throw money at them for everything. 3/10 just a worse version of TSC with a fresh coat of paint being re-released every year.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "so many bugs in the game from blurry texture to information on trains missing or wrong, the stuff get's worse with DTG only doing minor updates never seem to fix major issues.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is available on GeForce Now. Unfortunately, it won’t start — it just stays on the loading screen and nothing happens. That’s not acceptable. I’d be happy to spend money on expansions and other content, but if I can’t even launch the game, I won’t be making any purchases.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Whilst the game is decent as with all those prior, I can't recommend it nor any of the previous Train Sim World titles as every year Dovetail Games brings out a \"completely new title\" which is actually just the same game with some bug fixes and new DLC that should've just been an update to the previous title, and the title before that, and the one before that one too. I mean honestly, this is ridiculous Dovetail, you didn't do this with the original Train Simulator you just kept updating the original with each years \"new\" version. So why the HELL are you not doing that here... oh yeah it's a scummy tactic to force more money out of those who miss the laughably short window to get the \"starter\" pack for free [i](Which by the way isn't a starter pack at all as it's just the training centre, no actual content)[/i]\n\nAlso that highly advertised at the top of the purchases Thomas & Friends bundles is - [i]shocker to end all shockers[/i] - just a bunch of peddled corporate junk. All the controls you knew? You can throw them out, you won't be needing those, as it's about as basic a control scheme as possible. Which for kids makes sense, but they don't even offer a more advanced control scheme for those older fans of the franchise.\n\nThe DLC is massively overpriced as always for Dovetail too, like the original Train Simulator. It'd cost you a small bank loan to be able to buy all the DLC in one for £1,376.05 (at the time of writing) which will only get more expensive as more DLC for this and the inevitable TSW 7, 8, 9... 100, 101, 102, you get my point - come out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "classic dtg cashgrab, would not recommend unless on 70% discount. \r\neven the best addons are barely worth at 50%",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think the game has good potential. But the current state is really buggy some locos specifically the DB BR 294 when you get into them the game will teleport you onto the top of the loco, and you cant move or climb down so you have to restart the scenario, freeroam, service etc. And it's happening on other locos like the BR 363, Alp46, Br411. And when you start a service (specifically on the Leipzig-Dresden route the game will spawn your train past a red signal causing an instant failure. And you not being able to drive the service even if you restart it. And the frame drops are consistent but this has been happening since train sim world 4 it wasnt as bad in train sim world 3. And the graphics are nearly identical from tsw3-tsw6. And overall like what I said at the start of my review the game has great potential but if DTG fixed the games optimization and focused on fixing bugs instead of working on dlcs the game could be better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same game multiple years in a row now. Insane amounts of bugs, terrible pricing, and 0 QoL updates that are actually improving the game. Don't spend your hard earned money on this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "IMPORT FAILED DUE TO INSUFFICIENT STORAGE - even though I have plenty free storage\n\nPaid full price for a game that I cant even play. Keeps getting the insufficient storage error message, I cant import my tsw5 profile or cant create a new one. All this is over a firewall/VPN issue. I've tried several times to make it exempt. I've turned off my firewall and VPN on my PC and redownloaded it again and again the game still doesn't work, even though that is what the website says I should do. It's very clear to me that Dovetail only care about money over making a game that actually works. Why am I even paying for this? What happened to just booting up a game and it works, like with Tsw2. \n\nI cannot recommend this game. I will not be playing any more future Train Sim World games unless they get fixed. I felt like this insufficient storage thing is going to be a reocucurring thing every release. Not happy. Do NOT buy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended. Horribly crashy experience kills any possible joy from this. For me, I can travel maybe two or three stations before it quits and wants to send a bug report.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I prefer rewiev in the less emotional way, so it would be useful both for developers and those who consider bying the product. But this one is a different one...\nDevelopers doesnt care about game bugs along the whole series. Each new game is more like a jump, where they stop solving problems current version brought and forget them. Bought a special edition, loaded in, formed a route just to stuck in pattern formed of red signals 10 minutes away from beginning, you, devs, cant get more hilarious than that.\nNot only that you made the whole new game just to add announcements that barely work on 3 routes, not only that you havent fixed texture draw distance and foliage LOD, not that you keep reusing old models without any refreshment, but also, as if it wasnt enough, you dont make any adjustments for core to work properly.\nProbably regret buying the special edition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much as I like train simulation I can't recommend this game. There are just to many bugs and developer has shown very little incentive to fix them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game runs like ass like the last one, We have expansions from 3 games ago there is almost nothing new, all you get is random events and we got a line thats not even fully available as it stops at exeter st davids",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "6th generation and still doesn't allow for cross routes. Most DLC is now either broken or buggy as they don't put the work in to those older than the last product.  Shame really I remember how excited the devs were when I play tested the first version at their office. Seem to have peeled away from the outside exploration but I guess we have working lifts now.\r\n\r\nThis is in dire need of an engine upgrade and is still missing loads of dlc that they had in classic. Grab it while it's free and wait for sale for dlc you want.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Epic Games version loads much faster, but over there the TSW2 DLC named Train Sim World® 6: DB BR 204 Add-On is missing. But even slower than loading a full install on Steam is loading a full DLC install on PS5 !  It crawls along to load. \r\nMy solution: run German routes on Epic, American routes on PC Xbox and UK routes under Steam ... and under PS5 ? The Deluxe TSW6 with almost all other routes and loc deleted.\r\n\r\nDTG are so sloppy and arrogant that this sim can not be recommended given the $$ involved for the lack of QA and proper responses to Beta test flaws pre-release. DTG releases by DATE, not by UX.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sit back and relax? Monthly challenge is not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "224Hrs on TSW5, some little more on 2020, and 50 in this one at the time of this review.\nYes, it is a relaxing experience, but definitely not living up to the \"simulator\" in its title. It is a simcade at maximum.\nThese guys do have their own unacceptable behaviors when it comes to marketing new features and new stuff. When TSW6 released with announcements and passenger ambience, it rendered ALL the previous DLCs useless because such features are only supported in newer DLCs to release AFTER TSW6 only. If this is not scummy practices, idk what is. These guys are in a love-hate relationship with their own codebase that they are not even capable of making things work together and augmenting it to all DLCs. I AM a programmer myself, and I know that PROGRAMMATICALLY speaking you CAN, A HUNDRED PERCENT, incorporate announcements and passenger ambience to ALL previous, current, and future DLC withOUT having to say \"oh it wont work you'll have to get the newer ones\". this is the absolute definition of scam. \n\nYou see, games run by code, and through code you could make things trigger other things by the use of something called \"events' which say things like \"hey, something just happened, just letting you know\" to other game systems so that they perform their own stuff. So technically if you add new features, you could make those features \"listen\" to events such as stopping at station to play an announcement, OR listen to an event when departing a station to play another announcement plus passenger ambience audio. Saying that features are incompatible with previous DLCs is pure bullshit and lazy work yet it works because not a lot of people know the inner workings of things in gamedev. Yet these sc*ms get away with it easily because people. just. buy.\n\nI have spent so much on it, and I will most likely and sadly continue to do so because this game has the biggest number of routes, trains, and scenery out there among other train games, yet we get those dirty moves from the devs that just show nothing but thirst towards what your wallet has.\n\nThis comment hasnt EVEN started talking bugs, stutters, and the sad state this studio is in right now releasing the same TSW every year, and already departing their broken TSW6 with their new Metro Rivals title while we watch. Absolute filth. If Steam had something like X's \"Editors note\", DTG will definitely not be in a good place.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WHY IS THE GAME STILL SO BROKEN?!?! I CANT OPEN THE DOORS ON SOME ROUTES. GETTING STUCK WHEN MOVING THROUGH PASSENGER CARS! WHAT THE HELL IS WRONG WITH THE DEVS??? FIX YOUR SHIT\r\nDONT BUY THIS GAME!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] TL;DR [/h1]\nI have a total of 20 hours in Train Sim World, and 1.5k hours in Train Sim Classic. I bought into this ecosystem when it was called Railworks 2, 15 years ago at the time of writing. The only way I can describe the business model of these games is predatory and user unfriendly (anti consumer even). [b]Bugs don't get fixed[/b], they re-release the game as if it was new each year, which makes you re-download tens of gigabytes of your game and all your DLC. The pricing is horrible, and the quality control is non existent. These practices have been observed consistently throughout my 15 year interest in these games, with no sign of changing. [b]Avoid.[/b]\n\n[h2] Big No's from me [/h2]\n[list]\n[*]Developer has gone back on their word. Features promised at the start of development have evaporated. Multiplayer was dangled on a stick for so long in the first few versions.\n[*]This game is re released each year with minimal to no bug fixes for previous content. There are speculations as to why they do this, like to \"game the store algorithm\" and to reset all reviews of the product. They used to make you re-purchase it each year which is foul, as it was fundamentally the same game but with minor extra features added. At least they don't make you buy it each year anymore (if you catch the limited time window) but you still have to re-download the game. In Train Sim Classic (and almost any other software) these features would simply be released as additions to the existing software. Imagine if Minecraft made you re-purchase the game to add Camels, and then you'd have to buy it again for the Trial Chambers the next year too.\n[*]Little quality control on any releases, new or old. Bugs exist that are 8 years old at this point. No guarantee that they will patch any content into the future. If something releases with issues then it will most likely remain with these issues.\n[*]Hideous amount of DLC - downloadable content you can buy separately. Yes, it allows users to choose specifically what types of trains and locations they download individually instead of making the game overwhelmingly massive by default. But the pricing is eye-gouging, especially with the quality control and the forced re-download every year.\n[*]Did I mention that you have to download everything again each year if you want to update to that year's version? Even though the changes could be applied as a patch, the same with the DLC, but instead you have to download the whole game and each DLC you own AGAIN. Not only is that terrible for your storage drive's life span, but it is horrible for people with slow internet speeds. Oh and this also will reset your hour count if that's something you like to track. I had to add up my separate TSW version hour counts thanks to this. It's just weird that I have to do that.\n[*]Tutorials are useless at best and broken at worst. The trains are complicated to use and the official tutorials are lacklustre at helping new players understand how to operate these machines above a standard of making the train move if it's already correctly set up. That's if the tutorial isn't broken in a way that makes it impossible to complete or restrictive in very weird ways.\n[/list]\n\n[h2] Weirder stuff I also don't like [/h2]\n[list]\n[*]Graphics aren't bad, but they're certainly not good. Everything has a shiny plastic feel to it, while also having washed out colours to create a very dull vibe. The engine used is also outdated now, but I do at least respect that it would take a lot of development time to port to the updated Unreal 5 engine.\n[*]Audio is unreasonably quiet compared to other applications. \n[*]Train sounds vary in quality. Some sound synthetic and fake, others sound like the real thing. It's a real gamble. This alone is a deal breaker for me, but this very much my weird personal preference.\n[*]Routes can be unimpressive in immersion with little detailing.\n[*]AI has officially been confirmed to be used in this game. There are signs that they have used it in some marketing materials too.\n[*]Getting really opinionated here, but I hate the language surrounding their use of proprietary tools to market the software as something professionally made and bespoke in its design, when in actual fact it's known that the previous Train Simulator Classic has been used in professional settings to train actual railway staff before, the same cannot be said about this. But I also hate this on the grounds that SimuGraph - the software they developed in-house that simulates the trains physics - sounds and looks very impressive, but is completely closed source and only usable in this game by themselves or other developers they license development to. I think the game and the community would be in a much healthier state if SimuGraph was open source even under a limiting license, but I understand that it's just their choice to be proprietary and closed off the source, as is there right. That and if they fixed the re-release bullshit.\n[/list]\n\n[h3] Edit [/h3]\n[list]\n[*]Formatting\n[*]Added sections on tutorials and SimuGraph\n[/list]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A train sim franchise with yearly releases and all its content locked behind DLCs",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can you add SMART (Sonoma Marin Area Rail Transit) to your game? Its in Sonoma County and Marin County.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dovetail-slop.... its the same over and over again from TS2010-to-classic, TSW - to- TSW6 its an update of menu graphics maybe a nice little intro video and new menu music (if your lucky)... im not going to start on the overpriced DLC-Simulator factor.... would i recommend it to soothe your -tism yes, would i support and or feed the beast, so that they continue on selling the same product with a new ui sayng its something completely new....no...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Superficial game made by people who only push untested DLCs, never fix bugs and are able botch even \"Hello, World!\" type of program.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like other people have said,\nIt is just TSW2 \nBut every year they just add a new number in the title and make the optimization worse\nNew coat of paint on the menu, new not very good UI, not that good features etc.\n\n--That's--Literally--It\n\nAt this point we are probably gonna get \"Train Sim World® 80\"\nAlso don't forget the price! 50 flippin' dollars..for some reason\n\nWould probably get it on a sale, but it's kinda meh. The NJ transit stuff does look pretty cool, though.\n\nI'm kind of done with the TSW games, because you know- its just the same game every year, giving it a \"Same game, Different Name\" situation\n\nThey all look. The same. They all feel. The same.\n\n\n\nIf you are new to train simulators, and want to get something cheap that STILL looks pretty damn good, just go get TSW2020 https://store.steampowered.com/app/530070/Train_Sim_World_2020/\n\nIt's ok but ehhh\n\n6ish/10, largely because of the nj stuff\n\nBut dovetail, I really think this should just be the end of the TSW series. 6 is enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Same as TSW 5 That was the same as TSW 4 and so on. All the new features dont work properly. Some TSW 4 fixes still have not been released.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Seems to me that DTG only want's to make money. Instead of fixing bugs etc. they keep on releasing new dlc's with yet another load og bugs. Still they think it's ok! Well as long as we are stupid enough to buy their products they will obviously gain from it. So from here on and out i will not buy any of their products. I refuse to pay for a copy and paste product.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only free starter pack, 35 quid is a scam, when you can find better routes from tsw3 and 4 which are cheaper.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Each Release is getting worse, bugs after bugs after bugs, youve still not fixed bugs from TSW 4, you bury the dlc and the become broken and worse with each new version, features get lost, we dont need a yearly new release we need you to fix everything you broke, im glad i got tsw6 starter edition for free because i wouldnt pay for tsw 6, you refuse to fix anything, why should i pay you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its Made By Greedy Cunts Dont even think About Buying it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DTG bad etc. etc. Steam awards stuff",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After TSW2020; 2; 3; 4 and 5 ...i expected a more fluent stuttering ;-)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ok if you got the free upgrade, otherwise pretty pointless",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just the same as the other TSWs, nothing new.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "stutters here\nstutters there\nstutters everywhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "let me play my game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many bugs d'ont buy it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought tsw5 (it was a mistake) and got this game for free. It is not worth the 39 (or more) euros",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "这游戏想钱想疯了！🤮🤮🤮",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ok i wrote a positive TSW 5 review but this year things changed... I only went with the free starter pack because i have routes from previous releases but i cannot really recommend to get into this franchise at this point. every single release is unfinished and none of the products actually get updates for longer than like 3 months. until now, all dlc released under tsw 6 was meant and submitted for tsw 5 and the result is it runs horrible. i can only recommend for you to watch a few videos by train sim society or dc4260 productions. this franchise is headed to hell and now is the worst time to jump on the train",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy Mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Same game from TSW3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bug JUNK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "повседневная жизнь с девушкой монстром",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only got it because of the Free Starter Pack, otherwise would have never gotten. \nThe awful yearly release cycle continues with more and more bugs not getting fixed and new features being completely broken on release. The core German route, which is the only region of the main three I am interested in, is a disgrace. It is an extension of the previously released Nahverkehr Dresden Route, where the route now goes all the way to Leipzig. First of all, why wasn't this done when they remastered Nahverkehr Dresden Route in TSW4? On top of that people who previously owned Nahverkehr Dresden don't even get a discount, despite already owning half the route. You might say well they have updated the lighting and textures on that section to match TSW6 standards. Well from what I have heard (since I don't own it myself) they in fact did not. And if it can't get any worse for this core German route, it does not come with any new rolling stock. \nAt this point the only reason I am still playing this game is because of my extensive catalogue of older routes and the amazing mods from TSW Community.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its just train sim world 2\nbut repackaged again and again and again and again\noh and it still runs terribly xD\nmaybe they could... oh i don't know... focus on fixing bugs and performance issues rather than releasing more and more buggy and unoptimised slop for £30\noh and they still sell older routes and such for full price without even updating them with a single new feature... very cool!",
      "voted_up": false,
      "votes_helpful": 149
    },
    {
      "review": "Pros:\n\n- Free if you already own modules from previous games.\n- Decent tutorials.\n\nCons:\n\n- TSW is basically a gamified digital model train collection.\n\n- €3000+ worth of DLC, with most routes and trains never properly adapted to the updated engine.\n\n- An in-game store that makes it very clear you should buy more with ads of new products in loading screens.\n\n- Still no timetable in the cab; you have to use the gamified UI.\n\n- Still no rebindable axis controls, something even an indie train game managed to implement.\n\n- You can play without a Dovetail account, but the game constantly nags you to log in.\n\n- A freemium model that lets you drive on a test track if you bother to download 40 GB of game.\n\n- Draw distance is so atrocious that foliage shadows render right in front of you. It looks like you are driving with a circular  shadow around the locomotive.\n\n- The new announcements do not even use proper voice actors; they are just run through a speech synthesis program.\n\n- Timetable mode is not about being a train driver doing a shift, but about wandering the tracks to steal trains. There is no  coherent system to it. When you start a service, you drive to the end, get out, and either return to the menu or just pick a random train to continue.\n\n- The entire reason for having the new TSW version in the first place, the random events & announcements, aren't even availible for the TSW 6 \"compatible\" DLC routes. You either buy the new ones, or you're out of luck. \n\nI was able to upgrade to TSW 6 for free since I own TSW 2, but if you are thinking about buying in, save your money. Dovetail Games usually just slaps a new number on the game and pretends it is something new. TSW 6 is basically a core game update that, apparently, warranted a whole new release. The pointless annual releases seem like a desperate attempt to min-max marketing by abusing the Steam visibility boost that comes with launching a “new” game.",
      "voted_up": false,
      "votes_helpful": 101
    },
    {
      "review": "This is essentially the same game with nothing more than a new number slapped on the title. Long-standing bugs from the base game and DLCs remain completely ignored, while the so-called \"new features\" in Version 6 are nothing more than minor code tweaks anyone could implement in a matter of days.\n\nThere is no genuine innovation here, no meaningful improvements, and absolutely no justification for selling this as a new release. It feels less like game development and more like recycling content to squeeze money out of players.\n\nThis is a textbook example of what happens when a company faces no real competition: lazy updates, recycled products, and zero accountability. For these reasons, I cannot recommend this game—or the company behind it.",
      "voted_up": false,
      "votes_helpful": 105
    },
    {
      "review": "Train Sim World 6 is the perfect example of what happens when a studio refuses to evolve. Absolutely nothing has changed in the core game: the look, the feel, the clunky mechanics – it’s all identical to the previous version. This isn’t an evolution of the series, it’s the same product reboxed and resold.\n\nThe visuals are dated, the gameplay feels stale, and even the bugs that have plagued the series for years are still here, untouched. There’s no sense of ambition, no attempt at innovation, just a lazy copy-and-paste job. It’s as if Dovetail Games thinks slapping a new number on the title is enough to justify another full-priced release.\n\nThis isn’t just disappointing, it’s insulting to loyal players who keep hoping for meaningful updates. If nothing changes in Dovetail’s management approach to Train Sim World, we can expect to be fed this annual rubbish for years to come – recycled content dressed up as something “new.”\n\nTrain Sim World 6 doesn’t feel like a new game; it feels like the same tired one, sold again. Totally unnecessary, sloppy, and a waste of time and money.",
      "voted_up": false,
      "votes_helpful": 194
    },
    {
      "review": "In conclusion, I just truly want Dovetail to stop with this yearly release things, that's all I'm asking for really. I think its getting ridiculous with how people have to reinstall DLC's all over again into another game which is basically a reskin of the existing game. They've started to turn into Activision's yearly release of the same game & DLC's but different name. All it is really about is [b]QUICK MONEY GRAB[/b] nothing else.\n\nThere're too complacent and passive in dealing with years worth of bugs that just continue on to the next version of the game every year, they're is so many bugs in the Conductor Mode, one of the main one is, sometimes the doors don't even open after pressing the button, but when you're doing the drivers side of it, they open up straight away no problems.\n\nIt's nice they've added some new things, but they can all be added in with simple updates to the existing game! They should take a leaf out of SCS Software's book, they've released ETS2 in 2012, still updating the game, adding new features, locations etc with a [b]12 year old game!!![/b]\n\nOverall Rating:\n2/10",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "Reposting my reviews from TSW3, 4, and 5 here since this is the same game. I would stay away from this series. DTG has showed a lack of customer appreciation and has shown they really don't listen to the community. For years, myself and others have tried to give constructive feedback, and any criticism of the game is met with extreme backlash from DTG white knights and community partners who will never acknowledge anything negative about the game. If we never address the negatives and fix them, how could the product possibly improve in the future? I guess I shouldn't be surprised by looking back at my TSW5 review since it showed an emerging pattern since TSW3. Once again, features, content and fixes that were promised for the previous iteration of the game, are now only included with the paid content in the new version. Don't let anyone try to sway you with the \"free upgrade\", all you get is the training center. Your older routes will not have the new content/fixes/polish automatically added and its up to DTG to retroactively apply them. Which they rarely ever do, and sometimes abandon older routes together outright. As someone who has spent way too much money on this series and TSC as I would like to admit, I cannot support this series anymore. \n\nTSW5 Review:\nI have a love/hate relationship with TSW and would not recommended Train Sim World as a series. There are some good routes and as always I will give them a separate review from the series. However the negatives are usually outweighing the positives. I will repost my review from TSW4 because all of the main issues of the game series are still relevant. The way DTG approaches this series and markets their content has been a huge turnoff to a long time rail fan like myself. From the outside, following dev posts and announcements, it seemed like TSW5 was going in a better direction. The announcement of a free upgrade to TSW5 from TSW4, promised features missing since TSW3 stating they will be implemented, focus on core game polish and fixes, finally branching out to other countries besides UK, Germany and USA all sounded great. I am excited to see the Dutch, Japanese and other new countries finally introduced to the series, it will finally add some much needed flavor. Playing this iteration for an hour has reminded me that the core game still has many issues and bugs and core sim features are still broken or missing. However the fact that the free upgrade ended up being just the Training Center and that no new features would be retroactively applied to older routes was extremely disappointing. Not only are routes even more expensive now at $45.00 but they are still lacking in content and have a plethora of bugs. We used to get multiple pieces of rolling stock, and at least two new locomotives with a decently long route to run with each release. Now we got one \"new\" loco at most and a recycled loco from other content, with one or maybe two new pieces of rolling stock with usually a short route. For 3/4 the price of a AAA game for one route, you would expect a lot more. I don't think DTG can ever really repair the damage done to the series and the community at this point. Old routes are forgotten to rot and not brought up to gold standards, features promised since TSW3 are still not implemented, same old bugs from previous titles. I can go on and on. Again, just reiterating some points from my previous reviews that apply to this entry in the series as well. \n\nTo end on a good note, TSW is one of the more accessible train games out there, and you can somewhat tweak your experience to be more arcade like or lean more towards a simulation but the simulation aspect is lacking compared to TSC. TSW and TSC also hold the gold standard on train controls on the keyboard and wish more games would follow suit. Again, I don't recommend the series but there are some good routes out there, Niddertelbahn, Black Pool Branches to name two. The quality of work by TSG and Just Trains should be set as a gold standard, they consistently deliver excellent content that feels like its worth the money.\n\nTSW4 Review:\nI'm giving the game series a negative review, but will post my reviews for individual routes where applicable because there are some positives for sure. There are certain routes and rolling stock that stand out above the rest and there are some very good things that DTG has done. However, their strategy towards TSW as a series is lackluster and seems very anti consumer. As much as people complained about how they would update TSC, I would rather them pursue that format where the core game gets updated with new features and fixes are regularly rolled out, with new routes and rolling stock being optional. Compared to our current format where core features and fixes are now locked behind new routes and a new game as a whole. Meanwhile other older content is not updated or abandoned due to issues. I have no problem paying for new content, you could release the three new routes as a dlc bundle for TSW3 or a new game as TSW4, its a distinction without a difference. But when you include core features and fixes it becomes a huge difference.\n\nIn regards to the game play itself, there are a few positives and things I enjoy that they added. The minimal HUD is nice and I feel like it's more immersive, pushing you to use the actual instruments more than the HUD. Haven't tried the free roam or scenario planner/editor yet but those are things that myself and others utilized a lot on TSC. Whether that was to build scenarios and routes or just to edit things or replace rolling stock with third party content so thats nice to finally see. Performance seems to be better than TSW3 but still not great, FPS overall seems to have increased but there are bad stutters while playing (Some routes worse than others) and there is a noticeable lack of GPU and CPU utilization while the game is experiencing poor performance. The graphical \"upgrades\" and \"new features\" are nice but are a moot point. Most of these have been in TSC for years and should have been included in the original release. One of the greatest benefits to scenery has been the LIDAR technology that they have been utilizing and it definitely has paid off in most cases. I was looking forward to the suspension improvements, they look great and I always love simulation improvements......but that's not ready at release so we will have to wait and see.\n\nSome things I would like to see improved/added is the horrible texture/shadow pop in. Depending on your zoom level the scene looks drastically different and can be quite annoying. I think the UI is okay, but work can definitely be done to consolidate the menus to get it to be more efficient. I always feel like there are redundant screens to get to the same or slightly different information. The overall UI for Creators Club could use some work too, not enough filters and no information on custom made scenarios besides what the author chooses to include in the description. An FOV slider would be nice. The washed out lighting and lens flare seems to have gotten worse, on certain routes some signals can be hard to determine their color as well. Its annoying to keep having to recommend features from a game that has been out for so long now but we desperately need labeled platforms, portals, and sidings and trains like TSC has. This goes a long way when learning a route and trying to build scenarios. I just don't get why simple features from the previous series were not brought over.",
      "voted_up": false,
      "votes_helpful": 93
    },
    {
      "review": "Charging ~£60 for a game that feels exactly the same as the last. They saw me coming.\r\nExpect the same as 5... the added features were not worth a new version release in my opinion.\r\nSame Engine, Same Graphics, Still stutters during play. Real shame.",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "Dovetail Games as always never really fixes the performance and just microwaves TSW2, because TSW6 is just TSW2",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "I like the game. I'd like it enough to review it positively if they fixed bugs that have been present for the last 3 iterations.",
      "voted_up": false,
      "votes_helpful": 78
    },
    {
      "review": "I cannot recommend this game to anyone.\n\nTrain Sim World 6 continues the established predatory formula of Dovetail Games’ railway simulation series. I entered the franchise with Train Sim World 4, and even I have a difficult time discerning significant advancements in this iteration compared to its predecessors, including TSW5. While TSW offers a respectable simulation experience with visually adequate graphics and a diverse roster of both historic and contemporary locomotives, the core gameplay remains largely unchanged.\n\nThe annual release cycle is the primary problem. The game feels less like a substantial sequel and more like a repackaging of existing content supplemented by new, full-price routes. This approach has no longevity, as the game is designed to be superseded by the next \"platform\" 12 months later. The new DLC will not be compatible with previous releases forcing players to either get the 'Free Starter Pack' or pay in full for the new 'release'.\n\nFurthermore, there are persistent bugs present in earlier versions that CONTINUE to plague the experience. I am particularly frustrated about the availability of a specific DLC (the Japanese line) in the works, which is the reason why I purchased TSW4, and is more than likely going to be pushed to whatever latest TSW entry there is. After writing this review, I'll give up on waiting for that one DLC and will push on to other games.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "Have purchased all Ts editions till now, this also is nothing ground breaking, its just as addon with rebranded name. Optimisation is poor with a laptop with 5090 also its hit & miss sometimes with frame drops. Overall its not big change from ts5\n\nUPDATE\nFor people unnecessarily bashing.. its asus scar 16 2025 top model, it runs everything fine with all set to max like stalker, bf6.. just this game keeps fluctuating not even using 90% gpu and sometime just hovering around 60%Gpu usage.\nMy facts are right and after all the purchases this is my first regrettable purchase\n\nBut still calling out and unwanted slangs, come on! Is this what community is?.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "I think its clear to everyone that this is a (small) update and not even remotly worth to be called a new game. It is EXACTLY the same as before. Same bugs, same graphics, same performance, same gameplay.\n\nI'm not even motivated to write this review because its just sad so i'm gonne stop right here.\n1/10 Habibi Punkte",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "[h1]TL;DR - Dovetail Games does not care for your enjoyment of the game, their only care is harvesting as much money from you with as little effort as possible.[/h1]\n\n[hr][/hr]\n\n\"[...] and this year we have prioritised requests directly from you, our lovely community, [i]you asked we deliver.[/i]\" ~Dovetail Games during Dovetail Direct 2025.\n\nUnless everyone wanted another re-release of the exact same game riddled with bugs, no one asked for this, nor did they for Train Sim World 5, 4 or even 3. With Dovetail's track record, I have almost no doubt that even though they 'listen' to their community, this game is just another cash grab destined to become abandonware next year.\n\nNow I will say that I enjoy playing this game, but the mindset of the team at Dovetail is just abhorrent and should never be supported. So what's wrong...\n\n[h2]Bugs, bugs and more bugs[/h2]\n\n24 hours before the release of the game, Dovetail did a stream showcasing the Riviera Line revealing loads of glitches and bugs at such a late stage before pre-release. It really showed how little Dovetail cares about quality and would prefer to pump out as much content as possible to earn the most money. These bugs progressed into pre-release including game breaking bugs and even incorrect versions of the game being released to some consoles making it almost unplayable. Some of these bugs have still not yet been patched out since attention is probably being spent in releasing the next bug ridden £29.99 DLC.\n\nI'm almost certain that very little money is put into Quality Assurance. There is no way that with the amount of issues that are present in every route, they are just simply missed.\n\nWhat makes it worse is while Dovetail patch out some of the major bugs (after release, effectively making the user a paying playtester), minor ones remain in the game and are never looked at again. Bugs that have existed as part of routes from TSW 2020 (the original game) still exist 5 years later in this iteration. Instead they just move onto the next route because optimisation doesn't bring in the money.\n\n[h2]Engine and Performance[/h2]\n\nThis game is the same as before, the same engine, and the same graphics as TSW 2020, TSW 2, 3, 4 and 5. TSW runs on the outdated Unreal Engine 4 so there's a limitation in graphics quality. While modelling of trains is typically well done, the overall graphics are substandard. I can understand why the company would be averted to updating the game engine to UE5, but it would bring about a much needed change to the game's dated graphical quality. Instead, they will continue to run on the outdated (and eventually obsolete) UE4. In my case, I need to install [b]over 100 mods[/b] to overhaul the graphics and enhance the routes that I play to an acceptable standard.\n\nPerformance is poor as well. Without mods my frame rate jumps frequently: maybe 80 FPS in the countryside but then as low as 20 in main stations. While performance has improved over iterations, it definitely isn't up to par. For reference, I get a higher average FPS playing games like Cyberpunk 2077 and Red Dead Redemption 2 (between 60-100 fps) with raytracing enabled (a function that this game still doesn't have - which could be related to the outdated engine as well).\n\nAdditionally while playing, textures constantly pop into view, completely ruining the immersion that is essential for a simulator. Seeing grass, trees, track, overhead wires, etc, pop into existence is not acceptable and has been present throughout all iterations of TSW.\n\nIf you want to know how much Dovetail loves your money, you need look no further than their console support. They [i]still[/i] support gen 8 consoles (eg: PS4 and Xbox One). It's hardly even playable on there forcing a reduced timetable to be made for routes, which makes them feel deserted. Even with this, they still have the audacity to charge full price for it.\n\n[h2]Annual Re-Releases of the Same Game[/h2]\n\n[h3]But the free starter pack...[/h3]\nI am aware of the starter pack; it is the reason that I can write this review. It is much better than when you had to pay for the game again to carry over your DLCs. But it doesn't take away that every year every user needs to re-download [b]HUNDREDS[/b] of gigabytes of content, which in some cases can take days. If it was an engine update I would understand why a whole new version is necessary but this isn't the case, its the same engine and graphics just with a slightly different colour pallete applied to the UI and with small features which could be easily be patched into the existing game.\n\n[h3]Why do Dovetail have this model?[/h3]\nWell, it obviously brings in more cash to the company but there are more convenient and shadier reasons for this model:\n\n1. Releasing products marketed as \"new\" improves visibility on Steam (and I assume other platforms).\n2. Re-releasing the game and its DLC under resets [b]all[/b] reviews for the product on Steam.\n\nThe second one is particularly troubling. This wipes all of people's opinions making it harder for buyers to easily find accounts of user experience and product quality. This makes the base game and previously released DLC look more favourable to consumers. Valid negative (and also positive) reviews are wiped every year by Dovetail, which could have been critical in determining a buyer's purchase decision. While this is obviously speculation, Dovetail's DLCs are known to the community to be questionable in quality in some cases so given their track record and business model, I wouldn't be surprised if this is actually one of the reasons for the annual releases.\n\n[h2]Can Dovetail Redeem themselves?[/h2]\n\nWhile my opinion will probably be overlooked or ignored by Dovetail, I have a slither of hope that this company can change. Right now it feels like they couldn't care less about their consumers or their trust. So what can Dovetail do? Here are some ideas:\n\n- Stop re-releasing the same game every year. For the next 'major' update to the game, re-brand the page and game title to \"Train Sim World.\" From there, all updates should be pushed to the same version until the game's end of life.\n- I never blame the devs for these shortcomings as it is more likely the fault of the executives. So for them, you need to have more respect for your customers. Listen to their feedback and act on it, otherwise you will lose more customers every year you follow this model. A good place to start would be Steam reviews, Steam discussions and comments on your Steam news articles as a lot of frustration is present there. Use them to your advantage to understand what consumers want and don't want with your products.\n- Look at previous DLCs and games and patch out some of the older bugs plaguing this game instead of sweeping them under the rug. Bugs and glitches are present in every game made, but that doesn't make a game bad. What does is when companies don't listen to bug reports and concerns from players; instead focusing their attention on the thing that can bring in money for the cheapest rate. By improving quality and support across the board of DLCs you build a stronger rapport with your consumers, giving players trust in the quality of future content.\n\n[h2]Summary[/h2]\n\nThis company has such an annoying and questionable business model releasing the same game again and again. These releases just show that there is no more love in this game, it's just all about the money.\n\nI do have a slither of hope left for Dovetail, if they actively work with their customers, they can make this game a lot more than what it is now. I will continue playing this game and keep up to date on what Dovetail are up to. I will update this review if changes are made to improve their attitude however for now [b][i]I cannot recommend anyone to purchase any product from Dovetail.[/i][/b]\n\nThis review will be tweaked and re-posted to subsequent TSW games should no change be made.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "I've been along for the ride since 2017. TSW: CSX Heavy Haul! When TSW 2 came out, I thought it was odd, but I figured the base game was several years old, not to mention all the new add-ons it brought, like Creators Club, so I thought nothing of it.\n\nWe're at 6, what's changed? Aside from some minor cosmetic features (I use that term broadly), nothing much. DLCs will be pushed despite others being promised & waitlisted for 1-2 years and, ultimately, overwhelming cries from the community to fix bugs from a previous DLC or the game itself will still persist. Please, just fix the bugs. If it meant no DLC for the next year, I'm fine with that.\n\nWhat's worse is they'll find a way to release another base in the next 10-14 months. Wow, passenger announcements are here now?! That couldn't fit that in a previous TSW through a big update?\n\nI know I'm not alone on this one. Since TSW 3 or 4, I've been clipping anytime I stand up from the engineer's seat. This makes scenarios/services that require leaving the cab impossible to finish because, well, I'm stuck! I was hoping this would've been fixed in 6, but no, I'm still stuck in the cab's roof! I don't have any mods installed, either.\n\nRant over. I'll see everyone next year when they coincidentally feel it's best to release TSW 7.",
      "voted_up": false,
      "votes_helpful": 70
    },
    {
      "review": "first off, this game is identical to the previous 3 games in the series. the new features plastered all over the shop are not game-bound, they are dlc-bound. yet i'd be hard pressed to actually find it advertised as such anywhere.\n\nthe dlc situation overall is absolutely, certifiably insane. to get a playable service you fancy on your spanking new dlc, you now need to purchase a separate dlc for another separate dlc! and yes, dlc for dlc is an actual thing here, has been for quite some time.\n\nthis is not a train game, this is a god damn psy-op!",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "this is the 3rd time i edited this review but i just want to make it simple\n\nscrap this business model, update bundles of the same game EVERY year (eg. Rush Hour) seems like a more sensible option for the sake of the fanbase here\n\nactually move onto a new game IF the upgrades are worth it, like UE5, or Multiplayer, although that sounds more like a brand new series just like TSW was back in 2017. \n\nfix all those existing bugs that have been sitting there for YEARS\n\nthats enough from me i think",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "is this a joke? are people that buy this game completely brain dead? the answer is yes. and dovetail will continue to churn out this same exact game with no improvements every single year because of your low standards.\n\n1. camera still terrible\n2. graphics are the same for years\n3. most old dlcs have NOT been updated for the new game at all and still FULL price. (pure greed)\n4. game STILL freezes, hiccups and crashes like it always has. Its actually worse.\n5. water looks horrible\n6. same old scenery and shadow pop in\n7. TAA is still the best anti aliasing for years. No dlss or any modern AA.\n8. menus have needed an overhaul for years\n9. sound is nice.\n\nAnother money grab. see ya for train sim world 7 soon.",
      "voted_up": false,
      "votes_helpful": 92
    },
    {
      "review": "The yearly re-release policy remains stupid. If you have a decent number of routes, this means installing 200+ GB of content once a year, new content which will inevitably introduce new bugs, while old bugs often go unfixed. It's also not great for those who like to get achievements. I'm sure it makes them more money to bundle a number of new routes together like this, but it's pretty clear the goodwill of the community decreases every time. It begins to feel a bit demeaning to keep falling for the same trick and I won't be purchasing the next installment. Particularly now that buying older DLC through the TSW6 store page doesn't give access to those DLC in the previous games, even though in most cases this content is COMPLETELY UNCHANGED. We were told about this on the forum, but it really should have been on the store page. I doubt I am the only one who assumed this policy would carry over, and had to refund some DLC which are literally worth less than the same content for previous games.\n\nThe Riviera route is a real standout in terms of the quality of the scenery and general attention-to-detail. It is also one of the prettiest routes in TSW, as it is in the UK in real life. I have spent a fair bit of time on this route, including walking the length from Exeter Central to Teignmouth and the route brought back some memories. By virtue of being a quieter route, it also runs a damn sight better than a lot of other more recent routes, while still having decent variation in traffic (at least with the layers I have). The 80x class is particularly entertaining to drive, while the 150/2 and DLC 220 classes are fine. I have played this route the most of the release set, and I would put it among the best release routes ever. I have seen some complaints about it at night, which I can't attest to as I have only driven it in daylight. One complaint I do have is that some of the stations do have platforms or sections of platforms which you can't visit. This seems like a bit of a cut corner to be honest, when compared with some of the (much larger) London terminals in other routes, which have fully accessible platforms. On balance, it is a very good route though. I haven't played the American route yet. The German route is pretty good, and comes with lots of different motive power, although mostly these aren't new to the game. This route doesn't run as well for me, as has become standard for German routes these days, but there's not so much to be done about that.\n\nOverall stance here is that TSW6 is worth it for the new route, but that I can't really recommend it. If you want a good route, I instead recommend some of the better routes from previous installments, like Niddertalbahn or Peak Forest Railway, and the free upgrade to 6 if you really want the \"new\" UI. Again, I will not be purchasing TSW7, and I encourage others to join me. We have to stop rewarding DTG for their money-grabbing approach to publishing, which takes advantage of the benefits of releasing new games on Steam by repackaging DLC as if it were fundamentally a new game---it is not!",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "This unfathomable annual update from Dovetail Games continues to boggle the mind. Truly one of the ways of making a simulator game of all time.\n\n(Copied from TSW 5)\n\nNew for TSW 5: Now we receive the annual minor update for free, but it's still a separate game. Are they stupid?\n\n(Copied from TSW 4)\n\n(Copied from TSW 3)\n\nI cannot recommend TSW or it's DLC at their usual astronomically high prices, only in bundles with discounts of 80-90% or more. It runs poorly for the graphics quality and is full of bugs, most of which are not game-breaking. The mapping is done with a bare-minimum effort with scenery more than a couple metres from the tracks being mediocre to poor on most maps. Every year they re-release it as a different game with little to no changes and charge up to C$140 for this, despite not fixing any of the bugs or adding C$140 worth of content or features, then act like we should be happy we don't lose access to the DLC we already bought for the game (Because it is just one game, TSWx where x is the number of years since first release).\n\nOther simulators use the sales of DLC to update and improve the base game, and make higher quality DLC.\nTSW uses the sales of DLC to fund a monetary black hole that consumes all funding and forces the developers to re-release annually to stay afloat. Either that or they're just plain greedy. Sadly the latter seems more likely.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "you're buying the opportunity to buy more stuff, not a game.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Same bullcrap as the last one. None of the existing bugs in DLCs fixed but they have the audacity to rebrand the previous game and release it as a \"new\" game. Even Discord's Rich Presence still sees it as TSW4 which is funny and the in-game files are still based on \"TS2-Prototype\". Dovetail clearly following in EA's footsteps. At least they have the decency to offer players a free upgrade if you alerady own a copy of TSW5 or before, otherwise im sure the community would be more angry. My biggest advice to whoever is developing this game, fix the bugs, have some variety instead of releasing content for the same country over and over again, and maybe for once consider releasing updates to your existing game instead of create a whole new one. We dont need TSW7 just for some bug fixes, but who am I to talk, we will probably get that next year",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "the classic \"same game each year, but number in title is different\"\nYet again, nothing with this release justifies it being a separate game.  Even with the free starter pack for \"loyal players\".\n\nIf they really wanted to do this kind of stuff, the best case is to just make route bundles of three routes, and then have the core updates be a simple game update.\n\nLittle fun fact: the embedded metadata for both Train Sim World 5 AND 6, still say it is Train Sim World 4. That should be more than enough to explain how idiotic this direction is.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "This game is literally a Menu reskin. \r\n\r\nObjectively its no different from the previous games except the fact it added some features and routes.\r\n\r\nThis whole new game could be a new update for the previous game rather than an entirely new game.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "[h1] This is such a mixed bag [/h1]\n[i] I've only played German routes so far so my review will focus on that aspect. [/i]\nIt's pretty clear that this is a game first, simulator second. Almost every time you start a scenario, you're put into the drivers' seat with the locomotive already fully started and all safety systems turned off by default. There is no option in the settings menu to have all the safety features like PZB/LZB and SiFa turned on by default, and no true expert mode where you have to fully start up the train yourself. There is a so-called expert mode but it doesn't keep these systems turned on by default, which in real life would be illegal to cut out and grounds for getting fired.\n\n[h2] Then there are the bugs. [/h2]\n[list]\n[*] On multiple occasion you literally run into issues such as PZB magnets being placed incorrectly, or the 500Hz speed limit display not being accurate, forcing the train into an emergency brake sequence when you've actually been operating it correctly.\n[*] Signal aspects on German routes not being accurate and sometimes displaying entirely non-existent aspects that would make the signal to be considered faulty, especially in shunting order scenarios where substitute signalling (Zs) would be required to shunt past a Hp0 signal\n[*] Doors that can in reality only be opened from the outside but not closed again being able to be closed again (this occurs with several pieces of rolling stock across several DLC)\n[*] Many German routes don't implement the [H] sign so you never know where to stop without the overlay\n[*] Speed limit signage stating one speed limit while the game enforces another\n[*] PZB not activating speed limit indicators on the speedometer, requiring you to enable the overlay for the HUD\n[*] Rolling stock from different DLC not correctly detecting that coupling has occurred, leaving gangway plates raised and roller shutters closed, with some coaches not even having manual controls, so there is no way of making a mixed consist - it appears that there is no unified API for this so different rolling stock can't fully interact beyond basic the basic coupling process\n[*] Graphics can vary by route drastically - Each DLC route appears to have its own colour grading, meaning some routes may have a weird blue-green-ish tinge, others a weirdly orange colour bias, etc. You would basically have to use several different ReShade presets for each route to fix this. Some DLCs are worse than others with this\n[*] Blurry graphics at a distance - I can't say whether this is due to my very modest custom quality settings, but this is an ongoing issue for me. Objects and world geometry that is far away appears so blurry that it feels almost like I need new glasses...\n[*] The sound often glitches out with weird artifacts, like random buzzing\n[/list]\n\n[h2] Missing features: [/h2]\n[list]\n[*] a working EBULA on basically every locomotive and MU that supports it. The monitor is always empty and there is no way to operate with realistic helper options such as this, over the HUD.\nImagine the game had a built-in server with an official app that allowed your phone or tablet to connect to it and display the EBULA, or a client on the PC you're playing on can display it on a second monitor! While you're at it, you could allow for gauges and such to be displayed as well.\nThere's a certain simulator that has this features. Rhymes with INDUSI and starts with a Z.\n[*] There's no way to use rolling stock that didn't come with a specific map in a regular schedule on that specific map. Only prescribed rolling stock for you, or free roam!\n[*] an open interface for custom control desks - only the RailDriver is fully supported\n[*] You can't always interact with every button and window. Ie the cab windows on the ICE 3 can't be opened\n[*] There is no way of leaning out of cab windows to monitor the boarding process like you would as a driver normally\n[*] A lot of rolling stock doesn't natively allow you to walk through the engine compartment to change ends (BR 110 & BR 103) - you need to download mods to achieve this which may or may not stop working after updates\n[/list]\n\n\n[h2] The positives: [/h2]\n[list]\n[*] The atmosphere! Oh the atmosphere! Sometimes the graphics up close just nails it. Things like driving at night in the snow, or in the evening while drenched in the pink shades of dusk can be absolutely wonderful!\n[*] Realistic-feeling camera wobble - While at speed, the camera simulates an amount of train hunting and wobbling that just feels right. Not too understated, not too exaggerated. It very much adds to the feeling of being on a train at speed, even though you yourself aren't actually experiencing that physical movement like on a proper training simulator\n[*] Level of detail - I'm a 3D modeller myself and I'm really impressed with the level of detail of both the models and most textures of the trains at least. \n[/list]\n\n[h2] Conclusion: [/h2]\nDon't buy this if you're a really die-hard, sweaty engine driver who requires absolute realism with fully working PZB and LZB.\nIf you're not the former, only buy this and DLC at a discount. It's fun to play as a quick way of hopping onto a train and driving a service for the vibes, but don't expect perfection or a bug-free experience. I'd say this is only one step above an arcade experience.\n\nIf DTG put more emphasis on a bug-free experience with perfect simulation quality in mind, as well as open interfaces that allow for custom control desks, EBULA support on a second monitor or on mobile devices, fully accurate signalling and more attention to operational minutia of rolling stock and locomotives, this could be the best simulator there is. But right now, it's only a sort of casual sim game that can't be taken too seriously.\nI really want this to be great, but right now it's only \"sort of barely good enough\". If it took the simulation aspect more seriously, gave you the option for different difficulty settings for the grading at the end (right now it's far too forgiving of things like SiFa and PZB/LZB forced brake applications, rough driving style on passenger services and much more not being taken into account at all), and allowed you to turn off things like the stop markers and achievement notifications (the latter always blocking the horizon when they pop up so you might end up missing signals and signage) alongside other gamification features, this could easily be the best simulator there is. But right now, it just isn't. \nA lot of wasted potential here. I hope they get it right eventually.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "every year is the same new version of the game without bugs or graphic fixes -.- \r\n\r\nsome of the bugs are still in game with years: \r\n- route go empty (minimal AI on some route they even miss) wich make  the driving boring\r\n- missing route signs \r\n- pbz and lbz system bugs\r\n- red lights and other route issues\r\nand nothng is fix so many years -.-\r\nbut we ask players for more and more money every year",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "dovetail you should be ashamed of yourself where do i start the amount of glitches is unbearable from cars going through crossings to be stuck in driver seat not being able to move have to leave game join back and even things like train breaks or throttle get glitched have to save game and join back. random derailment multiple times clicking im stuck boom derailment now in one mission same break release glitch and when io save game to load back in gamer crashing and now i have to restart and cant complete the scenario. also having a good computer with a 4070 wether its low or ultra settings 4k or 1080p having terrible framerate drops and stutters terrible optimisation and unplayable having played TrainZ and all TSW games this is embarrasing and if there isnt patches soon this will be a last for me great way to lose a customer. \n\nTLDR when this game works its great but dont buy it if it isnt on a good sale.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "How this is justified at the price it is for a game that still feels unfinished with trees and plants spawning less than 50 ft away.  i will never know. I will also never understand how the 'Riviera Line' is the \"MOST requested\" route by players. \nIt is so boring! I think I passed one train in half an hour and that is probably down to the fact you need to own the majority of the routes to have the \"additional layers\". It's just shocking you have to shell out so much money for a game to feel alive and realistic. There is nothing realistic about this juddering mess and I refuse to keep paying so much money every year when nothing gets fixed.\n\nI've requested a refund and will probably pick this up when it's on sale and when there are patches. Probably not even then as it's still not worth the price to add in a couple of extra trains as layers for other routes.\nIt's a shame as the Voyager was highly anticipated by me and the community. Which is the only part I actually liked. \nJust not on this route. Yawn.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "Can't Import profile\n\nCan't create new profile\n\nGame looks same anyway\n\nDovetail Games have lost their ways and have made a money machine for the same thing over and over again. Lazy approach to everything but most attention to charging us for trains but won't even optimise performance of their games. Out of sight out of mind approach. Never seen Dovetail Games respond to the community in regards to the future or if any games will be optimised. This is the final time I will ever interact with this company or their games. I wanted to give TSW 4,5 & 6 a chance but it's just the same copy and paste garbage. Would not recommend at all. I still remember TSW 1 when it was coming out and the whole company telling us all these fancy plans but here we are. How can these people sleep at night.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Fundamentally broken for german safety systems, pathing and especially their new prime loco, the 294\nYou get a Expect Green, then a Stop with shunting allowance on the entrance signal. \nThat alone is sooo much broken, but there's a lot more. \nIf you get a shunting allowance you get an expect stop, but you can't get a shunting allowance on an entry signal. So even if it would've showed me an expect stop, it still would've been wrong :(\n\nHow I know that? I'm a train driver in Germany myself.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "yet another Train Sim World # game\n\nDont bother, just dont\n\nAlso uses AI instead of actual recordings, very \"Simulator\" of you\n\nEDIT: Yes I am playing this game, and while the limited routes I have are alright, I am leaving the review at negative due to their anti-consumer style business practices and to show that I do not like them reselling the game every year\n\nHell, even some of the files still say \"TSW2Prototype\" on them ffs\n\nAnd also the only Canadian route is super outdated, wish they'd update old content but nope\n\nAlso games shouldn't need to bow to branding as the Caltrain content ( that was my favorite and I BOUGHT) was not there at first because of \"Brand Issues\", screw that",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "not getting a review reset, it's the same game as the previous 4/5 iterations\n\nif anything tells you how much the dev cares, the same bugs from tsw2 still appear in tsw6....",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I loved this game, but I'm not going to give it a thumbs up because of the only reason of the yearly unnecessary releases. Improve this DTG and you'll see the difference. Here I'll tell you the good and the bad:\n\nTHE BAD\n\n1. Yearly releases: The new stuff DTG adds to the game is so minor that it could be handled by making frequent updates to the game and not having all players redownload all theri content DLCs all over again. In some cases players have more than 170gb of content and it takes a lot of time to download.\n\n2. Bugs: Some runs are buggy or trains are buggy. That kills the experience of the game and also makes us waste a lot of time because sometimes we have to miss all the minutes spent in the current run and we have to restart it or to start a new other run (more than 30 min trying to fix the problems). We don't know if the train is not well set up or if it's a bug that does not let it run properly.\n\n3. Pricey for what we get: They should be more mindful with the prices. Not even SCS charges a lot of money for their vast and licensed DLC maps. That's why I only buy on sales or interesting bundles.\n\n3. Sometimes the train lights don't illuminate properly or enough and it still looks very dark and unrealistic.\n\nTHE GOOD\n\n1. The three new routes are vastly beautiful and detailed. I felt very well immersed while driving on the riviera line for example. Their environment lighting is quite well too.\n\n2. There is a wide variety of routes to play and trains. They feel very realistic too.\n\n3. Now I realized that DTG is finally listening to its community, which is a good sign to improve what needs to be improved and thus, they can evolve and avoid messing the game up in a future.\n\nCONCLUSION\n\nIt's my money and I can demand what I expect from the game, same as you guys (players).",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "The 150 sounds absolutely awful, graphics look washed out & dated I mean come on DTG you really need to up your game!",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "Unfortunately DTG are too complacent and passive in dealing with years of bugs that just continue on to the next version of the game every year.   Maybe if they cut down the number of members of the Marketing Team (that they like to call Community Managers) and employed some more people to clear up bugs (like the preserved crew plans used to be) they would fix some of the glaring issues with the game.  It's overdue but we need new management at DTG who care about quality and not shovel-ware.   Weird how you can drive around in GTA or Forza at over 100mph and its silky smooth, but in TSW you do 20mph out of London Euston and your watching a powerpoint presentation.   The German route isn't even new this year, its just bits added to an existing route, with a so called \"New\" diesel shunter..   Never mind about enjoying the journey when your watching trees pop into existence 100metres ahead of you.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "I am shocked that this developer can release the same game every year and call it a new title.\n\nIn the scenario \"Riviera Line: Exeter - Plymouth & Paignton 220 Limited,\" I've encountered a serious issue with the power brakes—they don't release at all in certain areas of the route. Additionally, the random events are quite frustrating; for example, I've experienced silly problems like doors getting stuck and the engine stalling. In fact, my engine stalled four times on a single route! Furthermore, the guard mode hasn't changed anything regarding these issues.\n\nI look forward to a future where the train simulator community can have a better development team—one that treats its fan base with more respect and stops charging for upgrades to essentially the same game.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The new English Riviera route is exceedingly pretty (especially the coastal section) but that's about all the good I have to say. Most of the issues from the previous game are back - both the core systems ones and route-secific ones, with a generous helping of new issues on top. This game feels the most unready out of the ones that have come out since the switch to the annual release schedule.\n\nThe new fault system, for instance? After their absurd frequency during the Riviera route preview stream, I turned it off at least until the promised adjustment in a future patch. And yet, the very first run I tried on the Morristown line, I had a door fault before even departing at the start of the run. Even worse, no door appeared to be open, and upon hovering a mouse over each of them, they were all labelled as locked. But the game was still applying traction lock (stopping you from moving with open doors) and showing doors as open on the UI.\n\nOr Class 220 (the Voyager)? As far as I can tell, you can't recover from an emergency brake application, and even a simulation reset won't help. So if you get distracted and miss an alerter or accidentally brake too hard, you can say goodbye to a potentially hour-long run.\n\nGreat job!",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Bought this game expecting something new. Being an player from the Eastern USA, I was excited to see that the Northeast Corridor was getting some much needed love again. And while the sound physics plus the random events are definitely a fresh addition giving each run a unique feel, this gameplay loop screams in your face like a $70 update to the older games. Not only is the USA content in general more or less missing the best points of the routes, a majority of it (outside of a random New Jersey Transit branchline) is outdated and lacking its modern factor. Hats off the EA of the train sim genre I guess? I appreciate the realism and detail put into the game, but at this point just make game updates instead of luring us into a new expensive title with mediocre addons. Truthfully, I will continue to play the game, but only because Dovetail has given us the honor of being the minions craving rail sim games while no other studio (aside from the vaguely \"better\" options across the aisle at N3V) makes rail games that can come to par at all. Next year when Dovetail has the absolutely genius idea to release their next installment of this bullshit, we will at the very least get the privilege of putting these two games next to each other and making 67 jokes to ourselves. If you are a person who doesn't play TSW4 or TSW5 often, do NOT buy this game.\n\n\n[Side rant regarding previous games/DLCs]\n-\nWithout doing the research its very clear this is a game studio based anywhere but the USA. As a person who lives around and has seen the areas of the game that are presented within past DLCs, it is an absolute shame how these areas have been portrayed. I log onto TSW5 hoping to get into some realistic runs along the NS Pittsburgh Line and the Horseshoe Curve but for the life of me I cannot get truly into the feel of how the route is meant to feel. Its like giving someone a birthday cake with the wrong name, or the Walmart labels still on it. It is inconceivable to me how they give us the basic slop of a couple mountains along the route, but never get the chance to dive into the PRR/PC/CR aspects of their most prominent route? Like cmon \"I can't wait to play the UP Sherman Hill Route\" - and then you don't even get the things that made the route famous. I get modeling and adding popular steam locomotives is hard, but I'd rather get nothing than a shell of what these routes could be. And the worst part is - Its not just the Horseshoe Curve route or Sherman hill, ITS ALL THE US ROUTES! I've been on the Northeast Corridor countless times, and the amount of things they've managed to get wrong on one of the most well documented and traveled rail lines on the continent. Everything from timetables to speed limits is all completely cocked, and the best part is that YOU get fucked over in the endgame for following the IRL rules of the railroad. AND the best part of top is that, what do we get for our concerns and requests? You guessed it! ANOTHER UK STEAM LOCOMOTIVE & EUROPEAN ROUTE.\n\nAnd with my final words for you Dovetail - Lock the fuck in and make something worth the time I worked to pay for this bullshit.\n\n\nTL:DR - I spent $70 fucking dollars on a game that is the same borderline slop we were thrown last year. (Wont refund since its at least something \"different\" to play.)",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "An absolute disgrace – once again, nothing more than a glorified mini-update shamelessly sold at full price. There is absolutely no justification for calling this a new game, but that’s been the pattern for the past three years already. This time, they couldn’t even be bothered to add an exciting new route or at least a fresh train for the German market (something like the IC2, which itself would have been recycled from the existing BR 187 or 146 and therefore relatively little effort). Instead, we get a lazy extension from Riesa to Leipzig on the already existing Dresden–Riesa route – nothing but a slap in the face. And as a ‘bonus,’ the premium edition throws in a shunting loco that nobody ever wanted. Thanks for less than nothing – every year manages to be more disappointing than the last",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Same as the last game just with a few new features but the game still suffers from lag spikes even on a high end PC. Still buggy! Also wasn't the track shadows supposed to have been fixed and improved in the last game and yet they seem to be back! Only brought this version as I got deluxe version for £42 and I really wanted the new Exeter to Plymouth/Paignton line as it's near to me otherwise I wouldn't have bothered. Really like the new Exeter Plymouth/Paignton line but there are a few things wrong with it like the fence is missing from the bridge at Dawlish station!",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Worst iteration ever.\nIn past releases although the underlying game were the same, at least there were UI redesign.\nThis time, even the UI stayed the same.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Pay 60 quid for the privilege of being a beta tester, with the same old issues. Yes, there's random faults, no that doesn't justify the price tag. Same old ****, just with a higher price tag.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Thank goodness I was gifted it this time around. Imagine having the opportunity to dominate an extremely lucrative and loyal niche simulation market, only to outright ignore them and pursue one of the worst business models ever. The community is partly to blame for enabling this though. All the time people keep buying it, they’ll continue to make bank! Big time! Why would they change anything if every time they repackage it, millions continue to buy it. It’s an absolute corporate win that is riding on the back of an absolute shit show of a proven cash-cow product. \n\nThe game always has, and still runs like a dead dog on a high end system. The graphics and state of how UE is utilised in TSW is unbelievable after all this time. This latest version (along with all the others) is still a clipping, shadow shimmering, foliage flashing stutter fest. Dovetail devs would probably read a review like mine and roll their eyes in the disillusioned belief that their latest product is amazing. All you want is our yearly money, all we want is a new bloody studio to make a train sim for the loyal paying crowd, not the shareholders accounts.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The monetary practice is just bad. Also the game crash frequently for some reason.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "No, sorry. The only reason I have this title now is because of the free starter pack. It doesn't include any trains, unless you've already purchased trains in previous versions.\nAs with every release these days, the annoying bugs and glitches still haven't been fixed. I constantly suffer from FPS drops on an RTX4060. On top of that, motion blur simply distorts some objects instead of creating the effect of appearing to move quickly. \nAnd then there's the ridiculous amount you now have to pay for the latest trains. Considering the previous versions, there are now features that should have been included in version two at the very least.\nReally, this game started out as a pioneer in the train world. But now it's just a case of EA releasing a new FC that has more problems than the previous releases.\nIn the past, for example, I've seen unreal engine crashes at the most unexpected moments, which I find unprofessional. It seems very cheap for an expensive product.\nYou shouldn't have to pay 40 euros for this. If it had really been a step forward, this game would have been a true classic that everyone should have. But it certainly isn't. \nIf you have the previous version, don't buy this one. If you want to buy the latest DLC later, you will unfortunately need this title. In that case, claim the free starter pack as soon as possible, because it will be removed after a certain period of time.\nThis is pure money-grabbing, nothing more.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Absolutely the same game as TSW 5, the menu is literaly EXACTLY the same just with a different UI colour here and there. TSW 6 already knew my key bindings and settings because i still had TSW 5 installed.\n\nIf you really want to play a train game, and aren't bothered by the routes included in TSW 6, please PLEASE buy TSW 5 whilst it's available and cheap, then download the 'core' TSW 6 upgrade. Dovetail WILL take TSW 5 down from Steam at some point to force people onto this game so grab it whilst you can. Failing that, check key gen websites for TSW 5 or even older versions of the game. Trust me, the game has barely changed at all from TSW 2.",
      "voted_up": false,
      "votes_helpful": 8
    }
  ]
}