{
  "positive": [
    {
      "review": "This game is as good as Orb of Creation. Both games are incrementals that have more logic than just numbers go up. Yes, the numbers DO go up also but there are some choices to make how you want to do it and where to focus.\r\nThe first hours are pretty interactive but where I am right now there is one or two new things every day while just working on levels of skills and gaining skillpoints to the skill tree. The 4x speed gain while the game is off is also a very nice mechanic and that pretty much everything can be automated after some time is a game changer.\r\nI love this \"game\" for what it is and hope everyone who gives it a shot will too.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I've played tons of idlers. This one is really good like Magic research 2.\r\n\r\nThis is NOT no brainer idler like cookie clicker, clicker heroes or maven idle and I really like the game design. You must keep thinking what you're doing and you should do next.\r\n\r\nSome complain that after reaching level 50, the game becomes very grindy. No. it's not true. I'm only playing around 20 hours and I've reached level 70 unlocking new mechanics very frequently. They must never use items and magics or they ignore permanent boots wasting x4 time bonus.\r\n\r\nTo devs, thank you for creating this wonderful idler. Given the affordable price, the current state is very enjoyable and I never complain about it. I really hope you keep this game for thinkers. There're a lot of no brainer idlers and I'd not like this game be one of them.\r\n\r\n[h1] 9/10 [/h1]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A nice idle game worth it's price, try the demo and have fun !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and mindless game to fiddle around and find secrets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed playing this game. Its def worth the cost if you are into this kind of thing. With the developer mentioning things coming in the future, it is great. 9.99999/10!!!!! meh give the 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first thing that came to mind was magic research and it was a correct observation\ngame is fairly simple with little synergy you have to make \nleans a lot harder into the idle part of its name as its a lot slower than most others \nstory and commentary is entertaining and were it really shines \nstyle is minimalist which personally i enjoy \nsound is some ambient music that i dont really care for as i listen to horror stories while i play but it is there for people that care\nv0.3 is still getting ready to release  as im writing so the it is very much still in very early and everything is subject to change nut for now give it a thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another review said it's as good as Orb of Creation, so I had to try it.  And in many ways, it is!\nIt's a bit narrower in the beginning, but it does begin to unfold into lots of interconnected systems.  Expect lots of things to have tags, and lots of effects to target subsets.  There's not quite as much nuance to the build-making.  There's a loadout system- a quite good one- but it's more about balancing your ins and outs.  If you liked Orb of Creation's crafting and especially alchemy/plants mechanics, you'll really like this game.  Like orb, a lot of the gating is on maximums.  Unlike orb, it's styled more on the Idling to Rule the Gods progression system.  Which I like!\nDownside- it's REAL slow.  It's definitely more of an idler than an active game, which is kind of a shame.  I can't help but compare it to Orb again- that game always has something for you to be clicking or doing.  This game, you'll find yourself just waiting a fair amount of the time.\nI tweaked the game with a debugger to crank the speed up to 20x, and it feels about right.  I think the dev should consider making that a game option from the start.  Still becomes a bit idle, but there's enough to explore and fidget with at that speed.\nAnyway, it's a really, really good incremental, and the comparison is apt- it really is good enough to stand with Orb of Creation.  Just know that it's a lot more passive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fairly nice game, a lot of little things to do and figure out, perhaps at the end of the day there are other games that remain more engaging, but when you go to an idle game, you expect a fairly idle game, and you know what you are getting into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. Only things that can be better is in my opinion the amount of content. I like the small story clips when you have hit 100, 500, 1000 .... etc. Its very cool but way to little. \r\nA cool thing would be equipment you build once very cheap with starting recources and over time make it stronger. Like I would love a robe you make at the start with like 100 fibers and then enchant it with runes or similar stuff. \r\nIm not fully done so if anything is down here that is already in the game pls discard. \r\nThis game needs a wizard Tower, Golems, equipment that you enhance, an Astral gate or any way for infinite exploration in a way (Map fragments are not the best but a very cool idea). Just read, if you have time: \"Warlock of the Magus World\" and you would have enough content ideas for 15 games. \r\n\r\nAt the end for 2 or 3 bucks I have got way more than my moneys worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an interesting and challenging game.  You have to think about what you are doing.   Strategy is very important.   It is slow at the beginning.  But starts adding in new things.  And you have to see what is involved. and how to use them properly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've just finished the final unlock. \n\nOverall, this game hits the right marks for myself at least as an incremental game. Starting with very little and a whole bunch of stuff to unlock and look forwards to, Whilst yes there are some parts that took a lot longer to get through than others, i feel that is kind of what part of an incremental game is. Slowly working your way through and unlocking the different dialogues that popped up throughout kept things fairly interesting. One of the things i would like to see added however is what dialogue options are still left to unlock. As it would be nice to know i have finished everything that is available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gets a little boring after lvl 50 but numbers go up at a good pace until then.  If you like numbers going up try it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Positive review worthy idle game.\r\n\r\nI've played them all, (with Trimps still being the best idle ever made, for reference to my opinion), but I'm really enjoying this one, and am already considering it one of those few \"gems\" in the big pile of idle/incremental/clicker rubble, and hope it will get further properly polished into a shining crown jewel of the idle/clicker segment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]Find more of my reviews on my curator page: [url=https://store.steampowered.com/curator/45817624-Kasurot-Recommends/]Kasurot Recommends[/url][/i]\n---\n[h2]Short Summary[/h2]\nA systems-heavy idle game that excels at deep, interconnected progression. It provides a massive optimization puzzle for players who love managing complex trees, tasks, and resources.\n\n[h2]The Takeaway[/h2]\n[list]\n[*] [h3]Bright Spots / What Works[/h3] The core appeal is juggling dozens of 'Actions' (like jobs and training) with talent trees and interconnected systems like crafting, property, and spell management.\n[*] [h3]Major Drawbacks / What Might Not Suit You[/h3] The gameplay loop can become repetitive. Progress may feel heavily gated, slowing significantly without very active, strategic management.\n[*] [h3]What It's About[/h3] The patient, unending pursuit of ultimate magical knowledge and learning to manage the growing power and integrated systems.\n[*] [h3]How It Plays[/h3] A pure, numbers-driven progression system that directly tests your ability to optimize and manage resources.\n[*] [h3]Core Tone[/h3] Contemplative and methodical. The atmosphere is mystical but humorous, focused entirely on slow-burn growth.\n[*] [h3]Series & Genre Context[/h3] A standout in the \"complex idle\" subgenre. It is built for players who prefer interconnected numbers-go-up systems over action or narrative.\n[*] [h3]Technical Snapshot[/h3] Very stable with a dense but functional UI. Tooltips are essential and generally clear. It's well-optimized for long-running background sessions.\n[/list]\n[h2]Main Review[/h2]\n[b]Idle Awakening: Mages Path[/b] casts you as an overseer. You are not a hero in the field but the high-level guide for a mage's development. This is a game about the patient, unending pursuit of ultimate magical knowledge. Your role is to manage the burden of that immense power by making smart, strategic decisions from afar.\n\nThe gameplay is a masterclass in interconnected systems. Your primary task is to juggle a vast array of 'Actions', such as jobs and training, to build core attributes. These stats, in turn, unlock nodes in a multi-layered talent trees. This entire loop feeds a series of other deep systems. You will manage crafting in the Workshop, optimize spell rotations in the Magic tab, and develop properties and build furniture and accessories. It is a pure, numbers-driven progression puzzle designed to test your optimization and resource management skills - or relax and wait for progression.\n\nThis intricate mechanical focus creates a contemplative and methodical tone. The game feels mystical and arcane, capturing the feeling of slow-burn growth and academic study. There is no urgent threat. The narrative is minimalist, with any story beats serving only as milestones to mark your next level of progression. The world is not a place you explore, but a set of systems you master.\n\n[b]Idle Awakening: Mages Path[/b] is a triumphant example of the \"optimizer's\" idle game. It wastes no time on story or action. Instead, it dedicates all its resources to building a deep, complex, and satisfying engine for players to tinker with.\n\n[h2]The Verdict[/h2]\nThis game is for the systems-driven strategist. It is a perfect fit for players who love spreadsheets, theorycrafting, and managing dozens of interlocking mechanics. If you want a game to run in the background while you optimize complex builds, this is ideal. Those who need a strong narrative or active gameplay will find nothing here. The loop can become repetitive, and progress will feel gated if you are not actively managing your strategy.\n\n[i]For the patient optimizer who finds joy in pure, numbers-driven progression, this is a highly recommended experience.[/i]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "very fun, is nice that you can reset your skills if you want, and you can reset your property stuff to if you need to reconfigure how much space you need",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good idler, took you some time to learn the mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best incremental idle games I've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable incremental game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice idle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like the magic regen stat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rare good idle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is as good as Orb of Creation. Both games are incrementals that have more logic than just numbers go up. Yes, the numbers DO go up also but there are some choices to make how you want to do it and where to focus.\r\nThe first hours are pretty interactive but where I am right now there is one or two new things every day while just working on levels of skills and gaining skillpoints to the skill tree. The 4x speed gain while the game is off is also a very nice mechanic and that pretty much everything can be automated after some time is a game changer.\r\nI love this \"game\" for what it is and hope everyone who gives it a shot will too.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Amzing incremental game . It scratches the same itch that Orb of Creation did.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "One of the best Incrementals I've ever played, I've been beta testing it for months now.   its most similar to Arcanum Theory of Magic.  In the current state there's at least a month of gameplay to hit the current content wall, and the dev keeps adding more.  It doesn't timewall you like a lot of these do, there are always new unlocks coming in a reasonable timeframe.  Offline progression is good, with up to 24 hours of time storing the ability to play at 4x speed.    There are no prestiges, instead progression just continues to unlock more features.  The pacing is quite good imo, it hasnt ever felt too active or too idle to me.\n\nThe primary gameplay is to create list of activities that your character will perform, splitting your time among different tasks to balance resource costs / recovery rates.   For example, you might work a job that costs health and energy but provides coins, spend the coins on books to read to generate knowledge, and spend the knowledge on an activity to train up your learning rate.   You balance the % of these tasks within the list so you don't run out of resources, and then run it.   Then you'll make a list for some other goal, and so on.   This automation unlocks pretty fast, within the first couple hours of the game.  \n\nThe pacing of new resources and mechanics is quite smooth.  You'll unlock several things in the first day and then youll keep unlocking a new mechanic to play with every day or two after that.  \n\nWhile most similar to Arcanum, it also kind of feels like a more idle version of Orb of Creation to me.  No resets, constant progress through new mechanics, but instead of actively casting spells, here you are creating and managing automation lists.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "If you'd like an idle game without a prestige/restart mechanic that offers continuous progress and development, this is the game for you. There's a lot of automation built in so you can make the most of your online and offline time.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I've played tons of idlers. This one is really good like Magic research 2.\r\n\r\nThis is NOT no brainer idler like cookie clicker, clicker heroes or maven idle and I really like the game design. You must keep thinking what you're doing and you should do next.\r\n\r\nSome complain that after reaching level 50, the game becomes very grindy. No. it's not true. I'm only playing around 20 hours and I've reached level 70 unlocking new mechanics very frequently. They must never use items and magics or they ignore permanent boots wasting x4 time bonus.\r\n\r\nTo devs, thank you for creating this wonderful idler. Given the affordable price, the current state is very enjoyable and I never complain about it. I really hope you keep this game for thinkers. There're a lot of no brainer idlers and I'd not like this game be one of them.\r\n\r\n[h1] 9/10 [/h1]",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The story is too self depreciating and the AI Art use is a bummer. It was neat to see the vague marriage of a VN with an idle game though and the UX is pretty good for a small game. Extremely hesitant Thumbs Up due to AI useage, I didn't notice the AI disclosure until after I had played 2 hours and that's ultimately on me.\n\nedit 2: Dev added ui scale and now I can see the game without feeling like I am going blind.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fantastic idle game with great flavor. I really enjoy the perspective of a town vagrant to town archmage. You get about a month of playtime with this version as of the beginning of early access. It's a great deal for a lot of enjoyment and numbers going up. Honestly a deal for twice the price.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Probably one of the best text-based idle games I've played in a long time, looking forward to more development. Reminds me of Magic Research and other similar games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "To begin with, I have no frame of reference for this game, I don't play idle games aside from occasionally I'll dip into Fallout Shelter (not for ages though) and I've just piled 120+ hours into No Man's Sky in the last week. I don't know how I came across this game but I am glad I did.\n\nThe tutorial was brief enough and told me everything I needed to know and the information given is not so much it's overwhelming and it's being given at a nice pace. The little story-line inserts have kept me engaged and are generally funny and I'm just generally really enjoying myself. \n\nAs someone who plays WoW and Skyrim and Dwarf Fortress as my mains I can't definitively say that this is a good game, I know nothing of the mechanics of idle games and I'm only on my first playthrough but I want to play it. I stopped playing everything else and have been playing on and off for two days. I stopped playing this briefly to come write this review!\n\nIf anything about the trailer intrigues you, give it a go, you may find a new favourite, I know I have :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! the strategy here is to go \"offline\" for a day or a half, then use that x4 offline time when playing the game, Everything clicks in once that happens, You can wait and idle the normal way but you'd get less dopamine on seeing your progress snail on, other than that all is good, Story is good and very funny, Unlocks are a bit slow but if you get high enough on drugs (overdose on those potions) and prioritize in exp discounts and learning speed, all is good\n\n\nNo feedback at this moment, other than wishing once or if \"offline progress\" actually gets there, it'll calculates it all by half or something related to \"away efficiency\", I wouldn't want to see that \"offline time\" go away if offline progress gets implemented",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Silly events and automation, 2 things I really like to see in these. I played the demo a while back and grabbed the full game immediately upon EA.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Impressive, has a lot of QoL unlockable just when it feels needed.\nIt also feels great discovering and experimenting with combinations and orders of doing things. The tutorials are (for the genre) very useful, much nicer than needing to read wiki articles.\n\nEarly impression:\nThere feels to be a lot of layers of complexity I am still unlocking, but it's not overwhelming and whilst there are some optimal combinations, it doesn't feel bad to be inefficient to a degree.\n\nLooking forward to how this develops, already a lot more complete than a lot of early access titles within the incremental genre - the demo hooked me and I bought it fairly quickly!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Plenty of content and the price feels like a bargain having being playing this basically none step in the background since purchase. Plenty of QoL to streamline processes such as a planner you can buy early on that allows you to set up automation.\n\nThe game is also quite whimsical and funny in the small snippets of story that take place throughout as you level up and unlock new activities.\n\nAn easy recommendation for people that enjoy idle/incremental games. You can be as hands on or off as you want. Looking forward to seeing what I've still to find in the game and the future planned progression.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Navigating the interface is... painful & buggy but the game itself is rock solid as an idler and has implemented most concepts I like to see in the genre very well so far!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game reminds me a lot of the Arcanum / Theory of Magic idle game.  It's a long haul game, with plenty of events and optimizations you can do every once in a while when you check in.  If you walk away for a few hours and forget to update things, you'll get a nice boost that isn't a waste, and if you check in regularly you can eek out more efficiency.\r\n\r\nIt's fun and priced right.  I strongly recommend Idle Awakening for anyone who's enjoyed longer idle games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Reminds me of Immortality Idle, a free fun but shallow little game that filled a niche. There's a lot of the same systems that I love. It definitely needs a lot of work, but I love the game concept. Currently there's a few glaring issues with progression that are causing problems, and I want to discuss them and offer solutions to the developer. This is one of my favourite kind of niches that I can't even put into words. So I hope this turns into something amazing.\n\nOne of the issues is the skill tree. As another player has pointed out, tying specific skill learning increases to it forces players to respec into specialised builds from mid to late game. This negates the whole point of having choices in it, but it also just feels bad in general. If you have to respec and do one kind of activity only, for a game built on switching between a variety of activities, you've introduced a mechanic directly clashing with your core design. To me the easiest fix is to redesign the skill tree to give generalised increases such as Learning Rate and a general XP Discount. Remove the coins, mana, health, energy etc. increases entirely. Keep those in the other permanent systems that you get as you progress. Then in-between the general increases, place in some special nodes for people to aim toward (such as unlocking special activities, items, property etc.) and remove respeccing entirely. It should feel to the player like they're getting something that adds to what they're already doing, not having it decide on what they have to do.\n\nDiversity of choice/discovery is another issue. Currently there is zero in this game, and this is caused by the lack of encounters. I hope this is something the developer focuses on over time. Too much of the mid to late game is tied to the progression of attributes. Almost every \"you reached x in an action\" moment is exposition with no impact on the game. This kind of game is centred around discovery, and if there's no expectation of discovery you have a severe issue. The player needs a variety of encounters (discovery) to fuel their excitement and go for that \"just one more milestone\" feeling. I recommend to slowly fill out a percentage of those action encounters with an impact on the game. It makes the world feel alive. It can be small or large, such as unlocking temporary or permanent action, adding a variety of permanent buffs, unlocking items, property, magic etc. I'd also have hidden threshold encounters, where having reached certain milestones (such as x learning speed or x property size or x furniture etc.) unlocks something new. I'd also have random encounters, that is encounters that can happen at random (you can even include encoutners based on player progress) that offer something temporary, like a resource or speed increase, or even hints on how to unlock certain things. You can have repeat encounters for temporary buffs, and once-only encounters that do something special. There are more options, but just those three types of encounters will add a lot of depth to the game's discovery.\n\nThe last major issue to me is tied to the above as well, with a lack of progression divergence. Currently too many parts of the progression is linear. For example, Magic offers only 7 spells at the start that you all unlock basically at the same time. These do a variety of buffs that end up being \"for x action maintain y spell\". There are no choices here. No decisions to make. You either turn one of the 7 spells on or off based on which action you are doing. Too much of the game is like this. You need to give players decisions to make at various stages of the game. It's what gives players agency, and agency is what invests them into your game. This one's more complex and I'm a bit too tired to think of suggestions, but I might come back to it later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a good automation system and is being actively supported, so it shows a lot of promise. The game slows down massively about half-way to the current endgame, which is a bit of a drag, but the early game is very involved. There is no offline progress, but it allows offline time (up to 24 hrs) to be saved and spent on a x4 (and in future x8) speed boost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice idle game worth it's price, try the demo and have fun !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and mindless game to fiddle around and find secrets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed playing this game. Its def worth the cost if you are into this kind of thing. With the developer mentioning things coming in the future, it is great. 9.99999/10!!!!! meh give the 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first thing that came to mind was magic research and it was a correct observation\ngame is fairly simple with little synergy you have to make \nleans a lot harder into the idle part of its name as its a lot slower than most others \nstory and commentary is entertaining and were it really shines \nstyle is minimalist which personally i enjoy \nsound is some ambient music that i dont really care for as i listen to horror stories while i play but it is there for people that care\nv0.3 is still getting ready to release  as im writing so the it is very much still in very early and everything is subject to change nut for now give it a thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another review said it's as good as Orb of Creation, so I had to try it.  And in many ways, it is!\nIt's a bit narrower in the beginning, but it does begin to unfold into lots of interconnected systems.  Expect lots of things to have tags, and lots of effects to target subsets.  There's not quite as much nuance to the build-making.  There's a loadout system- a quite good one- but it's more about balancing your ins and outs.  If you liked Orb of Creation's crafting and especially alchemy/plants mechanics, you'll really like this game.  Like orb, a lot of the gating is on maximums.  Unlike orb, it's styled more on the Idling to Rule the Gods progression system.  Which I like!\nDownside- it's REAL slow.  It's definitely more of an idler than an active game, which is kind of a shame.  I can't help but compare it to Orb again- that game always has something for you to be clicking or doing.  This game, you'll find yourself just waiting a fair amount of the time.\nI tweaked the game with a debugger to crank the speed up to 20x, and it feels about right.  I think the dev should consider making that a game option from the start.  Still becomes a bit idle, but there's enough to explore and fidget with at that speed.\nAnyway, it's a really, really good incremental, and the comparison is apt- it really is good enough to stand with Orb of Creation.  Just know that it's a lot more passive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fairly nice game, a lot of little things to do and figure out, perhaps at the end of the day there are other games that remain more engaging, but when you go to an idle game, you expect a fairly idle game, and you know what you are getting into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. Only things that can be better is in my opinion the amount of content. I like the small story clips when you have hit 100, 500, 1000 .... etc. Its very cool but way to little. \r\nA cool thing would be equipment you build once very cheap with starting recources and over time make it stronger. Like I would love a robe you make at the start with like 100 fibers and then enchant it with runes or similar stuff. \r\nIm not fully done so if anything is down here that is already in the game pls discard. \r\nThis game needs a wizard Tower, Golems, equipment that you enhance, an Astral gate or any way for infinite exploration in a way (Map fragments are not the best but a very cool idea). Just read, if you have time: \"Warlock of the Magus World\" and you would have enough content ideas for 15 games. \r\n\r\nAt the end for 2 or 3 bucks I have got way more than my moneys worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an interesting and challenging game.  You have to think about what you are doing.   Strategy is very important.   It is slow at the beginning.  But starts adding in new things.  And you have to see what is involved. and how to use them properly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've just finished the final unlock. \n\nOverall, this game hits the right marks for myself at least as an incremental game. Starting with very little and a whole bunch of stuff to unlock and look forwards to, Whilst yes there are some parts that took a lot longer to get through than others, i feel that is kind of what part of an incremental game is. Slowly working your way through and unlocking the different dialogues that popped up throughout kept things fairly interesting. One of the things i would like to see added however is what dialogue options are still left to unlock. As it would be nice to know i have finished everything that is available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gets a little boring after lvl 50 but numbers go up at a good pace until then.  If you like numbers going up try it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Positive review worthy idle game.\r\n\r\nI've played them all, (with Trimps still being the best idle ever made, for reference to my opinion), but I'm really enjoying this one, and am already considering it one of those few \"gems\" in the big pile of idle/incremental/clicker rubble, and hope it will get further properly polished into a shining crown jewel of the idle/clicker segment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good new real idle game.\n\nYou can play active and improve efficiency or let it idle and run automated.\n\nMid/end game has no balance, but it will improve over time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has potential to be amazing.\n\nFor a Magic/Wizard game, there's a lack of spells and \"magic\" stuff. I'm chopping wood and mining but it goes on for a long time. I've got some basic spells but there's a small set and they're fairly generic. Mana felt limiting and boring. Maybe I'm just \"not there\" yet but at 20hs almost all at 4x speed, it's taking a while.\n\nI enjoyed the automation aspects and setting up scripts with rules mostly felt quite intuitive. \n\nI loved how actions ran at the same time rather than one after the other - although it meant the easiest way to play was to turn on all actions, balance, and leave it running. This came from the devs previous web game (was quite pleased to see this as I was playing Idlemancery when I found this game, which has the same mechanic, and turned out it was by the same developer!)\n\nThe skill tree is unfortunately uninspired - I would have liked to see less skills with more bang, or something other than just minor improvements to rates.\n\nAlso I know that the store page says no prestige mechanic - but it almost feels like it would fit in well as the higher levels become quite slow. There also seems to be no benefit in levelling up \"old\" jobs (I was expecting something for being a level 200 beggar) which is fine\n\nI don't mind the 4x speed offline option (but would be good to add 8x or 16x if offline progress is too hard to hard)\n\nThe story snippets are fun and humorous - although I am a little disheartened at how often my wizard fails. Its hard to tell whether I'm actually \"good\" at something despite having 300 levels. I also don't really see where the plot is going? or if there is a plot?\n\nGenerally, it seems like the design would benefit from encouraging (and rewarding!) specialisation more rather than just turning everything to auto and checking in. I don't feel limited by doing it all and that means there is limited reason to make choices.\n\nOverall: the base is fun and well designed. Generally good systems and fun to play but currently missing the \"zing\" of other games like Theory of Magic or Magic Research 1/2.  Currently worth the price of admission and it is early access, so hopeful to see something special built out of the good foundations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game. Really apprecieate that there is no shoehorned \"prestige system\" to drag out and re-cycle the content. I usually find that boring because inevitably you only find something new once every 8 hrs as the game loop devolves. This gtame cuts away that nonsense and leaves a clean experience that still needs to be polished and expanded a little bit. Again Solid game well worth 6$",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy more active incremental games, and Mages Path seems to hit a pretty good sweet spot between having to wait and \"idle\" vs having things you can do to better optimize the number go up. \r\n\r\nThere isn't any offline progress, which I personally think is a good thing, but you do get 4x time speed as a resource as the game is offline. It is capped at 24 hours, so that means after 24 hours of not playing, you have about 8 hours of 4x speed you can use.\r\n\r\nThe biggest time gate seems to be coin cap and im not sure how I feel about it. I wonder if having more things linked to your attributes rather than money and money cap would be a good thing or not. As it is now it feels like you have to search through the unlocks one by one trying to find the next big increase to coin cap in order to actually progress and unlock more mechanics. Overall I am neutral on this as I don't know what you could replace it with that would be better.\r\n\r\nIt was probably around hour 20 that everything started to feel much slower and it fell out of that \"sweet zone.\" I assume this is around the end of current progress as of now. If not, then I hope they add more at around the 2.5k-4k attribute range.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best starts (in that i've only played 3 hours so far) to an idle game I've experienced. Well thought-out and funny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun incremental.  I think it plays like progress knight meets theory of magic.  However there are some points where you just have to leave the game open and idling to progress - hopefully these things are ironed out as the game is developed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Engaging incremental game with fun bits of story and a pleasing amount of automation. \nThe progress rate is fine if you let it run on its own, thanks to the configurable layers of automation, but it's also very rewarding when 'played actively' as you min-max your automation logic or switch your priority between the various attributes to unlock new features and abilities sooner. \n\nThere's different playstyle as you're free to prioritize or equally improve several categories of abilities (physical, social, magic, mental) and there's a nice amount of things to do with ressource crafting, herb gathering, alchemy and spell casting. All with their layer of optional automation. (There's a lot of cross-category synergies btw, don't entirely ignore any one of them)\n\nThere is \"offline progress\" in the form of a 4x time speed that stacks up to 24h to catch up on offline time.\n\nIt's still in Early Access, but I'm satisfied with the amount of content and polish. The dev is actively working on it and listens to feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wanted to let the creator know that i found a glitch or bug that didn't unlock the Metaphysics Book when I got 275 Magic ability. Just thought it should be brought up.\nI found out why that wasn't working, just needed to unlock some other stuff that that to work, now i have an other issue, the game just stopped working for me and it wont even load up for some reason, i even uninstalled to try and it still wont work...idk what to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its nice, very clean,  enjoy it for what it is, cant wait to complete it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game and lots of potential for a Version 0.2\nNice UI and QoL, I love that you can setup a \"training program\" with \"do 40% Task A, 30% Task B, 0,015% Task C\" (doesnt have to add up, game compensates for no idle time), so you can balance your Money / Stamina / Health gains and losses. Wonderful for min-maxing fans. All in all well rounded, the occasional flavour-messages for skill milestones give me a chuckle every once and then.\n\nEven for an early version its quite clear how to unlock new activities.\nA very well spent fiver.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is off to a good start.  Similar to Orb of Creation although the interface is more basic (but still pretty good compared to other idle games).\nI like the anecdote pop-ups that come with unlock thresholds - a nice tone.\nIt passes the \"You progress faster if you use some strategy in what you click on\" test.\nA good tutorial - it finished just as I was hoping for it to finish.\n5 hours in and I still feel like I'm discovering some new things and enjoying myself.  Hopefully that will continue.  There seems to be quite a lot of content, and the game structure seems setup in a way that the dev can make quite fast progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apparently my mother had quite the Tylenol addiction while she was pregnant with me.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "only 1.5 hours in but I am already planning on wasting a lot of time, similar to your chronicle in some ways so i for sure recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best idle incremental game of this year.\n10 / 10 + a badass seal of approval.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Albeit sometimes the progress is slow, overall it's a very enjoyable experience with lots of things to unlock and some unique mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You click on funny boxes and numbers go up in the same style as theory of magic or your chronicle except the UI looks nice, what's not to love",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't put the game away, this is the kind of incrementals I talk about when I talk about the good ones :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Interesting idle game. A story unfolds as you work on various tasks, skills, exercises, etc...\n\nhttps://www.youtube.com/watch?v=ZXxfKbu5pa8",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4x speed caps out at 24 hours of stored time, haven't unlocked everything yet but running 6 hours daily seems to be optimal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]Find more of my reviews on my curator page: [url=https://store.steampowered.com/curator/45817624-Kasurot-Recommends/]Kasurot Recommends[/url][/i]\n---\n[h2]Short Summary[/h2]\nA systems-heavy idle game that excels at deep, interconnected progression. It provides a massive optimization puzzle for players who love managing complex trees, tasks, and resources.\n\n[h2]The Takeaway[/h2]\n[list]\n[*] [h3]Bright Spots / What Works[/h3] The core appeal is juggling dozens of 'Actions' (like jobs and training) with talent trees and interconnected systems like crafting, property, and spell management.\n[*] [h3]Major Drawbacks / What Might Not Suit You[/h3] The gameplay loop can become repetitive. Progress may feel heavily gated, slowing significantly without very active, strategic management.\n[*] [h3]What It's About[/h3] The patient, unending pursuit of ultimate magical knowledge and learning to manage the growing power and integrated systems.\n[*] [h3]How It Plays[/h3] A pure, numbers-driven progression system that directly tests your ability to optimize and manage resources.\n[*] [h3]Core Tone[/h3] Contemplative and methodical. The atmosphere is mystical but humorous, focused entirely on slow-burn growth.\n[*] [h3]Series & Genre Context[/h3] A standout in the \"complex idle\" subgenre. It is built for players who prefer interconnected numbers-go-up systems over action or narrative.\n[*] [h3]Technical Snapshot[/h3] Very stable with a dense but functional UI. Tooltips are essential and generally clear. It's well-optimized for long-running background sessions.\n[/list]\n[h2]Main Review[/h2]\n[b]Idle Awakening: Mages Path[/b] casts you as an overseer. You are not a hero in the field but the high-level guide for a mage's development. This is a game about the patient, unending pursuit of ultimate magical knowledge. Your role is to manage the burden of that immense power by making smart, strategic decisions from afar.\n\nThe gameplay is a masterclass in interconnected systems. Your primary task is to juggle a vast array of 'Actions', such as jobs and training, to build core attributes. These stats, in turn, unlock nodes in a multi-layered talent trees. This entire loop feeds a series of other deep systems. You will manage crafting in the Workshop, optimize spell rotations in the Magic tab, and develop properties and build furniture and accessories. It is a pure, numbers-driven progression puzzle designed to test your optimization and resource management skills - or relax and wait for progression.\n\nThis intricate mechanical focus creates a contemplative and methodical tone. The game feels mystical and arcane, capturing the feeling of slow-burn growth and academic study. There is no urgent threat. The narrative is minimalist, with any story beats serving only as milestones to mark your next level of progression. The world is not a place you explore, but a set of systems you master.\n\n[b]Idle Awakening: Mages Path[/b] is a triumphant example of the \"optimizer's\" idle game. It wastes no time on story or action. Instead, it dedicates all its resources to building a deep, complex, and satisfying engine for players to tinker with.\n\n[h2]The Verdict[/h2]\nThis game is for the systems-driven strategist. It is a perfect fit for players who love spreadsheets, theorycrafting, and managing dozens of interlocking mechanics. If you want a game to run in the background while you optimize complex builds, this is ideal. Those who need a strong narrative or active gameplay will find nothing here. The loop can become repetitive, and progress will feel gated if you are not actively managing your strategy.\n\n[i]For the patient optimizer who finds joy in pure, numbers-driven progression, this is a highly recommended experience.[/i]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "it is fun to play as you wh a show and just let it play in the backgr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, is nice that you can reset your skills if you want, and you can reset your property stuff to if you need to reconfigure how much space you need",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very decent idle so far.\r\n\r\nTL : DR It feels like it's still in very early stages of development, but the foundation of the game is good.\r\n(Still on version 0.2.1d as I'm posting this review)\r\n\r\nIn more detail,\r\nthe good: \r\n1. Clean UI. \r\n2. Lots of mechanics. \r\n3. Well thought out progression.\r\n4. Good writing, (A side-note here, the way of writing is good, but the story itself, constantly reminding you that your character is an absolute idiot, even after 10 hours in the game, is getting repetitive)\r\nthe bad: \r\n1. Steep decline of progress 10 hours in. \r\n2a. The potion to reset your skills requires an insane amount of materials.\r\n2b. No prestige. This would have been a great alternative to reseting your skills. Don't like the build you have? Start anew. I for one really like the prestige element of other idles, but since the dev has this as a selling point on the steam page, I won't say anything more on the matter.\r\n3. My biggest issue with this game is that the way you unlock new mechanics is kind of hidden. For example, you have the ability to walk from the start of the game. The UI tells you that \"Every 100 levels of this action, it ranks up giving you bigger benefits.\" And every now and then when you hit a level like 10,25,50,75 or 100 you might get some more story and unlock new things. The problem is that you have no idea at what level you might unlock a new thing and how much easier this new thing might make the game. Let's say you hit level 10 and you unlock the ability to buy new shoes, which give you more exp per second for your walking ability while walking. So you spend 10 minutes making money to buy those shoes and go back to walking. Then on level 25 of walking, you unlock a new job that gives you more money than the previous one, so you start wondering if it would have been better to keep walking to level 25 and just go and do the next job after that. (I don't remember exactly what you unlock on each level, just making an example here)\r\n\r\nThis way of unlocking new things is annoying (at least to me). I find myself thinking \"Should I put a few more levels on that skill or will it be a waste of time?\" most of the time playing this game.\r\nA suggestion for this issue: This could easily be offset with a new spell that tells you which skill requires the least amount of leveling up for the next unlock.\r\n\r\nAll in all, I am excited to see more from this game, but I think I will wait a few more months before coming back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idle game done right. Absolutely worth the price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, can only recommend to all idler fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "UI needs some serious work but core gameplay is great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good idler, took you some time to learn the mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool slow idler, looking forward to updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a lot of nice things going for it. It is very enjoyable and relaxing. Still in active development.\n\nAfter a while tedium sets in though, systems like expeditions and event hall are introduced very late into the game though. And the whole gathering system is poorly implemented.\n\nThese are nitpicks, the game is worth the price for people who enjoy polished incremental idle games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great Idle game, looking forward to even more content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty dang cozy incremental/idle game. Has a pretty solid progression curve, and you have a steady, but not overwhelming, rate of new minor and major unlocks. Automation is pretty great, as well, letting you program sets of actions. Works well with both 4x speed offline (up to a day's bank) or running automations overnight if that's preferred. I enjoy the writing, though I wish there was a way to know when the next story unlock will be for any given action. There's a section in the 'upcoming unlocks' for actions, so maybe having it there, showing you when the next story AND next substantial unlock will be for any action, to satisfy completionists, story enjoyers, and those that don't care for the writing.\n\nThe game is early access, but I'd say thus far I've gotten a decent return for my investment. There are things missing, like having very, very few action-based unlocks, yet having a dedicated section for them in the unlock menu, and improvements to be had, but it is very early on for the game, so we'll see how it shapes up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The numbers go up.  They go up in interesting ways, and there's definitely fast ways for them to go up and slow ways for them to go up.  Things get unlocked.  The unlocks are interesting, and the bits of story text are fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "interface a little messy, so it can take some time to understand stuff, but good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Extremely refreshing incremental game amongst the ones that don't interest me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall it's about what you'd expect, some of the balancing maybe needs some fiddling (coin cap is hugely restricting more than any other resource for a long time!) but it's pretty cute overall. My only real personal grumble is I saw a review comparing to Arcanum and such and I like a lot of what's here, but.. it feels like in this game you kinda *do* have to do everything, you can't really pick/splilt/branch off into different specializations or approaches or resource focuses or whatnot, you just kinda gotta do it all to unlock stuff and progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loving it so far. Need cheefments. Please and thank you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am the number 1 homeless mage frfr I just beat up some old man feeling good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some mages have towers, others have flea markets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best incremental idle games I've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excel Spreadshet the video game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game and better dev!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes like the little story its funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun idle game to pass time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great incremental game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable incremental game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice idle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like the magic regen stat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rare good idle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying progression.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "There's nothing really to this game. You have few choices to make. You never get synergies that make you feel strong. It was not very fun.\r\n\r\nThe layout of menus is bad. I spent a huge amount of time clicking into the wrong menu and wrong submenu.\r\n\r\nAt first it seems like you need to balance all your competing priorities. But in practice, you swap your points allocation between a generalized \"do everything\" build and a hyperfocused \"do this one thing\" build. A lot of upgrades are pointless. They don't meaningfully affect your bottom line.\r\n\r\nThe main thing driving you onwards is the story, which portrays your character as a bumbling fool with a heart of gold and limitless willpower. You don't feel like a magician. The only magical thing you do is click on some spells to autocast. It doesn't feel like magic. It feels like you're a crazy man building an estate by himself out of untamed wilderness, and one of your options happens to be themed as spells.\r\n\r\nI also really don't like the offline mode. You bank time up to 24 hours, and cash it in at 4x speed. That's not very much. The game prefers you leave it on in the background forever.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It has potential to be good in the future, and V0.3 should fix a lot of my gripes with it, but the main one is that the grind is atrocious and you will be idling the game for 8+ hours straight to reach a small increase.\n\nGreat for those that love tortorously slow grinds, but not so for others. I did reach end of content, and it took me about 340 hours (~20 was the Next Fest demo). \n\nWhat I really liked was that there was tons of different ways to progress later on and the story bits were quite interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For those who won't read the whole thing (I don't blame you):\n\nTHIS GAME USES AI \"ART\"\nDO NOT PURCHASE UNTIL THIS HAS BEEN FIXED\nIT WOULD PROBABLY BE A REALLY GOOD GAME IF THIS WASN'T THE CASE\n\nI played the demo and really enjoyed it. It felt like a great addition to the \"Life-sim\" type of idle game, and had a similar feel to Orb of Creation, one of the best incremental games out there, that being a feeling of steady progress and building depth where you can either choose to let growth happen in the background or play actively for faster completion. I really did enjoy it! Played for 3 or so hours. Then I bought the game...\n\nAnd noticed the opening splash. The wizard holding the book has ridiculously long fingers. Then I looked at the items you buy from the store. Then I looked at the background. It's AI \"art\" This was rather distressing. If you are not aware of why this might be problematic, let me give my understanding of the problems with these AI processes. \n\nFor one, the actual cost of these AI services is astronomical. They require huge server arrays that demand massive amounts of power, water for cooling, space, and rare minerals for the graphics cards. These facilities are often built by massive companies in remote areas due to the high environmental cost, need for water access, and the noise produced. The nearby towns are then either literally torn down or rendered nearly uninhabitable due to the waste and extreme energy price spikes.\n\nThen, before we've even gotten to the crappy picture, the data used to create the image is all stolen. I'm sure whoever is reading this has heard this before, but it's probably worse than you may know. The AI companies are, nowadays, the biggest purchasers of private data. They send out bots across the entire internet, and when I say the entire internet, I mean potentially thousands of computers dedicated to sending out these scrapers. These bots slow down the websites for us human users, steal data from every single inch of the website including but not limited to comments, images, videos, games, and screenshots. It doesn't matter who you are, they will take it. This of course leads to artists of every caliber, popular or unknown, great or terrible, images or text, stolen. The data is scraped, sent to the massive and expensive facilities (that I must reemphasize are driving up energy costs for everybody, especially those near one), and used to train their flavor of AI.\n\nWhat, then, is the result of all of this theft and destruction? You get an uncanny valley picture of a really colorful person with weird fingers making odd expressions. You get oddities like lettuce with weird bulges and inexplicable asymmetry. You get regurgitated computer data built on the stolen work of real people at great environmental and human cost, as well as cheapening the game itself. And there really is no excuse. You can spend $40, or the equivalent in whatever currency, to buy an asset pack from any number of online stores and get a greater level of quality and consistency. It might be cheaper, or even free, if you get a bit lucky. Look at Orb of Creation for an example of an incredibly well used asset pack.\n\nAs it is, I commend the Dev on the excellent game they have made (at least as far as the demo goes), but refuse to play this game so long as the art's integrity is so severely compromised for so little reason. I cannot give you money in good conscience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downvote, because I despise the \"your wallet isn't big enough to earn the money to buy a bigger wallet\" concept.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty boring tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first couple hours are good, and it feels like there's more and more to it. But it's sluggish past the start and just feels more and more stagnant as you try to push through it, hoping for that glorious breakthrough to give you a sense of accomplishment, but it never does. The demo gives all the dopamine hit you'll ever get with this one sadly.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is one of the best idles ever made in terms of QoL.\nLists with multiple actions and their efforts to avoid going back and forth activating actions.\nList automations to avoid going back and forth to gain certain resources.\nVery great features which makes the game feel like a puzzle rather than a grind.\n\nThis is all true until you reach crafting, at that point the balance completely breaks and you have to wait hours with 4x speed to unlock a minor thing that does not make the game progress faster or unlocks an actual new layer of content, just pure waiting and see numbers going up by a small percentage.\n\nI really hope the balance gets fixed soon, currently it is unfortunately tedious and unplayable after a bit.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "There's nothing really to this game. You have few choices to make. You never get synergies that make you feel strong. It was not very fun.\r\n\r\nThe layout of menus is bad. I spent a huge amount of time clicking into the wrong menu and wrong submenu.\r\n\r\nAt first it seems like you need to balance all your competing priorities. But in practice, you swap your points allocation between a generalized \"do everything\" build and a hyperfocused \"do this one thing\" build. A lot of upgrades are pointless. They don't meaningfully affect your bottom line.\r\n\r\nThe main thing driving you onwards is the story, which portrays your character as a bumbling fool with a heart of gold and limitless willpower. You don't feel like a magician. The only magical thing you do is click on some spells to autocast. It doesn't feel like magic. It feels like you're a crazy man building an estate by himself out of untamed wilderness, and one of your options happens to be themed as spells.\r\n\r\nI also really don't like the offline mode. You bank time up to 24 hours, and cash it in at 4x speed. That's not very much. The game prefers you leave it on in the background forever.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tl;dr \"It's like the dev went to idle game school, got a degree in idle games, made a game. But doesn't play or like idle games\"\n\nTo frame how i feel about this game, i'm not going to pick my biggest gripe, but one that encapsulates the way i feel about it.\nIn a fps, if you shoot some one and they don't react or you get feedback, it feels like a bad game.\nIn a idle game, if you fill a bar and nothing happens, it feels like a bad game. \nIf you don't understand why when the bar fills the number should change, even if it's small. You don't get idle games.\n\nFor when it comes to comes to idle games, the gameplay is A+\nwhy you need upgrades makes sense\nvery low cost to run the game in the background\ndifferent options to idle to get what you want\nnice art and smooth bars \nthe idea you get to play the game for what it is with out a dragging it out is awseome!\n\nbut when it comes to some one who likes idle games\nupgrades are spaced out like you're watching the game, not tabbing into it bettwen games of ranked \nto understand what a upgrade is, you gotta click on it. no easy to understand info when you look at the upgrade\nno offline idling\nno bonus for being offline\nno \"click a button and come back in a few hours\" type of idling\nno \"grand idea\" there is a story, but there is nothing that says \"you NEED to follow the story!\"\nno \"OOHH what's this new thing?!\"\n\n\nAnd at the end of the day that's why i'm saying \"don't buy this\"\nFor could the dev address everything I said? maybe.\n\nBut do i think QnA he's going to make the dev understand what a idle game good? NO.\nunless the dev cares, the best this game will ever be is\n\"well, good enough i guess\"\n\nIt's not going to make people understand why idle games are good, it's not going to pull people away from other games. \n\nmy final feeling on the game is \"It will never be better than a idle game you play as you wait for better games to come out\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is interesting and has potential, good ideas, original to some extent. But it has a major issue imho, no offline progress. I hope this changes because the x4 time thingy doesn't cut it for me in this type of games.\r\nFor now it is a NO.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even by idler standart, this game is very grindy and not very exciting.New things unlocked are bland and low impact.\nThe demo was very fun but the rest of the game is so slow....\n\nOne very good aspect of the game ; the automation and customisation of tasks is actualy making the game even more boring. Once you have written all your mini scripts, you don't need to play for hours or days until the next unlock. You then do minute adjustment and repeat.\n\nNot a bad game, just boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It has potential to be good in the future, and V0.3 should fix a lot of my gripes with it, but the main one is that the grind is atrocious and you will be idling the game for 8+ hours straight to reach a small increase.\n\nGreat for those that love tortorously slow grinds, but not so for others. I did reach end of content, and it took me about 340 hours (~20 was the Next Fest demo). \n\nWhat I really liked was that there was tons of different ways to progress later on and the story bits were quite interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is boring.\r\n\r\nI'm not about to make some automation scripts for every teensy thing, and playing this actively would require constant management of resources. \r\n\r\nThe game revolves actions which require resources, which you run out of. But those actions do create resources for other actions, and so on and so forth. A rotation of actions, which is boring in and of itself.\r\n\r\nBut then the magic appeared after a while, and I was excited to check it out. Because this is \"Mages Path\", right? Colour me surprised when I find out that magic just buffs your regular actions and creates more actions, to rotate more resources. But hey, you can write your automation for magic as well.\r\n\r\nTo me, there is no magic in this game. It's a slogfest. It is boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is more of a medieval homeless simulator than a mages awakening. The \"magic\" is limited to the two schools of restoration and illusion and after WEEKS of trying to game the offline 4x time system I was still only at the beginner spells. Save your time and effort and go play Theory of Magic if you want a mage based Idle game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So the game itself is pretty decent but dude.\nYou cannot have you idle excel sheet style game be liable to crash every few hours. Like that's a VERY big no no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OK, it's an idle game. I get it. It's not supposed to be all that exciting or challenging. However, this one is just flat out mind numbing. It's very long and drawn out and feels like the mathematical structure is off. Everything takes forever after lvl 50. May as well uninstall at that point.   \r\n\r\nGraphics are non existent (idle game...it's excusable)\r\nAudio is more like ASMR music. (combine that with a boring game and they'll find you passed out on the keyboard)\r\nAs far as replaying it.... HARD NO. \r\n\r\noverall this is lacking even for an idle game 2/10 IMO",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Start is great but the unlocks jump from every 50 to every 1000 and then to 25.000. My only reliable source of charisma would have to run for probably 20hours straight on 4x speed. Not gonna do that.\n\nMagic scaling is insane too. +.25 to magic effect, but manacost basically double every level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The level of automation is great but the game is bland and grindy, the unlocks are unrewarding, and the story snippets are trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Opening anything for more information in the shop ends in locking the game because you cannot close the window.\n\nEdit: issue above is fixed, Game is however boring and does not make me want to continue playing. \"Offline\" progress is done via a Speed up which i personally dislike. The overall goal seems aimless, the rewards for tasks minuscule and the fun is minimal. While it is a serviceable idle game for those that need another to scratch that itch, it is by no means a game I can recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not terrible, but the progression didn't feel very interesting, idk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For those who won't read the whole thing (I don't blame you):\n\nTHIS GAME USES AI \"ART\"\nDO NOT PURCHASE UNTIL THIS HAS BEEN FIXED\nIT WOULD PROBABLY BE A REALLY GOOD GAME IF THIS WASN'T THE CASE\n\nI played the demo and really enjoyed it. It felt like a great addition to the \"Life-sim\" type of idle game, and had a similar feel to Orb of Creation, one of the best incremental games out there, that being a feeling of steady progress and building depth where you can either choose to let growth happen in the background or play actively for faster completion. I really did enjoy it! Played for 3 or so hours. Then I bought the game...\n\nAnd noticed the opening splash. The wizard holding the book has ridiculously long fingers. Then I looked at the items you buy from the store. Then I looked at the background. It's AI \"art\" This was rather distressing. If you are not aware of why this might be problematic, let me give my understanding of the problems with these AI processes. \n\nFor one, the actual cost of these AI services is astronomical. They require huge server arrays that demand massive amounts of power, water for cooling, space, and rare minerals for the graphics cards. These facilities are often built by massive companies in remote areas due to the high environmental cost, need for water access, and the noise produced. The nearby towns are then either literally torn down or rendered nearly uninhabitable due to the waste and extreme energy price spikes.\n\nThen, before we've even gotten to the crappy picture, the data used to create the image is all stolen. I'm sure whoever is reading this has heard this before, but it's probably worse than you may know. The AI companies are, nowadays, the biggest purchasers of private data. They send out bots across the entire internet, and when I say the entire internet, I mean potentially thousands of computers dedicated to sending out these scrapers. These bots slow down the websites for us human users, steal data from every single inch of the website including but not limited to comments, images, videos, games, and screenshots. It doesn't matter who you are, they will take it. This of course leads to artists of every caliber, popular or unknown, great or terrible, images or text, stolen. The data is scraped, sent to the massive and expensive facilities (that I must reemphasize are driving up energy costs for everybody, especially those near one), and used to train their flavor of AI.\n\nWhat, then, is the result of all of this theft and destruction? You get an uncanny valley picture of a really colorful person with weird fingers making odd expressions. You get oddities like lettuce with weird bulges and inexplicable asymmetry. You get regurgitated computer data built on the stolen work of real people at great environmental and human cost, as well as cheapening the game itself. And there really is no excuse. You can spend $40, or the equivalent in whatever currency, to buy an asset pack from any number of online stores and get a greater level of quality and consistency. It might be cheaper, or even free, if you get a bit lucky. Look at Orb of Creation for an example of an incredibly well used asset pack.\n\nAs it is, I commend the Dev on the excellent game they have made (at least as far as the demo goes), but refuse to play this game so long as the art's integrity is so severely compromised for so little reason. I cannot give you money in good conscience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downvote, because I despise the \"your wallet isn't big enough to earn the money to buy a bigger wallet\" concept.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty boring tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first couple hours are good, and it feels like there's more and more to it. But it's sluggish past the start and just feels more and more stagnant as you try to push through it, hoping for that glorious breakthrough to give you a sense of accomplishment, but it never does. The demo gives all the dopamine hit you'll ever get with this one sadly.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is one of the best idles ever made in terms of QoL.\nLists with multiple actions and their efforts to avoid going back and forth activating actions.\nList automations to avoid going back and forth to gain certain resources.\nVery great features which makes the game feel like a puzzle rather than a grind.\n\nThis is all true until you reach crafting, at that point the balance completely breaks and you have to wait hours with 4x speed to unlock a minor thing that does not make the game progress faster or unlocks an actual new layer of content, just pure waiting and see numbers going up by a small percentage.\n\nI really hope the balance gets fixed soon, currently it is unfortunately tedious and unplayable after a bit.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "There's nothing really to this game. You have few choices to make. You never get synergies that make you feel strong. It was not very fun.\r\n\r\nThe layout of menus is bad. I spent a huge amount of time clicking into the wrong menu and wrong submenu.\r\n\r\nAt first it seems like you need to balance all your competing priorities. But in practice, you swap your points allocation between a generalized \"do everything\" build and a hyperfocused \"do this one thing\" build. A lot of upgrades are pointless. They don't meaningfully affect your bottom line.\r\n\r\nThe main thing driving you onwards is the story, which portrays your character as a bumbling fool with a heart of gold and limitless willpower. You don't feel like a magician. The only magical thing you do is click on some spells to autocast. It doesn't feel like magic. It feels like you're a crazy man building an estate by himself out of untamed wilderness, and one of your options happens to be themed as spells.\r\n\r\nI also really don't like the offline mode. You bank time up to 24 hours, and cash it in at 4x speed. That's not very much. The game prefers you leave it on in the background forever.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tl;dr \"It's like the dev went to idle game school, got a degree in idle games, made a game. But doesn't play or like idle games\"\n\nTo frame how i feel about this game, i'm not going to pick my biggest gripe, but one that encapsulates the way i feel about it.\nIn a fps, if you shoot some one and they don't react or you get feedback, it feels like a bad game.\nIn a idle game, if you fill a bar and nothing happens, it feels like a bad game. \nIf you don't understand why when the bar fills the number should change, even if it's small. You don't get idle games.\n\nFor when it comes to comes to idle games, the gameplay is A+\nwhy you need upgrades makes sense\nvery low cost to run the game in the background\ndifferent options to idle to get what you want\nnice art and smooth bars \nthe idea you get to play the game for what it is with out a dragging it out is awseome!\n\nbut when it comes to some one who likes idle games\nupgrades are spaced out like you're watching the game, not tabbing into it bettwen games of ranked \nto understand what a upgrade is, you gotta click on it. no easy to understand info when you look at the upgrade\nno offline idling\nno bonus for being offline\nno \"click a button and come back in a few hours\" type of idling\nno \"grand idea\" there is a story, but there is nothing that says \"you NEED to follow the story!\"\nno \"OOHH what's this new thing?!\"\n\n\nAnd at the end of the day that's why i'm saying \"don't buy this\"\nFor could the dev address everything I said? maybe.\n\nBut do i think QnA he's going to make the dev understand what a idle game good? NO.\nunless the dev cares, the best this game will ever be is\n\"well, good enough i guess\"\n\nIt's not going to make people understand why idle games are good, it's not going to pull people away from other games. \n\nmy final feeling on the game is \"It will never be better than a idle game you play as you wait for better games to come out\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is interesting and has potential, good ideas, original to some extent. But it has a major issue imho, no offline progress. I hope this changes because the x4 time thingy doesn't cut it for me in this type of games.\r\nFor now it is a NO.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even by idler standart, this game is very grindy and not very exciting.New things unlocked are bland and low impact.\nThe demo was very fun but the rest of the game is so slow....\n\nOne very good aspect of the game ; the automation and customisation of tasks is actualy making the game even more boring. Once you have written all your mini scripts, you don't need to play for hours or days until the next unlock. You then do minute adjustment and repeat.\n\nNot a bad game, just boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It has potential to be good in the future, and V0.3 should fix a lot of my gripes with it, but the main one is that the grind is atrocious and you will be idling the game for 8+ hours straight to reach a small increase.\n\nGreat for those that love tortorously slow grinds, but not so for others. I did reach end of content, and it took me about 340 hours (~20 was the Next Fest demo). \n\nWhat I really liked was that there was tons of different ways to progress later on and the story bits were quite interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is boring.\r\n\r\nI'm not about to make some automation scripts for every teensy thing, and playing this actively would require constant management of resources. \r\n\r\nThe game revolves actions which require resources, which you run out of. But those actions do create resources for other actions, and so on and so forth. A rotation of actions, which is boring in and of itself.\r\n\r\nBut then the magic appeared after a while, and I was excited to check it out. Because this is \"Mages Path\", right? Colour me surprised when I find out that magic just buffs your regular actions and creates more actions, to rotate more resources. But hey, you can write your automation for magic as well.\r\n\r\nTo me, there is no magic in this game. It's a slogfest. It is boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is more of a medieval homeless simulator than a mages awakening. The \"magic\" is limited to the two schools of restoration and illusion and after WEEKS of trying to game the offline 4x time system I was still only at the beginner spells. Save your time and effort and go play Theory of Magic if you want a mage based Idle game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So the game itself is pretty decent but dude.\nYou cannot have you idle excel sheet style game be liable to crash every few hours. Like that's a VERY big no no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OK, it's an idle game. I get it. It's not supposed to be all that exciting or challenging. However, this one is just flat out mind numbing. It's very long and drawn out and feels like the mathematical structure is off. Everything takes forever after lvl 50. May as well uninstall at that point.   \r\n\r\nGraphics are non existent (idle game...it's excusable)\r\nAudio is more like ASMR music. (combine that with a boring game and they'll find you passed out on the keyboard)\r\nAs far as replaying it.... HARD NO. \r\n\r\noverall this is lacking even for an idle game 2/10 IMO",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Start is great but the unlocks jump from every 50 to every 1000 and then to 25.000. My only reliable source of charisma would have to run for probably 20hours straight on 4x speed. Not gonna do that.\n\nMagic scaling is insane too. +.25 to magic effect, but manacost basically double every level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The level of automation is great but the game is bland and grindy, the unlocks are unrewarding, and the story snippets are trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Opening anything for more information in the shop ends in locking the game because you cannot close the window.\n\nEdit: issue above is fixed, Game is however boring and does not make me want to continue playing. \"Offline\" progress is done via a Speed up which i personally dislike. The overall goal seems aimless, the rewards for tasks minuscule and the fun is minimal. While it is a serviceable idle game for those that need another to scratch that itch, it is by no means a game I can recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not terrible, but the progression didn't feel very interesting, idk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For those who won't read the whole thing (I don't blame you):\n\nTHIS GAME USES AI \"ART\"\nDO NOT PURCHASE UNTIL THIS HAS BEEN FIXED\nIT WOULD PROBABLY BE A REALLY GOOD GAME IF THIS WASN'T THE CASE\n\nI played the demo and really enjoyed it. It felt like a great addition to the \"Life-sim\" type of idle game, and had a similar feel to Orb of Creation, one of the best incremental games out there, that being a feeling of steady progress and building depth where you can either choose to let growth happen in the background or play actively for faster completion. I really did enjoy it! Played for 3 or so hours. Then I bought the game...\n\nAnd noticed the opening splash. The wizard holding the book has ridiculously long fingers. Then I looked at the items you buy from the store. Then I looked at the background. It's AI \"art\" This was rather distressing. If you are not aware of why this might be problematic, let me give my understanding of the problems with these AI processes. \n\nFor one, the actual cost of these AI services is astronomical. They require huge server arrays that demand massive amounts of power, water for cooling, space, and rare minerals for the graphics cards. These facilities are often built by massive companies in remote areas due to the high environmental cost, need for water access, and the noise produced. The nearby towns are then either literally torn down or rendered nearly uninhabitable due to the waste and extreme energy price spikes.\n\nThen, before we've even gotten to the crappy picture, the data used to create the image is all stolen. I'm sure whoever is reading this has heard this before, but it's probably worse than you may know. The AI companies are, nowadays, the biggest purchasers of private data. They send out bots across the entire internet, and when I say the entire internet, I mean potentially thousands of computers dedicated to sending out these scrapers. These bots slow down the websites for us human users, steal data from every single inch of the website including but not limited to comments, images, videos, games, and screenshots. It doesn't matter who you are, they will take it. This of course leads to artists of every caliber, popular or unknown, great or terrible, images or text, stolen. The data is scraped, sent to the massive and expensive facilities (that I must reemphasize are driving up energy costs for everybody, especially those near one), and used to train their flavor of AI.\n\nWhat, then, is the result of all of this theft and destruction? You get an uncanny valley picture of a really colorful person with weird fingers making odd expressions. You get oddities like lettuce with weird bulges and inexplicable asymmetry. You get regurgitated computer data built on the stolen work of real people at great environmental and human cost, as well as cheapening the game itself. And there really is no excuse. You can spend $40, or the equivalent in whatever currency, to buy an asset pack from any number of online stores and get a greater level of quality and consistency. It might be cheaper, or even free, if you get a bit lucky. Look at Orb of Creation for an example of an incredibly well used asset pack.\n\nAs it is, I commend the Dev on the excellent game they have made (at least as far as the demo goes), but refuse to play this game so long as the art's integrity is so severely compromised for so little reason. I cannot give you money in good conscience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downvote, because I despise the \"your wallet isn't big enough to earn the money to buy a bigger wallet\" concept.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty boring tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first couple hours are good, and it feels like there's more and more to it. But it's sluggish past the start and just feels more and more stagnant as you try to push through it, hoping for that glorious breakthrough to give you a sense of accomplishment, but it never does. The demo gives all the dopamine hit you'll ever get with this one sadly.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is one of the best idles ever made in terms of QoL.\nLists with multiple actions and their efforts to avoid going back and forth activating actions.\nList automations to avoid going back and forth to gain certain resources.\nVery great features which makes the game feel like a puzzle rather than a grind.\n\nThis is all true until you reach crafting, at that point the balance completely breaks and you have to wait hours with 4x speed to unlock a minor thing that does not make the game progress faster or unlocks an actual new layer of content, just pure waiting and see numbers going up by a small percentage.\n\nI really hope the balance gets fixed soon, currently it is unfortunately tedious and unplayable after a bit.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "There's nothing really to this game. You have few choices to make. You never get synergies that make you feel strong. It was not very fun.\r\n\r\nThe layout of menus is bad. I spent a huge amount of time clicking into the wrong menu and wrong submenu.\r\n\r\nAt first it seems like you need to balance all your competing priorities. But in practice, you swap your points allocation between a generalized \"do everything\" build and a hyperfocused \"do this one thing\" build. A lot of upgrades are pointless. They don't meaningfully affect your bottom line.\r\n\r\nThe main thing driving you onwards is the story, which portrays your character as a bumbling fool with a heart of gold and limitless willpower. You don't feel like a magician. The only magical thing you do is click on some spells to autocast. It doesn't feel like magic. It feels like you're a crazy man building an estate by himself out of untamed wilderness, and one of your options happens to be themed as spells.\r\n\r\nI also really don't like the offline mode. You bank time up to 24 hours, and cash it in at 4x speed. That's not very much. The game prefers you leave it on in the background forever.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tl;dr \"It's like the dev went to idle game school, got a degree in idle games, made a game. But doesn't play or like idle games\"\n\nTo frame how i feel about this game, i'm not going to pick my biggest gripe, but one that encapsulates the way i feel about it.\nIn a fps, if you shoot some one and they don't react or you get feedback, it feels like a bad game.\nIn a idle game, if you fill a bar and nothing happens, it feels like a bad game. \nIf you don't understand why when the bar fills the number should change, even if it's small. You don't get idle games.\n\nFor when it comes to comes to idle games, the gameplay is A+\nwhy you need upgrades makes sense\nvery low cost to run the game in the background\ndifferent options to idle to get what you want\nnice art and smooth bars \nthe idea you get to play the game for what it is with out a dragging it out is awseome!\n\nbut when it comes to some one who likes idle games\nupgrades are spaced out like you're watching the game, not tabbing into it bettwen games of ranked \nto understand what a upgrade is, you gotta click on it. no easy to understand info when you look at the upgrade\nno offline idling\nno bonus for being offline\nno \"click a button and come back in a few hours\" type of idling\nno \"grand idea\" there is a story, but there is nothing that says \"you NEED to follow the story!\"\nno \"OOHH what's this new thing?!\"\n\n\nAnd at the end of the day that's why i'm saying \"don't buy this\"\nFor could the dev address everything I said? maybe.\n\nBut do i think QnA he's going to make the dev understand what a idle game good? NO.\nunless the dev cares, the best this game will ever be is\n\"well, good enough i guess\"\n\nIt's not going to make people understand why idle games are good, it's not going to pull people away from other games. \n\nmy final feeling on the game is \"It will never be better than a idle game you play as you wait for better games to come out\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is interesting and has potential, good ideas, original to some extent. But it has a major issue imho, no offline progress. I hope this changes because the x4 time thingy doesn't cut it for me in this type of games.\r\nFor now it is a NO.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even by idler standart, this game is very grindy and not very exciting.New things unlocked are bland and low impact.\nThe demo was very fun but the rest of the game is so slow....\n\nOne very good aspect of the game ; the automation and customisation of tasks is actualy making the game even more boring. Once you have written all your mini scripts, you don't need to play for hours or days until the next unlock. You then do minute adjustment and repeat.\n\nNot a bad game, just boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It has potential to be good in the future, and V0.3 should fix a lot of my gripes with it, but the main one is that the grind is atrocious and you will be idling the game for 8+ hours straight to reach a small increase.\n\nGreat for those that love tortorously slow grinds, but not so for others. I did reach end of content, and it took me about 340 hours (~20 was the Next Fest demo). \n\nWhat I really liked was that there was tons of different ways to progress later on and the story bits were quite interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is boring.\r\n\r\nI'm not about to make some automation scripts for every teensy thing, and playing this actively would require constant management of resources. \r\n\r\nThe game revolves actions which require resources, which you run out of. But those actions do create resources for other actions, and so on and so forth. A rotation of actions, which is boring in and of itself.\r\n\r\nBut then the magic appeared after a while, and I was excited to check it out. Because this is \"Mages Path\", right? Colour me surprised when I find out that magic just buffs your regular actions and creates more actions, to rotate more resources. But hey, you can write your automation for magic as well.\r\n\r\nTo me, there is no magic in this game. It's a slogfest. It is boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is more of a medieval homeless simulator than a mages awakening. The \"magic\" is limited to the two schools of restoration and illusion and after WEEKS of trying to game the offline 4x time system I was still only at the beginner spells. Save your time and effort and go play Theory of Magic if you want a mage based Idle game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So the game itself is pretty decent but dude.\nYou cannot have you idle excel sheet style game be liable to crash every few hours. Like that's a VERY big no no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OK, it's an idle game. I get it. It's not supposed to be all that exciting or challenging. However, this one is just flat out mind numbing. It's very long and drawn out and feels like the mathematical structure is off. Everything takes forever after lvl 50. May as well uninstall at that point.   \r\n\r\nGraphics are non existent (idle game...it's excusable)\r\nAudio is more like ASMR music. (combine that with a boring game and they'll find you passed out on the keyboard)\r\nAs far as replaying it.... HARD NO. \r\n\r\noverall this is lacking even for an idle game 2/10 IMO",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Start is great but the unlocks jump from every 50 to every 1000 and then to 25.000. My only reliable source of charisma would have to run for probably 20hours straight on 4x speed. Not gonna do that.\n\nMagic scaling is insane too. +.25 to magic effect, but manacost basically double every level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The level of automation is great but the game is bland and grindy, the unlocks are unrewarding, and the story snippets are trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Opening anything for more information in the shop ends in locking the game because you cannot close the window.\n\nEdit: issue above is fixed, Game is however boring and does not make me want to continue playing. \"Offline\" progress is done via a Speed up which i personally dislike. The overall goal seems aimless, the rewards for tasks minuscule and the fun is minimal. While it is a serviceable idle game for those that need another to scratch that itch, it is by no means a game I can recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not terrible, but the progression didn't feel very interesting, idk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For those who won't read the whole thing (I don't blame you):\n\nTHIS GAME USES AI \"ART\"\nDO NOT PURCHASE UNTIL THIS HAS BEEN FIXED\nIT WOULD PROBABLY BE A REALLY GOOD GAME IF THIS WASN'T THE CASE\n\nI played the demo and really enjoyed it. It felt like a great addition to the \"Life-sim\" type of idle game, and had a similar feel to Orb of Creation, one of the best incremental games out there, that being a feeling of steady progress and building depth where you can either choose to let growth happen in the background or play actively for faster completion. I really did enjoy it! Played for 3 or so hours. Then I bought the game...\n\nAnd noticed the opening splash. The wizard holding the book has ridiculously long fingers. Then I looked at the items you buy from the store. Then I looked at the background. It's AI \"art\" This was rather distressing. If you are not aware of why this might be problematic, let me give my understanding of the problems with these AI processes. \n\nFor one, the actual cost of these AI services is astronomical. They require huge server arrays that demand massive amounts of power, water for cooling, space, and rare minerals for the graphics cards. These facilities are often built by massive companies in remote areas due to the high environmental cost, need for water access, and the noise produced. The nearby towns are then either literally torn down or rendered nearly uninhabitable due to the waste and extreme energy price spikes.\n\nThen, before we've even gotten to the crappy picture, the data used to create the image is all stolen. I'm sure whoever is reading this has heard this before, but it's probably worse than you may know. The AI companies are, nowadays, the biggest purchasers of private data. They send out bots across the entire internet, and when I say the entire internet, I mean potentially thousands of computers dedicated to sending out these scrapers. These bots slow down the websites for us human users, steal data from every single inch of the website including but not limited to comments, images, videos, games, and screenshots. It doesn't matter who you are, they will take it. This of course leads to artists of every caliber, popular or unknown, great or terrible, images or text, stolen. The data is scraped, sent to the massive and expensive facilities (that I must reemphasize are driving up energy costs for everybody, especially those near one), and used to train their flavor of AI.\n\nWhat, then, is the result of all of this theft and destruction? You get an uncanny valley picture of a really colorful person with weird fingers making odd expressions. You get oddities like lettuce with weird bulges and inexplicable asymmetry. You get regurgitated computer data built on the stolen work of real people at great environmental and human cost, as well as cheapening the game itself. And there really is no excuse. You can spend $40, or the equivalent in whatever currency, to buy an asset pack from any number of online stores and get a greater level of quality and consistency. It might be cheaper, or even free, if you get a bit lucky. Look at Orb of Creation for an example of an incredibly well used asset pack.\n\nAs it is, I commend the Dev on the excellent game they have made (at least as far as the demo goes), but refuse to play this game so long as the art's integrity is so severely compromised for so little reason. I cannot give you money in good conscience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downvote, because I despise the \"your wallet isn't big enough to earn the money to buy a bigger wallet\" concept.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty boring tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first couple hours are good, and it feels like there's more and more to it. But it's sluggish past the start and just feels more and more stagnant as you try to push through it, hoping for that glorious breakthrough to give you a sense of accomplishment, but it never does. The demo gives all the dopamine hit you'll ever get with this one sadly.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is one of the best idles ever made in terms of QoL.\nLists with multiple actions and their efforts to avoid going back and forth activating actions.\nList automations to avoid going back and forth to gain certain resources.\nVery great features which makes the game feel like a puzzle rather than a grind.\n\nThis is all true until you reach crafting, at that point the balance completely breaks and you have to wait hours with 4x speed to unlock a minor thing that does not make the game progress faster or unlocks an actual new layer of content, just pure waiting and see numbers going up by a small percentage.\n\nI really hope the balance gets fixed soon, currently it is unfortunately tedious and unplayable after a bit.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "There's nothing really to this game. You have few choices to make. You never get synergies that make you feel strong. It was not very fun.\r\n\r\nThe layout of menus is bad. I spent a huge amount of time clicking into the wrong menu and wrong submenu.\r\n\r\nAt first it seems like you need to balance all your competing priorities. But in practice, you swap your points allocation between a generalized \"do everything\" build and a hyperfocused \"do this one thing\" build. A lot of upgrades are pointless. They don't meaningfully affect your bottom line.\r\n\r\nThe main thing driving you onwards is the story, which portrays your character as a bumbling fool with a heart of gold and limitless willpower. You don't feel like a magician. The only magical thing you do is click on some spells to autocast. It doesn't feel like magic. It feels like you're a crazy man building an estate by himself out of untamed wilderness, and one of your options happens to be themed as spells.\r\n\r\nI also really don't like the offline mode. You bank time up to 24 hours, and cash it in at 4x speed. That's not very much. The game prefers you leave it on in the background forever.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tl;dr \"It's like the dev went to idle game school, got a degree in idle games, made a game. But doesn't play or like idle games\"\n\nTo frame how i feel about this game, i'm not going to pick my biggest gripe, but one that encapsulates the way i feel about it.\nIn a fps, if you shoot some one and they don't react or you get feedback, it feels like a bad game.\nIn a idle game, if you fill a bar and nothing happens, it feels like a bad game. \nIf you don't understand why when the bar fills the number should change, even if it's small. You don't get idle games.\n\nFor when it comes to comes to idle games, the gameplay is A+\nwhy you need upgrades makes sense\nvery low cost to run the game in the background\ndifferent options to idle to get what you want\nnice art and smooth bars \nthe idea you get to play the game for what it is with out a dragging it out is awseome!\n\nbut when it comes to some one who likes idle games\nupgrades are spaced out like you're watching the game, not tabbing into it bettwen games of ranked \nto understand what a upgrade is, you gotta click on it. no easy to understand info when you look at the upgrade\nno offline idling\nno bonus for being offline\nno \"click a button and come back in a few hours\" type of idling\nno \"grand idea\" there is a story, but there is nothing that says \"you NEED to follow the story!\"\nno \"OOHH what's this new thing?!\"\n\n\nAnd at the end of the day that's why i'm saying \"don't buy this\"\nFor could the dev address everything I said? maybe.\n\nBut do i think QnA he's going to make the dev understand what a idle game good? NO.\nunless the dev cares, the best this game will ever be is\n\"well, good enough i guess\"\n\nIt's not going to make people understand why idle games are good, it's not going to pull people away from other games. \n\nmy final feeling on the game is \"It will never be better than a idle game you play as you wait for better games to come out\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is interesting and has potential, good ideas, original to some extent. But it has a major issue imho, no offline progress. I hope this changes because the x4 time thingy doesn't cut it for me in this type of games.\r\nFor now it is a NO.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even by idler standart, this game is very grindy and not very exciting.New things unlocked are bland and low impact.\nThe demo was very fun but the rest of the game is so slow....\n\nOne very good aspect of the game ; the automation and customisation of tasks is actualy making the game even more boring. Once you have written all your mini scripts, you don't need to play for hours or days until the next unlock. You then do minute adjustment and repeat.\n\nNot a bad game, just boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It has potential to be good in the future, and V0.3 should fix a lot of my gripes with it, but the main one is that the grind is atrocious and you will be idling the game for 8+ hours straight to reach a small increase.\n\nGreat for those that love tortorously slow grinds, but not so for others. I did reach end of content, and it took me about 340 hours (~20 was the Next Fest demo). \n\nWhat I really liked was that there was tons of different ways to progress later on and the story bits were quite interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is boring.\r\n\r\nI'm not about to make some automation scripts for every teensy thing, and playing this actively would require constant management of resources. \r\n\r\nThe game revolves actions which require resources, which you run out of. But those actions do create resources for other actions, and so on and so forth. A rotation of actions, which is boring in and of itself.\r\n\r\nBut then the magic appeared after a while, and I was excited to check it out. Because this is \"Mages Path\", right? Colour me surprised when I find out that magic just buffs your regular actions and creates more actions, to rotate more resources. But hey, you can write your automation for magic as well.\r\n\r\nTo me, there is no magic in this game. It's a slogfest. It is boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is more of a medieval homeless simulator than a mages awakening. The \"magic\" is limited to the two schools of restoration and illusion and after WEEKS of trying to game the offline 4x time system I was still only at the beginner spells. Save your time and effort and go play Theory of Magic if you want a mage based Idle game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So the game itself is pretty decent but dude.\nYou cannot have you idle excel sheet style game be liable to crash every few hours. Like that's a VERY big no no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OK, it's an idle game. I get it. It's not supposed to be all that exciting or challenging. However, this one is just flat out mind numbing. It's very long and drawn out and feels like the mathematical structure is off. Everything takes forever after lvl 50. May as well uninstall at that point.   \r\n\r\nGraphics are non existent (idle game...it's excusable)\r\nAudio is more like ASMR music. (combine that with a boring game and they'll find you passed out on the keyboard)\r\nAs far as replaying it.... HARD NO. \r\n\r\noverall this is lacking even for an idle game 2/10 IMO",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Start is great but the unlocks jump from every 50 to every 1000 and then to 25.000. My only reliable source of charisma would have to run for probably 20hours straight on 4x speed. Not gonna do that.\n\nMagic scaling is insane too. +.25 to magic effect, but manacost basically double every level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The level of automation is great but the game is bland and grindy, the unlocks are unrewarding, and the story snippets are trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Opening anything for more information in the shop ends in locking the game because you cannot close the window.\n\nEdit: issue above is fixed, Game is however boring and does not make me want to continue playing. \"Offline\" progress is done via a Speed up which i personally dislike. The overall goal seems aimless, the rewards for tasks minuscule and the fun is minimal. While it is a serviceable idle game for those that need another to scratch that itch, it is by no means a game I can recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not terrible, but the progression didn't feel very interesting, idk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For those who won't read the whole thing (I don't blame you):\n\nTHIS GAME USES AI \"ART\"\nDO NOT PURCHASE UNTIL THIS HAS BEEN FIXED\nIT WOULD PROBABLY BE A REALLY GOOD GAME IF THIS WASN'T THE CASE\n\nI played the demo and really enjoyed it. It felt like a great addition to the \"Life-sim\" type of idle game, and had a similar feel to Orb of Creation, one of the best incremental games out there, that being a feeling of steady progress and building depth where you can either choose to let growth happen in the background or play actively for faster completion. I really did enjoy it! Played for 3 or so hours. Then I bought the game...\n\nAnd noticed the opening splash. The wizard holding the book has ridiculously long fingers. Then I looked at the items you buy from the store. Then I looked at the background. It's AI \"art\" This was rather distressing. If you are not aware of why this might be problematic, let me give my understanding of the problems with these AI processes. \n\nFor one, the actual cost of these AI services is astronomical. They require huge server arrays that demand massive amounts of power, water for cooling, space, and rare minerals for the graphics cards. These facilities are often built by massive companies in remote areas due to the high environmental cost, need for water access, and the noise produced. The nearby towns are then either literally torn down or rendered nearly uninhabitable due to the waste and extreme energy price spikes.\n\nThen, before we've even gotten to the crappy picture, the data used to create the image is all stolen. I'm sure whoever is reading this has heard this before, but it's probably worse than you may know. The AI companies are, nowadays, the biggest purchasers of private data. They send out bots across the entire internet, and when I say the entire internet, I mean potentially thousands of computers dedicated to sending out these scrapers. These bots slow down the websites for us human users, steal data from every single inch of the website including but not limited to comments, images, videos, games, and screenshots. It doesn't matter who you are, they will take it. This of course leads to artists of every caliber, popular or unknown, great or terrible, images or text, stolen. The data is scraped, sent to the massive and expensive facilities (that I must reemphasize are driving up energy costs for everybody, especially those near one), and used to train their flavor of AI.\n\nWhat, then, is the result of all of this theft and destruction? You get an uncanny valley picture of a really colorful person with weird fingers making odd expressions. You get oddities like lettuce with weird bulges and inexplicable asymmetry. You get regurgitated computer data built on the stolen work of real people at great environmental and human cost, as well as cheapening the game itself. And there really is no excuse. You can spend $40, or the equivalent in whatever currency, to buy an asset pack from any number of online stores and get a greater level of quality and consistency. It might be cheaper, or even free, if you get a bit lucky. Look at Orb of Creation for an example of an incredibly well used asset pack.\n\nAs it is, I commend the Dev on the excellent game they have made (at least as far as the demo goes), but refuse to play this game so long as the art's integrity is so severely compromised for so little reason. I cannot give you money in good conscience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Downvote, because I despise the \"your wallet isn't big enough to earn the money to buy a bigger wallet\" concept.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty boring tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not very fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first couple hours are good, and it feels like there's more and more to it. But it's sluggish past the start and just feels more and more stagnant as you try to push through it, hoping for that glorious breakthrough to give you a sense of accomplishment, but it never does. The demo gives all the dopamine hit you'll ever get with this one sadly.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The game is one of the best idles ever made in terms of QoL.\nLists with multiple actions and their efforts to avoid going back and forth activating actions.\nList automations to avoid going back and forth to gain certain resources.\nVery great features which makes the game feel like a puzzle rather than a grind.\n\nThis is all true until you reach crafting, at that point the balance completely breaks and you have to wait hours with 4x speed to unlock a minor thing that does not make the game progress faster or unlocks an actual new layer of content, just pure waiting and see numbers going up by a small percentage.\n\nI really hope the balance gets fixed soon, currently it is unfortunately tedious and unplayable after a bit.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "There's nothing really to this game. You have few choices to make. You never get synergies that make you feel strong. It was not very fun.\r\n\r\nThe layout of menus is bad. I spent a huge amount of time clicking into the wrong menu and wrong submenu.\r\n\r\nAt first it seems like you need to balance all your competing priorities. But in practice, you swap your points allocation between a generalized \"do everything\" build and a hyperfocused \"do this one thing\" build. A lot of upgrades are pointless. They don't meaningfully affect your bottom line.\r\n\r\nThe main thing driving you onwards is the story, which portrays your character as a bumbling fool with a heart of gold and limitless willpower. You don't feel like a magician. The only magical thing you do is click on some spells to autocast. It doesn't feel like magic. It feels like you're a crazy man building an estate by himself out of untamed wilderness, and one of your options happens to be themed as spells.\r\n\r\nI also really don't like the offline mode. You bank time up to 24 hours, and cash it in at 4x speed. That's not very much. The game prefers you leave it on in the background forever.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tl;dr \"It's like the dev went to idle game school, got a degree in idle games, made a game. But doesn't play or like idle games\"\n\nTo frame how i feel about this game, i'm not going to pick my biggest gripe, but one that encapsulates the way i feel about it.\nIn a fps, if you shoot some one and they don't react or you get feedback, it feels like a bad game.\nIn a idle game, if you fill a bar and nothing happens, it feels like a bad game. \nIf you don't understand why when the bar fills the number should change, even if it's small. You don't get idle games.\n\nFor when it comes to comes to idle games, the gameplay is A+\nwhy you need upgrades makes sense\nvery low cost to run the game in the background\ndifferent options to idle to get what you want\nnice art and smooth bars \nthe idea you get to play the game for what it is with out a dragging it out is awseome!\n\nbut when it comes to some one who likes idle games\nupgrades are spaced out like you're watching the game, not tabbing into it bettwen games of ranked \nto understand what a upgrade is, you gotta click on it. no easy to understand info when you look at the upgrade\nno offline idling\nno bonus for being offline\nno \"click a button and come back in a few hours\" type of idling\nno \"grand idea\" there is a story, but there is nothing that says \"you NEED to follow the story!\"\nno \"OOHH what's this new thing?!\"\n\n\nAnd at the end of the day that's why i'm saying \"don't buy this\"\nFor could the dev address everything I said? maybe.\n\nBut do i think QnA he's going to make the dev understand what a idle game good? NO.\nunless the dev cares, the best this game will ever be is\n\"well, good enough i guess\"\n\nIt's not going to make people understand why idle games are good, it's not going to pull people away from other games. \n\nmy final feeling on the game is \"It will never be better than a idle game you play as you wait for better games to come out\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is interesting and has potential, good ideas, original to some extent. But it has a major issue imho, no offline progress. I hope this changes because the x4 time thingy doesn't cut it for me in this type of games.\r\nFor now it is a NO.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even by idler standart, this game is very grindy and not very exciting.New things unlocked are bland and low impact.\nThe demo was very fun but the rest of the game is so slow....\n\nOne very good aspect of the game ; the automation and customisation of tasks is actualy making the game even more boring. Once you have written all your mini scripts, you don't need to play for hours or days until the next unlock. You then do minute adjustment and repeat.\n\nNot a bad game, just boring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It has potential to be good in the future, and V0.3 should fix a lot of my gripes with it, but the main one is that the grind is atrocious and you will be idling the game for 8+ hours straight to reach a small increase.\n\nGreat for those that love tortorously slow grinds, but not so for others. I did reach end of content, and it took me about 340 hours (~20 was the Next Fest demo). \n\nWhat I really liked was that there was tons of different ways to progress later on and the story bits were quite interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is boring.\r\n\r\nI'm not about to make some automation scripts for every teensy thing, and playing this actively would require constant management of resources. \r\n\r\nThe game revolves actions which require resources, which you run out of. But those actions do create resources for other actions, and so on and so forth. A rotation of actions, which is boring in and of itself.\r\n\r\nBut then the magic appeared after a while, and I was excited to check it out. Because this is \"Mages Path\", right? Colour me surprised when I find out that magic just buffs your regular actions and creates more actions, to rotate more resources. But hey, you can write your automation for magic as well.\r\n\r\nTo me, there is no magic in this game. It's a slogfest. It is boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is more of a medieval homeless simulator than a mages awakening. The \"magic\" is limited to the two schools of restoration and illusion and after WEEKS of trying to game the offline 4x time system I was still only at the beginner spells. Save your time and effort and go play Theory of Magic if you want a mage based Idle game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So the game itself is pretty decent but dude.\nYou cannot have you idle excel sheet style game be liable to crash every few hours. Like that's a VERY big no no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OK, it's an idle game. I get it. It's not supposed to be all that exciting or challenging. However, this one is just flat out mind numbing. It's very long and drawn out and feels like the mathematical structure is off. Everything takes forever after lvl 50. May as well uninstall at that point.   \r\n\r\nGraphics are non existent (idle game...it's excusable)\r\nAudio is more like ASMR music. (combine that with a boring game and they'll find you passed out on the keyboard)\r\nAs far as replaying it.... HARD NO. \r\n\r\noverall this is lacking even for an idle game 2/10 IMO",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Start is great but the unlocks jump from every 50 to every 1000 and then to 25.000. My only reliable source of charisma would have to run for probably 20hours straight on 4x speed. Not gonna do that.\n\nMagic scaling is insane too. +.25 to magic effect, but manacost basically double every level.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The level of automation is great but the game is bland and grindy, the unlocks are unrewarding, and the story snippets are trash.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}