{
  "positive": [
    {
      "review": "If you've played a [i]Far Cry[/i] game before, you know the drill: vast open world, outposts to capture, and a charismatic villain. [i]Far Cry Primal[/i]  takes that foundation, wipes the slate clean, and proves that the core formula is strong enough to thrive even without modern tech. This isn't just a [i]Far Cry[/i] game; it's a profound survival simulator draped in an action-adventure shell.\n\nThe most immediate thing that grabs you is the atmosphere. The valley of Oros feels truly alive. The developers brilliantly captured the sounds of a time before civilization: the crunch of snow underfoot, the distant, eerie bellow of a mammoth, and the quick rustle in the bushes that signals either prey or your imminent death.\n\nThis sensory detail is critical because it sells the feeling of vulnerability. You are not a super-soldier; you are Takkar, a hunter struggling to keep his tribe, the Wenja, from extinction. Every sunrise is a hard-won victory.\n\nThe shift to primitive weapons is a game-changer. Trading a sniper rifle for a longbow and a fragmentation grenade for a sack of angry bees forces you to be smart, tactical, and resourceful. Every spear you throw feels weighty, every arrow loosed requires commitment. There’s a visceral, hands-on satisfaction to crafting your arsenal from the bones and hides of the animals you hunt.\n\nBut the true star is the Beast Master mechanic. Taming a deadly predator—be it a massive cave bear or a cunning jaguar—and having it fight loyally by your side is immensely gratifying. It transforms Takkar from a simple hunter into a force of nature. Scouting out an enemy camp with your owl companion before sending in your sabretooth cat to cause chaos is peak gaming satisfaction.\n\nUnlike modern [i]Far Cry[/i] games where the world resets after the story, Primal gives you a tangible sense of progression through your home village. As you rescue members of your scattered tribe and recruit specialists (like the shaman or the crafter), you literally see your home grow from a few crude huts to a bustling community.\n\nThis system gives real meaning to your resource gathering. You’re not just collecting skins for a wallet upgrade; you're collecting them to build a stronger shelter for your people. This sense of responsibility and seeing your community flourish adds a layer of depth and emotional investment that many other open-world games miss.\n\n[i]Far Cry Primal[/i] is a unique entry that deserves recognition for its brave concept and flawless execution. It is gorgeous, brutal, deeply immersive, and its core mechanic of taming the wilds is simply fantastic. If you want an open-world experience that makes you feel connected to the land and the struggle for survival, grab your spear—[b]Oros is waiting.[/b]",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "i have played 3 and 4 100% and had a lot of fun. this one is different but ubisoft cooked with this. i liked everything about it especially the story. if you like far cry then i recommend this one as well\r\nhonorable mention : Fu*k Ubisoft",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Boldest and most unconventional Far Cry Experience in the Franchise",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve played about 15 hours, and I’m really enjoying Far Cry Primal. If you liked Assassin’s Creed Valhalla for its atmosphere and world building, this feels very similar, just set in a much older, prehistoric era.\n\nThe game has a strong tribal story line, satisfying melee combat, and a world that feels alive with animals, danger, and exploration.\nTaming beasts is one of the best parts, and the whole environment feels immersive. It’s not a modern-style Far Cry with guns and vehicles, but the old-era theme works really well. The crafting, survival elements, and exploration keep the gameplay fun.\n\nIf you enjoy open-world adventure, primal weapons, and survival with a cinematic vibe, this is a solid game to play.\n\nPros:\nBeautiful prehistoric world\nBeast taming is fun\nGreat atmosphere and sound\nGood exploration\n\nCons:\n\nStory is simple\nCombat can feel repetitive\n\nOverall, a great experience if you love immersive worlds and old-era action.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You'd think a Far Cry game won't work without guns but Primal not only works, it also ends up being better than Far Cry 5 and 6 in several aspects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game with great ideas and a pretty unique setting. Though it was great, it would have been nice with just a bit more content, in general. Since it gets just a bit slow by the end. All in all, great though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "OOGA LIKE ROCK. OOGA LIKE STICK. OOGA MAKE SPEAR! \n\nOOGA MAKE FIRE! OOGA LIGHT SPEAR ON FIRE! \n\nOOGA THROWS INTO NEANDERTHAL. OOGA WINS!!!!!!!!!!!!!!!!!!!!!!!!\n\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ive liked all the FAR CRY games, search an collect, upgrade, thin out the enemy then wipe out the main camp, I bought Primal 8 years ago but the key didnt work. The graphics of hills clifts grass animals all marvellous, ive got stuck in wood heaps but you can CLUB your way out.  but once in rock had to burn myself out. Of all the stats theres never \"how many deaths weve had and with no penalty its a pleasant game with leaping surprise attacks from all directions. Loved the Time zone count back at the start, could have used that more instead of the same chapter opening.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry Primal: Epic Stone Age mayhem! Tame sabretooths & mammoths, craft clubs, conquer Oros!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a semi typical Farcry, running, jumping, using grappling hooks, animal friends, etc, but its set 1Million BC. I really enjoyed it. so much I'm replaying it on PC after completing it on xbox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft connect aside, excellent game that holds up the test of time after almost 10 years. Story is lacking, but, the gameplay of taming animals, exploring is fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite Far Cry games. There is so much to do, good story, good game mechanics, each loot type is spread across the map, you can't find eveyrthing everywhere which is a good way to explore the map. Enemies are fun to play against, sometimes it can get repetitive but there are also a lot of melee weapons and lots of ways to get rid of the enemies. You can go stealthy but you can also go crazy and play however you want. All in all, it's a great game and I think you shouldn't sit this one out, especially when the game goes on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of my favourite games I’ve played since I started pc gaming! The game has aged well. It looks very good considering Its now a 9 year old game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grossly underrated. So much fun this one offers. It carried the expectation from prev far cry games. The story may not be as good as the prev ones but honestly that doesnt matter. If you go with no expectations, you will have lots of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.\nI was playing the permadeath mode and went to hunt a mammoth. Next thing I know, the dead mammoth body flew up in the air and landed on top of me killing me and ending my 80% run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very interesting and novel game approach. The same Farcry 2+ format but in the late stone age.\r\nI enjoyed it, the story is basic but huge... survival of the species.\r\nIt was well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sometimes i play this game butt booty naked to get the caveman experience 5 shotgun shells out of 12 and a half orphaned children",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played Farcry 1 back in 2008, it was my first game. Then Played Farcry 2 and 3 and it hit the popularity it deserved. Since then i have been playing Farcry series (Except Farcry 4, which i could not run back then in my PC, and Farcry New Dawn). I have played all the other games and I can say my ranking :\r\n1. Farcry 3 \r\n2. Farcry Primal\r\n3. Farcry 1 (Nostalgia)\r\n4. Farcry 6 (Graphics and side missions, devs did try a lot to please, kudos)\r\n5. Farcry 2 (Physics and Graphics for that time)\r\n6. Farcry 5 (Campaign was short but ofcrs its a fantastic game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is honestly goated but sometimes it gets mad like why wont the wenji help fight the village people still goated game btw",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though it carries the Far Cry name, Far Cry Primal feels like an entirely new experience—and an astonishingly impressive one at that. It’s crafted with a level of care and creativity that truly sets it apart from the rest of the series.\r\n\r\nThe scenarios are breathtaking, with wild, untamed landscapes that feel alive and dangerous in equal measure. The nature is immersive, full of detail and atmosphere, pulling you into a world that existed long before civilization. The tribes are deeply developed, each with its own culture, personality, and style, making every encounter feel meaningful and grounded.\r\n\r\nEverything—from the environmental storytelling to the sound design—feels thoughtful, deliberate, and remarkably polished. The amount of work poured into this game is obvious, and the result is a unique, memorable adventure that stands proudly on its own within the Far Cry franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the Farcry series and this one really speaks to me. I always love using the bows in the games and having that be your main weapon in this one just hits the spot! I highly recommend this game if you love the stealth and primitive style. I love the other games as well but it's really cool having one specifically designed for that before gun feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is still a great game. Definitely shows it's age but having played this when it was new I still find it so much fun. Good additions to gameplay and solid controls. Probably won't appeal to kids today but I had a great time. Just adding on there was an update in November 2025, 9 and a half years after it came out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]Awesome Game[/h3] I can only recommend this to anyone looking for fun gameplay with a good story. Hopefully, a FarCry Primal II will be released someday.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story:\n\nMe and tha brothaz just be chillin innadi OG neighbahood - then allovasuddn white men (OG form: Ugly Neanderthal brutes) start lynchin n shhiat uknowwhatimsayin; but we're like hell naw f dat we finna fight back. \n\n10/10 - (pre-)historically accurate and eternally topical\n\n\nGameplay:\n\naverage Ubi game fine I guess. 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My third favorite Far Cry! Great game but Ubisoft connect sucks mammoth ass!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game and one of the more Interesting Farcry games ware you have no firearm weapons just primitive weapons since the game takes place in the Neolithic Times. Love going around and bonking enemies on the head with a club, Makes me feel like a real caveman! Lol. Tho I feel its not historically accurate to the real Neolithic Times Which may not be a too big of a deal to most players, All in all a fun game to enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft client and repetitive gameplay sucks as always, but the animal companions are nice and I would recommend it if you get it at 4 bucks like I did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I didn’t expect to enjoy Far Cry Primal as much as I did. At first, I thought the lack of guns and cars would make it feel empty compared to the other Far Cry games, but it’s actually the opposite. Once you get used to the primitive setting, the game pulls you in completely.\n\nThe world feels alive in a different way: you’re not chasing explosions or outposts full of soldiers, but surviving among mammoths, sabertooths, and rival tribes. The atmosphere is incredible. Dense forests, glowing caves, and the constant sound of animals hunting nearby. It’s one of those games where you can get lost just roaming around collecting resources and taming beasts.\n\nSpeaking of taming, controlling wild animals is easily the best part. Sending your sabertooth to maul enemies while you sneak in with a club never gets old. The progression system fits the prehistoric theme nicely, and the lack of modern technology makes every kill and every fire you start feel earned.\n\nIt’s not perfect. the story is simple, and some missions feel repetitive, but the immersion and setting make up for it. It’s more about living in that world than following a plot.\n\nIf you want something different from the usual shooter chaos and you like survival elements mixed with exploration, Far Cry Primal is absolutely worth playing even at its full price; however, it is often at a 90% discount, which is just unbelievably worth it.\n\nNo guns, no problem. Just spears, fire, and pure atmosphere.\n⭐ 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "graphics fucking blew up my last PC, pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Farcry Primal is the best game in it's series to me it does have much of the same gameplay seen in previous games but the setting, beasts and weapons make this such an excitingly creative game to experience (I love my tigre and the bee bomb :). The characters do not disappoint and the story of the Udams Death due to disease and harsh conditions and the Izilas Aztec like brutality are interesting enough to keep you engaged and makeup a great game.\n\n8.8/10 My beasts will tear you apart limb from limb.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy how older Ubisoft games were actually good, engaging and fun, not an open world bloat-fest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good story line, good combat and large area to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't play a Far Cry game I didn't like and this is no exception.  Good story, unique setting, and great exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good Far Cry game, it really is worth a try. The story gets a bit meh in-between but the side activities (taming and hunting) covers up for this. I am really impressed with this and the amount and level of research and effort that Ubisoft put into this and it really fells like a change. Looking forward to playing and finishing Far Cry 6 now.\r\n\r\nRecommended! 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a decent game, not the best, but deffo not the worst, far cry like experience, old school animals are cool, I like that you have to find to tame them and then use them in battle, kill animations are okay, overall its oke 6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a good game for its time, not too hard but can be a challenge if you want it to be, its pretty free world and you can do missions in almost any which way order and i love the caveman kinda version instead of a run and gun farcry its just a nice change up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game feels like a 2 week Minecraft Phase. Amazing and fun to adventure and complete all there is to achieve. But by the 2 week mark it's like...Eh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was fun, I really enjoy this game but after a while it gets repetitive and i got bored and feel burn out but i dont think you will feel the same like i do. it's more of a personal experience. but yeah you still might get a little bored tho cause it's so repetitive. in conclusion, it's a good game: 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unbelievebly, this game is that good, i mean like its really really good. deserve 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, Far Cry Primal is the best Stone Age game ever. The world of Oros feels alive and dangerous, and the graphics still look amazing for a 2016 game. Hunting is SO satisfying — tracking animals, crafting weapons, surviving against wolves… it’s just awesome. \n\nBut the real fun? Taming beasts. It’s basically Pokémon: Caveman Edition. I went around catching every animal . And riding a mammoth or a sabretooth tiger? Absolute peak Stone Age power move 🐘🐅🔥. Once I had them all, I felt like a full-on prehistoric Beast Master.\n\nI finished the game and seriously, I enjoyed every second of it. Hunting, exploring, surviving, taming beasts — it’s pure primal fun. For a 2016 game, it still slaps. Worth every penny. 10/10 would grunt, throw spears, and ride a mammoth again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful lil game! Most definitely my favorite Farcry game, as I find the main series games boring and generic. There really aren't too many games that have this kind of setting and I find it very exciting. I'm also a sucker for camp building, less interesting then the similar system in Tarkov, but still fun! The only thing I dislike about it is the difficulty, as I find it very forgiving, even on the highest difficulty and survival mode. I suppose I just want caveman Tarkov",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is simply the middest far cry game mid id prefer far cry new dawn over it its not bad not good just mid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, the open world is too big and you are walking a lot but the world is beautiful and the core gameplay is fun and challenging. I had fun with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "far cry primal is one of the best in the series !!! it has a great story plus on side note my dad is playing this game on my ps5 pro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fascinating little experiment, held back by the mediocre Ubisoft sandbox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game would highly recommend, I like Far Cry games but with the added Caveman element it works really well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "That's my second favorite Far cry Game, the first one is Far cry 3 but this is top experience too bro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tldr: 6/10, lots of frustrating bugs years after release, got it for $5 in the sale, was worth the 5, probably wait for 90% off. Very ubisoft (IYKYK).\r\n\r\nThere is the skeleton of a potentially great game here dragged down by typical ubisoftisms. Very buggy, almost no attempt to patch any of them. \r\nBugs so far: Clipped into terrain just by sliding down a hill, required a fast travel fix.\r\n- LoS doesnt match the physical terrain polymesh making stealth a dice roll at best....\r\n- And punished at the worst because AI can be forced to see you from anywhere regardless of wherre you are. (Bushes, caves, mountains, 2km away...)\r\n- Friendly AI is so stupid it is suicidal, very helpful.\r\n-Enemy AI is so smart it has satellite gps uplink.\r\nGraphically its pretty, love the terrain (most of the time), but the UI is clunky and poorly optimised.\r\nUpgrade balance seems pretty well spread and gated requiring risk reward from the player to earn upgrades.\r\nStealth is very poorly implemented and could learn a few things from... you know, ubisofts actually stealth based franchise....\r\nCombat is very iffy sometimes with connecting shots and melee both on the player side and on the AI's.\r\nThis game feels better on expert difficulty but also feels worse. (Stealth is worse but the thrill is better).\r\nThe world feels alive with all the beasts and human factions interacting in different ways, great job. I love the fear that while you are hunting that you also can be hunted and never know.\r\nWith a few more tweaks, additions, balances and bug fixes Farcry Primal could be a great game, but for me theres a lot of negative here that dragged it down for me, still more positive than negative.\r\nOh and i love that they added the fire spread mechanic from farcry 2 and took lessons learnt with farcry 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very long game. Outdated for 2025 but still very good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing Far Cry Primal gives me the experience living in a society in which people live in a very simple way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Made me feel what it feels like to be a hunter and to be hunted. A true gem, loved every minute of this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is what comunnism looks like, or at least primitive comunnism",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Snarkus burg foopie greratest farcry games arggle bork brigagla bugga bugl digrab! bulga bork beaten digrab arggle bissglagGunga grug arggle 3, bissglagGunga grug arggle 4, snackleg bluggle arggle bork borgle! 卌/卌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "piss man watching dumb cavemen commit suicide in comical ways and beating up women",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "terbaik, permainan zaman batu yang sangat bagus dari grafik hingga jalan ceritanya. sangat-sangat memuaskan dan tidak merasa bosan lansung.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We live in a time of revolution, a technological one. First came the Neolithic Revolution, then the Agrycultural Revolution, then urban planning, the Bronze Age, and peace to this day. The itch before World War I and the 19th century now exists only in the imagination.\n\nIt is up to us to choose, what way present tense will grave in permanent pattern like a road in a snow, how future will look like, the one tomorrow.\n\nIf we chose to abandon tradition there will be no way to experience any form of well resived contiuation, all roots well be abandond, like for these who chose to take drags and grow in spirit but loose pattern of thinking, I read somwere, that taking drags is like snow on that path, that covers all the patterns. For me, more impotrant is to know it all then to forget it all for piece of mind. Piece.\n\n\"Generation of digital natives\" is a term describing people born in the digital age, who have been immersed in the world of the internet, smartphones, and social media from a young age. Unlike older generations, who had to adapt to technology, digital natives treat it as their natural habitat, and access to information and online communication are their primary forms of contact with reality.\n\nthe technological revolution has actually been happening since Antiquity or the Middle Ages, after all, a Trebuchet is also a machine.\n\n If we chose to rebel against rebellion, we perhaps only start by choosing kontrevoluton, meaning, if our goal is same, we chose not the revolution, nor the kontr one, but Scholastics, christian humanism, Renesans and classic encyklopedism. Only then we have good in nature, good couse and menaing for life, To go to liblary to discust knowlege, and play good, valuble games with frends and family,and sports, how exiting it would be to play games on steam with my own son. heh.\n---\nThis game is lovely, Like Dawn of Man, why? Becouse we get to play preghistoric man, the best far cry ever to me, besides I always looked a bit like pale aristocrat, and afther harsh life and sunburning on holidays Im now more of a cave man. Like the nature took me and Im one with the wild.\n\nEmmanuel Moire - Et si on parlait d’amour \nhttps://www.youtube.com/watch?v=2Qnij1J1RJY&list=PLkezPydZpc2tH2GAMypCFnFRchO-iJaUk\n\nIt is this times to, the times of first pagan kingdoms and the time of prehistoric worshiping all known mother of all. \n\n The 13th Warrior \nhttps://www.youtube.com/watch?v=eRmlTRT3xtI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak survival game without being too grueling on difficulty, give it a go",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Of course this a really good game. Everyone should play this game. ngl",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is good game for a medium spec lap also It is a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so cool! it's like you're in the real caveman age hahaha!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no one knows what they mean when they say words... that is why it is so cool! outta my swamp!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great side quests. Recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprisingly, one of my favorites in the series. If you like the Far Cry games in general, then you'll probably like this one too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun, old school far cry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im replaying this game and even thought it doesn't have a major story line I am througly enjoying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game, not sure why it was under hyped.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good would like more far cry games like this one to be fair i like the pets aspect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ловити мамонт. Удам нападати. Бити Удам. Тікати від саблезуб. Ловити саблезуб. Їхати на саблезуб. Ловити борсук. Борсук давати пизди. Їсти мамонт. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love it its a great pause the same old game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like farcrys it is a farcry :)\r\nI played 3 and 4 before and I like them the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can pet the dogs and cats, they don't permanently die <333",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Far Cry Primal Review[/h1]\n\n[hr]\n[h1]Overview[/h1]\nI expected a reskinned Far Cry checklist. I got the most unique entry in the series. Primal keeps the open world DNA but swaps guns for spears, adds survival vibes, and feels made with real care. It surprised me in the best way.\n\n[hr]\n[h1]What It Is[/h1]\nA prehistoric Far Cry where you scavenge, hunt, and build up a tribe. No firearms, no modern gadgets. Movement is mostly on foot early, later you tame and ride beasts to cross the map faster. The change in tools and threats makes familiar Far Cry loops feel fresh.\n\n[hr]\n[h1]World and Atmosphere[/h1]\nOros is gorgeous and dangerous. Forests, caves, and a snowy region with temperature management keep you thinking about survival. Wildlife is not window dressing. Wolves, big cats, and roaming herds create moments that feel organic. Running everywhere somehow never got old.\n\n[hr]\n[h1]Traversal and Beasts[/h1]\nYou start on foot, then unlock taming and mounts. Having a sabretooth or bear at your side changes how you approach camps and travel. The world size feels right, with enough risk on the roads to keep you alert between objectives.\n\n[hr]\n[h1]Combat and Stealth[/h1]\nNo guns, just bows, spears, clubs, and fire. I thought it would feel thin. It clicked. Stealth is satisfying, headshots with the bow feel great, and spears have weight. Some achievements pushed me to use different tools, which helped the combat shine instead of feeling limited.\n\n[hr]\n[h1]Quick Story Primer[/h1]\nYou play Takkar, a hunter who helps the Wenja tribe survive and grow while clashing with rival tribes across Oros. It is a straightforward rise from lone survivor to leader, focused on territory, tribe building, and the harshness of the land.\n\n[hr]\n[h1]Progression and Systems[/h1]\nGathering, crafting, village upgrades, and skill unlocks drive your growth. The village hub gives a clear sense of progress. Resource routes and hunting loops are engaging without turning into busywork.\n\n[hr]\n[h1]Achievements and Tips[/h1]\nA fun list with some spicy asks. Permadeath mode exists. If you want to be safe, quitting to the menu before a fatal hit can save a run. Taming a fast mount early and investing in bow skills makes cleanup smoother.\n\n[hr]\n[h1]What Works[/h1]\n[list]\n[*] World feels handcrafted and alive\n[*] Survival layer fits Far Cry better than expected\n[*] Beast taming changes combat and travel\n[*] Melee and bow play are simple but satisfying\n[/list]\n\n[hr]\n[h1]What Falls Short[/h1]\n[list]\n[*] Story is serviceable rather than gripping\n[*] Early game travel is slow until mounts unlock\n[*] If you hate Ubisoft open worlds on principle, this will not convert you\n[/list]\n\n[hr]\n[h1]Verdict[/h1]\nRecommended. Primal brings a real twist to the series without losing the fun. If you like Far Cry but want something that actually feels different, this is the one to try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Bueno, de momento no mejor que el 3 pero bueno igual (ahhh me vengo)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ooga booga (the game is really fun)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best far cry game in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my second favourite Far Cry after Far Cry 3 of course.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Вообзе каф только я ебал выполнять достижение на макс сложность",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i couldnt stop primal'ing the whole time playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this shity game is crazy good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, love the animals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts so good it brings teardrops",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still a great game, let alone a great Far Cry game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Did not disappoint",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is full of cute cats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i was too early i didnt get any achievements :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Unga Bunga simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dont get the hate for this game its fun as hell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most unique farcry out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe best of the series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of legendary game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who let you cook bro ? Always my fav.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Is good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great Far Cry game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's Ubisoft, so idk what I was expecting.... Fun game when you can play it. Don't tab out or your OS will freeze and you have to reset your computer",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "For 2.99 it's a good reskin of the Far Cry formula in a unique setting, though only for a few of hours before things get repetitive. The melee combat is REALLY basic, with no blocking or dodging mechanics. Kind of annoying when things charge you. Makes combat with the human 'heavies' frustrating too. Main missions don't deveuate gameplay-wise much from clearing out camps in the open world; a limitation of the setting.\n\nThe environments are pretty with convincing roaming wildlife, and it's fun hunting, taming and riding some of them like the mammoths. Resource gathering and crafting/upgrading your base is engaging for a little while. After 10 hours you've seen everything the game has to offer, and there's no plot to drive you on in my opinion. When I got to a rival clan's human boss who tanks arrow shots, yet takes 90% health off you with a hit, sends 4 waves of fodder enemies at you between engagements it dawned on me how boring the combat, and clearly the 'boss' battles are and wasn't worth any more of my time unfortunately.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Ull fight killed  the game for me.\r\nUbisoft, I kind of liked the game but you really tried and made it suck eventually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love far cry, and this game is fun. However the fact it WILL NOT LAUNCH if you're not online and have a ubisoft account, is the absolute killer of any reason to buy this game or any Ubisoft game in the future. I bought this to use on om steam deck while i travel. Didnt know about the mandatory account at the time. Tried to refund when i had less than two hours of play and was denied because i have and the game more than 2 weeks. I recommend never buying another ubisoft on pc while this is required.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ubisoft Connect makes this game a huge waste, tried going through support today as I hadnt launched the game since 2018 only to be met with \"I'd also like to inform you that your Steam account is separate from your game license as your license is tied to your Ubisoft account, so you may use the same Steam account but cannot use your license in multiple Ubisoft accounts.\" effectively soft-locking me from content I bought and decided to return too, never again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game literally wont launch anymore, thanks Ubisoft Connect!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stupid Ubisucks client, it didn't auto create required files in `/Documents/My Games/Far Cry Primal` which cause crashes. I have to create it MANUALLY by making empty text file with exact name so the game can writes into it. \n\nReally love the game but Ubisucks made it worse. No wonder there are only about 20% players got through the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A total piece of crap, Game freezes every minute for over 10 sec. So it's unplayable. Tried diffrent \"solutions\" on diffrent support pages.none of them helped. And because I installed it a few weeks later then when i bought it, I couldn't get a refund. So if u buy, then install right away and try if it works on your pc. \n\nLast Far Cry i bought.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A lot of not enjoyable stuff in here. The mammoth riding missions are excruciating. And there are a lot of missions that make you slowly follow an owl or other stuff to make the game take longer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is great, I've had more fun with it than anything else that I've played in the last few months. My first session had 0 performance issues besides one crash during a mission that resolved itself after a quick restart. The problem I face now is that the game is literally unplayable, and after much research there seems to be no fix. Since starting up the game for the second time, I've had constant stuttering and freezing in cutscenes, opening menus, options, the map, and even just walking around. I've done everything from uninstall the game, update drivers, validate files and nothing seems to be working. Really disappointed because the game has been a wonderful experience, and now I am unable to finish it. From what I can tell, this issue seems to be a common occurrence among the player base and not solely a me problem. I got the game on sale for relatively cheap, so I haven't lost big money or anything but save yourself the time and the money and don't buy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "u have to make a ubisoft account. ok no big deal i guess. but then u cant make an account.. enter a DOB and it says invalid.  google says i have to contact support. trying to play a game here.. what the actual fu??",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has not aged very well, play Horizon Zero Dawn or another Far Cry game instead in my opinion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a disgrace to its ancestors. The core gameplay loop basically consists of running around collecting leather, rocks, and leaves. If you’re not bored yet, great news — there’s even more walking for you! The only difference is that now you’re an animal, and all you can do is fly or run. Still not bored enough? Don’t worry, you can keep gathering even more sticks and rocks to upgrade your village and weapons. The most boring game in the entire franchise. 2/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAI PULICI. SE ZAPUSTESTE GREU. SA MA FUT IN FAMILIA VOASTRA DE MODETARORI IBANAIE DE LA MOLDCELL VAFLE ABOSSANAIE/ NAHUI VOI FACETI ASA JOCURI EBUCIE DACA PULA SI EU LE ZAPUSTESC PEN COMPUL MEU AHUIENAI/ BY THE WAY I AM ON LYNUX",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has so much going on ALL THE TIME! I want a peaceful stroll through Europe, and NOT to be mauled by 10 bears, 10 lions, enemy tribes and goats every 5 seconds! \n\nI will try to finish the story, but this game feels like Fallout New Vegas heavily modded right now...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so boring. so drab. just nothing original or engaging. the 20 mins rhino fight sums this game up. same shit over and over. super boring. not sure why i bothered, has there EVER been a good farcry game? no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ILL NEVER UNDERSTAND BEING ABLE TO DOWNLOAD ON STEAM AND THEN NEEDING THE \"EA\" PROGRAM TO RUN THE GAME. I DO NOT WANT THAT BLOATWARE/SPYWARE ON MY SYSTEM. STOPPPPPPPP",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost 30 minutes of my life trying to create an ubisoft account without any succes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paid less than $3 and still feel ripped off. \r\n\r\nIt's just the same old gather and grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "File system failure: Aborting execution.\n\n\"C:\\Users\\...\\Documents\\My Games\\Far Cry Primal GamerProfile.xml\"\n just dont work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Şu Ubisoft Connect denen aptal şey olmasa keşke.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ubisoft is buns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You have no defensive options like block, dodge, or parry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oooggaa boooga digga dug  dug >:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game back in 2016. \n\nNow upset that to play on PC I have to register for an ubisoft account, and also be online, and also not be connected to a VPN. \n\nHard pass Ubisoft. I'll play on my PS4.",
      "voted_up": false,
      "votes_helpful": 275
    },
    {
      "review": "Ubisoft doesn't want you to play this game. they want to farm your identity by requiring you to give them your info to even ACCESS THE GAME!!! You don't need my gender, my phone number, my email, or my ability to spot stop signs. I GIVE YOU MONEY, YOU GIVE ME GAME!!!!! END OF TRANSACTION!!!!!!",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Start the game → Ubisoft Connect loads for a while → \"Connection lost; we are currently unable to connect, but you can cotinue playing offline or try again\" → click 'Try again' → Same thing → click 'Play offline' → Immediate login screen asking you enter email and password → enter account details → does not log in. \r\nPeak Farcry experience guys. I cannot even play the game I paid for.\r\n\r\nWhy does this exist in a single player game?\r\n\r\nWhy do I need to log into your disfunctional third party launcher when I have this game on steam?\r\n\r\nWhy is this happening multiple days in a row?",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Not even played the game yet but there is already an extra launcher, a required ubisoft account, and DRM.\n\nNext time im just gonna sail the high seas, easier and saves the headache. ubisoft does not deserve money.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "nothing like rocking up to the caveman crafting spot to get more Special Ubisoft® Club™ Bone Throwing Knives© (brought to you by Ubisoft®, all rights reserved) to make you feel like a real neolithic hunter\n\ngame is dripping with immersion-tanking corpo trash. why even bother with the caveman language if you're just gonna throw brand logos at me in the middle of the game?\n\nso at about 108 minutes in, when the menus started displaying at 5fps and restarting the game caused it to hang at the epilepsy warning without ever loading to the main menu, i decided this experience was not worth $2.99 and put in the refund request\n\nfuck ubisoft man",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Some reviewers say, it´s unlike any other Far Cry game. But it is. Far Cry without guns but with the usual Ubisoft slop. \n\nThe gameplay is like it´s setting. Stuck in 10.000 BC.The setting suggests innovation but hides the fact, that its a shallow hunting-and-gathering-amidths-tribal-wars timewaster. It speaks to the tribalistic instincts of us humans. Looting, gathering, survival, blood and guts.The tribals speak their own fictional language with bad grammar. Yes it´s new, until you realise, it fails to convey any good story or lore. This is it´s first sin. It is just spoken cliché after cliché, with some prehistoric mysticism. \"You warrior, you kill many udam. You strong. Now drink soup of pee blud and dung. Go kill more udam for me. Become great warrior.\" \n\nWhich brings me to questing: Sidequest seem varied enough to avoid getting bored quickly. But its just, gather this and that, protect or save villagers, kill enemies, destroy enemy villages, conquer enemy base for fast travel. Saved villagers are added to your village for miniscule rewards. Its really mostly a big numbersgame. Some quests just are awful. Without the side content the main story takes maybe 5 hrs. And it is also a prehistoric cliché, where you take revange on the lesser human tribes. \n (Sidenote: In FarCry 5, which I didn´t recommend, there was a sidequest, where you have to gather dog poo. Guess what, here you have at one point gather... rhino shit. Or you play in dreams as the animals you hunt and its so.... without any meaning or sense. And the Urki questline tries to be funny, because Urki is a ancestor (?) of Hurk from the other games... but it borders on insult you as a gamer.)\n\nThe map is big and riddled with the usual questionmarks to unveil and nothing behind it. Random events provide sidequests, yes. But new locations are forgetable and only provide resources until you have no room in your backpack which is 90% of the time.. Quickly you forget the names of these locations and never visit them again. There are collectables but..they are another timewaster, with little to no reward. Besides the burden to collect em all.  47/100 Dashya hands gatherd. 3 until a reward. I still don´t know what kind of the reward it was.\n\nThe world is pretty, but nothing special, At an early point you just don´t see it anymore....its just there...you traverse it on your sabertoothed tiger and...welll, yeah...nothing more to it.\n\nCombat is unsuprisingly fun. You exchange the handgun for a club, the rifle for a bow. End of story.\n\nI struggle to recommend it. Another case for a neutral review option. Because in the sum it seems better than all its parts. I played through it, although I rushed at the last quests just to 100%.  That it because my Limbic System commanded me to kill and loot and fullfil my quest to eradicate the inferior tribes...  And i think the one occational female naked boob kept me playing. But I am not tribalistic enough to struggle through another playthrough on permadeath or something. At the end, I feel dissatisfied.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is not bad, but its requires FUCKING ubisoft connect launcher, which half of the times won't turn on. And the fix is to get a vpn.....\r\nI will not fucking get vpn to log into this stupid app.\r\nEverything ubisoft made should be avoided until they remove this shitty launcher",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ubisoft connect stays running in the background after you have closed the game.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "It's Ubisoft, so idk what I was expecting.... Fun game when you can play it. Don't tab out or your OS will freeze and you have to reset your computer",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game wont run at all says fetal error, something about gamer profile and i cant be bothered to fix this",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "For 2.99 it's a good reskin of the Far Cry formula in a unique setting, though only for a few of hours before things get repetitive. The melee combat is REALLY basic, with no blocking or dodging mechanics. Kind of annoying when things charge you. Makes combat with the human 'heavies' frustrating too. Main missions don't deveuate gameplay-wise much from clearing out camps in the open world; a limitation of the setting.\n\nThe environments are pretty with convincing roaming wildlife, and it's fun hunting, taming and riding some of them like the mammoths. Resource gathering and crafting/upgrading your base is engaging for a little while. After 10 hours you've seen everything the game has to offer, and there's no plot to drive you on in my opinion. When I got to a rival clan's human boss who tanks arrow shots, yet takes 90% health off you with a hit, sends 4 waves of fodder enemies at you between engagements it dawned on me how boring the combat, and clearly the 'boss' battles are and wasn't worth any more of my time unfortunately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is great loving it but\nUbisoft launcher is flawed thing that make sure  you wont even own your game even when u owned it on steam\nIt connected to the ubisoft connect account \nSo if u ever forget your ubisoft account or the launcher start with another account its fked u cant play\nI bought it and refunded it cus for whatever reason the launcher decided to make new account and use lock in the game there\nNow i need to painstakingly manuver the bad launcher just to play thx ubisoft never buying your games again",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Games just refuses to launch. Cant be bothered to troubleshoot this much for a ubi game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do you play just to play? Then this game is fine, another grinding simulator with 90% of stuff that you get useless. Apart from that, Extreme difficulty, survival and permadeath(and especially all combined) is one of the worst representation for permadeath, and in general, as a challenge total bullshit that is not hard, but rather grindy, and unfair\r\nYou can have maximum 4 health bars instead of 6 in original, enemies deal so much more damage, some hobo by throwing his small rock at you will deal HALF of your damage, and if theres more than 1 enemy, chances are you will be killed within 5 seconds. SO not only ur hp is limited, which could be fine, BUT DAMAGE INCREASED TOO? Im not sure about enemies HP, but it felt like theyre tanks as well. Also this challenge cuts 80% of your gameplay by not allowing you to use melee combat, because if you will try, well, you will die, you of course can try to kill 2-3 enemies, but thats your limit, killing tanks for some reason unbearrably hard, but knifes killing them fast for some reason???\r\nStun and lack of cooldown of attacks from enemies WITH THIS CHALLENGE, is the insanest bullshit ever possible\r\nSo not only animals can kill you relatively quick, but they can do so without any cooldowns and also knocking you down. So you just have no chance to escape.\r\nAlso i had to play with Survivor vision whole game otherwise i wouldnt be able to collect anything, and the color game have is just killing my eyes.\r\nIf you want to play just once, good choice, if you want to 100% it, dont even try. Not only you would have to 100% original game, but then also complete the game on expert survival permadeath(which devs are mocking us by saying no one will do it, but with enough patience its easy). Advise, find save files, and do backup every.single.time. you complete a mission, activity ANYTHING, trust me, you will thank me for this.\r\n2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "like many steam games, this one also doesnt want to start a game and closes itself down before the game begins, what a joke",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love far cry, and this game is fun. However the fact it WILL NOT LAUNCH if you're not online and have a ubisoft account, is the absolute killer of any reason to buy this game or any Ubisoft game in the future. I bought this to use on om steam deck while i travel. Didnt know about the mandatory account at the time. Tried to refund when i had less than two hours of play and was denied because i have and the game more than 2 weeks. I recommend never buying another ubisoft on pc while this is required.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ubisoft Connect makes this game a huge waste, tried going through support today as I hadnt launched the game since 2018 only to be met with \"I'd also like to inform you that your Steam account is separate from your game license as your license is tied to your Ubisoft account, so you may use the same Steam account but cannot use your license in multiple Ubisoft accounts.\" effectively soft-locking me from content I bought and decided to return too, never again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Ull fight killed  the game for me.\r\nUbisoft, I kind of liked the game but you really tried and made it suck eventually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It plays like every other open world crafting game from the past decade where you play as a primitive hunter and gatherer and must kill large herbivores with well-placed arrows or by sticking a spear. I still liked the setting, but Avatar: Frontiers of Pandora is basically the same thing except improved with red vegetation and glowing plants, and more creative freedom because of the sci-fi fantasy setting. Overall, this one is pretty lackluster in the current year, and the story is quite simply \"primitive and barebones.\"\n\nWhen I played it I liked waving the spear and hunting with a spear, but I couldn't even find anything to do with all the things I hunted and quickly filled up my inventory in normal difficulty, and I didn't look forward to the other grindy elements either. The need to tame beasts to progress the plot looks equally silly and tedious, even if it expands how you hunt, I think they could have just polished the combat so it'd be more fun. The stealth was very rudimentary, and I wasn't a fan of how easy it was to simply crouch walk behind an enemy patrol for 30 seconds and then perform an extremely easy one-button kill from the Assasin's Creed games, and how easy it was to quickly ambush 3 men. Your melee options are very limited and you cannot block, parry, dodge or roll (unlike in nearly any recent Souls-game or 3D action game.) Wolves and other animals move in simple patterns that make it easy to line up headshots, and if you do miss a shot they don't run as far away as in Avatar or provide enough of a challenge. This limitation was partly because this game has a much shorter cull distance, and animals could also very noticeably pop in as you walked a short distance.\n\nBecause it's Ubisoft it's also not consumer friendly and despite being 9 years old it still contains Denuvo and needs you to install their 3rd party launcher just to play it in a feeble attempt to steer you toward their own storefront.\n\nHowever, if you enjoy this then maybe you should play Ubisoft's Avatar game, or better yet \"Horizon Zero Dawn\" which has nearly everything this game has but is much better executed.  That game has better stealth, visuals, more engaging combat, a bigger sense of mystery and discovery, and a more coherent story. I think for $3 FCP is now a mid-tier budget game and I've enjoyed trying it, but your time is more valuable and I'd recommend instead playing something that takes the concept further.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cool concept game.\n\nWish it was maintained and polished bug-wise.\n\nYou can't throw a rock to distract enemies, and you need to restart the game for it to work again.\n\nYou can't throw the bait to tame an animal, and you need to restart the game for it to work again.\n\nReleased 2016\n\nI love this game but the bugs are making me uninstall.\n\nPerfect price  of 3$ in this state it is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its all fun in the beggining but after u played a little it just gets boring, it's a no for me",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Forcing online verification everytime i launch the game, why? i already paid for it and you verified it once.\n\nThat should be enough, why check eveytime.\n\nThis is probable a precursor to UBISOFT having access to not let you play your 'Single Player' game when they decide its end of lifetime. A SINGLE PLAYER GAME WHICH I PAYED FOR!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Runs like dogwater on PC. Constant freezing during gameplay and cutscenes. \nAlso uses parasitic Ubisoft Connect app.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game literally wont launch anymore, thanks Ubisoft Connect!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stupid Ubisucks client, it didn't auto create required files in `/Documents/My Games/Far Cry Primal` which cause crashes. I have to create it MANUALLY by making empty text file with exact name so the game can writes into it. \n\nReally love the game but Ubisucks made it worse. No wonder there are only about 20% players got through the tutorial.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A total piece of crap, Game freezes every minute for over 10 sec. So it's unplayable. Tried diffrent \"solutions\" on diffrent support pages.none of them helped. And because I installed it a few weeks later then when i bought it, I couldn't get a refund. So if u buy, then install right away and try if it works on your pc. \n\nLast Far Cry i bought.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot of not enjoyable stuff in here. The mammoth riding missions are excruciating. And there are a lot of missions that make you slowly follow an owl or other stuff to make the game take longer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you think you can Buy, download then play this game your wrong. You need to download a 3rd party launcher independently from steam and sign up fun right? Also be prepared to deal with \"FATAL ERRORS\" in files.  I tried looking for answers still have not found a fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game looks pretty, but I just may be an old gamer. When everything is marked on a mini map for you and you hit \"V\" to see everything, the game is too easy. Why does Ubisoft make all their games for the lazy gamers? I would dismiss as a console game as I expect PC games to be more difficult and less hand holding. I'm sure compared to the other lazy console games this one may be fun, but where is the challenge? The first Far Cry game was awesome. Since then they just seem to dumb everything down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a disgrace to its ancestors. The core gameplay loop basically consists of running around collecting leather, rocks, and leaves. If you’re not bored yet, great news — there’s even more walking for you! The only difference is that now you’re an animal, and all you can do is fly or run. Still not bored enough? Don’t worry, you can keep gathering even more sticks and rocks to upgrade your village and weapons. The most boring game in the entire franchise. 2/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BAI PULICI. SE ZAPUSTESTE GREU. SA MA FUT IN FAMILIA VOASTRA DE MODETARORI IBANAIE DE LA MOLDCELL VAFLE ABOSSANAIE/ NAHUI VOI FACETI ASA JOCURI EBUCIE DACA PULA SI EU LE ZAPUSTESC PEN COMPUL MEU AHUIENAI/ BY THE WAY I AM ON LYNUX",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has so much going on ALL THE TIME! I want a peaceful stroll through Europe, and NOT to be mauled by 10 bears, 10 lions, enemy tribes and goats every 5 seconds! \n\nI will try to finish the story, but this game feels like Fallout New Vegas heavily modded right now...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so boring. so drab. just nothing original or engaging. the 20 mins rhino fight sums this game up. same shit over and over. super boring. not sure why i bothered, has there EVER been a good farcry game? no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A fun game but I cannot recommend it for various reasons, mainly having to do with the fact that for some reason the devs really really love unskippable animations:  1) Want to heal your pet while getting mauled by a cave bear? Guess what? When you feed your pet to heal it, there is an unskippable feeding animation. So while you're being chewed on by enemies, you have to sit there and watch your frozen character throw meat up in the air for your pet to playfully catch. How fun! Think the option to disable skinning and scavenging animations disables pet healing animations? Think again! 2) If you accidentally click on a quest icon instead of, say, the icon to upgrade a hut, you have to wait for the quest intro cutscene to finish, which goes on forever, before you get the option to abandon the quest you didn't want to start in the first place. More fun! Attention FarCry developers: the escape key should override whatever is going on, at all times! Oh, and you have the added fun of having only one 'character' save file. So if you want to start fresh, say after coming back to the game after several months, well, you have to overwrite your previous save. Extra fun! (I know on PC you can backup your save file, but you shouldn't have to do that in any game made after the 90s. Multiple saves have been around for decades, but the FarCry developers can't figure out how to implement such a basic feature.) It's a shame, because the game is fun, except for these annoyances that completely ruin the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ILL NEVER UNDERSTAND BEING ABLE TO DOWNLOAD ON STEAM AND THEN NEEDING THE \"EA\" PROGRAM TO RUN THE GAME. I DO NOT WANT THAT BLOATWARE/SPYWARE ON MY SYSTEM. STOPPPPPPPP",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost 30 minutes of my life trying to create an ubisoft account without any succes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was having fun with this game, then uplay decided to delete my saves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paid less than $3 and still feel ripped off. \r\n\r\nIt's just the same old gather and grind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "File system failure: Aborting execution.\n\n\"C:\\Users\\...\\Documents\\My Games\\Far Cry Primal GamerProfile.xml\"\n just dont work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Şu Ubisoft Connect denen aptal şey olmasa keşke.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A 45 - 50 hour game with 5 hours of fun content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ubisoft is buns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You have no defensive options like block, dodge, or parry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oooggaa boooga digga dug  dug >:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game back in 2016. \n\nNow upset that to play on PC I have to register for an ubisoft account, and also be online, and also not be connected to a VPN. \n\nHard pass Ubisoft. I'll play on my PS4.",
      "voted_up": false,
      "votes_helpful": 275
    },
    {
      "review": "Ubisoft doesn't want you to play this game. they want to farm your identity by requiring you to give them your info to even ACCESS THE GAME!!! You don't need my gender, my phone number, my email, or my ability to spot stop signs. I GIVE YOU MONEY, YOU GIVE ME GAME!!!!! END OF TRANSACTION!!!!!!",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "Start the game → Ubisoft Connect loads for a while → \"Connection lost; we are currently unable to connect, but you can cotinue playing offline or try again\" → click 'Try again' → Same thing → click 'Play offline' → Immediate login screen asking you enter email and password → enter account details → does not log in. \r\nPeak Farcry experience guys. I cannot even play the game I paid for.\r\n\r\nWhy does this exist in a single player game?\r\n\r\nWhy do I need to log into your disfunctional third party launcher when I have this game on steam?\r\n\r\nWhy is this happening multiple days in a row?",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Not even played the game yet but there is already an extra launcher, a required ubisoft account, and DRM.\n\nNext time im just gonna sail the high seas, easier and saves the headache. ubisoft does not deserve money.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "nothing like rocking up to the caveman crafting spot to get more Special Ubisoft® Club™ Bone Throwing Knives© (brought to you by Ubisoft®, all rights reserved) to make you feel like a real neolithic hunter\n\ngame is dripping with immersion-tanking corpo trash. why even bother with the caveman language if you're just gonna throw brand logos at me in the middle of the game?\n\nso at about 108 minutes in, when the menus started displaying at 5fps and restarting the game caused it to hang at the epilepsy warning without ever loading to the main menu, i decided this experience was not worth $2.99 and put in the refund request\n\nfuck ubisoft man",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Some reviewers say, it´s unlike any other Far Cry game. But it is. Far Cry without guns but with the usual Ubisoft slop. \n\nThe gameplay is like it´s setting. Stuck in 10.000 BC.The setting suggests innovation but hides the fact, that its a shallow hunting-and-gathering-amidths-tribal-wars timewaster. It speaks to the tribalistic instincts of us humans. Looting, gathering, survival, blood and guts.The tribals speak their own fictional language with bad grammar. Yes it´s new, until you realise, it fails to convey any good story or lore. This is it´s first sin. It is just spoken cliché after cliché, with some prehistoric mysticism. \"You warrior, you kill many udam. You strong. Now drink soup of pee blud and dung. Go kill more udam for me. Become great warrior.\" \n\nWhich brings me to questing: Sidequest seem varied enough to avoid getting bored quickly. But its just, gather this and that, protect or save villagers, kill enemies, destroy enemy villages, conquer enemy base for fast travel. Saved villagers are added to your village for miniscule rewards. Its really mostly a big numbersgame. Some quests just are awful. Without the side content the main story takes maybe 5 hrs. And it is also a prehistoric cliché, where you take revange on the lesser human tribes. \n (Sidenote: In FarCry 5, which I didn´t recommend, there was a sidequest, where you have to gather dog poo. Guess what, here you have at one point gather... rhino shit. Or you play in dreams as the animals you hunt and its so.... without any meaning or sense. And the Urki questline tries to be funny, because Urki is a ancestor (?) of Hurk from the other games... but it borders on insult you as a gamer.)\n\nThe map is big and riddled with the usual questionmarks to unveil and nothing behind it. Random events provide sidequests, yes. But new locations are forgetable and only provide resources until you have no room in your backpack which is 90% of the time.. Quickly you forget the names of these locations and never visit them again. There are collectables but..they are another timewaster, with little to no reward. Besides the burden to collect em all.  47/100 Dashya hands gatherd. 3 until a reward. I still don´t know what kind of the reward it was.\n\nThe world is pretty, but nothing special, At an early point you just don´t see it anymore....its just there...you traverse it on your sabertoothed tiger and...welll, yeah...nothing more to it.\n\nCombat is unsuprisingly fun. You exchange the handgun for a club, the rifle for a bow. End of story.\n\nI struggle to recommend it. Another case for a neutral review option. Because in the sum it seems better than all its parts. I played through it, although I rushed at the last quests just to 100%.  That it because my Limbic System commanded me to kill and loot and fullfil my quest to eradicate the inferior tribes...  And i think the one occational female naked boob kept me playing. But I am not tribalistic enough to struggle through another playthrough on permadeath or something. At the end, I feel dissatisfied.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is not bad, but its requires FUCKING ubisoft connect launcher, which half of the times won't turn on. And the fix is to get a vpn.....\r\nI will not fucking get vpn to log into this stupid app.\r\nEverything ubisoft made should be avoided until they remove this shitty launcher",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ubisoft connect stays running in the background after you have closed the game.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "It's Ubisoft, so idk what I was expecting.... Fun game when you can play it. Don't tab out or your OS will freeze and you have to reset your computer",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game wont run at all says fetal error, something about gamer profile and i cant be bothered to fix this",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "For 2.99 it's a good reskin of the Far Cry formula in a unique setting, though only for a few of hours before things get repetitive. The melee combat is REALLY basic, with no blocking or dodging mechanics. Kind of annoying when things charge you. Makes combat with the human 'heavies' frustrating too. Main missions don't deveuate gameplay-wise much from clearing out camps in the open world; a limitation of the setting.\n\nThe environments are pretty with convincing roaming wildlife, and it's fun hunting, taming and riding some of them like the mammoths. Resource gathering and crafting/upgrading your base is engaging for a little while. After 10 hours you've seen everything the game has to offer, and there's no plot to drive you on in my opinion. When I got to a rival clan's human boss who tanks arrow shots, yet takes 90% health off you with a hit, sends 4 waves of fodder enemies at you between engagements it dawned on me how boring the combat, and clearly the 'boss' battles are and wasn't worth any more of my time unfortunately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is great loving it but\nUbisoft launcher is flawed thing that make sure  you wont even own your game even when u owned it on steam\nIt connected to the ubisoft connect account \nSo if u ever forget your ubisoft account or the launcher start with another account its fked u cant play\nI bought it and refunded it cus for whatever reason the launcher decided to make new account and use lock in the game there\nNow i need to painstakingly manuver the bad launcher just to play thx ubisoft never buying your games again",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Games just refuses to launch. Cant be bothered to troubleshoot this much for a ubi game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do you play just to play? Then this game is fine, another grinding simulator with 90% of stuff that you get useless. Apart from that, Extreme difficulty, survival and permadeath(and especially all combined) is one of the worst representation for permadeath, and in general, as a challenge total bullshit that is not hard, but rather grindy, and unfair\r\nYou can have maximum 4 health bars instead of 6 in original, enemies deal so much more damage, some hobo by throwing his small rock at you will deal HALF of your damage, and if theres more than 1 enemy, chances are you will be killed within 5 seconds. SO not only ur hp is limited, which could be fine, BUT DAMAGE INCREASED TOO? Im not sure about enemies HP, but it felt like theyre tanks as well. Also this challenge cuts 80% of your gameplay by not allowing you to use melee combat, because if you will try, well, you will die, you of course can try to kill 2-3 enemies, but thats your limit, killing tanks for some reason unbearrably hard, but knifes killing them fast for some reason???\r\nStun and lack of cooldown of attacks from enemies WITH THIS CHALLENGE, is the insanest bullshit ever possible\r\nSo not only animals can kill you relatively quick, but they can do so without any cooldowns and also knocking you down. So you just have no chance to escape.\r\nAlso i had to play with Survivor vision whole game otherwise i wouldnt be able to collect anything, and the color game have is just killing my eyes.\r\nIf you want to play just once, good choice, if you want to 100% it, dont even try. Not only you would have to 100% original game, but then also complete the game on expert survival permadeath(which devs are mocking us by saying no one will do it, but with enough patience its easy). Advise, find save files, and do backup every.single.time. you complete a mission, activity ANYTHING, trust me, you will thank me for this.\r\n2/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "like many steam games, this one also doesnt want to start a game and closes itself down before the game begins, what a joke",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love far cry, and this game is fun. However the fact it WILL NOT LAUNCH if you're not online and have a ubisoft account, is the absolute killer of any reason to buy this game or any Ubisoft game in the future. I bought this to use on om steam deck while i travel. Didnt know about the mandatory account at the time. Tried to refund when i had less than two hours of play and was denied because i have and the game more than 2 weeks. I recommend never buying another ubisoft on pc while this is required.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ubisoft Connect makes this game a huge waste, tried going through support today as I hadnt launched the game since 2018 only to be met with \"I'd also like to inform you that your Steam account is separate from your game license as your license is tied to your Ubisoft account, so you may use the same Steam account but cannot use your license in multiple Ubisoft accounts.\" effectively soft-locking me from content I bought and decided to return too, never again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Ull fight killed  the game for me.\r\nUbisoft, I kind of liked the game but you really tried and made it suck eventually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It plays like every other open world crafting game from the past decade where you play as a primitive hunter and gatherer and must kill large herbivores with well-placed arrows or by sticking a spear. I still liked the setting, but Avatar: Frontiers of Pandora is basically the same thing except improved with red vegetation and glowing plants, and more creative freedom because of the sci-fi fantasy setting. Overall, this one is pretty lackluster in the current year, and the story is quite simply \"primitive and barebones.\"\n\nWhen I played it I liked waving the spear and hunting with a spear, but I couldn't even find anything to do with all the things I hunted and quickly filled up my inventory in normal difficulty, and I didn't look forward to the other grindy elements either. The need to tame beasts to progress the plot looks equally silly and tedious, even if it expands how you hunt, I think they could have just polished the combat so it'd be more fun. The stealth was very rudimentary, and I wasn't a fan of how easy it was to simply crouch walk behind an enemy patrol for 30 seconds and then perform an extremely easy one-button kill from the Assasin's Creed games, and how easy it was to quickly ambush 3 men. Your melee options are very limited and you cannot block, parry, dodge or roll (unlike in nearly any recent Souls-game or 3D action game.) Wolves and other animals move in simple patterns that make it easy to line up headshots, and if you do miss a shot they don't run as far away as in Avatar or provide enough of a challenge. This limitation was partly because this game has a much shorter cull distance, and animals could also very noticeably pop in as you walked a short distance.\n\nBecause it's Ubisoft it's also not consumer friendly and despite being 9 years old it still contains Denuvo and needs you to install their 3rd party launcher just to play it in a feeble attempt to steer you toward their own storefront.\n\nHowever, if you enjoy this then maybe you should play Ubisoft's Avatar game, or better yet \"Horizon Zero Dawn\" which has nearly everything this game has but is much better executed.  That game has better stealth, visuals, more engaging combat, a bigger sense of mystery and discovery, and a more coherent story. I think for $3 FCP is now a mid-tier budget game and I've enjoyed trying it, but your time is more valuable and I'd recommend instead playing something that takes the concept further.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cool concept game.\n\nWish it was maintained and polished bug-wise.\n\nYou can't throw a rock to distract enemies, and you need to restart the game for it to work again.\n\nYou can't throw the bait to tame an animal, and you need to restart the game for it to work again.\n\nReleased 2016\n\nI love this game but the bugs are making me uninstall.\n\nPerfect price  of 3$ in this state it is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its all fun in the beggining but after u played a little it just gets boring, it's a no for me",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Forcing online verification everytime i launch the game, why? i already paid for it and you verified it once.\n\nThat should be enough, why check eveytime.\n\nThis is probable a precursor to UBISOFT having access to not let you play your 'Single Player' game when they decide its end of lifetime. A SINGLE PLAYER GAME WHICH I PAYED FOR!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Runs like dogwater on PC. Constant freezing during gameplay and cutscenes. \nAlso uses parasitic Ubisoft Connect app.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game literally wont launch anymore, thanks Ubisoft Connect!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stupid Ubisucks client, it didn't auto create required files in `/Documents/My Games/Far Cry Primal` which cause crashes. I have to create it MANUALLY by making empty text file with exact name so the game can writes into it. \n\nReally love the game but Ubisucks made it worse. No wonder there are only about 20% players got through the tutorial.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A total piece of crap, Game freezes every minute for over 10 sec. So it's unplayable. Tried diffrent \"solutions\" on diffrent support pages.none of them helped. And because I installed it a few weeks later then when i bought it, I couldn't get a refund. So if u buy, then install right away and try if it works on your pc. \n\nLast Far Cry i bought.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot of not enjoyable stuff in here. The mammoth riding missions are excruciating. And there are a lot of missions that make you slowly follow an owl or other stuff to make the game take longer.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}