{
  "positive": [
    {
      "review": "That was one of the best game i have ever played.\r\nGood luck for everyone who find it interesting.",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "The First Flame quickly fades.\nDarkness will shortly settle.\nBut one day, tiny flames will dance across the darkness.\nLike embers, linked by lords past.\n\nAshen one, hearest thou my voice, still?",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "When I decided to buy Dark Souls 3 I pretty much walked into it expecting it to be less entertaining than Elden Ring. Oh man.. It surpassed my expectations in literally every possible way.\n\nSince I'm not really an open-world games enjoyer, the way this game is constructed was perfect for me and I can't think of a single location that I would change when it comes to that topic.\n\nCombat was comfy, took me a second to get the hang of since I had a small break from souls games, but after that it felt perfect. Pretty much most of the bosses were amazing, except for some exceptions, but overall there were plenty of them who were enjoyable, mainly because of their sick choreography.\n\nI'm not really into lore, but the overall story was amazing and witnessing all of the possible endings convinced me to actually get interested in it for once.\n\nAs of now, after finishing the game 3 times. Dark Souls 3 is close to being the best game I've ever played and I intend on playing DS1 & DS2 in the future.\n\nDon't even get me started on the platinum trophy, that was pure hell and pain.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Revisiting old areas from Dark Souls I is one of the best parts because of all of the story behind it.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "To date still the best Fromsoft \"Souls-like\" game. Best bosses, solid maps, excellent combat. I've played this significantly more than Elden Ring.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "It's the funny meme game that people like to compare other games to. \nJokes aside, I'll be honest: [b]GRAB A COPY[/b] of this game! \n\nWARNING: Contains minor spoilers.\n\nDARK SOULS III's combat is quick and responsive; each enemy presents a challenge without seeming outright unfair, no matter how it may seem at first! Even the lesser enemies are have some tricks up their sleeves, and if you're here for the narrative? \nThen DARK SOULS III has that in-spades. \nI love the atmosphere and world that DARK SOULS III presents, and the message that the narrative sends to the Player through the presentation of a [spoiler]decaying, burnt out world that has long since surpassed its golden age.[/spoiler]\n\nPersonally? I believe that the message of the DARK SOULS III, in particular, is [spoiler]everything must come to an end.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Frustrating and amazing at the same time. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Great game very difficult tho dont play this if you dont have much experience with video games or a lack of patience",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "you have no idea what it's like to beat sekiro first which took me almost a hundred hours. only to face wukong years later, then wuchang few weeks after. then dark soul 1, then dlc, then elden ring, then dlc, then dark soul 2, skipped dlc cuz it sucked, then dark soul 3, and now the dlc is complete. I can now proclaim myself as the lord of chaos of all flames and brag about my life achievements. when they said dark souls 3 is PEAK, i mean, its PEAK. only to finish the DLC it PEAKED it's PEAK. so it's PEAKING it's PEAK after DLC which i never thought was possible for a video game. this was absolute cinema as i'm listening to the OST of this game. it's bringing me flashbacks and if i can erase my mind for a video game memory this would be the game to do it to.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "i came here after playing dark souls remastered i thought it will be same antagonising grind but i was very wrong the gameplay is fast and enemy movements are very finely polished it gives me a glimpse of elden ring although i never played it but i watched it on youtube ,this game does feels like elden ring and bloodborne ,i was  hesistated first to buy the game as it cost way too much for a 10 year old game ;) but thats the catch game is something you really should have in your librabry it's a really AAAA experience you dont need to buy shitty ea ubisoft games on high discounts they are garbage just save money and buy this masterpeice there is a reason why ea games on discout price is 20 times less than this game and they arer often in discounted price cause they sale a lie a unfinished crappy game with no support after servers are down just buy this game you will be amazed",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Simply a classic, a blast to play through. Favorite boss in this game will always be Dragonslayer armor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "52.4 hours, every achievement unlocked, all DLC completed—and honestly, every minute was worth it. Dark Souls 3 was the second Souls game I played, and it delivered exactly what I wanted from the series. The boss fights were intense and memorable, the world design felt interconnected and atmospheric, and the combat struck a perfect balance between classic Souls weight and faster, more aggressive action.\r\nOut of all the Souls and Souls-like games I’ve played so far, DS3 lands as my 3rd favorite, but that still puts it in incredible company. It’s polished, challenging in all the right ways, and consistently rewarding. If you enjoy difficult but fair combat, amazing DLC content, and that signature FromSoftware sense of progression, this game is absolutely worth diving into—especially if you’re the type who loves fully completing a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was very excited to get into my replay of Dark Souls 3, as I remember loving it back when it released. The first thing that stood out to me, though, going straight from Dark Souls 2 to 3, was how much better the movement and combat felt. It felt much more responsive, much less restricted, and overall fluid. It led me to enjoy the early game a lot, but before I knew it, I was nearing the end. This was the one thing stopping me from liking this as much as the first game in the series. I love most of the bosses here, and the areas look fantastic, and many of them are a blast to explore. Just running around the place looking for secrets while blasting Agalloch will stay with me for a while. The game is a very atmospheric experience, but it also feels like it ends just as it was really getting started.\r\n\r\nThe game begins with one of my favourite bosses in the series. Iudex Gundyr is a fantastic tutorial fight, almost as good as Father Gascoigne. It teaches you the differences between DS3 and the previous games through combat. It’s a bit faster-paced, with more wind-ups, more attacks, and more unexpected elements. It prepares you for what’s to come expertly. There isn’t a boss as good as this in the game until the Abyss Watchers, but I was ok with that due to the still high quality found in the bosses in between. Other bosses that I love from this game include: Pontiff, Dancer of Boreal Valley, Dragonslayer Armour, Champion Gundyr, Lothric, Nameless King (just the 2nd half, fuck the first half), Soul of Cinder, Sister Friede, and of course, Slave Knight Gael. So yeah, a lot. The consistency of the boss pool for this game is very high, which I greatly appreciated coming off Dark Souls 2.\r\n\r\nThe locations themselves I adore as well. They’re huge, dense, and full of details that can be easily missed. It makes the world and lore feel that much more real. My favourite area is just anything related to Lothric Castle, but returning to Anor Londo was incredible, and The Ringed City is both terrifying and artistically mesmerising. Speaking of, this was my first time going through the DLC for the game. I never got around to them when I originally played the game, but I’m kinda glad I waited. Getting to experience The Ringed City for the first time was jaw-dropping. Going to another painted world was nice as well. Aesthetically, I like the area a lot, but I definitely found The Ringed City more compelling.\r\n\r\nThe game isn’t without its faults, though; there are bosses I don’t like and even hate. Yhorm is a disappointing fight, and the same can be said about Wolnir. The boss I hate the most here, though, is King of the Storm, the first half of Nameless King. I think I hate this fight more than I would solely due to it being a part of one of the best fights in the game. I’m not fond of having to fight an oversized chicken with awful hitboxes and terrible design before I get to fight something fantastic. I feel like if they shrunk King of the Storm’s model and fixed the hitbox issues, I would be ok with the fight. It still wouldn’t be great, but it’d be much better than what we got.\r\n\r\nI think the main thing that keeps this from being as good as the first game in the series is that I didn’t feel satisfied by the end. I finished the fight with Lothric, thinking I had just finished the 2nd act of the game, when in reality, I was close to being done. It felt like there should’ve been many more full areas in the game before Soul of Cinder. I haven’t felt this way about any of the other FromSoft Soulslike games they’ve released. In fact, a lot of the time it’s the other way around. I usually feel a lot of them overstay their welcome. Especially Dark Souls 2 and Elden Ring. But here I felt disappointed that there wasn’t more. This might come across as “I really enjoyed this game, why isn’t there more of it?” but it’s more like “I really wanted more from this game because it feels like it was cut short.”. Other than that, this is a game very close to fantastic, and I’m glad I revisited it. Oh yeah, whoever decided on the achievements for this game seriously needs to question their design philosophy because holy shit do some of them suck so much. Elden Ring replay is next, hope I enjoy it more this time around.\r\n\r\n8.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game! Love it, made me fall in love with the souls-like genre. The DLC is great as well, the bosses are next level.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I AM THE DARK SOUL 3!!!\r\n\r\nTruly one of the best games ever made and a fitting closure to the Dark Souls trilogy (for now). The quality of bosses far exceeds that of Dark Souls 1 and 2. The fast-paced combat, better bonfire placements and introduction of weapon arts makes the game more fun. If you liked Elden Ring, you will like this game too (or vice versa)! Even better, play the full trilogy in sequence :D (just like I did!)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my first Souls-like game that I've gotten an ending from, and after all that pain, lost souls, joy of killing bosses, and founding out that there is a name for people who level up dexterity...\r\n\r\nPerhaps my run was doomed from the very start...\r\n\r\n... and I don't regret A SECOND OF IT!\r\n*Sisyphean ass laughter*",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Possibly the best dark souls game. Many would end my life for saying this, but in terms of the DS series it is the most consistant in world desigh and has the most consistant difficulty curve.  It does not reach the same highs as DS1 in terms of \"ah ha!\" moments in world design, but the world it presents makes sense and is satisfying to explore. It also has the best boss fights in the series, and is the game in the franchise with the least amount of \"oh this is bullsh!t\" moments. It also has Anri of astoric, for whom I would do awful, indescribable things for. Seriously. I would do really bad sh!t. like, things people would condemn me for. I FW anri heavy. You know how it is with people you are ride or die for. I will slide on someone so fast if they diss my favorite Astora NPC. Oscar too. He is gang for life",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dark Souls 3 is not my first souls like however it has become one of my favorites. The atmosphere created by the visuals, audio, and story for you as the main character are unique to the souls like genre. The gameplay is incredibly challenging for those that do not normally play, or are unfamiliar with souls like games. But it is worth all of the frustration and struggling to be able to claim and learn from this game and the rest of the series.\n\nThe story teaches you, the ashen one, to not dare go hollow in your pursuit of rekindling the first flame. The constant struggles of relentless fighting throughout the story create a sort of suffering that you as the player learn to persevere through. The most important lesson I have found in my journey wasn't patience, precision in rolling, or controlling my own anger. The most important lesson was the suffering from this game. After my first playthrough I realized that it's okay to find meaning in the constant torment and suffering of dying, but it's not okay to find purpose in it. Dark Souls teaches you as the player to constantly persevere for your own reasons. Suffering does not make you stronger on it's own, but the growth that follows does.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my third favorite fromsoft game, still one of the best games i've ever played, the mechanics and story telling are wonderfull like elden ring and the first dark souls and a great end to the darksouls series, 9 years after his relase it's still olds up to the newer titles like elden ring, thanks to Hidetaka Myazaki working on this game unlike DS2 that is a pile of shit, this game is defenitly in my top 5 games of all time and i would recomand it to all my friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's like a \"Greatest Hits\" of all the Souls games. Everything that was great from Demon's Souls, Dark Souls 1, Dark Souls 2 (which isn't a lot, actually,) and Bloodborne, all mashed together into one crazy awesome game. \r\n\r\nOh, plus a SHITLOAD of Berserk, too. Not even references, I mean stuff ripped straight out of the manga.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "in the catacobs straight up jorking it and by it, haha, well, let's just say, my raw greatsword",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. I really do. I even think it is *fundamentally* better than Elden Ring in almost all aspects.\n\nHowever, I just checked the price due to the Black Friday sale at the time of writing as I am considering picking up another copy for a family member to play together with. \n\nWhy, in god's green earth is this game still 60 bucks full price, let alone never dropping below 30 on sale. I've been checking back for years and it never drops below 30. \n\nFor context I bought this game for FIFTEEN dollars back in very late 2018.  The game was two years old. It is now less than a year shy of 10 and it is somehow more expensive.  Pretty crappy business ethic IMO. \n\nBottom line is, this is a very good game, if you think its your cup of tea, then give it a shot; but try to get it at a better price from 3rd party retailers if you can (fanatical, green man gaming) or key resellers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If Elden Ring was your first souls game, this should be your second. Dark Souls I feels like too much of a deviation from the modern style of Fromsoft games, but this feels exactly like Elden Ring just without a jump button.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is good but ultimately there is a fatal flaw in my opinion, balance. In elden ring I could use my ultimate great sword all the way through the game without problem, if there was a boss that made it difficult I could go grind and over level. That is not applicable here. I used my UGS all the way up to Pontiff Sulyvahn and had a dead stop, even power level up to 60 and still it just seems undoable given the swing time to his quick attacks. Even guides say not to use heavy weapons and go for something with quicker attacks to be able to safely punish. I can, and probably will, eventually go back and finish it but being dictated how to play had kinda ruined my favor towards the playthrough and Im kinda burnt out for now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily a 10/10. In Dark Souls 3 everything feels like an improvement over the first two games. I still have a soft spot for DS2, but the first one just never fully clicked for me—even though I pushed through it. DS3, though, I genuinely enjoyed. My second playthrough was even better than the first.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing these games since the originally Demon's Souls on PS3, so I certainly have nostalgia for the older titles. But, I think this one is the best and most accessible of the series. The devs took the lessons of the previous 3 entries and created an expertly paced experience with the best combat and map design of all the entries.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Looks and feels like Dark Souls 1, that automatically makes it a 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great graphics, great storyline, weapons, bosses, and everything else is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ut was holy good, i died like 1000 times just to beat the same boss when i killed the boss thats all thats my happinest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the fighting and exploring in the game. Especially human-like opponents are fun, but after 60 hours, I am probably not touching it again. The atmosphere and music disgust me too much now. I never liked zombies, which is what most enemies look like. On the first screen you get a howling, desperate woman's voice which does certainly not need my help. The music in boss fights tries to make me cry for no reason. On the first 5 tries on a tough boss it is okay, but at some point it becomes annoying, and I prefer some angry music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I believe Dark Souls 3 to be the best entry in the series. it is the perfect image of what a souls game is. From the combat, to the lore, every box is checked in this game. one of the most creative universes, it rivals other major games even in larger scale genres. Some of the best DLC and easily some of the best ost's. i can not even think of something i do not like about this game as i write this review. I think its nearly impossible for a game to be perfect, but if i had to pick a single game to call perfect, this would cross my mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first ever souls game I played, personally a really good introduction to the series with good bosses and some pretty shit areas (looking at you farron keep)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Accidentally pressed ESC on ending cutscene.\r\nGreat game, 10/10, Will make you yell a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game that launched nearly a decade, it's crazy. I didn't finish the game yet, but feeling good playing it (with a little bit of rage)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an epic game to complete this franchise. Highly recommend the entire series. From Software never fails to impress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game in 2016 and played on release. Bought it again on Black Friday. Still and always an absolutely God Tier game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly Plug and Play experience , no need to change anything on the graphic setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, everything about it is amazing. except for that one pyromancer in dreg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought I was impatient until I played this game. This game has taught me to calm, analyze the situation and trying to figure out the best course of action. Failure is but a step towards your eventual success. Keep moving forward, both in the game and in life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game I've ever played and 100% worth it. Early game areas may be a bit slow and lacklustre but it picks up the quality at a fast rate with it having some of the best bosses and cinematic experiences I've ever seen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DS3 is the definitive Souls experience. I might like ds1 and bb more but if you want the all in one package then this is it.\n\n It has all of the fidelity of more modern From Sotfware games, doesn't have all the baggage from Elden Ring all while keeping the already interesting lore of ds1 and expanding on it in meaningful ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like Elden Ring but don't have 200+ hours to kill? The addictive gameplay loop of the Souls series streamlined with the edge of Bloodborne and a new coat of paint, Dark Souls 3 is a near-perfect experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The entire trilogy a million times over. If only I could forget it all and do it all again.\r\n\r\nCinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far from my favorite of FromSoft's catalog, but it's still a really good time for anyone looking for a steep challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite game of all time — the one I keep coming back to no matter what else I’m playing. I’m a casual player, so I’m not going to throw around technical breakdowns or fancy terminology. All I can really say is this:\n\nI just love this game.\n\nI love the medieval aesthetic, I love the bosses, I love the combat, and I love the whole vibe of the world. Everything about it hits exactly the way I want a Souls game to hit. It’s fast, it’s brutal, it’s beautiful, and it keeps pulling me back.\n\nDark Souls 3 just hits that perfect balance of challenge, atmosphere, and pure fun that keeps dragging me back for “one more run” every couple months.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i know it says 40 hours but i stg ive beat the game multiple times on console. dont even START with me in the comments about how im a noob i will **** ur face with a corn. i made so many builds you wouldnt even know fr. dont even get me started on pvp ill drag you from here to there pal. get out of my face",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The spectacular conclusion to the Dark Souls trilogy. Best boss list from whole trilogy. Best soundtrack (generally) from whole trilogy and also best visual from.... just huge, complete souls-like. We can talk about it over and over, but there's no point to do it. I had great time with DS3, but for this review I need to mention about minuses: worse level design and unnesecery stuff about convenants.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would for sure recommend dark souls 3 to anybody good game much wow much praise much sun get ittttttt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a full time bullying me simulator and i absolutely have a skill issue the game beats me up steals my confidence and AAAAAAAAAAAAAAAAAAAA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite dark souls game. Such an amazing game. \r\n\r\nOnly complaint could be that some of the bosses were too heavily inspired by Bloodborne.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lo jugué pirata, pero el juego es tan bueno que lo compre para jugarlo otra vez 🥹",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its basically the better version of both dark souls 1 and elden ring. my favorite game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another goated souls game. you cant go wrong with all 3 souls games. all are a must play. if you get stuck try finger but hole.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Intro [/h2] \nLike all things in life, everything must come to an end. Whether it's stories, ideas and yes....even legendary games like Dark Souls III. Which quite frankly is one of the best games to start and end a trilogy that started a genre that has inspired millions upon millions. Now, when it comes to Dark Souls III I am proud to say that the game certainly lives up to the hype and is most definitely a game that has the most legendary and cinematic boss fights out of all the Souls games. Like for example: The Orchestra music that blends the fights together to fit the overwhelming theme of each and every boss. The Cinematic build-up that each scene has that carries its weight and showcases the boss themselves. The Boss phases that transform and elevate the fight, giving you a taste of the fight itself at its fullest potential and much much more. Ofc some may ask. But what about the areas and the gameplay? How does that compare? Well, the areas are nowhere near as trash as DS2, but harder and interesting than DS1. The gameplay is probably the smoothest it's been since DS1 AND you can upgrade several weapons because of the amount of material drops in the game. All in all DS3 is just a huge upgrade from the last two souls games.\n\n[h2] Good [/h2]\n\n- Cinematic\n- 40+ Hr Game (Medium Length)\n- Gameplay Is A Upgrade From Last 2 Soul Games\n- Beautiful Orchestra Music\n- Amazing Story-Telling\n- Legendary Bosses\n- Huge Replay Value\n- Difficult\n\n[h2] Bad [/h2]\n\n- 60% Of The Boss Fights Are Too Short/Easy\n\n[h3] Story Overall: 10/10 [/h3]\n[h3] Game Overall: 9.5/10 [/h3]\n\n\n[h2] DLC [/h2] \nWhen it comes to DLC's in games you better hope that you can get your money's worth. After all DLC's are supposed to be refined extensions of what a game is and for a game like DSIII which is the end of a trilogy, the DLC better be the peak. But guess what? The DLC itself is by far the most climatic with 4 god tier bosses. All having the absolute cinematic aura to them and I highly recommend getting DS3 with the DLC additions.\n\n\n[h2] Good [/h2]\n\n- 4 More Levels\n- 4 S-Tier Level Bosses\n- Hard Bosses \n- More Customization\n- Peak\n\n[h2] Bad [/h2] \n\n- None \n\n[h3] DLC Story Overall: 9/10 [/h3]\n[h3] DLC Game Overall: 10/10 [/h3]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Certainly scratched that masochism itch that FromSoft players like myself enjoy so much. The boss fights were enjoyable and I actually managed to feel immersed unlike other souls-like games. 10/10 would replay for a third time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like Darksouls 3 for me it is one of the best in the souls borne series. It provided hours of entertainment and I still enjoy playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls III is the best Dark Souls game.\n\nThe extreme difficulty remains balanced throughout whilst punishing mistakes and greediness. The boss fights are excellent with a few exceptions. The hardest bosses are in the two DLCs with some having up to three phases! These bosses are accompanied by an impeccable soundtrack.\n\nThe game in general feels a lot smoother and faster paced compared to Dark Souls II with the level design being less confusing. Boss runbacks have been reduced with heavy emphasis on shortcuts, with the longest being Oceiros, the Consumed King at one minute fifteen seconds and the shortest being Slave Knight Gael at four seconds! There is Dark Souls 1 nostalgia included here, such as the return of Blacksmith Andre, Anor Londo, Asylum Demon and Capra Demon corpses scattered throughout Smouldering Lake, as well as the Stone Demon enemy from Lost Izalith. \n\nThe \"Focus Points\" (FP) system returns from Demon's Souls to perform miracles, sorceries, pyromancies and weapon/shield \"Skills\" which allow for special attacks and abilities. Performing these actions drain your FP bar, which is the blue line underneath the red HP bar. FP doesn't regenerate, so you have to consume an Ashen Estus Flask. You can choose whether you would rather have more Estus Flasks (for healing) or Ashen Estus Flasks by talking to Blacksmith Andre.\n\nThe poetic storytelling makes a return with a very worthy final boss of the base game and both DLCs. NPC side quests make a return, with most worth pursuing to acquire certain items, such as a Titanite Slab, Silvercat Ring and the Pyromancy Flame being the most useful.\n\nDark Souls III contains new additions such as a red cross next to weapons that you don't have the correct stats for. The Homeward Bone can take you to Firelink Shrine or the last Bonfire rested at, unlike previous Dark Souls games. Upgrading armour sets have been removed. A new stat called \"Luck\" has been added which is useful for farming rare Covenant items and upgrade materials. Estus soup is a new healing station that refills your HP, but there are only three of them in Lothric.\n\nAlas, covenants in this game don't benefit PvE as they're more suited to PvP, unlike previous Dark Souls games.\n\nEasily the best Dark Souls game and a fantastic way to conclude the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game, and has been for years. it was an honor to 100% this game after moving to pc and I have a feeling I will do many, many new game cycles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far, one of the greatest games I’ve ever played. The combat and armor look spectacular. Don’t even get me started on the boss designs and lore. Every boss was absolute cinema especially the final boss. There is nothing to dislike about this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my first souls game years ago, got a chance to buy it again today, still enjoy the game like first day and a lot of memories. Dark Souls 3 will forever have a place in my heart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started with Elden Ring, then went back and played Sekiro, DS1, 2 and 3 in order. Three felt the smoothest, and it went by the fastest for me. This was the first time that I never got stuck on any bosses. I think that was because Elden Ring's combat really prepared me for how to interact with this game. All in all, it was a very good time. I have my opinions, as do we all, about which of the Souls games was the best, but the bottom line is that you will probably enjoy this one enough to buy it and play it. So do that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the peak of the dark souls franchise for me, the combat, the movement, the world design, great bosses and fun dlc, honestly a top tier game everyone should try, though I do have one major issue with the game, way to many bonfires, but that could just be the masochist in me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play DS3 because Elden ring is dead. I have 5 characters in Elden ring all different ranges with the proper + weapons. It takes 30mins+ sometimes to get summoned or even invade so i just give up. I have 1 single lvl 120 character in DS3. I can invade, get summoned all over pretty much as fast as i put something down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly one of the most remarkable games I have ever played. Dark Souls III is the culmination of everything great about the first two combined into a seamless and unforgettable gaming experience. Rediscovering the world, visiting old locations, and fighting new bosses made Dark Souls III feel like a journey that you can only live once. It is a challenging experience not for the faint of heart, but if you have played Dark Souls I, you are sure to love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After Elden Ring, its nice to come back to the original level design, very fun to explore. Dark Souls 3 has great world design",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Without a doubt, one of the best games and conclusions to a larger story in gaming. Hard to learn, but a true masterpiece. I fully recommend this to any and all people wanting a challenge without the garbage that EA and Ubisoft put out with pay walls for skins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i've ever experienced with amazing soundtracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game the world has ever seen, a supreme work of art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My journey of souls-like continue, where after I played Sekiro, I tried Dark Souls. The game is more grounded than ever. I wasn't expecting how big the monsters are, in my first encounter with big monster, I don't know if i can ever handle it, but through and through, every big monsters bosses are the most fun one meanwhile the humanoid/smaller one gave me the most trouble. Not to mention, lock-in target for big monsters gave me a headache, but then again, I could just lock-off.\r\n\r\nI was struggling with the controller, since I learned the game came out before Sekiro, the QOL is a bit terrible. The game won't show me keyboard options and they want me to press A button and it's just \"E\" on keyboard, it took me a while with adapting, but also, some of the button are overlayed with eachother, It's recommended to set your settings on your own because the game settings are terrible. Once I changed some controller with Sekiro's (I know it shouldn't be compared like this), the movement become more managable.\r\n\r\nI enjoyed medieval, penitent, pilgrim, european, or maybe spain theme. The architectures are beautiful, some of the areas are so beautiful and well designed, and on the other side, it pisses me off so bad. I hate swamp area. Not to mention, the monsters are so agressive, if they ever saw you miles away, they will chase you, running-style. A lot of moment gave me jumpscares with how close they are because they are just so fast to chase you. Some are just super loud, the game is trolling me.\r\n\r\nI'm surprised the bosses doesn't give me a lot of trouble. Although I don't first tried all of them, once I discovered the moves, the dodges are surprisingly broken, it gave you invincibility. To be fair, when it gets too hard, I will just move to the other undiscovered area until it hits the harder boss, therefore i could just choose whichone is easier. One mechanic i really love but somehow it doesn't work consistenly is parry, I thought I could parry all the humanoid bosses, but it doesn't really work most of the time, also you're encouraged to dodge more than parrying/blocking. \r\n\r\nThe online features is probably the best thing to ever happen. It has been helping me a lot, somehow there's a sign where you could explore it because \"previous\" players have reached it. But it just bothers me that there's no obvious hint that the spot is explorable, because If i knew that, let's say, the roof is explorable, might as well made every roof possible to explore, but then, most of the time i don't find anything...\r\n\r\nI don't get the class character-allocate-stats mechanic. I chose warrior, but at the end, I wear knight-ish armor, wasn't it for the knight? What's the difference? The playstyle locks me to try other thing, I didn't do spell at all because I need to build faith/intelligence, but going through late game, leveling up cost 70k souls...?! I need to distribute them carefully! I love going agressive against bosses, but I love to play stealthy when exploring. \r\n\r\nProbably the biggest complaint is how cryptic the side-quests are. I don't even know it existed until I read the community page about characters questline. \"You shouldn't beat this before this\"; \"Don't use this before this\"; \"Don't do this before this\"; and things like that ruined the experience of exploration. Lucky enough there's no consequences in story-line progress, more dissapointing, the side-quests doesn't affect it at all! I don't know if the game set things like this for NG+, but say it with me, first impression is always everything. \r\n\r\nI like it, not by lot, I was hoping I could be more intimate with NPCs through journey. Some of the NPCs are memorable, Anri, Siegward, Greirat, Eygon, and Horace are like good company because they didn't \"leave\" mid-game. The story is straightforward, it adds more detail when you continue the journey. The bosses are managable, fun, challenging, and not in the unfair/hard territory. The variety class is nice for everyone, because not a lot of people want to be knight but rather sorcerer and it's nice. I'd love to give the game, 7,8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DS3 is often heralded as the best in the series. It's a tough call! With that said by modern standards DS3 is certainly the best souls game to pick up in 2025. I still recommend texture mods to improve the graphics. Some of the bosses are just too iconic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not even my enemies should go to this pain of a game. On the real side tho,its a cool looking game with a unique gameplay and berserk references.  I played it for my own sake to be able to say that I hate this genre as a whole,its not made for me,but who knows. I raged a lot in this game and I almost gave up,but something kept me going,beating a boss felt like life had meaning,that was the whole point. Other than that was straight up chaos and a slap to the face everytime a mob attacked me or i died by them before fighting a boss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started, and I died to the first boss times 4, then screamed when he mutated good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is basically a hallway with no exploration, still good af.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God the grind... I was dreading it from the beginning obviously but I never expected to meet a friend here and help each other with it so I'm pleasantly surprised. Honestly could not be a better showstopper for the dark souls trilogy. Iconic bosses everywhere, soundtrack too. Just so enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Offline is fun, STAY AWAY FROM ONLINE! Nothing but sweaty fat bald guys that sit in the swamps on a Sunday night at 11:30 just calling in Wolf followers to kill. Other than the no life losers that need to delete the game and get a grip on their pathetic lives, it's a fun game and good way to end the DS trilogy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great(no doubt) but 1 thing i really really hate about it is when i have to switch device to continue the journey my savegame dissapear immediately  this thing happen for me 3 time and decrease my experience so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is freaking crazy. Super fun to play. It's only for those who have patience. Just 4 hours in and i can tell i have nearly 60 hours more in this game. Glad i started my souls game journey with this game. Love you Miyazaki bro. Worth every single penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have beaten this game countless times on my ps4, Now I played it with the Co op mod and it made the game as peak as elden ring. If you love elden ring this game is a must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The more you play, the less you want to play, a perfect circle for a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute cinema. Gotta play with the dlc's too of course, Gael is my favorite fight in this game and prob all of the souls games I've played. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls 3 is one of those rare games where every step feels like a journey through a living piece of art. Its world is dark, ruined, and hopeless. and yet somehow beautiful, its incredible how even after dozens of hours, I kept stopping just to take in the view.\r\n\r\nThe bosses are memorable, and the soundtrack ties everything together perfectly. but beyond the challenge, it’s the beauty and mystery of this dying world that truly stayed with me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls III is FromSoftware at the absolute peak of its craft—a stunning, emotional, and relentlessly thrilling conclusion to one of the most influential trilogies in gaming history. It blends the haunting atmosphere of Dark Souls 1 with the refined, aggressive combat of Bloodborne to create a game that feels both familiar and boldly evolved.\r\n\r\nFrom the moment you rise as the Ashen One, Dark Souls III grips you with its breathtaking world. Lothric is a place on the edge of collapse, where time is distorted and kingdoms bleed into one another. The result is a world that feels mythic and dreamlike—ruined cathedrals, smoldering battlefields, twisted forests, and cities swallowed by ash. Every region is crafted with such detail and intention that exploring it feels like uncovering the final chapters of a long, tragic saga.\r\n\r\nCombat is where Dark Souls III truly shines. Faster, smoother, and more refined than any Souls game before it, the battles feel fluid and exhilarating without losing the weight and strategy the series is known for. Every weapon has personality, and the Weapon Arts system adds layers of depth, letting you fight with style and precision. Whether you prefer dex katanas, colossal ultras, pyro builds, or pure faith miracles, the game welcomes all playstyles.\r\n\r\nThe bosses in Dark Souls III are nothing short of spectacular. Each encounter feels like a masterpiece of design and spectacle—from the elegant brutality of the Abyss Watchers to the tragic duel of the Twin Princes. And then there’s the Soul of Cinder, a fight that serves as a love letter to the entire series. These aren’t just battles—they’re emotional moments, tests of skill, and unforgettable set pieces.\r\n\r\nThe soundtrack deserves its own praise. Emotionally charged, haunting, and epic, it elevates every major encounter. Yuka Kitamura’s compositions give each boss a soul of its own, turning every victory into a moment of catharsis.\r\n\r\nAnd beneath all the combat and exploration lies a story about cycles—of fire, of struggle, of heroes rising and fading. Dark Souls III carries a surprising emotional weight, especially for players who’ve journeyed through Lordran and Drangleic. It feels like witnessing the final breaths of a fading world, and yet, there’s beauty in its melancholy.\r\n\r\nDark Souls III is a masterpiece that honors its legacy while pushing its formula to its highest potential. It is grand, tragic, thrilling, and unforgettable—a perfect ending to an iconic series and one of the finest action RPGs ever made.\r\n\r\nA brilliant finale. A powerful experience. A worthy legend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favourite game of all time and Favourite game studio I've ever played games from. Would highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually played the Soulsborne series in reverse, at first I was incredibly intimidated by it's design,  but it was not until i played Sekiro and Elden Ring I \"got it\". A lot of people think enjoying these series makes you a masochist, but it kind of taught me to never give up and to approach challenges with a different perspective.  It's a game I replay at least once a year, grab a copy while it's on sale!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, I have played the shit out of it. I love replaying it. It has a great vibe and combat feels good (unless I am dying then it is horrible). If I could get everyone I know a copy of this game I would.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soulsborne games are the greatest things to be uttered and created by man kind and the peakest things to enter the atmosphere of the universe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, a solid RPG experience of exploring, finding quest givers, and clearing dungeon areas. It's age is beginning to show, especially in muted brown levels, but still, a sight to see. The level design is still breathtaking and the art shines through the aging graphics. The combat is smooth, but still a bit clunky since its still an older game. \r\nYet, the story and enjoyment seem to be aging very nicely. I'd say this is a fun game to recommend to anybody, not just rpg gamers. \r\nThe level design is my favorite, just wish they added a bit more ambience in osts to match. The cons: its still a souls game. Fromsoftware makes excellent action games, but even they are still guilty of inserting dirty gimmicks and 'gotcha' ambushes. Just because its souls like, doesnt mean its actually a fair game in difficulty to the player. Example: draining stamina on swings, running, blocking, dodging. I dont like punishing blocking or dodging, both have to be fair if players need it to counter damage. Otherwise, guess they must get hit? Level design, story, fun are good. Combat and systems are fun but subpar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever - genuinely helped me get out of a depressive episode that lasted months.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would recommend, however the hackers infiltrate and ruin your pvp experiences.\nother than that great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a sick game, sad to have finished it. by far the best and most consistent bosses throughout the trilogy. great ending to the series and also deffo got the hardest looking places out of them all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is closer to Elden ring mechanics than dark souls. I love it. Very linear, engaging bosses, absolute masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The bosses, amazing.\nThe bonfires, generous.\nThe runback, reasonable.\nThe enviroments, beautiful.\nA good first soulsborne for players interested in the genre.\n\nI remember the first time I beat Twin Princes, my heart was racing, and I was so happy to have overcome such a mountain. That feeling is why these games are so good.\n\nIt also is great to feel like you finally understand a boss, like everything in your mind is in the right place and you become one with the boss.\n\nI initally gave this a bad review because of the price, (which is absolutely abysmal) but i think that is unfair to the game because the publisher's greed has nothing to do with the game itself.\n\nIf you can afford it on or off sale, PLEASE PLAY THIS GAME.\n\nP.S. DONT GO FOR ALL ACHIEVEMENTS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story combined with ds1 was nice and themes from ds1 and ds2 was good, especially the Gwyn theme, adding majula theme would've been nice. It would've been nice if they added more ds2 content. \n\nOverall recommended game, good story, good connection with both ds1 and ds2, Both the DLCs are good and has nice story with good playtime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls III is the secret lovechild of Bloodborne and Dark Souls [1]. The story proves to be a direct sequel to the first title of the trilogy, whole amping up the gameplay and pacing to something more akin to but still not quite Bloodborne. This proves to be both a boon and a hinderance, leaving the game in a state that may turn off fans of the aforementioned titles--or at least hinder the experience.\n\n  Firstly, the gameplay is of a faster pace than Dark Souls or Dark Souls 2. While heavier armor and weaponry can still bring about slower pacing, and the shield is still very effective throughout the game, the enemy and boss movements and speed require greater speed than the Chosen Undead or Bearer of the Curse are capable of. Perhaps this is not a direct result of From Software previously working on Bloodborne, and may well be a result of modern innovation. The fact of the matter is, the enemy and especially boss experience feels more familiar to a Bloodborne player than a Dark Souls player. Even some of the NPC designs and the human trees look like something out of Yharnam or the Nightmare realm. While this game does still require a fair level of patience, it is far more forgiving and even rewarding than Dark Souls for rushing. Even the bonfires are plentiful, removing the challenge of boss runs or bonfire runs. With the absence of a Lord Vessel, and the game immediately allowing for fast travel as soon as you've found the Shrine Bonfire, it makes the overabundance of bonfires redundant--in one instance, you acquire a bonfire after defeating a boss, then immediately find one within staring distance a safe walk away. Perhaps this was in order to make the game more welcoming to gamers unfamiliar with the Soul's Like genre. Even Bloodborne didn't have lanterns so congested together in the game, and it's supposed to be fast paced.\n\nDespite these similarities and gripes, the world building is just as masterful as is to be expected from From Software. The story is far more connected to the first title than Dark Souls 2 in its entirety, and acts as a direct sequel to Dark Souls. Even one of the bosses is an allusion to every player character ever created for, and who has completed the first game. The Knights of Katarina make a return, and we have references to the NPCs and even bosses from the first game and its DLC. Not to spoil where, but an area from Dark Souls is revisited in this game, altered ever so slightly to keep the familiarity while playing up the passage of time and events on the wear and tear of the setting. The story is truly compelling, and interacting with the various NPCs or reading the item descriptions really immerses one into the story.\n\n  Now second, the game has some unfair hitboxes, and enemies that the first game would have made parry-able cannot be. This experience really takes out the point of even learning how to parry--outside of dealing with mobs--since the game does not bother testing all that it has taught you the way the first does. The final boss in particular, while being a parallel to Lord Gwyn, cannot be parried despite being design like the type of bosses that usually can. For a final boss, you would expect the game's mechanics to be put to the test. You can parry Lord Gwyn, and are even given Black Knights outside of his fog door to practice on. You can parry Gehrman, The First Hunter, for he is a hunter just like you. The final boss in Dark Souls 3, despite being humanoid, cannot be parried. Pile that together with certain mechanics to the boss fight, unfair hitboxes--check out YouTube videos that show the hitboxes--and several combos that can one shot you without wearing specific rings or using a miracle or min-maxing your vigor, and you're left with a final boss that can leave a sour taste in your mouth after you conclude the game. The final optional boss would have served as a better final boss, despite being much more difficult. Despite these complaints, its lore almost makes up entirely for it. Almost. Thankfully, you can enlist a summon if you follow a specific questline, or even summon other players. The boss run is also the most direct and peaceful in the game, but just keep the challenge ahead in mind when plotting your attributes.\n\n  In conclusion, Dark Souls III is a game that I would recommend only to fans of Dark Souls or Bloodborne--who have already completed either of both games, and are looking for more akin to it--however I would not recommend it as anyone's first From Software game. If you can only choose one from the Dark Souls trilogy to ever play, I find the first to be a greater experience all the way through to completion, however I do recommend playing Dark Souls III afterward if you do decide to try another game. For a faster pace, I recommend getting a PS4 and playing Bloodborne instead of starting with Dark Souls III, and I wouldn't recommend going back unless you are ready to adjust to a slower pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last of its kind, the best of its kind. My favourite Dark Souls and their best game to date. The legacy, the emotion, the atmosphere and the nostalgia, used to be a time when I was a kid and I thought why would someone make something like this and call it a videogame but now here we are. Prithee be careful but knock yourself out with DS3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started off with Elden Ring and was seeking that same sort of satisfaction and and this game delivers so much more than that. Highly recommend this game to others. Will also try out the other 2 as well. Well made game from FrommSoft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The servers are bad, I lost 5 saves until now, but seeing past that the game is as perfect as it can be. BUY IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really hard sometimes. Sometimes, the bugs getcha. It's still an amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The boss quality in this game is great. Some are a miss for certain, but especially the DLC bosses are a lot of fun to fight. The final boss of the Ringed City DLC never tilted me despite the difficulty - I came out of the fight smiling since it was such an enjoyable experience. Also great music through and through",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I beat ts and its pretty good wasn't expecting going into this to be one of my favorite games I have played in modern time but here we are tuff game its a lil hard btw also champion gundyr is harder than nameless king idc",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Amazing game, but Bandai Namco. This game is almost 10 years old and Bandai Namco decided to stop lowering the price during sales. Used to go on sale for -75% on average for YEARS, now it's on sale for -50%, and off sale it's still full price, which is insane! While it definitely would be worth it like 5 years ago (and honestly in terms of quality, it definitely is worth it if you have the extra money to just burn), my gripe is how slimy the publisher is with the pricing of this game. I urge you to not buy it at full price, let alone this pitiful discount.\n\nI highly recommend the game itself, but I don't agree with the publisher's greed. On top of all this, they barely even maintain the game, all patches have passed, and at one blip in time there was a online security flaw and they had to shut off the servers (prior to Elden Ring, they're back up now) and they still want full price (or -50% take it or leave it)\n\nUsed to be $15USD during sales from like late 2017-2021. Now it's $30USD during sales as of 2025, 9 years after release. GREEDY.",
      "voted_up": false,
      "votes_helpful": 427
    },
    {
      "review": "If it weren't for selling cs cases, I wouldn't even bother buying this game for it's current $30 on sale price. Crazy to think that at one point it was as low as $10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I absolutely love this game and would be recommending it any other time, but going back to play it recently the performance is suddenly significantly worse than its ever been before, borderline unplayable. I can't figure out anything to fix it. if you happen to be considering buying this game right now in 2025, I would hold off for now until this (hopefully) gets fixed. I've seen others saying they're having similar problems, but no one seems to know whats causing it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Absolutely baffling port. Across multiple devices, I've had save data issues where it just vanishes and that's even worse off when you consider there's no cloud save. played all day yesterday just to boot it up again after plugging a new ssd in, and for whatever reason treated it like the games first ever launch. Bandai Namco has failed pc players a lot and this sadly is hard to recommend for that reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Poise no longer works like the rest of the series, hyper armor is the only way to actively poise through anything. Spamming perseverance and hyper armor weapon arts trivializes the game for the most part, atmosphere, boss fights, and really good DLC make up for the lackluster combat system. Would recommend for a new player to the series, for recurring players, don't expect to be satisfied with the combat using what you want to, there are definite favorites. Poise values of enemies change based on the attack they are doing, just expect to have to read into everything somewhat needlessly. Another case of flying to close to the sun like Dark Souls 2. The needless changes make it a drag knowing how good it could've been. Purely a casual experience, definite precursor to Elden Ring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Least favorite game of the series by far. Took a huge step toward being an full on action game in a bad way. Enemies got massive power creep in speed and damage but the player did not get the same scaling. This issue gets much worse in the DLC. Sadly all of the good level designs got left behind to, with this being one of the most linear games in the franchise. Not my cup of tea but maybe someone else will enjoy this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This shit was so ass, nothing good to say at all. Everyone glazing this are just obese or cornballs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bosses are great I guess, but the rest of the game is like wading through shallow slop. I recommend gitting gud at DS2 instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Frankly, never thought i'd give this game this review, but i cant really in my right mind TRULY recommend it I think, i feel that i am consistently punished for actively trying to engage with the game, figthing basic enemies and exploration are vastly worst than my experience with a game like dark souls 2. I feel it is nott an experience i find worth a second playthrough.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game blows ngl except for siegward & greirat, like 3-4 bosses, and irithyll from 500 ft away",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is currently too unreasonably priced, and a it is total price gouge.  I've own this game since 2020 when I bought the deluxe edition for $15.  It is time now for me to come out and to review this game.  Why?  I want to speak out against you readers for paying $40 (50% off) for this software rental.  My recommendation is for you to buy a cheap PS5 or PS4 and just play a used copy you can get.\nAs for why I've only played 50 or so hours, I have devoted more time for other games, including Elden ring, Dark Souls 1 remake,  Bloodborne game of the year edition, and to my two all time favourites:  Demon Souls and Dark souls 2.    \nDark Souls 1 and 2 had connected worlds.  This was a huge draw for me.  Dark souls 3's worlds are smaller and better designed. However, I was disapointed to find that you must go to the bondfire to go between worlds.  Sure, Demon Souls and Bloodborne are the same, but those are first installments of the game.  Here, we're talking Dark SOuls 3, where 1 and 2 had interconnected worlds.  No excuse.   If you must really praise this game for smoother combat, I would recommend that you dont' your time here, and just go play Bloodborne.  Cheers mate. Don't pay the sucker price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really sad how they're letting this game go to shit. It keeps glitching and I am having cheater for pvp in the normal server. Dogs were acting like the Vietcong and dropping out of trees level of glitches. Sad I love this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stupid series, underwhelming and repetitive ideas. The whole last part of the game is the same enemies from the first level but....harder for some reason that is never visually shown. Makes you feel like wtf was the point of leveling to get here to fight *checks notes* a skeleton in armor..... This is after the Road of Sacrifice is just full of mobs that we will call uncommon. Other than the small crabs and bugs, every enemy is a damage sponge but can murder you with a stick....honestly looks like best weapon in the game. A sharpened stick gives this mob super armor, a charge attack, and a 270 degree hit box swing. Where is my slightly sharpened big stick run? Poor balancing, weak story, meh map design when compared with other titles",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If Miyazaki ever learns what enemy telegraphing is actually for he could make a pretty good game. He designs bosses like Niel Breen writes films. It's a real shame, everyone else who works there is clearly talented. Such a waste of FromSoft's money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got the base game and DLC for half of the current cost something like half a decade ago. It's not worth £30 at this point lmao get fucked scamco",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The PC port is disappointing. It lacks a borderless windowed mode and displays controller prompts instead of mouse and keyboard keys. Additionally, shield does virtually no damage on its own, feels like a strange and senseless design choice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shit ass dogshit game makes me wanna slit my wrists, make sure you have friends or youtube, or else kys",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I rate it a 5/10. Its an OK game overall but the grind for covenant stuff is just dogshit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, but the pvp is nonsensical. Why is there even pvp FromSoft? Focus on a better combat system instead of forcing pvp into a single player game.\nAlso, the forced full screen, no PlayStation glyphs, and no widescreen. Please up your game FromSoft. You can do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible awful frustrating game with bullshit mechanics and awful trash. probably goinjg to do another playthrough as a faith build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When you going to run DS3 in 2025 at the first time\nRead this:\nIM not recommended to run DS at all IF you already run Elden Ring before.\nImagine that you have MacBook Pro 2025 or M5, then you turns on Macbook Air 2010 which one is actually is the PREVIOUS version of your device. Not the different, but previous. Which includes less comfortable, less capable, less frendly UI, less CPU, less SSD speed, less vibrant / crisp picture and ect,\nThe guys who wrota bout DIFFERENT games:\nFor example Sekiro was created at the zero point. All animations, assets, colours and ect. Everything in this game was created from nothing.\nBut HERE, Froms using the same animations, UI, materials and all from the previous versions.\nNothing to say about play this game in 2015.\nBut in 2025 it looks really BAD in ALL points, which has been improved or cutted off in Dark Souls 4. \n\nIF you re NOT run Elden Ring before.\nBetter buy Elden Ring and enjoy last version of \"your MacBook\".\n\nPS. \nDear Babazaki's team, i know that noone of you, devs, will not saw this text\nBUUT \nWHAT KIND OF RETARD...\nWhat kinda MORON slapped in an achievement calls \"Collect all the rings\"? \nI was a total dumbass grinding to snag every damn ring, but NAH, the achieve only drops if you hoover up ALL the rings THREE FUCKIN' TIMES...SAME goddamn rings! WHAT?!\nThree straight runs on NG+, NG++\nWhy the hell not just write what exactly needs to do: \"Collect every ring in base game, NG+ and NG++\" \nWhat kinda bullshit SCAM is this?! \nY'all could better dropped some sort of.. like: \n\"Collect every weapon in the game \"or \"Complete the game without use of any spell\" or\n\"Make a nodeath run\" the whole damn thing of this list its a tons of dope challenges that would makes no questions.\nBut some absolute clown drops \"Grab all the same rings three times in a row, in BG, NG+ and NG++\" masked by \"Collect all the rings\"\nMad?!\nThe absolute dickhead who cooked this up for a platina i hope demons in hell rail your ass raw, dunkin your skull in a cauldron of boilin of shit, rapes your wife by monster cocks and cum inside her bleeding pussy, and your kid's tiny penises melt off in Scarlet Rot. M o t h e r f u c k e r",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game but in the year 2025 on windows 11 this runs horribly. works just fine on my xbox but keeps freezing and every time i lock on my screen is blocked with this visual test bug thats unfixable even after reinstalling.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i absolutely love sekiro and elden ring, they are actual masterpieces. but the dark souls series is not even close. i mean, i feel like it's only the soundtracks that make me like them. the bosses are still good, and the worlds are beautiful. but that's about it. i don't want to say that you just walk around with a weapon and kill enemies but i feel like that is exactly what i am doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring and repetitive bosses that will arbitrarily lock you out of questlines for the rest of your playthough. dont waste your time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't like it. It's not a bad game, but as a story sequel or a knights sparring sim it wasn't what I was looking forward to at all.\n\nInitially stopped right after the swamp, already deciding it's not for me, I only came back to finish the main game to see if I'd change my mind. I didn't.\n\nIt's a mess in gameplay-narrative sense, it's convoluted, visually overdesigned, linear, feels like a fanfiction to itself, and doesn't respect materials & armors visuals-to-gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit fucking game, this might be the most overglazed game oat #killallcursedrottedgreatwood",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Agitating and annoying\r\nBloodborne but tedious.\r\nGrey blob aesthetically speaking, EVERY AREA.\r\n\r\nEasily the least fun of the souls games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "GAME GAVE MY PC  A LITERAL VIRUS KEYBOARD DOESNT WORK HALF THE  TIME  AND  ACTIVATES  RANDOM OUTPUTS ON MY PC LIKE SCREENSHOTS, OPENNSS WINDOOWWSS  WHHEEN I PRESS Y OORRR  ESCAPE, ANDD  ITSS  PERM STUCK INN   CCAPPSSS  LOOCCK EVEN WHHEEN I TRY SHUTTING CAPPSSLOCK OFF, AND NO MY KEYBOARD ISNT BROKEN ITS NEW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring ass rollslop I'd literally rather be playing squidward sword. can't even explore openly like in the first game you just move forward roll kill the next guy repeat I feel nothing while playing this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this might be the most overhyped piece of shit slop ive ever played. the bosses are mid as FUCK besides aw, pontiff, nk and soc. the enemies in the area are 7 lightyears harder than the actual boss half the time and the achievements are the most boring and soul consuming things. id rather watch my whole family get mutilated for the rest of my life before playing this shit ever again. if this is your favourite game you have the mental capacity of 3 aborted children.  ONLY good thing is wolfskirsche who helped me farm the covenant items. you saved me from playing this toss any longer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".. heh bought for 25$ like 4 years ago... now its almost double the price ' on sale '.. what a trash grab.. /snickers..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you have to research how to play a game, then the designers/developers haven't done a very good job.  This game falls into that category.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The challenge might be fun for some but it doesn't click for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks you kill a woman and it questions your decision? wtf I payed money for this im done do not play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is terrible and shouldnt be on pc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game was okay, I think I would put this as my favourite of the souls games, and i think it has the best level design, game feel, and controls, as well as decent level design, and honestly, a really high average quality of bosses\n\nBut I still just could not in my heart recommend this, I'm aware many others would. But this was just not it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game crashes my whole ass pc, what da helly shocked emoji",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Creative Bankruptcy: The Game\nThey fixed and unfixed many of the issues with Dark Souls II.\nThey kept power stancing, because it obviously makes sense to include that. They also added weapons which were made specifically to be used with both hands, like the Sellsword Twinblades and the Drang Hammers. But obviously, the coolest one is the Farron Greatsword. Its name doesn't make much sense considering that it's a dagger and an actual sword, but hey, cool, regardless.\nWhich is why it's so dumb that they made the player character mainly right handed, just like in the first Dark Souls. For example, holding an axe in your left hand makes you block, and you can only do a heavy attack with it. Meanwhile, if you have a shield in your right hand, you start punching with it. In Dark Souls II, your character is ambidextrous, however, sometimes you deal less damage with the left hand.\nAs for the story, areas, and story, the game tries its hardest to emulate Dark Souls 1, from the main quest to the ending, the boss designs, and the levels.\nCrystal Sage is just Pinwheel that's not too easy. Old Demon King is just Demon Firesage from DS1. Wolnir is basically Gravelord Nito, again, from DS1. Yhorm the Giant has to be defeated with the Stormruler, a weapon from Demon's Souls, used specifically to defeat the Storm King, a boss fight, that is actually really fun with a cool setting. Dragonslayer Armour is basically the Penetrator from Demon's Souls. Champion Gundyr could be a different version of Iudex Gundyr that the developers thought would be cool, but couldn't decide on which one to put in the game. Soul of Cinder is literally the the Burnt Ivory King from Dark Souls II's Crown of the Ivory King DLC. Same moveset, almost the same attacks. As for the DLCs, Halflight is, again, literally just the Old Monk from Demon's Souls with the same invasion gimmick (which is quite cool). Then Slave Knight Gael, who is a red Artorias.\nAreas: Firelink Shrine, same name and function as DS1, but a different setting. I like this version more. Farron Keep => Blighttown. Catacombs of Carthus => Catacombs from DS1. Irithyll + Anor Londo => Anor Londo. Grand Archives => The Duke's Archives. Untended Graves is funny because there's an extremely difficult out of bounds glitch where you can climb up backwards from Cemetery of Ash to reach the illusory wall to reach Untended Graves, but I think you'd get stuck as you probably can't enter the fog wall from the other side (at least in DS2 you couldn't do that), but if you drop back down you'd arrive in Untended Graves. Archdragon Peak is great, especially the Nameless King, I'd say he's my favourite boss. Kiln of the First Flame, same name as in DS1. Painted World of Ariandel => Painted World from DS1. So the pattern here is to evoke an emotion from the better designed game, DS1, by copying everything they can, but making them much smaller, and making them look just as terrible as they were in DS1, because of technical limitations.\nMore about the bosses (and the enemies), oh dear. It seems like they just tried to make them difficult for the sake of it. They all aggressively ambush you in hordes, as if this was Left 4 Dead or something. Two perfect examples of creative bankruptcy are the Deacons of the Deep and High Lord Wolnir. The deacons are just enemies spawning infinitely without giving you any room for movement at all, and the first stage of the fight is just some collective soul that you can only deal an exact amount of damage to. Then the second stage which is just a crowd crush simulator. Then there's Wolnir, a hard to reach boss with incredibly high defence, whose weakness are his bracelets. He may or may not spawn skeletons just to make things harder for you. Then there's the mist around him, which can make reaching the bracelet on his right hand challenging, because it pretty much instantly kills you. If he starts moving upwards, you're basically dead. Dragonslayer Armour can be pretty difficult by itself, especially because you're fighting on a bridge, and then for some reason the level designers also decided to put some monster in the sky to shoot at you during the second phase. Why? The rest are fine, I guess. It'd be silly to complain about attacks with weird timing. They're annoying, but they're fine.\nMagic works the same way as it did in Demon's Souls, meaning you have a mana bar, that you can refill with items (here, mainly the Ashen Estus Flask). I like this one more than the system in DS1 and 2.\nAs for armour, this is the only game in the series where you can't upgrade armour. Which is sad for cosplay builds, as now you have to choose between high defence or fashion. Meh.\nWeapon infusion also works the same way as it does in DS2, which I'm quite fond of.\nAs for PvP, there aren't really any OP builds like in DS1, but it's still just as unforgiving. Parrying is more difficult (with regular shields?) and rolling i-frames are longer. Parrying would be fine with latency, but dodging with server delay just makes fighting a nightmare. At least you can FINALLY invade without being embered/in human form. Thank GOD.\nOverall, this game is a bit of a disappointment for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its just a rather lazy bad port from console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Miyazaki you greedy SOB..do you not have enough money, are you not satisfied by your status. Biblical levels of greed. LOWER THE PRICE GREEDYZAKI",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People find this gameplay fun?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid Souls III: Prepare to Roll Edition\n\nWe have Blood Borne at Home",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну хз, как будто даже первая часть могает",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how this became popular enough to end up with elden ring is beyond me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game mid i beat it to fast smh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too easy for a pro player, 3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nice igra sinok shalavi\n\nnice igra sinok shalavi x2\n\nnice igra sinok shalavi x3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dark souls 2 if it was bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like being violated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO STEAM CLOUD SAVES",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "eat dik",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rollslop.exe",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, but Bandai Namco. This game is almost 10 years old and Bandai Namco decided to stop lowering the price during sales. Used to go on sale for -75% on average for YEARS, now it's on sale for -50%, and off sale it's still full price, which is insane! While it definitely would be worth it like 5 years ago (and honestly in terms of quality, it definitely is worth it if you have the extra money to just burn), my gripe is how slimy the publisher is with the pricing of this game. I urge you to not buy it at full price, let alone this pitiful discount.\n\nI highly recommend the game itself, but I don't agree with the publisher's greed. On top of all this, they barely even maintain the game, all patches have passed, and at one blip in time there was a online security flaw and they had to shut off the servers (prior to Elden Ring, they're back up now) and they still want full price (or -50% take it or leave it)\n\nUsed to be $15USD during sales from like late 2017-2021. Now it's $30USD during sales as of 2025, 9 years after release. GREEDY.",
      "voted_up": false,
      "votes_helpful": 555
    },
    {
      "review": "Okay first and foremost i do actually enjoy Dark Souls 3 and have hundreds of hours on consoles. However in 2025, not having cloud saves is a baffling and irritating decision. I play a mix of PC and Steam deck, so not having my saves transfer is massively inconvenient. Especially given that it is verified on the steam deck. I just wanted to leave this review as a warning.",
      "voted_up": false,
      "votes_helpful": 203
    },
    {
      "review": "Why is this game $80. Its been out for nearly 10 years and is still full price. $113 for the Season pass. What is fromsoft smoking with these prices.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "This is a good game. But there's some serious shoddiness here that leaves a bitter taste in my mouth.\n\nVarious achievements are bugged, have been since 2016, and wont activate for many people. There's also no steam cloud support, so if you ever uninstall the game or just want to carry on playing on another device like the steam deck, you're going to be copy around files buried in hidden directories and hoping you don't trigger the mysterious anti-cheat. \n\nIt's an old(ish) game now, so I expect some jank around the edges. But for the £40 they're still trying to charge, it's all pretty poor.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If it weren't for selling cs cases, I wouldn't even bother buying this game for it's current $30 on sale price. Crazy to think that at one point it was as low as $10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fix your game FromSoft. I can't even play this game without dropping frames on 1080p and I'm on a 4090. Such a poorly ported game. Better off playing on Playstation. Aside from that, the game is great.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Absolutely baffling port. Across multiple devices, I've had save data issues where it just vanishes and that's even worse off when you consider there's no cloud save. played all day yesterday just to boot it up again after plugging a new ssd in, and for whatever reason treated it like the games first ever launch. Bandai Namco has failed pc players a lot and this sadly is hard to recommend for that reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I absolutely love this game and would be recommending it any other time, but going back to play it recently the performance is suddenly significantly worse than its ever been before, borderline unplayable. I can't figure out anything to fix it. if you happen to be considering buying this game right now in 2025, I would hold off for now until this (hopefully) gets fixed. I've seen others saying they're having similar problems, but no one seems to know whats causing it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is currently too unreasonably priced, and a it is total price gouge.  I've own this game since 2020 when I bought the deluxe edition for $15.  It is time now for me to come out and to review this game.  Why?  I want to speak out against you readers for paying $40 (50% off) for this software rental.  My recommendation is for you to buy a cheap PS5 or PS4 and just play a used copy you can get.\nAs for why I've only played 50 or so hours, I have devoted more time for other games, including Elden ring, Dark Souls 1 remake,  Bloodborne game of the year edition, and to my two all time favourites:  Demon Souls and Dark souls 2.    \nDark Souls 1 and 2 had connected worlds.  This was a huge draw for me.  Dark souls 3's worlds are smaller and better designed. However, I was disapointed to find that you must go to the bondfire to go between worlds.  Sure, Demon Souls and Bloodborne are the same, but those are first installments of the game.  Here, we're talking Dark SOuls 3, where 1 and 2 had interconnected worlds.  No excuse.   If you must really praise this game for smoother combat, I would recommend that you dont' your time here, and just go play Bloodborne.  Cheers mate. Don't pay the sucker price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got the base game and DLC for half of the current cost something like half a decade ago. It's not worth £30 at this point lmao get fucked scamco",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really sad how they're letting this game go to shit. It keeps glitching and I am having cheater for pvp in the normal server. Dogs were acting like the Vietcong and dropping out of trees level of glitches. Sad I love this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Least favorite game of the series by far. Took a huge step toward being an full on action game in a bad way. Enemies got massive power creep in speed and damage but the player did not get the same scaling. This issue gets much worse in the DLC. Sadly all of the good level designs got left behind to, with this being one of the most linear games in the franchise. Not my cup of tea but maybe someone else will enjoy this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "bosses are great I guess, but the rest of the game is like wading through shallow slop. I recommend gitting gud at DS2 instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Frankly, never thought i'd give this game this review, but i cant really in my right mind TRULY recommend it I think, i feel that i am consistently punished for actively trying to engage with the game, figthing basic enemies and exploration are vastly worst than my experience with a game like dark souls 2. I feel it is nott an experience i find worth a second playthrough.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Stupid series, underwhelming and repetitive ideas. The whole last part of the game is the same enemies from the first level but....harder for some reason that is never visually shown. Makes you feel like wtf was the point of leveling to get here to fight *checks notes* a skeleton in armor..... This is after the Road of Sacrifice is just full of mobs that we will call uncommon. Other than the small crabs and bugs, every enemy is a damage sponge but can murder you with a stick....honestly looks like best weapon in the game. A sharpened stick gives this mob super armor, a charge attack, and a 270 degree hit box swing. Where is my slightly sharpened big stick run? Poor balancing, weak story, meh map design when compared with other titles",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If Miyazaki ever learns what enemy telegraphing is actually for he could make a pretty good game. He designs bosses like Niel Breen writes films. It's a real shame, everyone else who works there is clearly talented. Such a waste of FromSoft's money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game but in the year 2025 on windows 11 this runs horribly. works just fine on my xbox but keeps freezing and every time i lock on my screen is blocked with this visual test bug thats unfixable even after reinstalling.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really fun game to coop through, but a chore to play on your own. These are the most overly discussed games ever. But if for some reason you don't know enough about them to make an informed decision, here it is:\r\n- Buy this if you like all souls games and can't get enough of them\r\n- Play it with a friend, or engaging in multiplayer at every chance you get.\r\n- Do not pay attention to the story, it reads like bad Souls fanfiction\r\n- Restart as many times you want to get a build you have fun with. You're not gonna replay this too many times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only good boss was Demon Prince, the rest were either jokingly easy or just annoying af...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game, but the pvp is nonsensical. Why is there even pvp FromSoft? Focus on a better combat system instead of forcing pvp into a single player game.\nAlso, the forced full screen, no PlayStation glyphs, and no widescreen. Please up your game FromSoft. You can do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever, reseted my pc and lost everything, 200 hours and a new game+5 down the drain",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible awful frustrating game with bullshit mechanics and awful trash. probably goinjg to do another playthrough as a faith build.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When you going to run DS3 in 2025 at the first time\nRead this:\nIM not recommended to run DS at all IF you already run Elden Ring before.\nImagine that you have MacBook Pro 2025 or M5, then you turns on Macbook Air 2010 which one is actually is the PREVIOUS version of your device. Not the different, but previous. Which includes less comfortable, less capable, less frendly UI, less CPU, less SSD speed, less vibrant / crisp picture and ect,\nThe guys who wrota bout DIFFERENT games:\nFor example Sekiro was created at the zero point. All animations, assets, colours and ect. Everything in this game was created from nothing.\nBut HERE, Froms using the same animations, UI, materials and all from the previous versions.\nNothing to say about play this game in 2015.\nBut in 2025 it looks really BAD in ALL points, which has been improved or cutted off in Dark Souls 4. \n\nIF you re NOT run Elden Ring before.\nBetter buy Elden Ring and enjoy last version of \"your MacBook\".\n\nPS. \nDear Babazaki's team, i know that noone of you, devs, will not saw this text\nBUUT \nWHAT KIND OF RETARD...\nWhat kinda MORON slapped in an achievement calls \"Collect all the rings\"? \nI was a total dumbass grinding to snag every damn ring, but NAH, the achieve only drops if you hoover up ALL the rings THREE FUCKIN' TIMES...SAME goddamn rings! WHAT?!\nThree straight runs on NG+, NG++\nWhy the hell not just write what exactly needs to do: \"Collect every ring in base game, NG+ and NG++\" \nWhat kinda bullshit SCAM is this?! \nY'all could better dropped some sort of.. like: \n\"Collect every weapon in the game \"or \"Complete the game without use of any spell\" or\n\"Make a nodeath run\" the whole damn thing of this list its a tons of dope challenges that would makes no questions.\nBut some absolute clown drops \"Grab all the same rings three times in a row, in BG, NG+ and NG++\" masked by \"Collect all the rings\"\nMad?!\nThe absolute dickhead who cooked this up for a platina i hope demons in hell rail your ass raw, dunkin your skull in a cauldron of boilin of shit, rapes your wife by monster cocks and cum inside her bleeding pussy, and your kid's tiny penises melt off in Scarlet Rot. M o t h e r f u c k e r",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't like it. It's not a bad game, but as a story sequel or a knights sparring sim it wasn't what I was looking forward to at all.\n\nInitially stopped right after the swamp, already deciding it's not for me, I only came back to finish the main game to see if I'd change my mind. I didn't.\n\nIt's a mess in gameplay-narrative sense, it's convoluted, visually overdesigned, linear, feels like a fanfiction to itself, and doesn't respect materials & armors visuals-to-gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit fucking game, this might be the most overglazed game oat #killallcursedrottedgreatwood",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring ass rollslop I'd literally rather be playing squidward sword. can't even explore openly like in the first game you just move forward roll kill the next guy repeat I feel nothing while playing this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this might be the most overhyped piece of shit slop ive ever played. the bosses are mid as FUCK besides aw, pontiff, nk and soc. the enemies in the area are 7 lightyears harder than the actual boss half the time and the achievements are the most boring and soul consuming things. id rather watch my whole family get mutilated for the rest of my life before playing this shit ever again. if this is your favourite game you have the mental capacity of 3 aborted children.  ONLY good thing is wolfskirsche who helped me farm the covenant items. you saved me from playing this toss any longer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks you kill a woman and it questions your decision? wtf I payed money for this im done do not play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "FromSoftware: Fix DSIII stuttering \n\nFrame drops were not a problem during my first playthrough in 2018. I have since upgraded to a 9800X3D. After numerous patches, performance declined. How? That makes no sense\n\nI’ve tried to:\n-Enable VSYNC/Shader Cache - unlimited in Nvidea control panel\n-Set affinity in Task Manager (uncheck CPU 0; I also followed a suggestion to disable all even-numbered CPU cores, to no avail).\n-Disable “Device Association Root Emulator” under “Devices By Connection” in Device Manager\n-Disconnect bluetooth devices, plug in directly via USB\n-Set graphics settings to low/medium/high\n-Update drivers \n-Set Screen Mode to Windowed\n-Run DarkSoulsIII.exe in Windows 8 Compatibility Mode\n-Rollback on older patch\n-Disable/stop Windows Management Instrumentation\n-Disc usage under 50% (storage capacity at ~30% usage)\n-Install Proper PC Experience from Nexus\n\nFPS [i]still[/i] drops to 27 or 57 - usually in double intervals, seemingly at random (even while leveling up character, in menus or mid battle) \n\nCPU never exceeds 50°c or 20% utilization\nThis is the [i]only[/i] title i experience this sort of issue w/. How FromSoftware managed to make DSIII perform [i]worse[/i] over time is beyond me. No stuttering in Sekiro or Elden Ring so they clearly have [i]some[/i] idea how to program. This specific performance bug wasn’t a problem 6 years ago.. Now, there are numerous crash reports & similar performance related posts sited online 2023+\n\nEDIT: I found Nvidia driver 537.58, wired peripherals, disconnect bluetooth devices to reduce stutters\n\n[u]Specs[/u]\n9800X3D\n4070 \n32GB DDR5 Memory\nSamsung Evo 870 2TB SSD\nWindows 11 \n\nSide Note: Port Bloodborne. Hop off Sony’s wang - sales would do numbers",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Creative Bankruptcy: The Game\nThey fixed and unfixed many of the issues with Dark Souls II.\nThey kept power stancing, because it obviously makes sense to include that. They also added weapons which were made specifically to be used with both hands, like the Sellsword Twinblades and the Drang Hammers. But obviously, the coolest one is the Farron Greatsword. Its name doesn't make much sense considering that it's a dagger and an actual sword, but hey, cool, regardless.\nWhich is why it's so dumb that they made the player character mainly right handed, just like in the first Dark Souls. For example, holding an axe in your left hand makes you block, and you can only do a heavy attack with it. Meanwhile, if you have a shield in your right hand, you start punching with it. In Dark Souls II, your character is ambidextrous, however, sometimes you deal less damage with the left hand.\nAs for the story, areas, and story, the game tries its hardest to emulate Dark Souls 1, from the main quest to the ending, the boss designs, and the levels.\nCrystal Sage is just Pinwheel that's not too easy. Old Demon King is just Demon Firesage from DS1. Wolnir is basically Gravelord Nito, again, from DS1. Yhorm the Giant has to be defeated with the Stormruler, a weapon from Demon's Souls, used specifically to defeat the Storm King, a boss fight, that is actually really fun with a cool setting. Dragonslayer Armour is basically the Penetrator from Demon's Souls. Champion Gundyr could be a different version of Iudex Gundyr that the developers thought would be cool, but couldn't decide on which one to put in the game. Soul of Cinder is literally the the Burnt Ivory King from Dark Souls II's Crown of the Ivory King DLC. Same moveset, almost the same attacks. As for the DLCs, Halflight is, again, literally just the Old Monk from Demon's Souls with the same invasion gimmick (which is quite cool). Then Slave Knight Gael, who is a red Artorias.\nAreas: Firelink Shrine, same name and function as DS1, but a different setting. I like this version more. Farron Keep => Blighttown. Catacombs of Carthus => Catacombs from DS1. Irithyll + Anor Londo => Anor Londo. Grand Archives => The Duke's Archives. Untended Graves is funny because there's an extremely difficult out of bounds glitch where you can climb up backwards from Cemetery of Ash to reach the illusory wall to reach Untended Graves, but I think you'd get stuck as you probably can't enter the fog wall from the other side (at least in DS2 you couldn't do that), but if you drop back down you'd arrive in Untended Graves. Archdragon Peak is great, especially the Nameless King, I'd say he's my favourite boss. Kiln of the First Flame, same name as in DS1. Painted World of Ariandel => Painted World from DS1. So the pattern here is to evoke an emotion from the better designed game, DS1, by copying everything they can, but making them much smaller, and making them look just as terrible as they were in DS1, because of technical limitations.\nMore about the bosses (and the enemies), oh dear. It seems like they just tried to make them difficult for the sake of it. They all aggressively ambush you in hordes, as if this was Left 4 Dead or something. Two perfect examples of creative bankruptcy are the Deacons of the Deep and High Lord Wolnir. The deacons are just enemies spawning infinitely without giving you any room for movement at all, and the first stage of the fight is just some collective soul that you can only deal an exact amount of damage to. Then the second stage which is just a crowd crush simulator. Then there's Wolnir, a hard to reach boss with incredibly high defence, whose weakness are his bracelets. He may or may not spawn skeletons just to make things harder for you. Then there's the mist around him, which can make reaching the bracelet on his right hand challenging, because it pretty much instantly kills you. If he starts moving upwards, you're basically dead. Dragonslayer Armour can be pretty difficult by itself, especially because you're fighting on a bridge, and then for some reason the level designers also decided to put some monster in the sky to shoot at you during the second phase. Why? The rest are fine, I guess. It'd be silly to complain about attacks with weird timing. They're annoying, but they're fine.\nMagic works the same way as it did in Demon's Souls, meaning you have a mana bar, that you can refill with items (here, mainly the Ashen Estus Flask). I like this one more than the system in DS1 and 2.\nAs for armour, this is the only game in the series where you can't upgrade armour. Which is sad for cosplay builds, as now you have to choose between high defence or fashion. Meh.\nWeapon infusion also works the same way as it does in DS2, which I'm quite fond of.\nAs for PvP, there aren't really any OP builds like in DS1, but it's still just as unforgiving. Parrying is more difficult (with regular shields?) and rolling i-frames are longer. Parrying would be fine with latency, but dodging with server delay just makes fighting a nightmare. At least you can FINALLY invade without being embered/in human form. Thank GOD.\nOverall, this game is a bit of a disappointment for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its just a rather lazy bad port from console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "People find this gameplay fun?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lowkey such a buns game 5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how this became popular enough to end up with elden ring is beyond me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too easy for a pro player, 3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nice igra sinok shalavi\n\nnice igra sinok shalavi x2\n\nnice igra sinok shalavi x3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4th boss doesnt function as intended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bugged game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dark souls 2 if it was bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like being violated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO STEAM CLOUD SAVES",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "eat dik",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "rollslop.exe",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}