{
  "positive": [
    {
      "review": "DO THIS BEFORE THE GAME UPDATES!  If Bethesda does the Anniversary update for this like they did for Skyrim, just open steamapps - click appmanifest_377160.acf - right click - Properties - set to \"read only\" - apply - close and keep playing your game. Did this for the last update and Skyrim until the dust settled, keeping an eye on the reviews. \n\nUpdate - 11/15 -  For those on PC and got the update and need to get the previous version back, there is a Downgrader mod on Nexus - https://www.nexusmods.com/fallout4/mods/98059 - Make sure to check the requirements depending on the version you want to go back to.\n\nUpdate - 11/24 - For those watching the Updates/Patches, they \"should\" be done around Mid December. Wait until ALL Patches drop and are....PROVEN....to be stable before doing anything. Personally, I don't expect this debacle to be done until early next year. This is Bethesda....there are no gurantees....",
      "voted_up": true,
      "votes_helpful": 1521
    },
    {
      "review": "Game itself is amazing, I´d imagine most people have already played it long ago as this game had released 10 years ago. \nBut if you haven´t played it and are thinking about getting this amazing game, whatever you do DO NOT GET THE ANNIVERSARY EDITION. Get game of the year instead.\n\nAnniversary edition just gives you some \"creation club\" items, I say some because 80-90% of them are JUST SKINS and different colors for your pip-boy, power armor, clothes and weapons.",
      "voted_up": true,
      "votes_helpful": 238
    },
    {
      "review": "WOW! Anniversary upgrade for 53,49$! :'D Please don't support this, this is the reason videogames are so expensive now. Unbelievable. \n\nThe base game, with GOTY, is enough, and very worth it. i have GOTY and its still 53,49$ to upgrade. Dont bother upgrading, just play the base GOTY. Trust me.",
      "voted_up": true,
      "votes_helpful": 638
    },
    {
      "review": "Really good game, IF Bethesda stops updating it every once in a while for absolutely no reason other than to break the mods that are keeping the game alive and relevant.",
      "voted_up": true,
      "votes_helpful": 65
    },
    {
      "review": "It's shallow, poor writing, dumbs down all RPG elements that made fallout amazing, yet still manages to be engaging, fun and a game I'm happy to have sunk hundreds of hours into",
      "voted_up": true,
      "votes_helpful": 95
    },
    {
      "review": "the only game where you leave your son for 200 hours because you got distracted building a settlement made of trash.\nThe world is fun to explore, the dialogue is… questionable, and every Super Mutant seems legally obligated to scream at you.\n\nDogmeat is the real MVP.\nPreston Garvey will never stop needing your help.\n\n9/10 — Another settlement needs your assistance",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "The Updates that Bethesda are releasing seem to be doing more damage than the bombs the Chinese dropped on Boston in the main story of Fallout. Kinda wondering who's the actual enemy of the story as time goes on, was it really Capitalism all along?\n\nJokes aside, Fallout 4 up to GoTY Edition is a fantastic experience, anything past that version (specifically Anniversary Edition) just becomes paying for content that's available on the internet for free. But hey, the choice is yours and I personally enjoy making sure what I'm paying for is worth the price tag.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "💔 Fallout 4: A Review from a Retired Steward\nPlayed on PC | Modded via Vortex | Over a decade of Bethesda loyalty\n\nFallout 4 once stood as a beacon of open-world immersion — a place where modders, storytellers, and digital stewards could shape their own wasteland. I was one of them. I built settlements, rewrote systems, and watched the community breathe life into a game Bethesda had left half-finished. But today, Fallout 4 is no longer a sanctuary. It’s more of a storefront.\n\n🧱 The Foundation Was Strong\nThe Commonwealth was rich with potential.\n\nThe S.P.E.C.I.A.L. system offered deep customization.\n\nModding tools like F4SE and UFO4P turned a an unyielding stiff and unforgiving mess into a playable masterpiece.\n\nVortex gave me clean control over my load order and workflow.  For others, it was MO2.\n\nFor years, I made Fallout 4 my own. I documented breakthroughs, benchmarked mods, and helped others navigate the chaos. It was never perfect — but it was ours.\n\n🧨 The Fracture: Anniversary Edition\nBethesda’s decision to release a paid Anniversary Edition in 2025 shattered that trust. Instead of honoring the modding legacy, they broke it:\n\nScript Extender compatibility destroyed\n\nModding tools rendered obsolete overnight\n\nLocked in improvements — a method of monetization (I said this with a bit of anger and resentment.  I'm willing to admit when I haven't been fair.)  Some are enjoying the Anniversary Edition mod enhancements.  Some complain of game breaking situations and crashes, but my guess would be they are talking about already modded installs and F4SE will break your game if the version number changes.  This update changed it big time, and you can count on continued updates along the way as new Creation Club content is added–JUST LIKE SKYRIM SE did and here's the thing:\n\nSkyrim SE still survived and the modding community still rallied around it and thrived.\n\nNo, they didn’t consult the player community, but some modders were consulted. They didn’t warn us. They simply pushed an update that disrupted workflows, broke load orders, and forced modders to scramble. It didn't seem like much of an upgrade, but I can't honestly swear it wasn't.  Some players like these new mods that were added and some complain they can't get the game to launch.  Whose fault that is–the player who modded their game and didn't remove the mods or Bethesda that released the executable update with a desktop breaking but–I can't really say.\n\n🧠 A New Vision That Doesn’t Include Us\nBethesda and Zenimax have made their direction clear: they’re chasing a new generation of players who don’t know what came before. They’ve chosen monetization over stewardship. Paid mods, TV tie-ins, and shallow updates have replaced the deep engagement that once defined their worlds.\n\nI’m not angry. I’m exhausted. My breath feels wasted on a studio that no longer listens. Fallout 4 was once a canvas. Now it seems more like a billboard.  Like I said, \"it will go on.\"  Some modders will adopt the new Creation Club until they realize the only mods actually being used from all of their hard work are either the ones bundled in the Anniversary Edition who Bethesda already paid for, things that can be found on other sites for a more modest fee or no fee at all.\n\n🛡️ The Pause\nI’ve removed Fallout 4 from my system 2 days prior to the release of the Anniversary Edition knowing pretty much any mods would break the new one. I won't be trying to mod Fallout 4 for some time because it will take quite a while before mod authors decide what they wish to do.  Maybe I’ll return someday but I will probably try the game as is. If the community rebuilds, I will celebrate with others. But for now, I mark this moment as The Steward’s Pause.\n\nFallout 4 was a masterpiece in the hands of its players. Modders were responsive to the players and gave them what they wanted.  Bethesda took Fallout 4 back — with a $20.00 USD price tag.  I'm recommending the game because of the level of nostalgia it brings me in the Wasteland.  Since I have the option to add the Creation Club content or keep the Game of the Year Edition, I prefer to choose which mods I install and don't.  That's a personal preference.  Everyone else will have to go with their own.",
      "voted_up": true,
      "votes_helpful": 150
    },
    {
      "review": "Build PC for Fallout 4 modding\n\nDownload Wabbajack\n\nDownload 1tb worth of mods\n\nPlay for one hour and never touch it again\n\nRepeat every year",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Vanilla game is okay but you get the most out of it when modding it. Story wise, it's subpar when compared to other Fallout entries",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I commend the modding community for keeping up with Fallout 4, however Bugthesda can rot. I would not play this game if it didn't have the ability to mod any aspect of it. Case and point.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "BETHESDA!!!!!!!!!!\nYou're killin us with these ridiculous \"updates\". Leave a truly great game be. You want to get more money into your greedy hands, develop a new game like a sequel or something. But stop destroying games that are actually worth us investing our time into.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Originally played it on Xbox, had to buy it once i got steam and saw it on sale would have bought it either way, what I'm trying to say is would buy again since i bought it twice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game overall, hoping it gets a remaster at some point.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good job on buying the game, general. but a settlement needs your help. check your map for the location. \n\nyou can build settlements while neglecting the need to find your son in this desolate wasteland while having the ability to shit on any npc with the funniest sarcastic dialogue options known to man in gaming.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Managed to snag game of the year version for less than 10 buck, was lil clunky on my old win 10 laptop before next gen. Before I would've recommended it then. However, the anniversary had it from clunky to nearly unusable now. \r\nIf you have a new laptop it should run smoother than mine. At this point I only recommend it for memes and as proof of how clunky it is right now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A Commonwealth Reborn: Reassessing the Strengths and Weaknesses of Fallout 4\r\nAbstract: This paper offers a contemporary review of Bethesda Game Studios' 2015 action role-playing game, Fallout 4. It argues that despite valid criticism, the game represents a significant evolution in the series through its refined combat, deep crafting systems, and the groundbreaking Settlement feature, which fundamentally alters the player's relationship with the post-apocalyptic world. However, this praise is tempered by a critical examination of one of the game's most persistent technical shortcomings: the excessive reliance on loading screens, which frequently disrupts immersion and the flow of exploration.\r\n\r\nIntroduction: Into the Wasteland, Again\r\n\r\nUpon its release, Fallout 4 was met with the unique duality of critique that often greets massively ambitious sequels. It was simultaneously praised for its leap forward in gameplay mechanics and criticized for perceived simplifications in its RPG elements. Years removed from the hype cycle, this review posits that Fallout 4’s enduring appeal lies not in its faithfulness to a purist ideal of the genre, but in its successful execution of a new, more visceral and player-driven vision for the wasteland. It is a game that trades some narrative nuance for unparalleled environmental storytelling and systemic depth, creating a playground that continues to captivate players long after the main quest concludes. Yet, this experience is consistently punctuated—and sometimes hampered—by a frustratingly archaic technical limitation.\r\n\r\nThe Refined Art of Survival: Combat and Crafting\r\n\r\nThe most immediate and impactful improvement in Fallout 4 is its combat. Moving beyond the serviceable but clunky shooting of its predecessors, the gunplay now feels weighty, responsive, and genuinely satisfying. Weapons have a tangible impact, and the Vault-Tec Assisted Targeting System (V.A.T.S.) has been smartly reworked. Instead of pausing combat entirely, it now slows time, creating a more fluid and dynamic integration of strategic targeting and real-time action. This modernization makes encounters with the Commonwealth’s myriad dangers, from feral ghoul swarms to the imposing might of a Deathclaw, more thrilling and less a battle against the game’s own mechanics.\r\n\r\nThis combat excellence is married to a deep and rewarding crafting system. The \"junk\" that was once merely a source of caps is now a vital resource. Every desk fan, hotplate, and piece of duct tape can be broken down into components essential for weapon and armor modding. This system creates a powerful feedback loop where exploration directly fuels character power. Finding a rare laser rifle is no longer the end goal; it is the beginning of a project to customize it into a unique instrument of destruction, tailored to the player’s specific style. This layer of personal investment in one's gear is a masterstroke, making the player's progression feel earned and deeply personal.\r\n\r\nBuilding a Legacy: The Settlement System\r\n\r\nPerhaps Fallout 4's most significant and innovative contribution is its Settlement system. This is not a mere side activity; it is a fundamental recontextualization of the player's role. You are no longer just a tourist in the apocalypse, looting ruins and moving on. You become a catalyst for rebirth. The ability to clear, secure, and build thriving communities across the Commonwealth is a powerful fantasy.\r\n\r\nThe system, while occasionally finicky, offers staggering depth. Players can construct elaborate multi-story structures, establish defense networks, cultivate food, and manage supply lines between settlements. This transforms the world from a static backdrop into a dynamic canvas. A dilapidated drive-in becomes a fortified trading hub; a lonely island is turned into a self-sufficient fortress. The system creates emergent storytelling, where a settlement’s desperate defense against a raider attack becomes a memorable player-generated event. It provides a tangible sense of purpose beyond the main narrative, making the player’s mark on the world permanent and visible.\r\n\r\nThe Immersive Sim of Environmental Storytelling\r\n\r\nWhile the dialogue system and main questline have been points of contention, Fallout 4’s world is a masterpiece of environmental storytelling. The Commonwealth is a character in itself, dense with untold narratives waiting to be discovered. Bethesda’s expertise in crafting poignant vignettes is on full display. A skeleton clutching a wedding ring next to another in a bathtub tells a tragic story without a single line of codex text. A hidden bunker filled with pre-War supplies and a final farewell note on a terminal provides a moment of quiet humanity. These moments are everywhere, rewarding curious players with pockets of profound narrative depth that are often more compelling than the central plot. The world feels lived-in, scarred, and quietly yearning for the hope that the player can ultimately provide.\r\n\r\nA Harsh CritiQue: The Tyranny of the Loading Screen\r\n\r\nFor all its ambitious steps forward, Fallout 4 is anchored by a glaringly outdated technical flaw: the excessive and frequent loading screens. In an open-world game whose greatest strength is immersion and seamless exploration, the constant interruption of loading is a significant detriment.\r\n\r\nThe problem is twofold: frequency and duration. Entering nearly any interior cell—be it a major faction headquarters or a small shack—triggers a loading screen. This design choice, a holdover from the game’s Creation Engine roots, creates a pervasive sense of fragmentation. The desire to quickly pop into a building to sell loot or complete a task is stifled by the knowledge that it will involve two separate loading interruptions. This \"door-to-wasteland\" loading breaks the rhythm of play and serves as a constant reminder of the game’s artificial boundaries.\r\n\r\nFurthermore, the length of these screens, particularly on base hardware at launch, could be egregious. Wait times of 30 seconds to a minute were not uncommon, turning a simple errand into a test of patience. While solid-state drives in modern consoles and PCs have alleviated this issue significantly, the fundamental design remains. In an era where other open-world titles were seamlessly streaming vast landscapes, Fallout 4’s reliance on this archaic method feels like a stubborn anachronism that actively works against its core strengths of exploration and immersion.\r\n\r\nConclusion: A Flawed Masterpiece of Player Agency\r\n\r\nIn conclusion, Fallout 4 is a game of profound contrasts. It is a title that soars on the strength of its systemic gameplay, offering a refined combat loop, a deeply engaging crafting and modification system, and a revolutionary Settlement feature that empowers the player like never before. Its world is a dark, beautiful, and heartbreaking tapestry of environmental stories.\r\n\r\nYet, it is undeniably hampered by its technical legacy. The overabundance of loading screens is a persistent thorn in its side, a recurring interruption that undercuts the very immersion it works so hard to build. It is the single biggest argument against the game’s otherwise stellar design.\r\n\r\nDespite this critical flaw, Fallout 4’s positives ultimately outweigh its negatives. It succeeds not as a perfect RPG, but as an unparalleled simulation of post-apocalyptic life. It gives players the tools to define their own experience, to rebuild, to explore, and to carve out a corner of the Commonwealth to call their own. It is a messy, ambitious, and deeply rewarding experience whose heart—the joy of building something new from the old world’s ashes—shines brightly enough to make its frustratingly frequent loading screens a burden worth bearing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good RPG in the fallout universe with the usual Bethesda jank. Mod community haven. If only Bethesda would stop breaking it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 4 kinda lacks plenty of the things I loved seeing Fallout 1, 2 or New Vegas do, but it's honestly fun enough on its own merits that I take it for what it is. Good game. If you play any Bethesda/East Coast Fallout, I see no better choice than this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had my fun with it. Looting, building gameplay loop will keep you hooked for a bit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Without mods = Fallout 4\n\nWith mods = Skyrim\n\nFucking piece of shit = Starfield\n\nBethesda Classic ahh",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hated this game at first, the mechanics and controls feel wonky. But once you get used to them, it becomes a genuinely great game that’s absolutely worth your time.\r\n\r\n9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can’t believe it’s been 10 years already. I first played Fallout 4 on my PS4 back in 2015 yeah, it was buggy as hell, but somehow it always stood out for me. There was just something different about it.\n\nI’ll never forget the first time I stepped into wasteland… that feeling of excitement and wonder was unreal.\nAfter all these years, Fallout 4 is still one of my favorite gaming experiences ever. \n\nHappy 10th anniversary, Fallout 4. You’ll always have a special place in my heart. ❤️",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The anniversary \"edition\" is nothing special and a complete cash grab compared to the GOTY edition. Devs need to actually develop something that makes a re-release valuable. I do recommend the game but do not buy the anniversary edition. GOTY +download the mods direct instead of leasing them through Bethesda for an extra $20.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Well you see my \"played\" hours. a lot of them were just from building stuff. This is one of the best games made and with mods its even better. If you liked Skyrim this is better than skyrim..yeah i said it!.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, bad practices. \n\nIdk if it's Bethesda, Microsoft, or both. Get this on a discount 100%. Just, 20 dollars for ancient creation club content, or 40/60 for the whole thing eeeh\n\nEdit: They actually fixed it so now the mods and creation stuff aren't breaking, but their price gouging is still goofy. Still get on discount heavily. For actual review stuff tho-\n\nStory is shallow but it's not the worse, a brain off kinda adventure which can be fun but you'll definitely see the twist coming long before it actually happens lol. Most the good/great content is adventuring on side quests and being a post-apocalypse settlement manager building things. Gameplay and gunplay feel fun enough (If you're like me then some mods are an absolute must like having the bolt action rifles having the receiver on the proper right hand side lol) and the power armor is genuinely kick ass but bring enough of a difference where some people feel using it unnecessary which is totally fine. The companion system is pretty alright overall, they port next to you more frequently when needed and feel always there till you dismiss them. Wouldn't say it's an improvement from another highly acclaimed fallout game, but it works well enough\n\nSome stuff in this feel really half baked though, and would heavily encourage looking through mods be it the in-game mod menu (recently merged with creations) or nexus. If nothing else, for quality of life improvements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Big part of my life is Fallout, despite the upgrade issues which I am sure they will eventually fix I recommend this game.  Overall worth it for yourself and a gift for a gamer,  Steam keys can be found cheaper online if you search around.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "YO WHERE IS THE PIP BOY APP SETTING IN THE GAME MENU. first they took the app off of app stores but luckily i still had it installed on my phone. I wanted to get on there to try and play it and thought i was gaslighting myself because i couldn't find the option in the menu to enable the pip boy app. Its literally just GONE. The app was one of the best features about revisiting the game in the modern day because of how it enriched the gameplay for people who aren't crazy about modding and like to achievement hunt. I don't understand why they felt it neccessary to change anything about a 10 year old game. There is no online features and it already worked. Please stop touching the product that we already payed for. And if you are going to do that, implement features that have been tested to a place where massive experience breaking buggs aren't introduced. Or honestly not at all. Im not looking for bethesda to add to the coding soup that is the files for this game anymore. The pip boy app was nice and something that worked like a charm first try with little to no setup when i tried it a little over a year ago and i though it was cool that they thought of doing something like that for there fans and didn't even feel the need to charge. It felt a really good addition to the pre existing content and suffered ZERO TECHNICAL ISSUES which was a crazy breathe of fresh air. But here we are, why. WHY R WE HERE RN BETHESDA PUT THE SETTING BACK. please",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "can bethesda just stop updating this game, i would like to be able to play it for more then a week before it decides to wreck my mod list",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like blowing up bandits in the wasteland and killing lots of people this is a fun game, story is alright. The dog is pretty cute too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hated this game when it first came out, a decade later and I'm obsessed. Think I was just a miserable little fucker back in 2015.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mindless game.\r\nextremely casual post war game.\r\njust ok everything, shooting, UI, music, open world.\r\n\r\nstory is meh. idc. really boring. \r\n\r\n\r\nonly good thing is the radio. \r\n\r\neasy to dump hours into.\r\n\r\nmight mod the character models later.\r\nbecause bethesda hates pretty people.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I still recommend this game for the wider audience, but true fallout fans also realize its kinda slop in a lot of departments. A lot of the systems were dumbed down, but hey its modern Bethesda. My biggest gripe was the DLC, mostly just settlement stuff, and two actual stories.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A game you can always return to and still have fun.\r\nI like being able to build stuff and create settlements.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Fallout 4 really shows you what the Commonwealth is made of. Step outside that vault and you will see a world that is hurting, sure, but you will also see people who have not given up. That is what pulled me in. Everywhere you go, someone needs a hand, and when you answer that call, the whole place starts to feel a little less hopeless.\n\nThe settlements are the heart of it all. Some of them are barely holding on, just a few settlers trying to make it through another night. Others are crawling with raiders or worse. But once you clear the threats and put up some defenses, folks start to breathe easier. Build a few beds, plant some crops, set up clean water, and before long the place begins to feel alive again. Watching a settlement grow from a wreck to a real community… that is something worth fighting for.\n\nThe rest of the Commonwealth is dangerous, no doubt, but every safe corner you carve out brings us one step closer to a future people can believe in. That feeling, that sense that you are making a difference, is what makes the journey so rewarding.\n\nIf you are willing to stand up for people who cannot do it alone, this game gives you plenty of chances to prove it. The Commonwealth needs you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game and mod community are amazing, Bethesda though? On a downward slope unless they get it together and stop updating decade old games that don't need updating.\r\nFallout 4 (NOT AE) 10/10\r\nMod community 100/10\r\nBethesda 4/10 unless they magically get it together.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fallout 4 is a great game i still remember the first time i played through it and beat it on my xbox. then i instaled mods and creations it was so fun and it still is i just need time to play it with mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Looking past the recent update fiascos I've always been a Fallout fan, and I've enjoyed playing and modding, and making mods for Fallout 4, and will continue to play, I recommend the game for anyone that wants their game to be something their own, or just a huge Fallout fan",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "never knew such a fancy environment could be so dull by tedious combat and brain dead story/writing in comparison to fallout 3 & fallout nv\r\n\r\nkys bethesda",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its the year 2025 and this game is still getting regular updates that wreck all my mods. \r\n\r\nGreat game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bathesda: \"Let's make a great game that's relatively easy to mod so players have infinite replayability to the game.\"\nAlso Bathesda: \"Let's lump together a bunch of mods that people could basically download on nexus for free and market it as an update on the game that we made a decade ago for quick profit since we can't seem to get there withe either FO5 or the elder scrolls.\"\nMe: \"Imma just play cyberpunk till you asshats gigure this shit out.\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's an old game but still has more content and variation than new releases. Looking forward to Fallout 5",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, many more hours played on console, still for me one of the best open world survival RPG games out there...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well so far I played 861h. Do I recommend it? \r\nIt's probably worse Fallout game. I played 861 hours. Plot was known before game came out. If it wasn't everyone above 60 IQ could guess what the plot twist is. \r\nI miss old Fallouts. I still played 861 hours.\r\n\r\nGraphics are from another era. At least that's in common with Fallout 1, 2, 3 and NV. I've installed about 50 mods to improve graphics... It's still miles away from e.g. ME: Andromeda which came out about the same time (+2 years).  God damn Witcher 3 came out the same year, compare it to that. Arkham Knight came out the same year. God damn Bethesda, if you are holding back on graphics at least give us playability and stability of your games. \r\n\r\nGod damn, install as many mods as you can as I do... and if you love Fallout (as I do) then it's something you will moderately enjoy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didn't know much about this game prior to playing (in which I owned through my steam family) besides having watched a bit of the show and that this game was made by Bethesda. I am a hardcore Elder Scrolls fan and since fallout is made by the same group, I thought I'd give it a try...\n\nI LOVE THIS GAME. THIS GAME IS BETTER THAN SKYRIM.\nDude, for real, this game checks all my boxes for a good new player experience. From the weapon/armor building to the stealth mechanics, I am absolutely in love. I have only been playing for four days and decided to buy the DLC bundle today. PLEASE PLAY THIS IF YOU LIKE SKYRIM!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "To this day Fallout4 is one of the greatest games ever created. Fo4 still has one of the best maps of all time, with extremely rewarding exploration, addicting adventure, and even beauty in the 210 year old wasteland. Fallout4 truly shines as being a huge open world post apocalyptic semi survival game. The introduction of base building is one of the greatest additions to the fallout universe. Not only base building, but the addition of looting, scavenging, and dissembling THOUSANDS of items for materials to not only build and decorate, but to craft mods, weapons, armor, and more. These 2 changes that came with Fo4 changed the direction of fallout forever, and for the better! Immersive, addicting, satisfying, rewarding, and FUN! These are the words I would use to describe Fallout4. Fallout 4 does not forget its a videogame and is nothing but enjoyable. Fo4 is a jack of all trades. A master of none, but great at everything... Which is still kinda untrue as it masters exploration.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game itself and the many mods that push it even further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the new patch keeps on crashing my game because every single time i try to play it, it just loads up a black screen. And before you say wait for it to load, i've been waiting it just doesn't load pls try to help me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY fun and a good way to pass the time, I love the story. as a matter of a fact I LOVE fallout 4 (and piper)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE DA GAME!!!!!!!!!! bethesda please stop patching glitches there fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is not the best fallout, still crashes a lot had to dumb down setting. DO NOT try to stream the game on discord, it will either crash the game or crash your discord. Overall 7.1 out of ten for gunplay, combat is good, DLC are great (must try Nuka World and Far Harbor). Creations has some fun add on's as well. New Vegas will always have it for me as the best Fallout though. Older game but story wise and overall gameplay is much better in NV, if this is your introduction to Fallout then you picked a good place to start due to how easy it can be at times. Give it a whirl I guess, pick it up if its ever on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great fallout game if you work long hours, because the plots are very simple and you don't come back after a week or two of inactivity and load up a save where nothing makes sense anymore.  It may be a cashgrab these days and lack some of the nuance of earlier games, but it's also solidly fun and easy to come back to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it the best narrative in the series? No.  \n\nHave some of the RPG elements been lobotomized? Yes.\n\nHas the the charm of the dark commentary on \"human\" perspective fled away? Yes.\n\nHowever..... There is no fallout game that lets me go from drugged up lunatic in a matrix larp clearing ten feet verticals just to bonk a mirelurk queen on the head with a jet powered sledgehammer, to becoming an evil professor pumping out war machines and destroying the drug economy in Boston with an industrialized drug trade. \n\nThe game has flaws. As a massive Fallout Nerd I can recognize this, but by god it is still one of the most fun fallout experiences one can have if you like action, oh and super super super addicting base building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definite slow start, but once you're in the meat of the game it's very fun. also surprisingly in depth, with a lot of detail in places you wouldn't expect. Absolutely worth nabbing if there's a sale, just stay away from any Enclave on the map, they're bloody lethal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good great lags and bugs, i love bethesda's games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout 4 is probably the best game i have ever played, i just got it on my Steamdeck OLED and Dang...I love it so far. I would recomonend getting the DLC's too, for me the game and DLCs only took me around 80 hours when i was playing it on my XBOX but  thats only because i have a rare diesese called Speedrun Syndrome but, The game is acctualy acctualy alot longer, you have the main story which most can get in 30 hours, then all the side quest is about 100 hours, then DLCs are probably around 50 hours. If you want a good game BUY THIS!!! Let me list some more reasons why the game is worth every penny, all of the time in youre life, and everything else.\n\n1. Fantastic lore\n2. 100s of hours of gameplay\n3. Relaxing (in my opinion)\n4. \"War Never Changes\"\n5. Piper and Cait!!!\n\nMake sure you get all the DLCs once you beat the base game, get mods (there is no in game mod menu), and play for hours and hours!!!\n\n\nHugs and Kisses\n-itchy toes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game.  It's like 10 years old and people still buy it, still pay $40-$50 for the game and the dlc bundles.  And this isn't like the Sims where not having a dlc really limits the enjoyment you can have.  If people are willing to pay that for a 10 year old game, that should tell you everything you have to know.\r\n\r\nSpecifics - unlimited replay value, in each run through you can burn through the main story or spend an infinite amount of time.  Random encounters, sandbox settlement system, pretty deep weapon/armor mod system, ridiculous amount of side quests, ridiculous amount of player builds for varying character build styles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have well over 1000 combined hours between Steam, PS4, and Xbox. Great game despite more recent Bethesda flops. Once you complete it vanilla, I do highly recommend mods when they work or are updated. And despite some backlash, creations are a good way to add content outside of Nexus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the goat game; amazing story and good gunplay really shows the greatness of fallout seires",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a very-long-term resident of Massachusetts and an ardent fan of role-playing games, I heartily recommend this game. The number of activities you can engage in is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jeez, it's been a decade. I still don't like the fact that you can't disassemble firearms into their constituent components, but you can un-boil leather.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish it would let me leave this on the anniversary bundle page. I already owned all of the DLC and all of the Creation Club content before this bundle came out. There's NOTHING wrong with the content. It's Bethesda. Their mod manager hasn't been updated since it was posted, and the installer puts f4se in the wrong folder. That's why so many people are saying the anniversary bundle broke their game. Also, when you install f4se you have to use its launcher to start the game or nothing will work. Hope someone sees this...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Teh best part of this game is the fact that you can play it over and over again and depending on the decisions you make will lead you and the game in different directions. The game never feels the same as the game before, even though it is efectivly the same game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like games where you loot, shoot, and upgrade, then this is the game for you. Its graphic are still peak, the gameplay is still peak, this game will not age.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perhaps Bethesda's last \"great\" single player game! Also, hard to believe it is already 10 years old! :O As some critics have observed, Fallout 4 is not a traditional RPG, but rather an 3D action game with both 1st-person shooter and role-playing game elements, an \"AFPSRPG\" if you will. :D But what I love most about this game is the dystopian alt-reality world-building of Fallout 4. I drop in regularly just to immerse myself and re-explore the detailed and haunting environments of the New England Wasteland and, especially, the Far Harbor DLC (easily the best FO DLC and quite possibly the best Bethesda DLC ever!). What a treat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to run around in a post apocalptic time lots of creative things going on very interesting and the GRAPHICS ARE AMAZING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but the new update fix's are not good. Had to downgrade the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where to begin... Fallout 4 is complicated. On its own, the base game, is lacking at worst and mediocre at best. \n\nThis game does some things right and many other things wrong, yet there is a cavoite that makes this game fantastic and a blast to play that ill get to later. First the positives. I personally really love the art design of this Fallout, whoever designed the textures and models for the non npc and player assets  was thinking outside the box while still giving it that Fallout feel yet how they implemented it was problematic. This Fallout has a more scifi feel then the other titles rather than the grittier more rugged vibe of the previous two games. \n\nThe Commonwealth is massive for a game that came out in the mid 2010's and exploring it is an enjoyable experience. This game has great Dungeon design. The gunplay is fun in the early and mid game all be it very problematic in the very late game with  scaling issues for npc health where npc's become bullet sponges. The Weapon modding system is neat, was a nice upgrade from the past games. Settlement customization is a fantastic and enjoyable addition, yet has a learning curve and time management issue to it. If you put time into designing your settlements its quite extraordinary how you can formulate the development and character of them. More on settlements later its a great addition to the game.\n\nNow on to the Negatives of the Basegame. The story, while having good ideas and a plausible themes about technological advancement with what constitutes the definition of sentient life is terrible written. Emile's (the lead writer for the base game) writing design philosophy for stories of \"keep it simple stupid\" really holds the writing, character development, and story behind from work that feels like a shallow mess. New Vegas and 3 where you can see the deph and passion in the writting and story is non existent in the base game because it lacks complexity. Nothing against Emile personally, I'm sure he is great game design writer when he wants to write something complex which contains depth with proper pacing and not simple and dumbed down for the sake of not adding to much hourly content from the game.\n\nSo yes, the Story for the base game sucks do to the simplistic and dumbed down version of the writing and quest design. Same can be said for a lot of the quest writing. The new factions in theory are conceptualized but are horrible executed in practice with rushed, simplistic writing. Same with the characters and companions, so many great ideas, so terrible executed for the sake of scrunching the writing. Main, Side, and Faction, quests suffer from being great ideas terrible executed. That goes for the whole writing for the entire base game.  The Companions are the best part of the main game story wise, there is some meaningful character development from the majority of them. Though some companions feel like they have personality disorders. \n\nThe RPG elements have been incredible neutered in comparison to New Vegas. It's is especially apparent in terms of tackling quests. RPG Dialogue options are inferior to New Vegas with almost everything being replaced with a flat charisma check pass rather than basing things on other stats. The body textures and gun models are abysmal, the design of pipe weapons and the assault rifle are exceptionally terrible. This game is buggy (as is all Bethesda games) and the precombined system was generated in a way that can kill your fps by ten frames on some systems do to bad optimization. Their is also the Nvidia debris crash problem.... Get to that later. \n\nSo yeah the Base game is mediocre 5 out of 10. With RPG elements, quest design, story writing, and dialog really lowering the score with how they overlap.\n\nSo why do I have almost 900 hours in a game that's just mid. That's the thing, the base game is mid. \n\nNukaworld is a neat DLC with somewhat interesting characters, a decent story line with quest design that actually plays into rpg elements outside charisma, new mechanics focused around settlements, and great raider rp which was  missing in the base game. Nukaworld like the Commonwealth is fun to explore, some of the side quests are interesting, with the factions actually feeling somewhat well executed. The weapons added in this dlc are fun and wacky. The problem is the simplistic writing structure that the base game has that leaks over into this dlc, again Emile. This dlc doesn't offer much for good karma playthroughs except new places to explore as all the prior things mention require bad karma actions including the settlement mechanics. Your going to get gotye for a reason ill mention later.\n\nNow the Far Harbor dlc is great, best dlc for the game. Beforehand I mentioned when it comes to the story and the writing that it could best be described as great ideas terrible executed? This dlc doesn't have the terrible executed part. The characters actually feel like real people in the post apocalypse. The factions are well implemented with characters that are interesting . Their is rpg choice in dialogue, as well as rpg choice in tackling quests. Far Harbor is well designed from a content standpoint. It expands on the story of one of the more likeable companions in the base game, and adds a memorable companion who feels like a real person with an interesting story. The weapons it adds are cool. Get The DLC, its a reflection of what the base game could have been with better design choices from upper management.\n\nThe dlc's bump up the score from 5 to 6.5 automatron just adds a quest and some interesting mechanics get if you want it if you like robots.\n\nNow, to the reason why this game is worth getting in 2025 and why I have almost 900 hours in this game. The mods. Bethesda games has the best modding community out there second to only Rimworld. Fallout 4 probably has the second best modding community ever in the history of gaming. Want to rebalance, redesign, and reconceptualize the factions? There are mods for that. Want new engaging mechanics that level and advance with progression of the game? There is a lot of mods for that. The most horrible designed and executed faction in the game the Minutemen, can become the best designed with the most engaging mechanics with mods from Nexus.  Want an alternative way to go through the main storyline that adds fun and engaging ways that new fun characters? There is mods for that. Well designed quest mods that utilize rpg stuff there are mods for that. Bugs, precombine issues, and that crash problem with Nvidia GPU's, get a mod for them. Ill name same of my favorites here in order.\n\nSim Settlements 2 with it's chapters, extensions, and Addonpacks, is my personal favorite. Are you tired of spending so much time on building up your settlements? Do you feel it takes time away from your exploration? Do you wish there was a whole other more extensive, well designed, well written, engaging, main story questline that has intriguing characters, great side quest both big and small, with exceptional voice acting and writing that surpasses the base game? Get SS2, it adds so much to this game. Too much to mention. This modd adds loads of new mechanics surrounding settlements. You may be saying, well, I don't like settlements and rather be exploring and enjoying quests. Fine get Rise of the Commonwealth for SS2 and all the Cityplan packs you can fine, place down a city planners desk assign a mayor to it, choose a city plan you like based of the description and watch your settlement progress in 4 stages from foundation to level 3! It takes less than 8 minuets per settlement on a decent pc. Do it, even if you never touched settlements before, do it! The questlines are fun, do it if you don't care for settlements. This mod is more than a dlc its somewhere in between expansion and a game remake in some ways.\n\nMods turn this game from 6.5 to an 8.9. Get the Storywealth Collection on Nexus if your new to modding. Thank me later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the cheats and mods add an amazing touch of life to this already incredible game. Coupled with the fact that its only 29 gigs and the amazing gameplay, I would highly recomend this to any gamer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "own this on multiple system great game however it does have performance issues you need to limit monitor to 60hz or it freaks out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please stop fucking with this 10 year old game it was fine without the shitty new patches that make it less functional",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite its flaws its fun and still holds up just don't try to do mods on the newest versions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a great game, just be wary of bugs in the game, as per Bethesda's standard. Especially since the last patch there's been very game breaking glitches, but there's a lot of mods out to fix the issues. Still a great game, but needs some extra love to make it working properly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game. Has the typical bethesda trappings for better or worse. There is nothing quite like it on the market even after 10 years. Mods elevate it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loads of fun and adventure.  Don't follow the main quest to much.  Wandering is much more exciting.  Try the whats over there adventure instead.\r\n9.999/10 stars!   Go modding too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Different endings, the ability to build in Specific areas, a good story, a Good game all together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Classic Fallout Games and Fallout New Vegas were better games. They have the writing, the atmosphere, and more.\n\nBUT... Fallout 4 does a lot right in way of customization, world exploring and its survival mode. The gunplay is arguably best in the series. The settlement and home building stuff is the kind of thing I dreamed about being able to do when I was a kid playing 1, 2 and 3. The inventory management as well as companion management is much better than any other fallout game so far. So, if you are a Fallout fan you won't be disappointed  (excluding Bethesda's many flawed attempts at re-releasing and patching the game). I think its a solid game. \n\nStory wise, I think its extremely mid.  Fallout 1, 2 and 3 have much better writing more lore-accurate atmospheres and better art direction all around. Its just not bleak enough. Also how are there skyscrapers and literally untouched buildings in the majority of Boston? Atomic bombs would have flattened all of it. Why has society not built anything new like in the classic games? Its been hundreds of years and they have the tech. I also liked it better when we got to roleplay and select texts that were not voice acted. I say they should probably let Obsidian do its thing with the series again. This game also fails to integrate the armors, weapons and lore of the west coast and now West-VA Wastes into the Commonwealths story. I just think in a lot of ways it could have been a much more all encompassing game. That being said its pretty good and I like playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gameplay decent, story meh, preston garvey is a nightmare. \ni like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying this game this time around. I had played the game a couple years ago, and I got overwhelmed by the constant attacks on my settlements. This time, I am not focusing on the Minuteman quest as much and enjoying it much more. Combat is fun and challenging (you can set the difficulty level as you see fit). The world begs to be explored. Also, liking being able to play the game chill some nights and concentrate on my settlements, and then have other more frantic nights where combat is at the forefront of my actions. Gives me a bit of that Skyrim vibe as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game did an excellent job at helping me drown out the screams coming from under my floorboards. Thank you, Bethesda!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has some things that aren't great, but it also has things that work well even setting it apart from it's predecessors. If you're intrigued to checkout Fallout 4....maybe you should. \n\nFor details & a spoiler-free take: https://youtu.be/s2fbBSX01jU?si=ggz8ID1hP_vple39",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth it solely because of the modding community. If you do not plan to play it with mods, grab it on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I give,up vote just because of the modding community,game is average,i can only play with mods.. But these updates breaks my modded game everytime..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Main story isn't anything special, but its enjoyable. Base building, graphics, side quests, and comic/magazine collecting make the game fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i completely love this game!!! graphics and gameplay are amazing <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great but Bethesda is Poo. If you wanna buy it, Don't buy the Anniversary Edition, the Game of the Year bundle is more than enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game that will have you exploring the wasteland for hours and building settlements, the reason for a large number of negative reviews is the fact that the parent company updates the game resulting in mods becoming unsupported for a time, but if you can get around that you're fine, and it's genuinely not a problem for new players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd never played Fallout before this. The game is really fun, there is so much to do! It can be a bit of a learning curve at times but I just use Youtube or Google to help. Huge, addicting game, I recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a game that gives you that immersive experience, Fallout 4 is that game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WOULD RECCOMEND! Fallout 4 features a fun experience for any new, or reoccuring fallout players. The open world aspect of this game is just amazing, and the world building is great. Combined with the story and customization, fallout 4 has made it to my top 10 games! Have fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First of all, its important to explain that I'm not a returning player but started the game as a 'new player' a month ago and so far I've played 143 hours without mods at the time of this review and I've had  no major issues yet.  My game was interrupted by the update but I didn't experience anything negative after that.  I have an interest in adding mods like London City at some point and a bunch of others and hopefully that will be possible but for now I'm playing vanilla and its error free so far and in fact the gameplay feels very polished all around.   My only issue was the install and I had to find my own solution which was to upgrade my Nvidia driver GT3020 from a refurbished computer and only then would it work.      Now on with the review... from the very the start,  I felt immersed into the story and interested in the characters.  I really like what they've done in creating a sandbox game with an in game editor to add and place objects from your inventory into a settlement zone and combined with exploring and quests and improving settlements and adding defenses.  I really recommend this for first time players that want to play a game that allows a wide range of character builds, open world in a post nuclear war scenario where you rebuild society by creating armed agrarian settlements, collecting old garbage and salvaging for useful parts to make generators and water pumps, improve weapons and armor.  Its very addicting gameplay with a vast world to explore.  I totally see the appeal of this game as you vicariously live thru your characters desire to stay alive, find safety, clean food and water and build a self defense militia against hostile enemies.   Its a great concept and most people will very likely enjoy this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It just so peak, playing Vanilla is already good, I bet it's gonna be more peak when it comes modded.\r\n\r\nBut they freaking updated the game so all the mods are now broken....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As much as people complain that they dislike this game i still think that if you dont like it then fallout is not for you, previous games story's are better but the gameplay in this is my favorite. there was alot of love filled into the game and with more creations and the dlc they added it really changes the playstyle of the game. i would rate this game a 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "How can this game keep on getting better?\r\n\r\nIt sucks you in to play and 4 hours later you're still only halfway through the mission and you've emptied your bag of junk 3 times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "most recent update broke the game - game will not launch 100% unplayable\n\nedit - since fixed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really fun survival game. pick it up on sale it might suprise you. I hope you enjoyed my review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely amazing game. not the best fallout game but very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive always loved fallout 4 but come on, a storywealth on nexus is 80 gigs, like twice the size of the game xD i love this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played. Was my gateway into choose your own adventure games, it's set a bar that is rarely met.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I see Bethesda logo - I go to nexus and download mods\r\nStill not that engaging as cow shit party in one of the villages in India. Just go there instead\r\n10 cow pancakes / 10",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Modders built the soul of this game. Bethesda keeps trying to sell it back to us.\n\nFallout 4 was once a sandbox for creativity. Now it’s a treadmill for monetization. Bethesda’s latest update cycle feels less like support and more like sabotage—breaking mods, forcing updates, and re-selling the same game with a fresh coat of monetized paint.\nI didn’t ask for Creation Club clutter. I didn’t ask for stealth updates that nuke my load order. I asked for stability, respect for modding communities, and the ability to play the game I paid for—on my terms.\nInstead, we get the cattle treatment: herded into updates, upsold legacy content, and locked out of our own mod setups unless we jump through hoops. It’s anti-consumer, anti-creativity, and emblematic of a publisher that sees its community as a revenue stream, not a partner.\nFallout 4 still has heart—thanks to modders. But Bethesda’s handling of it? That’s where the rot sets in.",
      "voted_up": false,
      "votes_helpful": 1623
    },
    {
      "review": "The game is good but fuck Bethesda and their fucking mod breaking \"updates\"",
      "voted_up": false,
      "votes_helpful": 1636
    },
    {
      "review": "No Bethesda, there was no need to update the game, and break f4se, 99% of mods, introduce performance issues and even more unstability, and try to shove paid mods into our throats. \n\nNo, really. THERE WAS NO NEED FOR THIS BULLSHIT YOU GREEDY CUNTS! Now we have to wait a month or two for mods to update.\n\nFuck this company, that is all I can say at this point.\n\n\nA quick edit: For people that are saying \"just downgrade, read-only the manifest, etc.\", I already handled that by the time the first round of next-gen \"update\" was announced. I'm not the target for this cash grab. I have a custom 700+ modlist that has custom patches & balance edits that I personally made for it. Do not want to start a measuring contest, just telling that I know my shit. \n\nI simply want this \"paid mods\" crap to end, unlikely as it is. Just stop defending these greedy actions. If you want to be a boot-licker, stop wasting comment space, and just mail your wallet directly to their headquarters. There is no difference in the end; this is what they actually desire.",
      "voted_up": false,
      "votes_helpful": 4505
    },
    {
      "review": "I would love to understand how they think they can charge FORTY DOLLARS. For a re-release of a BADLY broken game, that's needed heavy patching ever since release. They did nothing up until now to fix it, and now they want $40 bucks so you can upgrade to another version that's just as broken. And given their history, we know they'll never fix this one either. \n\nOut of their minds. Completely detached from reality.",
      "voted_up": false,
      "votes_helpful": 97
    },
    {
      "review": "$20 for \"DLC\" that already exists on Nexus Mods for free\nWhile also breaking all the mods that make the game playable",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "you need a lot of mods usually to make the game work or click for you as an individual if you want to play it for a long time\n\nCue Bethesda Breaking All of Them",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "They just killed the game with this anniversary update. Not going to sort my 400+ mods as it would take days. Good bye fallout, I would like to say I will miss you but I won't.",
      "voted_up": false,
      "votes_helpful": 93
    },
    {
      "review": "Absolutely tone deaf, Bethesda took a beloved 10 year old game, broke every mod that had been lovingly crafted in those ten years, introduced some slop and hundreds of bugs/performance issues called it an upgrade. Then had the audacity to tell us to pay them for the service. smh... If you want the game in a solid and workable state that also allows you to use mods, buy it on GOG, they still have the original format and for a hell of a lot cheaper.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "No, I am not paying $40 to get the creation club items. Should've made it free for people who already bought the Game of the Year Edition a decade ago.",
      "voted_up": false,
      "votes_helpful": 76
    },
    {
      "review": "It's crazy that the launch day was 10 years ago, but the $40 anniversary upgrade is even crazier. I'm tired, boss.",
      "voted_up": false,
      "votes_helpful": 73
    },
    {
      "review": "Singleplayer game\nRelease date: 2015\nLast story DLC: 2016\nLast meaningful update that added anything relevant to the game: 2017\nLast update that broke the game and the mods: Check current year.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "you owe all our success to the modding community and all you do is break the mods with pointless updates or to do greedy stuff like this, pathetic.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Bethesda once again proves that they have absolutely no respect for their players. They released yet another “update” that adds zero real value, slapped an absurd price tag on it, and expect everyone to buy the same old game all over again just so they can shove the useless Creation Club down our throats. Nobody asked for this, nobody likes it and yet here we are.\n\nThis company never misses a chance to show how bottomless their greed really is. They keep milking their loyal fans dry while giving nothing in return. The people responsible for this so-called “Anniversary Edition” deserve a special place in hell.\n\nFvck you Bethesda.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Bethesda? Please stop releasing updates to 10y+ old games. Just breaking mods and frustrating players at this point. Also, old bugs are not getting fixed and more are being introduced with each updated. Plz focus on Elder Scrolls VI & Fo5. Let the rest be, except Fo76,",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "You push an unnecessary update that breaks the game, take a year to *almost* fix it, and then sell a bunch of fetch quests for 40$ (60 for the lucky ones)?\nThere's way better games out there folk, just ignore this dumpster fire.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Wait, you're offering me the ANNIVERSARY EDITION bundle that only adds a useless season pass and stolen mods? I haven't bought jack from you since the last DLC for this game. Why? This bullcrap for $60 is the reason. You scammed people with Starfield and now I'm awaiting the ES 6 scam that you'll drop on people.\n\nI will laugh while you ruin every franchise players used to care for.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Bethesda...what are you doing. How do you have the gull to re-release this game again at a higher price point for a few creation club mods thrown in and on top of that only release a fix for the horrible update you did previously almost 2 years later that will break the game again? You should be ashamed of yourselves. This franchise is slowly dying on the gaming side because you keep ruining the trust between you and this franchises community.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "Played for many year, loved the game then Bethesda pull this crap\nModders are the backbone of your game, and you broke everything to push paid mods from the CreationClub\n\n68,956 mods online, 422 Currently compatible with Anniversary, thanks for that Bethesda",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "For the love of all things holy, Bethesda, stop updating games that are over a decade old. We saw this with Skyrim where you morons decided to cram an anniversary edition update down everyone's throats in 2021, breaking everyone's mods that required things like SKSE, and you did the same thing again with this game last year and then you did it again this year. NO. MORE. UPDATES. There is no need to update a game that came out in 2015 except for a cash grab. \n\nHow about instead of updating a 14 and 10-year-old game, you idiots actually work on new games. Where's Elder Scrolls VI? Where's Fallout 5? Where's the remasters for Fallout 3 or New Vegas like what was done with Oblivion? Give us something fresh instead of updating games that have already calcified a long time ago.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Stop updating this game, let it die gracefully, haven't you people done enough already?",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Just plain depressing. Unbelievably depressing.\n\nIt wasn't a bad game- just a bad entry into the Fallout Series that trivialized and commodified the previous games and the whole series' identity. Would've been a pretty solid spinoff and might've been remembered more favorably than Tactics (a fantastic spinoff which expands lore into a previously untouched region), but Bethesda went a little too hard in the paint trying to make it *the* sequel to 3 and unfortunately made the whole thing very shallow and superficial by comparison. Completely alone, it's actually pretty fun. Or was.\n\nIt seems Bethesda has a strong abhorrence for the series and even more so for the fans who go out of their way to make a memorable experience from the game. The previous entries only seem to officially exist for them to shamelessly wag overpriced cosmetic microtransactions in front of our faces (in a strictly singleplayer experience, mind you) while actively waging war against modding the game for free. Between firing off DMCA's at modding teams like Todd Howard's very life depended on it and releasing game-breaking updates conveniently at the very moment FO: London was set to launch, they have done literally nothing but show off how much they despise their players.\n\nThis game is ten years old. A DECADE. 3,650 days. The last DLC released in 2016. Since then? A small subsect of officially blessed \"modders\" churning out aforementioned microtransactions in the form of the Creation Club. Wanna pay $2.99 for a *single* paintjob for your Pip-boy? At least the horse armor was kinda useful. Just how Bethesda keep their staff on payroll confuses me to no end. ~450 employees at BGS and they can only work on one game at a time, take a comically long time to do *anything*, and still completely butcher it like a drunk neurosurgeon accidentally lobotomizing their patient.\n\nWhy was the Anniversary Edition update necessary? Who knows. Releasing optional content would've been fine. Completely breaking the game for the nth time- while entirely par for the course at BGS- was just kicking dirt in our faces while promising it was a makeover. Shame on everyone involved.\n\nIt saddens me as a lifelong fan of many of BGS's titles that this is the clear and defined route they wish to take. Starfield was the last thing I ever bought from them and it was such a colossal disappointment in its own regard that I simply can't expect TES 6 to be worth bothering with. FO76 showed how out of touch they had become and how much they rely on the folks who'll throw money at any unpolished rock if Bethesda spay paints it gold. It's all so tiresome, and if I could get a refund for the time I spent playing this game and literally growing white hairs on my face modding it into something worth coming back to (only for another update to make me do it all over again), I'd take it in a heartbeat. I could've found a thousand other games worth my money and- far more importantly- my time.\n\nKick rocks, Bethesda.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "To play this in 2025, you need to:\n1. Disable the beta version of Steam (otherwise, Steam will completely close when launching the game)\n2. Install 3 mods to unlock the FPS and fix the game speed from 2x to 1x\n3. Tweak the game settings so it doesn't crash for no reason (for example, with weapon debris enabled)\n4. Pray (if you are an atheist, the game will also not work properly).",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "A good game let down by a greedy and incompetent company.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Was gifted this game back in 2015. I never played it since then and i most likely never will.\n\nThe amount of low effort garbage this studio puts out for 60 dollars and gets away with it makes me genuinely believe bathesda fans have a cuck fetish.\n\nI could sit here and talk about how lazy this studio is. how greedy, predatory and scummy they are in their business practices. How they have successfully privatized doing the absolute bare minimum while still charging top dollar because they know loyal lap dog modders will do all the work for them. How brazen they are in throwing up the middle finger to everyone in this industry, say f*ck you, and still get away with charging 60$ for it.\n\nI could talk about all that and so much more, but the real villains here are the pathetic Stockholm syndrome sub humans that continue to buy and support this dog sh!t company and their bug riddled half-assed pathetic excuse of \"products\". I say this because they would not continue to sh!t all over your cuck faces if you didnt continue to empty your wallets for daddy bathesda. \n\nThe CEO of bathesda Tom Howard could un-ironically unbuckle his pants, take a hot steaming pile of sh!t, slap the fallout logo on it with a 60$ price tag and you pathetic vermin will still salivate at just the thought of coughing up 100$ for it. \n\nI'd feel bad for you, but at this point you deserve it and i hope they continue to exploit your tiny little npc brains.\n\nStop giving them your money or continue to enjoy eating Todd's garbage while the rest of us enjoy actual good rpgs that respect our time like bg3 & Elden ring.\n\n0/10",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "love the game but F*** bethesda they've been bad off since being purchased by microsoft dont support these people",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Corporate washed slop heads needs to take a back seat, shut up and get their hands out of game development",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This anniversary edition is disgustingly out of touch. A decade old game I already bought twice and you're charging me HOW MUCH for work somebody else did for you?",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Fallout 4 is a good game that can be made amazing with free mods.\n\nBethesda is a pit of greed that will break those mods with an update every chance they get in order to stick their fingers back into your wallet.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Pirate the specific version you want to play, so you don't have to worry about an update breaking your hundreds of mods necessary to make the game playable. Do not support Bethesda in any financial way whatsoever, and if there's a creation you really wanna try, pirate that, too.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It really seems like the dev is trying to wipe out the modding community whether they are intentionally doing it or not lol stop with the random updates for a 2015 game please its been 10 years, it works fine and doesn't need the changes. Make a new Fallout game instead please.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This used to be my favourite game, don't bother anymore unless you don't want to play with mods, which is stupid. They keep destroying your mods just to release stupid and unnecesary paid mods called \"creations\". They keep fucking over the whole community for greed. Modders are fucking off cuz they can't be bothered redisigning their mods constantly. You can downgrade with a tool, but then some mods will be updated while others won't. It's a mess, fuck you bethesda, you used to be my favourite company, now you're just the same as ea slop and ubislop, and look at how ubislop is doing, it will be the same for your greedy asses and I'll spit of the ashes of your company when it's over just like I'll do for EA games and ubislop.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Only Bethesda would be slimy and greedy enough to release mods for $40 as an \"Anniversary\" edition and then also neglect to fix any of the multitudes of issues the game has been plagued by for 10 YEARS. How anyone can support this company is beyond me.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Shitty business practices. Stay away.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I got this game on release and then all the DLCs as they came out. I had fun 1600+ hours. Then Mr. Greed came with an upgrade that nobody asked for and broken the game. This is why people pirate games.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Developers can't help but make every update the worst possible thing for a decade old game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have played this game for thousands of hours on console and with mods, and enjoyed almost all my time with it. Despite its flaws it is a wonderful open world, post apocalyptic game.\r\n\r\nHowever, Bethesda have routinely destroyed the game and it just isn't possible to enjoyably play it right now. Creations I paid for aren't working, the game doesn't think I have DLC which I do have, it's just a mess. \r\n\r\nI wish Bethesda would focus on making something new and good, and leave old games alone. It's sad not being able to enjoy the game without the company stealth dropping an update that breaks everything.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Anniversary Edition has bricked my game. Unrecoverable crashes, corrupted saves, all the stuff we've come to expect from Bethesda. I uninstalled after nearly 700 hours in this game since this \"update\" broke all my saves. Probably not going to play it again.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Cannot express to you how glad I am a popup about a re-release [i] I didn't even buy [/i] prevents me from actually playing the game I [i] did [/i] buy. \r\n\r\nSeriously, Bethesda is the worst game studio on Earth, I will never spend another cent on their slop.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "I was in the middle of a modded playthrough and this update almost bricked my game. \nThanks Todd.\nBTW Do not update your game if it is modded. Go to your steamapps folder and find appmanifest_377160.acf, open properties, click \"read-only\" and save. This will prevent the update.\nwhen you do this it can't no longer load from steam and can only be loaded by F4SE.exe or whatever other booter you use.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "THESE FCKING ASSHOLES JUST DELETED ALL MY SAVES WITH THEIR NEW UPDATE, THEY DELETED THOUSANDS OF HOURS OUT OF PURE INCOMPETENCE, FUCK YOU BETHESTHA...",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Bethesda doesn't deserve this ip.They're a bunch of greedy and incompetent developers.Would not recommend this game to new people that are just trying it because of the show as bethesda is trying to overcharge for a game that is a decade old.Hell I wouldn't recommend this game in general.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Play fallout 3 or new vegas instead, they have much stronger rpg systems. it's just disrespectful to break a product I already bought TWICE years after my purchase, for clarification, i'm not just talking about breaking the mods, which is frustrating.The last two major updates broke the game.Wtf i'm starting to think that they just don't like the fallout franchise.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "They are releasing updates, specifically to break our mods, and then adding in bullshit 'Creation' trash to try and force people to pay money. At this point I just want to report the game to be de-listed since it doesn't work without mods and they refuse to let their community play the way we want with mods.\n\nEDIT: They've already said they will patch at least 2 more times. Don't even bother trying to mod again till after their December  'break everything , introduce new issues and ruin more fun' patch",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Fallout 4 Anniversary Edition (2025):\n\nTechnical Stability: 2/10\n\nValue for Money: 3/10 (if you already own the game)\n\nRespect for the Community: 1/10\n\nNostalgia Factor: 8/10 (because we want to love it)\n\nOverall: 4/10 — Broken Birthday Party\n\nBethesda had one job: celebrate a classic. Instead, they monetised nostalgia and destabilised a perfectly functional game.\n\nTen years later, we didn’t need a new version of Fallout 4.\nWe needed the old version — just fixed.\n\nSo until they sort this out, the best advice I can give:\n\n“Don’t update. Don’t buy. Wait for the modders.”\n\nBecause in Fallout 4’s world — just like ours —\nGreed Never Changes.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Love Fallout, love the world, the story, the history, and the humor. Growing up it was a comfort and a joy, it sparked a passion that led to what I'd eventually go to college for, what career I'd pursue. \nWhat you've done to it is a disgrace and utter shame.\n\n You've overseen maybe some of the best games ever produced - then proceeded to shove garbage down our throats over and over again. 30 years with Bethesda, Todd, and you can't get a f*cking grip to save your life. You've beaten masterpieces to death, choked the corpse for whatever money you could squeeze out of it, and for a decade after release insulted and mocked fans with money obsessed tone deaf bullsh*t - ultimately you've built a monument to spitting in the face of art. Skyrim, Oblivion, Fallout - you create, kill, and puppet the corpse of a game for everything it's worth. \n\nNext time you create a game, try not to beat it to death in the attempt of draining everything you can from it. Try to take pride in it without lining your wallets at every opportunity. Fallout was a critique of capitalism run rampant, now it's an ironic waste of space on a hard drive.\n\nUntil massive changes happen, I will not buy another Bethesda game, I won't touch the IP, I won't be seen in public with anything resembling your IP except to discourage others from it - and I will actively slander you. That's a promise.\n\nElder Scrolls VI is as far from my radar as ever. I won't be buying it on principle. \n\nTo anybody who reads this, Kingdom Come: Deliverance II is a game that'll scratch your itch without disrespecting you as a person and fan of quality games. Pick that up instead.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Bethesda, I love this game and have been playing it for 9 years now since it came out in 2016. If anyone at Bethesda is reading this - PLEASE JUST LEAVE FALLOUT 4 ALONE!!! We have no need - and no desire - for any new updates or creation club content. Your updates keep breaking our modded playthroughs and forces us to spend even more hours at downgrading Fallout 4 and fixing our mods. If you do not want anymore negative reception, THEN CUT IT OUT WITH THE UPDATES!!! Work on Fallout 3 Remastered and maybe finally work on Fallout 5 and Elder Scrolls 6 - GET SOMEBODY WHO IS ABLE TO WRITE WORTH A SHIT FOR THESE GAMES!!! - if you want any chance at salvaging your company and your image.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The Anniversary update wiped out over half of my mods. This is not New Vegas. Fallout 4 is complete dog water without mods. Thanks again Bethesda. Uninstalling the game and will never pick it back up again. Hope many others do the same.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Well, after 1.6K hours spent playing, all the towns built, monsters killed and latex suits craftet for my beautifull girls companions, latest update destroyed all the 200 mods again and there is no way I'm going to spend few weeks again to reinstall everything and pray the Gods it works. Thanks Fallout 4 old buddy and farewell, it's been fun!",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "breaking everything on purpose and telling your community to go fuck itself is an amazing way to maintain customers",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Bethesda pushed the \"Anniversary\" update, whose goal is simply to break what makes Bethesda's game go from \"meh\" to \"very good\": the mods and the modding community, who, apparently, are far more talented and passionate about what they do than Bethesda.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This game is great, Mods make it even better. \nOne of the best building games that feel alive with npcs. \n\nBethesda  however have become lazy beyond repair. First it was their shobby lazy crap called starfield, now it their 2nd half baked update to a 2015 game to make quick cash from morons. \nAlso The update comes with bugs imagine that... \nI am beyond sick of this company and is why im giving this a thumb down.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I have 1053 hours of this game, because it was fun, i could play with my mods, now the game is unberable with this shi* show of anniversary update just to milk an old game. They refuse to give a separated game, and the game by itself, has so much bugs, that mods are essential, and those won't work for a good amount of time, because of greedy mofos. I'm unninstalling this. If you ever consider buying a game from bethesda, just knows that, the \"just works\", it's a hoax, nothing works at all..",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Dear Bethesda, \nThank you for breaking one of my favorite games. I mean yeah the story is awful and contrived but the exploration is genuinely fun. Well I should say was fun. What happened to you guys? I mean I have 2500 hours in this game. I bought it in the first week it came out. In fact I bought a new computer just to be able to play this game on release in 2015. It got me thru Covid, I was in China during the lockdowns separated from my family for five years and this game helped me survive. To say I have an emotional attachment to it is an understatement. Up until the lastest update I was still finding new things in the game. I was setting up challenges for myself and now I am starting at the opening screen while typing this. Cause I can’t start the game and I will probably have to restart my computer to close it. So thank you Bethesda, for taking a game I love, with all its faults, and making it unplayable. Well done, I award you a gold star for effort. \nSincerely, \nMe, an unhappy and frustrated customer.\nNot recommended anymore",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a running gag at this point. Bethesda will update a 10+ year old game for no reason and add mods nobody asked for locked behind pay wall. Mind you: these mods are half baked and someone probably did a better version of it for free when the game came out. Fucking Bethesda...",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The people who own this IP don't like you as a fan apparently. As a game, pretty good. As a Fallout game, mid. As a company, saddening.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Very much not impressed with the anniversary edition.\n\nPull your heads out of your asses Bethesda, this is one of my favourite IPs of all time and it's just rotting at this point.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Bethesda is evil and heartless. they broke my mod list which turned all the female companions into goonable porcelain doll look alikes. I loaded the game hoping to unwind from a long day slaving away moderating the official Hololive discord server; only to find out i couldnt speak to my dear wife of 8 years Piper. I am absolutly appauled and crushed by a broken heart. These are dark times for cultured men like me who spent blood sweat and tears raising a family of super mutant behemoths in Sanctuary hills. Ill never see my sons Grum jack and riley ever again. I will be taking my buisness elsewhere for now on. I hope your happy todd howard you ruined my life.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Adored these games over the last 15+ years but it would be neat if Bethesda listened to the community and didn't disrupt the existing mod community for a few extra bucks.\n\nIf they were more transparent and honest with the fans they could re frame the creation club as a community led mod project where the reigns were handed over to the community to create new DLC whilst Bethesda worked on other projects. I think the community would be much more willing to get behind that rather than what we've been handed in the current anniversary edition.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "There are aspects of Fallout 4 that I love, but those aspects were born out of Bethesda Game Studios a decade ago. Current Bethesda is just horrible, and has ruined Skyrim, Fallout 4, their new IP Starfield, and soon to be others. \r\n\r\nMany people complain about new Fallout 4 updates breaking mods, and say that the company should \"stop updating the game.\" I don't necessarily agree. I think it would be a good thing if Bethesda supported games by releasing bug fixes and free content with some effort behind it -- essentially what CD Projekt Red has done with Cyberpunk in the last few years. However, Bethesda updates are not for the purpose of bettering the game, but are completely focused on making money by releasing really poorly done, cheap to produce paid content.  Yes, they'll release a few free items as well sometimes, but the quality of them is just laughable, and they essentially serve as ads for the paid \"Creation Club\" content.\r\n\r\nRecent updates have all been focused on the \"Creation Club,\" a microtransaction hellscape. Skyrim and its \"Anniversary Edition\" were already ruined by this \"Creation Club\" content, which is so poorly implemented into the game that it is only slightly palatable with mods that completely overhaul it. Fallout 4 fares worse, as it has a smaller modding community than Skyrim, and it seems Bethesda is completely focused on milking this game for \"Creation Club\" content, releasing update after update that does nothing to actually improve the game and breaks mods each time. The game has actively gotten worse over the past several years, and it's to the point where I'm not sure if I'll ever play it again.\r\n\r\nThe base game itself has a well-designed world that is really fun to explore, good companions, and stellar encounter design. The gunplay is satisfactory. All of this positive is severely dampened by the game's writing, which is borderline nonsensical at points, and its awful dialogue system. I've enjoyed the game a lot over the years, but the juice is not worth the squeeze of dealing with a company that does not care about the game, but just uses it solely as a microtransaction vehicle.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "do not waste your money if you like to mod your games. Bethesda routinely releases hotfixes that do nothing more then break anything that isn't part of their creations. all my hours in this game are from before their most recent update, and while I did enjoy the game, I do not enjoy the developer's and as a result I will no longer be playing",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "When you think the game could never get worse, Bethesda will update it to prove you wrong.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "the 10th anniversary edition update nonsense broke my old saves.  no mods, just vanilla fallout 4.  I didn't even purchase the crappy anniversary edition, but they still force it on you, just not the content.  IT JUST WORKS.  Do NOT recommend.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Bethesda is one of the LAZIEST and GREEDIEST AAA companies right now.\n\n- Updates 10 years old game\n- Breaks it\n- Insert a bunch of junk in the game\n- Charges you +$40 for it\n\nIt's over.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This company seems to be fully detached from why people still \"used\" to play this game. I cannot even get it to load now. What a waste. They are nothing but greedy idiots it appears.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The most hours I've put into a game on steam. However, given this recent update paired with Bethesda constantly going against the community, this franchise is dead to me. Beyond greedy.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Leave the game ALONE. geez. \n\nnot giving these greedy fools another penny on another title ever again. lesson *FINALLY* learned.\n\nOFFICIALLY added them to my IGNORE list (visit the developer/publisher page, find the little cog, click it and click IGNORE. :)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The new update is both unnecessary and a cash grab. Good grief, Todd.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "You know how some games keep getting better over time? Yeah this is not one of those games. Every time Bethesda stick their fingers back in to try to extract some more cash, the game gets worse.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "What the hell is even the point of a paying for a season pass if you're just going to release DLC content that you have to pay for separately in the future. Biggest scam update I have ever seen.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Joining the no reviews because of the anniversary review. I otherwise do enjoy the game, but this move by Bethesda is just insulting.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This a s s h o l e company needs to stop re releasing 10 year old games with nothing new or ground breaking at full MSRP. you deserve the \"fallout\" with your consumers Bethesda",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Dear Bethesda,\r\nPlease stop updating games that are 10 years old.\r\nIf you are this hard up for cash why not actually create some new content? I for one would love to see another decent DLC. This update is a pathetic joke.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Bethesda has re-released Skyrim and Fallout 4 in brand new editions ad nauseum, because they are like all the other old developers-- all their real talent has left or retired.  New employees have replaced them-- upon releasing Starfield, they have realized they have no idea how to make a good game.  So they have resigned themselves to reanimating their past successful games.\n\nThe games are like walking skin suits, just like the company, a zombie that looks like them, but it isn't the same on the inside.  I haven't pirated a game since installing Steam over 21 years ago. Bethesda isn't trying to make great RPGs anymore, they're not in it \"for the love of the game\", but only interested in their finances.  They're a bloated, out of touch corporation that doesn't really need your money.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "stop breaking the game and the mods no one wants your paid mods corporate rats",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Morally and creatively bankrupt company that refuses to do the bare minimum and expects people to still give them a salary each year. I am done with them.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Don't let my 500 hours fool you, this game is ass. My playtime is so high do to a few \"playthroughs\" where I just build a bunch of settlements (I like the building/scavenging mechanic) and streaming for friends. I have only beaten this game once, back in 2015 when it came out. I was so disappointed and shocked at how bad it was I've never been able to get through it again. 90% of my hours are just building bases with mods in the starter zones, never even reaching Diamond City (pretty much the second or third level of the game). I do like Nuka World DLC as a meme, but it is a bad DLC I can't lie.\n\nThe actual game of Fallout 4, and the company that made it (Bethesda) are vile. Regarding Fallout 4, the story is laughably childish and weak, companions are boring and flat, the quests are mostly fetch quests or radiant kill enemies missions, and the lore is retconned to hell from the actually canon games (Fallout 1, 2, Tactics, New Vegas). Todd Howard's filthy high school friend, Emil Pagliarulo, (I write his name with great disgust) is a hack who can't write a compelling story to save his f*cking life. Look at the criticism for every bethesda game, what do people say? \"The story is weak but the open world is fun while horrendously buggy.\" He's just god awful and only has a job cause he's childhood friends with the game director.\n\nThe actual core gameplay is broken, as since there is no level cap you eventually outscale every enemy to the point where you are three-shotting deathclaws (boss enemy) with any gun. You literally get locked out of difficulty because the balancing is so ass.\n\nAnd one of the biggest issues is Bethesda itself. No joke, not being over dramatic, they actually despise their fans and modders. They will consistently update this game randomly, after years, to add garbage sh*t like halloween items or mods that they force into the game. These simple. megabite level updates, literally break and make incompatible EVERY SINGLE MOD ON NEXUS, LITERALLY TENS OF THOUSANDS OF MODS EACH TIME.\nThey know this, and keep doing it. Last time it was a week before a massive campaign mod came out called Fallout London (which was also ass but that's not the point). After not updating the game in over 5ish years, they wait till a few days before a years long anticipated mod's release to add 3mbs worth of updated code that broke everything and delayed the mod a long time. I believe in my heart that their timing was intentional. It's happened too many times with sus timing to be a coincidence.\n\nThey were flooded with negative feedback for this, and the other times they've done this for their other games, and yet they just did it again a few days ago. You literally can't play this game because all the mods that make it stable, fun, balanced, are broken and mod others aren't going to come back after 5+ years to fix their mods.\n\nIt's gross company practice to intentionally slap the faces of the community that does all your heavy lifting for content, bug fixes, and stability for your sh*tty games.\n\nThis is not some New Vegas fanboy crashout, or reviewbomb because of the mod break that just occurred. I've always been disappointed with this game and hated bethesda. This was just what finally reminded me to write a negative review. Bethesda is a c*ncer company, run by r*tards and hacks, who's games are literally always panned as messes with sh*t stories.\n\nIt's a crime they bought the Fallout IP from the actual creators and rap*d it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "If you have Fallout 4 GOTY or Fallout 4 + all DLC, DO NOT BUY THE ANNIVERSARY UPGRADE.\n\nInstead get the Creations Bundle and save yourself $20 as they're charging an extra $20 for the DLC with the Anniversary Upgrade and of course there's no notice of this from Bethesda themselves.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Pretends to be celebrating their community while breaking that community's hard work in fixing/improving their game. Just to shove paid mods in our faces.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Totally unacceptable how Bethesda behaves these days. Continued low effort updates that break more than they add or fix. Ruins the modding experience. I have zero interest in ever replaying this game again thanks to Bethesda making the game a nightmare to mod. I have no faith they will do anything to fix any of this",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Meet a Bethesda game. Where an “anniversary” update causes the game to crash when you try to exit the game. Now go ahead and pay us 60 dollars for a game that’s 10 years old that can’t run properly. As Todd says, it just works (for Bethesda when you give them more money)",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Base game was good\n\nUpdate just before Fallout:London mod release made game slower and more prone to crashing\n\nAnniversary is ass. Bethesda is ass. Fuck them. Don't buy. Pirate. Don't give this fucking money sucking corporate shithole any money.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The best time to play this game was 2016-2017. Bethesda ruins everything they touch eventually. I will never defend them again. Hope to see Bethesda fall someday.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Quit updating a 10 year old game and breaking everything you lobotomites",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Would not recommend this game, specially after the anniversary update!!\r\n\r\nMods: No support for most of them\r\nVanilla: Breaking and getting stuck in endless loading loops",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't recommend this game until they stop sabotaging the mod community for profit. Enough useless updates nobody asked for. It's obvious they want us to pay for mods instead and know most creators wont bother to keep their work updated. We're being manipulated by a greedy corporation just like everywhere in modern life. Revolting.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "once again bethesda released an update to us that we never asked for and breaks everything. not just mods but the base vanilla game has become yet more unstable. none of this would be an issue if bethesda used steam's beta feature to allow us to switch to older versions of the game without having to jump through hoops. i just want to play the game i bought in the state i bought it in",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "1.make a game that thrives for years thanks to its modding community.\n2.release a completely unnecessary cash-grab update that breaks every mod.\n3. ...\n4.Profit...",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I've been a fan of Fallout for a long time. I was introduced to it by my now deceased best friend. I'm glad that he's not alive to see the sad state that this game is in. Consistent bugs, updates that break the game across multiple platforms, and a company that cares not for the consumer but only their shareholders and the bottom-line. This newest release (if you can even call it that) is a terrible marketing ploy that will forever leave a bad taste in the mouth of many fans of this franchise. This is a blatant cash grab and the piss-poor content that was released is a slap in the face of the consumer. I will not be buying the anniversary edition anytime soon and have no faith in this company to produce a complete product when it comes to Elder Scrolls 6 and Fallout 5. It is an absolute shame to see a company do so little with so much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Anniversary Edition is an absolute failure and cash grab. It's the same broken game from the next-gen \"upgrade\" slapped with a high price hoping to bank off of the excitement for season 2 of the show.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Screw Bethesda breaking entire mod lists for this anniversary nonsense no one asked for. This is twice now they broke the only good thing about this game without adding anything of value. Stop it.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Are you fucking kidding me with this \"Anniversary Edition\" repackage rn? $59.99 for 10 year old content??? Get the fuck outta town Todd.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "That greedy update was asked by no one.\n\nI always loved the liberty given through modding, i always hated the company behind the game for the scummy things it does.\n\nAlso stop defending paid mods!!!\n\nEdit: They updated again, they will never listen",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Bethesda broke this game by adding a bunch of stuff I didn't want. I used to enjoy this game. Used to.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "10 years after the realease they break the game so bad it crashes every 5 minutes even without mods",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Bethesda did not fix the basic issues plaguing F4 for a long time, like high FPS breaking physics.\nThey do not care about the fans of their games. Instead of fixing the bugs, they introduced new ones, along with ridiculously priced mods.\nDo not buy.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "It's a great game, but Bethesda is getting worst than Ubisoft and that says alot. Ubisoft at least just abandons games and make them unplayable, but Bethesda not. They make them unplayable and break mods at the same time. Their \"updates\" are just some more cashgrab from a dead cow and introduce bugs as always.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I really loved this game with all these amazing mods, but after all these \"updates\" and screw-ups, I can't really recommend this game. They prioritize the microtransactions and the store over fixing this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I recommend the game, not Bethesda, and for that reason I will leave a negative review. \n\nIf I'm being totally honest, this game compared to 3 and New Vegas is a pale imitation of the initial magic that got me hooked. But that said, I enjoyed a fair amount of the additions to game mechanics and I liked the inclusion of settlement building. It allowed for new avenues of modding like Sim Settlements and in addition, it was a fun way to build my own cool player base.\n\nSo not all bad, but damn, these updates. 10 years of non-paid modders fixing and improving the game, and Bethesda flips them the bird. Even that aside, updating content is cool but after 10 years and these are your only improvements to the game for performance and stability:\n\nGameplay & Performance\n\nVATS Accuracy: VATS hit chances are now consistent across platforms and no longer drop to 0% or show incorrect values. Targeting enemies through walls without the Penetrator perk is no longer possible.\nNPC Visual Creations: Fixed stuttering and hitching caused by Creations that edit NPC visuals. Performance is improved when using such Creations.\n\nStability & Crashes\n\nBNET Connectivity: Better handling when there is a  Bethesda.net outage\nCrafting Station Crash: Interacting with crafting stations or the workshop on ultrawide monitors no longer causes crashes.\n\nThat's just shameful. Go stick your head in the sand Todd, for all the consideration you give your fan base. As for the rest of the leadership, if you ever took any pride in the hand you had in this, then do us all a favor and quit the industry, please. You are unwanted and unloved.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Idiots break the game and want to charge 20 bucks for a bunch of crappy skins, a few weapons and a couple of houses. GG Bethesda",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "500 hours into the game and the next gen update breaks my whole game.....\n\n\n150 hours after fixing it they do this....\n\n\nI just dont know if i can face putting so much of my time into this again",
      "voted_up": false,
      "votes_helpful": 12
    }
  ]
}