{
  "positive": [
    {
      "review": "It's a unique game, something different from the dopamine-optimized high-octane fast action gameplay that has become the standard for \"non-cozy\" games. Kingdom Come: Deliverance is slow and clunky, but has an incredible charm and large, large focus on the role-playing aspect of the RPG. For me, the game draws many similarities to games like Skyrim, but this game is better in practically every way. Characters in KCD feel very real and the main story is compelling enough to keep me interested. And while the combat in this game is EXTREMELY flawed, it adequately portrays a story in itself as you, playing Henry of Skalitz, go from someone who struggles to take down a single person to a fearsome knight capable of slaying multiple men at once.\r\n\r\nThe way the combat evolves alongside your knowledge and understanding of how it works is a double-edged sword. The \"Master-Parry\" system essentially guarantees that you can succeed in any swordfight by playing like a coward and never swinging first. Additionally, because enemies can ALSO master parry you, you're punished for fighting offensively on more skilled enemies, with no course of action to avoid getting hit other than to simply not ever swing first. As you progress through the game, this becomes less of an issue in random encounters due to your overwhelming stat advantage, but more of an issue in late-game quests involving fights with higher-difficulty enemies. Over the course of my playtime, I fell in and out of love with the combat, and recognized how unique and fun it felt to master while also seeing the cracks in the system.\r\n\r\nOutside of combat, KCD is extrordinarily slow. You're forced in an animation to pick flowers. You're forced in an animation to open every single door in the entire game. You're forced to stop playing the game constantly in very small but extremely prevalent micro-doses of time. Washing your armor, Waiting for time to pass, Getting in and out of bed, it all takes a small but unnecessary amount of time. This enhances the gritty 1400's medieval RPG aspect of the game to an immense degree, but also comes at the cost of potentially alienating a large audience of people who simply don't have the time or patience to play the game. Combined with the functional but outdated U.I. of the inventory and skills screens, I put down this game in the tutorial area two individual times before I was finally in the right mindset to play it through on my third.\r\n\r\nDespite what may seem like me complaining, I think that Kingdom Come: Deliverance is actually a good game. It's unique and interesting, and if you're both a patient person and also looking for a medieval RPG that stays grounded and real, there isn't a better game on the market for you. I'm only that type of person in periodic bursts of time in my life, so I never managed to finish the game. But I do respect it for what it is, and thoroughly enjoyed a lot of the time I spent playing it while I had the right mindset to do so.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "Honestly, I didn’t expect to get this hooked. The start was a bit rough — the combat takes time to get used to and the game doesn’t hold your hand — but once it clicks, it’s amazing. The world feels super real, like you’re actually living in medieval Bohemia. The story, the music, even just walking through towns feels so good. Yeah, there are some janky moments here and there, but nothing that ruins the experience. Easily one of the most immersive RPGs I’ve ever played. I seriously can’t wait to jump into Kingdom Come: Deliverance 2.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Playing this game takes me out of this spacetime and puts me in 1403 AD Bohemia as Henry of Skalitz. Riding from village to village, doing quests and fighting Bandits and Cumans (sometimes fleeing for my life) truly makes me believe I am Henry. Can't wait to play KCD 2.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Quite possibly one of the most immersive RPG's ever made, Kingdom Come: Deliverance mixes a number of unique mechanics to create a true-to-life medieval simulator that keeps you gripped at the edge of your seat from beginning to end. Throw in an addictive combat system and an engaging narrative to boot, and you have a serious contender for game of the year 2018; definitely not one to be missed!\n\nLink to my original PS4 review: https://www.gamehype.co.uk/review-kingdom-come-deliverance-ps4/",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "4 hours in and I just hit the intro credits. Remarkable game. Like Skyrim and Witcher 3 but with more in depth conversations mechanic. If no one called for Game Of The Year for this game but called for it with the sequel in 2025 then the sequel must be insanely good.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Well welcome fellow travellers, meek and extravagant prepare to be intrigued.\nFirstly i would like to comment that the beginning of this glorious game is quite frankly bold like Vsauce father of Shnurkey, it is a gripping opening with an introduction of the young chap Henry's normal and deeply normal life until his entire family is brutally murdered and his house burned crispy like your nan. Next we meet the grandad of the story senor Divish who looks like draculas son in law who scares off the marauding army of the ginger man. Then we nearly perish to the angry mace man runto and wake up in Rattay the town of tomfoolery, where we meet the upper echelons of society in Sir Hanush, Sir Hans Capons and Sir Radzig. Next in our journey we voyagery into the realm of opening warfare against turban Toth where we retake pribyslavitz and talmberg and then he skidaddles off to his superior of otto von burger and then it ends and we meet our lovely jubbly father who was lurking in the shadows which was sir rodzig who then proceeds to use his rod on everyone and then it is the end.\nOverall, it was a thoughtfully jolly game where we get to slash the flesh of many a peeps and do many intuitively cool things like beating timothy over the head with a spiky stick and dig up many graves of long ago for free groschen.\nTherefore mi fellow travellers goodbye and keep farkling all over the place",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly, when KCD came out, I didn't see anything interesting in it at all.\r\n\r\nI ignored this game for a few years... and then one day i decided to give it a try. \r\nAfter a few hours of playing, i completely changed my mind. You as a player find your self in an authentic medieval world, and it's not just some fantasy, it's Czech history, with an atmosphere and details that pull you deep in immediately.\r\n\r\nYou play as Henry, a blacksmith's son, and gradually become entangled in intrigue, war, and personal revenge. The story grabs you because things aren't black and white, your decisions have real consequences, and every choice can change the course of events.\r\n\r\nGameplay is realistic... \r\n\r\nCombat isn't just \"swing your sword and you're done\" you have to learn to block and use weapons strategically. There is a small details like clothing style for better charm and charisma, force you to think like a 14th century person, which can be frustrating at first but that´s totally adds incredible depth.\r\n\r\nPersonally, i find the quests a bit confusing at times, sometimes you have to search for clues or figure out exactly what to do next. But at the same time, i appreciate their diversity and freedom, you can often choose a completely different approach and still complete the quest. This feeling of freedom and the ability to do things your own way is rare and fantastic in RPGs.\r\n\r\nThe graphics and atmosphere are beautiful.\r\n\r\nFor example the forests, villages, castles, everything have a soul. The sounds and music complement everythink around you well that you can easily forget the outside world. \r\n\r\nYes, this game have some bugs.. (Emote: vavraNesouhlas) But this experience of this game you won't soon forget.\r\n\r\n\r\nVerdict: 9/10 – Kingdom Come: Deliverance isn't for everyone, but if you want to really \"touch\" Czech history, it's worth it. \r\n\r\n                                                               AUDENTES FORTUNA IUVAT",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A deeply realistic and immersive medieval experience. The story is grounded, the world feels authentic, and the combat is challenging in a rewarding way. Its attention to historical detail and meaningful choices make it stand out from other RPGs. A must-play for anyone who loves realism and rich storytelling.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Quite a realistic medieval RPG with a good atmosphere and challenging combat. The historical accuracy is impressive, and the world feels alive enough. It has a steep learning curve and some rough edges, and the hype didn’t quite land for me, but the game itself was okay.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I played through the whole game, went immediately into KCD2, played that whole game, and now I'm back in KCD to play the hardcore mode and the DLCs I didn't bother with the first time around\n\neverything is a mini-game, the combat is jank, I've bleed to death, been ambushed by 3 guys and keeled over, tripped over my dog, been thrown off my horse, gathered several football fields worth of flowers and ran for miles on foot, and loved every second of it bugs and all\n\n\"Jesus Christ Be Praised\" out of 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game tbh id recommend it to anyone into open world rpg's the gameplay is amazing and the story ig good haven't found bugs and the graphics look amazing in ultra 100% recommend it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I discovered this game way to late, but this has to be the best experience i had in a long time. Starting of as a peasant, working your way up. Accurate to the real medival times. \nAnd not to mention the combat, you are no superhero, you are just Henry from skallitz the son of a blacksmith, with no combat experience at all, Fighting is actually scary and you will fail and fail and fail, that makes it so real.\nHands down a must play for anybody that likes RPG's.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is a monument in gaming history and I love every idea it has...\n\n...but it's also one of the most broken games I have ever played. It seems like every single system is bugged to some extent. I had so many issues while playing. NPCs behaving weirdly, detecting me for no reason, or interrupting me while I talk to someone else, my actions not affecting reputation, quests bugging out and not progressing, and a whole lot of minor glitches like an enemy walking backwards into camp and sitting down backwards on a bench, preventing me from approaching them. These problems affected my gameplay so badly, that half of my playtime was wasted on retracing my steps after something broke.\n\nIt's partly my fault because I wanted to play stealthily and as a pacifist and the main story is not made with this in mind. I'm baffled that there is even an achievement for this in the game. Firstly the protagonist is a complete jackass that starts fights for no reason at all, and I as a player have to pay for it, breaking my immersion, but also putting me into situations I have no answer for. Most of the time I simply ran away, because I literally can't fight them, but that broke the quests most of the time.\n\nThe best example for this was not in the main story, but in a side-quest where I had to find someone sabotaging something. After I found them I wanted to knock them out and hand them over to the guards. Solid plan right? I found them and saw them literally standing over a dead body. I approached silently and tried to choke them out, and suddenly they start talking to me. WTF?! They then tried to tell me that the body is still alive and I should have a closer look, which ends the conversation. They then back into me BECAUSE I'M STILL BEHIND THEM and draw their weapon. Hello? I'm still here you know? So I just choke them out a second time. Well apparently I shouldn't have done that because now the quest is broken. The quest doesn't progress, the guards are completely braindead and ignore anything I do with the body right in front of them, and I can't interact with anything else. The only thing I CAN do is kill them. Which is actually what the quest expects me to do. So I quite literally can't finish it. I then proceeded to chuck them around and knock them out until they randomly died without it couting as a kill in my statistics for some reason.\n\nAnother example, in the main story this time, is when I had to infiltrate a camp and sabotage their equipment. The camp is really linearly designed, there is only a few entryways, everything else has invisible walls. The game forces you to interact with it's disguise mechanic where you can steal armor of a faction and they won't detect you (in theory). So I did that. Nice, a quest where my playstyle works right? Well, no. Anything you do in the camp they notice, but not immediately. You do something and run away and some 30 seconds later some guy randomly approaches you and starts a fight, no matter if you were seen, no matter if you are around, no matter if you are disguised, they just know. I tried for an hour and it simply wouldn't work no matter what I tried.\nOk, let's try a different approach. I will wait till nightfall and sneak into the camp. Splinter Cell style.\nYeah no, even worse. They didn't see me for even a second, but as soon as I do anything, they know I exist, my home address, social security number, current location, Tinder status... it's a joke.\n\nI won't be finishing this game. It's too frustrating. If you're not like me and don't have the stupid idea of doing this as a pacifist, then you'll probably have fun. It's really sad because in itself the stealth system is really well put together, and it's so much fun to break into homes and rob them of everything, especially so because the homes are so varied in layout, but then the quests come around and trash everything. It's even sadder because the story is really good, and the characters are really well written.. :(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Kingdom Come Deliverance is one of those games that sticks with you long after you finish it. At the start you are a nobody who can barely swing a sword, and the game makes you feel that. But that is what makes the whole journey so good. When you actually get better, you know you earned it.\r\nThe world feels real. Not fantasy real, but like an actual slice of medieval life. Villages, forests, and towns feel lived in, the NPCs feel like real people, and the attention to detail is insane. The story pulls you in and the quests are way more interesting than your usual RPG stuff. Even the side quests have proper depth.\r\nCombat is tough at first. You will lose fights. You will get smacked around. But once you understand how the system works, it becomes super rewarding. Winning a duel or surviving a messy fight feels amazing because the game never treats you like a superhero.\r\nIt is not a fast or flashy game. It takes its time, but if you let yourself get into it, it becomes one of the most immersive RPG experiences out there. If you want a medieval game that actually feels grounded, with a great story, memorable characters, and gameplay that makes you work for your progress, this is 100% worth playing.\r\nOne of the best medieval RPGs I have ever played.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Skyrim quests: \n>go do this cave\n\nKingdom Come quests:\n>live a life of adventure and mischief\n>take a bath with Hans\n>get drunk with the corrupt priest and do his sermon in the morning\n>play a rollicking game of dice with an obnoxious illiterate lout\n>steal the necronomicon from the monastery library\n>more gay sex with Hans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Top class game the assassin followed the trebuchet builder to the fucking camp in rattay I had to kill him\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Painfully realistic in the best way. It’s clunky, unforgiving, and absolutely immersive once you get into it. Feels like actually living in medieval times.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The developers clearly did their research into creating a historically accurate medieval RPG.\r\n\r\nWhilst the game may have some problems, with the combat immediately coming to mind, as well as the balancing of the perk system, and the lack of some skills having thrilling or even any perks. This game could be seen as a test for the second game in the series, and in that regard this is a spectacular test.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's very nice game, but I highly recommend you to buy it at 80% off discount or more\nbecause it's not worth it for a full price (it has some really annoying bugs that the devs ignored)\nbut even that is still a very fun game and I love it\nI'm willing to buy KC2 after I'm done with this",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have mixed feelings about this game. A love-hate relationship. At times it's brilliant, at others it's tragic. It's a very specific game that requires a lot of forgiveness to be enjoyed. In many places, the game is simply unfair.\r\n\r\nOne very solid playthrough took me 105 hours. I finished all the DLCs (Theresa's DLC sucks), completed all the quests I liked, explored all the cities and locations, and accomplished a lot in this game, but I don't intend to play it again. Once is enough for me.\r\n\r\nI played the game without any mods because I wanted to give it a chance, but now I think I made a mistake, because even on my first and only playthrough, the game would have been much better with mods.\r\n\r\nA few things I didn't like:\r\n1. Combat - it was a huge disappointment for me. I waited a very long time for it to start providing any satisfaction, and it didn't. I had maxed out my sword, had the best longsword in the game, mastered the technique, and had about 20 strength (all of this took me about 70 hours), and I still felt like I was fighting with a rubber stick. After 70 hours, I was fighting with a rubber stick.\r\n\r\n2. Game glitches/stupidities. I'll cite three random situations that happened to me in this game.\r\n\r\nFirst, very early in the game, I went to Skalitz to complete the Scavenger quest (buried treasure). A group of soldiers were fighting in Skalitz. I waited in the shadows until they were dead, and when things calmed down, I went to loot the corpses. They were wearing a lot of great stuff, thanks to which my Henry had decent armor from the beginning of the game, BUT I exceeded the weight limit by about 500kg (xD). I thought for a moment and decided to do this mission (even though I was going extremely slowly). I went to the designated spot, dug a hole, and... fell in. I couldn't get out. Facepalm. I had to throw away 500kg of items, climb out of the hole, and collect them again. I won't say how long I walked to nearby towns to sell this gear; the whole thing took me hours. Later, when I was far from Skalitz, I realized I'd dug the wrong hole and collected the wrong treasure (xD), so I had to go back there later. But that hole situation killed me. \r\n\r\nSecond situation – it was already early night, I sat on my bed in Rattay and wanted to start reading, but a guard walked by and unfortunately, he was too close, so he approached me... and gave me a ticket for being in the city without a torch. I was sitting on my bed and had to pay the fine. Facepalm.\r\n\r\nThird situation – after a mission, I was teleported to the prison because I finished the mission by delivering a criminal. I was overloaded because I'd collected some loot during that mission. I tried to climb the stairs but couldn't. In Rattay prison, you have to jump on the stairs to get out; they're poorly made, and in seven years (the game came out in 2018), no one has fixed them. So I had to throw away a few things to climb the stairs. Facepalm.\r\n\r\n3. Plot - the fact that there is KCD2 saves this game slightly, because the main mission is not finished in this game and the game ends in a stupid place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Kingdom CUM, there isn't a better story/simulation/RPG game out there it's sooooo good",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Unforgiving and sometimes clunky game but it makes up for it with it's engaging gameplay, immersion, and very satisfying progression.\n\nIf you're a history nerd like me the immersion aspect alone makes it worth it, we need more realistic and historically accurate RPGs like this, 15th century Bohemia is a great setting and there's potential for other areas of the HRE to be explored, and it doesn't necessarily have to be made by Warhorse either (I think them being a Czech studio contributed a lot to this game though).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is great on its own, I just wish the story could be avoided. \n\nHenry is a terrible human being and I kind of wish his outcome was different in the beginning.\n\n... And... the combat is absolutely abysmal.\n\nBut, overall an enjoyable game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed this game. It really nailed a that classic rpg feeling I hadn't experienced in a while. The only time I felt dissapointed was when it ended. At least I have the second one to look forward to. 10/10 consider my pizzle yanked.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game starts out rough just like a lot have mentioned before me!  Fear not after a bit, and maybe not even your first few times playing it will start to click! This has become one of my favorite games I've played this year and up there with the last many years! I got it at a huge discount. But after knowing what I know now, I'd pay more. Well done Devs well done!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Took me 6 years to get through the first frustrating hours of this game. Well worth it. One of the greatest of all time for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game has a few bugs here and there and master strikes should have been done like in kcd2, but I'd say this game is worth every penny\nthe only really bad thing I can say about kcd other than the bugs is that stealth is way too easy, I got so disgustingly rich by just selling stolen equipment that I could've raised an army to fight Sigismund himself\n\nJesus Christ be praised",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "God damn GOOD game, i really wanted to play the second game tho, but i don't have money. this game is really good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "having to learn everything from scratch offers agame element i  have not seen in any other game, and helps drive the imersion into the story and world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is truly exceptional, reflecting a significant investment of time and passion in its development. The character's narrative is compelling, drawing players deeply into the experience and fostering a profound sense of immersion in their journey.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a awesome storyline and character depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic RPG open world game. Many people give up in the few first hours of playing and it is quite a steep learning curve, but if you can get Henry to Rattay things improve from there and the game opens up. Alchemy and brewing potions is your friend and also stealing of course :). Persevere with picking locks and it becomes quite easy eventually.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best immersive and realistic game ever made!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit jank, but really good story and RPG, I feel like a few dialog options are missing, but it's extremely rare, combat may not be for everyone, you only get good at it by grinding, not by skill, but overall it's an enjoyable experience, also don't be afraid to fail, it's often not a problem and can be very amusing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most immersive RPGs, with an incredible sense of progression and good itemization",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can easily get immersed with the in depth mechanics, combat, gearing, world. Played it many times and still have stuff left unseen. More worth the money then most games nowadays for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is INFURIATING in so many ways, from the actual game breaking bugs that have yet to be fixed despite the years, the awful save system, the combat style, and the 20 fetch quests that come from attempting one mission, but the story is fantastic! And the game is exceptionally immersive! The characters kept me playing, despite how enraging the game could become at times. I can't bring myself to saying this isn't a recommended game, despite its many flaws. \r\n\r\nIf you're interested in playing it, my god get mods, they are a life saver (literally lol). The only thing that kept me coming back was the beautifully written story and the characters who I fell in love with. I've been eager to play KCD2, but I really wanted to experience the first one before delving into it. I have no regrets in doing so, but my goodness the game has so many glitches. You will get stuck on terrain, your horse sucks, and you will end up dying and having to go back 3 hours because you didn't have a save snapps or because something glitched along the way and you can't progress the mission. I found myself having to Google a lot in this game and if I was the only one experiencing some of the glitches. No, apparently loads of them are well known and have yet to be (and never will be) fixed. Save yourself the pain and get mods! I cannot recommend them enough if you want to progress and make your way through this story. It's worth it :) \r\n\r\nI hear many of the things people complained about have been fixed in KCD2, and I hope they're right! I look forward to playing the next one and continuing Henry's story. It's a wonderful story that allows you a lot of freedom with how you want to progress with some of the missions, there's not a lot of hand holding and it is absolutely challenging. Definitely worth it, but on sale (because fuck the glitches).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] A Master of Character Development [/h1]\r\n\r\nI slept of Kingdom Come Deliverance for years, after seeing the success of the 2nd title I figured I would give it a go and start with the first in the series. I have to say I was absolutely blown away with this game. It both realistically and decidedly forces you into the role of a peasant with absolutely no skills and encourages you to develop him along his journey. Henry has to be one of the most well developed characters I have ever seen in a game, and I am thrilled that there is a second title to explore. The game is massive, and there is so much to do. The world design is excellent, the world feels full and dynamic something that newer open world RPGs have failed to do. Graphically, the game doesn't really hold up, it's pretty in some areas, but certainly shows it's age. I found myself having to push past the dated graphics, thankfully the story quickly draws you in. Now the big thing is the combat, something that initially kept me away from the series, it IS hard at first, but you do learn it and it becomes a LOT easier. I definitely recommend reading up on some tips before getting started that way you don't spend hours flapping around if you're a \"side quests before the main quest\" person like me. Something I found very clever about the combat system is that it does get easier as Henry grows through his journey. With many skills you get to see this really cool gradual progression that adds to the overall sense that Henry is 'growing up.' The game isn't perfect, and at the end simultaneously feels rushed and too long at the same time. I do wish that there were some characters who were more fleshed out or integrated into the main story and not just left behind because you finished their quest. I'm very excited to see how the second game grows from the first, I don't think I have the energy to do a second playthrough of KCD 1. I can already feel that having played this will make KCD II hit a lot harder, I definitely have to encourage folks interested in the series to start with the 1st title and do at least 1 playthrough, it is so worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I generally cannot play through single player games but this one I am still going and not done yet at 40 hours in. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game. i just started it and i like the story combat is kinda hard but i need to learn it. overall a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS GREAT.... REALLY IMMERSIVE BUT ALSO HARD so go play it instead of reading this review",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated to a crazy degree, I prefer it over the sequel personally. It represents the end of Bethesda's monopoly on this style of western RPG, not necessarily containing every single quality of the open world games of BGS and New Vegas, but being similar enough and making up for any comparatively lacking elements with unique strengths of its own. You can't create your own character and completely forge your own path, but the storyline you do participate in is much more finely crafted than that of any BGS game. The open world is a little on the cramped size, but it completely trounces those of Bethesda with its depth of immersive elements and amount/quality of random events to run into. Combat is an utter crapshoot much of the time, but this only serves to further sell the deadly nature of the time period. All of these elements and more combine to create what might just be the greatest interactive coming of age story constructed to date, an area the sequel doesn't excel quite as much in for me with its less consistent tone and comparative lack of focus. Regardless of whether I'm in majority here with this assessment, I do hope the success of this exceptional duology inspires more developers to pursue this sort of immersive, first-person, systems-heavy style of open world RPG. This sort of game design is too promising to be left solely in the hands of a studio as incompetent as BGS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Put it off cause of the combat for a long time. I was wrong. Fantastic in everyway, story, gameplay, challenging, immersive, fun, progressive, zero to hero. It really has it all but you have to get past the learning curve and that is about it. go play it you will not regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good setting and concept hurt by a bad combat system and some jank. \nWorth it on sale + mods.\n\nThinks that break immersion:\n- NPCs are buggy and have bad pathfinding. Slow reactions, same \"who's there?\" every time \n  you go into someones house uninvited. Facial animations are close to non-existent outside \n  of cutscenes.\n- Only the main character uses horses outside of quests.\n- Combat system is clearly made with 1v1s in mind, but the game constantly throws group \n  fights at you with archers and knights slapping you while you're in the middle of it. Too many \n  excuse this on skill issue and realism, but it's just bad game design.\n- Wastes your time with loading on map opening, sitting waiting for the fast travel, sleeping, \n  washing yourself, eating from cauldrons.\n- Impassable bushes everywhere is annoying.\n- Lack of wardrobe loadouts make the bad stealth system obnoxious as you have to \n  constantly take off your armour then put it back on for a fight piece by piece after.\n- Tries to be hyper-realistic, but ends up feeling a bit half-baked on execution.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games I have played. It truly sits on a different level and I still have not played anything that feels quite like it. It is not for everyone though.\n\nWhen it released it was rushed and unpolished, more or less unplayable at times. But Warhorse did a great job fixing it. Last time I played I did not encounter any crashes or major bugs.\n\nThe game has many interesting concepts and systems. Some are very well designed, others are good in theory but not always the best in execution, but together they massively improve the immersion.\n\nThe story is not anything exceptional by itself. I like it, but it is not a masterpiece on its own. It is pretty standard with themes like revenge, but the other systems such as combat, environment and progression make the story feel far more immersive than it might seem on paper.\n\nOne thing this game does extremely well is the sense of progression. I have never played a game where progress feels so natural and rewarding. Even in the late game you are not invincible.\n\nThe combat is the most unique part of the game. Some people really dislike it, but personally I think it is one of the main features that defines the game. It is clunky and unpolished, but when it works it is amazing. It is very difficult to make realistic combat feel good in a game, and considering this was their first attempt I think they did a very good job.\n\nIf you enjoy history you will appreciate the level of detail and care put into the world. Many of the characters are based on historical figures. The story itself is fictional, but the overall plot is inspired by real events. The codex is fantastic. I have never played a game where I actually wanted to read most of the codex entries",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a very good game! the inventory system can be a bit annoying at times, but the story more than makes up for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute cinema, graphics are really good for this typa game, sometimes it pisses me off when theres a bug. Overall a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "比较一般吧，没有想象中的那么惊艳。勉强给个及格。推荐史低购买。\n6/10\n战斗体验很差，一对多基本上只能放风筝\n有bug\n音乐和叙事还行，这部分比较满意\n对话丰富度不够，ai有时候有点傻。比如“贵族强盗”这个支线，我是在上一个任务后又过了好几天才去的，但是对话还是说“昨天”；而且这个任务我在傍晚接的，然而一众ncp没有一个带火把。有时候在结束了一个任务以后回去找npc对话，仍然和之前没做任务时候的对话差不多。提不起兴趣到处找npc瞎聊，因为很多对话内容完全重复。\n画质一般，不算强。\n找路很难受。尤其是矿井那几个任务。各种找东西，找人，找地点，非常考验耐心。\n[spoiler]不是，瓦勒度派为啥还有时间限制啊？？？这不看攻略谁知道啊……orz [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Steam had a rating somewhere between \"recommended\" and \"not recommended,\" this would be it. Aside from the main story, all the other missions are very boring and generally not worth the time spent on them, but the overall impressions of the game aren't negative. And once you get the hang of the combat system, it can even be fun to learn all the different combat moves. 6/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To put it simply, Kingdom Come: Deliverance is a janky game that I love more than I should.  KC:D does a lot to make it not beginner-friendly, but I really enjoyed my two complete playthroughs following Henry of Skalitz quest for revenge across a small section of Bohemia. If you like RPGs and aren't afraid of some rough systems, I think you'd enjoy it too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am absolutely in love with this game, amazing story, great graphics, detailed NPCs, it is just a MUST-PLAY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game checks so many boxes. As a fan of medieval lore, history, and culture, it's great. As a fan of sword and board gaming with creative and nuanced combat, also great. Great character work, depth of role-play elements and so much more. Quite tasty, to be sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really realistic medieval game that pulls you in and keeps you playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd like to start this off by saying that this game was gorgeous. Without fail, it scratched my itch for an early to mid medeval setting and did everything perfectly in that aspect. I could honestly just play the game forever by riding around and clearing Cuman or bandit camps over and over again. It's that enjoyable. Hell, despite how many people feel about it, I really love the combat system. It's a little jank, and the animations glitch a lot when you perfect block from too far or too close. But it really makes you understand why fighting someone in full plate armor while you have a longsword is a bad idea. And, when super high level enemies ARENT perfect blocking every single swing with a master strike, it'd pretty balanced. Enemies in groups will try and surround you without fail, and being surrounded in this game is pretty much a death sentence no matter how good your reflexes are. My only complaint, and I feel it's worth mentioning that I played on a controller, is that the targeting system is so godawful that I've died over a hundred times because it refused to switch away from the archer 500 feet away and onto the guy swinging a hammer at my face.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kingdom Come: Deliverance is a great game with plenty of strengths, but also some major weaknesses that drag the overall experience down. The gameplay is unique and fun, offering a grounded medieval RPG feel that you don’t get from many other titles. However, it can also feel clunky at times, especially during combat situations. Certain features — like riding your horse — can feel a bit off or unresponsive.\n\nThe game is fun and engaging, but it comes with its share of annoyances due to weird functionality, like not being able to save unless you find a bed or use Saviour Schnapps. The story itself is decent, but it’s dragged out for too long and becomes a slog to get through, with a heavy load of dialogue and cutscenes that can wear you down.\n\nWhile the game fits the medieval RPG theme extremely well, it often feels more like a RPG/simulation hybrid, which isn’t necessarily bad — but it could definitely benefit from some streamlining or optional toggles for players who don’t want the full grindy, sim-heavy experience. Those aspects can drain the enjoyment for both casual RPG players and veterans alike.\n\nIf that were the only issue, I’d give the game a 7/10 — good, with room for improvement. Unfortunately, the experience is also riddled with serious bugs, including near game-breaking ones. Save file issues can occur, and certain choices you make — in dialogue or through actions — can permanently prevent you from progressing. This happened to me personally: because I helped a certain group earlier in the game, my honor level was too high, and when I needed to fight them later, the game marked them as allies. This caused the mission to fail repeatedly due to “too many friendlies dying,” leaving me stuck with no way forward unless I went back to an older save and lost hours of progress.\n\nBugs like these, combined with the game’s unpolished clunkiness, hold it back significantly despite its potential.\n\nFinal Score: 5/10.\nThe game is unique, immersive, and fits the role of a medieval RPG/simulator extremely well. It has great potential and does many things right — but the bugs, clunkiness, and frustrating mechanics keep it from being the polished experience it could have been.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A wonderful game, good music, great acting, and a compelling story, clunky but immersive, 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first got killed like 15 minutes into the game, I thought I would never play it long enough to beat it since I lose interest in games easily when I die so early into the game.\n\n\nI was very very very wrong. This game really pushes you to keep going through the difficulties by sucking you into the world full of details and mesmerizing graphics.\n\nCan't wait to play the second one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes go buy this game, its cheap and ut will give you hours of story, expiration, and grind that is actually fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, the combat takes a bit of getting-used-to and leveling up/ training before it really gets good, but it's a well done progression imo. lots of content, just finished the main story and a decent amount of side-quests but there was still a lot I hadn't done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Easy to spend hours in it as there's multiple ways to accomplish a task.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PEAK game, i know quests are boring and all but you can just not do them and instead do side quests",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "KCD is a very unique RPG. I'm in love with this game and it's sequel, KCD2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredible game would defo recommend to anyone who like combat and medieval games already bought the second one and downloaded it so i can play it right after",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RPG's I've played in recent memory. The world is so immersive, and the devs make this game feel like you're a squire/knight in medieval times. The combat is tough to get a hang of but a lot of fun once it clicks. Play the side quests, there's a lot of good ones that really open up the world. Overall, really fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. very underrated. will definitely play kcd2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever, slight learning curve and the combat isn't for everyone. but the story, game play and all other mechanics are exemptional. will always recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A janky but incredibly fun game full of heart, soul, and passion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute gem. If you are craving an RPG right now, give this a shot and don't drop it after the first few introductory missions. make it out of Skalitz, and the game opens up for you to do whatever you want after that. Very open ended gameplay where you can have a completely different experience from your buddy's playthrough. You can be a straight thief, fencing every stolen good you get. You can be a knight, winning tourneys and clearing camps of bandits. You can roleplay as more of a noble and try to talk your way out of most situations (however combat is completely unavoidable in this game, you will need some combat training to survive!). worth the money full price, absolute steal on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute gem of a game.\r\n-A good story that acts as a perfect setup for the second game by introducing us the characters and conficts that will be fleshed out more in the sequel.\r\n-A really fun and unique combat system that takes effort to get into and although a bit clunky, it's really commendable how realistic and fun it still turns out to be in the end. Along with some really interesting and even fun game systems like alchemy.\r\n-Great choice and consequence in the main as well as side quests along with really well written dialogue.\r\n-Really beautiful landscapes and a very surprisingly immersive world despite the dev team being so small.\r\n-Can be a bit buggy sometimes and the optimization left a lot to be desired..(on an rtx 4070 laptop)\r\nAll in all I would recommend this game to anyone with a bit of patience to learn the game's system and would advise them to not try to work around them, but instead use them to make the experience 10x better and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is sick, took me a 2nd time to really get into it but when I did I couldn't stop playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a lot of fun. Can get grindy at some times if you really want to focus on maxing your skills but overall not too bad as you can play the game just fine and gain equipment and stats by just doing quests. Combat is interesting. It has the potential to be amazing, and I love how you can choose exactly how you want to attack as opposed to just spamming a single button that attacks in a pre-set way, but it can be kinda clunky at times and is hard to master. Even when you do get used to it, you aren't really rewarded for trying to do combos as opposed to just striking the target. In terms of quests, its a mixed bag. The main story is great and the dlc stories are a lot of fun too, however, some of the side quests can get a little annoying, becoming simple fetch quests. Overall, I'd probably give it an 8/10. A great experience and it really gets you engaged with the world, story, and the characters. \n\nA few tips to have a better experience:\n\n1. Take it slow\n-You can blitz through the main story and finish everything if you make that your sole focus, but I highly recommend not doing this. There is a ton to do in this game, and its a lot of fun to do. Rebuild Pribyslavitz, level up your horse, participate in the combat tourneys, learn alchemy, finish Teresa's story line, etc. The story does have some breaks in terms of the timeline and you can usually leave the main story whenever and come back later, but some times you can't do so comfortably without messing with the timeline of the story.\n\n2. Don't take the bandit's gear for use. Only sell it\n-Bandits periodically appear on the roads between cities and in the wild. Most of the time, their gear is crap, but high level bandits can carry some very strong gear. Taking all their gear can get you kitted out quite fast, but it become super easy to get max level items in the early game. I recommend that you simply sell the gear for the money and upgrade from the armor smiths and the weapon smiths, as well as the hidden treasure chests and quests. This will slow pacing down and always give you new gear to look forward to.\n\n3. Don't use the wiki unless absolutely necessary.\n-With the exception of brewing, just explore the game for yourself. You'll have a lot more fun trying to figure stuff out on your own\n\n4. Enable the bow crosshair\n-Aiming without it takes a lot of practice and I, personally, really don't care for it much. Just turn it on and it'll be a whole lot better\n\n5. Try out all the weapons\n-Yes, the long sword is the most fun and probably the coolest, but it can struggle against armored opponents. Try out the mace or the axe, and the hunting swords can also be pretty fun. Just don't use polearms. Not being able to store them anywhere makes them effectively useless unless you find one lying around.\n\n6. A bit stereotypical, but have fun\n-This game is a lot of fun, but its not for everyone. It can be buggy and tedious at times. I greatly enjoyed the game and believe my money was well worth it, but I can also recognize that it has a lot of flaws. Don't want to grind? Then don't. Don't want to do the side quests? Then don't. Don't want to listen to any of this advice? Then don't. For $30, its well worth the price and the enjoyment you can get from it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is in my big 3 of favorite places to go in gaming. The game demands patience, which I typically have none of, but managed to find it for this game. I feel this combined with the second game creates the complete KCD experience of going from inept apprentice blacksmith, to accomplished and seasoned Henry. 10/10 will continue visiting this place for many years to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game ever made. It's literally a teleportation to a carefree childhood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the single most immersive games I've ever had the pleasure of being bad at. 5 stars- I love everything about it- especially how hard it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible gameplay, open world, low fantasy, driving narrative. 10/10, no notes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played for the first time: I really liked it.\r\nPlaying for the second time: I love this game. \r\n\r\nWe need more games like this, and kcd2. Fantasy games are fun but sometimes it's also nice to switch to something historically accurate and start thinking how this word has been change for those times. The story is good, the graphics are amazing for the then small studio. There are things that are a little clumsy but it doesn't bother at all when playing the game. The first time I played the game, it also felt very difficult as the controls were very different from what I was used to. Hardcore mode is very good and I love how i just can die for starting the game. (I still need to finish my every negative perks run. Good things come slowly.)\r\n\r\nPerfect music, I love to play farkle and I don't mind to walk everywhere I go because of the beautiful Bohemian countryside.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RPG's I have ever played. If you are a purist, play vanilla, I hated the save system though so used command console to remove save potions and added the bow cursor. These two improvements alone made the game extremely fun. Yes the combat system is kind of jank (and only really designed for 1v1), but if you can get past some of the flaws, this is an incredible game with a world that feels alive and lived in. It reminded me of the first time I played Oblivion. Incredible game and cannot wait to play KCD2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't even know where to begin with this game. Truly an amazing experience. It's not perfect but given where the studio was when they made this, very impressive. There is definitely a learning curve but its worth it! My only major gripe is some very frustrating side quests, sometimes very limited to almost nothing to guide you, leading to me running to the wiki for a clue. But that could just be my lack of brain cells.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love medieval time period movies/games, this is a great choice. Fantastic game with so much to do within as well as some really great DLC. After you have exhausted yourself with the wonderful world of KCD, you can then go and explore the incredible new world that Henry gets to experience in the amazing sequel KCD2. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say about Kingdom Come Deliverance? TL;DR The game is engaging enough to drag you back in and make gameplay enjoyable, but not riveting enough to eat up your away time thinking about it. I give it a recommend, though I did wait for a sale before purchasing it.\r\n\r\nIn more detail ,it's a fairly pleasing combination of Mount and Blade meets The Witcher but without the extremes strengths of either. Mount and blade is a far more immersive war sim and The Witcher is a much more compelling RPG.\r\n\r\nRegarding difficulty, combat is likely to be difficult for players that aren't accustomed to so much involvement in a fighting game. It will lack the point and shoot of an Elder Scrolls title and may be frustrating to players that want to wander into the game like a god and kill everything they come across, but it's also satisfying as it requires some skill and sense to get it down once the game gets going. The game progression intends for combat to feel like a hard won accomplishment, and outside the scope of a person starting in the societal role your character begins in.\r\n\r\nGenerally speaking, the non-player characters are well handled and believable. There's a situation involving a specific lady you meet early in the game that was predictable in outcome, but I digress. The voice acting is adequate, though not always stirring, and occasionally suffer from Oblivion-esc \"the same voice actor did both voice lines, but the first one was generic, but the second was \"in character\", so the contrast is odd\", but even those situations are easily forgivable.\r\n\r\nThe main character is handled well, though for lovers of Femshep playing, it's always gonna be Henry, sorry. There's not a lot of modifying you can do for your character, but honestly he's played off well enough to be a satisfying perspective to be. Again, your character isn't a super hero, especially from the beginning, and he has a rather grounded, believable tone to him.\r\n\r\nThe story arcs are tropey, but reasonably well handled. Many times you can guess how something will turn out, but there's occasionally a surprise.\r\n\r\nAll things considered, I'd give it an 8.5 out of 10. It's an enjoyable game, and I'm looking forward to seeing what they do with the continued story. It's worth it a regular price, but I'm a budget gamer. 😅 Anything I'm not certain of, I always buy on discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most realistic and engaging role-playing games I've ever played is Kingdom Come: Deliverance. The entire experience is immensely captivating because of the meticulous attention to detail, rich narrative, and grounded combat. I had a great time and would suggest it to anyone who enjoys real-life medieval adventures.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best Medieval hardcore RPG i'd say period, The only downside i had was its merciless from the beginning to the point where it makes you think may be this game is not for you and you end up quitting like i did twice. Excellent progression system, practice and you get better at it and progress in your skills. Combat is unlike any other game out there, unforgiving at the start but once you get the hang of it you'll love it. Tons of content so far i've done probably 4 main story line missions, been doing side quests and activities all this time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, really immersive, lots of opportunity to play how you want to play. Everything you could want from a storygame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game!! \r\n\r\nThe combat system is very good, the missions are fun and the characters are interesting.\r\nI didn't expect this game to be this good.\r\n\r\n[b] I recommend it [/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It feels very immersive, especially with just how open the world is as you are able to interact with just about anyone. Also, it had a very good plotline that hooked me early on although I wish I was able to control a bit more of the dialogue in the cutscenes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decided to check this game out since I was thinking about buying the second one and wanted to get the full story. Definitely glad I came back for the story since they clearly are completely interconnected based on how this one ends, but the exploration, ability leveling, exploration, and the somewhat janky combat all grew on me pretty well. Didn't fall too far into side quest territory, but I had a good time with this one. I look forward to the QOL and overall improvements the second one has to offer while I continue my journey with Henry in the sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool story, very realistic and historically accurate. Characters feel very much a part of the game throughout. Fighting requires some planning. Kinda buggy, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is extremely hard when you start out, but slowly gets better as you play, you can play this game in many ways, some side quest are just crazy [spoiler]like this one time you need to brew 60 potions or when you need to give 60 meat to a npc [/spoiler] \r\ntldr you will need to spend a quite a bit of time to get the hang of the game\r\n[spoiler] i killed everyone in the monastery i hate them fr[/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if they say that this game is trash.......its bullshit i fucking love this game the story was great the combat is great most people just cant play the game because of that which is bull shit!!!!! i would play the fuck outta the 2nd one once i buy it..........this game i will replay again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this because I had no clue what was going on on the 2nd game and I wasn't invested in nor did I care about the characters. Within the first few hours of this I understood Henry's path to the 2nd game and felt like I owed him a little more than punching people in the dick and running away. For clarity that remains a valid and my preferred way to play the game, the game of life and this game. You have been warned. I got this one super mark down with half the DLC through a third party site, it activated on here fine. Good game, good series. Henry is no Arthur Morgan but that is an impossible standard I suppose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended for the loving portrayal of Bohemia as well as the unique combat system.\r\nSometimes clunky, sometimes broken, but full of passion and new ideas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of freedom, great open world, funny interactions, surprisingly investing story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Story, original game mechanics. But combat system is really bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A rough gem when it comes to immersion!\n\nThe Story is really good and was hooked from start to finish. Even looking back at past events revealed more after knowing the twist that the game throws at you. The characters are all entertaining and I really enjoyed the voice acting and dialog that were possible in game. \n\nThe Setting of Bohemia is one of the games strong points. I typically don't go for games that take place within the medieval era, however the amount of detail and care that went into the world made me get lost within all corners of the map. I really like the different locations that you can visit and the fact that they are fully based on real world places makes it even more intriguing. \n\nVisually, it still holds up after 7 years. Performance can be a little hit or miss sometimes. I only ran into 1 crash throughout my playthrough but this game definitely has the bethesda feel when it comes to some of the jank it produces. I really love the attention to detail and the extent of realism that is on offer. While some of the faces can look somewhat weird, the environments are just gorgeous to look at. \n\nSound and Audio were spot on with the soundtrack really adding to the immersion of the time period and the audio design feeling really satisfying, especially when related to gameplay. \n\nIn terms of Gameplay, this is one of the most immersive RPG's I've played period. I really love the leveling system were performing a certain skill makes you get better at it, just like in the elder scrolls series. I also really enjoyed the different ways that missions could be tackled and made it really feel like I could approach a situation my own way. It just impresses me the amount of attention to detail this game puts in to make this an experience that you can easily get lost in. \n\nThe only negative I would like to highlight about the game is its combat. I do like what they were going for with the directional inputs when fighting an enemy and sure it takes some time to get used to, however as soon as there is more than 1 person to fight, it becomes an absolute nightmare. While you could technically call this realistic for being difficult to fight multiple foes, the camera just makes it such a struggle to enjoy and feels like the game is fighting back at you making for some more frustrating moments. \n\nOverall, Kingdom Come Deliverance was an unexpected, yet pleasant surprise and has gotten me excited to experience the sequel whilst putting these developers on the radar!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game overall. One of the best RPG that i have played. Some bugs do exist in the game, but they are not major. I recommend the unlimited saving mod which saves a lot time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it takes time to get used to the combat system. It can be very frustating in the beginning, when it comes to fight multiple enemies. Also a lot of side quests and intresting things to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "although i have to fix a bug that cost 1m years of my life this game was pretty good you know the combat kinda ass but hey its a realistic game i dont care if i die 1000 times to the same enemie",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An enjoyable medieval simulator overall.\n\nThat said being \"realistic\" is not an excuse for having frankly a lot of questionable game design choices. Quite a lot of game mechanics were not implemented very well either. EG the Monk quest or the Women's lot DLC (Part 1).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is easily in my top 10 games of all time. beautiful scenery, amazing story character and story telling. its a little bit difficult in the beginning but with some qol mods and some money cheats to help you get going with some good armor and  a weapon, it gets easier. highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had another play through recently in order to get back into the story to ultimately play KCD2. This game absolutely still holds up still today and is now responsible for messing up my circadian rhythm /sleep cycle.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I'm not quite sure why the game has so many good reviews. It's rather clunky and dull. The combat is just awful, the interface, character sheet and inventory is unintuitive. I've heard it takes a while to get into it but after six hours my brain was leaking out of my ears.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "KCD is a very flawed game. On a technical level, it feels clunky to play with how stiff the movement can be, the odd topography and vegetation making traversal off the main path feel inconsistent, and with no shortage of bugs on top of everything else. While on the gameplay side, there’s a mix between mechanics that feel as if they were made awkward on purpose for narrative reasons and those that feel either detached from the rest of the mechanics or very underutilized. Some good writing and a strong historical footing do help it somewhat, but probably not enough to make it a valuable experience for most people.\n\n—-------------------------------------------\n\nStarting with the gameplay, the beginning is extremely rough. Being a blacksmith by trade, you obviously start the game without many other skills. Your swordplay is slow and stiff, archery is wildly inaccurate, and just about everything else is barely useful either thanks to the ability itself being worthless or your skills being so low that you need to use the system a lot before it becomes worth using. Even worse, the combat skills are broken up into swords, maces, and axes so even getting good at one will hardly help you with others. From a narrative perspective this makes sense and all. They’re trying to emphasize how out of your league Henry is at the start of the game and build up his abilities in line with his character growth. And while I can’t fault that, it does still make the early game a very annoying experience and I could barely stand the combat until at least 10-20 hours in. But even beyond that point the combat never becomes good and instead feels like an occasional chore rather than a genuine challenge.\n\nWithin combat, the gameplay is extremely stiff. Melee revolves around directional inputs which change where you swing your sword and where you defend, plus a few reaction-based elements for a parry or dodge. Because of this, the lock-on is an essential feature of combat since you need one stick to control your movement, strafing while facing the enemy so neither of you can get in a sneaky hit, and the other for looking around. This works fine against a single foe, but against multiple the lock-on becomes a huge disadvantage since it's very sticky to your current target and takes time to switch away, meaning you can see an enemy blow coming but can't block in the right direction or swing at a valuable target because you’re still locked on to somebody else. Meanwhile the directionality of the swings and blocks is stiff and unresponsive, preventing me from doing what I intend even after many hours trying to wrestle the system into submission. Again, this makes some sense from a narrative perspective as you’re not meant to be a killing machine or anything similar, but when I’m struggling even against some basic foes something has clearly gone wrong.\n\n—----------------------------------------------------\n\nOutside of the combat, the rest of the gameplay is also quite rough. There are lots of skills but most of them are so marginal that they barely seem worth including. Herbalism makes you better at picking herbs which are then used to brew potions, but both of these mechanics are extremely slow and the potions aren’t all that helpful anyway. Hunting lets you get more meat and skins from animals, but food and money are both so plentiful that it hardly seems worth it, not to mention what a hassle hunting is in the first place. And some might as well not exist like Drinking, Houndmaster, Unarmed fighting, and a few others. The only abilities outside the combat which felt useful were Speech, Reading (you start off illiterate so reading is actually quite important to learn), and lockpicking/pickpocketing/stealth though the latter few are pretty situational to your playstyle.\n\n—----------------------------------------------------------\n\nThe open world looks good at first but ends up feeling quite hollow. Most of your time will be spent in the game’s various towns and cities rather than out in the wilderness since that's where most of the quests are. While there were some attempts to populate the rest of the world with interesting stuff (accidents along the road, buried treasure, random encounters, and occasional bandits) it really isn’t enough to make the roads anything more than an area to pass through rather than anything worth lingering around for. And while there are some abilities that are meant to make the rest of the map more meaningful (like herbalism, hunting, etc) they really don’t do enough to change the fundamental issue that there’s very little benefit for the amount of time you spend there.\n\nIt also doesn’t help that anything other than sticking to the main roads is very messy given how stiff the movement often feels. Me and my horse will easily get stuck in some bushes, along a creek, on a fence, or any number of small impediments. You’re unlikely to find much of interest by looking around as all the big secrets are nestled in pretty obscure spots which means trying to explore will just end up with you combing a whole area and maybe not even finding anything as a result. Outside of the first ⅓ of the game I tried to spend as little time outside the cities as I could manage.\n\n—-----------------------------------------------------------\n\nKCD’s strongest aspect is definitely its atmosphere. Both the urban and rural environments do a good job at capturing a specific feel which feels both true to the time but still recognizable. Visually everything is quite good even if there isn’t much variety between buildings. While the scale is obviously off by quite a lot, it's never so absurd as to throw off immersion since you’re not in any of the major parts of the country where this kind of scale would seem outrageous. The focus on realism over gameplay does contribute in this regard, making Henry feel like a part of the world rather than some sort of player-controlled aberration. He learns and improves over the course of the game but never becomes overpowered like you might see from a similar title.\n\nThe story also contributes a fair bit to this sense. While the game starts with your home city being razed by a pretty large army, this is much more of a stop along their way to more important areas rather than a meaningful theater in its own right. Your fights are much more restricted to the smaller forces left behind in the area and various bandits & mercenaries who are taking advantage of the conflict for their own ends. The characters are generally good, being minor enough in the grand scheme of things that their actions aren’t a huge force on history but they’re still clearly influenced by events much larger than themselves. Henry is obviously the star here in showing a believable trajectory for his growth over the course of the game but the other major characters manage to fulfill their role quite well, particularly Hans and Radzig.\n\n—-------------------------------------------------------\n\nI couldn’t call Kingdom Come: Deliverance a good game. I can certainly see a vision and foundation here with a lot of promise, but the execution falls flat more often than it succeeds. But with the additional experience and resources, I can easily imagine the 2nd game being a very good time and I look forward to playing it eventually.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "A lot of stuff to do but no purpose to do them. like an empty sand box of nothing worth doing. you can hunt but u can't carry what u hunted because it is too heavy. u can stealth in the game but it is buggy so it doesn't matter u will still get caught. you can pickpocket but actually no u can't why? because you need to pickpocket first to level it up and you will always get caught. it is a bad simulator filled to the brim with bugs. the story? just watch a summery. all the quests are fetch quests. the combat? it isn't fun like everyone says because it is buggy and repetitive. the visual are filled with bugs too, no immersion at all. most of the time you will fight with bugs more than enemies. probably the second game is way better so don't waste your time with this utter dogshit and watch a summery, even the developers are saying u don't need to play the first game because of how much of a mess it is. sad because I tried my best to immerse myself with the game and like it, but it always finds a way to break the immersion with it's bugs or the lack of options and answers to my actions. it had potential but it was all thrown out of the window because of the amount of useless buggy mechanics. A shame because the writing is superb.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h3]The combat here is even worse than in the second game. I only wanted to watch it for the story, but it's painful to play. Watch the gamemovie on YouTube instead.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "The game is requiring you to use an item to save so, your save is very limited. Then, they designed the quests that clearly needs manual saving even quick saves. Poorly thought out design, I'm literally dropping the game. If you have a full time job, don't grab this game. This game waste so much of your time that could've easily be addressed by quick saves or normal saves in game. If you're a kid with no job, no chores, and no responsibility, no life get the game. If not, just pass on it. It will just waste your time and you will find that the cause is mainly the saving system.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There are two games with the best open worlds ever made: [b]The Elder Scrolls III: Morrowind[/b] and [b]Gothic II[/b].\nWhat makes them so great? Two things: they’re packed with places to explore, and exploration is actually rewarded.\n\nFor example, in these games you can step off the main road and stumble upon a smuggler’s cave, an ancestral tomb, or the ruins of an ancient fortress. If you take the time to explore, you’ll always find something interesting — maybe a weapon, some armor, or even a legendary artifact. Who knows?\n\nIt’s a pity that the open world in [b]Kingdom Come: Deliverance[/b] lacks these qualities.\nSure, the sheer size of the map is impressive. But what’s the point of having such a huge world if it’s mostly empty or filled with nothing but generic trees and bushes? Why spend ten real-time minutes riding your horse across dull plains, only to encounter a random gang of thugs? The game simply doesn’t reward exploration at all.\n\nI think I know what this game reminds me of. There was a really old RPG for the Amiga called [b]The Faery Tale Adventure[/b], and it had the exact same problem — vast, empty fields with a few scattered enemies.\n\nAnd with [b]KC:D[/b], it’s not just the open world that feels uninspired — the quests do too. They almost always boil down to “kill some nameless bandits in a random camp,” “bring me ten pieces of meat,” or “steal some random item from a random NPC.” Sure, there are a few exceptions, like the quest where you get drunk with the priest — but even that one stands out only because of the cutscenes, not because of the gameplay itself.\n\nLet’s go back to [b]Morrowind[/b] for a moment. NPCs there were pretty dumb — they’d often run into walls and get stuck — but at least that was back in 2002. In [b]Kingdom Come: Deliverance[/b], NPCs are on about the same level of “intelligence,” if not worse.\n\nAnd don’t even get me started on the combat. It’s either extremely simple and boring (if you use master strikes) or just plain boring (if you don’t).\n\nOverall, a huge disappointment.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "First impression: endless cutscenes, I'm already bored. But the real problem is how clunky the controls feel from the start, and the tutorials are downright poor.\n\nThere’s apparently no better way to learn horseback riding for the first time than while being chased by several bow-wielding riders, dying at least ten times in a row just trying to figure out the basic controls. Fantastic. I can’t wait to see what other masochistic scenarios the game has in store. \n\nUninstall.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "in this game u play as the biggest pussy of all time and then 20 hours in u keep being a pussy and nothing has changed",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Slow, boring, fighting mechanics are awful, inventory and menus are ugly and unnecesarily complicated, long cinematics, poor action scenes. Asked for a refund. Not fun at all. At least, in my opinion.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i dont understand big phenomen behing kingdom come\nbuuut lets start with what ive liked \n+ graphics are very nice \n+ easy to learn hard to master combat\n+ very nice story \naaaand now the trash hidden behind corner:\n- game promises multiple archetypes that u can play as but u can not really avoid conflict so if u counted to play as golden mounth that talks its way out of the confilct u will fail \n- there is little to no toturials beside walls of text, thru 20h ive encountered only three \n1. lock opening\n2. stealing \n3. combat \n- your character sheet has like over 25 diff stats its way overcomplicated \n- there are multiple mechanics which exists just to be, without putting any explanations to them soo u need to play with your phone all the time for example u need to wash yourself at any given oportunity or many charisma checks will start failing, whats next? i need to go to bathroom or ill shit my armor?\n- LET ME SAVE WHENEVER I WANT \n- game dosnt follow good desing patters, \nfor example (spoiler warning): ive got a hunting quest (which ive actully liked) but as it was hunting quest (2h quest more or less) ive took light and sneaky gear bec what u wear changes drastically your pefrormance, after the quest u return via cutscene to the base and u are informed about the fact that next quest will be combat quest so i want to change myself into armor at my house and repair gear before proceeding but i cant bec my reputation drops if npc is waiting for me \n- game throwed at me multiple times random encounters (at starting location) which i had no chance to win\nbesides \"wash your ass mechanic\" there are only few activities in game (thru 20h of gameplay)\n1. gambling (quickly becomes boring)\n2. fighting (i guess ill take that)\n3. talking (charisma checks are annoying as f)\n4. hunting (until u exp up archery its game of luck bec arrow basically flies into random direction)\n5. stealing (u will land in prison multiple time)\nNOTE: i avoid watching internet toturials as much as i can bec learning mechanics is fun by itself (and in good game u should not need it), but here game just starts asuming that u already know everything so i actully needed to check internet for some info",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I thought the game was great right up until the first combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the best RPG's I've ever played, bordering simulator in a lot of aspects. The things this game does right are 11/10, and I don't think I've played another game that is able to be this immersive (maybe KCD2 when I play it next).\n\nIt's unfortunate with that said, that I cannot recommend this game in good conscious. I'll list things below as to why, but if you're just quickly looking at the reviews, this game is going to constantly make you want to uninstall it, and I do not think I have ever lost more of my will to live (even from having corrupt save files and needing to start over with other games) from anything else.\n\nFirst frustration of this game is the combat. It's basically any lore for a FromSoftware game, to which I mean it's ambiguous, requires the player to do considerable digging on their own to understand 10% of it, and you're honestly not going to make sense of it till you watch a YouTube series. Only now am I finally getting comfortable with handling things, but as a new player get ready for misery and suffering. You will lose, over and over, and die, where honestly you may as well have afk when the fight began because you made a mistake by even getting caught into combat. It does come down to considerable understanding of the mechanics and skill, but there's also just flat out % disadvantages you have no idea about that will decide the outcome. Which in of itself wouldn't be the worst, since there is at least some breadth and skill put into the system, leading us to the next thing...\n\nThe save system. Unless you set your phone to remind you every half an hour to manually save (which costs a limited early game resource that you realistically will not have any more of for a while), don't even bother playing this. Decided to leave the town? You came across 3 bandits, game over. You will not win as you have no armour or decent weapons (you're also an illiterate child defending yourself with a spoon, considering you haven't improved your combat stats yet). You cannot run away, as they will run you down and kill you as well. And all those dialogues, herb picking, alchemy, reading, etc you've done need to be done again. Trying to simply follow the starting quest line? Whelp you left town to do so, and got ambushed. Alt+F4, it genuinely will be faster. In order to succeed in this game early, you are going to grind tedious actions over and over to just barely have a chance. And if you didn't save in the last 30 minutes, get ready to pick 50 herbs, 1 by 1, with a 5 sec animation per, all over again. Now that this game has trained me through paranoia and raised blood pressure, I don't lose much progress when things inevitably go wrong, but for a new player I hope you enjoy being bored doing the same thing you just did for the past 2 hours again, and you paid money for this experience.\n\nNow to the things that are less opinion based, and are genuinely just complete failure of the developers. \n\nYou can't change gamma or contrast. I get immersion, but this is the most basic of settings. Might as well have forced me to not be able to adjust the volume, or looks sensitivity. It's so weird not to include this, and things will get so pitch black that your monitor may as well have been off.\n\nYour dog has a collision box. That in of itself is fine, except your dog AI will make it push you, effectively pushing you out from stealth or off a cliff (both happened). Furthermore, you can't push him. So get ready for an annoying burden that will stop you from picking flowers, get you killed/detected, and trap you in buildings.\n\nNo indicator for timed quests. Something may be timed, and you'll need to rely on perfect focus of what everyone says, or Google (which if you're gonna Google every quest, whats the point of an RPG?). This was fixed in KCD2, but for the first game get ready to just outright fail things because you didn't know. And unless you phone buzzed telling you to save 30 minutes ago... you're gonna have to redo a whole lotta stuff if you wanna change that outcome.\n\nThis is an amazing game and one of my favourites, but if I knew about the hell and mandatory watching paint dry, and then doing it again because that 15 minute cutscene into un-pausible dialogue back into cutscene and now into combat didn't let me save, I would have just watched someone else play this and saved my money.\n\nUpdate:\n\nI've now hit multiple crashes, as well as soft-locking bugs (constantly stuck in combat even with no enemies around, preventing saving and quitting) and need to use dev commands to break free. Don't play this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy as hell. So many times I was confused at quests just to look up online for it to say the quest was broken because of a glitch. This wouldn't be too bad if I could just load a previous save, but saves are limited to items called savior schnapps (outside of sleeping in a bed you own). So that being said you don't save as much, leading to my last save being over an hour a go and 3 quests ago, so I'm not going to just redo all of those just to unbreak a side quest. I can't recommend it due to the fact its been around 7 years and this game has a lot of bugs and glitches that halt the already slow story.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First time in my entire life i saw so many bugs and glitches in a game that came out 7 years ago, i couldnt even finish the last mission of the main story because my soldiers keep bugging on the same spot and left me alone to fight 10 enemies. Alt F4 and uninstall instant. I hope KCD2 isnt a constant glitchy flop and stands on the hype.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to like this game and it has a great storyline, non linear play and an open world. BUT it is too aimless and you are often stuck doing tedious tasks, you have zero skills in the beginning, and no sense of direction. There is literally a quest where you just walk around the castle doing nothing for hours, as you are supposed to stand guard waiting for something to happen but nothing happens. Then the next quest happens and you are supposed to rob the armory and you go in there see a bunch of weapons and go to steal them, a menu pops up and there is nothing to steal. It's pointless, frustrating,  and  Its so boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You just worked eight hours, eager to hop into a beautiful world of adventure. You fast travel to your next quest point, and get a prompt saying you've been ambushed. You fail to evade and proceed to get steam rolled into oblivion by a rinky dink band of barely dressed bandits with wooden clubs that ignore your plate armor. \n\nI'm only rating negative because Steam forces you to choose one or the other. I don't hate the game, I don't love it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very bad fighting system. Story is actually ok. But the worst part is that there are parts in the game where you either are stuck and cannot continue or you have to load a save game a couple of hours back... very bad experience and i cannot recommend this and will also due to this reason not buy the second game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a difference between difficult and FUN game - and KC:D is neither of those. Its a very messy and complex simulator of XV century European peasant live, where you can do all kinds of bullshit: get drunk, pick herbs, train in martial arts with all kinds of weapons, learn to read in Latin, yada yada... But this level of detail and depth is almost detrimental to the \"gameplay\" experience it provides.\nIt doesn't have good combat system and any fight with 2+ opponents can result in instant death (mostly yours). Guess what is the solution to this? Grind melee skills for 10 hours in arena or get one sword from somewhere to one-shot your opponents. How do you know this? You don't. \nMost of the quests at the start of the game are timed and you basically need to spend 10+ hours to actually get to the point when it allows you freedom of exploration or time to grind skills that you need. This also is actually impossible to know - until you encounter another timed quest that requires you to brew potions, poisons, fix armour and read at the advanced level. You didn't know that for this action you had to choke a guy like 50 times at the starting location to get required stealth level? Skill issue I guess.\nHell, if you starting this game without any guide or plan on what playstyle you going to have, which skills to level up and where to grind them the fastest (and without basic QOL mods) - you gonna have a BAD TIME.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i like the game but combat is worst than any game i've ever played. the combat needs to be simple not complex.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A good game riddled with bugs. Some of them gamebreaking. Cannot recommend games I cannot complete.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah everything is ruined by the shittiest combat system in any game in history.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The inability to quick save without having to purchase quick saves using in game currency, of which, are INSANELY expensive, turned me off from this game. It's brutal and you die often, and then the last 30 minutes of your gameplay is wiped out. I'll pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good story. Fun gameplay. Bugs ruin the game. Don't waste your time and money on this game. I get infinite loading screen after trebuchet test (a 110 hours run). Some people fix it with cheat engine, but it doesn't work for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The 'soulful jank' is when the game softlocks or forces you into the most tedious mechanics because wasting your time as a player is what goes for realism. Combat is just terrible - reminds me of for honor, where no one would ever land the first hit in fears of being countered. Here it's being masterstrike'd, which turns the game into waiting for a green shield to appear in the center of the screen to press q. Immersive!\nGreat story and characters, though. Watch on youtube.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i didn't come here to seek a frustrating experience...can't deny that they tell a good story but1. i can't stand the fighting style, sometimes i just can't fight back even after i tried so many times\n2.operating this game turned out to a burden to my laptop's cooling system ,which had no problem playing other 3A games\ni just wanna go through the whole story ,why is it so hard? almost impossible to complete some tasks without looking for other players' advices or wasting so much time wandering around",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great story telling and rpg, like truly incredible. \n\nbut this has been one of the buggiest games i have EVER played, and gets worse as you get deeper to the point that i struggled to load saves that were made in buildings late game because i would spawn stuck in the floor.\n\nAlso the combat is rather difficult, and late game when they start throwing half a dozen plate armored guys who will masterstrike every attack you make as a casual combat encounter was KILLER, to the point i quit this game for several months, twice. i eventually found a mod that made combat dumb easy so i could finish the story, endgame quests were quite nice to finally see.\n\nAlso whoever gave bushes hitboxes should be shot.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Interesting narrative, beautiful environments, excellent sound design.\nTerrible game design, feels like every mechanic were made to be frustrating. The intention of making it hard at the beginning is understandable, as you play as a peasant during the 14th century, but systems are messy. Fighting, after being unbearably difficult at the beginning, somehow becomes way too easy at some point.\nQuests and interactions are full of bugs. Character got pursued and ended up in jail for doing nothing.\nJustice is already almost nowhere to be found in real life, it appears you won't find it this game either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was willing to overlook the many flaws as long as the devs were genuine and didn't sell out. They did, so now I'm not. \n\nIt's the blandest, buggiest embarrassment of a game to have ever been created. There are Mount & Blade mods that do this game's shtick better with less bugs. The voice acting is awful, the story is so generic it wraps around to endearing before continuing right off the cliff to horrible again, the combat is so lifeless you just sit still and tap parry in any 7 business days before getting hit over and over, the AI so bad it makes stealth 100 Skyrim archery gameplay look like Metal Gear, borderline nonfunctional pickpocketing system that physically doesn't work below 60/100 skill and real life days on end of grinding, and the bugs make the unpatched release day STALKER games look stable. \n\nEvidently being a lucky runaway success wasn't enough for them, as they felt the need to sell out to interest groups and make a sequel that's little more than a thinly veiled political advertisement stitched together with cutting room floor scraps as well, so any hope of patches or improvements is gone as well.\n\nTruly the worst purchase I've ever made",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this could be a great game, but I can't get past the save feature. I've been drunk for too long and cannot continue this way. I prob won't be playing this again. I'm sure this is a fun game otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Game itself is great but the Combat is made for 1v1 fights as soon as there is more than 1 Enemie you hardly stand a chance that kinda ruins the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I read that Kingdom Come 2 weas good, so I bought the first one for 4.50, a bargain... well pay cheap pay twice its total rubbish, its so slow and painful to play I've given up... graphics are fine and story is fine but the gameplay is so weird and hard to get into... its created in an unusual way by someone whose tried to make it totally different to all games of this genre and IMHO it doesn't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the story but I just can't finish the game. The combat system is so horrible that no matter how much I know about it I just can't keep up. 5 sides you can swing your sword PLUS a piercing attack PLUS you have to rotate your shield correctly to any incoming attack? I hate it, it's a shame I spent almost 15h on this game so i cant refund it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is honestly the only game in history that has ever raised my blood pressure. everything about this game is an absolute joke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat system is unbearably broken to try and learn mixed with the save system leads to restarting 10 minutes to an hours worth of gameplay when you get jumped trying to travel anywhere. If the combat system was more balanced and allowed the player to actually fight back instead of you losing your life every time you take a step forward.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to love this game. It has a good plot, the backgrounds are great. the story is interesting.  I hate the combat system. It is clunky and difficult and ruins the game. I think this could have been one of the best games around but I do not have the time to try and sort out this major flaw. While the developers tried to present this as new it just fails at every level. It is certainly not real life. For the love of KC please develop a patch which has a simplified combat system. It might even be commercially profitable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boy, oh boy...where do I even start.......this is an amazing idea, unfortunately done too poorly! As a former HEMA practitioner and medieval reconstructor, the combat system hit home with me!...But unfortunately the negatives outweight the positives on this one - frequent crashes, blackscreens, too long loading screens, frequent loss of sound, NPCs being displaced all over the map that shows them being in a totally different location, shitty auto-lock system that doesn't work half the time......Me fixing almost all the issues just for it to come back the next day...too bad, what could've been an amazing game turned out to be too much of a frustration. I don't even think I'll be finishing the storyline. just hope the 2nd game is not a buggy mess like this one. I came here looking for a CZ Shadow 2...and all I got was a SIG 320. I came hoping for a Jiří Procházka and all I got was Johnny Walker.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've only played this game for a handful of hours, and honestly, I'm having a hard time staying invested, which is honestly a shame considering how much detail they put into the story and lining it up with real world history. However, the game is incredibly punishing in combat, and the limited saves, while a good concept, only compounds this problem by having to go back potentially hours for any mistakes.\r\n\r\nNot only that, but the combat feels clunky and unoptimized. Maybe it's just me, but I felt like any time I actually landed any hits, I was just getting lucky. I understand the enemies shouldn't be just punching bags, but there's a difference between challenging and unfair, especially when the enemy can string three or four strikes together while you're still gasping for breath. The swings and thrusts feel awkward, the enemy blocks everything, and good luck if there's more than one of them.\r\n\r\nOverall, I feel like there's lots of potential, but there's just too many things stacked against you for me to get into it, which is a shame since everyone claims the second game is really good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If only the game wasn't prone to crashing often I would give a positive review. The way the save system works, you have to either sleep, drink a save potion or progress a quest. Losing 30+ minutes of progress because of a random crash saps the joy out of this otherwise masterpiece.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is bad might be a skill issue lol but no fun to be had for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to say first of all that this game was designed by some incredibly smart people. There's a rich storyline here, fascinating characters, big battles, secrets, all sorts of cool stuff.\r\nBut I couldn't make it past some of the easiest challenges, and there's no easy mode or proper tutorial, so I cannot in good conscience recommend this game to anyone.\r\nI've tried playing this game twice now. The first time I rage quit after I couldn't make it through my first sword fight, which the game presents as a choice of fight or flee, but if you flee a woman is definitely getting assaulted, so it seemed too messed up to just run for it. The second time, I swallowed my gut feelings and fled like a coward, but now I've rage quit again after not being able to pick even the simplest locks. This game is too hard and not in the fun way.\r\nThere's only written instructions, and an incredibly brief tutorial/intro sequence before all of the punishingly hard game mechanics lock into place. So if you skip your one free sword lesson because you prioritize helping your family, then you miss the only non-deadly sword training before you're thrown into combat. During that sequence, I tried to learn how to pick locks, I really did! But the mechanics are hard to understand, and the only way to learn it is by picking the actual locks in game. And of course when you fail your attempt (because it is HARD to do!) your pick breaks. And of course you start out with almost zero money, so if you break them all just trying to learn you're completely boned.\r\nThe game should have a free play tutorial mode, just for the game mechanics. I'm not saying make the game easier, just teach me HOW the game mechanics WORK before forcing me to suffer the consequences of failure in game. It's like you're punishing me before I even know what I'm supposed to be doing, how is that supposed to be fun? It's just frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the story pulls you in form the start, so you really wanted to get into it. But i found the game play and combat frustrating. quest that bug out. and you have to replay a lot or start over.\r\n\r\nIts a really slow slow slow pass game. lots of cut scenes(nice) but also boring tasks to slow it even more. stamina drain is huge, at the start making everything take even more time or shooting 1 arrow into a marathon. The world may be big but if you want to survive there a really narrow path you can take or you just die or fail.\r\n\r\nIf your looking for a skyrim like experience this is not it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy alot of this game but I can't recommend the save system is horrible and I've had the game force close a few times and lost over an hour of painful progress",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would like to enjoy the story, but bad game controls and \"game mechanics\" prevent me from having any fun.\r\nThe game controls are made for console (don't know if they work there) and don't really work on PC with mice and keyboard. The save system is painful. There are mods out there to enable quick-save, but there is no steam workshop for this game so you have to download stuff from random untrusted websites.\r\n\r\nAfter more than 1 hour of trying and reading the web, I still don't know how to get a horse to gallop reliably.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first 10-20 hours of this game are such a kick in the fucking balls. You play a lowly servant boy, yay! So much fun! You run a bunch of boring errands to start, with clunky controls I might add, you get into a few fist-fights early, and the clunky controls make that a ton of fun as you get your shit pushed-in repeatedly. Then, when the game \"starts\", you have absolutely no chance of surviving any encounter at all and just have to run, and run, and run, and run; make 1 mistake, and you're dead. I get it. We're not supposed to start off as anything at all, but holy shit does it make you just not want to play after a while. It's so much fun playing a game wherein you cannot complete even basic quests without getting the shit kicked out of you for even trying for the first 10-20 hours.\r\n\r\nBut hey, if you can get past that 10-20 hours when Henry actually has some ability to do anything of merit, sure, it can be fun... but enjoy punching yourself in the dick during those first 10-20 hours!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game wont let me finish quests as when i am getting started important NPCs wont spawn and it kills the whole game for me i hate needing to load and load and load the same save or a save from forever ago",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK THIS GOD DAMM GAME. i bougth it a few years back and it work fine and was fun. not anymore. YOU CANT EVEN PALY IT. fulscrren on or off. when you start the game it goes completly black. (thats why i said on or off. even with windowed it still makes the WHOLE screen black). honestly fuck this. they somehow introduced a bug that amkes STARTING the game no longer possible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot disable head bob and none of the mods I found appear to work.  Its unplayable for me.  Very disappointing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has lots of issues , infinite loading screens , saves that fail loading , game thinks I'm in combat BUT IM NOT so it forces me to reload a old save ...  i just can't stand it anymore , in my 10 hours of playthrough there is only about 2 hours where i can say i had \"FUN\" , the rest is just dealing with issues , i wish i could just finish the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat kötü, save sistemi yok doğru düzgün. Quest sistemi bug'lara çok müsait. Bir quest'te takılabiliyorsunuz çok rahat bug'lar yüzüne. Quest'lerin içeriği çok kalitesiz ve zaman kaybı. Hikaye fena değil, açık dünya vasat sayılır.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kind of trash cuz it keep crashing when i play plascid plastic duck simulator execpt that its a good game but if they don't fix this issue i might give up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Story is amazing. Everything else about it is terrible. Controls barely work, gameplay is buggy. Some of the tutorials straight up do not work. The \"Run\" missions is literally impossible, a cuman chases you that you have to run away from but you can't escape. I don't know if the game is bugged or something but this game is terrible. Which is a shame because the second game is a masterpiece.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A decent game buried under an avalanche of optimization issues.\n\nMy specs are FAR above the minimum requirements, however the game is plagued with FPS drops, stuttering and lag. After a few hours of tinkering with settings, I was finally able to get the game to a playable state, but then I encountered a whole host of issues with the mouse inputs. VSYNC, Motion Blur, HD Textures and Fullscreen Optimization are all completely broken features that introduce tons of smaller issues. I figured I'd at least be able to run this game in Medium/Low settings after playing it with no issues on my Xbox One nearly a decade prior. Extremely disappointed with the state of this game on PC in 2025. \n\nSTEER CLEAR OF THIS GAME UNLESS YOU EITHER HAVE A NASA LEVEL PC OR ARE VERY COMFORTABLE TINKERING WITH SETTINGS!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Much like the second one the game is riddled with bugs. The second one I cant even play bc it CTD the second I try to load in. This one, theres just insane bugs that wouldnt be so bad, if saving wasnt so hard. Its not that you encounter unlimited bugs, its that you lose 40 minutes of play bc of a bug.\r\n\r\nIE im at the part in the quest where I am going back to find my parents. I tried to jump over a rock, and the game yeeted me off a mountain and I took injuries to both legs and started bleeding. So im half health, cant run and dont have enough bandages to stop the bleeding. So I just slowly die before I get to my objective bc the game wont let me sleep because its on rails and it says im in a hurry. \r\n\r\nIn the only 4 hours Ive played this game I have encountered so many moments like this forcing me to start over and replay through stuff multiple times. Its just not fun.\r\n\r\nIf they did away with savior schnapps and let you save like skyrim the bugs would be bearable.\r\n\r\nBut right now, they arent. Not even worth the seven dollars I paid when it was on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story part is great it will pull you right in.. My problem is the combat.... The combat is horrible its sluggish non-flowing its just BAD! the camera locks on to the enemy so as you can't break combat if you wanted to. if you can avoid fights and /or get a mod to help it then I would say do it.. I hope the 2nd one has better combat or I wont but dropping any $ on it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't save scum lol, you need to buy a potion to save manually. Skill system is skyrim-like (do something to get better at it) which is good. Traversal is not always fun, and felt sometimes like a chore, even tho the nature around was beautiful. \n\nNow, combat should have been the selling point of the game, which let me down. What’s the point of a medieval role-play if I can’t enjoy the fighting and have to cheese every encounter? No skill expression, you don't even need to match the stance to block (like in For Honor). Maybe an hour of practice for master strikes and that’s it. Large group fights like siege quests were better, but overall the combat feels clunky and dull.\n\nWithout juicy combat gameplay, the role-playing carries the game only for so long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kunesh. If you want to give me a tutorial fight i cannot win to humble me, at least don't end the fight when I reach half my health bar, or give me the ability to block which you describe right before the fight i cannot use it in.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game and it has lots of great things going for it but every step forward has several steps backwards and the jank and pacing are absolutely terrible. Considering this game is essentially \"complete\" and the sequel has released, this is an absolutely shameful way to leave the game hanging. The amount of bugs with this game is unbelievable. Don't play hardcore unless you really enjoy losing 3 hours of progress because of an NPC clipping underground and sleep saves not actually saving like they say they do. Of all the games I've played, few have had as many bugs as I've found with this game.\n\nEdit: I dove into KCD2 and that game makes this one feel like a beta test. This one is flawed and annoying, but the sequel is worth every cent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall Great Game very hard to play on console\r\nThe fighting is hard to figure out I've played 6 hours and i just get the basics \r\nThere's no cloud save for steam\r\nstealth is terrible \r\n5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very long intro, combats are clunky and excessively slow. your character is garbage but you're up to actual soldiers, so you get your ass kicked. \"git good\" doesn't cut it at all. I was hoping with all the good reviews for more, but it's just not for me.\r\nIf you like from software games, it will frustrate you. If you like Skyrim, just go back to Skyrim.\r\nAlso, the whole narration seems interesting, but in 7 hours I have barely started the game and the main story. If you have tons of time, go for it.\r\nI don't know what type of players likes it, but not me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If there was something in the middle between Yes and No, I would say \"depends a lot\". \r\nThis game is like an exotic liquor. Some will love it, some will hate it. I'm unfortunately one of the latter.\r\n\r\nI won't write long, it just feels like an \"old school\" unforgiving RPG where you, for example, need to sleep to save, or drink a limited quantity potion.\r\nMany times I've been blocked in the middle of a long quest to then find myself dead and need to restart maybe 1 hour of quest.\r\nPlease install some mods to enjoy it better, at least get the unlimited saves.\r\n\r\nOn the other hand, dialogues, ambient, scenery, are amazing, and it's compatible with steam deck!\r\n\r\nBefore I'll check the 2 I'm going to think twice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a bad game that wastes so much of you time on pointless bullshit and then you die in an ambush that would've been easily avoided if fast travel didn't think it was funny to start you in the middle of 6 enemies, and you just lost 2 hours of progress because \"realism\" means taking 1 hours naps 8 times a day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After trying this for 11 hours and playing one of the DLC missions I had to redo half the game due to the terrible save system and I could barely even complete one sword fight without dying. This game is true eurojank and I don't understand how it made enough money to greenlight a second one. If it takes 20-30 hours for combat to \"get good\" then I have zero motivation to even play the beginning of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the setting of the game, and the way that they tell the story, but the combat and gameplay is too janky for me to recommend it as good.\n\nAdditionally, whoever designed the quests should be reprimanded.\n\nQuest 1 - Force you to fight an NPC that is unbeatable and scripted to force you to lose. TERRIBLE DESIGN\n\nQuest 2 - The entire Night Raid quest was a waste of time, and does absolutely nothing outside of frustrating the player. TERRIBLE DESIGN.\n\nQuest 3 - Capon forcing you to do some stupid quest for a necklace at the end of the game, absolute waste of time, and horribly pointless design.\n\nThere are terrible design choices overshadowing what was otherwise an amazing game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Heard amazing things about this game, but the intro was full of bugs, broken quests and cheater enemies, and finally when I hit \"Save and quit\" it locked up my PC to the point I had to force restart.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sure, it was fun for the first 15 hours, then it just became repetitive to play and look at 😴😴, just a medieval simulator with a funky combat system, Also, armors just get degraded real quick after just a few fights, so annoying. The facial expressions are one of the worst in games, lazy stuff that. Even old games like VTMB had real great facial expressions, so even with such modern technology, they put zero effort.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story and the voiceacting are good, the gameplay is bad and the combat is atrocious. Shrubbery has become the bane of my existence. It's a charming bad game. Do with that what you will.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i dont recommend this game because it will take over your life. you will not be able to get real life things done because of this game. i lost my house, girlfriend , and missed my mothers funeral because of this game,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the story, but the combat sucks! who in the world design it?? IT SUCKS! I HATE IT. I will not recommend this game to anyone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am trying to enjoy this game but the bow mechanics just got me hating this game more and more and more.  Why ruin such a good game with such horseshit fucking mechanics. jesus",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am tired of games that lock you into a single solution to a problem and then punish you into doing that solution because a programmer decided that it was the best way. This is supposed to be an open world game and you cannot even get past the first part of the game without being forced into a no-win situation, followed by a forced combat you cannot win. \nGo back to design school and learn game design.\n\nGood luck getting me to try the second iteration of this trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game suck,i need to be a detective to find everything. and lets not talk how the map is handicapped and even a 5 yo could've made it better than these monkeys. dont waste ur money on thi shit if u dont wanna hate ur whole existence and the developers existence too",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The combat mechanics are absolutely beyond frustrating, poorly explained, and frankly bullshit, to the point, even fully kitted out, every enemy you encounter will probably kill you, and the only way to consistently win fights is to cheese object collision. If most players have to basically cheat to get through combat, you need to rethink your game design.\r\n\r\nThis is also doubly frustrating considering the game gets so much RIGHT about the medieval period, and then has light cutting-focused swords going right through mail and plate, which... No. That's not physically possible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es ist wirklich ein sehr detailreiches Spiel, was ich sehr schätze, aber in Summe hat es mir einfach nicht gefallen. Das Kampfsystem ist schrecklich. Die Quests, wenn ich jemanden suchen musste, haben mich enorm genervt, weil man immer alle möglichen Dorfbewohner fragen musste, etc.. Das Spiel ist meiner Meinung nach auch zu lang und das Ende ist wirklich ernüchternd. Der Angriff auf Skalitz war so episch mit den Kumanen, aber dann ist das Spiel massiv abgeflacht. Sehr schade, da es wirklich ein enormes Potential hat. Schön, dass es so vielen anderen gefallen hat und das jetzt auch ein zweiter Teil herausgekommen ist, den ich aber nicht spielen werde.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The jank massively overpowers the charm. \r\nA valiant effort at a slow-paced and rewarding midevil sim from a first-time studio, but for me at least, even after putting in 25 hours, it was far too frustrating and buggy for me to say I enjoyed it. Just wasn't having fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is rich in content and generally amusing.\nThat being said, it is possibly one of the worst applications of game design i have ever seen.\nCombat never seems to work, sword swings go everywhere, random damage markers, camera control is as steady as someone with parkinsons. And never but ever having any checkpoint, even after completing a quest or a training.\nDogshit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "跟不上時代的遊戲 類似巫師 上古卷軸 //\r\n\t2025 完全不推薦 //",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At the beginning I had high hopes for this game but sadly game was far from it. First of all, I was happy to see that the game had Turkish Translation but sadly it was half-done. Similarly, some NPCs talk Czech at the background. I can understand trying to give a more authentic style to the game but at least it could have been a subtitle. There are lots of simple things like these in the game, for example the subtitles at the end were wrong. It was another scene’s subtitles. Most of the game lacked details, felt rushed. You can understand their quantity over quality attitude at development. You can see it at the beginning. While doing tutorial game does not try teach you something with short texts, it gives you a wall of text for everything. This is the first time I have seen something like this at a video game. It was like they tried to give the player cold shoulder at the beginning of the game.\n[h3] Gameplay [/h3]\nUnfortunately, gameplay is not better. “Random” guard searches are annoying, magically they know if you have stolen something. I was even searched at the last quest. Weirdly, they did not care if something breaks the immersion. Another negative thing was the save system: Year 2018 and the developers thought limited save system is a good choice at an RPG. Since that wasn’t enough to make the game annoying, they decided to put timed quests. I can hear you saying “What is wrong with that system? It is pretty regular.” Sadly, game has timed quests at a couple ones. So, you cannot know which one is timed. There are some quests that seem to be timed but they are not. At the same there are some quests that does not seem like a timed quest but they are timed. You are forced to check a guide to not fail the game. Other than that, waiting and sleeping mechanics are horrible, it forces you to literally wait. \nThe game has an issue with lack of choices at quests, especially stealing. While being rich, you cannot give money directly, most of the time there are forced choices, cannot do shit about the obvious things. Another similar point that nothing changes after quests, you get the same attitude from NPCs, most of them treat you do same, there is not even a new dialog from the NPC that you have saved. Also, nothing changes at the world for the most part.\nOne of the most talked points is the combat system of this game. Unfortunately, combat is poorly made: Combos are meaningless, all system seems buggy, enemy can lunge easily from distance, while you can miss near enemy (almost inside), locked camera angles are really bad, especially fighting multiple enemies. After fighting many enemies with this annoying combat system, you may think that you can get a good level-up, perks, skills etc. Guess what? Level-ups are the worst level-ups I’ve ever seen. You level-up by using your skills and you gain points for those skills at level-ups. However, you do not get a point for opening up a perk at every level. This is the same for your general level. Most of the perks are useless, while some of them are plain bad and good ones are just boring. Also, some skills have no perk for no reason. Therefore, you do not feel satisfied at a level-up. I assume some perks are there to be memes, nothing else.\n[h3] Story [/h3]\nSadly, story is advertised as realistic but it is nowhere near it. There are washing houses everywhere that constantly used. If you do not know serfs at Europe did not look pleasantly to being washed at Middle Ages and washing houses started to increase at the late Middle Ages which is later than the game time. Similarly, there is depiction of a peasants can become a big shot, even though you cannot go near the things Henry did without any noble blood. Also, Henry acts like an annoying brat against the nobles and most of the time he forgets that he is just a lowly serf. Unfortunately, it is not just about it. Henry, learns weapons and other required skills quickly and kills people that use those skills for their whole life. Other parts of writing are pretty much shallow as this, boyish for the most parts. You can see there is no decent woman characters, even the mother [spoiler] that has been killed [/spoiler] not mentioned properly.\nLastly, ending. One of the most painful parts of the game was this. Not because it is great and I am going to miss this game, it is because this game has a horrible ending that makes my every effort to finish it meaningless. First of all, [spoiler] one of the last quests, you get captured and the reason for this is a noble that has seen you less than 5 minutes at the start of the game (near a year ago) and recognizing you, while you are wearing a full suit of knight armour. What a great twist! After letting that antagonist run, Henry becomes a noble out of nowhere, following by a political talk that no one cares about (I have already it from the books at the game, also), while meeting your real father and other issues related to this not explained enough. Then, there is another long horse-riding session with Hans. What a joy! It is more of a shitty chapter’s end than a game’s end, since there is not even one resolve. [/spoiler]\nTo sum up, with its boyish writing and annoying gameplay this game is not worth it. I do think it is overly praised by the boys that are the huge fan of crusades and trend of right wing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, the game isn’t bad, but the way it plays is… I don’t know, just weird. I’ve played plenty of RPGs like Skyrim, Fallout, GTA, Tomb Raider, and Metro Exodus. The story in Kingdom Come is great, but the mechanics feel too awkward, and sometimes the game doesn’t tell you what you’re supposed to do. For example, when I was in Talmberg, there was no clear quest, and I spent hours just wandering around before realizing I actually had to escape the castle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game. Coming from Mount and Blade, I thought this would be similar with better NPC interaction. Sadly this is a game of cut scene, go here, do this, cut scene, enemies popping out of nowhere, die 15 times and then live once doing the exact same thing. To a new cut scene, go here, do this, cut scene, enemies popping out of nowhere, die 15 times.....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sure lets make the only way to make a save a consumble item in a game that crashes every session.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game cannot run in 2025.\n\nI got this game because I wanted to play the sequel and they both came in a bundle. Unfortunately the game is unplayable, the longest I can go without crashing in it is about 2 minutes. Looks like it would be a fun game but I guess I'll never know.\n\nI have spent several hours and tried multiple solutions I found online to get the game to work such as:\n -verifying game files\n -running as administrator\n -running in windows 8 compatibility mode\n -updating my gpu drivers\n -rolling back my gpu drivers\n -uninstalling and reinstalling\n -using direct x11 launch option\n -using vulkan launch option\n -allowing the launch file in windows defender firewall\n -creating a user.cfg file and limiting the number of cpu threads the game can use with sys_streaming_CPU  because apparently it doesn't like too many cores (tried limiting to both 8 and 4)\n\nThere are a couple other solutions I tried that I can't remember right now due to the rage this game has caused me. I GIVE UP. I'm refunding the game it's not worth it. I will be installing the sequel and if it crashes on start up too I will refund that as well instead of wasting several hour trying to get garbage to work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very frustrated with the whole game\r\nnot fun \r\nchallenging but ridiculous eating and sleeping requirements\\\r\nmany bugs\r\nmany quests are not able to complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after all those years still can't fix this game's bugs, and the sword fight is a joke makes no sense at all..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really liked playing this game but I cannot in good conscience recommend it due to crashing, bugs/jank and general lack of optimization. If you still want to experience KCD, maybe you are like me and started playing this before going into the 2nd, I’d suggest turning some graphic options down (the game will look the same) and keep your focus almost purely on the main quest and DLC’s.\n\nMy whole playtime of 234h was on hardcore where I had about 80% of the whole map FULLY explored and after finishing the game and looking up a quest list, I saw that I had managed to complete all but one of a side mission which can be missed if you do another minor quest first – the quest was apparently named “Hare Hunt” and I could see the marker on the map but the NPC didn’t have new dialogue about it and after finishing that minor quest the NPC disappeared anyway, which was fine as it is part of how this game handles choice and consequence. I can confidently say that I experienced pretty much everything that this game can offer unless I myself am to impose extra roleplaying handicaps in a future playthrough like not looting dead bodies or not killing anyone (there’s an achievement about it).\n\nSo look, Kingdom Come: Deliverance is an open world sandbox the likes of Bethesda’s Oblivion that focuses a lot on historical accuracy (instead of magic and fantasy e.t.c.) with the immersion and slow meticulousness that you can encounter is the likes of Red Dead Redemption 2. One can say the I’m being unfair here as both these games are giants in their own right, but to me this is a compliment. KCD was made with a certain vision in mind and when it manages to fire with all its cylinders it definitely approaches that bar that could make it exceptional. The OST, the handcrafted cities, the amazing voice acting and memorable cast all serve to give you this curated impression of medieval Bohemia and the care that was put into it shows - KCD is punching above its weight and most of the time it succeeds. You will be fully immersed with its systems playing as Henry, a young boy with no prior experience whatsoever in trying to survive this unforgiving world while also navigating a revenge story that by the end of it you will truly feel a sense of accomplishment as your character will turn from an apprentice blacksmith to a veteran/soldier as he rides into the sunset to his next adventure (presumably the second game).\n\nThat impression is so strong that I feel like for most people is enough to wave away most of this game’s faults but for me the opposite happened, in that those issues took away from the experience.\n\nYou see you are given this big map to explore but outside the major settlements you will find two things: jack and sh*t. All these lush green forests and rolling hills certainly serve as a pretty good back drop (or a place to frequently get lost in) but there’s mostly nothing there to explore. The map is dotted with POIs that have some short of environmental story telling – like a carriage filled with arrows and blood or a hut with a book about skinning and a tub with corpse in it – but that is not enough for a map as big as KCD’s. Also there is not a hint of danger in exploring these areas as most bandits can be encountered in respawning camps or in road encounters, there are no aggressive wild animals or other dangers here other than about a billion rabbits and the occasional fleeing deer or boar. That map size also works as a detriment as quest givers will frequently ask you to zip around the other settlements to progress but by the 50h mark you will probably have cycled through all the random encounters and so you will just ride past them as there is no reason to stop. Maybe this is a hardcore mode issue where it disallows fast travel but I figured if I wasn’t playing that mode, after a point I’d fast travel so I wouldn’t even see the awesome vistas anyway. That emptiness is also felt in one of the smaller settlements (Samopesh) as it doesn’t even have a reason to go there other than talking to the blacksmith to send you to a DLC quest.\n\nSince I mentioned quests, most of the main adventure is amazing. You can see a lot  of the budget was spent here as there’s endless voice acting and even mocaped scenes to complement it. The adventure path starts by teaching you the game mechanics and then offers interesting scenarios to play in – some missions are pure investigations but there’s nothing really stopping you from changing your approach, either by stealth or combat. Another important element is that the game recognizes your choices and I just loved how the dialogue is affected by your speech skill and the way you dress and look. It adds to the roleplay element that a sandbox such as this needs. It is outside the main story where the façade crumbles as most quests are fetch this or bring 100 meat there which exacerbates the disappointment felt by the emptiness of an admittedly pretty to look landscape.\n\nPerks and Combat is another thing worth to mention, specifically melee combat with the closest system to this being Ubisoft’s For Honor (really cool game btw) but in first person. The issue is that the camera janks out if you try to engage in more than 3 enemies and if you get surrounded you will die regardless of your gear. Personally I enjoyed it as it was sensical to never engage more than 2 enemies at once (I’m an inexperienced peasant story wise after all) and it also made me scout more to see which enemy is more armored so that I change my approach by stealth, use poison and bow and generally engage the whole skill system in creative ways. I suspect most people don’t like it due to camera issues that ensue when you try to brute force your way through but even those can be surpassed with the use of alchemy and steroids by one hitting anyone but the most heavily armored opponents. When it comes to perks, the skill system is a missed opportunity to add more creativity to the game as half of them are completely useless (like herbalism) or absolutely essential (maintenance/sneak/alchemy). Fortunately it is easy to differentiate between the two.\n\nAnyways, writing all of the above made me realize that for the most part KCD is a sold 6/10 (maybe even 7/10) game. It struggles a bit but for the most part it does what is wants to do and is unapologetic about it which I respect. The game does the Bethesda thing where it offers something awesome enough to make you ignore the jank and bugs like flickering smokefires or T-posing enemies. So I will also be unapologetic here as I am incapable of ignoring the frequent stuttering (I also put the game on a 7800x3d/9070xt and the stuttering persists), the slowdown after an hour of playtime (RAM issue?) or the game crashing randomly. Or not so randomly as I initially thought as it became more frequent during the last sequences of the adventure. Heck, while I was finishing the game in the last mocaped cutscene where the hero has an emotional dream sequence with his father I got subtitles from a DLC quest scene and as that ended and I was left in the major hub area, went on my horse and crashed, so I had to replay the last sequence. What a cherry to put on top.\n\nKingdom Come: Deliverance for me is rough shaped diamond. I can see the vision, I just wished it \n[i]delivered[/i] (in some ways it did) but it wasn't enough and if I am to replay it I’d stick to the story and how creatively I can approach it, as that was the best part of the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried but just no. Crap fighting system, archery is worse. Quests are lame and buggy. This game makes Elex look AAA. Couldnt even make it bearable with mods bercause half of those dont work properly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game. I tried my hardest to give it a chance. It's just the combat is way too hard for me. Even worse is you swing your sword a couple of times, and he's out of stamina. Does Henry suffer from bad asthma?\n\ntried installing mods to make my experience a little better, but one will work, then when you install one more, another on the list will cancel out. \n\ndefinitely put me off trying II",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fucking thing dont work, fucking shit, i hate checklosovakians, good for nothing worthless chumps disguised as game devs, sniff my taint lads, fucking hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The 'soulful jank' is when the game softlocks or forces you into the most tedious mechanics because wasting your time as a player is what goes for realism. Combat is just terrible - reminds me of for honor, where no one would ever land the first hit in fears of being countered. Here it's being masterstrike'd, which turns the game into waiting for a green shield to appear in the center of the screen to press q. Immersive!\nGreat story and characters, though. Watch on youtube.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want to have fun play the game, if you want to play a good game don't play the game. This game is inconsistent and bugged. This game is incomplete at version 1.9.6 November 13th 2025 and you can presume that it will never be fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this game so badly. The setting and open world looked sooo good. I paid real world money for it when it wasn't even on sale.\nBut it's so infuriatingly difficult that it's impossible to play. I didn't put many hours into it because what's the point of throwing away real world time into a game that will not let you advance? The only advice on forums is \"get good\". No one is any help at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not sure what all the fuss about.\r\n\r\nThis is very unconvincing. Amateurish, horrendous mechanics. Slow. In fact. Fucking terrible.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The only game I have ever played where I was so interested in the story and characters but the swordplay is so outrageously bad that I had to quit playing. Its like the combat system was designed by a 5 year old with a dent in his head. Do not believe the comments saying the combat is good its not its literally the worst I have ever played in 20 years that I have played games. I feel bad for the people who stick up for this game because its clear they do not know what a good game is. If you are thinking of buying this game DON'T. Buy The Witcher 3 instead and have countless hours of fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is dry as hell. got this by mistake, didnt know the new one was a part 2 as i know nothing about the games. but prob wont play that as this no lie put me to sleep. story is ok, but MY GOD is the gameplay slow as hell, i get ppl hype it for the swordplay, but idc. its lame to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constantly restarts my pc and i cant get a refund because it didnt start happening till after the whole intro",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate combat system, was going to finish this one and buy the 2 game, but I just hate the combat system. Every move I make blocked by the enemy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the worst games I have ever played. How can someone enjoy this type of combat? Also, the fact I need an item to save is pretty low iq",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A little too much plain video scenes for me to watch and not enough action. Not sure I realized it was a single character choice either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Witcher's Boring, Hard cousin. Turns out being a peasant in the middle ages is tough shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was stuck in the 2nd quest for 3 hr i couldnt find what they wanted me to do i tried to do it on my own this game has no direction and just expects you to watch a walkthrough (like i did after 3 hr of being lost in one place ) so now i have to finish it because i cant return it save ur 3 hr and dont launch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fucking Bitch game i love the game but there is one fucking mission i can´t motherfucking finish so i can´t finish this motherfucking bitch game biggest fucking bitch game on the planet It is fucking trash biggest motherfucking bitch game DONT FUCKING BUY!!!!!!!!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}