{
  "positive": [
    {
      "review": "Eco is a Cruel Mistress that snares you into playing, and then makes you regret your life choices.....but seriously, if you like MMOs and economy games, this is it.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "A socio-economic simulator that teaches you how quickly and successfully communism overtakes capitalism when the end of the world is a week away. I've played quite a few full runs from start to finish in these 1,600+ hours and it plays out the same way virtually every time, without fail. It's actually quite fascinating and should probably be studied. \n\nBeyond that, it's such a chill and enjoyable social experience. Even asocial folks find themselves pulled into socialization, if for necessity more than anything else, but also because it's just hard to resist in this game for some reason. I've made friends on Eco over the years that are still friends to this day. \n\nIt's also been a non-stop labor of love by the devs. It's truly a shame that very few devs give this much of their lives and passion to one project and stick with it, long after the initial release sales have tapered off. I come back every 2 or 3 years to new mechanics to learn and new toys to play with.\n\nEco is easily in my top 3 list of most unique games ever. I will never stop coming back to it and it will always hold a special place in my heart.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Really loved this game, it's alot of fun if you find a good server with people that like to work together. or you could start your own server and fine tune it to setting that work for you. some servers are so definitive in their settings, One time me and 3 friends TRIED to destroy a planet and no matter how hard we polluted, it didn't matter. lol. we even had approval to try.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best Co-op games out there. In-depth skill development and world progression. Can be played with or without an end game. Hands down one of the best games of the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eco is easily one of the most thoughtful and engaging community-driven games I’ve ever played. It’s a rare title that blends crafting, politics, economy, environment, and cooperation into a single living world where every decision matters. The sense of progression—both personal and communal—is incredibly rewarding. From the first laws you write to the first roads you build, every moment feels like you’re contributing to something larger than yourself.\n\nThe game absolutely shines in its early and mid-game. There’s nothing quite like the harmony of players discovering roles, forming governments, setting tax laws, debating policies, and shaping the world with purpose. When a server is active, Eco becomes a thriving little civilization, full of personality, culture, and community storytelling. It’s the kind of multiplayer experience that sticks with you long after you log out.\n\nThat said, I have one big wish for Eco’s future:\nOnce industry is unlocked, the momentum on most servers drops dramatically. After about a week—when the majority of techs are researched and people have built their factories—servers tend to empty as players jump into a fresh start rather than continue world-building or developing culture. It’s understandable, but also a missed opportunity, because Eco has so much potential for long-lasting civilizations.\n\nI would love to hear more from the developers about their long-term vision for keeping players engaged after industry begins. Whether that means deeper cultural systems, expanded late-game goals, meaningful long-lasting projects, or evolving world events—Eco is so close to being not just a game about building a society, but sustaining one.\n\nIn short: Eco is fantastic, unique, and absolutely worth playing. I just hope future updates find a way to keep servers alive and thriving deep into the late game—because the foundation they’ve built is too good not to carry further.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game so much! (not to sound like a bot). \ncollaboration? Amazing\nmods? Heck yeah\nplayer base? Most team work oriantated I've seen in any community (you don't see many games where one of the main mechanics is working with others)\nOnly thing I don't like? has a few glitches, the enviornment is alright but I feel like they have plans on making it much prettier some day (they recently optimised the current graphics and it changed a LOT since I started and until now)\nFirst started playing in Eco 6 I think it was and loved it to this day (though sometimes burnt out but that's a personal issue)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very grindy game, but still fun! The hours of time are worth it and feel rewarding, new update too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a great game.  They have so many cool mechanics I've never seen in other games and they're implemented so well.  All the tools of creating any number of economic styles ranging from a barter economy to full blown capitalism.  Governing tools allowing for the fine grained creation, and enforcement, of laws.  And the way the game can be fairly solo, or heavily multiplayer community interdependent without compromising the gameplay is a master stroke of game balance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you ever (probably) hate the shooter or MOBA communities, In this Game most of the people do justice you.\n\nKind of Minecraft game but more focus on job duty trading.\n\nLove it. Played many many times. Ideal do switch off after work. Ideal with friends and meet new friends.\n\nBTW a \"cycle\" lasts 2-8 weeks long. Depend on the servers. \nBe aware You will need to play active on a daily basis this time as long you play online!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After years of playing this game since day one I've got to say that it has come a long way and is yet to get boring or played out they are always improving and expanding on every angle of the game highly recommend to everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing since 2018 : this game has strong potential for [b]team building[/b] , [b]teaching[/b] and [b]scientific research[/b].\n\nAt first sight, Eco worlds or servers offer beautiful landscapes, original game mechanics (trade, houses, machines, towns, animals) and all you need for fun building projects. Widespread misconceptions of economic and collaboration theorems usually lead to trade war scenarios, so bring a friend to survive. Most admins modify the original settings or impose their government/finance structure to make [i]build and trade[/i] scenarios more rapid and flamboyant. Get resources fast, trade smart and build amazing things !\n\nThe [b]\"ultimate uniqueness\"[/b] of this game lies in features that are not found in crafting tables and menu options: they need to be created by the players themselves. Structures related to decision-making, power sharing, equity and finance are common examples. Players' values and beliefs (and trust issues) have profound effects in-game and the resulting societal choices can lead to a stunning egalitarian utopia, organized exploitation of new players, historical colonial domination, satisfying world unification and more. Meaningful and truly unique experiences await you once you unlock this next level of Eco.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute rabbit hole of a game filled with sweet, juicy brain worms, needs more vehicles and ways to kill the enviroment, 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it for quite a bit. However, the learning curve from the get go is steep, especially with the unituitive UI and general starting UX. If you like expansive stuff to do, then this may be your game. If you'd like something more casual, I'm not too sure that this is your cup of tea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for almost 50 hours, and can honestly say it is super interesting! Ive been lucky enough to play on a server ran by a friend, which likely helps out as we are working together alot, but its really interesting to learn new technologies, implement them so another player can use them for their profession. 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game to relax, be it with friends, strangers or alone. Always a lot of fun and a huge amount of things to explore!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An awesome way to experience human cooperation and a fun game to boot. I have experienced very real insights into (very basic) town governance and early human trade. Highly recommended for those who are into this style of game and/or appreciate the anthropology of it, but it's pretty niche. Development can be slow but does progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, played it from time to time. Always amazed by all things you can do and setup in this game :) \nAlways fun to come back and experience all new content  :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game made with love and community support for mods that further improve the game. 10/10. Chill, hardworking and enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Go ahead and buy it. It's fine. You won't need to take a leave from your job. Perfectly fine. Some servers cap the amount of time you can play. Safe. Oh, only buy if you want to play a highly cooperative, multiplayer game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is so complex <3 i would love to find some non toxic people to play online where it is even more complex. But unfortunately people like this are hard to come by -.-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The player economy of this game is great, and you can feel useful. Most servers elect to reset after about 30 days so it's just long enough to build things and see most of the game. You will likely want to do it all over again. \r\n\r\nThere's a lot of detail and complexity to the game, \r\n\r\nWhile I'm sure there are bugs, I'm not aware of any. It's not a perfect game, but it's fun and a huge time sink while not feeling too grindy, because everything you do directly benefits yourself and others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really unlike anything else out there. Its such a great collaborative (and economically competitive) game that is in a genre all to its own. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a bit complicated; but also pretty relaxing. Can be solo'd or great with a group. Nice building and infrastructure game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Entirely unique and worth the price.\nLots of fun.\nGotten better each year.\nTy for the work.\n\nGlad to see more and more options being added for server controls and tuning alongside large content additions.\nGood to see attention to player creativity and expression in game.\nSolo friendly, multiplayer awesome.\nEconomic warfare ftw.\n\nBack in the day they offered this up for labs and education.\nMaybe they still do. Hope that catches on if it hasn't already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would love to try this game with controller support: for both dualsense/dualshock and xbox, if possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a few hours but im In love with the game and will continue playing while im in a server and honestly i want too see this game publish fully and i cant wait for it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a Minecraft player, I love that vehicles are actually needed to transport things around in this game, and the driving is my favorite aspect of the game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is absolutely an incredible game, with the most interesting economic simulations with real players I've ever seen. It takes about as much effort as a full-time job to play properly though, so I don't expect to be enjoying it again unless I get hit by a bus and become permanently disabled.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend Eco because I believe in it as a game, I think it fulfills a niche very well and I hope to see it get better. Right now I think the game has a very obvious route for improvement, which will help with automation, making the experience feel \"bigger\", and create some new ways for players to get ahead. This would all be done by Implementing some kind of AI citizen presence, kind of like in Necesse, so that the players at least have the option to have a more full server/community than the interest level in their server might allow. I get that the game is about community, but a community built by people who have lives outside of the game is gonna have holes, and cause the experience feel a bit underwhelming sometimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Capitalist Minecraft MMO where you can corner the oil market and get sued by the local farmer for the resulting pollution.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoy playing with my friends to build a socialist utopia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good but can't get to meteor without everyone quitting.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Highly recommend this game - even solo can be similar to a terraria or minecraft playthrough if you setup the settings right. Definitely wayyyyy better with a close group of friends. Get a dedicated server setup and invite like 2- however many you want in terms of friends and just have a blast. the game is great for people like me who cant get enough of engineering in real life. lmao",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super great chill builder game if you find the right community to play with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Haven't played it much, but its ok I guess.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i love this game, wish i had more friends to play it with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "don't play if u have a job, very grindy game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Most underrated Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Minecraft with more autism",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Awesome social game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "c'est dingo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Minecraft for Adults",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SUPER FUN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":steamthumbsup:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than Minecraft. This game is criminally underrated — with the right marketing and a more active dev team, it could easily put Minecraft to shame. ECO is so unique that it’s almost impossible to capture its magic in words; you really have to experience it yourself.\n\nJust don’t play it solo — that’s a completely different (and honestly much weaker) experience. The real magic happens when you dive in with a community of friends, building, managing, and shaping the world together. ECO isn’t just another survival crafting game, it’s a social experiment wrapped in a sandbox — and it’s unlike anything else out there.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "I am going to be completely honest here. I love this game. I have over 2100 hours into this game. However, 12.0 just came out and WTF DID YOU DO TO THIS GAME!?!?!? The graphics are the worst! I know you did a lot of good changes for QOL and other fund mods that have been integrated. For that, I say thank you. Seriously, though, who were you testers? This is AWFUL! The graphics are absolutely terrible! Please revert ASAP and do a new test group. It is making us (and I say so in Discord with multiple other people) nauseous! I understand wanting realism but its terrible. For example. the sunrise is BLINDING! In dark, you cannot see in the game whatsoever! Please, for the love of god, roll back all visual changes and start over.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Eco is a Cruel Mistress that snares you into playing, and then makes you regret your life choices.....but seriously, if you like MMOs and economy games, this is it.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I have played roughly 700 hours of this game and all I can say is, I will always come back to this game. Solo is okay (especially to learn the game) but community servers are where it's at! I love starting with a new server and go from the start watching how slow or fast the community members are able to build it up. I also absolutely love participating in an RP server when they are available because then it isn't all about the grind.\nAs for \"careers\", I have stayed to my favorites, but I find that my friends love all the different fields. It is great when we are able to build an entire town and have professions to work together. I am able to scoot down the way and buy furniture for my house to build it up. Then, once I have a kitchen established I start to bake delicious foods the town needs to eat and then someone else has to come repair my brick oven over time. I love the building, the furniture, and I think my favorite thing is the fact that they are STILL adding things to this game. We have a new update coming out with HUSBANDRY. Taming one of these hares?!? Actually having to run from a jaguar? YES, PLEASE.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "A socio-economic simulator that teaches you how quickly and successfully communism overtakes capitalism when the end of the world is a week away. I've played quite a few full runs from start to finish in these 1,600+ hours and it plays out the same way virtually every time, without fail. It's actually quite fascinating and should probably be studied. \n\nBeyond that, it's such a chill and enjoyable social experience. Even asocial folks find themselves pulled into socialization, if for necessity more than anything else, but also because it's just hard to resist in this game for some reason. I've made friends on Eco over the years that are still friends to this day. \n\nIt's also been a non-stop labor of love by the devs. It's truly a shame that very few devs give this much of their lives and passion to one project and stick with it, long after the initial release sales have tapered off. I come back every 2 or 3 years to new mechanics to learn and new toys to play with.\n\nEco is easily in my top 3 list of most unique games ever. I will never stop coming back to it and it will always hold a special place in my heart.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Really loved this game, it's alot of fun if you find a good server with people that like to work together. or you could start your own server and fine tune it to setting that work for you. some servers are so definitive in their settings, One time me and 3 friends TRIED to destroy a planet and no matter how hard we polluted, it didn't matter. lol. we even had approval to try.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Takes a lot of time to play but I think it is a very interesting social game that gives game play experiences that will be hard to find elsewhere, possibly at all. I tried the new dinner party on the server I am on and it was fun!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Eco’s one of those games that really gets under your skin in a good way. It’s got depth for days - farming, trading, grinding, setting up markets - it all ties together nicely. Nothing feels wasted. You put the work in and you see it pay off, whether that’s in your crops, the economy, or the way the community starts to function. The visuals are easy on the eyes too, clean and colourful without being over the top.\r\n\r\nWhat makes it special though is the community side. Jumping on a server, working with other players, trading and building a proper little world - it just feels right. It’s not just another survival game where you bash trees and call it a day; it’s about building something bigger with other people.\r\n\r\nNow, for the gripes. Alt accounts are a killer. With the small player base the game already has, seeing the market undercut by alts is rough. And don’t get me started on the preset governments—they suck the life out of what should be the most interesting part of the game. Instead of letting things grow naturally and watching politics evolve, you’re boxed into some cookie-cutter setup. Takes the spark out of it.\r\n\r\nAll up, Eco is a bloody good time if you’re into community-driven games and don’t mind a bit of grind. When it clicks, it’s brilliant. It’s one of my favourites.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game may look like Minecraft, but it is so much more! I love this game's depth and challenge. However, you cannot do it all yourself. It takes a community of players working together to win. Unfortunately, the game has a serious player retention issue with many players jumping to a new server after 3-5 days. My best advice is to find a good long-term server with a group that has demonstrated their willingness to play to the end. \r\n\r\nI also think it is important to note that Eco is still in development and that development has been slow. You will encounter bugs, unbalanced gameplay, and the updates (when they do come) may not always be what you wanted. For example, the game recently implemented dinner parties in v12. While this is a cool, community-building feature, there are so many other things that I would rather see the devs working on instead like the much-publicized skill star-rework or animal husbandry. Hopefully, that work continues in the background and the more heavily-requested features will come out soon. If so, I will update my review. However, I think my play time speaks for itself. There's a great game here, you just need to find the right community to share it with.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game has great potential for 1.0, however, with the lacking playerbase, may become difficult for first time players to get started.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best Co-op games out there. In-depth skill development and world progression. Can be played with or without an end game. Hands down one of the best games of the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eco is easily one of the most thoughtful and engaging community-driven games I’ve ever played. It’s a rare title that blends crafting, politics, economy, environment, and cooperation into a single living world where every decision matters. The sense of progression—both personal and communal—is incredibly rewarding. From the first laws you write to the first roads you build, every moment feels like you’re contributing to something larger than yourself.\n\nThe game absolutely shines in its early and mid-game. There’s nothing quite like the harmony of players discovering roles, forming governments, setting tax laws, debating policies, and shaping the world with purpose. When a server is active, Eco becomes a thriving little civilization, full of personality, culture, and community storytelling. It’s the kind of multiplayer experience that sticks with you long after you log out.\n\nThat said, I have one big wish for Eco’s future:\nOnce industry is unlocked, the momentum on most servers drops dramatically. After about a week—when the majority of techs are researched and people have built their factories—servers tend to empty as players jump into a fresh start rather than continue world-building or developing culture. It’s understandable, but also a missed opportunity, because Eco has so much potential for long-lasting civilizations.\n\nI would love to hear more from the developers about their long-term vision for keeping players engaged after industry begins. Whether that means deeper cultural systems, expanded late-game goals, meaningful long-lasting projects, or evolving world events—Eco is so close to being not just a game about building a society, but sustaining one.\n\nIn short: Eco is fantastic, unique, and absolutely worth playing. I just hope future updates find a way to keep servers alive and thriving deep into the late game—because the foundation they’ve built is too good not to carry further.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Takes a bit of time to get into, but absolutely worth it if you take the time. I recommend finding a community that works towards a common goal and not competing to get rich. That way the game is much more enjoyable for everything.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Eco’s challenging learning curve is worth it, every choice you make shapes the world around you!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Eco is one of those games which suck you in like a vortex once you figured it out.\nIt has so many layers and while you are not dive into all of its complexity, it is fun to explore all the game mechanics.\nIf you like cooperation and the grind this game is for you!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b] When i first played i was iffy on this game, I didn't understand how it worked and ended up not playing it for a while. But recently i reopened the game and joined a server without anyone i had played with before. I have never spent so much time learning a game and falling in love with it at the same time. Eco is one of the best game i have ever played. There is so much i havent even done in the 102 hours ive spent playing. Each server is different and fun and the community is the most friendly welcoming ive ever been apart of. If you enjoy a game with building, crafting, cooking, farming, and much much more all while working with others who all learn different skills and work together to save the world then this is an easy [h1] MUST BUY!! [/h1] There are also hundreds if not thousands of mods that makes each server and world fresh and exciting. [/b]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game so much! (not to sound like a bot). \ncollaboration? Amazing\nmods? Heck yeah\nplayer base? Most team work oriantated I've seen in any community (you don't see many games where one of the main mechanics is working with others)\nOnly thing I don't like? has a few glitches, the enviornment is alright but I feel like they have plans on making it much prettier some day (they recently optimised the current graphics and it changed a LOT since I started and until now)\nFirst started playing in Eco 6 I think it was and loved it to this day (though sometimes burnt out but that's a personal issue)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mais oui c'est bien Eco !\r\n\r\nLa partie dépend entièrement de comment les autres joueurs jouent, donc source de frustration, et souvent le plus kiffant reste l'early game quand tout le monde est encore actif, mais à la base se trouve un contenu plutôt solide et vraiment kiffant, aussi bien dans la progression que dans l'économie de marché.\r\n\r\nCertes, le contenu est pas rapide à développer, d'autant plus dommage puisque c'est ce qui dicte les vagues de nouveaux joueurs/d'activité dans la commu...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is an extremely well made game; that I just do not have time for. I really do like this game but its designed for multiple players because - economy. I completely get that and endorse it. It's very good.\n\nThe problem is; it's designed, right now at least, as a race to the finish. It is very much the tyranny of labor, which I think is not the goal at all. It's a great looking game, technically very proficient and the crafting chains are unequaled to my knowledge.\n\nI think this is great and very unique game if the designers could make it less about a race to the finish, if they could fix that, its one-of-a-kind. I really like this game and I wish I had the time to devote to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very grindy game, but still fun! The hours of time are worth it and feel rewarding, new update too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a great game.  They have so many cool mechanics I've never seen in other games and they're implemented so well.  All the tools of creating any number of economic styles ranging from a barter economy to full blown capitalism.  Governing tools allowing for the fine grained creation, and enforcement, of laws.  And the way the game can be fairly solo, or heavily multiplayer community interdependent without compromising the gameplay is a master stroke of game balance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you ever (probably) hate the shooter or MOBA communities, In this Game most of the people do justice you.\n\nKind of Minecraft game but more focus on job duty trading.\n\nLove it. Played many many times. Ideal do switch off after work. Ideal with friends and meet new friends.\n\nBTW a \"cycle\" lasts 2-8 weeks long. Depend on the servers. \nBe aware You will need to play active on a daily basis this time as long you play online!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After years of playing this game since day one I've got to say that it has come a long way and is yet to get boring or played out they are always improving and expanding on every angle of the game highly recommend to everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing since 2018 : this game has strong potential for [b]team building[/b] , [b]teaching[/b] and [b]scientific research[/b].\n\nAt first sight, Eco worlds or servers offer beautiful landscapes, original game mechanics (trade, houses, machines, towns, animals) and all you need for fun building projects. Widespread misconceptions of economic and collaboration theorems usually lead to trade war scenarios, so bring a friend to survive. Most admins modify the original settings or impose their government/finance structure to make [i]build and trade[/i] scenarios more rapid and flamboyant. Get resources fast, trade smart and build amazing things !\n\nThe [b]\"ultimate uniqueness\"[/b] of this game lies in features that are not found in crafting tables and menu options: they need to be created by the players themselves. Structures related to decision-making, power sharing, equity and finance are common examples. Players' values and beliefs (and trust issues) have profound effects in-game and the resulting societal choices can lead to a stunning egalitarian utopia, organized exploitation of new players, historical colonial domination, satisfying world unification and more. Meaningful and truly unique experiences await you once you unlock this next level of Eco.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute rabbit hole of a game filled with sweet, juicy brain worms, needs more vehicles and ways to kill the enviroment, 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it for quite a bit. However, the learning curve from the get go is steep, especially with the unituitive UI and general starting UX. If you like expansive stuff to do, then this may be your game. If you'd like something more casual, I'm not too sure that this is your cup of tea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for almost 50 hours, and can honestly say it is super interesting! Ive been lucky enough to play on a server ran by a friend, which likely helps out as we are working together alot, but its really interesting to learn new technologies, implement them so another player can use them for their profession. 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game to relax, be it with friends, strangers or alone. Always a lot of fun and a huge amount of things to explore!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An awesome way to experience human cooperation and a fun game to boot. I have experienced very real insights into (very basic) town governance and early human trade. Highly recommended for those who are into this style of game and/or appreciate the anthropology of it, but it's pretty niche. Development can be slow but does progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, played it from time to time. Always amazed by all things you can do and setup in this game :) \nAlways fun to come back and experience all new content  :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game made with love and community support for mods that further improve the game. 10/10. Chill, hardworking and enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Go ahead and buy it. It's fine. You won't need to take a leave from your job. Perfectly fine. Some servers cap the amount of time you can play. Safe. Oh, only buy if you want to play a highly cooperative, multiplayer game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is so complex <3 i would love to find some non toxic people to play online where it is even more complex. But unfortunately people like this are hard to come by -.-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The player economy of this game is great, and you can feel useful. Most servers elect to reset after about 30 days so it's just long enough to build things and see most of the game. You will likely want to do it all over again. \r\n\r\nThere's a lot of detail and complexity to the game, \r\n\r\nWhile I'm sure there are bugs, I'm not aware of any. It's not a perfect game, but it's fun and a huge time sink while not feeling too grindy, because everything you do directly benefits yourself and others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really unlike anything else out there. Its such a great collaborative (and economically competitive) game that is in a genre all to its own. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a bit complicated; but also pretty relaxing. Can be solo'd or great with a group. Nice building and infrastructure game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Entirely unique and worth the price.\nLots of fun.\nGotten better each year.\nTy for the work.\n\nGlad to see more and more options being added for server controls and tuning alongside large content additions.\nGood to see attention to player creativity and expression in game.\nSolo friendly, multiplayer awesome.\nEconomic warfare ftw.\n\nBack in the day they offered this up for labs and education.\nMaybe they still do. Hope that catches on if it hasn't already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would love to try this game with controller support: for both dualsense/dualshock and xbox, if possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a few hours but im In love with the game and will continue playing while im in a server and honestly i want too see this game publish fully and i cant wait for it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a Minecraft player, I love that vehicles are actually needed to transport things around in this game, and the driving is my favorite aspect of the game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is absolutely an incredible game, with the most interesting economic simulations with real players I've ever seen. It takes about as much effort as a full-time job to play properly though, so I don't expect to be enjoying it again unless I get hit by a bus and become permanently disabled.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "About 30 hours in and already hooked. This game truly is a masterpiece. Learning curve is pretty steep, but its got so much to offer you can easily sink a couple 100 hours in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like minecraft, but a more realistic economic system, and great ways of progressing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Pros: Devs are active and constantly improving the game, great depth, and immersive gameplay. Cons: A little difficult to find a good community to join, large time sink. Overall, worth grabbing, especially if you've got some friends to pull in with you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the time i spent in this game. \nIt was fun just grinding and learning things.. the only thing was when I finally got the hang of the game the asteroid came and it reset. I was like.. \"its over?\" just like that. \n\nI didnt bother to play it again because i didnt want to have to rebuild everything .\nIt was nice and relaxing while it lasted though, it just felt like a very short time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game so far cant wait to try all the different professions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pog game! Dev's constantly update and love what they have made, gives me hope for where the game will be in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very underappreciated game, If you enjoy community centered games that tie with economy from multiple different levels you may want to take a look at this one. The Devs are very open to criticism and actively respond to feedback on Reddit aswell so that is always a plus!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game that is lots of fun. \nPlaying on a server with sometimes more than 100 people on it, especially at the start of a new season.\n\nIt's very addictive since there always seems something to do, improving your shop, improving your house, going out buying ingredients from other peoples shops, looking at the creation of other people (I am bad at that myself, but I love to see how the world is constantly changing). It also has a lot of replayability as there often are new seasons where everybody starts fresh, you can try out other professions which greatly influence you style of play, e.g. mining, logging, farming, art, cook and many more.\n\nThis game is also highly moddable, no server is the same and they often tend to have QoL Mods which improve on the vanilla experience of the game. \n\nDefinitely worth its full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obviously I have played this game a lot. I really feel it has a lot of potential and would do even better with a high population in the game. The game devs are constantly updating the game. My only issues usually involve the fact people leave servers too quickly but I do not know if that is something that can ever be fixed.  If you are interested in this game I would tell you to get it but understand it has a learning curve and be prepared to ask for help or watch videos. \r\n\r\nIt will be worth it if you play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eco isn’t just another survival crafting game — it’s a living, breathing simulation of how civilization and the environment intertwine. Every tree you cut, every road you build, every law you pass has real consequences for the ecosystem and economy. It challenges players to think collectively, balancing progress with sustainability in a shared online world.\r\n\r\nThe sense of collaboration is incredible — politics, trade, ecology, and technology all collide in ways that feel organic and meaningful. Whether you’re a farmer, scientist, or politician, every role matters.\r\n\r\nIf you love games like Minecraft or Factorio but want deeper purpose and social depth, Eco is a must-play. It’s not just a game — it’s a lesson in coexistence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing mix between Economics and Survival. Towns, countries, and settlements",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "A typical example of a game with waaaay too many systems that don't really add much aside from making the game more tedious and seemingly stuck in endless EA.\r\nThere could a fun game under all those layers, but there's just too much annoyance and overwhelmingly tedious things that you can't avoid.\r\nAlso doesn't just have a lot of bugs, but bugs that haven't been fixes in YEARS.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Don't buy it. The game was great two years ago when I was able to play. Dev introduced a nifty new camera feature linked to the character creation - which loads up BEFORE the title screen. It crashed because apparently EVERY cameras drivers get corrupted on the user end and its your problem now. Just unplug and uninstall the drivers - thats the fix, ignoring the fact you might need said camera for other applications and uses. This is completely unreasonable and complete dereliction of duty by the dev here, considering this issue has been highlighted for two years with people regularly encountering the problem.\r\n\r\nIf you really want it, don't have a webcam installed. Its the ONLY fix. If you have and use this hardware, there's a good chance you're going to encounter this problem and there is no help for you. I've been waiting YEARS. Hold on to your money, buy something else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It is a very good game from my point of view but a few downsides are that the game is still in early access and that it doesn't feel like they add a lot of content. I love the concept of the game and I even like the visuals. They also got a few blueprints which you can buy for real money which isn't a problem to have but what's bad about it is, that you can only use it so many times like 1x or4x for most of the things and then you have to purchase those blueprints again. Don't get me wrong I enjoy the game a lot but in the current state I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Two of my 6 hours were spent feeling the game out. I met a nice person that showed me around, but loading into the world takes a long time, but thats not the problem here. someone was closing the game before they loaded in and just kept trying to join- rinse and repeat and thats not the problem either. The problem is that each time they tried to enter the server you cant really do anything for  a long time. I spent 4 hours talking to a nice person who loves the game and was telling me about it. But I couldn't do anything except be shown around a town. Eco has been on my backlog for years and this multiplayer game has this common and terrible server issues that can stop you from playing all day.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Its supposed to be PvE but the truth is you are actually engaged in a perma-trade war.  The game doesn't respect your time. The amount of time I had to sink into a single like wipe of this game on a server than had some QoL mods, was more than the time I spent to beat borderlands 2 and all its DLCs twice over. Yet it felt like I had experienced less than 1/10 of the enjoyment. And i know they are completely different game types I am just talking about enjoyment.\n\nI enjoy Old School Runescape. I like Planet Crafter. I loved WoW. I love minecraft and other survival craft games like Valheim etc. So I should love this. But the vibe is just off. It doesn't play well with human psychology I think, and goes against it often. It might work in a clan of people but as a solo joining servers? nah not really.\n\nThe Ecology simulation and economy simulations are very interesting. So is the tech tree. I will give it another whirl again someday but after playing one wipe for like a month weeks I was done. The feeling of relief I had when the server reset was like a huge weight off my shoulders. Like \"finally I don't have to log into this anymore\". Coming online everyday to make sure I wasn't made completely irrelevant was such a chore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i have 739.9 hours on Eco and i can say i used to love this game now after all these changes that make the game slow and boring. not just that but now they force you to join a city if you don't you don't progress i used to like being the carpenter logger etc, i built my own roads to my house so i can be a distance from the town but no more. they changed the entire game to be honest and i haven't been able to get into it like i once did",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A cool concept hampered by a need to make things needlessly slow and a pain in the ass. Apparently the devs had to be begged to let the higher tier shovel carry more than *one* block of dirt at a time. This basically seems to be science project that got turned into a video game, for good or for ill.\n\nThe devs seem obsessed with the idea of making it as slow and as frustrating as possible. You need to make a government and currency to do the things you need to stop the destruction of the planet, when that. . .makes no sense. Everyone on the server knows the planet is doomed unless you can pull it all together. The goal is ultimately, save the world without killing the planet. \n\nI even brought this up in the steam discussions where it was frustrating for smaller servers or single players to be unable to function unless they built a government. I also said the currency necessity seemed like it was utterly arbitrary because everyone knows we work together or we all die. This isn't like real life where there's a bunch of idiots denying climate change is happening.\n\nThe response I got, from a developer of all people was 'Actually there's been a bunch of people on the main servers who have been 'pretending' that the meteor isn't going to hit and this is all a hoax' and how interesting and fascinating that was.\n\nSo basically said dev was talking about they had trolls and toxic players trying to ruin the game for other people, and saying that was a GOOD thing. Maybe on personal servers with roleplay or some shit? I don't know. Ultimately I feel like they should be focusing on the core thing of 'tech up without destroying the ecosystem to try and save the world'. Not trying to do a government simulation.\n\nI'll give it one thing, it is somewhat realistic in that if someone manages to gain power due to finding the resources necessary early, and they just don't want you to play the game you can just be shut out entirely and left to fend for yourself, all while that meteorite looms closer and closer.\n\nNot exactly what I'd want to see in a video game where you're supposed to potentially work with a lot of random other players. All it takes is one troll to ruin the game for everyone else. Seems really well thought out. If you can't tell that last sentence is sarcastic.\n\nTo be blunt, the devs seem to have their hearts in the right place, but I genuinely cannot recommend this game due to the fact that the devs seem obsessed with making it longer, more boring, and even more of a pain in the ass to do *anything*.\n\nThere's also been some kerfuffle I've heard about regarding milestones just being filled in without any changes made? That said, I don't know all the details so take that with a grain of salt.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got 10 days (40 hours played) into a server (out of 28 when the meteor is to hit) and then it became impossible to connect to it. \r\nI went to submit a bug report however you can't submit bug reports without being directed to a third-party website which the game pops up a warning about, stating that going to the website they're forcing you to is a potential risk. You also have to create an account there to actually submit your report. \r\n\"This link has not been verified by Strange Loop Games and may be dangerous\" is exactly what it states when redirecting you to this website. It makes bug reports far less accessible, I'm not making an account on a random website (random to the player) you're stating could well be 'dangerous.' Maybe verifying links you're forcing players to is a good idea. No wonder this game has so many bugs. \r\n\r\nGame is pretty buggy, and sometimes requires quitting and reloading multiple times to get it to work properly. Even then, it doesn't always work. I gave up on farming because the game wouldn't let me interact with any plants (crops or flowers). If you run off your property and harvest items in the world and then return to your property, it usually fixes that particular bug. \r\n\r\nThe character models are creepy looking and ugly tbh. Overall not a very aesthetic game. Controls are clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I saw a Let's play from this game 7 years ago, it was right after the release of the early access. A friend and I bought the game and we are playing it right now and content wise this is a complete different game, in a good way I really liked that, because you can still see the core game from back then but after 7 years there are still the same bugs and the same broken A.I, like back then, in the Let's play were the youtubers already complaint about it. The Game is cool but the developers should fix it and e.g I like the food system, because you can't just eat meat all the time, like in other games, but it is just really bad balanced, because the Nutritional values just don't make sense at all and you always have a problem with balancing your diet, at least in the beginning.\n\nEdit after 15 more hours: The game is fun it is a pretty peaceful, cozy game, but still the game is more confusing then it should be and I think it is not fun to rebuild yor house 3 times because you have to upgrade it with new materials or build a new one every time, espacially because you have to make room for one too if you rebuild it. There are things that could be better but the main problem are still the bugs.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I love this game, and will continue to play, but the amount of time dedicated should come as a warning more than an encouragement. You will fall behind, people on the server will quit, and unless you or someone you know can buy or host a server, get ready to dedicate your time, because once you're the last carpenter on a server, you've unknowingly signed up for a full-time job, no pay.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Unfortunately it's so so reliant on real time participation and either having a group of people to play with or being able to find a group. The gameplay seems pretty cool but the grind is crazy difficult unfortunately, not really for casual players.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "This game is not viable solo or with a group of 4 people, you basically need like 20 people playing this to get anything done at a reasonable rate because everything is on timer and getting resources takes absolute ages and crafting it into usable stuff takes even longer. Then you have to EXTREMELY slowly level up each individual skill to unlock anything else",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Update 12 broke the game countless bugs even worse perfomance than before and the new shader looks ass. I really liked the game its sad to see what it has become.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It is a very good game from my point of view but a few downsides are that the game is still in early access and that it doesn't feel like they add a lot of content. I love the concept of the game and I even like the visuals. They also got a few blueprints which you can buy for real money which isn't a problem to have but what's bad about it is, that you can only use it so many times like 1x or4x for most of the things and then you have to purchase those blueprints again. Don't get me wrong I enjoy the game a lot but in the current state I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a weird game to judge, its basicly a game of chores todo to progress like any research and advancment type game but its very pretty and i like the concept of the inter-player dependancy.\r\n\r\nWhat really sets it back though is the lack of any decently populated servers that dont just die out after a week. Does not feel good to play on a server for like a week and its dead by the next time you logon.\r\n\r\nAnd imagine if this game had warfare and conquest that would be one of the coolests games in the world.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Its supposed to be PvE but the truth is you are actually engaged in a perma-trade war.  The game doesn't respect your time. The amount of time I had to sink into a single like wipe of this game on a server than had some QoL mods, was more than the time I spent to beat borderlands 2 and all its DLCs twice over. Yet it felt like I had experienced less than 1/10 of the enjoyment. And i know they are completely different game types I am just talking about enjoyment.\n\nI enjoy Old School Runescape. I like Planet Crafter. I loved WoW. I love minecraft and other survival craft games like Valheim etc. So I should love this. But the vibe is just off. It doesn't play well with human psychology I think, and goes against it often. It might work in a clan of people but as a solo joining servers? nah not really.\n\nThe Ecology simulation and economy simulations are very interesting. So is the tech tree. I will give it another whirl again someday but after playing one wipe for like a month weeks I was done. The feeling of relief I had when the server reset was like a huge weight off my shoulders. Like \"finally I don't have to log into this anymore\". Coming online everyday to make sure I wasn't made completely irrelevant was such a chore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A typical example of a game with waaaay too many systems that don't really add much aside from making the game more tedious and seemingly stuck in endless EA.\r\nThere could a fun game under all those layers, but there's just too much annoyance and overwhelmingly tedious things that you can't avoid.\r\nAlso doesn't just have a lot of bugs, but bugs that haven't been fixes in YEARS.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Two of my 6 hours were spent feeling the game out. I met a nice person that showed me around, but loading into the world takes a long time, but thats not the problem here. someone was closing the game before they loaded in and just kept trying to join- rinse and repeat and thats not the problem either. The problem is that each time they tried to enter the server you cant really do anything for  a long time. I spent 4 hours talking to a nice person who loves the game and was telling me about it. But I couldn't do anything except be shown around a town. Eco has been on my backlog for years and this multiplayer game has this common and terrible server issues that can stop you from playing all day.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't buy it. The game was great two years ago when I was able to play. Dev introduced a nifty new camera feature linked to the character creation - which loads up BEFORE the title screen. It crashed because apparently EVERY cameras drivers get corrupted on the user end and its your problem now. Just unplug and uninstall the drivers - thats the fix, ignoring the fact you might need said camera for other applications and uses. This is completely unreasonable and complete dereliction of duty by the dev here, considering this issue has been highlighted for two years with people regularly encountering the problem.\r\n\r\nIf you really want it, don't have a webcam installed. Its the ONLY fix. If you have and use this hardware, there's a good chance you're going to encounter this problem and there is no help for you. I've been waiting YEARS. Hold on to your money, buy something else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game way back about the time it was released, I had a lot of fun playing it, completed it 2 times, and then went on to other games, I Started noticing all the updates recently so wanted to play again, except this time I could not get the game to start I kept getting a light blue screen and then it would just close, So I uninstalled a few time no fix, checked the help area and saw that I need to uninstall any cameras, I didn't have any cameras so what was I supposed to uninstall, asked a question and got a reply to uninstall any cameras, only thing I had was my security camera software, not an actual camera plugged in, so I uninstalled it just to see and the game still didn't start, I also have the Meta Quest VR software installed, so I uninstalled that, Eco finally launched and I could play, But I need Meta Quest VR installed I use it to keep in touch with family that live in other states and sometimes I have meetings with it too, and I need my security cameras on to keep an eye on my business, so it's either don't use Vr and Security to play Eco or Use them and don't play Eco, So Family and Security is more important, so goodbye to Eco, Devs need to stop telling us paying customers to uninstall software that most of us need to use daily and fix the game, from what I'm gathering this has been an issue for quit awhile now and still no fix, So I don't recommend Eco for these reasons and if a fix ever comes out I'll change my mind.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"Major\" update 12 has less gameplay content than the major updates preceding it, This is what happens when you hire more artists and designers than actual gameplay people.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i have 739.9 hours on Eco and i can say i used to love this game now after all these changes that make the game slow and boring. not just that but now they force you to join a city if you don't you don't progress i used to like being the carpenter logger etc, i built my own roads to my house so i can be a distance from the town but no more. they changed the entire game to be honest and i haven't been able to get into it like i once did",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "its alright. Not my type of game. after playing about 7 hours, I felt like I was playing some kind of farming with friends mobile game. Hard to find active servers that stay populated enough to make progress as a community. Its a pretty lonely feeling game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "An Early Access game doing Micro-Transactions for placeable items almost feels illegal. Steam should really crack down on EA games that don't release within a 5 year period and try to nickel and dime their players. The issue is this game could not push into a completed state when the same problems that have been around since 2017 are still here in 2025. This is one of those games that everyone wishes was a massive success like Minecraft that play it but it's not and we all know it. The biggest issue you will read over and over is how the servers die in less than two weeks. It's a very real issue and the developers have never managed to resolve. Even the most popular servers ran by their community manager can't hold population.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A cool concept hampered by a need to make things needlessly slow and a pain in the ass. Apparently the devs had to be begged to let the higher tier shovel carry more than *one* block of dirt at a time. This basically seems to be science project that got turned into a video game, for good or for ill.\n\nThe devs seem obsessed with the idea of making it as slow and as frustrating as possible. You need to make a government and currency to do the things you need to stop the destruction of the planet, when that. . .makes no sense. Everyone on the server knows the planet is doomed unless you can pull it all together. The goal is ultimately, save the world without killing the planet. \n\nI even brought this up in the steam discussions where it was frustrating for smaller servers or single players to be unable to function unless they built a government. I also said the currency necessity seemed like it was utterly arbitrary because everyone knows we work together or we all die. This isn't like real life where there's a bunch of idiots denying climate change is happening.\n\nThe response I got, from a developer of all people was 'Actually there's been a bunch of people on the main servers who have been 'pretending' that the meteor isn't going to hit and this is all a hoax' and how interesting and fascinating that was.\n\nSo basically said dev was talking about they had trolls and toxic players trying to ruin the game for other people, and saying that was a GOOD thing. Maybe on personal servers with roleplay or some shit? I don't know. Ultimately I feel like they should be focusing on the core thing of 'tech up without destroying the ecosystem to try and save the world'. Not trying to do a government simulation.\n\nI'll give it one thing, it is somewhat realistic in that if someone manages to gain power due to finding the resources necessary early, and they just don't want you to play the game you can just be shut out entirely and left to fend for yourself, all while that meteorite looms closer and closer.\n\nNot exactly what I'd want to see in a video game where you're supposed to potentially work with a lot of random other players. All it takes is one troll to ruin the game for everyone else. Seems really well thought out. If you can't tell that last sentence is sarcastic.\n\nTo be blunt, the devs seem to have their hearts in the right place, but I genuinely cannot recommend this game due to the fact that the devs seem obsessed with making it longer, more boring, and even more of a pain in the ass to do *anything*.\n\nThere's also been some kerfuffle I've heard about regarding milestones just being filled in without any changes made? That said, I don't know all the details so take that with a grain of salt.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got 10 days (40 hours played) into a server (out of 28 when the meteor is to hit) and then it became impossible to connect to it. \r\nI went to submit a bug report however you can't submit bug reports without being directed to a third-party website which the game pops up a warning about, stating that going to the website they're forcing you to is a potential risk. You also have to create an account there to actually submit your report. \r\n\"This link has not been verified by Strange Loop Games and may be dangerous\" is exactly what it states when redirecting you to this website. It makes bug reports far less accessible, I'm not making an account on a random website (random to the player) you're stating could well be 'dangerous.' Maybe verifying links you're forcing players to is a good idea. No wonder this game has so many bugs. \r\n\r\nGame is pretty buggy, and sometimes requires quitting and reloading multiple times to get it to work properly. Even then, it doesn't always work. I gave up on farming because the game wouldn't let me interact with any plants (crops or flowers). If you run off your property and harvest items in the world and then return to your property, it usually fixes that particular bug. \r\n\r\nThe character models are creepy looking and ugly tbh. Overall not a very aesthetic game. Controls are clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I must recommend against this one, though its interesting from an ecological perspective as well as having a historical bent, which was interesting comparing to real life history - for example the industrial revolution. Most people are not playing it this way - it seems to be a \"who has the biggest bank balance\". And there is a lot of toxic players, users, abusers (clinical narcissists as well (you know the ones who accuse you of doing what they are doing)).\n\nI've tried 3 servers/games. First one had a specific group all playing together, and not buying anything outside of the group. Second game was to be inducted into a group, and another where toxic laws were allowed. It was only after a brief stint solo that I figured all of these people were either playing the game wrong, or were actually malicious. Some of them being totally unaware of their behaviour/actions/words, blaming you/others, then when called out, actually accuse you of blaming others (totally irrational and classic DARVO). I was confused because one the one server it was the couple who I'd joined who regularly played together. I'd figure that I'm not the only patsy. Took me a few days to realise that I was being exploited, and only after a single player game did I understand the mechanics and how it is clearly designed as a collaborative, and social game. Whilst it is not designed for manipulative people, it is open to how people play. and clearly although there are many who play as intended (though may get bored and leave), there are a significant bunch of dodgy players.\n\nNote that I have an absurd amount of hours, but much of that was leaving the server list on whilst doing other things, falling asleep whilst playing, and generally being afk for some time... plus ofc on SP I had to stay logged on for the server to work. Other than that it is a massive time sink. Not good for your health.\n\nStill I've figured out the game, how everything works together, and what horrible people you can encounter (as well as decent ones).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3.6 hours gameplay in new ECO version (previous 31.8 played in version before 8.0) and still dosen't figured where those Skill tab locating. Keymaps settings doesn't have suck hotkey as been before update 10. Also, I doesn't understand why to change game mechanics for singleplayer? (Aka localhost) now when Skills window opening hotkey gone, skills fast access icon from hotbar near minimap gone, tutorial task doesn't giving you explaining how to open this or then. Only all about farming, crafting and building.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not finish, very very bad for coop play too much bug for everyone. its very sad for a game like this to be soo bad. it a lost of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Servers broken and the solution they give is basically disable all network security and/or don't use starlink. Not worth the hassle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is unpolished as all hell, def not worth £25.\n\nThe combat sucks (hunting a fox achievement is placed at 0.4% achieved by players which should tell you everything you need to really know about how far people get with the game before giving up entirely), character creation options are not only ugly but some of the hair styles even bug. \nThere's a lot to do in the game which is great... EXCEPT You're unlikely to get that far because of how jank the game currently is, it's insane this has been out almost 8 years and still feels no where near done.\nWorst of it all? \"TIIIIIMMMBBBEEEERRRR\" (If you know, you know).\n\nI will still continue to watch this game develop in hopes they make some good changes and finally listen to what the player base wants.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I saw a Let's play from this game 7 years ago, it was right after the release of the early access. A friend and I bought the game and we are playing it right now and content wise this is a complete different game, in a good way I really liked that, because you can still see the core game from back then but after 7 years there are still the same bugs and the same broken A.I, like back then, in the Let's play were the youtubers already complaint about it. The Game is cool but the developers should fix it and e.g I like the food system, because you can't just eat meat all the time, like in other games, but it is just really bad balanced, because the Nutritional values just don't make sense at all and you always have a problem with balancing your diet, at least in the beginning.\n\nEdit after 15 more hours: The game is fun it is a pretty peaceful, cozy game, but still the game is more confusing then it should be and I think it is not fun to rebuild yor house 3 times because you have to upgrade it with new materials or build a new one every time, espacially because you have to make room for one too if you rebuild it. There are things that could be better but the main problem are still the bugs.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game constantly drops connection, sometimes i get 10 minutes sometimes i get an hour. tired of it and walking away. no its not my internet or router. been playing multiplayer games for years with this setup and it is only this game!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "meh, not great. a lot is locked by multiple professions and xp is gained over time so not rewarding at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Dead game![/h1]\n\nNo more updates coming it seems. I repeat:\n\n[h1]The devs ABANDONED the game![/h1]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Still no cloud save, impossible for us multi pc users",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think it's necessarily a bad game, it's just not for me...  Looks bad, plays okay, but it isn't for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, and will continue to play, but the amount of time dedicated should come as a warning more than an encouragement. You will fall behind, people on the server will quit, and unless you or someone you know can buy or host a server, get ready to dedicate your time, because once you're the last carpenter on a server, you've unknowingly signed up for a full-time job, no pay.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Unfortunately it's so so reliant on real time participation and either having a group of people to play with or being able to find a group. The gameplay seems pretty cool but the grind is crazy difficult unfortunately, not really for casual players.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "This game is not viable solo or with a group of 4 people, you basically need like 20 people playing this to get anything done at a reasonable rate because everything is on timer and getting resources takes absolute ages and crafting it into usable stuff takes even longer. Then you have to EXTREMELY slowly level up each individual skill to unlock anything else",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Update 12 broke the game countless bugs even worse perfomance than before and the new shader looks ass. I really liked the game its sad to see what it has become.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It is a very good game from my point of view but a few downsides are that the game is still in early access and that it doesn't feel like they add a lot of content. I love the concept of the game and I even like the visuals. They also got a few blueprints which you can buy for real money which isn't a problem to have but what's bad about it is, that you can only use it so many times like 1x or4x for most of the things and then you have to purchase those blueprints again. Don't get me wrong I enjoy the game a lot but in the current state I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a weird game to judge, its basicly a game of chores todo to progress like any research and advancment type game but its very pretty and i like the concept of the inter-player dependancy.\r\n\r\nWhat really sets it back though is the lack of any decently populated servers that dont just die out after a week. Does not feel good to play on a server for like a week and its dead by the next time you logon.\r\n\r\nAnd imagine if this game had warfare and conquest that would be one of the coolests games in the world.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Its supposed to be PvE but the truth is you are actually engaged in a perma-trade war.  The game doesn't respect your time. The amount of time I had to sink into a single like wipe of this game on a server than had some QoL mods, was more than the time I spent to beat borderlands 2 and all its DLCs twice over. Yet it felt like I had experienced less than 1/10 of the enjoyment. And i know they are completely different game types I am just talking about enjoyment.\n\nI enjoy Old School Runescape. I like Planet Crafter. I loved WoW. I love minecraft and other survival craft games like Valheim etc. So I should love this. But the vibe is just off. It doesn't play well with human psychology I think, and goes against it often. It might work in a clan of people but as a solo joining servers? nah not really.\n\nThe Ecology simulation and economy simulations are very interesting. So is the tech tree. I will give it another whirl again someday but after playing one wipe for like a month weeks I was done. The feeling of relief I had when the server reset was like a huge weight off my shoulders. Like \"finally I don't have to log into this anymore\". Coming online everyday to make sure I wasn't made completely irrelevant was such a chore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A typical example of a game with waaaay too many systems that don't really add much aside from making the game more tedious and seemingly stuck in endless EA.\r\nThere could a fun game under all those layers, but there's just too much annoyance and overwhelmingly tedious things that you can't avoid.\r\nAlso doesn't just have a lot of bugs, but bugs that haven't been fixes in YEARS.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Two of my 6 hours were spent feeling the game out. I met a nice person that showed me around, but loading into the world takes a long time, but thats not the problem here. someone was closing the game before they loaded in and just kept trying to join- rinse and repeat and thats not the problem either. The problem is that each time they tried to enter the server you cant really do anything for  a long time. I spent 4 hours talking to a nice person who loves the game and was telling me about it. But I couldn't do anything except be shown around a town. Eco has been on my backlog for years and this multiplayer game has this common and terrible server issues that can stop you from playing all day.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't buy it. The game was great two years ago when I was able to play. Dev introduced a nifty new camera feature linked to the character creation - which loads up BEFORE the title screen. It crashed because apparently EVERY cameras drivers get corrupted on the user end and its your problem now. Just unplug and uninstall the drivers - thats the fix, ignoring the fact you might need said camera for other applications and uses. This is completely unreasonable and complete dereliction of duty by the dev here, considering this issue has been highlighted for two years with people regularly encountering the problem.\r\n\r\nIf you really want it, don't have a webcam installed. Its the ONLY fix. If you have and use this hardware, there's a good chance you're going to encounter this problem and there is no help for you. I've been waiting YEARS. Hold on to your money, buy something else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game way back about the time it was released, I had a lot of fun playing it, completed it 2 times, and then went on to other games, I Started noticing all the updates recently so wanted to play again, except this time I could not get the game to start I kept getting a light blue screen and then it would just close, So I uninstalled a few time no fix, checked the help area and saw that I need to uninstall any cameras, I didn't have any cameras so what was I supposed to uninstall, asked a question and got a reply to uninstall any cameras, only thing I had was my security camera software, not an actual camera plugged in, so I uninstalled it just to see and the game still didn't start, I also have the Meta Quest VR software installed, so I uninstalled that, Eco finally launched and I could play, But I need Meta Quest VR installed I use it to keep in touch with family that live in other states and sometimes I have meetings with it too, and I need my security cameras on to keep an eye on my business, so it's either don't use Vr and Security to play Eco or Use them and don't play Eco, So Family and Security is more important, so goodbye to Eco, Devs need to stop telling us paying customers to uninstall software that most of us need to use daily and fix the game, from what I'm gathering this has been an issue for quit awhile now and still no fix, So I don't recommend Eco for these reasons and if a fix ever comes out I'll change my mind.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"Major\" update 12 has less gameplay content than the major updates preceding it, This is what happens when you hire more artists and designers than actual gameplay people.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i have 739.9 hours on Eco and i can say i used to love this game now after all these changes that make the game slow and boring. not just that but now they force you to join a city if you don't you don't progress i used to like being the carpenter logger etc, i built my own roads to my house so i can be a distance from the town but no more. they changed the entire game to be honest and i haven't been able to get into it like i once did",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "its alright. Not my type of game. after playing about 7 hours, I felt like I was playing some kind of farming with friends mobile game. Hard to find active servers that stay populated enough to make progress as a community. Its a pretty lonely feeling game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "An Early Access game doing Micro-Transactions for placeable items almost feels illegal. Steam should really crack down on EA games that don't release within a 5 year period and try to nickel and dime their players. The issue is this game could not push into a completed state when the same problems that have been around since 2017 are still here in 2025. This is one of those games that everyone wishes was a massive success like Minecraft that play it but it's not and we all know it. The biggest issue you will read over and over is how the servers die in less than two weeks. It's a very real issue and the developers have never managed to resolve. Even the most popular servers ran by their community manager can't hold population.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A cool concept hampered by a need to make things needlessly slow and a pain in the ass. Apparently the devs had to be begged to let the higher tier shovel carry more than *one* block of dirt at a time. This basically seems to be science project that got turned into a video game, for good or for ill.\n\nThe devs seem obsessed with the idea of making it as slow and as frustrating as possible. You need to make a government and currency to do the things you need to stop the destruction of the planet, when that. . .makes no sense. Everyone on the server knows the planet is doomed unless you can pull it all together. The goal is ultimately, save the world without killing the planet. \n\nI even brought this up in the steam discussions where it was frustrating for smaller servers or single players to be unable to function unless they built a government. I also said the currency necessity seemed like it was utterly arbitrary because everyone knows we work together or we all die. This isn't like real life where there's a bunch of idiots denying climate change is happening.\n\nThe response I got, from a developer of all people was 'Actually there's been a bunch of people on the main servers who have been 'pretending' that the meteor isn't going to hit and this is all a hoax' and how interesting and fascinating that was.\n\nSo basically said dev was talking about they had trolls and toxic players trying to ruin the game for other people, and saying that was a GOOD thing. Maybe on personal servers with roleplay or some shit? I don't know. Ultimately I feel like they should be focusing on the core thing of 'tech up without destroying the ecosystem to try and save the world'. Not trying to do a government simulation.\n\nI'll give it one thing, it is somewhat realistic in that if someone manages to gain power due to finding the resources necessary early, and they just don't want you to play the game you can just be shut out entirely and left to fend for yourself, all while that meteorite looms closer and closer.\n\nNot exactly what I'd want to see in a video game where you're supposed to potentially work with a lot of random other players. All it takes is one troll to ruin the game for everyone else. Seems really well thought out. If you can't tell that last sentence is sarcastic.\n\nTo be blunt, the devs seem to have their hearts in the right place, but I genuinely cannot recommend this game due to the fact that the devs seem obsessed with making it longer, more boring, and even more of a pain in the ass to do *anything*.\n\nThere's also been some kerfuffle I've heard about regarding milestones just being filled in without any changes made? That said, I don't know all the details so take that with a grain of salt.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got 10 days (40 hours played) into a server (out of 28 when the meteor is to hit) and then it became impossible to connect to it. \r\nI went to submit a bug report however you can't submit bug reports without being directed to a third-party website which the game pops up a warning about, stating that going to the website they're forcing you to is a potential risk. You also have to create an account there to actually submit your report. \r\n\"This link has not been verified by Strange Loop Games and may be dangerous\" is exactly what it states when redirecting you to this website. It makes bug reports far less accessible, I'm not making an account on a random website (random to the player) you're stating could well be 'dangerous.' Maybe verifying links you're forcing players to is a good idea. No wonder this game has so many bugs. \r\n\r\nGame is pretty buggy, and sometimes requires quitting and reloading multiple times to get it to work properly. Even then, it doesn't always work. I gave up on farming because the game wouldn't let me interact with any plants (crops or flowers). If you run off your property and harvest items in the world and then return to your property, it usually fixes that particular bug. \r\n\r\nThe character models are creepy looking and ugly tbh. Overall not a very aesthetic game. Controls are clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I must recommend against this one, though its interesting from an ecological perspective as well as having a historical bent, which was interesting comparing to real life history - for example the industrial revolution. Most people are not playing it this way - it seems to be a \"who has the biggest bank balance\". And there is a lot of toxic players, users, abusers (clinical narcissists as well (you know the ones who accuse you of doing what they are doing)).\n\nI've tried 3 servers/games. First one had a specific group all playing together, and not buying anything outside of the group. Second game was to be inducted into a group, and another where toxic laws were allowed. It was only after a brief stint solo that I figured all of these people were either playing the game wrong, or were actually malicious. Some of them being totally unaware of their behaviour/actions/words, blaming you/others, then when called out, actually accuse you of blaming others (totally irrational and classic DARVO). I was confused because one the one server it was the couple who I'd joined who regularly played together. I'd figure that I'm not the only patsy. Took me a few days to realise that I was being exploited, and only after a single player game did I understand the mechanics and how it is clearly designed as a collaborative, and social game. Whilst it is not designed for manipulative people, it is open to how people play. and clearly although there are many who play as intended (though may get bored and leave), there are a significant bunch of dodgy players.\n\nNote that I have an absurd amount of hours, but much of that was leaving the server list on whilst doing other things, falling asleep whilst playing, and generally being afk for some time... plus ofc on SP I had to stay logged on for the server to work. Other than that it is a massive time sink. Not good for your health.\n\nStill I've figured out the game, how everything works together, and what horrible people you can encounter (as well as decent ones).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3.6 hours gameplay in new ECO version (previous 31.8 played in version before 8.0) and still dosen't figured where those Skill tab locating. Keymaps settings doesn't have suck hotkey as been before update 10. Also, I doesn't understand why to change game mechanics for singleplayer? (Aka localhost) now when Skills window opening hotkey gone, skills fast access icon from hotbar near minimap gone, tutorial task doesn't giving you explaining how to open this or then. Only all about farming, crafting and building.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not finish, very very bad for coop play too much bug for everyone. its very sad for a game like this to be soo bad. it a lost of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Servers broken and the solution they give is basically disable all network security and/or don't use starlink. Not worth the hassle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is unpolished as all hell, def not worth £25.\n\nThe combat sucks (hunting a fox achievement is placed at 0.4% achieved by players which should tell you everything you need to really know about how far people get with the game before giving up entirely), character creation options are not only ugly but some of the hair styles even bug. \nThere's a lot to do in the game which is great... EXCEPT You're unlikely to get that far because of how jank the game currently is, it's insane this has been out almost 8 years and still feels no where near done.\nWorst of it all? \"TIIIIIMMMBBBEEEERRRR\" (If you know, you know).\n\nI will still continue to watch this game develop in hopes they make some good changes and finally listen to what the player base wants.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I saw a Let's play from this game 7 years ago, it was right after the release of the early access. A friend and I bought the game and we are playing it right now and content wise this is a complete different game, in a good way I really liked that, because you can still see the core game from back then but after 7 years there are still the same bugs and the same broken A.I, like back then, in the Let's play were the youtubers already complaint about it. The Game is cool but the developers should fix it and e.g I like the food system, because you can't just eat meat all the time, like in other games, but it is just really bad balanced, because the Nutritional values just don't make sense at all and you always have a problem with balancing your diet, at least in the beginning.\n\nEdit after 15 more hours: The game is fun it is a pretty peaceful, cozy game, but still the game is more confusing then it should be and I think it is not fun to rebuild yor house 3 times because you have to upgrade it with new materials or build a new one every time, espacially because you have to make room for one too if you rebuild it. There are things that could be better but the main problem are still the bugs.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game constantly drops connection, sometimes i get 10 minutes sometimes i get an hour. tired of it and walking away. no its not my internet or router. been playing multiplayer games for years with this setup and it is only this game!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "meh, not great. a lot is locked by multiple professions and xp is gained over time so not rewarding at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Dead game![/h1]\n\nNo more updates coming it seems. I repeat:\n\n[h1]The devs ABANDONED the game![/h1]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Still no cloud save, impossible for us multi pc users",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think it's necessarily a bad game, it's just not for me...  Looks bad, plays okay, but it isn't for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, and will continue to play, but the amount of time dedicated should come as a warning more than an encouragement. You will fall behind, people on the server will quit, and unless you or someone you know can buy or host a server, get ready to dedicate your time, because once you're the last carpenter on a server, you've unknowingly signed up for a full-time job, no pay.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Unfortunately it's so so reliant on real time participation and either having a group of people to play with or being able to find a group. The gameplay seems pretty cool but the grind is crazy difficult unfortunately, not really for casual players.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "This game is not viable solo or with a group of 4 people, you basically need like 20 people playing this to get anything done at a reasonable rate because everything is on timer and getting resources takes absolute ages and crafting it into usable stuff takes even longer. Then you have to EXTREMELY slowly level up each individual skill to unlock anything else",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Update 12 broke the game countless bugs even worse perfomance than before and the new shader looks ass. I really liked the game its sad to see what it has become.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It is a very good game from my point of view but a few downsides are that the game is still in early access and that it doesn't feel like they add a lot of content. I love the concept of the game and I even like the visuals. They also got a few blueprints which you can buy for real money which isn't a problem to have but what's bad about it is, that you can only use it so many times like 1x or4x for most of the things and then you have to purchase those blueprints again. Don't get me wrong I enjoy the game a lot but in the current state I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a weird game to judge, its basicly a game of chores todo to progress like any research and advancment type game but its very pretty and i like the concept of the inter-player dependancy.\r\n\r\nWhat really sets it back though is the lack of any decently populated servers that dont just die out after a week. Does not feel good to play on a server for like a week and its dead by the next time you logon.\r\n\r\nAnd imagine if this game had warfare and conquest that would be one of the coolests games in the world.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Its supposed to be PvE but the truth is you are actually engaged in a perma-trade war.  The game doesn't respect your time. The amount of time I had to sink into a single like wipe of this game on a server than had some QoL mods, was more than the time I spent to beat borderlands 2 and all its DLCs twice over. Yet it felt like I had experienced less than 1/10 of the enjoyment. And i know they are completely different game types I am just talking about enjoyment.\n\nI enjoy Old School Runescape. I like Planet Crafter. I loved WoW. I love minecraft and other survival craft games like Valheim etc. So I should love this. But the vibe is just off. It doesn't play well with human psychology I think, and goes against it often. It might work in a clan of people but as a solo joining servers? nah not really.\n\nThe Ecology simulation and economy simulations are very interesting. So is the tech tree. I will give it another whirl again someday but after playing one wipe for like a month weeks I was done. The feeling of relief I had when the server reset was like a huge weight off my shoulders. Like \"finally I don't have to log into this anymore\". Coming online everyday to make sure I wasn't made completely irrelevant was such a chore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A typical example of a game with waaaay too many systems that don't really add much aside from making the game more tedious and seemingly stuck in endless EA.\r\nThere could a fun game under all those layers, but there's just too much annoyance and overwhelmingly tedious things that you can't avoid.\r\nAlso doesn't just have a lot of bugs, but bugs that haven't been fixes in YEARS.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Two of my 6 hours were spent feeling the game out. I met a nice person that showed me around, but loading into the world takes a long time, but thats not the problem here. someone was closing the game before they loaded in and just kept trying to join- rinse and repeat and thats not the problem either. The problem is that each time they tried to enter the server you cant really do anything for  a long time. I spent 4 hours talking to a nice person who loves the game and was telling me about it. But I couldn't do anything except be shown around a town. Eco has been on my backlog for years and this multiplayer game has this common and terrible server issues that can stop you from playing all day.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't buy it. The game was great two years ago when I was able to play. Dev introduced a nifty new camera feature linked to the character creation - which loads up BEFORE the title screen. It crashed because apparently EVERY cameras drivers get corrupted on the user end and its your problem now. Just unplug and uninstall the drivers - thats the fix, ignoring the fact you might need said camera for other applications and uses. This is completely unreasonable and complete dereliction of duty by the dev here, considering this issue has been highlighted for two years with people regularly encountering the problem.\r\n\r\nIf you really want it, don't have a webcam installed. Its the ONLY fix. If you have and use this hardware, there's a good chance you're going to encounter this problem and there is no help for you. I've been waiting YEARS. Hold on to your money, buy something else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game way back about the time it was released, I had a lot of fun playing it, completed it 2 times, and then went on to other games, I Started noticing all the updates recently so wanted to play again, except this time I could not get the game to start I kept getting a light blue screen and then it would just close, So I uninstalled a few time no fix, checked the help area and saw that I need to uninstall any cameras, I didn't have any cameras so what was I supposed to uninstall, asked a question and got a reply to uninstall any cameras, only thing I had was my security camera software, not an actual camera plugged in, so I uninstalled it just to see and the game still didn't start, I also have the Meta Quest VR software installed, so I uninstalled that, Eco finally launched and I could play, But I need Meta Quest VR installed I use it to keep in touch with family that live in other states and sometimes I have meetings with it too, and I need my security cameras on to keep an eye on my business, so it's either don't use Vr and Security to play Eco or Use them and don't play Eco, So Family and Security is more important, so goodbye to Eco, Devs need to stop telling us paying customers to uninstall software that most of us need to use daily and fix the game, from what I'm gathering this has been an issue for quit awhile now and still no fix, So I don't recommend Eco for these reasons and if a fix ever comes out I'll change my mind.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"Major\" update 12 has less gameplay content than the major updates preceding it, This is what happens when you hire more artists and designers than actual gameplay people.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i have 739.9 hours on Eco and i can say i used to love this game now after all these changes that make the game slow and boring. not just that but now they force you to join a city if you don't you don't progress i used to like being the carpenter logger etc, i built my own roads to my house so i can be a distance from the town but no more. they changed the entire game to be honest and i haven't been able to get into it like i once did",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "its alright. Not my type of game. after playing about 7 hours, I felt like I was playing some kind of farming with friends mobile game. Hard to find active servers that stay populated enough to make progress as a community. Its a pretty lonely feeling game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "An Early Access game doing Micro-Transactions for placeable items almost feels illegal. Steam should really crack down on EA games that don't release within a 5 year period and try to nickel and dime their players. The issue is this game could not push into a completed state when the same problems that have been around since 2017 are still here in 2025. This is one of those games that everyone wishes was a massive success like Minecraft that play it but it's not and we all know it. The biggest issue you will read over and over is how the servers die in less than two weeks. It's a very real issue and the developers have never managed to resolve. Even the most popular servers ran by their community manager can't hold population.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A cool concept hampered by a need to make things needlessly slow and a pain in the ass. Apparently the devs had to be begged to let the higher tier shovel carry more than *one* block of dirt at a time. This basically seems to be science project that got turned into a video game, for good or for ill.\n\nThe devs seem obsessed with the idea of making it as slow and as frustrating as possible. You need to make a government and currency to do the things you need to stop the destruction of the planet, when that. . .makes no sense. Everyone on the server knows the planet is doomed unless you can pull it all together. The goal is ultimately, save the world without killing the planet. \n\nI even brought this up in the steam discussions where it was frustrating for smaller servers or single players to be unable to function unless they built a government. I also said the currency necessity seemed like it was utterly arbitrary because everyone knows we work together or we all die. This isn't like real life where there's a bunch of idiots denying climate change is happening.\n\nThe response I got, from a developer of all people was 'Actually there's been a bunch of people on the main servers who have been 'pretending' that the meteor isn't going to hit and this is all a hoax' and how interesting and fascinating that was.\n\nSo basically said dev was talking about they had trolls and toxic players trying to ruin the game for other people, and saying that was a GOOD thing. Maybe on personal servers with roleplay or some shit? I don't know. Ultimately I feel like they should be focusing on the core thing of 'tech up without destroying the ecosystem to try and save the world'. Not trying to do a government simulation.\n\nI'll give it one thing, it is somewhat realistic in that if someone manages to gain power due to finding the resources necessary early, and they just don't want you to play the game you can just be shut out entirely and left to fend for yourself, all while that meteorite looms closer and closer.\n\nNot exactly what I'd want to see in a video game where you're supposed to potentially work with a lot of random other players. All it takes is one troll to ruin the game for everyone else. Seems really well thought out. If you can't tell that last sentence is sarcastic.\n\nTo be blunt, the devs seem to have their hearts in the right place, but I genuinely cannot recommend this game due to the fact that the devs seem obsessed with making it longer, more boring, and even more of a pain in the ass to do *anything*.\n\nThere's also been some kerfuffle I've heard about regarding milestones just being filled in without any changes made? That said, I don't know all the details so take that with a grain of salt.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got 10 days (40 hours played) into a server (out of 28 when the meteor is to hit) and then it became impossible to connect to it. \r\nI went to submit a bug report however you can't submit bug reports without being directed to a third-party website which the game pops up a warning about, stating that going to the website they're forcing you to is a potential risk. You also have to create an account there to actually submit your report. \r\n\"This link has not been verified by Strange Loop Games and may be dangerous\" is exactly what it states when redirecting you to this website. It makes bug reports far less accessible, I'm not making an account on a random website (random to the player) you're stating could well be 'dangerous.' Maybe verifying links you're forcing players to is a good idea. No wonder this game has so many bugs. \r\n\r\nGame is pretty buggy, and sometimes requires quitting and reloading multiple times to get it to work properly. Even then, it doesn't always work. I gave up on farming because the game wouldn't let me interact with any plants (crops or flowers). If you run off your property and harvest items in the world and then return to your property, it usually fixes that particular bug. \r\n\r\nThe character models are creepy looking and ugly tbh. Overall not a very aesthetic game. Controls are clunky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I must recommend against this one, though its interesting from an ecological perspective as well as having a historical bent, which was interesting comparing to real life history - for example the industrial revolution. Most people are not playing it this way - it seems to be a \"who has the biggest bank balance\". And there is a lot of toxic players, users, abusers (clinical narcissists as well (you know the ones who accuse you of doing what they are doing)).\n\nI've tried 3 servers/games. First one had a specific group all playing together, and not buying anything outside of the group. Second game was to be inducted into a group, and another where toxic laws were allowed. It was only after a brief stint solo that I figured all of these people were either playing the game wrong, or were actually malicious. Some of them being totally unaware of their behaviour/actions/words, blaming you/others, then when called out, actually accuse you of blaming others (totally irrational and classic DARVO). I was confused because one the one server it was the couple who I'd joined who regularly played together. I'd figure that I'm not the only patsy. Took me a few days to realise that I was being exploited, and only after a single player game did I understand the mechanics and how it is clearly designed as a collaborative, and social game. Whilst it is not designed for manipulative people, it is open to how people play. and clearly although there are many who play as intended (though may get bored and leave), there are a significant bunch of dodgy players.\n\nNote that I have an absurd amount of hours, but much of that was leaving the server list on whilst doing other things, falling asleep whilst playing, and generally being afk for some time... plus ofc on SP I had to stay logged on for the server to work. Other than that it is a massive time sink. Not good for your health.\n\nStill I've figured out the game, how everything works together, and what horrible people you can encounter (as well as decent ones).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3.6 hours gameplay in new ECO version (previous 31.8 played in version before 8.0) and still dosen't figured where those Skill tab locating. Keymaps settings doesn't have suck hotkey as been before update 10. Also, I doesn't understand why to change game mechanics for singleplayer? (Aka localhost) now when Skills window opening hotkey gone, skills fast access icon from hotbar near minimap gone, tutorial task doesn't giving you explaining how to open this or then. Only all about farming, crafting and building.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not finish, very very bad for coop play too much bug for everyone. its very sad for a game like this to be soo bad. it a lost of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Servers broken and the solution they give is basically disable all network security and/or don't use starlink. Not worth the hassle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is unpolished as all hell, def not worth £25.\n\nThe combat sucks (hunting a fox achievement is placed at 0.4% achieved by players which should tell you everything you need to really know about how far people get with the game before giving up entirely), character creation options are not only ugly but some of the hair styles even bug. \nThere's a lot to do in the game which is great... EXCEPT You're unlikely to get that far because of how jank the game currently is, it's insane this has been out almost 8 years and still feels no where near done.\nWorst of it all? \"TIIIIIMMMBBBEEEERRRR\" (If you know, you know).\n\nI will still continue to watch this game develop in hopes they make some good changes and finally listen to what the player base wants.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So I saw a Let's play from this game 7 years ago, it was right after the release of the early access. A friend and I bought the game and we are playing it right now and content wise this is a complete different game, in a good way I really liked that, because you can still see the core game from back then but after 7 years there are still the same bugs and the same broken A.I, like back then, in the Let's play were the youtubers already complaint about it. The Game is cool but the developers should fix it and e.g I like the food system, because you can't just eat meat all the time, like in other games, but it is just really bad balanced, because the Nutritional values just don't make sense at all and you always have a problem with balancing your diet, at least in the beginning.\n\nEdit after 15 more hours: The game is fun it is a pretty peaceful, cozy game, but still the game is more confusing then it should be and I think it is not fun to rebuild yor house 3 times because you have to upgrade it with new materials or build a new one every time, espacially because you have to make room for one too if you rebuild it. There are things that could be better but the main problem are still the bugs.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game constantly drops connection, sometimes i get 10 minutes sometimes i get an hour. tired of it and walking away. no its not my internet or router. been playing multiplayer games for years with this setup and it is only this game!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "meh, not great. a lot is locked by multiple professions and xp is gained over time so not rewarding at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Dead game![/h1]\n\nNo more updates coming it seems. I repeat:\n\n[h1]The devs ABANDONED the game![/h1]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Still no cloud save, impossible for us multi pc users",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't think it's necessarily a bad game, it's just not for me...  Looks bad, plays okay, but it isn't for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, and will continue to play, but the amount of time dedicated should come as a warning more than an encouragement. You will fall behind, people on the server will quit, and unless you or someone you know can buy or host a server, get ready to dedicate your time, because once you're the last carpenter on a server, you've unknowingly signed up for a full-time job, no pay.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Unfortunately it's so so reliant on real time participation and either having a group of people to play with or being able to find a group. The gameplay seems pretty cool but the grind is crazy difficult unfortunately, not really for casual players.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "This game is not viable solo or with a group of 4 people, you basically need like 20 people playing this to get anything done at a reasonable rate because everything is on timer and getting resources takes absolute ages and crafting it into usable stuff takes even longer. Then you have to EXTREMELY slowly level up each individual skill to unlock anything else",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Update 12 broke the game countless bugs even worse perfomance than before and the new shader looks ass. I really liked the game its sad to see what it has become.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It is a very good game from my point of view but a few downsides are that the game is still in early access and that it doesn't feel like they add a lot of content. I love the concept of the game and I even like the visuals. They also got a few blueprints which you can buy for real money which isn't a problem to have but what's bad about it is, that you can only use it so many times like 1x or4x for most of the things and then you have to purchase those blueprints again. Don't get me wrong I enjoy the game a lot but in the current state I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a weird game to judge, its basicly a game of chores todo to progress like any research and advancment type game but its very pretty and i like the concept of the inter-player dependancy.\r\n\r\nWhat really sets it back though is the lack of any decently populated servers that dont just die out after a week. Does not feel good to play on a server for like a week and its dead by the next time you logon.\r\n\r\nAnd imagine if this game had warfare and conquest that would be one of the coolests games in the world.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Its supposed to be PvE but the truth is you are actually engaged in a perma-trade war.  The game doesn't respect your time. The amount of time I had to sink into a single like wipe of this game on a server than had some QoL mods, was more than the time I spent to beat borderlands 2 and all its DLCs twice over. Yet it felt like I had experienced less than 1/10 of the enjoyment. And i know they are completely different game types I am just talking about enjoyment.\n\nI enjoy Old School Runescape. I like Planet Crafter. I loved WoW. I love minecraft and other survival craft games like Valheim etc. So I should love this. But the vibe is just off. It doesn't play well with human psychology I think, and goes against it often. It might work in a clan of people but as a solo joining servers? nah not really.\n\nThe Ecology simulation and economy simulations are very interesting. So is the tech tree. I will give it another whirl again someday but after playing one wipe for like a month weeks I was done. The feeling of relief I had when the server reset was like a huge weight off my shoulders. Like \"finally I don't have to log into this anymore\". Coming online everyday to make sure I wasn't made completely irrelevant was such a chore.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}