{
  "positive": [
    {
      "review": "if you ignore the massive over priced DLCs and the massive pay to win situations its actually a fun game to play",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "robots, cars, guns and rockets. for free, great nice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the concept of the game - short matches with different players. I also like that there is an opportunity to create a variety of car models. \r\nHowever, I don't like some things. First of all, I think the prices are disproportionately high. \r\nI also don't like the fact that you change the parameters of weapons. I pay you real money for a specific offer, for example, if I buy a machine gun with unlimited bullets, but after a few months you make an update and the weapon already has a limited amount of bullets. It would be like if I bought a black car in the salon, but after regular maintenance you gave me a red one. \r\nAlso, in the two years since I played this game, I have not found uranium ore in the chests once - it doesn't seem very fair.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Instead of fighting the opposing team, your teammates will be toxic to you for existing.\r\nThey will ram into you, honk their horn and bm with the voice lines in game.\r\nThey will do this until you stop existing (leave the game).\r\n\r\nThis is where you will want to ignore their inevitable cries and demands for help if you don't care to register the fact that they exist into your neurons and continue to try to play the game instead.\r\n\r\nI recommend the game, not the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game, just the campaign is really short and overall leaves much to be desired with it's cliffhanger ending.\r\nEverything else is absolutley awesome other than some balancing tweaks to the PvP modes.\r\n9.6/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me play game.. Me like game. Game good. Take while to grind for item, but most thing in game free if you play long enough. Me like that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, easy to get into the pocket, but as long as you just buy battle passes to support an otherwise free game, you can get and keep competative and have a lot of fun doing so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like LEGO, but in wasteland, fun to play and see others builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has played a key role in fueling my urge to build and destroy with what I have made. I love the style, the gameplay, the mechanics, everything. It has changed so much since when I was young. Though I do not enjoy that now everything (even MGs) uses ammo, I understand it is for realism and I urge everyone with that urge to make cars of destruction to leviathan sized monsters and even helicopters. PLAY THIS GAME,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly a remarkable game. Easy to pick up but challenging for all the entertaining reasons. Your creativity followed by the many functions and systems leads to a gran display of what you can create solely for destruction and all around enjoyment. Most would immediately jump to \"PaY tO wIn\" because you can purchase the in-game currency but you buying things in the market DOES NOT equate to you being better. You WILL be thrown into the groups of people with 100, 200, 400+ hours while being DEVOURED by the local population that hides under rocks to play this (myself included). Great community and there is always someone higher and lower that willingly tag along to either help or ask for help and it truly creates an amazing community without much toxicity since there are MILLIONS on creations that are possible at your disposal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "creativity and speed gives lots of opportunity to expand your mind and have fun in the combat naspects of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this game for probably 100 hours or so (not on steam) and can say i love the concepts and basic gameplay, put theres just so much pay to win that it kind of ruins it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, awsome graphics and fun gameplay love the mad max feel to it and the freedom to build whatever is cool to! otherwise play the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd say it's worth a try. It's kind of hard to get into, but it's free so unless you know you won't like it, it's probably worth giving it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Game you can create your vehicle from a truck to a robot or helicopter and the graphics are really nice and is really addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game and there is nothing else like it in the vehicle combat genre. However, I can't deny that it is pay to win, to an extreme level. I spent money to buy some packs and yet get matched with opponents with Legendary Weapons and high PS. Funnily enough, you can't see your Win/Lose ratio, pretty sure it's abysmal for 99% of players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "exciting gameplay, endless creativity, and frequent updates with new parts\r\nplayer controlled in-game marketplace",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game fills my cravinds for feeding the snail without spending 79.99 on a jet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive and fun.\n\nBecause who doesn't like blowing up other people?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but...\n\n\n\n\nIT NEEDS A FUCKING SANDBOX MODE",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game but too tedious and mostly blocked by paid content.and you run out of gas.insane.bur the graphics are insane good and good controls.smooth now in steamdeck still a good game for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hit the gas pedal, spray shrapnel all over the battlefield, tinker in the garage, make crazy engineering plans... a nice little game of custom cars and metal mayhem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Post-apocalyptic car lego at its best. The core gameplay is incredibly satisfying. Building your deadly machine from hundreds of parts, carefully placing armor, and wiring up weapons feels like genius. Then, you take your creation into battle and watch it get torn to pieces, which is just as fun.\n\nThe grind is real and the monetization can be aggressive, so be prepared for a long haul or to open your wallet. You will face players with better gear.But the moment you perfectly build a car that dominates the battlefield, you'll be hooked. It's a unique game for engineers and mad max enthusiasts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crossout is a game for those with creativity yet, love destroying in fashion. I recommend this game for I've been the happiest while playing it, there's PVP/PVE, Battle Pass challenges to grind, weekly events with free prizes, recourses to discover, parts to craft, blueprints and ideas to be shared, visual graphics and game physics to enjoy, lore to be interested in, lots to do in such little time so, I'm looking forward to seeing you here!<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game got kinda boring after a wihle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pay to win Twisted Metal and its fine if you dont like to grind just buy the battlepass and have fun. 8/10 just because it doesnt have first person camera.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, build cars, throw a few guns on it, and shoot others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game i have played it for year. Matchmaking a little weird right now and a little bit of a grind but you can get everything F2P if you budget your time right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, very nice and creative crafting system, nice battles, sometimes funny, intense. sometimes there are some season missions that are also interesting. Even if I never payed, I can say that with practice you can be really competive even to those with better weapons and equipment who pay and this makes the satisfaction even better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Reminds me of the twisted metal days. Love being able to build your own rig from scratch!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game had so much potential but is kinda grindy and devs need to rethink some of the gamemodes, progression and gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mad Max meets Lego. Building cars and blowing each other up never gets old — tons of customization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "why the hell did a block with 68 guns on it follow me and shot me dead when i was just a van :(\n ts game is  so fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very cool and fun game to play!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BUILDING VEHICLES TO DESTROY OTHER VEHICLES, HELL YEAH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bit of grind bu its fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of fun lots of grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Build, Destroy, Get Bored, Quit, REPEAT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "классная игра жалко что онлайн погас",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realy cool and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best gajin game in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "reminds me of build a boat on roblox :sob:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Что-то ничего тут не меняется.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is palworld and risk of rain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS MEGA GOOD GAME I LOVE IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They have running cars . I'm serious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this on my consoles and my computer i enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy fun game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice f2P game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very goood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OK game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Make Progression easier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "niceee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "becuase u can build ur own car",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but you need to donate to have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun. Give it a shot for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grreat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SOOOOOOOOOOO FUUUUUUUUUNNNNN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strong car",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mashed potatoes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "because i like your poop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game BIG wait times :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty damn fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "игра имба",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the actoin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "COOL GAMY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "car go brrrrrrrrrrrrrrrrrrr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i saw a flying car",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me make tiny tim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Навеяло воспоминаний)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Amazing concept, the core mechanics are very fun and the world is pretty interesting, however it is filled with seal clubbing, pay to win mechanics, and a toxic playerbase. The worst examples of greed as the main currency can be bought with IRL money and battlepasses that rotate every three weeks that give out top tier items for $20. Not to mention the mutlitude of packs and multiple active battlepasses that hold all the new items only for people who buy it. \n\nFills a very specific niche but abuses that advantage and milks it for all its worth. Even after over a hundred hours on steam and three times more on console, I can really only recommend it for people that really want a post-apocalyptic, build-your-own vehicle, war thunder type game, but even then I would recommend looking for other outlets instead of this sad excuse of a game.\n\nThere are better free games and there are better post-apocalypse games out there, dont waste time or money on this one",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "Even if it says \"free to play\", it isn't worth your time and even less your money. there are way better F2P games you can find on here.\n\nWorst economy system full of bots and no trading system.\nNo true open world (they definitely should make it an mmo)\nBad matchmaking also full of bots.\nBad dev team (it's very difficult to reach them).\nThe game community is filled of no-lifers who appreciate the game by spending a lot of IRL money and enjoy your lack of in-game currency.\n\nWhat else is there to say?",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "installed - uninstalled\n\nwhat a fn cashgrab, absolutely disgusting. \ntheir greed sickens me. \n\nWas far better at the begining.. Had over 200hr on xbox and it was just a different game back then.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "10 hours. 10 hours before the game was uninstalled. First and foremost, matchmaking sucks. You will be waiting 5 minutes for a game to start that is filled with people with much better gear than you. Second, its as P2W as it gets. And Gaijin themselves are horrible. HUNDREDS of people complaining how they can't get support for the game. Would not reccomend until Gaijin stop treating this game as a cashgrab.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "scammy marketing, hugely fun game. Be prepared to put a ton of hours in or get stomped.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "VERY FUN game, BUT\r\n\r\n1) Too many paywalls\r\n2) Lame PVE, F-tier story mode\r\n3) Too many restrictions placed on player economy & there is a transaction tax (on the in-game money) so you're ALWAYS bleeding coins because the devs are super greedy.\r\n\r\nCertain events are very creative and fun, and I wish there were more games like this but no one makes them and they don't seem to find a playerbase unfortunately.\r\n\r\nI think if one came out with a very robust PVE / Singleplayer experience it could 100% top charts on Steam. \r\n\r\nThis genre of game is the ultimate definition of 'build-crafting' & it is ADDICTING just to build your vehicle.\r\n\r\nAs for crossout? \r\n6.5/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the game could have been sooo good..\n\ninstead it turned into a literal p2w fkkfest.\nfree players have almost no progression, but thats expected in a game like this.\n\nand i still remember the devs promise when this game was released:\n\"no, we will never make this p2w or release endgame gear to just buy\"\n... and now look at the dlc list\nyou can just buy a vehicle pack, take it apart and then use all the endgame things used in it in your own builds,including weapons \n...literally skipping hundreds of hours of progression needed otherwise.\n\ncan ignore the fact that this also has no anti-cheat to speak of and people are using aimbots in those rare events where everyone gets the same vehicle with 1shot-kill weapon, no ones really playing those anyway.\n\ngreat concept of a game\ncompletely ruined by greed\n\nstay well clear of this garbage unless you intend to spend money in the 4 digit range.\nthen...it could potentially be fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Solid 4/10, good idea, worse infinite grinding, and even worse new P2W players sadly.\n\nIt was good when I started playing it few years ago, but when they added season pass, it is only P2W and not worth playing!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's an ok game. Not a big fan of MMO's because you always end up against way more powerful players that spend hundreds of dollars to get all the good stuff.. If you want to keep up, you have to spend money on this free game...that's how they get you. Otherwise, the physics are decent, graphics are decent.. 5/10 from me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Controller overlay in the menus and in match are buggy since 2 updates ago...I see nothing but KB&M overlay except when I am pressing on the buttons on my Xbox controller. It's not the controller and it works fine in other titles and game launchers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Their servers are horrible, I play other games just fine but this is just randomly rubberbands. \nIm all for seeing damage but i hate falling apart.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No cross-progression. Not starting over from scratch on this pay-to-win game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game just isn't it if you like a game where you work towards a goal for months sure but if your into something less slow paced in progression play something else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dead game no option to play with bots waited for like 5 minutes still no matches",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Matchmakeing in this Game is  Very Poor even worse in PVE  usally more than 3-4 lvs above your own while building the Cars is fun  you put alot of time and money into it only to get 2or 3 shooted  out and DESTROYED !!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a pay to play sort of game with terrible customer service.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ">Matchmaking is unfair, going against enemies with high end gear and filled with bots to make up for the players not present.\r\n>you can't craft anything without coughing up currency from the player \"market\" (Yes you need to additional currency to craft items.)\r\n>It has a PVE Mode that you plays out like a mobile game, fuel is your \"energy\" counter for you play Raids which its PVE Only.\r\n\r\nOverall: its a Pay To Win slop. You're better off playing something else that's worth your time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is so shit it doesn't let me build much at all if i am not higher level (DO NOT PLAY ITS NOT WORTH YOUR TIME)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Always dragged to the RU server, and ping were awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gajin and f2p in the same sentence will make the world a black hole",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game has been crashing within 5 mins every time i play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Early game is rather bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eventually becomes a pay to progress game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TOO MANY PAYWALLS, AND ENDURING GRINDS...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this shit is somehow worse than mobile games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just dont play it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5 minute loading screens. 2 minute games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very pay to win and it makes it feel like having money is a sin",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "пожалуйста не надо",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if greed was a person",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "huera",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P2W",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unless you already have 2000 hours or a full wallet with nothing better to spend on, this game just seems impossible for new players.\nWar Thunder atleast has battle ratings as a means of balancing, here you can basically smurf and stomp anyone who hasn't payed the snail enough.\nAs for my hours, I am a veteran, played the game somewhat near release and it was so fun back then.\nStopped playing, came back about a year ago, uninstalled same day, and just today did the same thing.\n\nIt suffers from the Gaijin curse.\nIt's an overall S-tier game that gets ruined by a grind that does not respect your time at all, and purposefully unbalanced content put behind a paywall to earn cash (aka greed).\n\nReally wish there was a game that was like peak-crossout, where you make a vehicle and ass you progress you get to modify it your way. Wanna go faster? Can do that, make a racecar even. Big cannon? Yup that's possible too.\nI even did both.\n\nNow you just get stomped by mechs that somehow get matched against you, and 80% of players are semi-helicopters, which imo really ruins the aspect \"mad max\" aspect of the game.\n\nJust don't touch this, it was good at one point but now it's just a waste of time.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "Amazing concept, the core mechanics are very fun and the world is pretty interesting, however it is filled with seal clubbing, pay to win mechanics, and a toxic playerbase. The worst examples of greed as the main currency can be bought with IRL money and battlepasses that rotate every three weeks that give out top tier items for $20. Not to mention the mutlitude of packs and multiple active battlepasses that hold all the new items only for people who buy it. \n\nFills a very specific niche but abuses that advantage and milks it for all its worth. Even after over a hundred hours on steam and three times more on console, I can really only recommend it for people that really want a post-apocalyptic, build-your-own vehicle, war thunder type game, but even then I would recommend looking for other outlets instead of this sad excuse of a game.\n\nThere are better free games and there are better post-apocalypse games out there, dont waste time or money on this one",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "A free to play.....Pay2Win.....Cross-Platform....NONE ACCOUNT PROGRESSION CROSS-PLATFORM....\r\n\r\nIts the pure defintion of Laziness and Greediness rolled into 1... \r\n \r\n\r\nGames great if ya can get past that. Lol",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Don't play this game. It's incredibly pay to win and basically impossible to progress without paying.\n\nThe UI is incredibly convoluted with multiple events, with all of them being in the battle pass style (with a premium tier ofc)\n\nAlso has a pretty small playerbase if i'd  guess, every lobby is about 50% bots. With my current playtime I don't have a single epic weapon and the good weapons I do have have just been given out some time ago to all players.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Cool game, fun concept and fun to play. But there are way to many problems in it such as near constant seal clubbing, every new thing they add is either trash or over powered and a lot of the events are cash grabs. \r\n\r\nwould still recomend, just don't get too attached to it.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Maybe if gaijin got there shxt together and released cross progression this game could thrive. As the game stands now it's not worth my time any more.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "this game was fine a few years ago, it was a little p2w but it was fun, now its mostly pay to do anything, and if you mess up once in a story mission, you restart the entire mission, which is horrendous when your spending 5 minutes per objective, especially when the ai your trying to defeat have the ability to force you ontop of them and stop you from doing anything",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Even if it says \"free to play\", it isn't worth your time and even less your money. there are way better F2P games you can find on here.\n\nWorst economy system full of bots and no trading system.\nNo true open world (they definitely should make it an mmo)\nBad matchmaking also full of bots.\nBad dev team (it's very difficult to reach them).\nThe game community is filled of no-lifers who appreciate the game by spending a lot of IRL money and enjoy your lack of in-game currency.\n\nWhat else is there to say?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Pay to win of course no problemo, but another thing I noticed is the adventure mode. Yes lets give the guy we have to escort no guns and a fucked up weak ass car that gets one shotted so the player can't progress and waste 2 hours of their life.. could have just added checkpoints or live repair kits honestly or even change blueprints mid-mission. Thanks gayjin.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "As an idea, it's amazing. A platform to build your own vehicles to drive, to battle, to do whatever really, although who am I kidding, mostly battle. However as a game, it is a horrendous demonstration of greed. Players must devote their very lives to the game, grinding battle after battle to acquire the resources for even the simplest of parts... or you could just, empty your wallet into overpriced packs to get that part you wanted. The worst part is that it wasn't always like this... I tried the game pre-2020 and it wasn't bad, I left due to hardware difficulties on my end. I decided to try again almost a month ago... it's truly heartbreaking to see such a beautiful idea reduced to utter garbage. The storytelling in the game is obscure at best and the balancing mechanic is... well... \"broken\" would be an understatement. Picture rookie players sticking every piece of junk to their vehicle, thinking the extra armor will give them some hope for survival... only to be obliterated by the stripped down top tier cab with a singular outrageous weapon, only because their point scores are somehow close enough by the dev's standards despite the obvious unbalance. Needless to say, I left again, this time because I wasn't willing to accept this frankly disappointing standard...\n\nMuch regret, Requiem.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "-P2W is beyond any imagination... you are literally forced to stay at tutorial kind of gameplay if you dont spend money, people who play Gaijin games for years call this pile of shit (crossout) \"Warthunder cash cow\"\r\n-Match making is simply not fair, you usually get paired with people that have thousands of PW (power score) more than you-skill,gear,experience and knowledge gap is huge.\r\n\r\n-Battle pass(es)/events etc. All of them have total crap with free version: tiny amount of resources you can get in one battle,grey/white gear (worst in the game) or some customization stuff (again, nothing cool, just casual and most common stuff) While in premium (paid) version of those events you have rewards that can make you literally one of the top players in means of PW: best possible gear in game, even at the beggining of paid battle pass, ton of resources (not like in free pass, amount literally goes up by 10x or even more) Unique customization parts with lot better bonuses, TON of premium currency and other goodies.\r\n\r\n-Game support and safety app is (not) funny joke, I wanted to log into my old account and I was told to use code sent on my mobile app, to enter app I must input code that was sent IN THE APP, I had to wait several days for response from support, and the quality of help is terrible.\r\n\r\n-Price of literally anything is sick, ~30 EURO for few customization stuff that barely gives any bonuses, all the packs or offers are as incredibly expensive as that... There is no regional pricing, every country has same price which is just cruel: while Switzerland can afford it easily cause their average pay is high, people from poorer countries can only dream of buying something.\r\n\r\n-Wait time... Maybe game is dying, or maybe gaijin just sucks and cant set a proper match making, but wait time is diabolical. On steam I played for over 22 hours, and on the launcher for about 50, every single round was like miracle, average wait time is literally ~2 minutes and this is a very positive reduction result, sometimes it happened much longer, no matter the time:day,night,afternoon,midnight... it always took ages to load me into game.\r\n\r\n-Events are constatly repeated, there is rarely a new event... they keep repeating same old boring stuff from ages ago, I wouldnt be suprised if the rewards were the same but Im not sure of it...\r\n\r\n-Game is extremely grindy, regular parts cost 650 scrap, and you get about 30 scrap per round if you do average score, and thats just first tier of item, there are rare,epic,legendary,relic items and they require a lot more and use previous items: so if you want epic tier weapons for example, it requires 2 rare weapons from its tech branch, and those 2 rare weapons require 2 common weapons from its branch (EACH!)... so to get just one epic part which is not super op you need tens of hours of grind if you play without spending cash.\r\n\r\n-Many parts can be gained only by buying it, you need \"recipe\" to craft legendary/relic items, and those can be only obtained from premium battle pass, some relic tier weapons dont even have recipe, they can be bought for even more cash than most of stuff in game...\r\n\r\n-Very toxic community, no chat moderation, everyone can throw n-words or other slurs without any ban or warning. And in game like this most players spend their round on the chat blaming others for their skill issue...\r\n\r\n-Few game modes, all of them seem very similar: horde of enemies comes from left, then right, then comes boss and thats 80% of gameplay, other 10% is PvP and next 10% are special events which are all repeated from previous years. Same maps thoughout years, only content added are packs/goodies for real cash.\r\n\r\n\r\n[h3]Game is COMPLETLY NOT WORTH anyone's time, I have a feeling that devs try to speedrun how to kill their game and they are doing it very well.\r\n-Worst P2W I EVER saw\r\n-Toxic community, no moderation\r\n-Terrible Match making and wait time\r\n-Very boring gameplay:no new maps, no new modes, no new events\r\n-Game support barely exist, and if by miracle you'll get answer it wont solve your issue, you will have to send e-mail once again, and then again, its pure RNG if they help, and wait time for response is several days.[/h3]",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "10 hours. 10 hours before the game was uninstalled. First and foremost, matchmaking sucks. You will be waiting 5 minutes for a game to start that is filled with people with much better gear than you. Second, its as P2W as it gets. And Gaijin themselves are horrible. HUNDREDS of people complaining how they can't get support for the game. Would not reccomend until Gaijin stop treating this game as a cashgrab.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "scammy marketing, hugely fun game. Be prepared to put a ton of hours in or get stomped.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "BattlEye Launcher notice comes up before the game. I'm sure it's fine 99% of the time but it's an uncomfortable amount of information for them to store for an anti-cheat that I'm SURE doesn't work (because none of them ever work well enough to stop cheaters).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "VERY FUN game, BUT\r\n\r\n1) Too many paywalls\r\n2) Lame PVE, F-tier story mode\r\n3) Too many restrictions placed on player economy & there is a transaction tax (on the in-game money) so you're ALWAYS bleeding coins because the devs are super greedy.\r\n\r\nCertain events are very creative and fun, and I wish there were more games like this but no one makes them and they don't seem to find a playerbase unfortunately.\r\n\r\nI think if one came out with a very robust PVE / Singleplayer experience it could 100% top charts on Steam. \r\n\r\nThis genre of game is the ultimate definition of 'build-crafting' & it is ADDICTING just to build your vehicle.\r\n\r\nAs for crossout? \r\n6.5/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game could have been a cult classic in the free to play genre for it's building mechanics and original gameplay.\n\nBut I feel this game will never take off and could slowly die out if the devs keep being afraid of making the average player be able to progress in a meaningful way.\n\nI put down a month's salary in Warframe over 10 years because I felt the [b] devs listenend to me and the community's feedback. [/b]\n\nCrossout on the other hand no more than 60 euros in around 6-7 years. I stopped at the 3rd purchase because I understood [b] I felt disrespected with my time and money.  [/b]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game could have been sooo good..\n\ninstead it turned into a literal p2w fkkfest.\nfree players have almost no progression, but thats expected in a game like this.\n\nand i still remember the devs promise when this game was released:\n\"no, we will never make this p2w or release endgame gear to just buy\"\n... and now look at the dlc list\nyou can just buy a vehicle pack, take it apart and then use all the endgame things used in it in your own builds,including weapons \n...literally skipping hundreds of hours of progression needed otherwise.\n\ncan ignore the fact that this also has no anti-cheat to speak of and people are using aimbots in those rare events where everyone gets the same vehicle with 1shot-kill weapon, no ones really playing those anyway.\n\ngreat concept of a game\ncompletely ruined by greed\n\nstay well clear of this garbage unless you intend to spend money in the 4 digit range.\nthen...it could potentially be fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is pay to win, and unpleasant to play as a new player.\r\n\r\nThe game has aweful new player experience, since match making is based on the amount of points per part, instead of player level.\r\n\r\nProgression drops off when you finish the early game, forcing you to buy battlepasses and the likes to continue getting a steady stream of new things to try.\r\n\r\nBuilds are heavily catered towards just a couple meta items, instead of everything being mostly equal. (pay to win items)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hate to see where this game is heading. Need more Mad Max and less Mech Warrior. This game is plagued by balance issues.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Return to the game after a long Hiatus and with my 6000 power machine and get matched against dudes with 12k. I got slaughtered, what the hell happened.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played this game a lot a few years back when it was still not on Steam, but I just decided to vent my frustrations now. Crossout HAD a fantastic concept and HAD very engaging gameplay that initially drew me in. Unfortunately, my experience was completely ruined by toxicity and frustration. The game is extremely grindy and pay-to-win. Matchmaking takes longer than the actual gameplay, but most frustrating of all... whenever I went to the forums to ask for help or report problems, I was met with insults and mockery from the devs and support. To add insult to injury, they closed my tickets leaving issues unresolved and my spirit broken. Cheating is also well-known and rampant, yet the devs refuse to acknowledge or address it. Whew...... Saying all this has lifted a huge weight off my chest, but players considering this game need to know what they're getting into.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Building and gameplay is a  loooot of fun.  However, it is pay2win, and the grind is ridiculously slow. Giving a negative review based on how egregious the monetization is. \r\nIf you want to progress and unlock things, expect to shell out a little cash, or be prepared to be at a severe disadvantage to those who do pay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "spent a good amount of money in this game and really enjoyed playing it. sadly the developers are trying to do too much to renovate something that was already amazing and the player base is rapidly leaving the game because of it. for example the game has recently introduced legs and helicopter attachments. these new legs arent like the ml200 big ram or even the recent spider type legs which were introduced into the game. they are trying to add mech class builds and completely rushed it even though the player base was strongly against it. and now after playing a handful of games against it as well. theres no reason i should have to change my entire garage around and sell every item i have to buy the latest and greatest stuff in order to just play the game. please fix your game and make the legs/ helis their own game mode again and maybe some of your players will come back but until then im uninstalling and wont be touching the game again. thanks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solid 4/10, good idea, worse infinite grinding, and even worse new P2W players sadly.\n\nIt was good when I started playing it few years ago, but when they added season pass, it is only P2W and not worth playing!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "over the years alot has changed, after jumping back in i can see nothing but an insane grind to feel like you arent progressing. if you have disposable income you can pay your way and actually play. cant say im a fan of helicopters and mechs being added because it creates major balance issues.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "oh my god do i hate gaijin, everyshred of hatered is wll deserved for theyr lazyness, cant launch the game, repair \"tool\" in launcher does nothing, updating everything doesnothing, reenstaling to different folder does nothing, tangem crash report always says I/O file interference so i force deleted all easy anticheat files from all games wit still no result, while forum thinks im a todler that cant see the obvious. and i just started to like to play it at my grandparents pc byt too bad, i dont believe im the only one who has this happening and the developers are lazy scumbags",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just give us actual PvE content and a creative build mode already.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do you have spider legs and laser weaponry? Cool you win.\r\n\r\nAnything else do not even bother. Rank system is a joke, the grind is p2w, and the only thing apocalyptic about this game is it's meta is as stagnant as water from Flint MI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "seems like a good and nice game but that a not, you can get bored from this game fast too much really i was spend 18 hours on this game and i have bad feels about it i do not recommend this game to any of all my friend really hell nah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is my first review.\nThe game is a good idea, but it's the worst game in terms of player consumption.\nEverything is paid, and the free stuff is garbage.\nAs someone who has played the game for over 2,400 hours, I'll explain some of their methods for stealing players:\n\n1. BP is released with illogically powerful weapons, and then, upon its expiration, they add an update that makes all its weapons weaker.\n\n2. There are weapons in the game that cannot be crafted, but sometimes an event occurs that allows you to craft them in exchange for items that cannot be crafted. At that moment, the game offers a discount on a package that includes all the crafting resources to entice the player to purchase them.\n\n3. The game is boring and you can't bear to play it with the same car design you have, especially since you often lose against players who use BP weapons.\n\n4. The beautiful scene you see in the game's trailer is something that can only be accessed if you pay financially.\n\nThe developers really don't care about the game and also it's a game that doesn't have voice chat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun but the devs dont care about you or your thoughts on the game. They just want your money thats it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Toxic community, its a club and you are not in it, They have players with special privilege because its such a small community, Players like \"Nocturnal\" can say things like \"you are better off in a gas chamber\" (i have a screen shot) and the GM will not punish them, instead, I got banned for bible verses. \r\n\r\nThen i go to the official disc, show the GM that banned me the screenshot of what Noc said, he cant punish Noc because he cant prove the time stamp....\r\n\r\nSo i go on the Gaijin website to try to get results, i get a code sent to my phone, well it never sends, so i cant use Gaijin app or anything, Figures right?\r\n\r\nSo basically they are all friends, if you enjoy double standards for rules and a small community, this is your game.\r\n\r\nAnd yes its pay to play, its a money grab, But that never bothered me, the community is a bunch of furries and they dont want outsiders in there, So here is my review. (after 2k hrs) Im done with the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you guys value a good time and a good community. you will not find it this game. It is run by the most heinous and most despicably incompetent staffing I have ever seen my time of gaming. you want to report something for literal rule breaks, targeted harassment and other very serious issues? good freaking luck with what. even if they do respond, you're just gonna get ghosted straight up afterwards because the money,the lies and the toxicity is what talks in this game. You will grow rotten and grow toxic the longer you play this game until your former good self has rotted into a shadow of your former self. The people here only care for themselves, not for others like you would expect. it is a community that has gone rotten to its core for its lack of compassion and lack of understanding. you never find true kindness in Crossout, but you will find plenty of misery and suffering in its place instead. \"Kindness saves the world\" doesn't hold up in Crossout as it should at all.\n\nMy advice to you is to never download this trash heap of a game or even dare glance at it, and let it die as it should have long ago. It's the only merciful thing you can do for what little good remains of its community. Go play something else instead that is more fun and more engaging and 100 times less of a grind fest. This will never be the game for you if you want a good time.\n\nMay this review also condemn those responsible for the many years of harassment and countless others have suffered and payed the price over things that was reasonably addressable under a truly sane community. May this review condemn the staffing that has repeatedly failed to put an end to this waking nightmare we have suffered for so long. and most importantly, condemn Gaijin itself for its unquenchable greed and exploitation of this game, and letting things get as as bad it did without even dare caring for its \"customers\".\n\nIt truly is one of the most ugliest communities I have ever seen, and it is far beyond even deserving of redemption itself. there is nothing good left here to redeem it anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "While the game is fun it is pay to win, new players prepare to have your ass ripped a new one, the progression is too slow for the leveling system unless you pay for crap in the game, just going over 2k points for a car just means you are fucked.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i left once already a few years ago and quit playing, i returned in the hopes i might be able to enjoy it\r\nthis game isnt very free to play friendly and i sure as hell aint spending a dime just to use a better gun or cabin, i also tried to look at the player base, but its seems to be just as or worse than warthunder's playerbase (ive tried both TvT). \r\naircraft was the only thing that brought me back on it a few days and i even tried bedalam for the first time, both werent very good as the aircraft had very little amount of modes to play, and bedalem or whatever was just pure toxic, that and 0 spawn protection.\r\ni personally have given up on this game and im jsut leaving this review cause i hadnt made one the first time i left\r\nhope this help you decide on the install, if youve got alot of money you can freely spend youll enjoy it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a fine game if you ignore the EXTREMELLY pay to win aspects that are everywhere, would recommend playing a little bit but anything too much is just gonna be painfull unless you are willing to rip your wallet apart or spend 100 hours to get a singular weapon and then repeat that to get a set of them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P2W\nMatch making bs 2xxx ps vs 4xxx ps nice job \nand sometimes they just built tiny car with 1xxx+ ps guns to bully new player\njust don't play it, let this game die in peace",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "installed - uninstalled\n\nwhat a fn cashgrab, absolutely disgusting. \ntheir greed sickens me. \n\nWas far better at the begining.. Had over 200hr on xbox and it was just a different game back then.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ">Matchmaking is unfair, going against enemies with high end gear and filled with bots to make up for the players not present.\r\n>you can't craft anything without coughing up currency from the player \"market\" (Yes you need to additional currency to craft items.)\r\n>It has a PVE Mode that you plays out like a mobile game, fuel is your \"energy\" counter for you play Raids which its PVE Only.\r\n\r\nOverall: its a Pay To Win slop. You're better off playing something else that's worth your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an ok game. Not a big fan of MMO's because you always end up against way more powerful players that spend hundreds of dollars to get all the good stuff.. If you want to keep up, you have to spend money on this free game...that's how they get you. Otherwise, the physics are decent, graphics are decent.. 5/10 from me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Controller overlay in the menus and in match are buggy since 2 updates ago...I see nothing but KB&M overlay except when I am pressing on the buttons on my Xbox controller. It's not the controller and it works fine in other titles and game launchers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Their servers are horrible, I play other games just fine but this is just randomly rubberbands. \nIm all for seeing damage but i hate falling apart.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No cross-progression. Not starting over from scratch on this pay-to-win game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game just isn't it if you like a game where you work towards a goal for months sure but if your into something less slow paced in progression play something else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst experience i have had with a gaijin game the beginner loot is good for the first few seconds realising i need to make better guns after grinding for a few hrs i get get leveled up and i need more scrap and copper tubes so i do a bunch more grinding like 10 hrs worth only to realize it costs an in game currency that u ether have to pay for or can sell parts to get and u cant even instantly sell them into the void to the dev its the fucking stock market babbyyyyyyyyyyyyyyyyyyyyyyyyyyy but with every single gun so your telling me i have to wait even longer to just to get a basic upgrade i hate this game i hate playing with bots i hate this agresive microtransaction enviroment i should not have to watch a noob guide to play this game it should be able to teach you and be competent enough not to try to make me spend this obscene amount of time just to get a slight upgrade in a room full of bots i hope this game fails and it gets rightfully shutdown",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fantastic, it shows that gaijin is still trying to make this game have soul, problem tho... it is IMPOSSIBLE to play this game if you live anywhere that is not mainland europe or NORTH america, imagine having to shoot someone with a fucking canon or rocket launcher only for the projectile to fire one forth of a second later... there's so much you can do to compensate for 300 ms with an internet connection of 200 mb per second... will change this whenever i see they open more servers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like endlessly waiting in ques, this game is for you. If not, best to avoid. \r\nI used to like this game but it's pretty much dead, which is a shame given that it's run by Gaijin, same people as warthunder. If you do somehow manage to get into a match, feel free to enjoy such wonderful features such as:\r\n- Incredibly high ping despite being on your regions servers\r\n- Incredibly high packet loss\r\n- A max peak of less than 3000 players online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has ok combat, super grindy and is no where near worth it for having colonel level anti-cheat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "despite what feels like a lack of maps, I absolutely love the gameplay! its so unique and unlike any other game its a shame the pc version feels completely dead and empty. \n\nconsole is lucky enough to crossplay between them so they can find matches much quicker with fewer bots. unlike in the pc version where it takes far too long to load into games just to have 75% of the lobby be bots. I wouldn't mind this as much if the bots were somewhat capable but they are absolutely useless and are no real threat to players. I don't expect them to be super computers, I just want them to at least be able to put up a fight against players. I feel like gaijin are too scared to make them somewhat competent because noobs will find someway to complain about it. \n\nLike previously mentioned, the main issue is the pc version lacking crossplay which makes the game feel completely dead. I get its a small niche game so there's never going to be a huge player base for this game, but crossout would really benefit from having crossplay to fill the servers and decrease loading times. Ive seen people online argue that crossplay would ruin the market, however there is a million ways gaijin could go about keeping the market intact. Worst case scenario I would happily sacrifice the market if it meant my lobbies had more than 5 players in them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constructor and level logic is the piece_of_sh*t. worthless updates.\r\nonly \"Pay to win\" system\r\nstupidity of waiting for craft process\r\na system that demands donations",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Directly pay to win to a frankly ludicrous degree. No matter how much time you spend, being a ftp is basically impossible, and they'll always introduce new more powerful weapons faster than you can make them.\n\nIts a shame too, because the art direction and overall design are really polished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible game if you're on your own. i literally spent a hour making a car, and come to find out im the weakest mofo on my team.... i redo it to make it better, and the entire enemy team has these itty bitty fuckin drill cars.... seems to be either pay to win, or you just dont play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "(Original Review)\nI've waited 15 minutes for a battle. Nothing. Dead Game.\n\n(Edited Review 120hrs in)\nThis game is definitely pay to win. The player base is generally rude, racist, and toxic. I guess its a good time waster. Because that's all you do, waste time. The rewards are low, the lag is high. This is one of those games you either fork over $1,000 to do well, or hate yourself for playing it. I'm currently in the self hatred phase.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst developer that could happen with game. This is not just about pay2win. This is about pay -> loose -> pay again -> loose again\nAlmost every player or honest reaction in youtube will agree",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly managed matchmaking - you get matched against a 4 squad members with no squad in your own team. Items get nerfed once battle pass is over. Premium subsciption is highly expensive and not worth it. This game is left to die, hoping to earn some $$ before it does. Uranium wars happen to be 3v4 because someone get drop and no one is replacing his spot and same goes for this 4 squad vs 4 randoms. Full of russian speakers in EU servers insulting all the time even on private messages. Report system seems not to be working as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game but the existance of autoaim weapons make the gameplay in pvp unplayable.\nits just the team who has the most auto aim weapons wins -_-\ni got some hours in it but im fed up with this meta and im uninstalling this game.\n\nused to be really fun, too bad the auto aim weapons killed it for me.\n\ncan't recommend it anymore  :(\n\nas a tip for the developers, make the energy cost for auto aim weapons ALOT higher so they are not spammable anymore...\nmight help some",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I wanted to be fucked in the ass, I can just call my ex. Crossout is just another example of Gajin's endless and bottomless greed.\n\nAvoid entirely at all costs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pay to win, for them just to nerf the weapon down the line for the next new meta gun to cost a house again",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's just War Thunder but with Mad Max vehicles you build like Legos.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dead game no option to play with bots waited for like 5 minutes still no matches",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Matchmakeing in this Game is  Very Poor even worse in PVE  usally more than 3-4 lvs above your own while building the Cars is fun  you put alot of time and money into it only to get 2or 3 shooted  out and DESTROYED !!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a pay to play sort of game with terrible customer service.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is so shit it doesn't let me build much at all if i am not higher level (DO NOT PLAY ITS NOT WORTH YOUR TIME)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played a number of games but there is no players. this looks like a pve game because i saw no players in about 10 games. im not interested in pve sorry",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't what I expected...\n\nI played for almost 30 hours and most of that time was spent building and waiting for a match, like I want to say of the 30 hours 25 of which was me building, testing, and then waiting to get into a battle, the other 3 was the campaign and the last 2 were me actually in a match.\n\nHOWEVER because of the super low player count I've had to wait upwards to 20 mins to get into a match (even switching which servers I'm on) and when you do get into one, your with the \"high level\" players (people who payed, like this \"free\" game is mostly pay to play), you can still kill the higher level players but it is stall hard.\n\nNow the grind, if you thought War thunder, Enlisted, or even 1000 day Minecraft videos with 100s of different farms was hard, try this and you will/wont be disappointed\n\nThis game has been overall alright but I'm don't and its just taking some space that i would rather free up (I have 2 terabyte free storage so that's how bad this game is)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Always dragged to the RU server, and ping were awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gajin and f2p in the same sentence will make the world a black hole",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game has been crashing within 5 mins every time i play",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}