{
  "positive": [
    {
      "review": "SMITE 1 is amazing and one of my favorite games. they killed their own game by releasing smite 2 and not carrying over skins and champion passes. such as overwatch and splitgate have as well. maybe oneday these companies will learn creating a rushed sequel thats just the same game isnt a solution to a declining player population.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "This game took over my friends life for nearly five years and he still didn't hit Masters.\r\n\r\nHahahaha!\r\n\r\nIt can be pretty fun though. Really enjoyed playing supports like Bacchus and Kumba, and blaming the mid-laner for every loss I ever got.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game used to be good until they stopped updating it. Smite 2 did not do as good as expected and I still prefer smite 1. Put a lot of hours into this game with skins/ voice packs and much more just to lose it all to smite 2. The game is basically dead since it is not renovated anymore. RIP to a good MOBA",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "i only play assault and assault esque game modes of the day. since 2015 its been fun but theyre not really introducing anything new and trying to force us over to smite 2 but i shant be going till more gods happen cause i already get mirror games in s1 in assault somtimes so im sure its atrocious over there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Since like 2015 I've been playing it and genuinely think its sm better than lol. A lot of people make that comparison bc they are basically the same game just different characters, but I love it and believe this community should be as big as lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, i need to play it more. I like it more than League of Legends and Heroes of the storm, i like the thought of playing as different gods and goddess', though i mainly play Aphrodite. If anybody is new or suffers the fear of playing with other people, but want to start, comment to my post. I just wish they'd add Sterquilinus, the roman god of Feces",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I wish they would update their battle pass......I play it a lot with my wife.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1kish hours in the game, very fun. I enjoy the simplicity and team play. And who doesn't like playing as mythical gods? No one, that's who. I wish they did better with Smite 2. Hopefully they never take the servers offline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have thousands of hours of this game on xbox its no longer getting updates but you can still play I will never not love smite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You cannot play this game solo, you just can't. It's very fun with a team but also not, buy if you hate yourself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst game ive ever played I will never understand why this game is played by real people. WHat if league looked somehow worse and were SOOO BORI(NG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра SMITE® — это уникальный взгляд на жанр MOBA, переносящий действие из привычной изометрии в третье лицо. Это решение сразу меняет ощущение от игры, делая сражения более личными и динамичными. Вы чувствуете каждый удар, каждый промах, и необходимость уклоняться от вражеских атак становится куда более острой.\n\nКолоссальный выбор богов из различных мифологий мира — это, пожалуй, одна из главных жемчужин SMITE. От могущественных Зевса и Анубиса до загадочной Сунь Укун — каждый персонаж обладает своим уникальным стилем игры, набором способностей и, конечно же, захватывающими историями. Освоение каждого бога — это отдельное приключение.\n\nSMITE предлагает не только классический режим \"Поля Правосудия\", но и разнообразные карты и режимы, такие как \"Арена\", \"Завоевание\", \"Храм Завоевания\", что позволяет игрокам с разными предпочтениями найти что-то по душе. Интенсивные командные сражения, где стратегическое мышление и слаженная командная работа решают исход битвы, не дают заскучать. Игра постоянно развивается, добавляя новых богов, предметы и события, что поддерживает интерес к ней на долгие годы.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, Yes, Yes... Its like League of Legends in 3D, So cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first moba i ever played and from my time spent playing i recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game .. love the gods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont swipe card but skins=more dmg hel bis mommy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "help hirez stew has a gun to my head",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the first person the way you fight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a Beta Tester, and have moved to Smite 2. I still love the original, and often watch ooold videos on YT (like Drunk & Disorderly) especially by Dry Bear and Mastt!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the only MOBA game I got into and I would say its was nice to try a new style of game and would recommend new players to give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than Smite by a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SMITE 1 is the most peak OG free to play MOBA ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS FUN!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love the game style",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hecka rad yo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a great time carrying the team",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Down the drain goes my income",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NIAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i miss 2015...",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Smite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".................................",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SMITE 1 is amazing and one of my favorite games. they killed their own game by releasing smite 2 and not carrying over skins and champion passes. such as overwatch and splitgate have as well. maybe oneday these companies will learn creating a rushed sequel thats just the same game isnt a solution to a declining player population.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Game is really fun sad to see SMITE 2 isnt going as good as I should be but OG smite will always have a spot on my PC",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of Smite’s greatest strengths is its diverse roster of gods drawn from world mythology. From the familiar Greek and Norse pantheons to the rich traditions of Hindu, Egyptian, Japanese, and Celtic legends, the game offers an impressive variety of characters and playstyles. Whether you prefer the precision of assassins, the power of mages, the resilience of tanks, or the steady damage of hunters, each god feels distinct and thoughtfully crafted. Their abilities not only fit their roles but also reflect their mythological origins, adding an extra layer of depth and excitement for fans of lore and history",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Played the game for 1500 hours on psn. They made Smite 2, this is still way better unfortunately.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game took over my friends life for nearly five years and he still didn't hit Masters.\r\n\r\nHahahaha!\r\n\r\nIt can be pretty fun though. Really enjoyed playing supports like Bacchus and Kumba, and blaming the mid-laner for every loss I ever got.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just wanna say VVGG to all.🫡 VVT Hi-Rez for this wonderful game. VVGB guys and see you on the next one!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game used to be good until they stopped updating it. Smite 2 did not do as good as expected and I still prefer smite 1. Put a lot of hours into this game with skins/ voice packs and much more just to lose it all to smite 2. The game is basically dead since it is not renovated anymore. RIP to a good MOBA",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SMITE is worth a try, and the tutorial is not too long for a quick jump in. The deities (gods & goddesses) we can play start limited, yet it needs no pay2win to get those green gems and unlock the ones we prefer to play. Bots for solo play are as available, as different multiplayer sorts of gaming. PVP or CO-OP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game that's tons of fun to play, and every god is different with different play styles. I prefer Loki, Jormungander, and Baron Sameidi myself (Yes I know I likely spelled those last two wrong)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i only play assault and assault esque game modes of the day. since 2015 its been fun but theyre not really introducing anything new and trying to force us over to smite 2 but i shant be going till more gods happen cause i already get mirror games in s1 in assault somtimes so im sure its atrocious over there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Since like 2015 I've been playing it and genuinely think its sm better than lol. A lot of people make that comparison bc they are basically the same game just different characters, but I love it and believe this community should be as big as lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, i need to play it more. I like it more than League of Legends and Heroes of the storm, i like the thought of playing as different gods and goddess', though i mainly play Aphrodite. If anybody is new or suffers the fear of playing with other people, but want to start, comment to my post. I just wish they'd add Sterquilinus, the roman god of Feces",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I wish they would update their battle pass......I play it a lot with my wife.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1kish hours in the game, very fun. I enjoy the simplicity and team play. And who doesn't like playing as mythical gods? No one, that's who. I wish they did better with Smite 2. Hopefully they never take the servers offline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have thousands of hours of this game on xbox its no longer getting updates but you can still play I will never not love smite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve had a lot of fun playing Smite. The gameplay is great, especially when you’re playing with friends. It’s a blast to team up and take on other players. The gods and abilities are cool, and the matches can get pretty intense.\n\nThat said, sometimes the game feels a little unbalanced. Some gods are way stronger than others, and it can get frustrating. Also, it feels like the company cares more about releasing skins than fixing those balance issues or improving the game. Honestly, we didn’t need a Smite 2—the first one still has a lot of potential.\n\nOverall, it’s a fun game, but it could be better if the focus shifted more to fixing balance and making the core experience better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only about 33 hours in and honestly, I was terrible. A friend suggested I try it, and while I had some fun, I never really got past being bad at it. If I’d stuck around, I definitely would’ve mained KuKulKan, dropping giant tornadoes on people never got old.\n\nIt’s a solid game if MOBAs are your thing, but it wasn’t quite for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game accurately depicted Jesus kicking the prophet Muhammad's ass. Handily. Low diff.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Smite is an exhilarating take on MOBAs. Playing as gods like Thor, Medusa, or Sun Wukong feels epic, and the third-person perspective makes every battle more intense. Whether you’re diving into casual Arena matches or climbing the competitive ladder, the game is fast-paced, strategic, and endlessly fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You cannot play this game solo, you just can't. It's very fun with a team but also not, buy if you hate yourself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst game ive ever played I will never understand why this game is played by real people. WHat if league looked somehow worse and were SOOO BORI(NG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“SMITE: Where gods clash, friendships die, and you realize you’re not as divine as you thought.”\n\nYou start thinking, “Cool, I can play as Zeus!” — ten minutes later, you’re being juggled by a monkey, melted by Ra, and insulted by a twelve-year-old who just called you “trash” before ulting your corpse.\n\nIt’s chaotic, unbalanced, occasionally rage-inducing... and somehow I can’t stop playing. \nThe gameplay slaps harder than Thor’s hammer, and every match feels like a mix of divine glory and emotional trauma. \nThe graphics are solid, the gods are varied, and every new skin tempts your wallet like a siren song from Hades himself.\n\nSure, the matchmaking sometimes feels like it was designed by Loki on a bad day, but when your team actually coordinates? Pure serotonin.\n\n9/10 — Would queue again, cry again, and pretend it was “lag” again. ⚡",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a cool game with good graphics and a great storyline. Thanks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the pace, the set up and different styles of pvp arena's!  love the healing classes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im a dota player so i played this on xbox when i couldnt get to my computer, it s super fun has a cool theme. i still cant play ranked so, take that for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "693 hours so far and I've loved every second of it. Granted 95% of that has been in arena but Why not play what you love? 25 min games, you get in and out and nothing of value is ever lost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра SMITE® — это уникальный взгляд на жанр MOBA, переносящий действие из привычной изометрии в третье лицо. Это решение сразу меняет ощущение от игры, делая сражения более личными и динамичными. Вы чувствуете каждый удар, каждый промах, и необходимость уклоняться от вражеских атак становится куда более острой.\n\nКолоссальный выбор богов из различных мифологий мира — это, пожалуй, одна из главных жемчужин SMITE. От могущественных Зевса и Анубиса до загадочной Сунь Укун — каждый персонаж обладает своим уникальным стилем игры, набором способностей и, конечно же, захватывающими историями. Освоение каждого бога — это отдельное приключение.\n\nSMITE предлагает не только классический режим \"Поля Правосудия\", но и разнообразные карты и режимы, такие как \"Арена\", \"Завоевание\", \"Храм Завоевания\", что позволяет игрокам с разными предпочтениями найти что-то по душе. Интенсивные командные сражения, где стратегическое мышление и слаженная командная работа решают исход битвы, не дают заскучать. Игра постоянно развивается, добавляя новых богов, предметы и события, что поддерживает интерес к ней на долгие годы.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look how they massacred my boy, and for what? A part of my soul died with SMITE, and it can never be replaced by 2. Greed will be the downfall of the studio, as we've already seen. And at this point I wish the gods will punish them for it. Hope Hirez gets 3-2-4 anubis wombo combo and farmed in fountain for the rest of their days. VERVVX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whoever thought smite2 is a good idea is just nah, should just tried expanding to asia and did more ads.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My GOAT; This game was my go-to for so much of my life. Even if I don't play it as much now, and Smite 2 continues to improve every day, Smite 1 will always hold a special place in my heart.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "sometimes its good, sometimes its a bit shiet, ya never know till you know. \r\n\r\nHONEY is a bad girl tho <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, sadly the playerbase is decaying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can say a lot about Hirez, but they do make fun games. Godspeed Smite 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes, Yes, Yes... Its like League of Legends in 3D, So cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know why you released SMITE 2, makes no sense to me. But this game is wholesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is game amazing, Smite 2 builds upon it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprisingly engaging and fun MOBA! While it can be tough for beginners, the unique third-person perspective and wide variety of gods keeps matches fresh. Grinding is real, but the gameplay is rewarding, especially with friends. Definitely worth trying if you're looking for something a bit different.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "3rd Person Multi-cultural Pantheon-based MOBA with crossplay with console friends that maintains an active player count. Idk about all that noise about the second one, but I played 7 years ago and it was fun. Hard though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "over 2k hours on xbox, pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most amazing trash dog shit game youll ever play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first moba i ever played and from my time spent playing i recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way better than smite 2. Felt like there just wasn’t crazy amount of sweats.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it helps if you are toxic\nps. why so much toxicity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game knocks my nut hair back. Simple as",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better that LoL more casual more fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game .. love the gods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this time to time when I'm bored, But it's fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes highly recommand this game its amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont swipe card but skins=more dmg hel bis mommy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "always and forever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "greatest ish game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shut down Smite 2. Stay here lmao",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game i really love it labu you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "help hirez stew has a gun to my head",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Actually a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "trash game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is going to be a long one, but as a long-time player of Smite over a couple different platforms, I cannot in good faith continue to play or recommend Smite or the company it belongs to.\n\nSmite 1 was one of the best MOBA games of it's time. If you didn't like top-down camera perspective games like League of Legends but still wanted an expansive array of characters, play-styles and items to fit any niche your team needs, Smite had you covered. The skin economy in the game was definitely a struggle as the game boasts many, may Gods to play as and each have a handful of skins accompanying them. Some of these skins are cheap recolors which is totally fine to include, however some of the 'rarer' skins could cost you so much of the premium currency you could not obtain them without paying. Sure, skins are not a necessity of the gameplay and are purely cosmetic, but it's still something that should be pointed out.\n\nGameplay-wise, the game did have flaws. New characters were undeniably buffed to increase attention on newly released content. Nerfs were given to characters who did not deserve them and making them difficult to play. There was heavy favoritism from devs towards certain Gods in both game-play and attention. It's fine for characters like Neith or Zeus, because they are more-or-less the faces of the game, both being Gods that were part of the game since beta. But after a God was introduced, played by the community for a week and nerfed after the initial hype, you would likely never see a skin, official mention or people play that character for months, years and sometimes never.\n\nNow, I will admit that I do have a skill issue with the game and cannot handle pvp matches well, so I tend to gravitate towards bot matches. Despite this, I have played many pvp matches and... I did not enjoy my stay in them... Toxic players, reported for \"cheating\" if you just.. do well in the game? Reported for \"feeding\" if you just aren't doing too well in a match and end up dying a couple times. I only really enjoyed my pvp match experience with friends and the rare lobby with teammates who either didn't talk or were cool. Smite has a massive botting issue now, they do not care about Smite 1 anymore and it shows. It was obvious from the moment updates started to stall and then, Smite 2 was announced and I could feel the downfall coming from a mile away.\n\nSmite 2 is a CLUSTERF*** of awful optimization, company choices and gameplay flops. Trust me, it is NOT worth it to play the second game. I have probably paid upwards of $200 on Smite 1 over my years and years of playing (I know, I know, I need to touch grass..). Anyways, Smite 2 assured people that our skins and premium currency in Smite 1 would be rewarded. And rewarded we were! With an amount of cross-game skins you can count on one hand that look awful and porting our premium currency into a fraction of common currency- Thanks.. I feel so rewarded right now.. I could only buy 1 new skin with the currency I was awarded from that.\n\nNow, I do want to keep my review of Smite 1 unbiased and fair, but with all of the things that have happened to this game and the choices of the company, I can't help but feel jaded, angry and saddened that the game I played with my friends, the game I spent money on, the game I played for hours and the game I loved and said was my favorite game for YEARS, has become a massive pile of rubbish and shattered hope. I really did want to continue playing Smite for years more, but I haven't played in over a year now and I don't miss the Smite I left behind. I will forever mourn the Smite that I loved and grew up with.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Terrible scaling, terrible player community. If you enjoy having people on your team who quit or go afk after dying 2 times then this is the game for you. If you aren't playing 4v5 because someone on your side quit then prepare for a 4v6 since they will feed on purpose. No need to worry about the consequences for such behavior either, Smite made sure that in all the years it has existed there is none! Also the most toxic player base in all of gaming history. If you die you can guarantee at least 1 person on your side to spam click you and tell you\"you rock\". This game had a lot of potential but the devs ignored all the real problems, and put all their time into creating skins. Eventually they just said decided to throw this game away and make Smite 2 where the biggest change was better graphics. Everything about this game has been a joke and I pray that nobody has to deal with the awful game known as Smite.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible game, incompetent programmers, crooked company stay away",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If Hi-Rez turned had a PvE game mode available, I think it would do wonders for the people still playing. Otherwise, this is a rough game to play with anyone, let alone with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable. Queue times are often 20+ minutes, and getting any help from support is incredibly frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dumb game that breaks most of the time, thank god i get penalized for your game not working, i see why this game is free lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game to have to learn. Even when you learn it, not rewarding at all. You realize people only play the same 16 over powered characters. If you enjoy repeat non sense and feeling like you're wasting your time, this is your game. Also the creators are super over the top LGBTQ+ activists so yeah have fun with that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game's dead, 5 minutes queued and cant get into a match anymore :[",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not fun for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was pretty pog back in the day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cierren esta mierda ya!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst 1000 hours of my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stuck in que, is anyone even playing this?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Imagine dividing the entire playerbase.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "used to be good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "smite 1 is kill",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't even alt+F4",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ni estaba tan chido",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greedy greedy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't get",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "smite trash",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game was good still playable but they killed its future for a cash grab in smite2.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "Ruined the game by making Smite 2. Management doesn't care about smite 1 anymore, game is plagued with speed hackers and a toxic player base. Regardless whether you report them or even your entire team of 5 reports them the degenerate team at Hi-Rez is either under payed, laid off, has some kind of brain damage or them, themselves are the very ones exploiting the game. One of these has to be the reason the ban hammer never comes, with this being said i would not recommend this game to anyone even after having almost 1300 hours played on just this one account. Hi-Rez has went down the toilet with their companies direction and for the sake of STEAM and the players I hope it stays there.\n\nDead game, Garbage company.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "I used to play this game a lot about five years ago – nearly 500 hours back then. I really enjoyed it, even bought some skins and had a lot of good memories with it. The gameplay was solid, the concept unique, and at that time I never regretted spending so much time or money in it.\n\nSo after all these years I thought: why not give it another try? I’d seen a lot of reviews saying the community had gone downhill, but I wanted to check for myself.\n\nWell… it didn’t take long to find out. In my very first match, people were already flaming each other during god selection. No teamwork, no fun, just insults flying around before the game even started. And once the match began, it only got worse – within five minutes people were already trash talking and throwing insults around.\n\nI finished the game, but honestly that was it for me. One match was enough to realize this isn’t the same game I used to enjoy. Maybe I just had bad luck with teammates, but when your very first experience after years away is already that toxic, you know what to expect.\n\nThe sad thing is: the game itself is still good. The concept works, the mechanics are fun – all the ingredients for a great time are there. But the community? Completely toxic. It feels a lot like League of Legends in that way: a good game ruined by the people playing it.\n\nIf you’re looking for something to relax with after work, forget it. The atmosphere is just too negative to be enjoyable. And that’s a shame, because I really wanted to like this game again.\n\nTL;DR Final thoughts: great game, ruined by its community. For me, this one match after five years was both a disappointing return and my final goodbye.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Smite 1 > Smite 2\n\nSmite 2  might have more fancy graphics but nothing more.. so sad the game studio tried to kill their very own child for the next one :(",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Good game but bad CEO,  the game is not receiving updates, and is slowly dying. RIP smite",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This is going to be a long one, but as a long-time player of Smite over a couple different platforms, I cannot in good faith continue to play or recommend Smite or the company it belongs to.\n\nSmite 1 was one of the best MOBA games of it's time. If you didn't like top-down camera perspective games like League of Legends but still wanted an expansive array of characters, play-styles and items to fit any niche your team needs, Smite had you covered. The skin economy in the game was definitely a struggle as the game boasts many, may Gods to play as and each have a handful of skins accompanying them. Some of these skins are cheap recolors which is totally fine to include, however some of the 'rarer' skins could cost you so much of the premium currency you could not obtain them without paying. Sure, skins are not a necessity of the gameplay and are purely cosmetic, but it's still something that should be pointed out.\n\nGameplay-wise, the game did have flaws. New characters were undeniably buffed to increase attention on newly released content. Nerfs were given to characters who did not deserve them and making them difficult to play. There was heavy favoritism from devs towards certain Gods in both game-play and attention. It's fine for characters like Neith or Zeus, because they are more-or-less the faces of the game, both being Gods that were part of the game since beta. But after a God was introduced, played by the community for a week and nerfed after the initial hype, you would likely never see a skin, official mention or people play that character for months, years and sometimes never.\n\nNow, I will admit that I do have a skill issue with the game and cannot handle pvp matches well, so I tend to gravitate towards bot matches. Despite this, I have played many pvp matches and... I did not enjoy my stay in them... Toxic players, reported for \"cheating\" if you just.. do well in the game? Reported for \"feeding\" if you just aren't doing too well in a match and end up dying a couple times. I only really enjoyed my pvp match experience with friends and the rare lobby with teammates who either didn't talk or were cool. Smite has a massive botting issue now, they do not care about Smite 1 anymore and it shows. It was obvious from the moment updates started to stall and then, Smite 2 was announced and I could feel the downfall coming from a mile away.\n\nSmite 2 is a CLUSTERF*** of awful optimization, company choices and gameplay flops. Trust me, it is NOT worth it to play the second game. I have probably paid upwards of $200 on Smite 1 over my years and years of playing (I know, I know, I need to touch grass..). Anyways, Smite 2 assured people that our skins and premium currency in Smite 1 would be rewarded. And rewarded we were! With an amount of cross-game skins you can count on one hand that look awful and porting our premium currency into a fraction of common currency- Thanks.. I feel so rewarded right now.. I could only buy 1 new skin with the currency I was awarded from that.\n\nNow, I do want to keep my review of Smite 1 unbiased and fair, but with all of the things that have happened to this game and the choices of the company, I can't help but feel jaded, angry and saddened that the game I played with my friends, the game I spent money on, the game I played for hours and the game I loved and said was my favorite game for YEARS, has become a massive pile of rubbish and shattered hope. I really did want to continue playing Smite for years more, but I haven't played in over a year now and I don't miss the Smite I left behind. I will forever mourn the Smite that I loved and grew up with.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I wouldn't recommend playing this anymore, speed hackers are running around and still on after days. They don't get banned now. Hi Rez doesn't care about their player base. I guess you could go play Smite 2 but I wouldn't bother with that either considering their record on games.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "a game that used to be fun was destroyed by a greedy company and a toxic player base",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Completely forgotten about since their reskin for Smite 2. The devs don't care about this game and it's remaining toxic community cares even less. It's an un-moderated hellhole with zero structure, no dev love and even less love from it's remaining players. \n\nSo sad to see as I've been a long time player of Smite and not that it hasn't always had toxicity, it's now unruled and unforgiven and people are free to say whatever and call you whatever with zero repercussions. Have at it. I'll take my money elsewhere.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Terrible scaling, terrible player community. If you enjoy having people on your team who quit or go afk after dying 2 times then this is the game for you. If you aren't playing 4v5 because someone on your side quit then prepare for a 4v6 since they will feed on purpose. No need to worry about the consequences for such behavior either, Smite made sure that in all the years it has existed there is none! Also the most toxic player base in all of gaming history. If you die you can guarantee at least 1 person on your side to spam click you and tell you\"you rock\". This game had a lot of potential but the devs ignored all the real problems, and put all their time into creating skins. Eventually they just said decided to throw this game away and make Smite 2 where the biggest change was better graphics. Everything about this game has been a joke and I pray that nobody has to deal with the awful game known as Smite.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "terrible game, incompetent programmers, crooked company stay away",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's no lies here. Players really are toxic and unwelcoming of new players. Such a waste.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So in 2023 after almost 1000 hours in 7 years of playing Smite with many breaks in between and returning from time to time to see how things have changed I finally quit for good. I had amazing times with this game and I had times where I felt like I was wasting huge amounts of time with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If Hi-Rez turned had a PvE game mode available, I think it would do wonders for the people still playing. Otherwise, this is a rough game to play with anyone, let alone with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable. Queue times are often 20+ minutes, and getting any help from support is incredibly frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dumb game that breaks most of the time, thank god i get penalized for your game not working, i see why this game is free lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi-Rez takes the servers down for \"maintenance\" every 1,5h for about 3h. Strangely enough, after their maintenance, there are usually more bugs than before. My favorites include: Not being able to queue, not being able to join the game (loading-screen forever), being stuck in a Lobby after the game ended (with 6 other ppl) and not allowing me to reroll or trade in Assault, just to name a few. Furthermore, there are a bunch of Speedhackers by now because nobody is banning them anymore. \nThe rest of the community is a mixed basket. About 1/3 of them are awesome people who teach and support you when you have a bad game. Another 1/3 just doesn't communicate at all, ever. The last 1/3 is taken straight out of a LoL. Most of them suck at the game and then start insulting teammates who are either new to the game or just don't do anything to defend themselves. In the end, they usually go afk while still flaming you, which leads to a lost match and lots of frustration. Especially if you queue with the same guy the next day because a whole Lobby reporting him for insults and toxicity is apparently not enough to get any reaction from the devs/mods.\n\nTl;dr: Servers are constantly down, community has become more toxic, more hackers. Hi-Rez is trying to smother Smite so that people play Smite 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to enjoy playing this game, but as a person who prefers playing a support position, this game has progressively gotten frustrating that I had to quit. Not because of bad games, or bad teammates, but because the identity of 'Support' has been streamlined to 'Tank' with no means of pressuring the enemy. Everything else has been nerfed or reworked against Guardian's and off-Warrior support that it was relegating 4 of your 6 items, and the remaining two had to be more defense items or else your team is disparaged because it isn't 'meta'.\n\nA big problem that comes with this fixation is that assassins built enough Armor Penetration, your defenses lose most of their value. Most items that could have made Guardian's functional to apply pressure or peal potential got nerfed or outright restricted.\n\nI can't recommend this game or its sequel when the developers don't have a clear vision of the most underserved and generally important position, but maybe when the next Assassin or Mage drops they'll figure out how to make support fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"It's not a waste of time if you enjoy it\" \n\nWell, unfortunately, it's slowly become a clear, definitive, waste of time. \n\nOther reviews have pointed out: \n- Abandoned game \n- Smite 2 is awful \n- They want money \n- Toxic \n- No support and no new content \n\nThe last two points are the worst - people will genuinely hate you, sabotage the game, and give up in almost every game. It doesn't matter if you're winning by 6k gold, if the enemy has a DC, hell - if the game is dead even and it's a fun one, your teammates will find a way to complain. \n\nThe toxicity part is the worst because, before, if someone hurled slurs at someone, then they'd be reported - and the next day or so, it would say \"an action has been taken against a player you reported.\" That's great!\n\nThat never happens anymore. \n\nPeople are saying, and behaving, way worse, as more quit and I haven't gotten one of those messages in a long time. The lack of support in an already toxic fan base is killer. Play something else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played a little smite when it was in beta and quit when they ruined jungling.\n\nWhy am I being shown a EULA for AMD CPU drivers? Why would SMITE need this? I rejected it and it launched anyway \n\nAnyway, Hi-Rez were too late to the party here. Hero Shooters got popular right after this and ate SMITE's lunch. Then they made a hero shooter a little too late to that party, too. Then they made a battle royale a little late to that party... what CAN'T they get wrong?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible game to have to learn. Even when you learn it, not rewarding at all. You realize people only play the same 16 over powered characters. If you enjoy repeat non sense and feeling like you're wasting your time, this is your game. Also the creators are super over the top LGBTQ+ activists so yeah have fun with that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "- toxic playerbase\r\n- extremely old game & engine\r\n- BUY SKINS!!!1!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game's dead, 5 minutes queued and cant get into a match anymore :[",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks, played 5k+ hours before steam. it sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a dead game, its fun, but basically only sweats are still playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RIP Hirez VER VXX. Should've made this game in UE5 instead of what you actually made.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the most trash game i have ever played in my life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "physically unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DirectX9 in 2025. Wild. \n\nStay thirsty, friendo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "negative review because too violent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hero game some guy got me to play. 0/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not fun for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi-rez killed smite for a UE5 slop clone",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "was pretty pog back in the day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No longer being updated. Don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cierren esta mierda ya!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst 1000 hours of my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stuck in que, is anyone even playing this?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Imagine dividing the entire playerbase.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "used to be good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "smite 1 is kill",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can't even alt+F4",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ni estaba tan chido",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greedy greedy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't get",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "smite trash",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ruined the game by making Smite 2. Management doesn't care about smite 1 anymore, game is plagued with speed hackers and a toxic player base. Regardless whether you report them or even your entire team of 5 reports them the degenerate team at Hi-Rez is either under payed, laid off, has some kind of brain damage or them, themselves are the very ones exploiting the game. One of these has to be the reason the ban hammer never comes, with this being said i would not recommend this game to anyone even after having almost 1300 hours played on just this one account. Hi-Rez has went down the toilet with their companies direction and for the sake of STEAM and the players I hope it stays there.\n\nDead game, Garbage company.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "I used to play this game a lot about five years ago – nearly 500 hours back then. I really enjoyed it, even bought some skins and had a lot of good memories with it. The gameplay was solid, the concept unique, and at that time I never regretted spending so much time or money in it.\n\nSo after all these years I thought: why not give it another try? I’d seen a lot of reviews saying the community had gone downhill, but I wanted to check for myself.\n\nWell… it didn’t take long to find out. In my very first match, people were already flaming each other during god selection. No teamwork, no fun, just insults flying around before the game even started. And once the match began, it only got worse – within five minutes people were already trash talking and throwing insults around.\n\nI finished the game, but honestly that was it for me. One match was enough to realize this isn’t the same game I used to enjoy. Maybe I just had bad luck with teammates, but when your very first experience after years away is already that toxic, you know what to expect.\n\nThe sad thing is: the game itself is still good. The concept works, the mechanics are fun – all the ingredients for a great time are there. But the community? Completely toxic. It feels a lot like League of Legends in that way: a good game ruined by the people playing it.\n\nIf you’re looking for something to relax with after work, forget it. The atmosphere is just too negative to be enjoyable. And that’s a shame, because I really wanted to like this game again.\n\nTL;DR Final thoughts: great game, ruined by its community. For me, this one match after five years was both a disappointing return and my final goodbye.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Smite 1 > Smite 2\n\nSmite 2  might have more fancy graphics but nothing more.. so sad the game studio tried to kill their very own child for the next one :(",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "This is going to be a long one, but as a long-time player of Smite over a couple different platforms, I cannot in good faith continue to play or recommend Smite or the company it belongs to.\n\nSmite 1 was one of the best MOBA games of it's time. If you didn't like top-down camera perspective games like League of Legends but still wanted an expansive array of characters, play-styles and items to fit any niche your team needs, Smite had you covered. The skin economy in the game was definitely a struggle as the game boasts many, may Gods to play as and each have a handful of skins accompanying them. Some of these skins are cheap recolors which is totally fine to include, however some of the 'rarer' skins could cost you so much of the premium currency you could not obtain them without paying. Sure, skins are not a necessity of the gameplay and are purely cosmetic, but it's still something that should be pointed out.\n\nGameplay-wise, the game did have flaws. New characters were undeniably buffed to increase attention on newly released content. Nerfs were given to characters who did not deserve them and making them difficult to play. There was heavy favoritism from devs towards certain Gods in both game-play and attention. It's fine for characters like Neith or Zeus, because they are more-or-less the faces of the game, both being Gods that were part of the game since beta. But after a God was introduced, played by the community for a week and nerfed after the initial hype, you would likely never see a skin, official mention or people play that character for months, years and sometimes never.\n\nNow, I will admit that I do have a skill issue with the game and cannot handle pvp matches well, so I tend to gravitate towards bot matches. Despite this, I have played many pvp matches and... I did not enjoy my stay in them... Toxic players, reported for \"cheating\" if you just.. do well in the game? Reported for \"feeding\" if you just aren't doing too well in a match and end up dying a couple times. I only really enjoyed my pvp match experience with friends and the rare lobby with teammates who either didn't talk or were cool. Smite has a massive botting issue now, they do not care about Smite 1 anymore and it shows. It was obvious from the moment updates started to stall and then, Smite 2 was announced and I could feel the downfall coming from a mile away.\n\nSmite 2 is a CLUSTERF*** of awful optimization, company choices and gameplay flops. Trust me, it is NOT worth it to play the second game. I have probably paid upwards of $200 on Smite 1 over my years and years of playing (I know, I know, I need to touch grass..). Anyways, Smite 2 assured people that our skins and premium currency in Smite 1 would be rewarded. And rewarded we were! With an amount of cross-game skins you can count on one hand that look awful and porting our premium currency into a fraction of common currency- Thanks.. I feel so rewarded right now.. I could only buy 1 new skin with the currency I was awarded from that.\n\nNow, I do want to keep my review of Smite 1 unbiased and fair, but with all of the things that have happened to this game and the choices of the company, I can't help but feel jaded, angry and saddened that the game I played with my friends, the game I spent money on, the game I played for hours and the game I loved and said was my favorite game for YEARS, has become a massive pile of rubbish and shattered hope. I really did want to continue playing Smite for years more, but I haven't played in over a year now and I don't miss the Smite I left behind. I will forever mourn the Smite that I loved and grew up with.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I wouldn't recommend playing this anymore, speed hackers are running around and still on after days. They don't get banned now. Hi Rez doesn't care about their player base. I guess you could go play Smite 2 but I wouldn't bother with that either considering their record on games.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "a game that used to be fun was destroyed by a greedy company and a toxic player base",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Completely forgotten about since their reskin for Smite 2. The devs don't care about this game and it's remaining toxic community cares even less. It's an un-moderated hellhole with zero structure, no dev love and even less love from it's remaining players. \n\nSo sad to see as I've been a long time player of Smite and not that it hasn't always had toxicity, it's now unruled and unforgiven and people are free to say whatever and call you whatever with zero repercussions. Have at it. I'll take my money elsewhere.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Terrible scaling, terrible player community. If you enjoy having people on your team who quit or go afk after dying 2 times then this is the game for you. If you aren't playing 4v5 because someone on your side quit then prepare for a 4v6 since they will feed on purpose. No need to worry about the consequences for such behavior either, Smite made sure that in all the years it has existed there is none! Also the most toxic player base in all of gaming history. If you die you can guarantee at least 1 person on your side to spam click you and tell you\"you rock\". This game had a lot of potential but the devs ignored all the real problems, and put all their time into creating skins. Eventually they just said decided to throw this game away and make Smite 2 where the biggest change was better graphics. Everything about this game has been a joke and I pray that nobody has to deal with the awful game known as Smite.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This has been abandoned for Smite 2, a subjectively worse sequel. Cheating is now everywhere and not policed. No new updates occur anymore. Used to be a great game. It's sad to see it go this way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible game, incompetent programmers, crooked company stay away",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's no lies here. Players really are toxic and unwelcoming of new players. Such a waste.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "server mentenance without warning, lag sometimes and lack of players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game fails on so many levels over the decade that ive played it for. I still continue to play the game despite its flaws yet one stands out the most. Account Merge Process! Theres no clear answers or support with this issue and when i try to do anything involving fixes this it gives me errors. I cant play smite 1 or 2 on PC without losing all the money ive given this company over the years. I wont be playing smite 2 anytime soon ill play 1  until you greedy POS's remove that from me as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If Hi-Rez turned had a PvE game mode available, I think it would do wonders for the people still playing. Otherwise, this is a rough game to play with anyone, let alone with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable. Queue times are often 20+ minutes, and getting any help from support is incredibly frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dumb game that breaks most of the time, thank god i get penalized for your game not working, i see why this game is free lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi-Rez takes the servers down for \"maintenance\" every 1,5h for about 3h. Strangely enough, after their maintenance, there are usually more bugs than before. My favorites include: Not being able to queue, not being able to join the game (loading-screen forever), being stuck in a Lobby after the game ended (with 6 other ppl) and not allowing me to reroll or trade in Assault, just to name a few. Furthermore, there are a bunch of Speedhackers by now because nobody is banning them anymore. \nThe rest of the community is a mixed basket. About 1/3 of them are awesome people who teach and support you when you have a bad game. Another 1/3 just doesn't communicate at all, ever. The last 1/3 is taken straight out of a LoL. Most of them suck at the game and then start insulting teammates who are either new to the game or just don't do anything to defend themselves. In the end, they usually go afk while still flaming you, which leads to a lost match and lots of frustration. Especially if you queue with the same guy the next day because a whole Lobby reporting him for insults and toxicity is apparently not enough to get any reaction from the devs/mods.\n\nTl;dr: Servers are constantly down, community has become more toxic, more hackers. Hi-Rez is trying to smother Smite so that people play Smite 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to enjoy playing this game, but as a person who prefers playing a support position, this game has progressively gotten frustrating that I had to quit. Not because of bad games, or bad teammates, but because the identity of 'Support' has been streamlined to 'Tank' with no means of pressuring the enemy. Everything else has been nerfed or reworked against Guardian's and off-Warrior support that it was relegating 4 of your 6 items, and the remaining two had to be more defense items or else your team is disparaged because it isn't 'meta'.\n\nA big problem that comes with this fixation is that assassins built enough Armor Penetration, your defenses lose most of their value. Most items that could have made Guardian's functional to apply pressure or peal potential got nerfed or outright restricted.\n\nI can't recommend this game or its sequel when the developers don't have a clear vision of the most underserved and generally important position, but maybe when the next Assassin or Mage drops they'll figure out how to make support fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"It's not a waste of time if you enjoy it\" \n\nWell, unfortunately, it's slowly become a clear, definitive, waste of time. \n\nOther reviews have pointed out: \n- Abandoned game \n- Smite 2 is awful \n- They want money \n- Toxic \n- No support and no new content \n\nThe last two points are the worst - people will genuinely hate you, sabotage the game, and give up in almost every game. It doesn't matter if you're winning by 6k gold, if the enemy has a DC, hell - if the game is dead even and it's a fun one, your teammates will find a way to complain. \n\nThe toxicity part is the worst because, before, if someone hurled slurs at someone, then they'd be reported - and the next day or so, it would say \"an action has been taken against a player you reported.\" That's great!\n\nThat never happens anymore. \n\nPeople are saying, and behaving, way worse, as more quit and I haven't gotten one of those messages in a long time. The lack of support in an already toxic fan base is killer. Play something else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played a little smite when it was in beta and quit when they ruined jungling.\n\nWhy am I being shown a EULA for AMD CPU drivers? Why would SMITE need this? I rejected it and it launched anyway \n\nAnyway, Hi-Rez were too late to the party here. Hero Shooters got popular right after this and ate SMITE's lunch. Then they made a hero shooter a little too late to that party, too. Then they made a battle royale a little late to that party... what CAN'T they get wrong?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's alright.   \n \n \n  \nOk. Straight facts: \nGame is dead(only servers are still running). Game can be very fun or very painful(Like all MOBA's it depends on people you play with).  \nImportant note: Before they killed the game, unbalanced stuff still remained... Some know this and exploit it, some ignore..On this fact, it depends if game will be fun. :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game to have to learn. Even when you learn it, not rewarding at all. You realize people only play the same 16 over powered characters. If you enjoy repeat non sense and feeling like you're wasting your time, this is your game. Also the creators are super over the top LGBTQ+ activists so yeah have fun with that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game's dead, 5 minutes queued and cant get into a match anymore :[",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks, played 5k+ hours before steam. it sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a dead game, its fun, but basically only sweats are still playing it.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}