{
  "positive": [
    {
      "review": "I own the game, my friend gets the demo, we try playing together, he invites me, I get steam message to download trial. Okie dokie, no problem, I install that, and launch it, getting ready to play together. Demo version gives me a message, that I can't access the demo version, because I already have the full game. So I go back, thinking it would work now, maybe having the demo installed helps. It didn't, the full game kept putting me in the demo version, and the demo version kept sending me back to the full version. Why do you keep making decisions to shoot yourself in the foot, Saber? What is the reasoning behind this?\n\nEDIT: Devs posted a post talking about it, don't use the Steam platform to join each other, but the code-based connection given in the game. Which, in hindsight, should have been talked about in a blog post at least. But I guess it works, and so I can recommend",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "fucking dope. idk why people would leave negative reviews for a free demo that has more content than some fully released games. Sure its not perfect. But is free and convinced me to buy the full game.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "There’s a lot of content for a demo, i'm really impressed with everything.\nThe game feels great to play, the audio design is solid, and the visuals are stunning.\nI was waiting for a sale since launch just to be sure, but this demo completely sold me.\nI had a blast playing it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The first five minutes pulled me into a world I haven’t felt in years.\nThe game captures something a lot of us have been missing — that feeling of being a walking tank, a human war machine tearing through enemies.\n\nThe brutality and the sheer weight of every hit are incredible. The combat feels heavy and satisfying, and the sound design adds so much to the atmosphere. It honestly felt like I was in a war movie, not a game.\nI enjoyed it so much that I actually stopped playing just to wait for a friend, because there’s no way I’m finishing something like this alone.\n\nThe only downside so far is the FPS drops. You really need to adjust your settings before jumping in. I spent about 30 minutes testing different options until I found what works best for my setup.\nNo crashes yet, and even if one happens, it’s understandable — it’s still a demo and clearly being worked on.\n\nIf this demo is any indication of what’s coming, then the full release might be something special.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I really enjoyed this game! The combat was satisfyingly smooth. Felt like a Gears of War with an upgraded melee combat. Keeping on Wishlist until the price lowers but only because of finances. If I were better off I would have bought it in a heartbeat.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This demo is huge. It felt like it would never end, but that's a good thing. Combat, sound, and graphics were amazing. I've never really took the time to delve into Warhammer lore, but its beginning to seem interesting. Soon as I can clear some of my backlog im going to give this series a try.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Damn, this game is bad-ass. I downloaded the Demo just to see if the game ran on my \"old\" gaming laptop and I must say that I was very surprised that it ran and how good it ran. My Laptop is a Victus with an RTX 2050 4GB, 16Gb ram and an AMD Ryzen 5 7535HS and I was expecting to run like trash like it ran FF XVI, but man, it does run pretty good. I was running it at around 60 to 45 FPS (Mostly when the screen is filled with Tyranids) on Medium with low textures, Performace DLSS and at 1080p resolution.\n\nSo, if you have a laptop like mine and don't expect 4k, ultra at 60fps (Let's be honest, its a budget laptop, its kinda dumb to expect that) you can still have a pretty good experience\n\nWill look into getting the full version in the future.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great demo - the missions are long and the demo provides a lot of content.  At one point i thought i had the full version\n\nThe game is intense - be prepared to dedicate 30mins to 1 hour per mission.  \n\nThe graphics and sounds are brilliant - but it can feel quite overwhelming if playing for extended times\n\nIts brutal but great fun.\n\nNot sure why i overlooked this one on release",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Sad to hear other people have had the performance issues. So far this has been running smooth as butter for me. Definitely gonna be picking this up sooner or later!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Very generous demo. Great opportunity to see if you like the game play and if your machine can handle it. If your PC is strong enough, this game is a marvel with the amount of stuff on screen and the quality of graphics. Saw some comments about bugs - I haven't found anything significant, maybe because my drivers are up to date.\nThe only bugs are the Tyranids ;p",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It looks incredible. You feel like a badass while playing. They mourn the loss of comrades...\n\nI want to pick this up now!\n\nI played with Keyboard and Mouse and the buttons were pretty good, but I can see this being better with a controller like a lot of 3rd Person action games and the gore is less intense than a game like Doom. It's good. The multplayer is what I am interested in, so I will try that later",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Im positively surprised by the demo - Audio/visuals coupled with very detailed, \"meaty\" animations are jaw dropping! Quite big amount of content for free, You can check a lot of what game has to offer. Most notably they didnt restrict access to weapons or classes, which is huge + for me. Co-op is working without any issues. Performance definitely could be improved, thats my only one complain. I was on the fence for many months, but i enjoyed the demo soo much im definitely gonna buy it sooner or later.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been wanting this game for a long time only being able to play roblox knockoffs and this.game is absolutely amazing I love the fact that evry terinid is a blood bag that can be squished cheese approved 10/10 FOR THE EMPEROR",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Just played the demo.Works fine,no crashses or enything,Gameplay is ok and graphics are beautiful.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Tested on weaker specs than specified as minimum specifications - it still runs and is playable but expect long loading times in between missions and transitions from one stage to the next; Minor visual tearing on some cinematics but during gameplay did not notice any graphical issues as game likely lowered graphics and adjusted frame rate to what the specifications can handle so game I believe is fairly optimized given my potato PC still able to run it even if we are below minimum specifications\n\nGameplay loop is hoard shooter. If you love those then this is a good game for you. If not then this genre is not for you.\n\nAtmosphere is amazing. Even without knowledge of 40k lore the scenery and dialog are great. With passing knowledge of 40k it feels better knowing you understand the subtle references of the mechanicus talking or when there is mention Cadian troops or Primaris marines.\n\nAs this is only demo I expect not to see the full story. But from what I hear it is a short story main story but a well executed one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Demo is amazing. Used to have the full game but didn't run well. Thankfully, the demo came out and I've figured out how to better optimise it (lower resolution, it still looks amazing and you won't even notice);. People complain it's unoptimised... maybe, but the full game is the same? I wouldn't complain, it's a complete game in itself. It doesn't get passed the start menu for some BECAUSE of the graphics needing adjustment. Overall, amazing game, ignore the people who are never pleased and have fun! Amazing game, amazing TTG, good devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a big fan of third-person games but this is epic! The dark future environment and the feeling of being overwhelmed by the sheer amount of enemies are fantastic.\n\nWishlisted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs well, plays well, it's extremely gory. Only thing I dislike is that there's NO separate offline and online progression for PVE, despite the game already having those modes separated and bot support, the game still insists in resetting your offline PVE progress if you connect online.\n\nWhy not give us separate progression for online and offline? That way you secure that game's mode preservation, the preservation of the entirety of your game, and the joy of all game modes for anyone who wants to play your game?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend who actually owns the game is unable to play the demo (which is already absurd) because he owns the game, and people who own the game are unable to access the demo, meaning that me and my friend cannot play together, IN A CO-OP GAME, thanks\n\n\nUpdate: so apparently the way we could play together is by using the in game code system, and we just assumed that we couldn't play together due to the fact that inviting eachother through steam didn't work, you know, the most common way to invite/join your friend's game, I really think that something like this should've either been fixed or at the very least pasted all over the fucking game's discord and forums so that people would know\n\nFun game tho, demo works as intended now, but wouldn't it have just been easier to make it free for the weekend like any other game ever and save yourself the trouble of making a demo version? Game dev decision making continues to leave me speechless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't experience any issues regarding frame rate or crashes but its a free demo so who cares lol.\nThe demo itself is quite generous with 2 story missions and 3 operations and access to all 6 classes.\nThe combat is very weird to get used to for someone like me who has played way too much Vermintide and Darktide but its not awful or broken yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing that they made a Demo to test all aspects of the game while the game is on a large sale. \n\nDon't listen to the bad reviews regarding performance. The Demo runs great and those people are probably just brain dead fools with potato machines.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "==\nSP 1 comparison.\nJust going to put this at the top now, as I went and looked at SP1 gameplay again. SP1 feels way better, the guns sound better, it's actually like you're shooting something, the combat - I remember when they first showed sneak peak demos of him caving through enemies all in sync and the slow motion on each one, blew people away, it's fucking great, it's much more Batman Arkham style. You feel like you are making choices and directions on purpose.\n\nSP2 is more like dark tide I think or others of that kind. Which to me isn't great. Maybe it's the nature of fighting tyrranids and not orks but the hoard swarm isnt the same as those Gretchen swarms. It all needs a bit more weight, more slow mo on hits, more crushin. I don't know if they will change that now.\n\nI can't say from the limited gameplay I've seen in person but the lots of videos online. It all looks good, but it feels different. I wish they'd go back to the older combat style. And make guns actually do something. i.e. https://youtu.be/2zNRtOhFq9Y?t=616 (10:16)\n\nI'm sure the full game is good, and on a good system, but it's not the same from what I've seen.\n\n===\n\nThis game taught me a I need a new computer. I'm on a laptop* but it should be able to run it on better graphics settings than low at 40fps.. 2560x1440p It's telling me I need more graphics memory, at least it's telling me that, and this is what the test is for. \n\nStill a bit disappointing, I wouldn't expect main game to be different since the demo is cut from it. I don't care about FPS so much 40 - 60 is good for me, just I know the game looks gorgeous when I turned it up to run at 2fps. So that's what you need.\n\n*Ref:\nNVIDIA GeForce RTX 3050 Laptop GPU 4gb \n11th Gen Intel(R) Core(TM) i5-11400H @ 2.70GHz (2.69 GHz)\nExtra RAM 32.0 GB \n\nI seem to remember SP1 running on my old desktop on high graphics but that was only a 1080GTX. Though Id expect SP2 to be bigger in scope and more demanding now.\n\nTo be honest may need to drop down to 1080p and see what I can get there. Again I want high textures so see how it is.\n\n== \nUpdate : 1920x1080, high, dynamic\n\nPlays much better, high settings but dynamic upscaling. So it runs 30-60 and is quite playable. \n\nThe graphics look good, it still not quite as detailed as I would like at these settings. Really oddly the cutscenes after mission use low settings and I don't get that, they should bump up to max as there is so little on screen.\n\nThe 2nd level or battle barge fps did drop down, but I see the graphics are pushed up.\n\nAs for game play, it's good, i do feel like I'm getting swamped a bit and can't seem to roll out the way, I'm trying to remember SP1 and if it was easier there. [see top]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs very well, no problems and a suprisingly good demo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Message from devs: We're aware that some of you are encountering issues to play in co-op with your friends that are on the demo version. To do so, you have to invite them through the in-game code invitation. Invitations through Steam overlay won't work. Let us know if you still can't connect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just played the free trial demo 16th of october. Prettie nice game to have. I'll take it :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "In the name of God\nHello !\ni reccomend this game to who liks fghting games and shoter games.\nand demo provide you enouoh content from game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 5 years old hardware. RTX 3080, 32GB of DDR4 and my chip which was released over 3 years ago, ryzen 5 5600. \n\nThe game runs FLAWLESS to me. 4K everything on Ultra at 60 frames. Plus, the people complaining about mouse options in 2025... man. Play these games with gamepads as intended. Congrats Saber for a VERY optimized game that is a lot of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worst demo i ever played when it comes to performance, otherwise the game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great first try of the game but did have a minor problem with the controls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worked fine on my machine. I'm playing on Linux. Game looks good but not something I want to play right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great you will love it so much the sounds are top tire,even tho i am broke the demo is worth great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a good demo, no bugs, no glitches, no crashes, at least for me, other people are not having the same luck unfortunately so i guess this build will need some work done on it.\n\nThe problem i encountered more frequently was shaders not loading in properly, or rather they took some time to load at the correct resolution, could be caused by the low amount of vram but im not sure, still the amount of content is good and it showcases the game well enough for me.\n\nWould recommend to give it a try to decide if you want the game or not.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the game alot and how challenging it is but i wish it ran at a stable 60fps in 1440p. the sound of a thunder hammer clapping in a echo and screaming for the emperor is badass but little things like not being able to turn off anti aliasing as an option or not being able to bind Fire/Gun Strike and Melee to my left click and only being active for one or the other whenever said weapon is active or aimed down sights. Besides that the game is cracked and great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE SPACE MARINES 2 I GET GOT SLAUGHTER DISGUSTING ALIENS FOR THE EMPOROR but i sadly cant afford it :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good demo, ran well on 4080\n\nWill pick up when it goes like 75% off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the demo\n\nI'm not gonna give my thoughts, I'll just say that I'll delay my purchase for BF6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am buying.\n\nI CAN RECOMMEND TO MY FRIEND EVEN TO MY GRANDMA",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game is gorgeous. \nI haven't felt this immersed since WH40k Dawn of War.\nBravo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game ! Worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fricking Love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Demo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guardsmen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I own the game, my friend gets the demo, we try playing together, he invites me, I get steam message to download trial. Okie dokie, no problem, I install that, and launch it, getting ready to play together. Demo version gives me a message, that I can't access the demo version, because I already have the full game. So I go back, thinking it would work now, maybe having the demo installed helps. It didn't, the full game kept putting me in the demo version, and the demo version kept sending me back to the full version. Why do you keep making decisions to shoot yourself in the foot, Saber? What is the reasoning behind this?\n\nEDIT: Devs posted a post talking about it, don't use the Steam platform to join each other, but the code-based connection given in the game. Which, in hindsight, should have been talked about in a blog post at least. But I guess it works, and so I can recommend",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "fucking dope. idk why people would leave negative reviews for a free demo that has more content than some fully released games. Sure its not perfect. But is free and convinced me to buy the full game.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "There’s a lot of content for a demo, i'm really impressed with everything.\nThe game feels great to play, the audio design is solid, and the visuals are stunning.\nI was waiting for a sale since launch just to be sure, but this demo completely sold me.\nI had a blast playing it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The first five minutes pulled me into a world I haven’t felt in years.\nThe game captures something a lot of us have been missing — that feeling of being a walking tank, a human war machine tearing through enemies.\n\nThe brutality and the sheer weight of every hit are incredible. The combat feels heavy and satisfying, and the sound design adds so much to the atmosphere. It honestly felt like I was in a war movie, not a game.\nI enjoyed it so much that I actually stopped playing just to wait for a friend, because there’s no way I’m finishing something like this alone.\n\nThe only downside so far is the FPS drops. You really need to adjust your settings before jumping in. I spent about 30 minutes testing different options until I found what works best for my setup.\nNo crashes yet, and even if one happens, it’s understandable — it’s still a demo and clearly being worked on.\n\nIf this demo is any indication of what’s coming, then the full release might be something special.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I really enjoyed this game! The combat was satisfyingly smooth. Felt like a Gears of War with an upgraded melee combat. Keeping on Wishlist until the price lowers but only because of finances. If I were better off I would have bought it in a heartbeat.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This demo is huge. It felt like it would never end, but that's a good thing. Combat, sound, and graphics were amazing. I've never really took the time to delve into Warhammer lore, but its beginning to seem interesting. Soon as I can clear some of my backlog im going to give this series a try.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Damn, this game is bad-ass. I downloaded the Demo just to see if the game ran on my \"old\" gaming laptop and I must say that I was very surprised that it ran and how good it ran. My Laptop is a Victus with an RTX 2050 4GB, 16Gb ram and an AMD Ryzen 5 7535HS and I was expecting to run like trash like it ran FF XVI, but man, it does run pretty good. I was running it at around 60 to 45 FPS (Mostly when the screen is filled with Tyranids) on Medium with low textures, Performace DLSS and at 1080p resolution.\n\nSo, if you have a laptop like mine and don't expect 4k, ultra at 60fps (Let's be honest, its a budget laptop, its kinda dumb to expect that) you can still have a pretty good experience\n\nWill look into getting the full version in the future.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great demo - the missions are long and the demo provides a lot of content.  At one point i thought i had the full version\n\nThe game is intense - be prepared to dedicate 30mins to 1 hour per mission.  \n\nThe graphics and sounds are brilliant - but it can feel quite overwhelming if playing for extended times\n\nIts brutal but great fun.\n\nNot sure why i overlooked this one on release",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Sad to hear other people have had the performance issues. So far this has been running smooth as butter for me. Definitely gonna be picking this up sooner or later!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Very generous demo. Great opportunity to see if you like the game play and if your machine can handle it. If your PC is strong enough, this game is a marvel with the amount of stuff on screen and the quality of graphics. Saw some comments about bugs - I haven't found anything significant, maybe because my drivers are up to date.\nThe only bugs are the Tyranids ;p",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It looks incredible. You feel like a badass while playing. They mourn the loss of comrades...\n\nI want to pick this up now!\n\nI played with Keyboard and Mouse and the buttons were pretty good, but I can see this being better with a controller like a lot of 3rd Person action games and the gore is less intense than a game like Doom. It's good. The multplayer is what I am interested in, so I will try that later",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Im positively surprised by the demo - Audio/visuals coupled with very detailed, \"meaty\" animations are jaw dropping! Quite big amount of content for free, You can check a lot of what game has to offer. Most notably they didnt restrict access to weapons or classes, which is huge + for me. Co-op is working without any issues. Performance definitely could be improved, thats my only one complain. I was on the fence for many months, but i enjoyed the demo soo much im definitely gonna buy it sooner or later.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've been wanting this game for a long time only being able to play roblox knockoffs and this.game is absolutely amazing I love the fact that evry terinid is a blood bag that can be squished cheese approved 10/10 FOR THE EMPEROR",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Just played the demo.Works fine,no crashses or enything,Gameplay is ok and graphics are beautiful.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Tested on weaker specs than specified as minimum specifications - it still runs and is playable but expect long loading times in between missions and transitions from one stage to the next; Minor visual tearing on some cinematics but during gameplay did not notice any graphical issues as game likely lowered graphics and adjusted frame rate to what the specifications can handle so game I believe is fairly optimized given my potato PC still able to run it even if we are below minimum specifications\n\nGameplay loop is hoard shooter. If you love those then this is a good game for you. If not then this genre is not for you.\n\nAtmosphere is amazing. Even without knowledge of 40k lore the scenery and dialog are great. With passing knowledge of 40k it feels better knowing you understand the subtle references of the mechanicus talking or when there is mention Cadian troops or Primaris marines.\n\nAs this is only demo I expect not to see the full story. But from what I hear it is a short story main story but a well executed one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Demo is amazing. Used to have the full game but didn't run well. Thankfully, the demo came out and I've figured out how to better optimise it (lower resolution, it still looks amazing and you won't even notice);. People complain it's unoptimised... maybe, but the full game is the same? I wouldn't complain, it's a complete game in itself. It doesn't get passed the start menu for some BECAUSE of the graphics needing adjustment. Overall, amazing game, ignore the people who are never pleased and have fun! Amazing game, amazing TTG, good devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a big fan of third-person games but this is epic! The dark future environment and the feeling of being overwhelmed by the sheer amount of enemies are fantastic.\n\nWishlisted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs well, plays well, it's extremely gory. Only thing I dislike is that there's NO separate offline and online progression for PVE, despite the game already having those modes separated and bot support, the game still insists in resetting your offline PVE progress if you connect online.\n\nWhy not give us separate progression for online and offline? That way you secure that game's mode preservation, the preservation of the entirety of your game, and the joy of all game modes for anyone who wants to play your game?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend who actually owns the game is unable to play the demo (which is already absurd) because he owns the game, and people who own the game are unable to access the demo, meaning that me and my friend cannot play together, IN A CO-OP GAME, thanks\n\n\nUpdate: so apparently the way we could play together is by using the in game code system, and we just assumed that we couldn't play together due to the fact that inviting eachother through steam didn't work, you know, the most common way to invite/join your friend's game, I really think that something like this should've either been fixed or at the very least pasted all over the fucking game's discord and forums so that people would know\n\nFun game tho, demo works as intended now, but wouldn't it have just been easier to make it free for the weekend like any other game ever and save yourself the trouble of making a demo version? Game dev decision making continues to leave me speechless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't experience any issues regarding frame rate or crashes but its a free demo so who cares lol.\nThe demo itself is quite generous with 2 story missions and 3 operations and access to all 6 classes.\nThe combat is very weird to get used to for someone like me who has played way too much Vermintide and Darktide but its not awful or broken yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing that they made a Demo to test all aspects of the game while the game is on a large sale. \n\nDon't listen to the bad reviews regarding performance. The Demo runs great and those people are probably just brain dead fools with potato machines.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "==\nSP 1 comparison.\nJust going to put this at the top now, as I went and looked at SP1 gameplay again. SP1 feels way better, the guns sound better, it's actually like you're shooting something, the combat - I remember when they first showed sneak peak demos of him caving through enemies all in sync and the slow motion on each one, blew people away, it's fucking great, it's much more Batman Arkham style. You feel like you are making choices and directions on purpose.\n\nSP2 is more like dark tide I think or others of that kind. Which to me isn't great. Maybe it's the nature of fighting tyrranids and not orks but the hoard swarm isnt the same as those Gretchen swarms. It all needs a bit more weight, more slow mo on hits, more crushin. I don't know if they will change that now.\n\nI can't say from the limited gameplay I've seen in person but the lots of videos online. It all looks good, but it feels different. I wish they'd go back to the older combat style. And make guns actually do something. i.e. https://youtu.be/2zNRtOhFq9Y?t=616 (10:16)\n\nI'm sure the full game is good, and on a good system, but it's not the same from what I've seen.\n\n===\n\nThis game taught me a I need a new computer. I'm on a laptop* but it should be able to run it on better graphics settings than low at 40fps.. 2560x1440p It's telling me I need more graphics memory, at least it's telling me that, and this is what the test is for. \n\nStill a bit disappointing, I wouldn't expect main game to be different since the demo is cut from it. I don't care about FPS so much 40 - 60 is good for me, just I know the game looks gorgeous when I turned it up to run at 2fps. So that's what you need.\n\n*Ref:\nNVIDIA GeForce RTX 3050 Laptop GPU 4gb \n11th Gen Intel(R) Core(TM) i5-11400H @ 2.70GHz (2.69 GHz)\nExtra RAM 32.0 GB \n\nI seem to remember SP1 running on my old desktop on high graphics but that was only a 1080GTX. Though Id expect SP2 to be bigger in scope and more demanding now.\n\nTo be honest may need to drop down to 1080p and see what I can get there. Again I want high textures so see how it is.\n\n== \nUpdate : 1920x1080, high, dynamic\n\nPlays much better, high settings but dynamic upscaling. So it runs 30-60 and is quite playable. \n\nThe graphics look good, it still not quite as detailed as I would like at these settings. Really oddly the cutscenes after mission use low settings and I don't get that, they should bump up to max as there is so little on screen.\n\nThe 2nd level or battle barge fps did drop down, but I see the graphics are pushed up.\n\nAs for game play, it's good, i do feel like I'm getting swamped a bit and can't seem to roll out the way, I'm trying to remember SP1 and if it was easier there. [see top]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Runs very well, no problems and a suprisingly good demo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Message from devs: We're aware that some of you are encountering issues to play in co-op with your friends that are on the demo version. To do so, you have to invite them through the in-game code invitation. Invitations through Steam overlay won't work. Let us know if you still can't connect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just played the free trial demo 16th of october. Prettie nice game to have. I'll take it :D",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "In the name of God\nHello !\ni reccomend this game to who liks fghting games and shoter games.\nand demo provide you enouoh content from game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 5 years old hardware. RTX 3080, 32GB of DDR4 and my chip which was released over 3 years ago, ryzen 5 5600. \n\nThe game runs FLAWLESS to me. 4K everything on Ultra at 60 frames. Plus, the people complaining about mouse options in 2025... man. Play these games with gamepads as intended. Congrats Saber for a VERY optimized game that is a lot of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worst demo i ever played when it comes to performance, otherwise the game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great first try of the game but did have a minor problem with the controls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worked fine on my machine. I'm playing on Linux. Game looks good but not something I want to play right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great you will love it so much the sounds are top tire,even tho i am broke the demo is worth great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely a good demo, no bugs, no glitches, no crashes, at least for me, other people are not having the same luck unfortunately so i guess this build will need some work done on it.\n\nThe problem i encountered more frequently was shaders not loading in properly, or rather they took some time to load at the correct resolution, could be caused by the low amount of vram but im not sure, still the amount of content is good and it showcases the game well enough for me.\n\nWould recommend to give it a try to decide if you want the game or not.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the game alot and how challenging it is but i wish it ran at a stable 60fps in 1440p. the sound of a thunder hammer clapping in a echo and screaming for the emperor is badass but little things like not being able to turn off anti aliasing as an option or not being able to bind Fire/Gun Strike and Melee to my left click and only being active for one or the other whenever said weapon is active or aimed down sights. Besides that the game is cracked and great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE SPACE MARINES 2 I GET GOT SLAUGHTER DISGUSTING ALIENS FOR THE EMPOROR but i sadly cant afford it :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good demo, ran well on 4080\n\nWill pick up when it goes like 75% off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the demo\n\nI'm not gonna give my thoughts, I'll just say that I'll delay my purchase for BF6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am buying.\n\nI CAN RECOMMEND TO MY FRIEND EVEN TO MY GRANDMA",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game is gorgeous. \nI haven't felt this immersed since WH40k Dawn of War.\nBravo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game ! Worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fricking Love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Demo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guardsmen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I own the game, my friend gets the demo, we try playing together, he invites me, I get steam message to download trial. Okie dokie, no problem, I install that, and launch it, getting ready to play together. Demo version gives me a message, that I can't access the demo version, because I already have the full game. So I go back, thinking it would work now, maybe having the demo installed helps. It didn't, the full game kept putting me in the demo version, and the demo version kept sending me back to the full version. Why do you keep making decisions to shoot yourself in the foot, Saber? What is the reasoning behind this?\n\nEDIT: Devs posted a post talking about it, don't use the Steam platform to join each other, but the code-based connection given in the game. Which, in hindsight, should have been talked about in a blog post at least. But I guess it works, and so I can recommend",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "fucking dope. idk why people would leave negative reviews for a free demo that has more content than some fully released games. Sure its not perfect. But is free and convinced me to buy the full game.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "There’s a lot of content for a demo, i'm really impressed with everything.\nThe game feels great to play, the audio design is solid, and the visuals are stunning.\nI was waiting for a sale since launch just to be sure, but this demo completely sold me.\nI had a blast playing it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The first five minutes pulled me into a world I haven’t felt in years.\nThe game captures something a lot of us have been missing — that feeling of being a walking tank, a human war machine tearing through enemies.\n\nThe brutality and the sheer weight of every hit are incredible. The combat feels heavy and satisfying, and the sound design adds so much to the atmosphere. It honestly felt like I was in a war movie, not a game.\nI enjoyed it so much that I actually stopped playing just to wait for a friend, because there’s no way I’m finishing something like this alone.\n\nThe only downside so far is the FPS drops. You really need to adjust your settings before jumping in. I spent about 30 minutes testing different options until I found what works best for my setup.\nNo crashes yet, and even if one happens, it’s understandable — it’s still a demo and clearly being worked on.\n\nIf this demo is any indication of what’s coming, then the full release might be something special.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I really enjoyed this game! The combat was satisfyingly smooth. Felt like a Gears of War with an upgraded melee combat. Keeping on Wishlist until the price lowers but only because of finances. If I were better off I would have bought it in a heartbeat.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This demo is huge. It felt like it would never end, but that's a good thing. Combat, sound, and graphics were amazing. I've never really took the time to delve into Warhammer lore, but its beginning to seem interesting. Soon as I can clear some of my backlog im going to give this series a try.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Damn, this game is bad-ass. I downloaded the Demo just to see if the game ran on my \"old\" gaming laptop and I must say that I was very surprised that it ran and how good it ran. My Laptop is a Victus with an RTX 2050 4GB, 16Gb ram and an AMD Ryzen 5 7535HS and I was expecting to run like trash like it ran FF XVI, but man, it does run pretty good. I was running it at around 60 to 45 FPS (Mostly when the screen is filled with Tyranids) on Medium with low textures, Performace DLSS and at 1080p resolution.\n\nSo, if you have a laptop like mine and don't expect 4k, ultra at 60fps (Let's be honest, its a budget laptop, its kinda dumb to expect that) you can still have a pretty good experience\n\nWill look into getting the full version in the future.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great demo - the missions are long and the demo provides a lot of content.  At one point i thought i had the full version\n\nThe game is intense - be prepared to dedicate 30mins to 1 hour per mission.  \n\nThe graphics and sounds are brilliant - but it can feel quite overwhelming if playing for extended times\n\nIts brutal but great fun.\n\nNot sure why i overlooked this one on release",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Sad to hear other people have had the performance issues. So far this has been running smooth as butter for me. Definitely gonna be picking this up sooner or later!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Very generous demo. Great opportunity to see if you like the game play and if your machine can handle it. If your PC is strong enough, this game is a marvel with the amount of stuff on screen and the quality of graphics. Saw some comments about bugs - I haven't found anything significant, maybe because my drivers are up to date.\nThe only bugs are the Tyranids ;p",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "This is a review of the demo, not the full version.\n\nDemo launches and gets to the Press Button screen. When I press a key I get this message:\n\n\"Congratulation on purchasing the full version of the game. ... The demo is not available for owners of the full version.\"\n\nI don't own the full game. What gives?\n\nBecause the demo won't even run I'm gonna give it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I can't even enter the demo, due to the fact It thinks I have the full game. I don't. Genuinely upset, considering I think this game looks amazing.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Fun demo, but unoptimized as heck. Why does it take up as much space as the full game? Among other bugs and crashes, this demo really needs some work. I hope it doesn't get abandoned by the devs. Otherwise it'd be a horrible way to market your game. A demo should be a functional slice of your product that excites people to buy the whole thing. this is a half baked buggy mess. At the time of writing, the full game is on sale. I want to believe the full game doesn't have these issues. But for now, fix the demo and you're good.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "This demo keeps crashing during or right after the first cut-scene. I can only take two steps, then it crashes. It's a shame, I really like this game, but it's unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I can't even get into the demo gameplay. Crashed trying to connect to server. Game looks cool, and it's on sale this weekend so I wanted to try the demo first, but seeing that it won't even work, I will not risk buying a game that could be just as broken. I hope this is fixed soon so I can change my mind.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Even for a demo its unplayable. I started up a new game and the  game froze when it started the opening  cut scene. Then the audio kept going and then it crashed. Game should be optimized better.I played many demos and this is the only  demo so far that didn't work!\nI have seen gameplay  of this game and to be fair it does look like a great game but it seems you must have a high end computer that isn't 5 plus years old! Personally all the devs had to was optimize the game better to allow a wider audience to play their game! I have played new games by the way with no issues. This is a optimization issue! This   game clearly consumes  something  on your pc way too much to the point it is preventing some  people to even play it!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I am very pleased to have had the option to try the game out for more than 2 hours before purchasing. It cemented that I just do not vibe at all with this game's peculiar control scheme, very sluggish animations with inconsistent animation-cancelling. It's also *enormous*, the demo is a bigger filesize than nearly anything else in my library. It runs fine for me, but the modern style of relying on upscaling and oodles of anti-aliasing and sharpening makes it substantially more muddy than the screenshots would have you believe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fml, I am torn. The game is pretty, but its environments generic. It's a long demo, but it's also traditional and unsurprising. Player agency exists during combat, but the levels are linear & rail-roady. I have a bolter and a chain sword, but I'm forced to watch a canned animation of my spess mahreen kicking or shoving an obstacle instead of going ham on it myself. There's a million more ways to make traversal actually fun. Like, let me do the hacking and the slashing? Combat relies on overlays for reading enemies more than utilization of the exquisite animations. I just feel like I'm going through the motions when the game allows it. Hold 'X' to skip.\n\nBut what kills me is that we're still using \"HOLD button to do thing\" in 2025. That is the most slow, unfun, least rewarding style of input ever devised. This is *bad* game design that only serves to waste the player's time. My inputs feel so disconnected from the actions on screen during a hold, that I just think \"wow, I could be doing something way more rewarding and productive than this, like washing my balls.\" There is never a second in this game when I wouldn't want to pick something up. I should be able to walk over things and eat them like I'm Pac-Man, not stopping to hold 'X' all the time. Wakka-wakka, motherfucker. Switching loadouts back would be as simple as walking over the thing I dropped. It's like they chose to pad runtime with button holding and watching canned anims and forgot this should be a controllable video game ass video game. Hold 'X' to skip.\n\ntl;dr play the first game's anniversary edition. Hold 'X' to stop reading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even start the game\nLooked the error up, seems like there isn't even a solution fixing it...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game runs like shit. Demo has kernal level spyware, can't even play campaign without it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is super fun and epic but unfortunately it's crashing every time when I play it, even in low graphics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's difficult not to recommend this game.\nThe demo is very generous in time and content. So that's a positive. I'll try to make a list of what I liked and what not so much.\nSome things about the game that I list in the \"bad\" that have to do with the gameplay, may be can be improved with time, but those are my initial impressions.\n\nPositive:\n- Warhammer universe (I really like it). In this game, you continue Titus story.\n- Demo very generous in time and content. Even can play Operations in multiplayer. Kudos for this!\n- With friends is much more fun (I just play by matchmaking with strangers and still got more fun than playing alone)\n\nDidn't like it so much:\n- Optimization: for a game this old (already goes for patch number 10) it has a very poor performance. The first cinematic, I couldn't see it because the FPS dropped to 2 FPS. I am talking about the cinematic! With a 24GB VRAM card. Then the game I had to configure it in \"quality\" (that is the setting that have the least amount of scaling) to get a little more than 60 fps because in native (no scaling) was stuck at 35-40fps. The game looks OK, but it has not breathtaking photorealistic graphics that justify this resource consumption and poor performance. Optimization is just bad.\n\n- Freedom: this game suffers all the console game vices. Linear levels, battle arenas, linear story, etc. Even the fighting now has the blue→parry, red→evade mechanic of all the console games I know. You start a level, follow the marker until an arena (you see it a mile away and just have to enter, no alternative path, no decision-making, no strategy. Do what you are told). Then you fight, waves and waves of enemies. The combat animations are slow (you have light and strong attacks), and more times than I can count, the red or blue indicators came in the middle of an animation of my light/strong attack so when you want to parry/evade is already too late. Your strong attacks are constantly interrupted for the same reason, the animations are too slooow... And that what has become standard nowadays! You have no freedom how to fight, you have to take care of the enemies they way the game want it. And I didn't progress much in the story, but I am sure that it has \"the cinematic decide your destiny\" console logic. That is when you have a fight that cost you a lot of effort, and you \"win\" but the cinematic decide that you loose because the history is that way. It happened in every consolish game I have played, and this it doesn't  seem to be the exception.\n\n- Weapons: The weapons are from Warhammer universe and are nice, but also, they are effective just when the game want. The ranged weapons are weak and off course they become overwhelmed pretty quickly so you have to change to melee, another thing that you can't choose, and the game decide for you.\n\n- Information: The game has a first mission that acts as a tutorial that is very complete, teaching you to block, to evade, etc... That is very well done and it's OK. But after that, there are some things that could be more informative. For example, middle of mission, I encounter a resupply box to change my weapon for another. Didn't have a compare feature or a way to see the stats of the weapon. I still don't know if in what situation I have to use the combat knife or the chainsaw sword. \n\n- Price: I would pay for this game on sale if the whole package cost like 15usd. But at the current price range with all the dlcs and different \"versions\" it is very expensive.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is beautiful and I love the universe but the controls are so god awful on mouse and keyboard I couldn't get past that at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been a big fan of the first game. Of 40k in general.\nHowever after seeing the pricetag and knowing how games are made these days, I decided to wait.\nAnd good that i did, just tried to play the Demo. Couldnt get past the Intro Cinematic before crashing.\nNow i could of course start turningsome knobs in the settings or whatever, but honestly i shouldnt have to and there are games out there (like KCD2) that just run great without having to do that.\n\nUnnecessarily badly optimized.\nThough my dissapointment is great, i wont buy this game, not even on sale, whats the point, wont run anyways.\n(P.S. Ive got a pretty good rig)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played for roughly one hour had no issues during the first mission loved the gameplay, but after, Titus becomes a primaris cutscene the game became unplayable was barely reaching 30 fps with the lowest possible settings I have a 3050 Ti with 4GB VRAM. I understand that this is a newer game and that I have an old GPU with very little VRAM but I  seriously do not recomend buying the game if you have a GPU with little VRAM.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "demo review\n\nthe game over all... is alright, not great, I didnt like it, and not buying it, wish I liked it..I tried, but it is not as great as the first game mind you, the combat is so mindless, just jump at the enemy an press the \"sword\" bottom like crazy and throw grenades, those are all over if you pay attention, there is something like a parry and a dodge move, and enemies signaling with \"bright flashes\" what they are about to do...for some reason that still makes the gameplay cheap and mindless, had the developers put any \"serious\" thought in the gameplay -they didnt, and the game clearly cattles to 13yr olds and ADHD- it could be fun, and unlike any other PvP/PvE out there. \n\nPvE holds promise, again could be better.\nPvP gets old fast and everybody was killing me so easily, almost as if their weapons hit harder than mine, my imagination most likely.\n\n   the original space marine game at the hardest difficulty setting was great, every move have to be well thought out, but you had to be fast, no room for blind attacks and button smashing, if you charged at a mob without any forethought you would get murdered right on the spot, and this was accentuated by the fact that you could only gain health back by pulling execution move, and grenades and ammo were scarce and it was very possible to run out if you took shots at everything that got in your way, so exercising good firing discipline was required. A masterpiece that successfully combined melee and firefight in a single package, and even if the game wasnt perfect it was still a great testament to Relic's talent.\n\nconclusion:\n\nit could be better in so many ways, but they choose flashy and dumb fun over substance, hope they  do better with Space Marine 3 which I doubt because it is still EA...or was?...really not sure what the future hold for games under that company at this point.\n\nPS\n\ntext chat and voice chat do not work for this game for some reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WAIT UNTIL THIS HALF-BAKED DEMO IS PATCHED (look for patches later than my comment date), BECAUSE IT'S A LOT OF DEMO TO DOWNLOAD AND HARD-DRIVE SPACE TO WASTE (over 80gb).\n\nTried to play this demo on a decently powerful PC - AMD 5950x CPU, RTX3090ti GPU, NVME SSD, 64gb RAM & a DVD drive used as a cup-holder for my tall glass of freshly squeezed unicorn tears. Apparently this wasn't enough. The intro cinematic chugged like a slow slideshow with pages missing before locking up.\n\nThe game has been out for over a year. If they can't get a demo of the full game running, one wonders what pressures the Devs are under? Rushing out a demo for Battlefield 6 launch weekend perhaps? Pop it back in the oven and let it bake please, it's not ready yet.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Really good Demo. plenty of content for free, one thing I have noticed is that must have NVDA DLSS enabled or textures will become funky. Overall very pleased with the free product, got plenty of hrs of gameplay so far.\n\nEDIT: Progress wiped after installing the game on my Steam Deck. I did select sync with cloud save, I guess it did not. Contacted Saber and Steam, will see if I can get a previous save restored....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Demo review.\n\nAt some point your character says his greatest fear is \"failure.\" THAT ladies and gentlemen is heresy. Space Marines have no fear.\n\nThis is at best a $39-$49 full price game and $29 sale purchase. Not clue how it ended up being $80 (Japan 9800yen) that is like 3 bags of rice for 3 month. Another example of moodern day mediocrity. Demo is also very poorly optimized, maybe it is just shitty kernel easy anti cheat. Definitely on guard about upgrading this to full version because right now its just so poorly optimized. It runs very smoothly on ultra but when you get swarmed and you are suppose to get swarmed the game starts to laaaaaaaaag.\n\nStory is not bad, so if you like SP stuff definitely worth getting this for SP coop but at a much lower price.\n\nFun story but maybe wait until bigger sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Never have space marines felt so pathetically weak.\n\nThis is a melee rhythm game first and foremost. If you want fun gun-play the devs think you should go somewhere else. In the first game you felt like a tank slowly blowing your way through hordes of xenos. In this game you feel like a hippo trying to do ballet. The whole red to dodge and blue to parry isn't fun, it's just tedious. I want to tear my way through hordes of aliens but even the weakest enemies take so many bullets or weapon swings to kill. The controls feel unresponsive instead of feeling chunky, probably due to the players tiny health pool and paper mache armor. Also, they failed to capture the 40k feeling. I mean most of the space marines you see die go out like freaking chumps 1v1ing bottom tier tyranids. The story is... really not great. It's a whole lot tell and not do. There's a lot of name and title dropping, but if you remove that the game just looks and feels like knock-off Star Wars.\n\nUltimately this game commits the worst sin a video game can commit. I got bored half way through the tutorial.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Data collection that you cannot refuse and cannot be turned off in the menu.\nThe size of the game is absolutely ridiculous.\nI wanted to play online, but Demi doesn't allow it. I'm correcting myself, it does allow it, but only after about an hour of playing.\nNowadays? Not being able to skip the campaign to get to the online content?\nWell, some people like not having a choice, as you can see. \n\nIf you buy the game, you get +- 5-8 hours of gameplay and a million DLCs. Sad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I bought the full version a while ago, but had to refund it due to the game constantly crashing during the intro cinematic. \n\nI wanted to give it another chance, perhaps they fixed it? Nope, still freezes and crashes in the same place. I tried disabling the Steam overlay, limiting framerate, but to no avail.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After playing the demo, I have removed this game from my wishlist. It's just Warhammer themed World War Z, but unlike this game I can actually get a high framerate in World War Z",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Demo won't start. And I have a one year old high end PC with updated drivers.\nKeeps crashing. If the full game has the same issues, I might as well remove it from my wishlist.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The demo feels like a console game. Which is like describing a movie as 'Hollywood.'\n\nIt's NOT a compliment, it is utter condemnation. The demo is vapid and forgettable. Good thing I can now remove the game from my wishlist.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Thanks for the demo but not my game. Big FU for that epic games stuff that auto installed without asking me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ran quite well on my 3080 but coulnd't play the demo with my friends who already own the game, they downloaded the demo, and it said they couldn't play the demo since they already own the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has good potential, but still needs a lot of work. Sound jitters, bugs, desync, bugged animations, units straight up teleporting around - all of that in a demo, so presumably in a most polished part of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "border line unplayable\nlag can make ping reach into the thousands crashes 24/7 and most of the time just wont open",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "and again a game with only that s*** TAA or s*** upscale from nvidia or s*** upscale from amd. congrats.\n\nread slowly devs(all of them): i just want to play games on NATIVE with no AA or maybe FXAA.\n\nagain:i just want to play games on NATIVE with no AA or maybe FXAA\n\nokay for the third time, just to be sure: i just want to play games on NATIVE with no AA or maybe FXAA\n\ni hope the full game will have fxaa, or refund will come.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Demo doesn't even get past the first screen on my beefy ass rig a year after the game launched you're joking lmao",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If the demo is anything like the full game, I will not be buying it. Took forever to 'load resources' then it tried to play the into and it crashed out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "- Extremely limited mouse sensitivity options, there is only one generic sensitivity slider for the mouse and it is not even that precise, the difference between 3 and 4 on a slider of 20 feels huge. There are at least four different sliders for controller sensitivity, this could be done for mouse settings as well just as a baseline. Allowing decimals of sensitivity would greatly improve these issues as well.\n\n- No proper ultrawide support, I am on a 32:9 aspect ratio and the field of view is atrocious, everything is ridiculously zoomed in, even on max fov settings. There are posts about this dating over a year ago and it has still not been attended to.\n\n- Stable performance relies on upscaling, not the biggest deal as it is smooth enough with balanced upscaling settings, but it just feels like a lazy alternative to actually optimizing the game's performance.\n\n- Data collection is forced as far as I can tell.\n\n\n\nI couldn't bother to play more of the demo with these issues at hand and I definitely don't see myself purchasing the full game if these problems persist. As you may be able to tell, I am stingy about sensitivity settings and the ultrawide issues just make this game entirely unplayable for me currently.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "86 gb demo that takes 5 minutes to hit the main menu and then crashes during the opening cutscene",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The first prerender cutscene is a not passable boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unsharp, blurry, over-sharpened mess\n\nThe game looks like absolute garbage. It’s blurry and unsharp yet somehow still over-sharpened enough to make your eyes hurt and cause motion sickness. After a while, your eyes ache from all the ghosting, sharpening, and unstable clarity. In intense scenes you can barely tell what’s happening. Some areas in the game are actually beautiful but then completely ruined by this disgusting upscaled, over-sharpened TAA.\n\nThere’s no way to disable this trash TAA. No SMAA, no FXAA, not even an off option. You can only slightly counteract it with DSR or similar techniques since the game never lets you raise the internal resolution. This reduces the worst of the blur a little but introduces new problems such as over-sharpening, graininess, and ugly visuals. The game also has severe texture streaming issues. Some textures are already present but low quality, while others take a noticeable moment to fully load or pop in late, even on hardware that is more than capable. This is absolutely unacceptable.\n\nThe game crashes constantly. You can’t alt-tab without risking a crash and sometimes it dies the moment you press something.\n\nEasy Anti-Cheat blocks any chance of fixing it yourself. Let us use ReShade and turn off the in-game AA so we can apply a proper SMAA or Anti-Aliasing that actually works.\n\nTo whoever at Saber thought it was a great idea to encrypt the engine or game config files so players can’t tweak anything, I hope your sleeves slide down every time you wash your hands.\n\nThis game is held back by lazy, clueless devs at Saber Interactive. Learn how to properly implement anti-aliasing like SMAA1x or SMAA2x or just let players disable it. Learn how to deliver real image quality, not this blurry shimmering mess, and make sure it scales from Full HD to 4K.\n\nFrom now on, whenever I see your studio’s name on a game, I’ll stay far away. You’re one of the reasons modern gaming sucks!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Watch the intro from SM1 vs SM2 going to tell you most of it...\nUtterly just panyfull experience in almost every single way just on starting cutscenes and it only gets worse after that\njanky ass quicktime garbage movement and combat in other words the whole game iTS WORSE THAN MOBILE\n\nEven had to turn the shitty generic shitmixed music completely off to hear ANY THING ELSE and i could barely hear the music because it was all so badly mixed together ONLY to find out its all literaly throwing things in the trash sounds....\n\nStory and characters are beyond belief its worse than the most trash made for women pron novels tier writing\npainful painful painful.... very very bad game no space marine whatsoever just loose hammers and war sprayed on lightly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "HW nároky někde ve stratosféře, nezvládne zobrazit ani intro po spuštění hry",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wont let me play it, my friend owns the game but the game thinks i own it, but i don't. \"ita maka me sad :'(\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I read the reviews and tried it out less than ten minutes in I saw how cumbersome combat felt",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What is this Demo man, it keeps crashing or freezing..\nYou really would think that someone would put some work into a DEMO TO PROMOTE A GAME.....\nEdit: it works on lower settings, even with a decent PC that should be able to run it on ultra, but there are some glitches and bugs here and there, sync not being propper, etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shitily optimised and buggy game. Managed to trigger a bug where I was able to move out of bounds and my character was 2m off the actual ground. Barely runs on a mid-range graphics card. Absolute UE5 slop, can't recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i really want to play this but the audio skips so badly i feel like im only getting half the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty enough, but clunky. tried to multiplayer for the demo, was not able to stay connected with other person in demo for a full mission. \n\nKinda underwhelming.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play, it says i own the full game when i dont",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had more fun in customizing my guy then playing the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you can't play with people that already own the game",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "sorry but this is unoptimized crap !!! (",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "crashes everytime i try to run it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even play the demo what a fucking joke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "invite code system in this day and age. fuck you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BLACK SCREEN on startup. That's a 0/10 for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its so boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a review of the demo, not the full version.\n\nDemo launches and gets to the Press Button screen. When I press a key I get this message:\n\n\"Congratulation on purchasing the full version of the game. ... The demo is not available for owners of the full version.\"\n\nI don't own the full game. What gives?\n\nBecause the demo won't even run I'm gonna give it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I can't even enter the demo, due to the fact It thinks I have the full game. I don't. Genuinely upset, considering I think this game looks amazing.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Fun demo, but unoptimized as heck. Why does it take up as much space as the full game? Among other bugs and crashes, this demo really needs some work. I hope it doesn't get abandoned by the devs. Otherwise it'd be a horrible way to market your game. A demo should be a functional slice of your product that excites people to buy the whole thing. this is a half baked buggy mess. At the time of writing, the full game is on sale. I want to believe the full game doesn't have these issues. But for now, fix the demo and you're good.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "This demo keeps crashing during or right after the first cut-scene. I can only take two steps, then it crashes. It's a shame, I really like this game, but it's unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I can't even get into the demo gameplay. Crashed trying to connect to server. Game looks cool, and it's on sale this weekend so I wanted to try the demo first, but seeing that it won't even work, I will not risk buying a game that could be just as broken. I hope this is fixed soon so I can change my mind.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Even for a demo its unplayable. I started up a new game and the  game froze when it started the opening  cut scene. Then the audio kept going and then it crashed. Game should be optimized better.I played many demos and this is the only  demo so far that didn't work!\nI have seen gameplay  of this game and to be fair it does look like a great game but it seems you must have a high end computer that isn't 5 plus years old! Personally all the devs had to was optimize the game better to allow a wider audience to play their game! I have played new games by the way with no issues. This is a optimization issue! This   game clearly consumes  something  on your pc way too much to the point it is preventing some  people to even play it!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I am very pleased to have had the option to try the game out for more than 2 hours before purchasing. It cemented that I just do not vibe at all with this game's peculiar control scheme, very sluggish animations with inconsistent animation-cancelling. It's also *enormous*, the demo is a bigger filesize than nearly anything else in my library. It runs fine for me, but the modern style of relying on upscaling and oodles of anti-aliasing and sharpening makes it substantially more muddy than the screenshots would have you believe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fml, I am torn. The game is pretty, but its environments generic. It's a long demo, but it's also traditional and unsurprising. Player agency exists during combat, but the levels are linear & rail-roady. I have a bolter and a chain sword, but I'm forced to watch a canned animation of my spess mahreen kicking or shoving an obstacle instead of going ham on it myself. There's a million more ways to make traversal actually fun. Like, let me do the hacking and the slashing? Combat relies on overlays for reading enemies more than utilization of the exquisite animations. I just feel like I'm going through the motions when the game allows it. Hold 'X' to skip.\n\nBut what kills me is that we're still using \"HOLD button to do thing\" in 2025. That is the most slow, unfun, least rewarding style of input ever devised. This is *bad* game design that only serves to waste the player's time. My inputs feel so disconnected from the actions on screen during a hold, that I just think \"wow, I could be doing something way more rewarding and productive than this, like washing my balls.\" There is never a second in this game when I wouldn't want to pick something up. I should be able to walk over things and eat them like I'm Pac-Man, not stopping to hold 'X' all the time. Wakka-wakka, motherfucker. Switching loadouts back would be as simple as walking over the thing I dropped. It's like they chose to pad runtime with button holding and watching canned anims and forgot this should be a controllable video game ass video game. Hold 'X' to skip.\n\ntl;dr play the first game's anniversary edition. Hold 'X' to stop reading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even start the game\nLooked the error up, seems like there isn't even a solution fixing it...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game runs like shit. Demo has kernal level spyware, can't even play campaign without it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is super fun and epic but unfortunately it's crashing every time when I play it, even in low graphics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's difficult not to recommend this game.\nThe demo is very generous in time and content. So that's a positive. I'll try to make a list of what I liked and what not so much.\nSome things about the game that I list in the \"bad\" that have to do with the gameplay, may be can be improved with time, but those are my initial impressions.\n\nPositive:\n- Warhammer universe (I really like it). In this game, you continue Titus story.\n- Demo very generous in time and content. Even can play Operations in multiplayer. Kudos for this!\n- With friends is much more fun (I just play by matchmaking with strangers and still got more fun than playing alone)\n\nDidn't like it so much:\n- Optimization: for a game this old (already goes for patch number 10) it has a very poor performance. The first cinematic, I couldn't see it because the FPS dropped to 2 FPS. I am talking about the cinematic! With a 24GB VRAM card. Then the game I had to configure it in \"quality\" (that is the setting that have the least amount of scaling) to get a little more than 60 fps because in native (no scaling) was stuck at 35-40fps. The game looks OK, but it has not breathtaking photorealistic graphics that justify this resource consumption and poor performance. Optimization is just bad.\n\n- Freedom: this game suffers all the console game vices. Linear levels, battle arenas, linear story, etc. Even the fighting now has the blue→parry, red→evade mechanic of all the console games I know. You start a level, follow the marker until an arena (you see it a mile away and just have to enter, no alternative path, no decision-making, no strategy. Do what you are told). Then you fight, waves and waves of enemies. The combat animations are slow (you have light and strong attacks), and more times than I can count, the red or blue indicators came in the middle of an animation of my light/strong attack so when you want to parry/evade is already too late. Your strong attacks are constantly interrupted for the same reason, the animations are too slooow... And that what has become standard nowadays! You have no freedom how to fight, you have to take care of the enemies they way the game want it. And I didn't progress much in the story, but I am sure that it has \"the cinematic decide your destiny\" console logic. That is when you have a fight that cost you a lot of effort, and you \"win\" but the cinematic decide that you loose because the history is that way. It happened in every consolish game I have played, and this it doesn't  seem to be the exception.\n\n- Weapons: The weapons are from Warhammer universe and are nice, but also, they are effective just when the game want. The ranged weapons are weak and off course they become overwhelmed pretty quickly so you have to change to melee, another thing that you can't choose, and the game decide for you.\n\n- Information: The game has a first mission that acts as a tutorial that is very complete, teaching you to block, to evade, etc... That is very well done and it's OK. But after that, there are some things that could be more informative. For example, middle of mission, I encounter a resupply box to change my weapon for another. Didn't have a compare feature or a way to see the stats of the weapon. I still don't know if in what situation I have to use the combat knife or the chainsaw sword. \n\n- Price: I would pay for this game on sale if the whole package cost like 15usd. But at the current price range with all the dlcs and different \"versions\" it is very expensive.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is beautiful and I love the universe but the controls are so god awful on mouse and keyboard I couldn't get past that at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been a big fan of the first game. Of 40k in general.\nHowever after seeing the pricetag and knowing how games are made these days, I decided to wait.\nAnd good that i did, just tried to play the Demo. Couldnt get past the Intro Cinematic before crashing.\nNow i could of course start turningsome knobs in the settings or whatever, but honestly i shouldnt have to and there are games out there (like KCD2) that just run great without having to do that.\n\nUnnecessarily badly optimized.\nThough my dissapointment is great, i wont buy this game, not even on sale, whats the point, wont run anyways.\n(P.S. Ive got a pretty good rig)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played for roughly one hour had no issues during the first mission loved the gameplay, but after, Titus becomes a primaris cutscene the game became unplayable was barely reaching 30 fps with the lowest possible settings I have a 3050 Ti with 4GB VRAM. I understand that this is a newer game and that I have an old GPU with very little VRAM but I  seriously do not recomend buying the game if you have a GPU with little VRAM.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "demo review\n\nthe game over all... is alright, not great, I didnt like it, and not buying it, wish I liked it..I tried, but it is not as great as the first game mind you, the combat is so mindless, just jump at the enemy an press the \"sword\" bottom like crazy and throw grenades, those are all over if you pay attention, there is something like a parry and a dodge move, and enemies signaling with \"bright flashes\" what they are about to do...for some reason that still makes the gameplay cheap and mindless, had the developers put any \"serious\" thought in the gameplay -they didnt, and the game clearly cattles to 13yr olds and ADHD- it could be fun, and unlike any other PvP/PvE out there. \n\nPvE holds promise, again could be better.\nPvP gets old fast and everybody was killing me so easily, almost as if their weapons hit harder than mine, my imagination most likely.\n\n   the original space marine game at the hardest difficulty setting was great, every move have to be well thought out, but you had to be fast, no room for blind attacks and button smashing, if you charged at a mob without any forethought you would get murdered right on the spot, and this was accentuated by the fact that you could only gain health back by pulling execution move, and grenades and ammo were scarce and it was very possible to run out if you took shots at everything that got in your way, so exercising good firing discipline was required. A masterpiece that successfully combined melee and firefight in a single package, and even if the game wasnt perfect it was still a great testament to Relic's talent.\n\nconclusion:\n\nit could be better in so many ways, but they choose flashy and dumb fun over substance, hope they  do better with Space Marine 3 which I doubt because it is still EA...or was?...really not sure what the future hold for games under that company at this point.\n\nPS\n\ntext chat and voice chat do not work for this game for some reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WAIT UNTIL THIS HALF-BAKED DEMO IS PATCHED (look for patches later than my comment date), BECAUSE IT'S A LOT OF DEMO TO DOWNLOAD AND HARD-DRIVE SPACE TO WASTE (over 80gb).\n\nTried to play this demo on a decently powerful PC - AMD 5950x CPU, RTX3090ti GPU, NVME SSD, 64gb RAM & a DVD drive used as a cup-holder for my tall glass of freshly squeezed unicorn tears. Apparently this wasn't enough. The intro cinematic chugged like a slow slideshow with pages missing before locking up.\n\nThe game has been out for over a year. If they can't get a demo of the full game running, one wonders what pressures the Devs are under? Rushing out a demo for Battlefield 6 launch weekend perhaps? Pop it back in the oven and let it bake please, it's not ready yet.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Really good Demo. plenty of content for free, one thing I have noticed is that must have NVDA DLSS enabled or textures will become funky. Overall very pleased with the free product, got plenty of hrs of gameplay so far.\n\nEDIT: Progress wiped after installing the game on my Steam Deck. I did select sync with cloud save, I guess it did not. Contacted Saber and Steam, will see if I can get a previous save restored....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Demo review.\n\nAt some point your character says his greatest fear is \"failure.\" THAT ladies and gentlemen is heresy. Space Marines have no fear.\n\nThis is at best a $39-$49 full price game and $29 sale purchase. Not clue how it ended up being $80 (Japan 9800yen) that is like 3 bags of rice for 3 month. Another example of moodern day mediocrity. Demo is also very poorly optimized, maybe it is just shitty kernel easy anti cheat. Definitely on guard about upgrading this to full version because right now its just so poorly optimized. It runs very smoothly on ultra but when you get swarmed and you are suppose to get swarmed the game starts to laaaaaaaaag.\n\nStory is not bad, so if you like SP stuff definitely worth getting this for SP coop but at a much lower price.\n\nFun story but maybe wait until bigger sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Never have space marines felt so pathetically weak.\n\nThis is a melee rhythm game first and foremost. If you want fun gun-play the devs think you should go somewhere else. In the first game you felt like a tank slowly blowing your way through hordes of xenos. In this game you feel like a hippo trying to do ballet. The whole red to dodge and blue to parry isn't fun, it's just tedious. I want to tear my way through hordes of aliens but even the weakest enemies take so many bullets or weapon swings to kill. The controls feel unresponsive instead of feeling chunky, probably due to the players tiny health pool and paper mache armor. Also, they failed to capture the 40k feeling. I mean most of the space marines you see die go out like freaking chumps 1v1ing bottom tier tyranids. The story is... really not great. It's a whole lot tell and not do. There's a lot of name and title dropping, but if you remove that the game just looks and feels like knock-off Star Wars.\n\nUltimately this game commits the worst sin a video game can commit. I got bored half way through the tutorial.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Data collection that you cannot refuse and cannot be turned off in the menu.\nThe size of the game is absolutely ridiculous.\nI wanted to play online, but Demi doesn't allow it. I'm correcting myself, it does allow it, but only after about an hour of playing.\nNowadays? Not being able to skip the campaign to get to the online content?\nWell, some people like not having a choice, as you can see. \n\nIf you buy the game, you get +- 5-8 hours of gameplay and a million DLCs. Sad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I bought the full version a while ago, but had to refund it due to the game constantly crashing during the intro cinematic. \n\nI wanted to give it another chance, perhaps they fixed it? Nope, still freezes and crashes in the same place. I tried disabling the Steam overlay, limiting framerate, but to no avail.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After playing the demo, I have removed this game from my wishlist. It's just Warhammer themed World War Z, but unlike this game I can actually get a high framerate in World War Z",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Demo won't start. And I have a one year old high end PC with updated drivers.\nKeeps crashing. If the full game has the same issues, I might as well remove it from my wishlist.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The demo feels like a console game. Which is like describing a movie as 'Hollywood.'\n\nIt's NOT a compliment, it is utter condemnation. The demo is vapid and forgettable. Good thing I can now remove the game from my wishlist.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Thanks for the demo but not my game. Big FU for that epic games stuff that auto installed without asking me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ran quite well on my 3080 but coulnd't play the demo with my friends who already own the game, they downloaded the demo, and it said they couldn't play the demo since they already own the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has good potential, but still needs a lot of work. Sound jitters, bugs, desync, bugged animations, units straight up teleporting around - all of that in a demo, so presumably in a most polished part of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "border line unplayable\nlag can make ping reach into the thousands crashes 24/7 and most of the time just wont open",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "and again a game with only that s*** TAA or s*** upscale from nvidia or s*** upscale from amd. congrats.\n\nread slowly devs(all of them): i just want to play games on NATIVE with no AA or maybe FXAA.\n\nagain:i just want to play games on NATIVE with no AA or maybe FXAA\n\nokay for the third time, just to be sure: i just want to play games on NATIVE with no AA or maybe FXAA\n\ni hope the full game will have fxaa, or refund will come.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Demo doesn't even get past the first screen on my beefy ass rig a year after the game launched you're joking lmao",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If the demo is anything like the full game, I will not be buying it. Took forever to 'load resources' then it tried to play the into and it crashed out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "- Extremely limited mouse sensitivity options, there is only one generic sensitivity slider for the mouse and it is not even that precise, the difference between 3 and 4 on a slider of 20 feels huge. There are at least four different sliders for controller sensitivity, this could be done for mouse settings as well just as a baseline. Allowing decimals of sensitivity would greatly improve these issues as well.\n\n- No proper ultrawide support, I am on a 32:9 aspect ratio and the field of view is atrocious, everything is ridiculously zoomed in, even on max fov settings. There are posts about this dating over a year ago and it has still not been attended to.\n\n- Stable performance relies on upscaling, not the biggest deal as it is smooth enough with balanced upscaling settings, but it just feels like a lazy alternative to actually optimizing the game's performance.\n\n- Data collection is forced as far as I can tell.\n\n\n\nI couldn't bother to play more of the demo with these issues at hand and I definitely don't see myself purchasing the full game if these problems persist. As you may be able to tell, I am stingy about sensitivity settings and the ultrawide issues just make this game entirely unplayable for me currently.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "86 gb demo that takes 5 minutes to hit the main menu and then crashes during the opening cutscene",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The first prerender cutscene is a not passable boss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unsharp, blurry, over-sharpened mess\n\nThe game looks like absolute garbage. It’s blurry and unsharp yet somehow still over-sharpened enough to make your eyes hurt and cause motion sickness. After a while, your eyes ache from all the ghosting, sharpening, and unstable clarity. In intense scenes you can barely tell what’s happening. Some areas in the game are actually beautiful but then completely ruined by this disgusting upscaled, over-sharpened TAA.\n\nThere’s no way to disable this trash TAA. No SMAA, no FXAA, not even an off option. You can only slightly counteract it with DSR or similar techniques since the game never lets you raise the internal resolution. This reduces the worst of the blur a little but introduces new problems such as over-sharpening, graininess, and ugly visuals. The game also has severe texture streaming issues. Some textures are already present but low quality, while others take a noticeable moment to fully load or pop in late, even on hardware that is more than capable. This is absolutely unacceptable.\n\nThe game crashes constantly. You can’t alt-tab without risking a crash and sometimes it dies the moment you press something.\n\nEasy Anti-Cheat blocks any chance of fixing it yourself. Let us use ReShade and turn off the in-game AA so we can apply a proper SMAA or Anti-Aliasing that actually works.\n\nTo whoever at Saber thought it was a great idea to encrypt the engine or game config files so players can’t tweak anything, I hope your sleeves slide down every time you wash your hands.\n\nThis game is held back by lazy, clueless devs at Saber Interactive. Learn how to properly implement anti-aliasing like SMAA1x or SMAA2x or just let players disable it. Learn how to deliver real image quality, not this blurry shimmering mess, and make sure it scales from Full HD to 4K.\n\nFrom now on, whenever I see your studio’s name on a game, I’ll stay far away. You’re one of the reasons modern gaming sucks!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Watch the intro from SM1 vs SM2 going to tell you most of it...\nUtterly just panyfull experience in almost every single way just on starting cutscenes and it only gets worse after that\njanky ass quicktime garbage movement and combat in other words the whole game iTS WORSE THAN MOBILE\n\nEven had to turn the shitty generic shitmixed music completely off to hear ANY THING ELSE and i could barely hear the music because it was all so badly mixed together ONLY to find out its all literaly throwing things in the trash sounds....\n\nStory and characters are beyond belief its worse than the most trash made for women pron novels tier writing\npainful painful painful.... very very bad game no space marine whatsoever just loose hammers and war sprayed on lightly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "HW nároky někde ve stratosféře, nezvládne zobrazit ani intro po spuštění hry",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wont let me play it, my friend owns the game but the game thinks i own it, but i don't. \"ita maka me sad :'(\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I read the reviews and tried it out less than ten minutes in I saw how cumbersome combat felt",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What is this Demo man, it keeps crashing or freezing..\nYou really would think that someone would put some work into a DEMO TO PROMOTE A GAME.....\nEdit: it works on lower settings, even with a decent PC that should be able to run it on ultra, but there are some glitches and bugs here and there, sync not being propper, etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shitily optimised and buggy game. Managed to trigger a bug where I was able to move out of bounds and my character was 2m off the actual ground. Barely runs on a mid-range graphics card. Absolute UE5 slop, can't recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i really want to play this but the audio skips so badly i feel like im only getting half the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty enough, but clunky. tried to multiplayer for the demo, was not able to stay connected with other person in demo for a full mission. \n\nKinda underwhelming.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant even play, it says i own the full game when i dont",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had more fun in customizing my guy then playing the game",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}