{
  "positive": [
    {
      "review": "i love this game, even in it's perpetual current state. but axolot games is literally dead, they're broke and have no staff. this game will never get the next big update, it may get small updates until the remaining team gives up tho.\ntl;dr: if you like the game in it's current state, buy it knowing that it's all you'll get. if you don't like it, don't buy it.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I've had this game for nearly its entire life. I love making things in creative and enjoyed when survival first released. However in the last few years I can't help think its been abandoned. The most recent update was from December 5, 2024, and the one before that over a year earlier. This was my first steam game and the reason I got steam. I think of it as Minecraft creative mode but with gravity and cars. The physics sometimes make no sense which is frustrating to say the least, if you want to make something complex. The recent update tried to fix this but not much noticeable difference. I recommend this game because I've had a lot of good times on it, but it is in no way a complete game and wish the devs would give us something new.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I've been playing this game since it first came out and it is one of the most fun vehicle building games I have ever experienced. I love the survival aspects with the building, it really makes for a fun playthrough. It gets a little lonely with just myself, therefore it's much more fun with friends. Chapter 2 has been in development since 2020, FIVE years ago! Now that's a long time for one update, and the community knows it. It takes a long time for updates most likely because not many people play it still. It is sad to see one of my favorite games become so desolate with the player base. I know there are still people who have fun in this game, but it isn't what it was like five years ago. The vision for this game is incredible, and I wish they added more content to survival so the endgame doesn't come so quickly where there is no incentive to keep playing. I always hit a roadblock with this game because I don't have any motivation to keep playing since there is nothing left to do besides screw around in creative. For new players this game is pretty daunting mostly because they don't get into it enough to really have fun with the mechanics of the game/survival mode. Overall very awesome game, 8/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game so much. It has so much potential to be one of the top survival games EVER. But seems like the devs gave up or ran out of money. Sad :(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "scrap mechanic is a game that i've playes for hundreads of hours Throughout the years and it just never gets boring.\r\n  the combination of block and weird shape props makes building in this game a ton of fun, i'd also like to point out that you can build on the ground something that allows you to build not only cars but also structures like houses, wich separates this game from any other engineering games i have played\r\n i would recomend this game to anyone who likes cars, buidling, or just having fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, requires quite a lotta time. though sadly not getting updated as much nowadays\r\nstill doesnt mean its bad though, its a really neat game nomatter how dead it had been",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing utterly amazing, realtime sandbox coop player or even single player \r\nif you like building shit buy this game no questions asked seriously just buy this shit its fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although this game is taking quite a while for one of the biggest and most demanded updates to the survival mode, it is incredibly fun to play with friends and build up your farming empire. I haven't looked too much at sandbox or challenge mode but I can say that survival is for certain worth it. Can't wait for the next update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its such a cute, and well thought game that has so much potential. Im so mad that the devs wont release chapter 2",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun Game I lay Multiplayer and enjoy it works great Solo and Multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Scrap mechanic is AMAZING. There's not many live sandbox games, let alone ones that are good. Survival is awesome, the challenges don't feel childish, and sandbox mode is so fun to play around in.\n\nI do have one complaint, you cant join a multiplayer server if you aren't the host.\n\nSo nostalgic, 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the amount of creativity is amazing, and with Mods in game, the only limit truly is your imagination",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very good, i play it almost every day, i only play creative because i dont understand survival, i got lots of mods and some very nice creations, i just did an flying train that works perfect and super fast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best live building games out there. The Survival game mode is challenging but fun, you feel like a real engineer trying to solve problems using machines. However the lack of communication from the developers and updates that are few and far between really tarnish the games potential. Still I would recommend as I've had lot's of fun with and without friends, the community makes really good mods to compensate for the lack of updates. I have learned a lot about planning projects and even with game engine limitations for big creations it's still possible to enjoy the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very good game to let your creativity flow through. I have created lots and it is rewarding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is easy to learn, altough late game progression is a bit tough at times. I'm less of a fan of creations exploding just because they can, however that might be me pushing the physics engine to it's limits in creative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i been playing even before survivle. this is peek. only realised now it was still in dev stage. recomend 1000% but devs have droped it by the lookes of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome sandbox game. You can build some really cool contraptions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall it's great as abandoned as it actually is but its good nonetheless, minus a few kinks here and there but the game hasn't been updated in a while so any bugs may as well be a feature at this point. Still a great game, I'm personally able to play survival for hours because of limitations that creative doesn't give you, it just keeps me entertained and great to play with friends... if they enjoy the game of course.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game helps me with almost everything xD creativity, imagination, physics, engineering, designing, logics and etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extraordinary! The physics of the game are so good that you can have some good bugs, but also some really bad ones, it hasn't crashed for me yet. I recommend, if you want to make some interesting and stylish builds, you can install mods from steamworkshop, there you can also find some personal builds [:I]----",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best sandbox game ever made, even the survival mode is kind of decent and is a lot of fun, sadly its extremely not replayable, because you only have so much options to do, but the freeplay mode is so much fun, especially with friends.\n\nSadly the devs are either extremely slow or completely abandoned the game, and its rare to see an update.\n\nThats said i would  still recommend it to everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have every played. I really recommend to anyone. Its so much fun especially with a friend and there's loads of mods on steam to try. You can make basically anything you want.\n\nOnly problem is the developers have basically abandoned the game.\nI still hope they make chapter 2 survival tho.\n\nIf you are considering getting it, trust me, its worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game playing with you're friends. its creative building flyers and cool cars. overall a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um dos jogos mais divertidos que já joguei na minha vida. É o filho perdido de Minecraft e um engenheiro. Graficos bons, todos os modos de jogo são maravilhosos, relativamente fácil de entender, e principalmente uma ótima maneira de soltar a imaginação sem nenhum limite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "because using mods and bugs are really funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yo, I just dove into Scrap Mechanic, and it's like Lego on steroids where your \"flying car\" either soars like a dream or yeets you into orbit before exploding into a scrap confetti funeral—pure chaotic engineering bliss! Multiplayer survival has me and the squad scavenging for bearings while Farmbots turn our base into Swiss cheese, then we counter with a turret truck that backfires and grills us alive—dark comedy gold as our avatars ragdoll to hell.\n\nCreative mode's a god-mode fever dream: 400+ parts for walking mechs or shark-bait submarines, mods pumping thousands more for infinite \"why did I build this?\" moments. Physics are hilariously unforgiving—one loose piston and your masterpiece becomes a tombstone pile. Community's grinding at ~700-1.7k dailies in 2025, mods keeping the undead alive while we pray for that eternal Chapter 2. 9/10. Builds forever—your sanity gets scrapped first!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak game, but I personally only use Creative mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved the free build because you can build cars and stuff and also the survival fighting off bots in the middle of the night it is so fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I suck at designing useful things out of trash, but it is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can build fun and stupid creations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been waiting 10 years to play this game, finally got a PC and its all i wanted it to be and more",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Extreamly fun with friends and easy to learn!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game. I don't have enough hours in it to say properly tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my best chill games if you like to build & program things you will love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tout le jeu est très complet c'est un sandbox comme on l'imagine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and full of stuff to do and make. like minecraft? this is like that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My son (age 9) and I have played Scrap Mechanic together for a while now and it is fun and easy to learn for both of us. I prefer the survival mode to play through the game content but my son really enjoys the creative mode as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game it is really addicting and fun so i like playing it alot because i learn how to become a mechanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One Of The Best Games I Own, I realy recommend it to All Tipes of players! It is worth the price!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun but still waiting for update",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game it just needs to release season 2 soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PLAY THIS GAME ITS SUPER DUPER GOOD TAN OTHER GAMES BUT NOT ALL OF THE OTHER GAMES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game as is, sadly abandoned",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i think the game is cool but updates take a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it let me do all the thing i could never do just dosent update enog",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game!!! Me like build advanced car:D\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just give it a try, if ur into engineering u'll love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and entertaining!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its pretty good once you dounloade a few mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "try being nomad i is uper fun :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun but can be hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HELLO! HEllo ello llo lo lo o ......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a bunch of clankers in here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very interactive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Use scrap to be a mechanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game lots of fun i have like 2000 hours on best game ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good good I enjoyed this very much much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, i have 1800 hrs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing, just amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good recommmend 8---",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please finally make update 2 come out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love it but it ned a opdate the dev team",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you like makeing things you will like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoy playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like minecraft x roblok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goood game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game :0",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, i have 1800 hrs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been waiting 10 years to play this game, finally got a PC and its all i wanted it to be and more",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good would download if i were you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "u goo boo loo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LIKE CAR AND ROBOTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "at the time that im posting this i have 69 hours on scrap macanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if you like survival fanasy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "engineer simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fnuny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Build a Boat BUT BETTER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recomened this to engineers",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "amazing game go play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like turtles would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Squidoodley",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even a hi from the devs would be niceTvT\nahhhhhhhhhhh",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awsome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ленивые суки блтяь",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Needs updates on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-PRETTY COOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its aight",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a good and fun game as it is, albeit incomplete. The sandbox and building aspects to it give you quite a lot of potential play time and content, and I don't regret purchasing or playing the game at all.\n\nOn the other hand, I don't think I'd recommend to someone to purchase it. It's kind of in Schrodinger's Development right now. It may or may not be abandoned? Axolot doesn't seem to make the slightest effort to reassure the community that it still is in active development, much less than in what capacity. Perhaps they are all working diligently in the background to finally release Chapter 2, but I find it to be an awfully strange and suspicious management decision to basically go radio silent for the last few years. There was a small update almost a year ago, but I don't necessarily find it convincing that the game is still being worked on.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "this game was regularly being updated a few years back but now it's dead. the developers seemed to have just left it. now mods are really the only way to enjoy the game because there's no new official content. also the state they left it in is unbalanced and buggy.\n\nunless you really like mods don't buy this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just a warning: I've own this game since it came out. No meaningful updates for almost 10 years.\nDON'T BUY THIS GAME!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm going to be honest, this is only negative because of one crucial thing:\r\nThe lack of communication.\r\nThis game is great, the community content is amazing, and the past few updates have been good, but there's little to no communication about the status of the game, not even updates that address bugs that people experienced.\r\n\r\nChapter 2 for the main part of the game has been announced several YEARS ago, and it's no closer than what we have now. It's great when it does releases, but just like most other games that enter EA, it's a gamble.\r\n\r\nIf you do want a game with some stuff to do, go for it, but if you want to try out the fun challenge mode, or play the countless community made maps, creations, and so on, go for that too, it's amazing.\r\n\r\nThere's been little from the developers, and keep in mind, it's been nearly a year since the \"physics and wedges\" update, and a year before that since the last major update, and 9 months before that. It's... not been great in terms of release, sure it takes time but a \"hey we're still here\" every once in a while would be nice. Addressing issues on the steam forums would be nice every once in a while for the community.\r\n\r\nThis game could go above and beyond, but it's only going above at the moment and not beyond.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Six years since the survival mode update, which came out around Covid.  Six years.  Six years of promises that haven't been delivered, six years of stringing us all along, without a word... this game isn't just dead, by this point it's kinda just a scummy way for them to skirt the early access polocies without actually putting forward significant updates to stay afloat.  I do not recommend this game because not only is the dev communication poor, but it's unfinished and may never -be- finished.\n\nAnd six years later?  I highly doubt it will be.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is basically abandoned at this point. the entire game feels so empty and it takes ages to do anything in survival. I would only get it if you intend not to play the survival mode.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "though making vehicles in fun.. the game doesnt have a whole lot to it, and it seems to have been abandoned by the devs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly this is an abandoned game. It was fun, but felt incomplete. There were promises of updates and an actual release to move out of Early Access, but it seems as though Axolot Games doesn't care about this game anymore. What a shame",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the developers probably noticed people stopped playing this game after they switched focus to implementing a survival mode so they leaned toward a sunken cost fallacy as a reason to stop development, either that or there were issues within the company causing people to leave or something like that\n\nthis game does have a plethora of steam workshop mods and you can still have a lot of fun in the creative sandbox mode, just don't expect any further official updates\n\nI am personally avoiding projects by axolot games at this point",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun to play, but stuck in eternal Early Access...\nNo Updates or Devblogs throughout 2025, so it's probably safe to consider the game abandoned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR: This game hasn't received meaningful official content for 5+ years, existing content is very rudimentary or unpolished, and radio silence for the past 2+ years.\r\n\r\nScrap mechanic is a solid physics sandbox with survival elements, but most of those survival elements are either extremely basic or are desperately missing polish, i would suggest this game if you're the type to experiment with the game's physics and build cool stuff, but if you're coming here with hopes for a full-blown survival game, you'd have better luck playing modded Minecraft.\r\n\r\nThe game's content problem is partially mitigated by the small, but very persistent modding scene, which has a fair amount of modifications to the game's survival mode with their own features (Shoutout to Crashlander devs and 00Fant) but that means the game, as it stands now, is SINGLE-HANDEDLY carried by the community.\r\n\r\nNot to mention that Axolot hasn't given us a SINGLE devblog or progress report SINCE 2023 at the time of this review, so i wouldn't hold my breath waiting for new stuff to drop. I'd even go and say you should not buy this game unless you're fine with what content the game offers right now, as the game's future does not look bright at this time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game itself is decent but I cannot recommend since it's still early access after 9 years of release. Updates are coming so slow that you will die of old age before the game is ready.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Sadly Disappointed.....    **NO AUDIO**\n\n   I have had this game wishlisted for awhile and finally decided to add it to my library. Installed without any problems and loaded things up with excitement about my upcoming experience. The title screen shows and after a few seconds I notice something major is missing.....SOUND! I checked the \"Audio\" tab in the settings which turned out to be a joke since all it has available is a Volume slider for overall volume control and that was currently maxed out already. I then turned to graphical settings in case there was a setting for muting the audio if the game was not in \"focus\"... nothing. \n\n*During this time I had been in a Discord Voice Chat with friends and could hear just them just fine so I knew my audio device was working properly.*\n\n   Realizing my issues must be outside of the game, I did a quick Google search for answers. Those consisted of \"Re-install the game\" or \"Verify the file integrity through Steam\" as well as a couple deeper suggestions, the first was going into my PC's Sound Settings under its' advanced section and specifically setting the audio output device/verifying the correct device was selected already. This yielded no results as everything was properly set up. The second deep suggestion was to go into my Command Prompt and dive into the files coding to adjust a numerical value away from 0. Although I know computers, I tend to avoid using a Command Prompt method because when done improperly, things tend to break further..... so I did not explore this method but instead opted for the Verify Files and then finally Re-install. ALL these methods resulted in no fix and me playing an audioless game.\n\nNow the game itself seems fun, for the 30 mins I had it open. I loaded into a survival map and was greeted with a tutorial of sorts but the audio issue made things sorta difficult since my only que's were visual when progressing forward and I could not tell when I was being attacked by enemies. Then my game began to stutter and lag..... bad... I had to close out of the game and it even lagged Steam so hard that the Steam UI broke and I had to restart Steam. This was the straw that broke the camels back.... I had been fiddling with everything for about 2 days and the only route I had not taken was a path I (as a consumer) should not need to take in order to play a video game. All in all I wish I could have enjoyed this game like it was meant to be enjoyed but my experience has been horrendous, the game has been Early Access since 2016, updates seem to have stopped, and ultimately I will be requesting a refund.\n\nP.S. I checked my Audio drivers and verified they were up to date",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game has been dead fore nearly 2 years we have been drip fed small amounts of content over the past 2 years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no updates, or update news or dev news. its been abandoned dont buy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the game is abandoned. no communication for a full year I like this game but I cant recommend anyone buy an unfinished game that will never hit full release. If they do release the full version with meaningful updates with new enemies and areas I will come back and change the review. I love the survival and engineering side of this game I just wish the devs didn't abandon the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a fun game until you finish a warehouse, after that playing by yourself is boring, yes you can play with friends but its laggy for most people playing with someone else. Would like another update",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I watched a LOT of this on youtube and really liked it. I remember watching before survival was a thing. That was a few years ago, and I haven't really kept up since. I downloaded thinking I would get a fresh play though, but now I see that it is the same exact game that I watched like 5 or 6 years ago. I feel sad. I have seen this in other games, like Ark Survival, and that game barely got an AI riddled slopfest of an update after a really long time of waiting. I feel this is going to be the same. They have spent so long on this update that there is very little they could do to make their players happy.\n\nUnless the next update is a HUGE update, don't bother, and just feel pity for the people who loved this game just to get heartbroken. I pray this stops happening in games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Developers abandoned the game long time ago. Quick money grab. \nWould not recommend it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "We made a vehicle where the passenger seats are on the hub of the wheels and made my friends ride in it. I was really looking forward to the turret and story expansions.\n\nThis had the bones to be the real successor to the crown in this genre and they just took their ball and went home. Sad.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't get how this game can get a positive review, \nit's unfinished, it's bugged, it's not supported for at least 3years. \n\nFully dead game, DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Abandonware at this point. We got 1 update in 2024 and it was a rework of physics no update in 2025 as of writing 11/27/25",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst game I have ever played, It is far from worth it. Don't buy this please, there Is little to none graphics!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's an amazing game, but now it's abandoned by the developers",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is abandoned.\nNever gotten out of Early access...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So, this game seemingly has huge potential. Creating your own cars and machines. However after the first 3 quests. Nothing happens. It is a complete sandbox game. If that is your thing. Buy it. If that isn't for you. Don't buy it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dev team have perished from this earth dont buy my dead gran can make a game faster than them",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "amazing game, abandoned by devs.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i  was Realy looking foward to playing this game i was kinda disponted about it but oh whell",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "update! WHAT UPDATE OH some wedges I WANT MINING!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is never going to be finished",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game is abandon ware",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead game",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game is never going to be finished",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dead game, don't buy.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "is a bad game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "update! WHAT UPDATE OH some wedges I WANT MINING!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is abandoned",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Abandonware.  \n\nDo not buy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "abandonware? where devs go?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Abandoned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "abandonware",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "robo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i did enjoy this game as seen in how long ive played buy im sad no updates that matter in survival in 5 years... i cant even enjoy it anymore i did pay full price and miss playing it like 5 and a half years ago im gone you lost me...:C",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nah",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's been over five years since the game got an update with any meaningful content.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "I wanted this to be a positive review, but untill the devs say otherwise, the game IS abandoned. No updates or finished game have been announced in over a year. As an early access game I expected the devs to be more active, not treat it as a finished game. Go support other games that actually still care about their product reaching its end goal.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "It's a good and fun game as it is, albeit incomplete. The sandbox and building aspects to it give you quite a lot of potential play time and content, and I don't regret purchasing or playing the game at all.\n\nOn the other hand, I don't think I'd recommend to someone to purchase it. It's kind of in Schrodinger's Development right now. It may or may not be abandoned? Axolot doesn't seem to make the slightest effort to reassure the community that it still is in active development, much less than in what capacity. Perhaps they are all working diligently in the background to finally release Chapter 2, but I find it to be an awfully strange and suspicious management decision to basically go radio silent for the last few years. There was a small update almost a year ago, but I don't necessarily find it convincing that the game is still being worked on.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Hate to be too harsh, but unfortunately, it's a \"no\" for me. The really disappointing part is by the time you've played the survival mode long enough to even understand the game play loop, you're over the refund time limit. It has such promise and checks a lot of the survival/build games I usually love. But...there's nothing to do. Everything is super grindy and the mechanics seem purpose-built to take too long. Growing crops means you have to stand guard at your base. Watering crops requires you to plant near water, but still only water maybe 2 tiles of crops each bucket. And you can't drink water or eat corn, so you have to collect corn, place it on the ground, and wait for the cows to eat it? I dunno'...could be great. 10 years in early access? May never happen.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "As much as it pains me to do so I can’t recommend this game solely due to the developers and their lack of communication.\n\nThe game is totally awesome and really revolutionary in many ways. As an engineer myself it’s so satisfying to build things, but after 10 years of EA other games have caught up.\n\nIt is completely unacceptable to ghost your audience who have given money and years waiting for this game to come out. Myself as a gamer does not want to support devs like this especially when terrible companies like EA exist and they at least update their audience.\n\nLike I said this is the saddest review for me to write as I absolutely love this game and have been waiting for years for the smallest of update but nothing. Companies like this should not exist period.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "No updates. No communication. Likely whole game is forgotten by devs.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Just a warning: I've own this game since it came out. No meaningful updates for almost 10 years.\nDON'T BUY THIS GAME!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's been over five years since the game got an update with any meaningful content. (Adding a new block type after four years and doing some minor physics tweaks don't really count). The core game's pretty solid, but don't buy the game expecting it to ever get finished.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "fantastic idea for a game....that died due to developers just not being experienced enough to know their limits. high physic games like this are tough to code, even more so to develop. building a budget for a game is hard enough, adding in high physic requirements just makes it that much harder to predict.\n\ndead game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "a great game with a lot of potencial the problem is the lack of updates and information from the dev team we have not heard something from them in almost a year and the last real update was more then a year ago we need an update or a message just anything in the current state the game is fun in sandbox and boring in survival with a lack of things to do after a warehouse\nwe need more",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "this game was regularly being updated a few years back but now it's dead. the developers seemed to have just left it. now mods are really the only way to enjoy the game because there's no new official content. also the state they left it in is unbalanced and buggy.\n\nunless you really like mods don't buy this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It was a rather interesting game years ago that showed promise, but development seems almost dead at this point for something that's still in Early Access. There's been a whopping one update over the last almost two years, so I'd recommend a hard pass on it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As long as this game doesn't get more updates, I do not recommend buying. It is currently abandoned. With no information released from the creators for a whole year ish.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really liked this game, and had been hanging out for it to be finished for years. \n\nBut it really feels like its now not going to happen, devs are non contact with the community, and its been a LONG time since any meaningful updates have come out. \n\nDon't support them any longer by buying this game unless they do a 1.0 \nIt really feels like its on life support. or just outright abandoned and they just dont want to admit it in the hopes some more money comes in.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "No update or response from developers for ages now. Even when they will release the update that we are waiting for for YEARS, i will not bother anymore. Patience has its limits",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm going to be honest, this is only negative because of one crucial thing:\r\nThe lack of communication.\r\nThis game is great, the community content is amazing, and the past few updates have been good, but there's little to no communication about the status of the game, not even updates that address bugs that people experienced.\r\n\r\nChapter 2 for the main part of the game has been announced several YEARS ago, and it's no closer than what we have now. It's great when it does releases, but just like most other games that enter EA, it's a gamble.\r\n\r\nIf you do want a game with some stuff to do, go for it, but if you want to try out the fun challenge mode, or play the countless community made maps, creations, and so on, go for that too, it's amazing.\r\n\r\nThere's been little from the developers, and keep in mind, it's been nearly a year since the \"physics and wedges\" update, and a year before that since the last major update, and 9 months before that. It's... not been great in terms of release, sure it takes time but a \"hey we're still here\" every once in a while would be nice. Addressing issues on the steam forums would be nice every once in a while for the community.\r\n\r\nThis game could go above and beyond, but it's only going above at the moment and not beyond.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don't waste your money on this game! The devs don't care if you bought into it, and are NOT doing anything to reassure those who allready purchased it!\n\nThis is abandoned, and allthough the framework for a game was amazing, with developers who don't care, just takes your money and run...!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Scrap Mechanic is a fun game to play with friends. The live building system is also cool to play around with, and as a non-builder type of player in most sandbox games, I even enjoyed making some builds, the survival has a bit of a challenge to it, but not really, for the most part it doesn't really offer a whole lot, and in my opinion aside from some challenge runs you chose your self, its not really that repayable. The challenge mode, I feel, is the best thing about the game aside from creative, as this allows you and your friends to make challenges for each other, or use the Steam Workshop to find a challenge to play together, for me challenge mode is similar to Minecraft adventure mode, its nice to find adventure maps, and just play through a crafted world. \n\nAll of this said, I can not recommend the game due to the lack of communication from the developers, on promised updates, that have not been talked about for around a year by this point. \n\nThe last update we had was on December 5, 2024: Physics & Wedge Update, which was a decent update, but small, and lacked much substance. where are the new bots, the new structures, caves, etc? There's so much promised and missing.\n\nEdit: It would seem the developers filed for another patent.\nUnable to find the Patent for the game, but look up Crew Command, and the game comes up. There isn't much known about it right now, from what I can find. If anyone can find a link to the patent itself, feel free to link it in the comments, and I'll add it to my edit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Needs more time. The crafting is janky, the resoureces costs are way too high. If you lose a vehicle theres no easy rebuild. If the seat is destroyed on your car it full throttles off into the sunset. there is no early game suspension. the starting tires are not round and so they regulkarly spin in place. The tutorial car you build is worse than walking and serves to show you both how tedious building is, and how hard life gets the second you think for yourself and modify the vehicle (by adding a second engine and 4wd the car gets worse). Dear devs: If the basic tires and motors are useless, dont add them to them game to pad out progression, give me working parts so I can explore and enjoy the game. This is just drwing out the early game so I cant refund",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Six years since the survival mode update, which came out around Covid.  Six years.  Six years of promises that haven't been delivered, six years of stringing us all along, without a word... this game isn't just dead, by this point it's kinda just a scummy way for them to skirt the early access polocies without actually putting forward significant updates to stay afloat.  I do not recommend this game because not only is the dev communication poor, but it's unfinished and may never -be- finished.\n\nAnd six years later?  I highly doubt it will be.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is basically abandoned at this point. the entire game feels so empty and it takes ages to do anything in survival. I would only get it if you intend not to play the survival mode.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "though making vehicles in fun.. the game doesnt have a whole lot to it, and it seems to have been abandoned by the devs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly this is an abandoned game. It was fun, but felt incomplete. There were promises of updates and an actual release to move out of Early Access, but it seems as though Axolot Games doesn't care about this game anymore. What a shame",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the developers probably noticed people stopped playing this game after they switched focus to implementing a survival mode so they leaned toward a sunken cost fallacy as a reason to stop development, either that or there were issues within the company causing people to leave or something like that\n\nthis game does have a plethora of steam workshop mods and you can still have a lot of fun in the creative sandbox mode, just don't expect any further official updates\n\nI am personally avoiding projects by axolot games at this point",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Scrap Mechanic is a sophisticated and flexible 3D vehicle building engine that refuses to be okay with being that. It's most fun when just making little contraptions in creative mode, and despite an eternal early access, every other mode detracts from that central perfect core. Challenges prevent you from making anything interesting and are mostly used for multiplayer maps with minimal building. Survival doesn't complement the creation gameplay at all and just forces you to grind to get to the actually interesting part. Combat is thoughtless and janky. Farming is uninteresting. Base defense is either tedious or effortlessly solved. Exploration is not rewarded and the procedural worlds are samey. This could have been good, and there's fun to be had, to be fair, but Scrap Mechanic does not succeed as a cohesive whole and everything early access has piled atop it has smothered clever core gameplay.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've tried several times to get into this. But I just can't.\n\n-Tutorial/onboarding is basically non-existent\n-Unintuitive controls\n-Camera movement makes me feel physically ill\n-Needlessly grindy\n-Still in early access after 9 years",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Abandoned with no communication.\n\nThe devs of this game have basically given up on either updating the community or the game entirely, refer to their twitter where they have a post apologizing for chapter 2 of the survival mode not releasing in 2023 and instead in 2024... It is 2025 and their last tweet was almost a year ago; sadly this game could have been awesome slowly building up a giant moving base, gathering resources-- but since the attention started drying up they just left it to rot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I watch people play this game, I thought to would be fun to play myself so I bought it. It was fun for the 20 minutes I was allowed to play it until it crashed, corrupted my save file and every world i tried to create afterwards(story or creative) just gave a text box saying error then booting me to the home screen. I am very disappointed that this was the experience I was given because the game really looked fun. oh well guess its just one of those \"watch others play it\" kind of games",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I loved the game when it first came out and love crafting and creation but its empty... Its been years since new content was added, the slopes and physics update was a cop out... I swear if i could ask for a refund i would, dont buy this game unless they release a massive, and I mean MASSIVE update. VERY DISAPOINTED.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun to play, but stuck in eternal Early Access...\nNo Updates or Devblogs throughout 2025, so it's probably safe to consider the game abandoned.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Its not done and has been updates last a long time ago. the devs seem to not communicate what their plan is. so i would have not say I don't recommend it currently. the game has potential, so i hope i can change my review in the future.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "terrible game   it runs poorly has broken physics, and incredibly restrictive building and none of this has been fixed or meaningfully improved in the 10 years the game has been sold for",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: This game hasn't received meaningful official content for 5+ years, existing content is very rudimentary or unpolished, and radio silence for the past 2+ years.\r\n\r\nScrap mechanic is a solid physics sandbox with survival elements, but most of those survival elements are either extremely basic or are desperately missing polish, i would suggest this game if you're the type to experiment with the game's physics and build cool stuff, but if you're coming here with hopes for a full-blown survival game, you'd have better luck playing modded Minecraft.\r\n\r\nThe game's content problem is partially mitigated by the small, but very persistent modding scene, which has a fair amount of modifications to the game's survival mode with their own features (Shoutout to Crashlander devs and 00Fant) but that means the game, as it stands now, is SINGLE-HANDEDLY carried by the community.\r\n\r\nNot to mention that Axolot hasn't given us a SINGLE devblog or progress report SINCE 2023 at the time of this review, so i wouldn't hold my breath waiting for new stuff to drop. I'd even go and say you should not buy this game unless you're fine with what content the game offers right now, as the game's future does not look bright at this time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game itself is decent but I cannot recommend since it's still early access after 9 years of release. Updates are coming so slow that you will die of old age before the game is ready.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "10 Years later and it's still an unfinished game with zero updates for years.  \nIt's clear now that this was cashing in on an idea that was never meant to be finished. I'm really disappointed that this studio walked away.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly Disappointed.....    **NO AUDIO**\n\n   I have had this game wishlisted for awhile and finally decided to add it to my library. Installed without any problems and loaded things up with excitement about my upcoming experience. The title screen shows and after a few seconds I notice something major is missing.....SOUND! I checked the \"Audio\" tab in the settings which turned out to be a joke since all it has available is a Volume slider for overall volume control and that was currently maxed out already. I then turned to graphical settings in case there was a setting for muting the audio if the game was not in \"focus\"... nothing. \n\n*During this time I had been in a Discord Voice Chat with friends and could hear just them just fine so I knew my audio device was working properly.*\n\n   Realizing my issues must be outside of the game, I did a quick Google search for answers. Those consisted of \"Re-install the game\" or \"Verify the file integrity through Steam\" as well as a couple deeper suggestions, the first was going into my PC's Sound Settings under its' advanced section and specifically setting the audio output device/verifying the correct device was selected already. This yielded no results as everything was properly set up. The second deep suggestion was to go into my Command Prompt and dive into the files coding to adjust a numerical value away from 0. Although I know computers, I tend to avoid using a Command Prompt method because when done improperly, things tend to break further..... so I did not explore this method but instead opted for the Verify Files and then finally Re-install. ALL these methods resulted in no fix and me playing an audioless game.\n\nNow the game itself seems fun, for the 30 mins I had it open. I loaded into a survival map and was greeted with a tutorial of sorts but the audio issue made things sorta difficult since my only que's were visual when progressing forward and I could not tell when I was being attacked by enemies. Then my game began to stutter and lag..... bad... I had to close out of the game and it even lagged Steam so hard that the Steam UI broke and I had to restart Steam. This was the straw that broke the camels back.... I had been fiddling with everything for about 2 days and the only route I had not taken was a path I (as a consumer) should not need to take in order to play a video game. All in all I wish I could have enjoyed this game like it was meant to be enjoyed but my experience has been horrendous, the game has been Early Access since 2016, updates seem to have stopped, and ultimately I will be requesting a refund.\n\nP.S. I checked my Audio drivers and verified they were up to date",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashes on start up\nGame crashes during game play\nDevs haven't posted up dates in a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I remembered I bought this maybe 2020 had lots of fun but it felt completely unfinished. It was ok, the basis were there and I thought to myself that they had been pushing many updates and it was going ok so I could trust the guys. \n\nThe truth is that there is like 1 update a year and they mostly have been reworking stuff that was already there.\n\nThe truth is that they went to work on something else and abandoned the game.\nI feel that each developer should have just one allowed early access game available at a time.\nI wish I could refund this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game has been dead fore nearly 2 years we have been drip fed small amounts of content over the past 2 years",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Has not received a major update for YEARS. Total abandonware. Will probably change my review if the next story chapter comes out, but at this point its very unlikely",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game until you finish a warehouse, after that playing by yourself is boring, yes you can play with friends but its laggy for most people playing with someone else. Would like another update",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I watched a LOT of this on youtube and really liked it. I remember watching before survival was a thing. That was a few years ago, and I haven't really kept up since. I downloaded thinking I would get a fresh play though, but now I see that it is the same exact game that I watched like 5 or 6 years ago. I feel sad. I have seen this in other games, like Ark Survival, and that game barely got an AI riddled slopfest of an update after a really long time of waiting. I feel this is going to be the same. They have spent so long on this update that there is very little they could do to make their players happy.\n\nUnless the next update is a HUGE update, don't bother, and just feel pity for the people who loved this game just to get heartbroken. I pray this stops happening in games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had so much promise, and I really enjoyed what the game was shaping up to be. Unfortunately abandoned. Shame",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "We made a vehicle where the passenger seats are on the hub of the wheels and made my friends ride in it. I was really looking forward to the turret and story expansions.\n\nThis had the bones to be the real successor to the crown in this genre and they just took their ball and went home. Sad.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really don't get how this game can get a positive review, \nit's unfinished, it's bugged, it's not supported for at least 3years. \n\nFully dead game, DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Dont bother, I just checked in since they release a physics update...its still terrible. Chapter 2 has been coming out next year for the last 4 years.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Abandonware at this point. We got 1 update in 2024 and it was a rework of physics no update in 2025 as of writing 11/27/25",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game I have ever played, It is far from worth it. Don't buy this please, there Is little to none graphics!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's an amazing game, but now it's abandoned by the developers",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Abandoned project, its been 5 years since last decent update.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is abandoned.\nNever gotten out of Early access...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "seems  abandoned they have shown a bunch of stuff they worked on and they could of added some of it but didn't the last update was a year or so ago if you want to even call it that they added wedges and so bug fixs thats it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has a lot of potential but the fun isn't in the game yet.  Here are some recommendations for what's missing.  \r\n\r\nI didn't know that the whole point of the game was to build farms and turn in resources before Googling.  I thought it was to escape the planet due to the crashed ship at the start.  The ship should have more of a point after it's repaired.   Maybe have it land on top of the mechanic's workshop to power it rather than finding a second battery.  A later quest to lead you to the first depot and explain how to connect to the turn in point would be helpful.   \r\n\r\nI want to build, not grind resources.  The first car's parts should be handed to you as a reward at the top of the first tower.  Rusty blocks from the haybots could use a 5x multiplier.   I had to Google how to progress since it didn't seem right the game didn't provide the blocks to make the first car and i wasn't sure how else to get them.\r\n\r\nUpgrading the constructors doesn't give access to new blocks.  It should start with a smaller set and unlock more blocks with a short tutorial with blocks given.  \r\n\r\nThe timer for when bots attack a farm should be labeled Farm Assault Incoming and have a mini reminder in the corner of the UI.   \r\n\r\nComponents are what bars progress in the game.  That make sense that you need that type of system.  However, it shouldn't be needed for building chests.   \r\n\r\nScrap wheels shouldn't make a vehicle that is slower than run speed.   They shouldn't be \"good\" but they also shouldn't make you want to skip vehicle making in favor of waiting for better parts.   I'd love a traction control part in the future too.   \r\n\r\nBlueprints are a must, especially if respawning tape bots can hold your only vehicle hostage.  I ended up stopping at the point this happened because getting more parts without a vehicle wasn't worth it let alone all the armor blocks I now knew I needed.   Before Googling (again) I fully expected character armor because it's not conveyed that the game is designed for vehicle combat.\r\n\r\nPerhaps I couldn't find it, but the water dispenser (vacuum pump) seemed to distribute water randomly on crops.  Some kind of sprinkler or controlled distribution system is needed.   \r\n\r\nMost other resources are in need of a method of automation.  I didn't find a way to automate oil extraction but perhaps vehicles that drive on the ocean floor are expected.  I didn't see an extension ladder or something to reach the higher honeycomb pieces.   Sure I can make a staircase, but I wouldn't want to drive around with that protuberance on my vehicle all the time.   \r\n\r\nI could not find a key modifier to make a 2d plane vertical.  Many times I wanted to make a wall but had to build it one layer at a time.   \r\n\r\nKeep up the good work, I look forward to when building feels fun and challenges exist but don't throw you into the deep end and hold your stuff hostage.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, this game seemingly has huge potential. Creating your own cars and machines. However after the first 3 quests. Nothing happens. It is a complete sandbox game. If that is your thing. Buy it. If that isn't for you. Don't buy it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dev team have perished from this earth dont buy my dead gran can make a game faster than them",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}