{
  "positive": [
    {
      "review": "Ive been using Borderless Gaming mainly for old Beta Minecraft, and it works fantastic!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i dont understand the negativity, i think it works fantastically. its worked with almost every single game i tried it with. good job dev!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game just for playing FEAR. It works great. I can't wait until they have frame generation and upscaling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stardew valley. oh and minecraft i guess. oh and rpgmaker games i guess. oh and suddenly this app actually becomes quite useful :D\n\npeople are complaining about the new UI cause people are scared of what's new. yes going from the old tiny white box to the new appearance took some getting used to but it's nothing to be worried about if you're considering getting the app for the first time now. it's quite intuitive with lots of options should you want to really customize your experience with these windowed games. preeetty neat :>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is SUCH a useful tool. Thank you for making this I've already used it for 3 games so far and it works great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please remove Shift-Tab as the default hotkey for Toggle Taskbar, this is a common shortcut in many word editors and programming IDE's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for running older games with no borderless window mode",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This shit fixed my HDR mode (always go black screen few sec after switch to other game). This also make you feel like using Samsung Ark's Multi View with 4 Inputs. AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH WHY DIDNT I NOTICE THE APP LONG AGOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically essential for some applications haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "useful sometimes, not every game works though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fully let's you play games on borderless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works great for the souls games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it works. does what i want it to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does its job and well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It fixed minecraft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works perfectly fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alt tab👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "clutch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New update makes it so that the program crashes after force-quitting Steam. This was a necessary feature for a user with multiple Steam accounts. Now I can't play Black Ops Zombies borderless without having to pay for the program twice.\n\nEdit: Solution provided by developer, I have no issues anymore.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I cannot believe that I am here writing a negative review of Borderless, this app is a complete joke now and doesnt even work since the v1 launch, i am baffled... all i used this for was iracing and it wont even fully borderless the window it constantly leaves the windows task bar at the bottom.... why did yall do this....\n\nDevs have fixed thanks a bunch Andrew!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It works really well for what it is. The original legacy version is still available on the developer's website so you can get that free version. Honestly, I feel that 7 dollars is fair for a piece of software that you get to use forever and get free updates for, especially since so much productivity software out there now exists on a subscription model. I have no problem supporting this dev and this piece of software.\n\nNot every update works perfectly, some bugs come through, but Andrew actually cares about the quality of the product and is pouring time and effort into making it the best it can be. There are ways to offer feedback and submit bug reports if something breaks.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Game changer software. Literally. This has substantially improved the way I play almost all of my favorite games - I can get more immersive experiences in racing / simulator games, such as ETS2 and Asseto Corsa, or more real estate in strategy games with a lot of UI elements. If you have more than one monitor and want to easily configure your games to run across multiple displays, this is the go-to software.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I don't understand why people don't like this this review is posted after the UI update but I have owned it for a year now and it works perfectly I would recommend it to anyone!!!!!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Worked and works great on my end\n\nFallout 3 used to not work with it and now works, for instance\n\nDev is reactive on issues\n\nPlease join his Discord if you have any issue, that's clearly better mannered than dropping a negative detail-less review, unless you consider yourself an entitled customer needing to anonymously crush people online instead of an helpful human being...\n\nCheers!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Thank you dev for taking criticism to heart and adding back dark mode for free. It's not just for aesthetics, it is 100% an accessibility feature.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It works. Solved a display issue with an older game that was just a black screen. And it'll come in handy for other games.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Dev was helpful in fixing my problems.\n\nHowever, I still think the need to have an entire website to convert the legacy config files is a bit much, but alas, that do how it be. Also, if the new look is upsetting, there's always the legacy version.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Might as well make this now since this update's dropped. After a bit of time playing around with it I understand how it now works. \n\nMy problems are that the app doesn't take affect if the game/window is already open before you launch Borderless Gaming. You have to go in and re-enable the profile OR use the 'Make Borderless' option, which isn't as seamless as it used to be, and that was a big draw for me. You used to just have to open the app whenever and it just worked. One-time setup and you were good forever. Now it's a lot more tedious. Using the 'Make Borderless' option is annoying as well because the tasks keep changing position making it annoying to click.\n\nThere just seems like right now, there's some core functionality that hasn't been implemented yet. Being able to seamlessly make 'profiles' with a single button or just working regardless of the order in which the apps were opened is no longer a thing. Visually, the update is great. I love the look of the new U.I, but it seems like in every other way things have moved backwards.\n\nI still recommend it however because I'm sure these things will be addressed eventually. I use this app all the time so I'm hoping things get fixed soon.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Jesus fuck, is the dev intentionally making the app eye-bleedingly miserable to look at? Every visual update makes it more fucking unpleasant to use... And one of the recent updates also nuked all of my settings, so that's fun. If it were pretty much any other software, I would be livid.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive been using Borderless Gaming mainly for old Beta Minecraft, and it works fantastic!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i dont understand the negativity, i think it works fantastically. its worked with almost every single game i tried it with. good job dev!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this app and its done nothing but improve. There are tons of improvements made to it and thanks to this program I am able to play all my older games and some new ones that for some reason do not have Borderless windowed on them which makes no sense on this setting. I 100% recommend this and many other user that claim that it is broken or worse are people that do not like change. Well worth the money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this needs to be sold in a bundle with mafia 3, only way to get that game to not screen tear \n\nsimple interface this is goated",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "EDIT: Okay apparently this app changed my default resolution for a game and that's why it wasn't stretching the window to be proper windowed fullscreen, once I fixed that it seems like it's working now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ever since they revamped the entire software, it feels unbelievably more smooth to tweak games now. If you are often tabbing out and a game doesn't support borderless windowed, this software is a very good way to fix that. I like using it for Minecraft.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Guys you gotta join the discord, he told us part of the dark mode was to support rewriting code to this latest version because, as most of you clearly do not know, nothing in this world is free.  Also, you don't have to buy it you lunatics. Why would you care what the thing looks like when it's running in the background? Feels pretty petty, but to each hs own.  All this to say, keep up the great work! I bought the product years ago and recently used again to play through DS2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is SUCH a useful tool. Thank you for making this I've already used it for 3 games so far and it works great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best money spent on steam so far\r\nI don't like the new interface i prefer the old one, just one mouse click to do the job but this app is super useful for a very affordable price.\r\nBuy it even if you are not sure you need it, because at some point you will!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The recent updates have really taken this to another level.  It is a MUST have if you run multiple monitors esp if you game on your non primary monitor.   Does everything I could want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this software!! Helps me customize the size of different games on my ultra wide monitor. Some games just dont support this format and only let you play in window mode with border, which is sometimes awful, because it has the border on top but cuts something off on the bottom. With borderless gaming I can play games in whatever size I want, and it works so well! Kudos to the developer <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the only way to play Mafia 3 DE on high fps. Fullscreen on that game locks the fps to 60. Turning off Windows fullscreen optimization doesn't actually help, it shows high fps, but feels like 60.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As of 1.0.23 the software seems to be working properly.  The developer seemed to try and work fast to get things working right.\n\nOld Review:\nThe latest version as of this review (1.0.19) does not function properly.  Some games that were previously working are not anymore.  The interface may look nice, but it should be functioning as well as the old version.  I mean the Maximize button doesn't even function for me.  The entries on the Profiles side are excessively large.  My opinion is that these should be the same size as the running applications side, at least until you expand them to change settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Przydatny program w sytuacji gdzie gra nie wspiera lub nie działa tryb Borderless/ W oknie bez ramki.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im so glad I got this! Borderless is really handy when certain apps and games dont have a borderless fullscreen, and I hadnt had any issues with this for a long time. I enjoy the dark mode too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After couple of updates, things has gotten better, but not everything works, the feature of resize and move window after borderless still doesn't work properly, and right click to make windows borderless/or combo key still reduce the size of original windows when toggle between mode. What this does better than Lossless Scaling is It's nice to have borderless windows without the black bars, and the scaling option of LS cost some performance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The app itself is excellent and delivers real value. That said, communication from the developer could be handled much better. In the 1.0 update, the “What’s Next” section mentioned features like FG coming to the app. Later, the developer made Dark Mode free but announced that future features would instead be paid, which caused understandable confusion. Rather than blaming users for “expecting too much,” the developer could have avoided this entirely by clearly stating from the start that future features would be released as paid DLC.\n\nThe app deserves recognition for its quality, but the developer’s approach to communication along with dismissive replies and locking down the comment section hurts trust with the community.\n\nOverall, I recommend the app because it’s very good, but I hope the developer improves transparency moving forward.\n\nEdited to be more concise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The new GUI is a huge improvement. It looks great, clean, and much easier to navigate than before. \r\n\r\nBorderless Gaming has always been a must-have utility for me, letting games run smoothly in borderless windowed mode without the usual alt-tab issues or resolution headaches. \r\n\r\nWith this update, it not only works reliably but also feels modern and polished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EDIT:\n\nSeeing as the developer has made dark mode free now, I will change my review. However, I still think it was wrong of them to charge for it at all. Their excuse of using the funds of its sale to fund development doesn't make sense when you consider the potential number of people who would have paid the $1 for it... Just make themes and sell those. Or better yet, commission some artists to make themes for it and give them a cut of the profits.\n\nSorry for the attitude in my original review, but I was really upset that it just didn't want to work anymore for some reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helpful program that has worked great for me for years. Redesign looks nice and everything works well for me.\n\nWould like it if profiles had icons if possible. The profile list might look a little better if the grey line was removed, the + was brought up in-line with the profile name text (before or after), and a little additional padding added to the left of the text as it sits to close to the edge of the rounded box on the left side compared to the top. The window/process list looks on the left looks more how ideally the profile list would look. All my opinions of course. Overall happy with the new look even if most the new features I may never use surely some people are thrilled about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EDIT: dark mode was added to the base program now and I'm able to use it with the rest of my system settings as such. changing to recommended again.\n\nintroducing a massive UI in conjunction with a paid accessibility feature (Dark Mode) has made me not recommend this after years of use.  I will not be paying for an accessibility feature that should be there in the base app.\n\nDepending on how my experiences continue with the recent updates, I may just outright remove this app from my library",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EDIT BELOW\n\n(The new update is rendering the programm useless. I personally dont care about the dark mode as DLC, but all the applications that i ran in borderless through this software are now just being windowed. I have no more use for this program until this issue is fixed, and will now look for alternatives that actually work.)\n\nThe issues have been fixed  and everything works how it used to be/how its supposed to. Thank you for the efforts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Entire reason I purchased this was to be able to play Ragnarok online fullscreen in 4k.  Worked perfect. \n\nNow here comes the 1.0 update, it had broken it where if you choose to 'make fullscreen' it doesn't work, but if you make a profile with the game it seems to work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would really appreciate if this had less than 3 updates a day, but it does what it says. even if at a bit of a steep price for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New update overrides my Windows Accessibility Settings with a blinding solid white and then wants to charge me $1 for dark mode DLC. Screw everyone with vision issues, eh?\n\nEdit to respond: Pre 1.0 release it did not override windows high contrast accessibility themes.\n\nEdit 2: Windows 10 -> Ease of Access -> Vision -> High Contrast On\n\nEdit 3: Update enabled dark mode. Changing review to positive now that I don't have to use a third program to get this one readable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Updated 9/10/2025 - I gave it a second chance and  it is not so bad.   BG works differently, but once I used the optional \n\"dark mode\" and found out that the old version had profiles for each game existed and could be imported to the new version, I was less negative about it.  The author responded to my nasty review and was kind enough to attach a link to the new BG guide.  So, I'm giving it a \"thumbs up\" this time..\n\n9/9/2025 - What the $%#^&* was the reasoning behind the GUI layout change.  BG's GUI looks like junk and is confusing to use. (the actual program is probable still great).  Thank God someone posted in the forums a link to a legacy version.  Its free and I'd recommend it over this current monstrosity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good product that works most of the time. It works often enough to be worth the small price. The new update broke some things, but the developer is already working on it.\n\nAlso, people should learn that a review section is not the place to complain about what are obviously temporary issues from an update. Either wait for a fix, or go on the correct forums to search for more information regarding your issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have used this on both nvidea and amd cards to setup a custom resolution for my PLP monitor setup. Unfortunately it does not work on all games however even taking this into account I would still buy it again. \r\n\r\nThankyou to the devs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1.0 broke functionality for multiple games that have a console app open alongside them under the same process.\nDeveloper has addressed the issue and is in the process of fixing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend this software. It is not often I use it, but when I do, is it absolute bliss to have. \nAs a person with multi-monitor setup, do I love borderless mode on games, and prefer it whenever possible. \nThis program flawlessly removes the border, and if you set the game windows mode with the same resolution as your monitor, will you effectively be playing fullscreen borderless window.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really helpful for when games do not like being in borderless full screen.\r\n\r\nAlt-tabbing is something I value, and this software allows me to do that.\r\n\r\nWould recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does what it says on the tin and it makes multitasking on multiple monitors so much easier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seeing this program at mixed had me confused as it's already a relatively simple looking and functioning software, but most of the negative reviews are either stupid or feel uninformed.\r\n\r\nI've used Borderless Gaming on and off for years now. I had stopped using it for a while after getting an ultrawide monitor as I didn't want to run games in full screen as frequently, opting for another, older program that allowed me to borderless window games in set positions. With the 1.0 release of Borderless Gaming, I was finally able to uninstall that archaic feeling and looking piece of software as everything I need is here. From setting specific window sizes to offsetting the window down to the pixel, hiding taskbar to keeping the cursor bound to the game. It's all here in a nice little, easy to use package.\r\n\r\nI couldn't recommend this program enough and the only reason my \"hours used\" in Steam is so low is because I run it through the EXE so it doesn't clog my Steam activity. Well worth the money spent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the new look. It's easy to understand and works the way It should. I use Borderless Gaming to play in ultrawide without using Nvidia Surround. I retain my HDR and high refresh rate as well. I'll set the game to windowed mode, set the window size to custom, and set my resolution to 7678 x 1440p. There's an easy drag option to set it up across the three monitors. \n\nI'll list a few games that I found worked well using this method. Rocket League, Star Wars Squadrons, Disco Elysium, Dragon Age Veilguard, Oblivion Remastered, and SWOTOR. My setup is 32:9 aspect ratio when using all three monitors as one, and most games only support 21:9 at most so I'll sometimes see stuff I'm not supposed to lol. \n\nDisco Elisium for example you can see the UI assets tucked away on the sides that should be hidden if only using 16:9 to 21:9 haha.  Or Dragon Age Veilguard, when you're in the dream like section, The dream filter only extends to 21:9 lol. So I can see the rectangle filter stop half way and each side of my left and right monitors lol.\n\nAnyways great software, it allows me to play some games in ultrawide without going through the tedious process of disabling DSC on my monitors and enabling Nvidia Surround. Which locks all three monitors to 120hz with no HDR. I highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ole reliable. up there with joy to key and fraps. couldn't live without it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☑ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☑ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☑ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ 10 / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☐ 9\r\n☑ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for running older games with no borderless window mode",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "makes stuff borderless. Works with almost every game ive used it on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game just for playing FEAR. It works great. I can't wait until they have frame generation and upscaling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stardew valley. oh and minecraft i guess. oh and rpgmaker games i guess. oh and suddenly this app actually becomes quite useful :D\n\npeople are complaining about the new UI cause people are scared of what's new. yes going from the old tiny white box to the new appearance took some getting used to but it's nothing to be worried about if you're considering getting the app for the first time now. it's quite intuitive with lots of options should you want to really customize your experience with these windowed games. preeetty neat :>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please remove Shift-Tab as the default hotkey for Toggle Taskbar, this is a common shortcut in many word editors and programming IDE's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This shit fixed my HDR mode (always go black screen few sec after switch to other game). This also make you feel like using Samsung Ark's Multi View with 4 Inputs. AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH WHY DIDNT I NOTICE THE APP LONG AGOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gaming but borderless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fully let's you play games on borderless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically essential for some applications haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works great for the souls games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it works. does what i want it to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It fixed minecraft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does its job and well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works perfectly fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alt tab👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "clutch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New update makes it so that the program crashes after force-quitting Steam. This was a necessary feature for a user with multiple Steam accounts. Now I can't play Black Ops Zombies borderless without having to pay for the program twice.\n\nEdit: Solution provided by developer, I have no issues anymore.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I cannot believe that I am here writing a negative review of Borderless, this app is a complete joke now and doesnt even work since the v1 launch, i am baffled... all i used this for was iracing and it wont even fully borderless the window it constantly leaves the windows task bar at the bottom.... why did yall do this....\n\nDevs have fixed thanks a bunch Andrew!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It works really well for what it is. The original legacy version is still available on the developer's website so you can get that free version. Honestly, I feel that 7 dollars is fair for a piece of software that you get to use forever and get free updates for, especially since so much productivity software out there now exists on a subscription model. I have no problem supporting this dev and this piece of software.\n\nNot every update works perfectly, some bugs come through, but Andrew actually cares about the quality of the product and is pouring time and effort into making it the best it can be. There are ways to offer feedback and submit bug reports if something breaks.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Game changer software. Literally. This has substantially improved the way I play almost all of my favorite games - I can get more immersive experiences in racing / simulator games, such as ETS2 and Asseto Corsa, or more real estate in strategy games with a lot of UI elements. If you have more than one monitor and want to easily configure your games to run across multiple displays, this is the go-to software.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I don't understand why people don't like this this review is posted after the UI update but I have owned it for a year now and it works perfectly I would recommend it to anyone!!!!!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Worked and works great on my end\n\nFallout 3 used to not work with it and now works, for instance\n\nDev is reactive on issues\n\nPlease join his Discord if you have any issue, that's clearly better mannered than dropping a negative detail-less review, unless you consider yourself an entitled customer needing to anonymously crush people online instead of an helpful human being...\n\nCheers!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Thank you dev for taking criticism to heart and adding back dark mode for free. It's not just for aesthetics, it is 100% an accessibility feature.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It works. Solved a display issue with an older game that was just a black screen. And it'll come in handy for other games.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Dev was helpful in fixing my problems.\n\nHowever, I still think the need to have an entire website to convert the legacy config files is a bit much, but alas, that do how it be. Also, if the new look is upsetting, there's always the legacy version.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Might as well make this now since this update's dropped. After a bit of time playing around with it I understand how it now works. \n\nMy problems are that the app doesn't take affect if the game/window is already open before you launch Borderless Gaming. You have to go in and re-enable the profile OR use the 'Make Borderless' option, which isn't as seamless as it used to be, and that was a big draw for me. You used to just have to open the app whenever and it just worked. One-time setup and you were good forever. Now it's a lot more tedious. Using the 'Make Borderless' option is annoying as well because the tasks keep changing position making it annoying to click.\n\nThere just seems like right now, there's some core functionality that hasn't been implemented yet. Being able to seamlessly make 'profiles' with a single button or just working regardless of the order in which the apps were opened is no longer a thing. Visually, the update is great. I love the look of the new U.I, but it seems like in every other way things have moved backwards.\n\nI still recommend it however because I'm sure these things will be addressed eventually. I use this app all the time so I'm hoping things get fixed soon.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Jesus fuck, is the dev intentionally making the app eye-bleedingly miserable to look at? Every visual update makes it more fucking unpleasant to use... And one of the recent updates also nuked all of my settings, so that's fun. If it were pretty much any other software, I would be livid.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive been using Borderless Gaming mainly for old Beta Minecraft, and it works fantastic!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i dont understand the negativity, i think it works fantastically. its worked with almost every single game i tried it with. good job dev!",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "This used to be a simple little program that, most of the time, just worked. Now someone had the genius idea to reinvent it. It sucks now. The UI is worse, it doesn't work as well and the overall experience went into the gutter.\n\nGood job dev. Why though?\n\n\nedit: You should be able to get your money back if a dev does shit like this. This isn't even close to what I bought back in the day.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "this was so good before, the program actually did what it has to do and even started with windows when i enabled the option, not like now that even with the option it doesnt start alone and i have to do all over and over again each time i want to use it, the new design it's horrible to and it's so sad that ended up like this",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I have used this software for many years and bought it a little before the big revamp came out... and it is extremely buggy.\n\nSometimes the selected border that ive created doesnt work and the program just clips the game to be fullscreen to a random screen.\n\nHalf of the time the buttons dont work for some reason and the only thing ive managed to figure out to get them to work is to just spam the button im tryna click until the program decides to actually let it work.\n\nTabbing into the program never works. If i need to toggle the profile or edit it, i have to click on the program, let it for some reason automatically defocus itself, click on another program, then click BACK into the program, for it to actually listen to inputs.\n\nThis is a big shame. Resize raccoon works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No longer works for some people/systems. There are plenty of free Alternatives out there now",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A recent \"recreation/reimagining\" of Borderless Gaming has rendered the program far less intuitive and usable, as well as functionality and compatibility being reduced as a result.\nFind the legacy 0.9 version, or other free utilities instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Who the fuck is currently maintaining this software? This used to be perfectly fine program, so much so that I thought it was worth the money to support the creator. Now I'm out $7 which could've been a tasty meal and shit won't even launch. I may as well just mod Titanfall to have a windowless option.\n\n Addendum: Hey, me 5 minutes later, all I did was add -noborder -windowed to the Steam startup commands for the game. WHY DID NO ONE TELL ME IT WAS THIS EASY",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It used to work very well, to the point I could just forget I had it open.  As of the recent update, it doesn't work much of the time, or it works incorrectly.  I also often have to disable and re-enable apps to get them to be borderless.  The new UI also doesn't feel very intuitive.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Brother im sorry but this update is terrible. It was SO simple before, and now it's a convoluted mess. Idk why you thought this was a good idea.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it was good software but the 1.0 update made it suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It used to be better where you could set stuff to windowed, but they removed that for whatever reason and now it's worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why the stupid change no one asked for? It used to be perfect and easy to use, now its annoying, shitty and full of options menus addons no one asked for I hate it! who made this bs microsoft??",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didnt pay for you to fuck it up for no reason.\n\nNow i have to try and find the old version so i have something actually usable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Before a recent update I would have given this software a recommendation. But now the app design is bland and the functionality is at least halved.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "how could anyone think its a good idea to hide taskbar per default with Shift + Tab, are you insane? on Steam???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Glad I've turned off updates when I saw \"1.0.0 Beta\" and the well-known red flags: rewrite, feature creep, software bloat and so on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dev has taken a simple little program and made every single part worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never works for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "have no idea how to work this new update",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This app used to be simplistic and fantastic to use. Whoever designed this new UI has done a major disservice.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I used to recommend this software until they released a DLC to enable dark mode. Would not recommended.\n\nThe developer is also very much against criticsm as can be seen by their less than professional responses to a lot of other reviews. \n\nEdit: The developer has again chained their response to this review, the original response was even worse. I consider dark mode to be a core feature, especially when it comes to accessibility, therefore core features have been paywalled. The developer thinking dark mode is a purely aesthetic feature and has no accessibility advantage is quite frankly insane.",
      "voted_up": false,
      "votes_helpful": 139
    },
    {
      "review": "I used borderless gaming for a very long time on steam. \n\nToday I uninstalled.\n\nHere's the link for the legacy version https://legacy.borderlessgam.ing",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This used to be a simple little program that, most of the time, just worked. Now someone had the genius idea to reinvent it. It sucks now. The UI is worse, it doesn't work as well and the overall experience went into the gutter.\n\nGood job dev. Why though?\n\n\nedit: You should be able to get your money back if a dev does shit like this. This isn't even close to what I bought back in the day.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "1.0 is worse in every way, when compared to the Legacy version. It was worse in beta, it is worse on release. I'll be using the legacy version for as long as it works on Windows, and only then when I'm forced will I try 1.0+\n\n1.0, in my experience, doesn't detect running applications correctly, it doesn't refresh correctly, it doesn't default to the standard settings you'd expect from a Borderless Gaming application.\nIt just doesn't just work out of the box like the Legacy version did.\n\nEdit in response to dev:\nThe vnext beta option is Steam? Yes, I did. And I stopped using it after a dozen or so hours because of the same issues still present in the 1.0 release.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "Sometimes it works, but most of the times it fails miserably. There are better alternatives for free.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "The recent major update to Borderless Gaming was a major downgrade for me. Lots of issues were introduced: games aren't detected correctly, the list of applications doesn't refresh properly, and for borderless windowed mode to work correctly for some games, I need to un-toggle and re-toggle borderless mode for them every time I launch the game.\n\nNaturally, I don't expect Borderless Gaming to have been tested with every game ever. However, what I do expect is for the newest version to work at least as good as the legacy version, which is not the case.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "EDIT: The dev is lying, i only wrote that message one single time and there's no beta option inside Steam for this app, completely unprofessional behavior.\n\nEDIT2: The dev double down and keeps fighting against their customers like a child, completely unprofessional behavior, not going to change this review to positive. And he keeps lying, not everyone joined to beta in that time, it wasn't intuitive enough, and this is why this is a mess with tons of hotfixes, not enough testing or skill from the dev.\n\nFINAL EDIT: 9 updates in less than 3 days sounds like skill issue, keep acting hostile to your customers that's going to help you alot, and for sure is going to improve your public image, i bought this software at the price of 16ARS here in 2022 ( equivalent to 10 cents) the perfect amount of money according to your skill level, keep working buddy , i'll be waiting for more updates soon\n\n\"You have been banned from the Borderless Gaming Hub until 8 Sep @ 1:00pm.\nYou were banned by a Borderless Gaming developer.\"\n\nThis happened just for saying \"What a mess\" in a comment about a recent update.\nAnd honestly, it does feel like a mess. Just look at how many updates they’ve released only to fix issues. The developers don’t seem very open to criticism, even though the situation clearly could have been handled better. A beta branch would have been a much smarter way to test new versions and prevent this whole mess.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "bought this to fix a random fps dropping issue i have with starfield. this just makes the game unplayable. caused extreme screen flashing as it went from fitting on one screen to stretching across to my second monitor with black frames in between. i have epilepsy and this almost gave me a seizure.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "this was so good before, the program actually did what it has to do and even started with windows when i enabled the option, not like now that even with the option it doesnt start alone and i have to do all over and over again each time i want to use it, the new design it's horrible to and it's so sad that ended up like this",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Since this new major update not working as well. \nNeed to flick the profile off, on, off, on in order to get World of Warcraft to go into it's container.\nOn the way there it makes a real mess of the UI elements, everything is out of place.\n\nTLDR: This used to work really well, I was using for a week or so but I got unlucky and they broke it with this update.. Maybe hold off buying for a bit. I'm going to look for alternatives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Recent patch is broken, it stop working on the only game I use it for. Installed the legacy version and problem solved.\n\nEdit: Not a steam title, Soapbox Race world AKA Need For Speed World.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have used this software for many years and bought it a little before the big revamp came out... and it is extremely buggy.\n\nSometimes the selected border that ive created doesnt work and the program just clips the game to be fullscreen to a random screen.\n\nHalf of the time the buttons dont work for some reason and the only thing ive managed to figure out to get them to work is to just spam the button im tryna click until the program decides to actually let it work.\n\nTabbing into the program never works. If i need to toggle the profile or edit it, i have to click on the program, let it for some reason automatically defocus itself, click on another program, then click BACK into the program, for it to actually listen to inputs.\n\nThis is a big shame. Resize raccoon works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "New update makes it so toggle cursor doesn't work, and the program itself doesn't even work with all games anyway. Just skip it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i need to preface this by the fact that i've been a huge fan of this program and really appreciated all the work that has gone into it up until this point; but this last update is an absolute joke. this program unironically is worse than nothing at all at this point because i can't even use it in conjunction with open source tools that actually get the job done and don't insist on having a disgusting mobile interface.\n\nI dont understand why developers insist on taking perfectly good working products, dropping their pants and taking a giant dump on it for literally no reason. there's no money to be gained here, no one wins. the program looks worse, features do not work as they used to (cursor lock polling function mysteriously vanished, setting hotkeys is impossible with out \"control + x\" hotkey, i now have a fatal bug that crashes BG if i even try to fucking set a hotkey). so the only reason i even reguarly use this program has actually just been removed in an update that *checks notes*; quadruples the ram usage of the program, uses graphics rendering resources to render a disgusting metro interface literally no one requested, and a bloated ui with less visual clarity than ever before.\n\nSo you buy a product, it works, you enjoy it, then suddenly out of nowhere the developers decide to push an update completley bricking the functions you payed for, making it look like absolute garbage with no way to revert the versions and locking threads when people request to be able to use the program they payed for. i bought this program years ago and it's an absolute fucking shame that i am going to uninstall it and find an alternative because this is absolutely non functional and not even worth the price of free for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No longer works for some people/systems. There are plenty of free Alternatives out there now",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you just need to make a game borderless, use a free alternative of your choosing from here: https://www.pcgamingwiki.com/wiki/Glossary:Windowed\n\nAll the extra stuff BG can do either doesn't work most of the time or breaks other things. Like App Container making all your windows run in Composed Flip until PC restart. Composed Flip is the reason everyone was advising to run games in Exclusive Fullscreen for a long time since the introduction of DWM in Vista. App Container is DPI unaware too, meaning your game will scale wrong if you use that feature with anything but 100% DPI in Windows. Or if you override container exe's scaling to be done by an application. Muting in Background can get your games start muted by default and force you to manually unmute them. These are just some of the issues I had enough patience to experience.\n\nThe new UI is also terrible. Although I'm not usually bothered by those, but might as well mention it. Left half will be either empty or filled with apps you don't care about 95% of the time. And all the options are nested inside each app you added to the right half. Check out Lossless Scaling or Magpie to see how to do a decent layout.\n\nTo quote the developer:\n[quote]Pay for the software you use daily. Otherwise you end up with abandoned projects or lackluster results.[/quote]\nIronic, considering they achieved both of those feats with their paid programs.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A recent \"recreation/reimagining\" of Borderless Gaming has rendered the program far less intuitive and usable, as well as functionality and compatibility being reduced as a result.\nFind the legacy 0.9 version, or other free utilities instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Who the fuck is currently maintaining this software? This used to be perfectly fine program, so much so that I thought it was worth the money to support the creator. Now I'm out $7 which could've been a tasty meal and shit won't even launch. I may as well just mod Titanfall to have a windowless option.\n\n Addendum: Hey, me 5 minutes later, all I did was add -noborder -windowed to the Steam startup commands for the game. WHY DID NO ONE TELL ME IT WAS THIS EASY",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "wtf is this update? \nmade it a flashbang to try to get people to spend $1?\nthings are no longer split into 2 categories (who thought this was a good change???)\nnot detecting certain things anymore\n\njust go back what were you thinking?\n\nupdate: Developer doesn't deserve your money.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "App does what is stated, but has had so many issues since it's 1.0 update. And the dev gets very defensive about just about any constructive criticism.\n\nI recommend the legacy version, not 1.0.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "unusuble now. wont even launch on my computer after the most recent update.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've never had a program like this become just straight up inoperable after a long time on Steam nor any other platform. For all intents and purposes it is now useless.\n\nFor context: Worked great up until the last big patch, and now every time at launch it crashes consistently upon booting, effectively becoming entirely inoperable. It doesn't go to the taskbar, it doesn't appear anywhere except in my programs list of task manager buried under all my background processes. There is no way to force it open, there is no real reason for it's behavior, it just chooses to act like this at random. Ever since the update, I've had exactly TWO times I've been able to open and use it, with \"Use\" being a relatively strong word given that it works even less consistently than it once did. At least before, I could easily setup games in a plug-and-play way where I would never have to bother with them again, here simply getting the program to work properly and be usable is near impossible.\n\nIt's an incredible shame, truly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Until the latest update this app worked like a charm! everything I need in borderless I could.. well.. make borderless! Ever since the update however, not even half the apps/games I usually run in borderless with this app can be changes to borderless for some reason, rendering this app pretty much useless and waste of money. Please change it back.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This used to be an incredible piece of software but ever since the major update, the UI is considerably worse and I can't even use it on some games now.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Latest update/1.0 is worse in every way besides dark mode. Either revert or give me an option to go to legacy. it is just functionally worse, being harder to understand, use and automate.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Charging for dark mode is ridiculous.\nPutting accessiblity behind a paywall is unreasonable especially considering this came with UI overhaul.\nDo not buy",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The old version before the visual changes was way better, now it doesn't detect programs properly after restarting the program.\nIt is missing features that used to be there, and is over-complicated for no reason.\nIt used to be function over form and now it has shifted to form over function.\nI will be downloading the legacy version and uninstalling this slop permanently.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It used to work very well, to the point I could just forget I had it open.  As of the recent update, it doesn't work much of the time, or it works incorrectly.  I also often have to disable and re-enable apps to get them to be borderless.  The new UI also doesn't feel very intuitive.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Bought it for one game (Ragnarok Online classic) and then an update came and the .exe became undetectable. UI got much worse IMO.\n\nSearch for reviews of the game you're trying to maximize or you might waste money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I genuinely love the app. It was perfect.\n\nBut the new major update outright broke the app and has been holding my \"shift + tab\" keybind hostage, even when disabled in the settings.\n\nJust install the legacy version from https://legacy.borderlessgam.ing/",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've been using this for a few years now, it did what it was supposed to, but over time with update after update, games I could make borderless no longer work with the tool. The tool itself runs worse than before, causes issues when used such as game crashes. \n\nI can't recommend this, its honestly just not working. I'm now gonna have to find an older version of this program cause this 1.0 is just garbage with a sleek coat of paint.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's been super easy to use and compact for ages, this new update is so bloated and feels so much worse. I don't want some utility with 50 features I don't care about, I just want borderless windowed.\n\nedit: Response is ignoring the problem. The old version was very sleek and quick to use for its main purpose, the entire style is more chunky and makes it harder to do what it used to excel at.\nHighly recommend seeking alternatives.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great. App forcefully updated to a new version with a UI that's harder to use. I paid for this application without realizing who the developer was, and their previous \"ventures\" and scandals.\n\nI genuinely want nothing to do with the \"1.0.x\" updates l as they're genuinely poorly disguised beta tests.\n\nProvide users a way to access the old version of the application through Steam. Don't peddle them to your website.\n\nAlso, Dark Mode DLC? Seriously? Wild.\nOf course now it's been changed to some early access BS. No need to pay for that, the stable builds are early access enough.\n\nDo better. :/\n\n---\n\nIn order to show the developer's continued action at saving face, as well as their patterns of lying I'll provide a text log of what they've provided as an \"Official Developer Response\" below:\n\n>Dark mode is free\nNo, it wasn't. Don't even pretend it was. There's countless forum posts and \"official developer comments\" in reviews that legitimately prove yourself wrong. This is gross.\n\n>The old version is right here: (Links to website)\nSo, you completely ignored what I said in my review and then continued to peddle your website? Cute. Thanks, glad that my valued customer desires for a software's basic distrobution are oh so lovingly respected.\n\n>There's a guide on the new UI here: (Links to Steam Community post) \nThanks? I guess. I have no interest in using the software. I've already found my alternatives to what Borderless Gaming provided for me. I don't want to stumble around \"learning\" a new UI when the old one sufficed so much better, and was able to do more for less input. No matter how you spin it, that's always a better solution.\n\n>You can convert old configs here:\nOkay? Thanks again, I suppose?\n\n>The beta was available for a year. If you have an actual issue feel free to report it. Cheers.\nYeah, and the issues that exist with it, and that I reported over six months ago still exist. You legitimately just ignored them.\n\n\n\nWith all of that being said, avoid the product entirely. Avoid anything from the developer. Looking into their court cases where they attempted to profit off of stolen media in the music industry. Look into the countless lies (that have since been removed) for the software known as \"CompressorX\" or \"VERT\". Look into the countless lies that are still publically available on the Steam Reviews to this day. The developer is a low level con-artist that lacks any sort of ability to take accountability for their actions for as long as the grift they hold can continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Update 1.0 completely broke things that were working; half of the games simply won't launch, and the other half do so incorrectly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The app was so much better with the old design. It was minimalistic, easy to understand, and everything worked properly. Now, it's a copy and paste of every other design. It's all bubbly and spread out. It's like it's trying to make you look all over the place, so you don't notice the small things... like the fact that I bought the dark mode DLC and it no longer works. There's an unlock button that takes me to a Steam store page that says I already own this item. So I can't even get dark mode, because Steam says I already have it, but the app says I don't. After all is said and done, there should be a beta option for an \"Old/Deprecated Release\". I'm about ready to use my SteamCMD to manually downgrade the app and turn off updates. I would not buy this unless there's an option for the old version added.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it was good software but the 1.0 update made it suck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Last update ruined everything. The taskbar shows constantly, and there are FPS issues on the second and third monitors. Before, it was good — now it's useless. And you can't even go back to an older version.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just crashes, switches from window to full and back. You still need to Alt+Tab out, everything works like shit!! Do not buy!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not impressed with the \"update\" the old version was almost automatic. It just worked. go to the website and upload your old info it says. the link takes me to my hard drive. grrr. scrolls 15 pages down to find how to set it up from scratch. click on the 3 dots it says. option simply disapears. grr. reload. same thing, tries 3rd time. it worked? wth.    ok so it all seems to work now. GREAT, i cant click on anythin in game menu now. grr,. \ni disabled the program.\nNOT IMPRESSED\nAT\nALL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It used to be better where you could set stuff to windowed, but they removed that for whatever reason and now it's worse.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b] That's not what I paid for. If the developer has nothing else to do, they can make another program, but they shouldn't mess with something that already worked. [/b]",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "this was a good software, but now its completely useless, save your money and just suffer with basic fullscreen on older games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This program used to get a lot of hate for no reason, but this new update has made my experience much worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why more updates make it worse and harder to use?\n\nPLEASE give me back the old style that easy to use and not complex like the new one.\n\nWhy we need this app to be complex?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don’t understand why the free Legacy version was  [b]simply better [/b]:\n[list]\n* You didn’t have to launch Steam to start it.\n* It correctly remembered the apps you wanted to automatically make borderless. (Now I have to make multiple profiles that don't even work)\n* It was free.\n* It wasn’t full of bugs.\n[/list]\nOkay, this version looks better aesthetically. But why would anyone spend 10 bucks on this app with dark mode if it doesn’t even work properly? The only purpose of this app is to make any window borderless and do it automatically each time, aesthetics are purely optional. I bought it because I wanted to support the dev, but I'm disappointed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I should have had a positive review before. I sure as hell wont now. This program used to be my go to to solve nearly every single problem playing older games without multi monitor support or bad reactions to alt tabbing or even just trouble constraining cursors.\n\nNow the program is a bloated, ugly, difficult to use piece of trash that i had to abandon due to instability and the developers are responding to criticism by trying to quash it. I have rarely been so disappointed in a product I have owned for so long, there is no way to roll back to previous versions, I just want the program i payed for and have used for years. This kind of forced change should just be illegal.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why the stupid change no one asked for? It used to be perfect and easy to use, now its annoying, shitty and full of options menus addons no one asked for I hate it! who made this bs microsoft??",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didnt pay for you to fuck it up for no reason.\n\nNow i have to try and find the old version so i have something actually usable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EDIT: Developer refuses to add the previous version as a Beta option for those who want to downgrade. Just pointless gate keeping for no reason. Just find alternate software, there are and will always be free options.\n\nIf you want it, find the legacy version. The 1.0 version is not a good update at all.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1.0 UPDATE PATCH NOTES: We've actively made our UI brighter and we're gonna charge you for dark mode DLC. Enjoy!\r\n\r\nFuck off.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "YOU MADE A PAY WALL FOR DARK MODE, WHEN YOU CAN JUST EDIT THE JSON FOR A KEY THAT SAYS DARKMODE:FALSE, AND CHANGE IT FOR TRUE. YOU MONSTER. (Remember to save file setting to only read)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "STRONGLY ADVICE ANYONE TO AVOID THIS PRODUCT ,\nCURRENTLY NOT WORKING AS INTENDED\nFREE OPEN SOURCE ALTERNATIVE EXISTS\nDEV IS UNHINGED CRYBABY - reason below\n\n===========\nLast update ruined it, \n\nthe allignment of cursor within the application that is being borderlessified is not matching the screen anymore.\n\nStupid trend chasing.\n=======================\nexcerpt from community hub\n=======================\nYou have been banned from Borderless Gaming Community Hub\nYou have been banned from Borderless Gaming Community Hub by a Borderless Gaming developer for your post in \"Borderless Gaming General Discussions\":\nUsed to be so simple and worked\n\nNow fancy UI and ♥♥♥♥♥♥♥ functionality\n\nnice going\n\nBan Reason:\n♥♥♥♥ off\n\nWhile this ban is active, you will not be able to post or comment in the Borderless Gaming Community Hub or upload new content to this community hub.\n\nIf you believe this ban was issued by mistake, please contact Steam Support.\n\nThis is a permanent ban.\n\nlol",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Before a recent update I would have given this software a recommendation. But now the app design is bland and the functionality is at least halved.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dev has taken a simple little program and made every single part worse.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "how could anyone think its a good idea to hide taskbar per default with Shift + Tab, are you insane? on Steam???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Glad I've turned off updates when I saw \"1.0.0 Beta\" and the well-known red flags: rewrite, feature creep, software bloat and so on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Brother im sorry but this update is terrible. It was SO simple before, and now it's a convoluted mess. Idk why you thought this was a good idea.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never works for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "have no idea how to work this new update",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Used to be free on GitHub.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This app used to be simplistic and fantastic to use. Whoever designed this new UI has done a major disservice.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I used to recommend this software until they released a DLC to enable dark mode. Would not recommended.\n\nThe developer is also very much against criticsm as can be seen by their less than professional responses to a lot of other reviews. \n\nEdit: The developer has again chained their response to this review, the original response was even worse. I consider dark mode to be a core feature, especially when it comes to accessibility, therefore core features have been paywalled. The developer thinking dark mode is a purely aesthetic feature and has no accessibility advantage is quite frankly insane.",
      "voted_up": false,
      "votes_helpful": 139
    },
    {
      "review": "I used borderless gaming for a very long time on steam. \n\nToday I uninstalled.\n\nHere's the link for the legacy version https://legacy.borderlessgam.ing",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This used to be a simple little program that, most of the time, just worked. Now someone had the genius idea to reinvent it. It sucks now. The UI is worse, it doesn't work as well and the overall experience went into the gutter.\n\nGood job dev. Why though?\n\n\nedit: You should be able to get your money back if a dev does shit like this. This isn't even close to what I bought back in the day.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "1.0 is worse in every way, when compared to the Legacy version. It was worse in beta, it is worse on release. I'll be using the legacy version for as long as it works on Windows, and only then when I'm forced will I try 1.0+\n\n1.0, in my experience, doesn't detect running applications correctly, it doesn't refresh correctly, it doesn't default to the standard settings you'd expect from a Borderless Gaming application.\nIt just doesn't just work out of the box like the Legacy version did.\n\nEdit in response to dev:\nThe vnext beta option is Steam? Yes, I did. And I stopped using it after a dozen or so hours because of the same issues still present in the 1.0 release.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "Sometimes it works, but most of the times it fails miserably. There are better alternatives for free.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "The recent major update to Borderless Gaming was a major downgrade for me. Lots of issues were introduced: games aren't detected correctly, the list of applications doesn't refresh properly, and for borderless windowed mode to work correctly for some games, I need to un-toggle and re-toggle borderless mode for them every time I launch the game.\n\nNaturally, I don't expect Borderless Gaming to have been tested with every game ever. However, what I do expect is for the newest version to work at least as good as the legacy version, which is not the case.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "EDIT: The dev is lying, i only wrote that message one single time and there's no beta option inside Steam for this app, completely unprofessional behavior.\n\nEDIT2: The dev double down and keeps fighting against their customers like a child, completely unprofessional behavior, not going to change this review to positive. And he keeps lying, not everyone joined to beta in that time, it wasn't intuitive enough, and this is why this is a mess with tons of hotfixes, not enough testing or skill from the dev.\n\nFINAL EDIT: 9 updates in less than 3 days sounds like skill issue, keep acting hostile to your customers that's going to help you alot, and for sure is going to improve your public image, i bought this software at the price of 16ARS here in 2022 ( equivalent to 10 cents) the perfect amount of money according to your skill level, keep working buddy , i'll be waiting for more updates soon\n\n\"You have been banned from the Borderless Gaming Hub until 8 Sep @ 1:00pm.\nYou were banned by a Borderless Gaming developer.\"\n\nThis happened just for saying \"What a mess\" in a comment about a recent update.\nAnd honestly, it does feel like a mess. Just look at how many updates they’ve released only to fix issues. The developers don’t seem very open to criticism, even though the situation clearly could have been handled better. A beta branch would have been a much smarter way to test new versions and prevent this whole mess.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "bought this to fix a random fps dropping issue i have with starfield. this just makes the game unplayable. caused extreme screen flashing as it went from fitting on one screen to stretching across to my second monitor with black frames in between. i have epilepsy and this almost gave me a seizure.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "this was so good before, the program actually did what it has to do and even started with windows when i enabled the option, not like now that even with the option it doesnt start alone and i have to do all over and over again each time i want to use it, the new design it's horrible to and it's so sad that ended up like this",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Since this new major update not working as well. \nNeed to flick the profile off, on, off, on in order to get World of Warcraft to go into it's container.\nOn the way there it makes a real mess of the UI elements, everything is out of place.\n\nTLDR: This used to work really well, I was using for a week or so but I got unlucky and they broke it with this update.. Maybe hold off buying for a bit. I'm going to look for alternatives.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Recent patch is broken, it stop working on the only game I use it for. Installed the legacy version and problem solved.\n\nEdit: Not a steam title, Soapbox Race world AKA Need For Speed World.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have used this software for many years and bought it a little before the big revamp came out... and it is extremely buggy.\n\nSometimes the selected border that ive created doesnt work and the program just clips the game to be fullscreen to a random screen.\n\nHalf of the time the buttons dont work for some reason and the only thing ive managed to figure out to get them to work is to just spam the button im tryna click until the program decides to actually let it work.\n\nTabbing into the program never works. If i need to toggle the profile or edit it, i have to click on the program, let it for some reason automatically defocus itself, click on another program, then click BACK into the program, for it to actually listen to inputs.\n\nThis is a big shame. Resize raccoon works.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "New update makes it so toggle cursor doesn't work, and the program itself doesn't even work with all games anyway. Just skip it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i need to preface this by the fact that i've been a huge fan of this program and really appreciated all the work that has gone into it up until this point; but this last update is an absolute joke. this program unironically is worse than nothing at all at this point because i can't even use it in conjunction with open source tools that actually get the job done and don't insist on having a disgusting mobile interface.\n\nI dont understand why developers insist on taking perfectly good working products, dropping their pants and taking a giant dump on it for literally no reason. there's no money to be gained here, no one wins. the program looks worse, features do not work as they used to (cursor lock polling function mysteriously vanished, setting hotkeys is impossible with out \"control + x\" hotkey, i now have a fatal bug that crashes BG if i even try to fucking set a hotkey). so the only reason i even reguarly use this program has actually just been removed in an update that *checks notes*; quadruples the ram usage of the program, uses graphics rendering resources to render a disgusting metro interface literally no one requested, and a bloated ui with less visual clarity than ever before.\n\nSo you buy a product, it works, you enjoy it, then suddenly out of nowhere the developers decide to push an update completley bricking the functions you payed for, making it look like absolute garbage with no way to revert the versions and locking threads when people request to be able to use the program they payed for. i bought this program years ago and it's an absolute fucking shame that i am going to uninstall it and find an alternative because this is absolutely non functional and not even worth the price of free for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No longer works for some people/systems. There are plenty of free Alternatives out there now",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you just need to make a game borderless, use a free alternative of your choosing from here: https://www.pcgamingwiki.com/wiki/Glossary:Windowed\n\nAll the extra stuff BG can do either doesn't work most of the time or breaks other things. Like App Container making all your windows run in Composed Flip until PC restart. Composed Flip is the reason everyone was advising to run games in Exclusive Fullscreen for a long time since the introduction of DWM in Vista. App Container is DPI unaware too, meaning your game will scale wrong if you use that feature with anything but 100% DPI in Windows. Or if you override container exe's scaling to be done by an application. Muting in Background can get your games start muted by default and force you to manually unmute them. These are just some of the issues I had enough patience to experience.\n\nThe new UI is also terrible. Although I'm not usually bothered by those, but might as well mention it. Left half will be either empty or filled with apps you don't care about 95% of the time. And all the options are nested inside each app you added to the right half. Check out Lossless Scaling or Magpie to see how to do a decent layout.\n\nTo quote the developer:\n[quote]Pay for the software you use daily. Otherwise you end up with abandoned projects or lackluster results.[/quote]\nIronic, considering they achieved both of those feats with their paid programs.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A recent \"recreation/reimagining\" of Borderless Gaming has rendered the program far less intuitive and usable, as well as functionality and compatibility being reduced as a result.\nFind the legacy 0.9 version, or other free utilities instead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Who the fuck is currently maintaining this software? This used to be perfectly fine program, so much so that I thought it was worth the money to support the creator. Now I'm out $7 which could've been a tasty meal and shit won't even launch. I may as well just mod Titanfall to have a windowless option.\n\n Addendum: Hey, me 5 minutes later, all I did was add -noborder -windowed to the Steam startup commands for the game. WHY DID NO ONE TELL ME IT WAS THIS EASY",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "wtf is this update? \nmade it a flashbang to try to get people to spend $1?\nthings are no longer split into 2 categories (who thought this was a good change???)\nnot detecting certain things anymore\n\njust go back what were you thinking?\n\nupdate: Developer doesn't deserve your money.",
      "voted_up": false,
      "votes_helpful": 20
    }
  ]
}