{
  "positive": [
    {
      "review": "[h1]Undertale – The Game That Remembered My Soul[/h1]\n[b]Rating:[/b] ★★★★★ (10/10)\n\nUndertale is one of those rare games that transcends what a “game” even is. It’s an experience — magical, emotional, and endlessly personal.\n\nFrom the moment you start, it feels alive. Every action, every choice, every tiny bit of kindness or cruelty — the world remembers. And somehow, you end up feeling truly connected to it, as if your heart exists inside its strange, pixelated universe.\n\nThe story shifts and bends around your actions, creating something unique for every player. The characters are unforgettable — quirky, heartfelt, funny, and painfully human, even when they’re not human at all. The soundtrack is nothing short of legendary; every track carries emotion, nostalgia, and meaning that stays with you long after the game ends.\n\nYes, the Genocide route can feel repetitive at times — but it’s meant to. You’re not supposed to enjoy it; you’re supposed to feel it. It’s haunting, heavy, and powerful — a bold contrast that gives Undertale its soul.\n\nEverything in this game fits together perfectly: gameplay, story, music, and heart. There’s nothing missing, nothing wasted. Just pure, thoughtful design and emotion from start to finish.\n\n[hr][/hr]\n[h2]Final Thoughts[/h2]\nUndertale isn’t just a 10/10 game — it’s a masterpiece of empathy, storytelling, and creativity. It makes you laugh, it breaks your heart, and then it quietly reminds you what it means to care.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "Adventure game with familiar mechanics that is easy to learn, despite the difficulty from bosses to bosses",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Undertale is by no means a perfect or phenomenal game. It's simply a game with a singular vision that is executed well. In fact, so much so that its popularity exploded online\n\nWhat I personally enjoy about Undertale is its reactive and layered design and storytelling. The entire story is woven into the entire game. You can't just watch a cutscene movie online and understand the full picture. This is a [b]GAME[/b], from beginning to end. It shows how you can take narrative in a video game beyond just multiple endings or lore notes scattered across the world. It's in every corner and even the game's code. And most importantly, that story it's telling is heartfelt and genuine\n\nThe game wears its love of RPGs on its sleeve, and it loves to play with your expectations. A bit, a character, and a plot point can go far beyond what you initially think. Toby Fox wants you to keep on thinking, to keep on discovering, and to keep on imagining what else could happen. In a way, the game aims to fulfill that endless wonder you had when playing games as a kid. And despite the blatant inspirations and nods to other games, it manages to create an identity so unique that it inspired a generation of fans and creators\n\nAll of this, and even more, is what I believe makes Undertale truly special and a game that will stand the test of time",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "This is my first game that really went to exactly in my heard how many good storys were related with that game heh miss by those days anyway i still remember how that game influenced to myself as a child from those days when i launched this game for first time in my entire life damn it been 10 years a ago still cant believe in that thx for undertale and thx Toby Fox for everything honestly!!!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Undertale is so good, I recommend anyone to get it because it is definitely worth it, especially after finishing the Genocide, True Pacifist and Neutral Route. One of the best story games I've ever played.\r\n\r\nW Undertale!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I've only played it once through and yet... 925 hours to my name. Probably not even close to equal to the amount of hours spent looking at fan content (mainly comics).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An amazing fucking game, although I will always believe it's message to be too idealistic, I think the concieted effort of atleast trying will always reasonate deeply with me.\n\n\n\n\nThank you Toby Fox for such a powerful game that made up so many of our childhoods and for how beautiful it is, I'm beyond excited to play Deltarune next!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i cannot stress enough, this is the best game i have ever played. it made me and my best friend become the friends we are today, it has so much emotion and the thought that goes into even the smallest details are beautiful. the music is some of the best of any game as well, plus the characters have true depth to them and the mix of humour and pure emotion is commendable. toby fox created a true masterpiece here and i will ALWAYS recommend it to people.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Undertale is one of the best games I have ever played!\n\n The music slaps, and the story is super enjoyable. For someone who has never played a bullet hell style game before this, Undertale was just challenging enough",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Undertale is one of those rare games that stays with you long after it ends. It looks simple, but every character has so much heart and personality that the world feels alive from the moment you step into it. I love how the game treats morality. Nothing is handed to you, and every choice has weight. It makes you think about what kindness means, even in a pixelated world. A beautiful, clever, emotional masterpiece.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely banging soundtrack, got this game on sale for something like £1.70, absolute bargain! I have been a long-time fan of Undertale and am very happy with my purchase, i played the Deltarune demo once, that was also pretty good, but i do enjoy Undertale very much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure there's anything I can add to the juggernaut that is Undertale.\n\nMusic, Gameplay, Story, and frankly everything else is literally genre defining.\n\nMy only complaint is that there's new content for releases on other platforms and not included in the Steam version.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I got this game years ago and didn't start playing it until the end of September because I was bored.\nDid Genocide for my first run, got stuck on sans, got fed up, left the game for a month or so.\nCame back and smacked that funny bone man in his face.\n\nGame is cinema.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good game, really enjoyed the puzzles as well as the story. I have only played the game once, may play again in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly recommended game! \r\nThe gameplay is simple but incredibly fun, and the story is really interesting. Especially the soundtrack - it's unforgettable and fits in the game perfectly. Totally a 10/10 experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, amazing storytelling, great story, what else is there to say?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got overly obsessed with it when I was younger, and now the entire game is baked into my mind. Could write so much about this but for now I'll just say that this is a phenomenal game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game had me stuck at first but its really fun to play i took me months to finish do not expect a fast game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best indie games ever made, peak soundtrack and very emotional and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The epitome of a masterpiece. Undertale combines heartfelt storytelling, memorable characters, and meaningful choices into one unforgettable experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is an indie role-playing game created by Toby Fox and released in 2015. It’s known for its quirky humor, memorable characters, and unique approach to combat and storytelling. Some key points:\n⭐ What makes Undertale special\n\n\nChoice-driven gameplay: You can fight enemies, talk to them, spare them, or befriend them. Your choices dramatically change the story.\n\n\nMultiple routes:\n\n\nPacifist Route (no one gets hurt)\n\n\nNeutral Route\n\n\nGenocide Route (you hunt every enemy)\n\n\n\n\nMeta storytelling: The game “remembers” your actions in unusual ways and often breaks the fourth wall.\n\n\nCharacters: Sans, Papyrus, Toriel, Undyne, Alphys, Asgore, Flowey—and many more—are now iconic in gaming culture.\n\n\nSoundtrack: Composed by Toby Fox; extremely popular for tracks like Megalovania, Hopes and Dreams, and ASGORE.\n\n\n🎮 Genre & Style\n\n\nRPG with bullet-hell style combat mechanics\n\n\nRetro pixel-art aesthetic inspired by EarthBound\n\n\nHumor that mixes wholesomeness, absurdity, and emotional storytelling\n\n\nIf you want, I can:\n\n\nsummarize the story (spoiler-free or full spoilers),\n\n\nexplain the different routes,\n\n\nhelp with gameplay tips,\n\n\ndiscuss characters,\n\n\nor dive into theories and lore.\n\n\nWhat about Undertale are you interested in?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on Steam Deck OLED\n—\n\nPerformance: Ran flawless with extremely long battery life\n\nGameplay: This game is a bit different than most but that is where it truly shines. Be prepared to gain fast reflexes and have out of the box thinking on this one. This game also feels like a love letter to some classic games and other pop culture as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is a timeless game that you could play for 11 years straight and still find new things about. There are endless details and every thing you do will matter in the end. Don't forget!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game super fun and cool story loved the endings 10 out of 10 aslo music?... BANGER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. Short and simple with amazing music Amazing characters just overall a good game. Only thing I dislike is How loud the game is... but other than that its amazing. I Lowk miss this game Might Get Deltarune",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game with a emotional swirling amount of emotions like grief, love, happiness, and lastly depression, this game is so emotional, it also can be  hard like the challenges we face in life, but this game truly brought me what feels like eternal happiness. i would play this 24 7. it depends on what you likes, if you dont like great and amazing games with overly dramatic comments or gameplay. i dont reccomend this. overall this is a beautiful setup with  more emotion and love and joy then christmas. better than deltarune. which they should totally make a part two. i love this gME IT IS, GORGEOUS. BEAUTIFUL, AMAZING, sweet like honey snd lots more, this game definetly deserves a lot of recoginition and gratitude. especially for toby fox who made this game. thank you toby, for this beautiful creation\\artwork you made. this really  hits the spot. i love how bald and shiny sans head is and how much of a boner papyprus has. i overall need this game and if it was never created i would die. as someone who played for 31 hours this just really hit me of how emotional the storyline is, temmie is just a beautiful young girl and i loved watching her grow up. when she went to college i stared tearing up and the memories all flew back.  like ah rum sum sum ah rum sum sum dooeey dooey dooey dooey rum  sum sum sum ,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this game for some character to hack my game and just screw me all over \r\n\r\nbut its a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "truly unique game in its genre and a life changing experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can already tell that all players is going to kill the Froggit in their run all because of the Shayy drama...\n\n(you know what I mean)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just amazing. It was one of the first games i played on my pc and WOW im so glad i bought it. Toby COOKED!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after playing this game for the first time I can confidently say i love this game and highly recommended it the charters are amazing. not to mention the story moves really nicely at a smooth pace that makes sense and so much more i truly believe that even if I tried I wouldn't be able to find a flaw. I guess what i mean to say is its good this game will truly fill you with hope and when your journey ends it will still be there waiting 10/10 thank you toby fox fore the great game it brought me much joy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "contender for the greatest game of all time.\r\n\r\nthe meta narrative is beyond anything i've ever seen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly one of the best games ever in my opion its so good the endings are amazing the story everything is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game but a frog named shayy kept following me. (im underage)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was that kid growing up with it, and honestly I wouldn’t change that for anything. Everything about Undertale still holds up no matter how many years pass. The world feels handmade in the best way. It’s easily one of my all-time favorites, if not the favorite. A 10/10 game that left a permanent mark on who I am.\n\n\"Despite everything, it's still you.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the very first games I've ever played on steam. Great game with an amazing story, I 100% reccommend playing through this game's multiple playthroughs if you have some time on your hands. Despite it's age, it's still an amazing experience.\r\n\r\nWish the community was a bit more sane though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 soundtrack\n10/10 characters\n10/10 humor\ni can´t describe what I feel for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game! Personally like the Sans fight. Story is very original, truly a master among RPG's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game's music is up there with Mozart and C418",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game genuinely blew me away in the best way possible. The music, the story, the gameplay were all amazing. I've yet to complete a genocide run, but I really love how the story changes based on your decisions. It really makes you slow down and think about what you're doing.\r\n\r\nArt: [b]😝/10 [/b]\r\nMusic: [b] 10/10 [/b]\r\nStory: [b] 10/10 [/b] (a bit confusing the first playthrough, but very immersive when you go back)\r\nGame mechanics/User experience: [b] 8/10 [/b] (i don't like that you can't use WASD without remapping keys)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game to start blind on, i was ready to do bad things after 90 deaths",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, despite it being a story based game it's very replayable. Best to go into it with very minimal knowledge of it so I won't say much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "eh, its an alright game i guess (guy who just got their brain chemistries completely and irreversibly altered)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game in the entire universe and multiverses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game for its time and the best indie gmae ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely phenomenal game. The story is interesting, the lore is amazing, the characters are charming, and the SOUNDTRACK IS FULL OF JAMS!! I absolutely adore everything about this game. The humor is great, the writing is great, the little details are GREAT-- I applaud Toby Fox for all of the heart that went into this. It really shows ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is extremely fun, the music is amazing, etc. One of the best games ever imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is super fun! but just remember to not kill the monsters please",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(spoiler alert) I like this game so much because when frisk fall down the mountain and find a way out of the undergound and them he saw kris brother (again spoiler alert)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game... gone a good 20 times, this might not seem like much but for me it is (Though I'm going to play it even more in the future).\r\nI first played Undertale on my parents crappy computer, the Demo in 2013 and I was hooked, as was a lot of the community.\r\nOnce the initial version was released... All I can say now from the memory is Love...\r\nOver the years I always come back to this beautiful game, when I'm bored of the world... when I'm tired... when things get sad... or too hard, I always come back.\r\nI rebought the game a while ago for this steam account, and once I started... I couldn't stop, 7 hours of just doing EVERYTHING... all over again... And that True ending? I always cry... and that's why I always come back, it feels genuine... It makes me happy, it makes me laugh (I love puns), it makes me cry...\r\n\r\nSorry for the rant on this old game everyone who sees this... But I will never forget this game, no matter how many years pass...\r\n\r\n\"Don't kill, don't let yourself be killed\"\r\n\r\nAnd when you come back to this game in the future remember,\r\n\"Despite everything... it's still you...\"\r\nThank you, Undertale...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tried to do \"the bad ending\", all was good, until i reached the fish lady. Amazing fight. Then i reached the skeleton guy. 5 minutes later i was back in ruins, sparing everyone...\n\nJokes aside, this is a truly wonderful game, nostalgic af, the soundtrack is peak, and i still cant believe this game went under my radar back in 2015. Cant wait to see what my man Toby does with the last 3 chapters of Deltarune.\n\n10/10 with star, would hope and dream again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever injoy good fan base not bad people but bad thing frisk is non binary i do not agree with lgbt in my opinion but i do not hate them, i is wish they find thare way [: mettaton for ever {:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game remembers what you did even after a reset, so does some characters. Really good story game and the combat system is revelutionary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finally played it and played it 9 hours in a row. Its suprising how a game can be as good as this. The pacing of the game is incredible and the way everything including the menus are done is incredible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE THIS GAMEMEMEME\r\nfirst came across this when i was 8 and must admit it has a very big soft spot in my heart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, it's genuinely one of the best indie I've played and you'll surely too.\nThe skill you earn through the game is amazingly balanced.\nWell done Toby.\nWell done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly unconventional RPG. Funny and full of heart. Totally worth the price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is extremely difficult, but also extremely fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much has been said about Undertale, to the point where I feel like writing a review of it is slightly redundant. Most people can't tell you why this game is so good, because it's an \"Inside\" thing, it's a \"best game ever but I can't tell you why\" thing. You just have to play it, because trust me, it will make you jerk a few tears.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game with talking skeletons and talking flower, would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale for me, was a magical and beautiful experience, from meeting two wacky skeletons, to fighting an angry tuna, all of it has made me realize that that game is certainly the best game I have ever played. The music from this glorious game has made me listen deeper to any new or old song, and has made me realize the master pieces Toby Fox has composed. The game also in a level plays with your emotions, but it can be in a good or bad way, depending on which path you take. But I wont spoil anything more, so that you buy the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game because it has alot of content and multiple routes, plus the lore is pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. although omega flowey had me shivering the first time. very cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is a game that looks simple at first, but it ends up being way deeper than you expect. The gameplay mixes turn-based combat with bullet-hell mechanics, which makes battles feel unique and actually fun instead of repetitive.\r\n\r\nOne of the best parts of the game is the characters. Everyone you meet has personality, and the dialogue is funny, emotional, and sometimes unexpectedly heartbreaking. The choices you make actually matter, which makes you think how you play instead of attacking everything.\r\n\r\nThe pixel-art style is simple but charming, and the music is amazing. A lot of the tracks stick with you even after you stop playing, and they really enhance the emotional moments in the story.\r\n\r\nIf I had to nitpick, some fights can be challenging at first, especially for new players, but it never feels unfair and is super rewarding once you get the hang of it.\r\n\r\nOverall, Undertale is a memorable experience that's funny, emotional, and unique. I'd highly recommend it to anyone who enjoys story-driven games with meaningful choices.\r\n\r\n*9/10*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What could I say that already hasn't been said in 10 long years?\r\n\r\nIt's surprisingly fun to play this game and pretend you haven't been spoiled at all. Amazing to see I can still learn something from this game.\r\n\r\nVery funny, actually.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing I can say that hasn't been said. If you haven't played this game, what are you waiting for?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Story is great. The Gameplay is great and the eitier game is just great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game just can be annoying due to mad dummy, just dont make undyne mad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legendary Game, amazing music, fun gameplay. Legendary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game brings alot of twists and story lines the battle is very fun, but I must say the controls was bit weird but who cares you'll get use to it. There are more endings and that means more fun. The characters are funny making it feel like they're real. This game sometimes break the 4th wall like sans and flowey, this game can be very hard but I think you should play it :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale... The friendly RPG where no one has to die! \n10 years later, and this game feels fresh and new. The story, art, characters, dialogue, and the music (oh god the music), all absolute peak. Play this game. Do it. Just do it.\nIf you play pacifist, you will cry. If you play neutral, you will cry. If you play genocide, you will cry. If you play this game, you will cry. \n10/10 absolute cinema",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Já conhecia o jogo á um tempo, mas só comprei recentemente pois estava em promoção, é impressionante e cômico.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game on Steam. Great music, great gameplay and story. Nyeheheheh!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is a game that have derived from the plot devices and gameplay mechanics commonly found on Japanese games, coupled with a storyline that challenge and inspire the mindset of players, creators, and critics alike. \n\nThis game act as mirrors of reflection to the right audience, one that I'm not a part of. But, regardless of whether people can enjoy this game or not, the music found within this game continues to be the setting stones for Internet culture; the astonishing craft of said music have continued to inspire and lead players along the storyline of Deltarune.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good story good music good characters basically everything is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is an absolute gem.\r\n\r\nI’ll be honest — the gameplay isn’t usually my style, but the story and characters completely won me over. Every character feels alive and meaningful, and the way your choices affect not only the world but you as the player makes the experience unforgettable. By the time I reached the end, it hit me way harder than I expected.\r\n\r\n10/10 — A deeply impactful game with unforgettable characters and a beautifully crafted story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's amazing what you can pull off with such a simple 2d game. The story is amazing, and I love how much your choices affect the outcome and future playthroughs. The vibe of the game is great, same with the music. It's one of those games you can just play while chilling, and I absolutely love the puzzles, although I do admit, I looked up a few guides. I can say that there are no negatives that I can think of right now. 9.2/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10 years late to this game and all I can say is I regret not trying it earlier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to play Undertale before getting to Deltarune, and I remember why it took the internet by storm 10 years ago. It is an incredible experience adventuring through the underground and meeting so many fun characters, and I feel like I picked up on a lot more than I did just watching gameplay videos in the past. Very glad to have had the chance to play this myself at least once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been a fan of it for a long while, didnt get the game til recently and played it but oh its so nice and lovely, thought i knew the characters but when you're playing it. its a new feeling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale has an incredible soundtrack and story, along with a great art style. Check it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banger game\n\ncured my unhappiness\n\nsans fight is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Replayed the game, this game is so simple yet it is so much more. It's a beautiful art piece that conveys emotions within the player. I would say it is a once in a life time experience to fully be mesmerized by how truly well done this game was made. The soundtrack, the gameplay, the characters, the world building and the jokes were all very well made. Highly recommend it if you haven't played.\r\n\r\n9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Not only does it have amazing music, it also is a very inspiring game of determination.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I decided to make a review now (right after i beat true pacifist) and all I have to say is thank you Toby Fox. This game made my soul fill free and the ending of true pacifist was so emotional. Wish the underground really existed. The game touches your heart. (Before I did true pacifiast I wanted to do genocide but honestly I don't want to do it I don't want to see EVERYONE die)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is basically: you fall into a hole, befriend a skeleton who tells jokes worse than your uncle after three beers, get chased by an overcaffeinated fish, get mom-punched by a goat, and somehow end the game feeling guilty for even breathing.\nPeople say the game is deep… bro, it’s literally a hole. Calm down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This a really fun game YOU SHOULD PLAY.It is sometime challenging though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lives up to the hype. Toby is uniquely fantastic at writing meta narratives, no doubt because of his time living in Andrew Hussies basement. I cannot stress enough how much better this game is going In blind, and to ensure you dont have anyone breathing down your neck trying to backseat game. There is no \"right way\" to play this game. just do what you want to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sh so peak I can´t elavorate, just play the game and pay atention to the dialogues",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ive ever played\ntrue pacifist is crazy\ngo play undertale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game genuinely changed my life when I was 12. No joke it changed my perspective in life with the storytelling, unforgettable moments and iconic characters. definitely one of the best games made by mandkind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very funny, I loved true lab, very good game, please update this, this game also has: spaghetti coding, this game is held together by: tape /w hopes and dreams, that was a compliment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10. Loved the characters, especially Sans and Alphys. The world was so nice and cozy to walk in. I would want to live there if I could, provided no monsters want me dead lol. The music was excellent. Nearly every single track was a straight BANGER! There's a reason why so many memes use this music! And most importantly, the story was one of the most unique stories I've seen in an RPG in a while. \"The game where no one needs to die\" and it lives up to that phrase! I got neutral route because I thought killing small monsters didn't mean anything. My mistake. I'll try to go for a pacifist run next time. My one criticism is that some of the boss fights attack patterns can be super hard to dodge, leading to frustration. Overall, it's a short and simple RPG that everyone should play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kind of game I genuinely wish I could go back and experience it for the first time again. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was one of the first steam games I ever played and It was so much fun. I watched so many animations on youtube of different AU's and other things like that. I originally only knew that there was a neutral and pacifist ending, but I then learned there was a true ending and I was smiling so much. I was pretty young when playing it and I haven't even started playing deltarune yet. So undertale is a game I suggest new gamers should try out before others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun I love the lore and the different endings you can get. A friend bought me this but I would have probably bought it anyways!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is peak, i decided to try it after i played deltarune (i did play undertale on console first though) and both of toby fox's creations are absolute peak. would highly, HIGHLY, recommend anyone wanting to get into gaming/rpg's the dodging system is nice and simple (avoid genocide like the plague if ur new)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun fun crazy game lots of good music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so easy\r\nif you kill everything literally nothing bad happens\r\ntry it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale has brought light, hope, and wonder into the world from the moment it was created, and in all my years, no other game has ever made me feel—or cry—the way this one has. Its graphics may be simple, but its story and characters are powerful enough to stay with you forever, and I love it so much that I’ve bought it twice on different accounts. It’s the first game that comes to mind on the bad days, and if I could be left with only one game for the rest of my life, this would be the one without question. Words can’t truly capture the emotions Undertale evokes, and I often wish I could go back in time just to play it again for the first time and relive that incredible joy I felt when I finished it. I’m also deeply grateful to Toby Fox for creating Deltarune; while it may not equal Undertale in emotional impact, it is still a game I cherish and hold close with genuine love and care.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "sans undertale kidnapped me and put me in the hunger games to survive... 10/10 would play again",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a really good game but for the love of god, DO NOT GET INVOLVED WITH THE COMMUNITY!!! If you see this then please take my dire warning and do not get involved with the community. Especially if you're a child or animal, run as far away as possible from the community.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "can't burn the light in the room that Torel give by to much clicking on the lamp other than that good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, no refunds.\r\n\r\nBut I killed Flowey and after spoiler alerts felt bad because A----- so I give it a 0/10 for Flowey Points, and a avarage of 10/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't recommend this game outside of aesthetics. it's so cute but so slow and frustrating that i've had to put it down out of fear i might break my laptop. i don't play video games often/at all really but this game has a cult following so i thought it would be cool. god i was so wrong.\r\n\r\nfirst off, this is a puzzle game before it's anything else. if you don't like puzzles (i do not like puzzles so they were the worst part) DO NOT PLAY THIS GAME. i got about 4 hours in and found that i had completely forgot what the objectives/goals were because of all the stupid puzzles, and characters, many of which are not important but always introduced like they are, and nonsensical but highly consequential fights. the fights are so fun until they're not. then it just felt like i was getting through the game to finish it.\r\n\r\nwatch a game play if that's your thing but i don't recommend taking the time to play this yourself unless you really want to play this particular game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This is a very impactful game, and for this review I am only looking at the game, nothing else, just what the game itself presents. So while I do like the fandom of this game a lot, I don't like the actual game as much.\r\n\r\nIf there was a neutral option, then I would use that, but because there is not I will have to say negative.\r\nI do enjoy the boss fights, I think they are a fun challenge. It will take a lot of time to beat them, but I do not think it is in an unfair way, the non boss enemies are also quite good, if a bit repetitive. The music is also very good, but that is a known fact at this point.\r\n\r\nHowever it's the story that brings it down, maybe I just don't have the humour but I found most interactions didn't flow very well or weren't that enjoyable. It has a very random = funny humour to it, that I just don't like. It just really did just seem like I had to go through 20 minuets of text just to get an enjoyable fight. Near the end of the game, [spoiler] in genocide specifically, it is just story dumping, you can literally only take about three steps before another textbox appears.[/spoiler]. That is not the only example but it is the most noticeable and I don't personally find that very enjoyable. \r\n\r\nI would give it a 5/10 but the amount of groveling that it takes brings it to a negative over a positive. If you have a different sense of humour then me, then I say go for it, but otherwise I wouldn't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"To enjoy this game, you need a high tolerance for tedious time-wasting and endless patience. Otherwise, you'll likely ruin your pacifist run with one accidental click after saving, or perhaps you'll convince yourself it's fine when it's not. Frankly, the game itself is dull, the story is even worse—and yes, even as a story-focused gamer, I found Undertale's boring. Maybe reading too many good books has made me too critical of it.\"",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "sans undertale kidnapped me and put me in the hunger games to survive... 10/10 would play again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Game is good, but the fanbase around it is maximum cringe and weird.\n\nPlay the game but avoid the weirdos.\n\nIts mindboggeling, on paar with FNAF Biggots and MLP Manchilds.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Very overrated and very overhyped. You'll get bored not even an hour in.\r\nDoesn't live up to the hype.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Although I obviously know why people love this game, I kinda do too, but there's a weird message that Undertale has in store for gamers that have never played this before. This game teaches you that all forms of violence is wrong. But that's not true. Sometimes we need to defend ourselves, our friends and our families. It's not all cupcakes and rainbows... But that doesn't mean everything in life is terrible. The game is fun, But delivers a message that children would think is good, but in truth will lead to worse and worse judgment. take the Genocide Run for example. What happens if someone accidentally grinds a lot, Thinking it's a normal RPG, and starts a Genocide Run? Will the player think that's the whole game? Or will they just not know what to do next? Nevertheless, Even if they did finish the Genocide Run first, They would probably become a completely different person. The Pacifist Run is alright except when you befriend Alphys and Undyne, They get into a Lesbian Relationship which annoyed me a lot, And worse, It'll teach CHILDREN ABOUT IT. So do I like this game? Well... Yes... and No. The main game is ok along with the flaws I told you about. But I also like the alternate universes that fans of Undertale have created in their community. I used to play Undertale-Themed games on Roblox all the time. But that still doesn't mean that you should buy this. I played, I finished all runs, I had joy, I had disappointment. If you're a child that knows better about stuff like this, Then buy it all you want, But please know that this game delivers a strange message about violence and has gay characters. That's all I have to say.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's not a badly made game but cannot understand why people have hyped it up so much. Gave it a try because I heard so much good about it. Has it's moments storywise but overall not a fun game.\r\nThought I could push myself to finish it since it's supposed to be short but I will call it quits after a few attempts at the Asgore fight.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring. Best part about this game is its fanart. I don't think any game has actually managed to make me fall asleep before.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like it. The story is bland and the gameplay is repetitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "better off playing any game from the 90's tbh. nothing special\nGameplay is nothing out of the ordinary, just turn based fighting without any quirks that make it interesting.\nStory is whatever, nothing special there either, has you wasting alot of your time on side missions that don't lead to anywhere.\nGraphics are intentionally very poor in attempt to make the game look old, but with this there just isn't a lot to look at when playing, not much that catches your eye as anything. only characters and buildings; the bare minimum.\ngame has occasionally good compositions, though it's not the best\nIn addition to this, if you're playing on a 60% keyboard like a huge portion of gamers do, then this game is a waste of money, as it is not compatible with it, you would have to rebind your keyboard in a special way to play it which can take quite a while on some devices.\nAnd don't get me started with the fanbase...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring as hell, controls are rage-inducing, gameplay is atrocious, feels tedious and frustrating overall.\nEven if you look at the story alone it's a 5/10 at best.\nThe best thing are the little conversations (which still drag on too long sometimes) and the music.\nAlso the community being the way it is speaks volumes itself. (though i just think they're mainly kids)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is utter trash.  The only reason it's popular is because it's popular.  You know, the herd is following something trendy.  Basically the same reason people watch football when it is a bunch of sweaty burly dudes in tights wrestling over balls and yelling go deep to tight ends.  This game is almost as gay.\n\nThe difference?  Terrible graphics.  Even worse game play.  Even worse than that is the dialogue.  Any game that has \"Tee hee!\" in it saps testosterone and should be burned.  It is a game for tweens that think they're edgy.  If you're a furry, this game is right up your ally.  I am a giga chad, so, I see this game for what it is, infantile garbage.\n\nThere is literally nothing redeeming about this game.  I am serious, anyone being honest will have to concede that people only pretend to like it.  Watch any review and you will hear all this praise over the game, but never why.  You hear ambiguous nonsense rather than anything substantive as to why it's good or why anyone over 12 should play it.\n\nMy dudes, if you don't shut this off the second you run into the skeleton brothers and that off the charts cringe, then you are probably gay because that skeleton certainly is.  100% Hello Kitty is more masculine than this game.\n\nNot even once.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is an open wound inflicted on gaming, and is probably the worst game to ever hit mainstream.\r\n\r\nIt is only popular because it is popular, and everyone is branded a troll if they point out what a poorly thought out excuse for a game it is.\r\n\r\nEXP does not stand for experience points, it stands for execution points. That's the smartest thing this developer could come up with.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't really see what everyone else loves about this game. Its incredibly unpolished and very repetitive. I get that its made by only one dude, but Stardew Valley and Hollow Knight both show that very small teams can still make incredibly good games with lots of polish. Feels like the creator didn't really care about making a good game and just wanted to make something to say he did and it accidently blew up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it just a copy of Final Fantasy and idk just too plain loooking for me so SORRY BUT i have to say not recommended also the music hurts my ears A LOT!!!!!!! fix Ur music and maybe i will change my mind but for now yeah Srry just not fun to play with the really loud music",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh boy oh biddy oh Bayleaf this game did NOT age well XD\r\nWhat this game offers you is a decent narrative experience that falls off in the best ending and sacrifices gameplay in the worst ending. It's decently put together, but I think it survived as long as it has mostly on music. The music is great, don't get me wrong, but if you've ever played a Sonic game before, you know that's not always enough.\r\nNow that Deltarune is out and being developed, there's really no reason to come back to this game except for bragging rights of defeating that one super hard boss. It's worth your money if you have an open mind about the story and don't try to read between the lines too hard, $10 is incredibly cheap, but I gotta be honest Mr. Tobias \"Please Stop Calling Me Radiation\" Fox, you coulda had this in the oven a bit longer.\r\nAlso all my homies hate Toriel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't want to play a game using arrow keys. I won't use 3rd party software to rebind my keys to use wasd. Game is mid at best.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "man dis shit low key overated. man the music good but it gets annoying. Also the game gets very boring and repetive when your trying to get the good ending.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game itself was mid, im only leaving this rating because its honestly really overrated. seriously most of the game is just walking and then randomly having to fight a monster",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely boring and slog to finish.  Went in blind from all the praise and wish I could forget the time wasted trying to enjoy it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really boring. the gameplay just sucks. how do you make fighting enemies boring? how? well whoever made this game managed to make it boring. how this game even became popular i have no idea",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Graphics were lazy. I really like 8-bit, but this was just lazy 8-bit. The story was the worst part.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS FUCKING BAD I HATE DOGS UNDERTALE SUCK EVERYONE SUCKS MY FRIENDS SUCKS IM JUMPOING OUT MY WINDOW I HATE IT AAHHHHHHHHHHHHHHHHHHHHHH TOBY FOX IS THE REASON FOR MY GREAST GREAT GRANDMAS DEATH DONT PLAY THIS GAME PLEASE I BEG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] UNDERTALE - Disappointing and Short? [/h1]\nRating: ★ (1/5)\nHello I am writing a negative review of this video game out of overwhelming CONFUSION and FRUSTRATION...\n\nAccording to my Daughter, UNDERTALE is considered one of the most Iconic video games of All time? (She told me that even the late Pope Francis was GIFTED A COPY!!) Out of sheer Curiosity, I decided to check out the Trailer for UNDERTALE on Steam and thought it was a very Interesting fast-paced Game! Starting the Game out and playing for roughly half an Hour, the game forces you to Confront the Friendly monster named Toriel (The Fight was a little Difficult but I managed to beat it after a few attempts). After hearing from my Daughter that there are Multiple Endings to this Video Game, including Sparing ALL Monsters, I decided to try and Spare Toriel because I thought she was a very Nice Monster. But for some reason, the Game suddenly ENDS?! \nI Asked my Daughter if I did something Wrong and she Told me I was not meant to Spare Toriel... \nI tried replaying the Game to see if Anything was supposed to Change by killing Toriel, but the Game still ENDED the SAME WAY!!\nYou mean to TELL ME that \"One of the most ICONIC Video Games of ALL TIME\" is just a DEMO?!\nThis Game is DEFINITELY NOT WORTH MY WALLET!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ITS NOT LETTING ME PLAY WASD INSTEAD OF ARROW KEYS AND I HAD TO CHANGE MY WHOLE PCS SETTINGS TO MAKE IT MY MAIN MONITOR",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is Overrated, Send a Jester Award, I dare you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Overrated, nice game otherwise. Insists upon itself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "most fight in this game would be better on controller but when ever i use a controller it says this game isnt surpported by it that sucks because your stuck it the arrow keys that are small as fuck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not really a fan of this game quite lacking in personality",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i RESTARTED ON ACCIDENT ;-; nah this game actually peak but it is quite hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used a mod and it froze as i met sans what do i do",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hvae to download a virus and watch a 12 minute youtube tutorial to change arrow keys to wasd just to beat undyne",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "undertale 2 when? this game outdated as frick bro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't understand the hype for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only played for a couple hours. not that good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "MAN FUCK THIS GAME WORST GAME I HAVE EVER PLAYED SINCE EARTHBOUND",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CANT SEX BONE MAN OR THE FLOWER 0/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "undyne udying is too hard DO NOT RECCOMEND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the stupid lizard thing stole my fish wife from me :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the fandom is trash but the game is ok 😔😔😔😔💔💔💔💔🥺🥺🥺🥺🥺🥺🌿🌿🌿🌿🤑🤑🤑🤑",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "so boring sorry i wish i liked it :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I... don't think I get it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot sex the skeleton",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im not in the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "couldn't get past froggit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sans beat me up in real life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not my thing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't find Togore",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no cloud save :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i fucking hope muffet dies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sans didn't give me a boner",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Where dog marrige",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuckass flower",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jerry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot sex the skeleton",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sans beat me up in real life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lib propaganda",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "arrow keys",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "piss offf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton i hate mettaton",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the music is REALLY GOOD and the vibe is really good. the game just wasnt for me. i kept waiting for the good part or either the finish line because the story wasnt making me too engaged cause im more of a gameplay-first gamer. if ur looking for story over gameplay i do think u might like this game a lot. the mini jokes and convos were cute and funny and i liked the satisfaction of some boss fights but yeah just not for me",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is meant for someone, just not for me, it's a bit over-rated.  Sans seems cool though lol",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The heck are you watching bad reviews, GTA6, Silksong, Exp 33 or any game can't compette with such passion put into that gem, you could sell your SOUL for it, it would be cheap, even the game says so",
      "voted_up": false,
      "votes_helpful": 27
    }
  ]
}