{
  "positive": [
    {
      "review": "when ur team is good its fun but when everyone is a degenerate wanna be professional navy seeal its ass",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "[h1]10/10[/h1] I have permenant ear damage after playing Squad but at least I'm having [b]fun[/b]!\n\nHaving 20 mortar rounds landing directly on me and a full [b]TANK[/b] squad cruising down the alleys of Fallujah shooting 50.cal & AP tank shells Adds to my 'Squad' experience.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Very fun game, not for everyone though. If you don't have the ability to play a game for over an hour uninterrupted at a time, this isn't for you. The performance gets worse over time not better... I used to easily get 120+ FPS and now get more like 50-60 and my computer hasn't changed.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Amazing game used to be able to play it but can no longer do so. But need to Update your system requirment. Im running a low spec build I5 9600k and 2070 and yet I can't seem to get over 45 fps with low graphic settings",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The addition of the Armed Forces of Ukraine to Squad is a fantastic step that brings even more authenticity and depth to the game. The developers did an impressive job capturing the unique character, equipment, and tactical style of the AFU, even M-TAC (Ukrainian manufacturer) mention that, giving players a fresh and meaningful gameplay experience. It’s great to see real-world defenders represented with respect and attention to detail, and this update enriches the community by expanding the diversity of factions and strategies. Offworld continues to show commitment to quality and realism — and this update is a perfect example of that. Thank you!",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Squad is Battlefield for actual nerds. Great game. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This game is fun for casuals, this game is also great for comp play; except if you play against turks, chinese, bosnians, russians, ukrainians or anybody from [OC].\n\nBut ceeg is a good man and tries to ban them :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not-so-smart people write bad things about the new update, but that's just their personal opinion and lack of intelligence. The developers listen to their audience and release cool updates. Let's go, Armed Forces of Ukraine!",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Really fun tactical game. Most people communicate so makes it well worth buying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty interesting game, you should play with friends to get more fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GOATED game. Kinda hard when you first start out, but gets extremely fun once you've got some experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]SQUAD[h1]\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☑ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☑ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☑ 7\r\n☐ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i played the game for a bit, liked it, got ptsd then became an alcoholic \r\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played for the First time after the UE5 Update and i really enjoy it. The Graphics are very nice compared to UE4, but the Performance isnt that great. I have my Graphics at high and some things at medium like global lighting and i get an avg of 50-60 FPS in big maps with many vehicles. I got a 4060 ti 8GB and a Ryzen 5 5700. Something that i hate is the weapon handling, because you run 10 seconds and you have no stamina and If you aim you just can't hit anything. All in all it's a solid game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Squad is an amazing tactical shooter that truly rewards teamwork. The battles feel intense and immersive, the sound design is incredible, and every match delivers those unforgettable moments you only get when a team works as one. Highly recommended for anyone who loves real cooperation in games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A great game, which makes bad people very upset.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Great introduction to a MilSim game that rewards teamwork. I am so bad at this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dont believe the whining people leaving bad reviews because of political reasons or whatever bullsh*t they believe in. This is a fantastic game if you put the effort in communication and teamwork.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought squad when it was in UE4 but know its UE5 and is VERY laggy so do not buy it unless you have a good pc",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Adding Ukraine was an awesome decision. Using the same equipment and weapons that I used in real life gives me a very pleasant feeling. The faction is highly detailed and authentic. I never thought I would have the chance to play for a faction I used to be part of. Thank you to the game developers — you achieved something none of us expected. You guys are the best!\nIf you are a fan of ARMA games, I strongly recommend buying and playing it. It's like ARMA, but with better performance and more detailed military forces.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The amount of bиtthиrt rooskies triggered by the addition of UA faction left me no option but to write a positive review. \nAnd the game is really good regardless.\nSlava Ukraini.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Sometimes the game turns into taliban simulator, but still quite fun :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Walking simulator on some maps \nyeah uhh that's it just loads of um waking sometime shooting and driving\nmostly dying a lot yes\nI should be Walking in real life instead of this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the games I've been waiting a long time for. I never enjoyed the run and gun style multiplayer, and squad was an answer to my prayers. The game requires teamwork and communication, awareness of both your surroundings and of the battlefield, all while giving me side splints from the goofy things I hear people say in this great community. Squad is one of the few games where you can have a poor night with your personal performance and your team be losing over and over, yet you will still have fun and come back.\r\n\r\nThe Devs have really pumped it up recently as well, I look forward to everything this game will deliver to come! BRING ON THE FIREFIGHTS!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good game, had a lot of fun in it. Haven't played for a while and seen some reports about optimization issues - hope that is a temporary problem that will get addressed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely brilliant tactical FPS. Greatly recommend to anyone. And thanks to the developers for adding AFU!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A bridge between Rising Storm, Insurgency, and Arma.\r\n\r\nEast to play how you want. Infiltrators, CQC, Tanks, Helis, Forward Scouting, Commanding, Squad Leading...\r\n\r\nQuickly became my favorite game above my previous Mil-Sim favs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game could use more refinement, DL size, cpu intensive, yet this has not destroyed it for me. As a whole, it is one of the most fun I have had gaming. The scope of battles, the pacing, mechanics, teamwork and gunplay have made awesome friends who I couldnt have met elsewhere, and server choices allow a variety of experiences- instead of forcing a playstyle. I played a bit before ICO and seeing before and after, I think it was a relatively positive change. Perhaps in a void, being well fed and trained one avoids \"shaky arms\" and horrible point/hip firing. But in a near peer war, I could understand being exhausted afraid and hungry after eating .2 squirrels a day, and physically suffering to a degree. Very dope game. Base building is a great feature. Could use more expanding on that-within reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "takes a while to learn or at least it did for me but this game is great even when playing with random people also a great mil sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It might be a bit boring if you play the game alone but it is one of the best online experinces you can have with this game if you play with friends. Hunting Tanks with HMMWV AT attached on top is so peak. Although the game does have optimization problems and some annoying servers with annoying commanders but its whatever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most fun I have ever had in a multiplayer game. There is nothing else like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the combat, the thrill of suppressing enemy machine guns with the 240 while other squads assault that position. I love launching 40mms from a 203 or M320 into HABs or buildings full of enemies. I love burning enemy armor with anti tank weapons. I love splitting heads open with designated marksmen rifles. but you know what I don't like? The people who plays this game, I swear to god i hate whiney squad leads that cry that I'm on a rooftop shooting people with a M110 while he has 7 other guys there to dig for him. or the server admins who constantly have to remind everyone that he is God and don't you dare have 7 infantrymen in a LAV squad that isn't locked, and god forbid don't say any mean words in the chat in a game about FUCKING WAR, but I digress it's a fun game and you do meet cool people but the milsimtards can really break the experience, but the combat alone is worth dealing with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game ever, i have never played a better game, litterlaly best game every. like i like to kill everyone and then win. it is so fun if u r gud like, btw i am really good, like ive killed people in game good. so all in all, this game is great, if you dont like you are gey, no way around it homo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with some not great servers. Find a good server to make it worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sofern deine Freunde nicht mit dir zusammen spielen, ist es sehr schwierig, alleine zu spielen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only started playing mid-2025 so I'm ignorant of the games history as a whole, but it took me dozens of hours to actually begin enjoying the game. When you first hop in it's just a mess- blueberries (players outside of your squad) all over the place, people saying callouts you don't understand, voting for maps and units you've got no idea about, it can really be alot. But if you have someone whos willing to teach you, or take the time to teach yourself, Squad opens itself up to be one of the more unique FPS experiences out there. \r\n\r\nI've had so amazing matches, and just as many terrible ones- but its the intense and teamwork oriented gameplay loop that always has me coming back for more. You can run as Infantry, roll across the battlefield in tanks or ifvs, fly overhead in a helo, or even sit back at base lobbing rounds on a mortar for your team. When things go well and the team is working together, it feels amazing. It's the opposite naturally when you get balled up by the enemy team, but thats just the nature of the beast. \r\n\r\nOverall I would recommend at about a 8/10, TLDR:\r\n\r\n+Provides a pretty decent FPS experience with a good array of vehicles and weapons\r\n+Maps are quite large and give a good amount of variety, even if you've played it plenty of times prior\r\n+Factions within the game have different units, changing how they play depending on which you choose\r\n+Various different playstyles due to the Kits and various vehicles at the player's disposal\r\n\r\n-If you're a solo player, don't have a mic, or don't like talking to people online- this is not the game for you\r\n-Community can be a bit overbearing/toxic at times, especially when it comes time to vote at the end of a match\r\n-Matches, even ones that you get annihilated on, can take upwards of 30 minutes. More even matches can take closer to 2 hours. If time is a concern for you this might not be the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Running for 30 mins and not shooting a single and healing ungrateful battelfield reject bastards is peak . 10/10 would recommend .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recently added commendation system is by far the best way to \"level up\" in a game. Do a good job, your teammates decide to give you a little medal to tell you how well you've done and your rank increases in that class. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gerçekçiliğin üst düzey olması, oyunu daha dikkatli oynamayı ve odaklanmayı zorunlu kılıyor bu sayede oyundan hem daha çok zevk alıyor hem de adam vurduğunda bölge aldığında ya da bir imha gerçekleştirdiğinde başarma hissini daha çok hissediyorsunuz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DirectX 12 is not supported on your system. Try running without the -dx12 or -d3d12 command line argument. i having problems my computer system have DirectX 12 i update all drives and when i lunch the game its keep telling me that pop up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but the last update in the game was are not very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New to the game however very fun!! Love Playing Medic and Automatic Rifleman.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With the right people this game can be very fun I wouldn't sit and complain about the little things people complain about within this game. I think they balance and fun well and makes it worth playing every now and then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most approachable  and consistently fun Mil-Sim game I've played. Arma may have a bit more depth and more simulation style systems. But squad constantly provides rewarding gameplay. The shooting mechanics are excellent, and the scope of warfare keeps getting bigger and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mix of arcade and military simulation. Not quite as slow paced as Arma and easier to learn. Great game to just hop on and play a few matches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been in a dome and I've been bombed all the game in that dome by mortar every 5 seconds.\nThank you for the awesome realistic PTSD simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for people who like real combat scenarios and realism\r\nwould reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good and a lot of reviews mention that the devs are focusing on new players but its not a bad game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Squad is the only game where I climb into a helicopter, pray the whole squad was in, and hope our pilot isn’t using a $10 mouse from Shopee.\r\nWe took off beautifully…then immediately discovered gravity still works.\r\nI rate this game a solid 9/11 — because 9 times out of 10, our squad wipes in 11 seconds after landing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, especially all the \"Special\" player you meet along in the night",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute banger with friends.\nI like that there are different servers for different playstyles. For example I prefer relayed and goofy playstile and there are servers appropriate for that, but if you want serious action then there's plenty of servers for that aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fairly realistic game for blending in as a russian",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the realism of the game and wide array of vehicles and weapons, i like that there are new player friendly servers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game i really enjoy the community and team play have not ever found a game quite like it. I hope the Devs keep updating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jogo muito imersivo, tem uma dificuldade muito interessante para o gênero, fazendo com que você não seja encorajado a jogar sozinho rushando, vale muito a pena jogar junto do time, seguir calls e ajudar a fazer missões importantes mesmo que pareçam menos divertidas, sempre vale a pena.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Join -B&B- servers if you would like mentors in the game. Great servers with great people, safe mods, good admin staff and good gameplay once you figure out your role.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like being that one cheap units of an rts that just follow the orders.\r\n\r\n10/10 will witness horrors beyond my comprehension once again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best large scale battle sim out there.\n\nSquad nails that rare middle ground between hardcore mil-sim and actually-fun teamwork. The scale of the fights feels huge without turning into chaos: 50v50 combined-arms battles where infantry, armor, logistics, and commanders all matter. When a squad is communicating and the team is running supplies, building FOBs, and coordinating pushes, it’s easily some of the most intense and rewarding multiplayer I’ve played.\n\nGunplay feels weighty and lethal, so positioning and patience win over twitchy run-and-gun. Audio and visuals do a ton of heavy lifting too—distant artillery, vehicles rumbling in, bullets cracking overhead—it sells the “you’re in it” vibe. The map variety and factions keep things fresh, and the pacing naturally creates those cinematic moments: desperate defenses, organized flanks, last-second revives, and convoys that actually feel important.\n\nIt’s not perfect. Matches can swing hard depending on communication, and a silent team can make a round feel flat. The learning curve is real, especially around logistics and roles, and performance can vary by update. But if you’re willing to learn and use your mic, Squad becomes something special.\n\nIf you want big, coordinated battles where teamwork isn’t optional but the whole point, this is the game. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun but its rlly hard for begginers but pll are chill and learn u",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is fun, realistic and unique. \n\nBut getting yelled at by people in \"Noob Friendly\" servers isn't fun. They expect everyone to be an expert.\n\nBeyond that the game has a large learning curve you really have to know what is happening in order to have a good time, watch a lot of videos on Youtube to learn. Find your playstyle and what you enjoy and all around have fun, don't let the sweats who scream like children ruin it for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest PVP shooter i have played until they changed it with the UE5 graphical / engine update. Other than that travesty, SQUAD is a game where bad-habits in combat get rectified, teamwork is truly emphasized, and a good strategy alongside good in-the-moment decisions can save your virtual life. If you're looking for a proper \"milsim\" type game where imbeciles who think they're special forces die right away because they have no real brain to work with - then this game is for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The armory exists, but there’s still no weapon customization.\r\nBut game is still awsome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if they would just optimize this game. i understand ue5 is a different engine, but you pushed it out. make it run better. i love this game though. best shooter ive played, hardcore but not too. combined arms is the point of this, and it works so well when it does. ue5 doess look great. but playing great one map, and stuttering crazy on another is wild.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best realistic military fps simulator\nbut need optimisation only using single core of cpu it makes fps bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game everything about it dude from rednecks to others games awsome great way to find freinds and have fun and its a really good tactical shooter actually taught me a little",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the funnest games ive ever played only wish they would add in more detail indoors and buildings can  be destroyed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. the middle eastern insurgents have a caliphate not commander",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game if you are looking for a PTSD experience, looking to wage jihad? This game is perfect for you! However it requires a somewhat good PC and a large amount of storage space. If the developers read this, please make the storage required for this game smaller please.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly immersive tactical shooter that provides a very close to large scale combat. I great game if you want to communicate across different squads and team members to take down the opposing force.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing blend of arcadey-ness and reality, with just the right amount of arcadey elements to keep it a fun game, but a healthy dose of realism, making each death, each explosion, each whizzing bullet very harrowing. Can't recommend it enough!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall game is good and fun. Modding community helps it alot, but unfortinately Unreal engine 5 has killed a lot of the player base, as mods need constant updating, and the modders don't have the time for it.\n\nHopefully it will get better in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "весело если играть по дс с друзьями, на соло игру будет достаточно скучно, механники не сложные понять основы будет легко",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Squad is an amazing 50vs50 team play, is very fun and quite immersive, positive thing is that you can have some epic moments that you will never forget, negative stuff is that there are some dead moments that you need to wait or run across a big area.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Changing my review to a positive. \n\nDevs responded to my concern and fixed the issue (commends not working) within a week. \n\nThe game still has some issues but it's the best we got. Devs seem more focused on communication with the playerbase now and I hope this will encourage them to keep working in this direction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would totally recommend if your into milsim games. But, the only driving me to make this review is that for years they cannot remove the bug where your kit is over-written by another player. You can go over 9/10ths a match while using a HAT kit, then when you die it's gone because the game somehow listed it as available for someone else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games good, i have fun with it tbh, just like reduce the noodle arm a bit and/or enhance the stamina and it will be fine imo. And some optimization for low-end pc specs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game to play with friend's and family\r\n\r\n\r\nZilla's Recon squad signing off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My pc is weak , but this game is optimized really good . Great stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Играть на UE5 на текущий момент времени уже достаточно комфортно (RTX 4060 и 32gb RAM)\r\nАвансом ставлю лайк. Кайфанул на нескольких катках.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Зродились ми великої години,\nЗ пожеж війни і полум'я вогнів.\nПлекав нас біль за долю України,\nЗростив нас гнів і лють на ворогів.\n\nМи йдемо в бій переможним ходом,\nТверді, міцні, незламні, мов граніт,\nБо плач не дав нікому ще свободи,\nХто борець — той здобуває світ.\n\nУкраїно!\nСвята Мати Героїв,\nЗійди до серця мого!\nЗа Твою славу,\nЗа Твої Святі Ідеї!\nНехай душа моя у тобі відродиться,\nСлавою твоєю опроміниться!\nСтраху нехай не знає,\nНе знаю, що таке вагання!\n\nСкріпи мій дух, загартуй волю,\nЩоб сміло йшов я в бій!\nЩоб віра моя була гранітною,\nЩоб зросла завзяття, міць!\nСвята, Могутня, Соборна!\nСлава Україні!\nГероям слава!\nСлава нації!\nСмерть ворогам!\n\nУкраїна — понад усе!\n\nУкраїна — понад усе!\n\nВелику суть — для усіх єдину,\nНаш гордий клич народові несе!\nВітчизні будь ти вірний без упину,\nНам Україна вище понад все!\n\nВеде нас в бій Героїв наших слава,\nДля нас закон — найвищий то наказ!\nСоборна українська є держава –\nОдна на вік, від Сяну по Кавказ!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I am in a building with my squad. Dudes run in from back. We rain hell on them.... They were friendlies. Argument starts about communicating around CQB to better identify friendly personnel. Enemy tank 100m up the road somehow gets a heat round in through a window and kills about a dozen soldiers. We lost the point and the game. 10/10 love this game, one of the best milsims beside arma 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!\nI was genuinely delighted by the update that added the Ukrainian Armed Forces - something many of us had been waiting for. The faction is well-made, authentic, and fits the gameplay perfectly.\n\nI also enjoyed that the developers unintentionally gave us the chance to observe some rare Russian wildlife in the review section. Haven’t had this much fun in a while.\n\nHighly recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First person anxiety shooter game ( loud and complex fight area like real ) I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best shooter game ever made. Intended for adults!\n\nThe developers keep adding content even after 10 years and now they remade the game in Unreal Engine 5. And they are still working on it, making the game better.\n\nIf you are an adult and like communication, strategy, tactics and not just brainless fast paced shooting, this is THE game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i remember watching youtube and watching what i believed was night time combat footage. It was soon i realized it was not a real life op, but a video game that captured the realism of war so perfectly it fooled me.... it is the reason i got a PC and one of my all time favorites<3 p.s. DURKA DURKA MFS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUN AS HECK, this game feels more scarier than any other tactical game i've ever played, downright good especially for its time, the Reload Animations feel so great too i might aswell make a video about it, friends make it more intense and fun\r\n\r\nhighly recommended, got nothing against it\r\n\r\n(thanks to my dear Esper for buying me the game out of nowhere 😈😈😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼😼)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Гарна гра, мені до вподоби, рекомендую. Крута - крута нова фракція.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Reading reviews lately you would almost think that the developers killed a cat or something. People begging for more hand-holding really need to relax imo. Elementary school kids learned Minecraft with literally ZERO hand holding from that game. \nThis game is still great and the Unreal 5 update was absolutely a net positive. Many haven't cleared their caches like the developers suggested or refuse to lower their settings to meet the improved graphics. The vehicles handle better than ever, the gun handling is unique and leads to better gunfights if you rely on more than just twitch shooting, and the teamwork that is possible in this game is just on another level when compared to games like Arma or Hell Let Loose. Learning positioning and playing the strengths of your kit are what makes this game SO satisfying.\n\nTo any new players: Just hop in, get social, be willing to learn, and get out of your comfort zone to learn a different style of shooter. This isn't Battlefield, but that's exactly what makes it great.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Game is an absolute cinema! One of the best war simulators so far with tons of content. Game requires a high level of teamwork and strategy, while providing all the neccessary tools for effective communication and planning. If you want to feel what a real battle field is then you are in the right place.\n\nP.S: don't pay attention for the recent bad reviews - russians are shitting their pants as the Armed Forces of Ukraine were added (and that update is fuckin cool! Try out brand new Cossack and Vulkan!) :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game and the optimisation is fine. The negative reviews are mostly because people in parussia can't afford good PCs.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Squad is the only game where you can go from “I’m a tactical genius” to “Why am I lost in the woods holding a shovel?” in under three minutes.\n\nIt’s pure chaos in the most beautiful way possible. One minute you’re building an FOB like you’re on an episode of Fixer Upper: Combat Edition, and the next minute you’re sprinting across an open field because your squad lead said, “Trust me.”\n\nSpoiler: you should not have trusted him.\n\nThe sound design? Insane. Every gunshot makes me flinch like someone just threw a firecracker under my chair. The teamwork? Chef’s kiss. When you actually get a squad that talks, communicates, and doesn’t drive the logi truck into a lake, it feels like you’ve achieved peak human cooperation.\n\nAnd let’s not forget the medics — absolute heroes. They’ll crawl 800 meters under fire to revive you, only for you to get domed again nine seconds later. Legends.\n\nIf you like tactical gameplay, teamwork, and the thrill of trying to pretend you know what \"bounding overwatch\" means, Squad is your game. Just be prepared: your squad lead is either a benevolent genius… or a war criminal in training. There is no in-between.\n\n10/10 would follow bad orders again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good fun, especially if you have a group to play with. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After fifty-five matches one may get a chance to shoot their gun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FIrst thing I did was drive a toyota hilux with S-5K rockets on the back at some IFVs and launch the rockets everywhere before proceeding to ramp up a hangar, fly off the hangar and die",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arma but better and for normal people, not for neckbeard retards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny polish guys, annoying french people, guy named Kyle with a machine gun inside the walls, and screaming irishmen. 8/10 would drive an armored vehicle over a child again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spawned in, accidentally threw a smoke instead of a frag, somehow became squad leader. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arkamda bir ayak sesi duyuyorum bekliyorum gelince vuruyorum ardından bir ses yükseliyor bly-aaat diye meğerse kendi takım arkadaşımı öldürüyormuşum.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As long as you bring a dedicated group of friends to play with you, it's an incredibly fun and engaging tactical shooter with a moderately steep learning curve as far as the UI/mechanics go. For optimal play-style, use a mouse thumb button as a hot key to bring up the map since there's a lot of useful information there during engagements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a new player, I really like it and I dont really get why people complain about Unreal Engine 5. They could add more maps though",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The developers at Offworld Industries have completely lost focus on their community. Instead of the promised optimization and bug fixes, for years we have seen only one goal - attracting new players. Old, bug-ridden problems are ignored for years!\r\n\r\nUnfortunately, OWI has no desire to handle the training of these newcomers either, shifting this problem onto our shoulders. \"You train and punish them...\" is their stance. There are so many new players that they cannot be taught, and they are left to \"stew in their own juice,\" degrading the gameplay experience for everyone. Administrators cannot cope with the influx of offenders, and OWI is stripping servers of their last effective methods of dealing with them.\r\n\r\nServer owners pay money for rentals, spend hundreds of hours on administration and building communities, and in return, they are spoken to with threats, promising to revoke licenses for the slightest disobedience. We are free labor and just a source of income that OWI simply doesn't care about.\r\n\r\nAs long as sales continue, they don't need the veteran players. So let's hit them where it hurts - the sales.\r\n\r\nCALL TO ACTION: If you agree, if you are tired of empty promises and bugs, copy this review and publish it as your own. Let the developers see that we are not a bargaining chip. Spread this like a virus! Let's not let them forget about their promises.\r\n\r\nP.S. I will change my rating when I see REAL work on optimization, bug fixes, and a RESPECTFUL attitude towards server\r\n#faq_owi",
      "voted_up": false,
      "votes_helpful": 303
    },
    {
      "review": "please fix the utterly broken and toxic power grip admins have over OUR 50 dollar game with the community ban list? Most power hungry people i have ever met own and moderate SQUAD servers, 3 temp bans over the course of 2 years shouldnt block my ability to play this game",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "This game was great when I first bought it a few years ago, now since UE5 its a buggy mess that needs fixing but thankfully the community is still great.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Most recent update with paid pve mode nobody asked for has completely broken the server browser which was already incredibly buggy. They do not address any of the issues the current game has they just add more useless garbage or upgrade engines when the game was fine on ue4.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "nobody communicates, even in the best servers.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game unfortunately turned into a giant mess that they never managed to fix.\nAnd patch after patch, thei dig their grave, while prople divert to better alternatives showing up.\n\nKudos Squad to what you've been. But don't be fooled, the game lost focus ages ago and is digging really hard into its own death.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game was good years ago and was decent up until they changed the game to UE5. Game is only meant to be played now if you can afford the latest and greatest PC rigs. If you cant, tough shit your not going to be getting enough frames to actually play the game. The game was in its prime back before 2020, if you got on the train after, sorry for your loss. Game feels like walking through hot glue and the community is more often to just kick you from the squad if you are new or not willing to relieve a 2006 iraq war wet dream. Avoid",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "when i bought th is game it was good and now it blows, it hardly runs and the devs dont care about the community at all, only thing redeeming this game for me was the starwars mod and it has been down for months because the base game is so shitty",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After 2830 hours, i can no longer recommend this game to anyone anymore. What used so be a fun and exciting game is no longer. The UE5 update has decreased performance and introduced so many game breaking bugs it is nearly unplayable, even with friends.\n\nOn top of this is the fact that there is still no in game tutorial, and a massive influx of newer players because of the constant sales. Every server in the game -  experienced preferred, new player friendly, invasion only, you name it all have a surge in new players who have no idea what to do. Server communities, squad leaders, and teachers cannot keep up resulting in a total drop in match quality I've never seen before. Think the ICO was bad with veteran players leaving? This is so much worse.\n\nIn the future i hope OWI can fix these issues and bring the game back to its prime, and they seem to be taking the right steps with finally taking player feedback. Time will tell if they do something about it, until then the game isn't worth buying if you are new.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Дауны на разрабах забыли что такое работа. Оптимизировать игру не хотят, технику нормально обновить не хотят. Че делают на протяжении нескольких лет - загадка.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "* ue5 slop\n* bloat over fixes\n* (paid) emotes\n* (paid) skins\nlook at what they did to my boy\n\nplay reforger instead",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Frame generation is not a replacement for frame stability. Frame generation should be an accessory that some people may choose to use as a supplement and not as a necessity for 60fps.\n\nThe Infantry overhaul update broke my trust and the UE5 update executed my hope. \n\nIf you want a better new experience and a taste of what squad used to be like, go play Arma 3 (dont touch reforger, trust me) or any other competitor. Its far cheaper, more reliable, easily modable, and hads a happier community. Just give the controls some patience as the game is 12 years old.\n\nThe developers at Offworld Industries have completely lost focus on their community. Instead of the promised optimization and bug fixes, for years we have seen only one goal - attracting new players. Old, bug-ridden problems are ignored for years!\n\nUnfortunately, OWI has no desire to handle the training of these newcomers either, shifting this problem onto our shoulders. \"You train and punish them...\" is their stance. There are so many new players that they cannot be taught, and they are left to \"stew in their own juice,\" degrading the gameplay experience for everyone. Administrators cannot cope with the influx of offenders, and OWI is stripping servers of their last effective methods of dealing with them.\n\nServer owners pay money for rentals, spend hundreds of hours on administration and building communities, and in return, they are spoken to with threats, promising to revoke licenses for the slightest disobedience. We are free labor and just a source of income that OWI simply doesn't care about.\n\nAs long as sales continue, they don't need the veteran players. So let's hit them where it hurts - the sales.\n\nCALL TO ACTION: If you agree, if you are tired of empty promises and bugs, copy this review and publish it as your own. Let the developers see that we are not a bargaining chip. Spread this like a virus! Let's not let them forget about their promises.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The developers at Offworld Industries have completely lost focus on their community. Instead of the promised optimization and bug fixes, for years we have seen only one goal - attracting new players. Old, bug-ridden problems are ignored for years!\n\nUnfortunately, OWI has no desire to handle the training of these newcomers either, shifting this problem onto our shoulders. \"You train and punish them...\" is their stance. There are so many new players that they cannot be taught, and they are left to \"stew in their own juice,\" degrading the gameplay experience for everyone. Administrators cannot cope with the influx of offenders, and OWI is stripping servers of their last effective methods of dealing with them.\n\nServer owners pay money for rentals, spend hundreds of hours on administration and building communities, and in return, they are spoken to with threats, promising to revoke licenses for the slightest disobedience. We are free labor and just a source of income that OWI simply doesn't care about.\n\nAs long as sales continue, they don't need the veteran players. So let's hit them where it hurts - the sales.\n\nCALL TO ACTION: If you agree, if you are tired of empty promises and bugs, copy this review and publish it as your own. Let the developers see that we are not a bargaining chip. Spread this like a virus! Let's not let them forget about their promises.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "With the worst possible testing, they released the Unreal Engine 5 update - making all the graphics worse, and exacerbating every single issue in the gameplay, while simultaneously alienating their playerbase that uses older PCs... thanks, Tencent, very cool.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have put up with the devs shitty attitude to the community.\nI have played this before they even got on to steam meaning when they were a kickstarter game and have played since.\nThey have not once listened to the community when they asked for game fixing updates or bug fixing to be done for some of the game breaking bugs, It gets worse once you look at the scenes behind closed doors and see that only 2 people in the dev team actually play the game and talk with the community while the actual \"dev team\" says that they are pushing for a more community bound focus and intend to listen to them yet they haven't once.\nThe game at its fundamentles is a very fun game it has just the right mix of milsim and playstyle to fill the gap no other game.\nThere has been many request from the community for them to push certain updates or to revert some of the changes and to fix certain bugs, but not once did they listen and pushed the game into a state so most of its old playerbase had to quit because they simply couldnt meet the hardware specs that it requires now, and alot of people have been complaining about it and asking for them to go back on the update but they just keep ignoring it and pushing updates out that no one wants and asked for.\nWhat has officaly sent me over the edge is OWI has fired most of their dev team including the 2 who actually listen to the community and try to help as well as push this ridiculus new dlc/update and increasing the games price as if the game is still in a functional state with a large playerbase and no it is infact not at that state.\n\nThere is some things people let slide and some they just cant disclose but fuck the nda by this point.\nOwi is cleaning house simply because they want to start over with a new clean slate and to do so their process is to wipe the slate clean by firing most of the dev team and pushing updates based off of how much they get paid by their *Redacted* .",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played squad for years now and for some reason every single server shows up at 9999 ping. The launcher needs a complete overhaul to fix this, after this new update my game just explodes looking for servers",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very sad... a game I used to love, that I can no longer play because the UE5 update is too demanding on my CPU. Such a shame. I want to give this game a good review, and I might change it if lower end PC support was implemented. No clue why they did that instead of releasing a brand new game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unfortunately, it is very hard for me to give this game a good review. I used to have a french friend named yeetrat, me and him we're very close, I almost considered him as my own brother and we used to play this game for hours, but after UE5 game out, my friend yeetrat got shipped to africa by Offworld to work in cobalt mines in the Democratic Republic of the Congo for Telsa batteries. Ever since my friend disapeared, I've had a really hard time ajusting to the UE5 environment and will be waiting for the game to get ajusted/fixed by the devs before I play again. Hopefully my friend will also be released in the near future.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is okay, worse after UE5 and the devs are taking their sweet time fixing things, but the community primarily sucks.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the worst optimization i have ever seen in a game during my lifetime, worst 50$ i ever spent, go buy hll or something else that doesn't require a nasa superstation to run",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "80% Dogshit community, you never get to play as any interesting factions or nations because all of the tryhards who only care about winning will vote for some desert map, the same support BNs and then Insurgents or Militia VS America or Russia for the 30 gazillionth time. Britain has almost entirely fallen off of rotation, Canada pops up every 7 or so games at best, but even then you will be forced to play as boring logistics BNs every single time because this is the META and sweat asses will demand you play these factions and their fello sweat asses and new players will vote for this. This will happen almost every single map and faction vote. I can count on both hands how many times I've been able to play as China and despite over a thousand hours i can say I've only played as Iran or MEA as they used to be, no more than 2 dozen times. I can also say the same for the VDV and PMCs who i also have only played maybe more than a couple dozen times, meanwhile i have had to play INS hundreds of times at this point. Do not purchase this game expecting to play more than 3 or 4 nations or expecting to be able to play the variety of classes or vehicles with out having to sink multiple evenings or nights into the game before seeing a fraction of variety.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The devs turned a clunky, but charming game into a broken, stinky ue5 slop",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I used to be able to play this game on a laptop with integrated graphics ( albeit painfully ). Now I can't play it on a DESKTOP with a mid range cpu and old mid range gpu. They actually did the opposite of optimization. On my desktop I can't even consistently get 30 fps ON THE LOWEST SETTINGS WITH FRAME GEN AND FSR. It froze with every mortar shell that exploded on screen. I can't play the game that I bought anymore. ts pmo. Don't buy till they get their shit together. For fucks sake.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "OWI: Hey let's make the game worse by switching over to UE5 and make soldiers shoot like 5 year old boy scouts and run like morbidly obese asthmatics.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Одна из немногих игр где я получил кучу эмоций и в целом остался доволен, что потратил целых 800р на неё. Но рекомендовать я её не могу как минимум из-за оптимизации, я играл в неё на 1660s, потом на 3060 12гб, теперь я пересел на 5070 и знаете что? Прирост фпс от карты к карте 15-20 фпс и я блять не шучу сейчас. Разрабы вы че там курите? На 5070 в замесах я дропаюсь до 40 кадров на любых настройках. В других играх я получил колоссальный прирост в нативе, но тут нееет, тут у тебя должен быть пк NASA SPACE X UFO EDITION ЧТОБЫ ВЫТЯНУТЬ ЭТУ КУЧУ ПИКСЕЛЕЙ ИЗ 2012г, блять да фар край 2 моментами лучше выглядит чем эта игра. Фух, забыл описать плюсы, спасибо за геймплейную составляющую и комьюнити, по большей части столько времени я провел из-за социальной составляющей.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's so much potential for the game, yet the developers refuse to optimise the game performance wise.\r\nIt's just disappointing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game does not have basic support for things like 24 bit microphone quality or 384000 hz bitrate in its' audio pipeline and i'm not going to redo both of those settings every time i want to play. it's also just a very mid game in general tbh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I had left the game for a long time, since I was focused on other games. Then the milsim bug started wandering on my mind and wanted to play squad again and pour in a lot of hours, but when I installed the game I realized I couldn't play it anymore. The new UE5 update completely killed performance, specially for people like me (GTX 1660 TI) below the 3k nvidia series. With everything in minimum, it barely reaches 50 fps. My pc can handle RDR2 with medium/high graphics at stable 60 fps, and this game, that might look better in UE5, does not justify the performance issues. I get around 40-50 fps on training mode, but on a server I scratch 40 fps. In arma reforger, for example, a game that should take way more resources than squad, runs at a stable 50/60 fps on almost all situations. This game is justifiable buying if you have a 4000+ series, or its equivalent on amd. If not, dont even bother.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "community ban for calling retards retarded, how can you let a few puritan morons make your game unplayable for half of the servers by auto ban for the word retarded, this is retarded; game is really good though, 9/10, admins are powertripping reddit mods",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game use to be good but they have neglected old factions with no updates to equipment or models. After playing for a few hundreds hours of each map they get very stale especially after map voting was implemented when they condensed all layers down with a few lanes that are very predictable, fighting over the same POIs every time. \nThe ICO has had some weapon handling changed to be in a better place however some things like Launchers and LMGs are still awful to use and steady with the LMGs basically having an Aim cone. Armoured vics like IFVs also suffer with the aim cone effect when firing more then 1 bullet in a burst. The character movement speed was also slowed in the ICO which made crossing the map very tedious and boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Throwing in the towel. Have tolerated all the bugs and quirks, spending 2 hours researching and tweaking graphics settings after every major update just to play the game. Can't be bothered anymore - Ukraine update introduced massive frame drops/hitching/freezing that make the game unplayable. Seeing the devs introduce a PvE gamemode no one asked for, while hundreds (if not thousands) of players past and present have been crying out for optimisation and performance improvements. The quality of the playerbase is horrible, especially in smaller regions, and each update drives more and more experienced players away mainly due to bugs and performance issues. The ship has sailed for Squad, unfortunately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Efter years of experience, i can say that the community in squad is the singularly most toxic community especially when it comes to its admins and servermods acting like 12 year olds. a lovely game when players cooperate, but after years of freee weekends it has been ruined with players who dont get help and dont know what to do. If you join a clan its guranteed for you to be harassed by the members and admins with more years. the servers are still limited and the final nail in the coffin is unreal engine wich was implemented without thought.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been playing since 2020, community and player count has deteriorated since then. Sad to see as the game had so much potential. \n\nOPTIMIZATION:\nGame is so poorly optimized. Used to be able to run it on high-epic graphic settings, now can barely get 40-50 frames on LOW presets on specific maps. \n\nDEVELOPER-COMMUNITY RELATIONSHIP:\nDevs currently in the middle of a employee \"re-organization\". Fired their bozo director who came from a mobile game microtransaction background (rightfully so). Rolled out a community feedback survey, let's see if anything comes of fruition.\n\nCONTENT:\nInstead of rolling out consistent and refreshing updates with new factions, new maps, new kits, optimization, and bug fixes, they dedicate their time to releasing boof skins and emotes that nobody cares for and copying and pasting factions. The only thing keeping this game alive is the modding community which does a far better job than the devs in terms of quality and quantity of content. \n\nTLDR: Game is a shadow of what it used to be or what it could have been. Current state is still playable with fun to be had but buyer beware: Poor optimization, lack of genuine new content, and a misguided developer team.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After the update to UE5 the game looks awful, and runs worse, on anything that isnt a high end pc. The game cant stay open, nor can it even exit properly. Not to mention the player count of this game that seems to be only declining. The devs have utterly and completely fucked this game beyond belief. Tencent ruins yet another ip it touches! There is no point spending your money on this game at this point when you can spend it better elsewhere.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every update they push out they break the game more. Devs keep trying to make \"new content\" when the game is becoming more and more unplayable every time.\n\nI can't recommend buying, too many bugs to actually play at the moment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No need to buy Fireteam Missions. Bots are stupid. It's like a Horde mod for Squad with a size of 5 Players. Each of those 5 players need to own the special missions. \n\nIf you want to play PvE with your friends don't go for Squad, there are better games on the market.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I normally do not leave negative reviews for issues like performance or crashing, but this game runs technically and performance-wise so bad, that you are not even able to get a understanding about how to enjoy the game, because you are simply not able to.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "POS game keeps crashing every time i get to the servers. done with this shit, ever since the ue5 update its been running like shit and crashing on me. plus all the server admins always dick ride their friends and kick you out for claiming a vehicle that their friend wants. sadly will be uninstalling and will remember what this game used to be and not what a cesspool it turned out to be",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just. So. Many. Bugs. I don't know why these bugs are still standing in the game with the insane amounts of user feedback provided on forums, through influencers, etc. The optimization is absolutely horrible after the UE5 upgrade. I constantly get frame drops aiming down sight, I lose some things like the ranger finder on an ultrawide monitor, etc. I think Arma Reforger has pushed into what this game should. I'll be swapping over sooner as there is a sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bugs have gotten out of hand and the devs show no intention of fixing them. This is a prime example of the devs or whoever is controlling the devs not listening to community feed back. like who tf wants a pve mode when there are a PLETHORA of bugs in the actual game. The devs have lost focus on what made this game great and now they are suffering because of it. people will say players are leaving bc of bf6 however its obvious that people are starting to wake up and are jumping ship. Please do not buy until the devs actually do something that benefits the actual player base instead of their wallets",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had this game since like v7 or 8. Game used to be amazing and was really great for a long time.  Now the performance is garbage and gun play is okay a best. Plus with the amount of stuff that OWI breaks and then never fixes, it makes the game at this point the game is no longer worth playing.  Non-high end computers will barley even be able to play and top end ones will still get consistent crashes.  OWI just doesn't care they will release a new faction with multiple skin packs, rather than fixing any issues that are constantly brought to their attention by the players.  I really could go on forever about what has gone wrong with this game but it is just a waste of my time at this point. The only good thing that came out of this is I still play with a core group of friends from this.  Good luck getting that now though as the player numbers are tanking.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’ve been playing this game for years, and the pattern is clear. The ICO overhaul that was later reversed, along with the recent UE5 update, show that functionality isn’t a real priority. I remember a blog post last year about optimizations. They even mentioned removing the “check if shovel is out every tick” process, and it gave me some hope that the developers were starting to understand the game’s deeper issues.\n\nIf they can genuinely refocus and act fast, there’s still a chance to turn things around. But right now, it’s in a downward spiral. Other titles, like Reforger, are rapidly closing the gap on what makes Squad unique. Every engine has its flaws, but if competitors fix theirs faster, Squad won’t last.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Been playing for years. Squad has gone downhill. Since ICO and UE5 update the game has moved toward corporate greed micro transactions. It seems the company has been bought out by corporate hawks and chinese imposters. Last new map was Harju and that was a modded map. Devs have been doing everything but helping the community. They are more focused on monetization and more sales. And their is no anti hacker engine. Easy anti-cheat is a joke and does nothing to combat Zen users. I wish i never played this game to see it go downhill. Anyone giving this game a good review is a bandwagon new player and they havent seen Squad decay into the horrible state it is in now. They have totally thrown milsim out the window and want to be more like Fortnite and Call of Duty. Also, this Canada company Offworld Industries is obviously anti-American and Anti-Conservative and they censor anyone with critical opinions and blackmail and blackball critics who dont agree with direction of game. A few radical Canada liberal censors are Deterex Offworld Dev and Unknown server leader Meckle. They seep their hypocritical ideology into the game and punish anyone who calls out abuse, conflict of interest and questionable business practices. These Squad community admins and Devs who put them into these positions is same problem u have in Roblox and Discord. There is no accountability to immoral and illegal activity. And Offworld and license providers turn a blind eye. And im guessing Steam has no idea the internal community of Squad on Discord and communitybanlist.com is corrupt and fabricated illusion of support. Just some Discord junkies having authority trip and banning anyone with different opinion or is apart of different clan. Also servers like EGC Elite Gaming Corp send viruses to people who appeal bans in ticket. And if you dare ask questions, the EGC community admin put in place by Offworld will ban you. Where is the accountability? Where is the support. Seems this company is immoral and politically charged against conservatives. They are liberal corporate censors. I didnt know this was reddit lmao",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great concept with horrible execution. Constant bugs, blatant cheating and straight up unfinished game mechanics.\nNot worth giving OWI 50$ for this half-baked homunculus of a game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Paid full price for this game recently only for them to announce/release a PVE gamemode which has most of its content locked behind a paywall lmfao. Clowns.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not alot of hours played but ever since they've switched to UE5 its gone to shit. Scopes not loading, texture bugs like missing vehicles. My PC isn't great but it was still able to run it at 40fps Wich is played when it was on UE4. Now even with max optimization and low settings i get 20 and its buggy as hell. Squad is a great game and I'd love to play it if i wasn't for UE5 fucking over my experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Added an invasive kernel-level anti-cheat into the game after I bought it years ago, so now I can't play the game I purchased (a license) to play without allowing/ignoring a security and privacy violation.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I wanna say firstly that I have enjoyed playing Squad a lot. There is so many different ways you can expirience Squad and I feel like Squad has the perfect balance with action to downtime gameplay. But hitting that 1000hr mark, the game starts to feels kinda repetitive. And I have noticed that other veterans have said the same. In my opinion content is usually a good way to keep a game fresh. But recently I feel like Offworld studio have been focusing on the wrong things. We got UE5 update that nobody really asked. With the update we got a lot of bugs. UE5 also really favors people with higher end PCs, i struggle to get 60 fps in certain maps. And generally optimization isn't that great. I get stutters and fps drops quite often. \n\nThroughout the year we have gotten emote packages, which personally dont mind beacause the more radical emotes are usable only in Main Base. But these are all resources spent somewhere else. And the most recent Update 10.0 includes mostly RECYCLED content. We are getting the Ukrainian faction with a lot of the same weapons and vehicles we already have. It really feels like that this was a \"necessary\" Update push to keep players happy, but dont be fooled. This isn't really that much of a new content. \n\nThe general vibe what I'm getting of Offworld is greed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Puting mission behind a paywall after saying you would never do that. Like the game but fix the bugs bugs before you screw us over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a little over 400 hours in this game and it was one of the reasons i even got a pc in the first place. But this game has gotten to the point its pretty much unplayable due to the devs putting every bit of effort into changing to UE5 instead of fixing game breaking bugs. I would come back to this game if they would focus on making it less buggy and if they implemented some sort of system so players will actually work as a team instead of treating it like cod. All in all this game has good roots and can be returned to being a great game but the devs need to actually listen to the players.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There are lots of ways to improve game, such as long standing bugs and mesh issues. But devs decided to spend time on PVE. Imagine a pve mode in MOBA, funny right?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is hard. Not because of the gameplay — I wouldn’t know, since I can’t even get past the anti‑cheat. Squad is basically a $50 anti‑cheat simulator where the only battle you fight is against your own PC.\n✅ Features include:\n- Staring at error messages\n- Reinstalling drivers for the 12th time\n- Wondering if the devs tested this thing on anything other than a potato\n⚠️ Gameplay tip:\nIf you manage to actually launch the game, congratulations — you’ve already beaten the hardest boss in Squad.\n🎯 Verdict:\nForget firefights. The real war is between me and the launcher, and I’m losing",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the \"update\" to unreal engine 5 was so braindead it somehow made the visuals worse aswell as making the game run even worse",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bought this game years ago and now i cant even play it due to the anti cheat i can play hell let loose same anti cheat on it but i cant even play this game for some reason new ssd new windows install bios reset and nothing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Alright, let me make it clear. I'm not reccomending this game mostly because of a big part of the playerbase and community.\n\nI've played a few hours of \"Squad.\" and what i've collected is that if you don't have a very deep voice, do not buy this game.\n\nI'm not a squeaker or any salty 7 year old by any means, but I don't really have a \"Deep voice.\" it's, average sounding for my age at best. I'm a teen, so what can you expect?\n\nSo I decided to grab this game for my birthday, had some money lying around from multiple gifts from relatives so I thought \"Screw it, why not?\" the tutorial is very immersive. My laptop had some issues running it, but nothing a little NVIDA DLSS can't fix right?\n\nAnywho, I load into my first match and IMMEDIATELY when I start speaking I am ignored, muted, and booted from the Squad.\n\nI try and join another one, everything seems good. Then I open my mouth and ask a question, the rest of the guys get out. Get back into the car, I get back in. They kick me out and drive away.\n\nIn mere hours, I have experienced GROWN MEN treat me like a background character the entire match, forcing me to not use the #1 thing this game is known for. Communication in EVERY MATCH. \n\nI attempted texting through chat, ignored. Don't speak at all? Congratulations you are now as worthy as the common fly in terms of value to the team.\n\nSo I'm at my witts end, I tried asking about this on the games Reddit, how to grown adults to stop kicking me out because of a VOICE but everything was quickly removed by Reddit's filters. \n\nI really wish I could refund this game and now it has became food for my Game Goblins in the steam family.\n\nIn short, don't buy this game if you aren't atleast 17 - 16, you will be put on the Mute block and booted from the squad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a ten dollar increase on a 5 year old game and a $8 for a PVE nobody asked for? Really? you change fundamental concepts of the game every update, which alienate current players, then you price hike the game, which isnt going to work because why would you pa full price for a dying game. so when you put it on sale again and new players buy, the \"new profit margin\" doesnt matter.\n\nTL;DR: Fuck owi, money starved business that doesnt care about anything about the profits and will fuck you over every update.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game always downloading update, consumes huge amount of SSD space and I can not understand what exactly can weight so much. I entered to to check for updates after long pause. So, it runs harder even in training ground and crushed 3 times in 15 minutes (first time directly from menu). I like this game but feels like it is constant beta.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can be fun, but the game constantly crashes or has some weird cascading effect on my computer. Also, the HUD is awful, and navigating through the menus is not intuitive at all. Better battle sim games out there. Buy at your own risk.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The UI is actually worse than Arma 3. \n\nThe stability is worse than Arma 3.\n\nI will only play it if my friends will play. Otherwise it will sit in my library collecting dust after fighting with a bug ridden mess of a game that has no business of being this bad for all the promise it has.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Only have had the opportunity to play 40hrs before the new UE5 update made the game a stuttery unplayable mess. Really disappointed as the concept of the game I really like with moddability etc. \r\nSome of the poorest development choices in a game I've actually played, never have I had a perfectly running game turn into unplayable overnight. Am considering a complaint to steam about this since it is false advertising. NO LOW on UE5 IS NOT = TO MED/HIGH on UE4.\r\nMy 7500f ryzen cpu and 1660ti had zero issues on the old engine in my first 40hrs, perfectly smooth gameplay, \r\n\r\nDevelopers either optimise your game or give refunds for those of us who have had the opportunity taken away from us, this garbage version of your game was not fit for purpose and if this wasn't a digital purchase I would already have my refund. Minimum specs generally mean everything on low will give a stable experience... or if your cpu is above requirements definitely a stable experience with a lower spec gpu when all gpu setting are at a literal minimum everywhere possible. Only game on steam I regret purchasing wholeheartedly.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After update i lost about 50 fps on 9800x3d and 5080. Game is boring and unplayable in vanilla so you have to suffer weird and buggy mods. Cool. Go play arma reforged boys, it's way better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After spending a lot of time with the game. It can be fun at times when you have a whole squad working together and talking. But that fun only comes about if the game works half the time. I have meet amazing people on the game and have joined amazing communities as well. It just sucks that I feel like I'm being driving away from the game because of bugs and optimization and lack of fixing old game modes.\n \nBugs - It's not fun when you are trying to drive a vehicle only for it to become a pillbox because it won't move anymore because of a bug. It's also not fun playing as infantry because of a bug that's been in the game forever called the reload bug. Where you character looks like they have reloaded but they really haven't. Plus the recent bug for the guns that shoot out way to much smoke when you shoot so you can't see. \n\nThese are just a few I have named the game has many game breaking bugs that the Devs refuse to fix. They will just put out another faction and hope that it makes you forget the game doesn't work long enough for them to put out the next faction.\n\nPs. The comment about fixing the game means nothing if it's not actually done. I have been hearing the \"we are fixing the vehicle problems\" back since UE4 and I bought into the hype of the Devs promising that they would be fixed in UE5 update. But now we need several updates to fix them again.\n\nFixes that need to happen: \n*The bugs and optimization (You know the bugs that are causing issues the community talks about them all the time fix them. Also optimization needs to be looked at)\n*Old game modes that need to be fixed and reworked (This has been talked about as well since back in UE4 but has never happened.)\n\nEdited review: I have updated this review to put more into it. I had someone come forward and tell me that the comment added to this review has been said in the past by the Devs with nothing ever happening. I want you to prove me wrong and fix the game and make me wan't to play it again but I doubt anything will change.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is not launching and give error every time...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Complete garbage from optimisation, 1650 after literally fighting with my system I got a maximum 40 frames, I runned battlefield and star battlefront 2 with much better performance got to 90 frames and this game just wasted my money on it, not removing the comment until I retake my money or the company fix this piece of garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "destroyed the game ...\nno optimize, no updates and terrible performance",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Descent Milsim but I prefer Arma Reforger. Can't put my finger on it but arma is more approachable and easy to get going.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developers at Offworld Industries have completely lost focus on their community. Instead of the promised optimization and bug fixes, for years we have seen only one goal - attracting new players. Old, bug-ridden problems are ignored for years!\n\nUnfortunately, OWI has no desire to handle the training of these newcomers either, shifting this problem onto our shoulders. \"You train and punish them...\" is their stance. There are so many new players that they cannot be taught, and they are left to \"stew in their own juice,\" degrading the gameplay experience for everyone. Administrators cannot cope with the influx of offenders, and OWI is stripping servers of their last effective methods of dealing with them.\n\nServer owners pay money for rentals, spend hundreds of hours on administration and building communities, and in return, they are spoken to with threats, promising to revoke licenses for the slightest disobedience. We are free labor and just a source of income that OWI simply doesn't care about.\n\nAs long as sales continue, they don't need the veteran players. So let's hit them where it hurts - the sales.\n\nCALL TO ACTION: If you agree, if you are tired of empty promises and bugs, copy this review and publish it as your own. Let the developers see that we are not a bargaining chip. Spread this like a virus! Let's not let them forget about their promises.\n\nP.S. I will change my rating when I see REAL work on optimization, bug fixes, and a RESPECTFUL attitude towards server\n#faq_owi\n\nTo add my own bit to this review, OWI made a Dev Q&A recently and then they posted a meme on their twitter about the questions being too long. Out of touch. They then removed it, but its too late. I feel betrayed by ICO and UE5 update and my product was essentially stolen from me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is a joke. Squad's dont work with one another, the developers dont release anything meaningful to drive engagement with the playerbase, the game is dying and it makes sense.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "UE5 sucks and the game is getting harder and harder to run. They don't care about the playerbase.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "10.0 fixed recon drones, now unplayable with artillery etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since the update to Unreal Engine 5, the performance has been extremely poor. I get heavy FPS drops and clear stuttering, especially when I aim with my weapon. There are also still regular bugs in important gameplay features.\nThe game is dying, while OWI keeps adding content that nobody asked for instead of fixing the problems the game has.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "клоуны на коммунити забили",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tried everything possible and the anti cheat is having flashbacks to charlie in the trees. literally cant start it. Updated everything, validated the game, disabled overlays... still nothing. Even looked through the files and checked for problems and nothing changed. would constantly show errors.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uninstalled almost immediately. Ancient game engine. Way way way too much minutia. Bugs with EAC. Glitches with things like guns not firing and stutters/frame drop when zooming in. Wasted my money, I'm afraid.  Don't make the same mistake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was amazing and the dev team slowly killed it with shit updates and \"fixing\" problems that were not problems. I hope the new devs they get will do a better job.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "With the latest update i can no longer run the game, I think it is stupid how the devs keep focusing on shiny new things and factions rather than trying to fix the issues with onboarding and keeping the game playable for the audience that already loves the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You can no longer run this game unless you have a high-end PC. They updated the engine and locked out most of their player base. We played this game for so long, and they took it away from us by changing the engine that no one asked for. They should be giving out refunds because they messed up the game that we originally bought. They should have released a second game with the new engine instead of ruining this game for so many people.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When you hit the minimum thresh hold of enough players on both teams knowing what they're doing this game can be a lot of fun. However lately the developers have been been just a wee bit incompetent with the additions they've been adding to the game. Like making an \"infantry\" update that in the vacuum of infantry v infantry gameplay would be fine but they forgot vehicles exist. Vehicles existing when gunplay (including anti tank weapons) all being collectively slowed leads to your average team of sub 1000 hour non omega tryhards being massacred by vehicles. \n\nThis gets followed up by adding a faction that's utterly reliant on infantry AT weapons to fight off vehicles, which often results in said faction getting steamrolled by the 2-4 people on the opposing team that know they can drive any common rifle immune armored auto cannon equipped vehicles straight into common early areas to force half of the enemy team back to spawn to potentially repeat getting seal clubbed all over again.\n\nThen they do an entire engine overhaul that makes the game run significantly worse, changes how every vehicle handles, and will blind you with muzzle smoke every time you shoot. This so far has resulted in the game hemorrhaging active players. \n\nThe playerbase is still healthy enough that you can probably always find a server to play on at normal hours. That said, with experienced players leaving and the in game tutorial only really covering the absolute bare minimum, Squad has been experiencing a brain drain of players that know how the game functions and help make sure things like spawn points and ammo to shoot at enemies are available for your team.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keep fucking up the game . going back to ICO again what the fuck .. just fix the optimization .. and with the new features being monitized its a kick in the face to the original supporters of the game ..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O jogo é muito bom mesmo, mas depois do update em que eles migraram pra Unreal 5 ficou injogável. Eles ignoraram completamente os problemas de otimização que já existiam antes do update novo e partiram pra nova engine, que já é bem mais pesada.\n\nacho que eles provavelmente nn vão fazer nada quanto a isso.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be good, now it's nigh unplayable.\n\nI'm not even going to touch on the ICO, there are much bigger nerds in reviews giving their opinion, but the Unreal Engine 5 update made the performance so abysmally awful, that it's just not fun, or even comfortable to play.\n\nTo pour salt into the wound they recently announced a PvE mode, which in theory might be an okay idea, except they immediately fuck it up by making it 5 player only, and worst of all PAYWALLING vast majority of the PvE missions (with even more expensive DLC giving you le epic skins), making the whole mode a joke. All this without any planned performance optimization, so it will probably run as bad as the PvP mode. Just save yourself the money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Put hundreds of hours into this game, probs one of the best gameplay mil sims I played.\n\n Until they changed all the gun mechanics…",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is poorly optimized and continually crashes, each update just seems to make issues worse instead of fixing anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's ok I cant really get into it and after the ICO update i stopped playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ave a lot of time played in Squad, and even though most matches are 85% boring, I still love the 15% of actual gameplay. I can understand Squad selling things to make more money, but this new Fireteam PvE gamemode is just stupid. The fact that we have to pay for missions like it’s a mobile game is ridiculous.\n\nThe game just got its first update in over a year, and the playerbase is slowly dying because no meaningful gameplay changes or new features have been added to keep it interesting. I just hate the direction Squad is going, and I wish I could make it stop. OFF WORLD SELL YOUR OTHER TITLES are focus on squad anything else they make it dead L company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to give this game another chance after several years and I am getting crashes with different error messages each time I want to join a server. Wtf are these devs doing?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was great enough to start out with when the scope was small and it was just a successor to its project reality roots, however the game is maligned now and just generally unplayable\n\nnoodle arm soldiers, terrible performance, weird and hard to understand gameplay choices that lead to a game that wrestles control from the user and feels absolutely terrible to play. I have never interacted with a game that does so much to take mechanical control away from a player, feels like apple bobbing with no teeth\n\nI liked this game, it was fun to explore the maps, that turned to dust. OWI have no creative direction and are bankrupt for good ideas.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can barelly run the game as is so i guess thats a skill issue on my part, but why in the word do 3 out of 4 preset textures have a combined 4 pixels and on the 4th one it turns into 4k full fidelity",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Still no appreciation of the PvE/Coop players. Bought the game early in development hoping they would \"continue\" project reality (as they said back then) now years have passed, bots finally arrieved scaled down as a f-ing dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this with friend a lot, I don have a lot of hours and I played it every now and then but before the new updates this game used to be my favourite milsim, but now every time I get in game to play a map I usually either crash immediately or five minutes in due to some random error, my pc cannot run this anymore and I am quite upset since I miss the old squad where I could play this for as long as I want.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game use to be really good but now everyone plays with the settings off so its unplayable unless you play the same way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was making good progress but releases a paid PVE DLC instead of fixing game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is ok but community sucks real bad .. \r\npretty much every game u enter all Squads are locked and if you are lucky to find a squad open your kicked within 5 mins or less so you have one mag of ammo and a recruit kit .. most  servers say new player friendly but that's really not the case .. the very few games i have had are fun but play one game and spend next two hours trying to get another.. there is similar games like this with a far better community base. ego trip players who lock everything and boot everyone your best grabbing another shooter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-$40 cant even open game anymore thats why arma reforger will take over lol git better HAHAHAHAA",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried playing this game again and I was forced to watch some pointless video. The game is broken because after it's just a black screen and nothing happens. Then for some reason it needs to download another 44gb of content. I used to like Squad but the game is broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Woke developer team with terrible servers. Vanilla game mode is terrible and server queue is unplayable. Often have to wait over 30 minutes just to enter a server. The standard game weapons are embarrassingly basic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developers at Offworld Industries seem to have completely lost sight of their community’s needs. Instead of delivering the long-promised optimizations and bug fixes, their focus for years has been centered solely on attracting new players. Meanwhile, long-standing issues and persistent bugs remain unaddressed. \n\nTo make matters worse, OWI shows little interest in helping newcomers learn the game, leaving that responsibility entirely to the community. Their attitude essentially boils down to: “You train and punish them.” The influx of inexperienced players has become so large that proper training is impossible, resulting in noticebly worse games. And they keep getting worse for every month that passes because the experienced players are 100% fed up. Server administrators are overwhelmed by the number of rule-breakers, yet OWI continues to remove the few effective tools servers had to manage them.\n\nServer owners put their own money into server rentals and dedicate countless hours to administration and community building, only to be met with threats of license revocation for even minor disagreements. Admins and moderators are treated as unpaid labor —nothing more.\n\nAs long as the sales keep flowing, OWI seems content to disregard its veteran community.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Down to its very core, Squad is a great game. It serves as a comfortable middle ground between Battlefield and Arma, the very same way Hell Let Loose does. \nHowever, due to questionable decisions made by the developers, such as: \n-switching the engine from UE4 to UE5 without any real thought or effort \n-making gunplay wonky and awkward with the ICO update\n-and not fixing bugs and issues that have been plaguing this game for years\nI can't really recommend buying this game in its current state. And it's really sad, because there aren't really any other games that scratch the modern tactical team-focused shooter itch the same way Squad does.\n\nI am not overexaggerating by saying that if Offworld is going to continue to run things the way they are right now, it's going to kill this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The positives \nThis games if you have a mic and longer than BF or COD Patience than this game is for you because you will be rewarded with awesome firefights and good teamwork(only if you play in a team and as a Team with Patience). \nAlso the mods are insane You can play Star Wars as a stormtrooper or Clanker with all the illuminated blaster fire going left and right to your heart’s content or play as Fractions of real life conflicts like Israel vs Hammas. \n\n\n\n\nThe Negative \nSeriously I am sad to see that I can’t play my favourite game anymore since UE5 because of constant FPS drops below 5.\n\nAnd I know I am playing on a gaming laptop (1300€) and people will just say just buy a good pc duh but still that’s not an excuse for OWI not Optimizing the game. And they said that ue5 wil get rid of the 10 and 20 series of graphicards players. How the F^<k am I in that category.\n\nI have all my Settings on low in squad.\n(Except uncap texture pool size because all textures get buggy) \n              AND I AM STILL SUFFERING \n\nMy setup can run fully FULLY MODDED VR GAME  like Skyrim or blade and sorcery.\nSo my hardware is pretty decent and on the higher end.\n\nSO PLS OWI I JUST MAKE MY FAVOURITE GAME PLAYABLE AGAIN.\n\n\nMy Hardware\nCPU Ryzen 7 6800h\nGpu RTX3070ti (VRAM 8GB)\nRAM 16gb (I am planning of upgrading it two 32gb in hops that it will help performance",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not waste your money on this game. You want to buy games which you can actually PLAY. The new update has caused ridiculous stuttering making your experience miserable.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}