{
  "positive": [
    {
      "review": "The advantages of the first game are multiplied, and the weaknesses are fixed. An absolute masterpiece!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "great game, nostalgia aside it remains a great game for its time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, 81.6h on steam to do all I did. \n- Loved walking around exploring; there are no quest markers or yellow paint anywhere, all quests require you to read/listen to dialogue details and then there's also a questbook, which just gives a general idea of what was already said so there's stuff you actually gotta figure out\n- Enemy AI is not just walk forward and swing at you, they will also backstep or block attacks when in range, some animals will also sidestep to avoid being hit, although they will walk straight towards you when engaged, sometimes getting stuck on terrain (lmao)\n- Dragons are a bit weird with their fire breath attack, doesn't seem to have a proper counter and it just does dmg and pushes me away\n- Has a few mechanics attached to framerate, like jumping to climb onto walls/ledges, where sometimes the character just refuses to grab and climb on higher framerates than 60, but most notably is that dragons have a tiny health regen passive, which heals for hundreds a second if the game is not capped at 60fps and makes them unkillable (lmao)\n- Controls are a bit dated and weird at first, but it's easy enough to get used to\n- Story was really cool, got me invested until the very end and had no stupid main story missions to just make the game last longer (looking at you, FFXVI)\n\nOverall I'd give it a personal score of 8.6~9",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gothic II: Gold Edition — aww, such a great game!\n\nOne of my absolute favorites! Fantastic atmosphere, great characters… I love it and highly recommend it! 💜",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the spine 1.43 config module of the freeware-tool \"spine\" seems to be in condition of a nedessity to fix.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hoo boy did it take me a while, but i finally get the combat and leveling. game is so fun after clearing that hurdle lmao. tips for beginners:: take your time, enjoy the world, and ALWAYS SAVE BEFORE FIGHTS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favorite game. I've been playing it since childhood times and I'm playing it now when I'm older. Highly recommended. Also it's status in the Polish community is legendary.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best game in the series, hands down, it does a god job on picking up where the last game ended. Plus the story is amazing. This one is actually the best game in the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nothing much to say tbh,masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best classics out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You shouldn't believe everything you hear.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "handsome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like its prequel, its awsome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best rpg ever",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Legendary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blast from the past",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "des gspiarsch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What with?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEst game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nostalgy :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "polecam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "G.O.A.T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best sequels in gaming. Gothic II improves on nearly every aspect of the original Gothic though it carries forward one unfortunate staple of the series bugs. The story picks up directly after Gothic. The nameless hero (a running gag, as he’s always interrupted whenever he tries to introduce himself) has destroyed the barrier and freed the prisoners, but ended up trapped himself. His mentor, Xardas, rescues him in a weakened state after some time has passed, just as a new and greater threat emerges on the island of Khorinis. Meanwhile, on the mainland, the war against the orcs is going poorly, and the king has sent his paladins to secure as much magic ore as possible since magic weapons are humanity’s best chance. On Khorinis, the king’s increasing taxes have sparked uprisings among the people.\r\n\r\nThe game shines in its characters, humor, and world. The story is excellent, full of twists and surprises, and it’s especially rewarding for players of the first game you’ll reunite with old friends and be hit with waves of nostalgia. Gothic II is a prime example of how to create memorable NPCs you genuinely care about. The lore and world building are expanded with more about the gods, faith, politics, and society. As before, you’ll need to choose a faction, and there are rumors of a hidden thieves’ guild not to mention a chance to revisit some familiar places. The world was massive for its time, and there’s plenty to explore, but beware  you can wander into areas far too early, and you won’t be ready for what lurks there. Once again, bows are king in combat, and I’d recommend sticking with them. A new addition is the crafting system you can become an apprentice in a profession (you can dabble in several, but eventually must choose one). Weapon forging, animal gutting, potion brewing there’s plenty to experiment with. The leveling system remains the same earn XP, level up, then spend skill points to boost stats or learn abilities from trainers. A quick tip stats get more expensive after certain thresholds, so raise them just below the increase, then push them up in larger increments to save points.\r\n\r\nOverall, Gothic II is a classic that still holds up today. Its atmosphere, characters, and story continue to win players over. And with the Night of the Raven expansion released later and widely considered the ultimate Gothic experience (after patches, of course) the game became truly legendary. Gothic 3, hindered by development troubles, couldn’t live up to it, and Gothic 4 felt more like a name grab for a broader audience.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "One of the best games ever made!\r\nI play this game almost every year just to relive the experience once again.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The best RPG I’ve ever played. No auto HP regen, no teleports at the very beginning of the game, and no stupid mounts.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game, 81.6h on steam to do all I did. \n- Loved walking around exploring; there are no quest markers or yellow paint anywhere, all quests require you to read/listen to dialogue details and then there's also a questbook, which just gives a general idea of what was already said so there's stuff you actually gotta figure out\n- Enemy AI is not just walk forward and swing at you, they will also backstep or block attacks when in range, some animals will also sidestep to avoid being hit, although they will walk straight towards you when engaged, sometimes getting stuck on terrain (lmao)\n- Dragons are a bit weird with their fire breath attack, doesn't seem to have a proper counter and it just does dmg and pushes me away\n- Has a few mechanics attached to framerate, like jumping to climb onto walls/ledges, where sometimes the character just refuses to grab and climb on higher framerates than 60, but most notably is that dragons have a tiny health regen passive, which heals for hundreds a second if the game is not capped at 60fps and makes them unkillable (lmao)\n- Controls are a bit dated and weird at first, but it's easy enough to get used to\n- Story was really cool, got me invested until the very end and had no stupid main story missions to just make the game last longer (looking at you, FFXVI)\n\nOverall I'd give it a personal score of 8.6~9",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "w nazwie 2 jest od drugi najlepszy system walki w grach rpg, niestety pomylili się przy pisaniu obliczeń obrażeń, tak byłby lepsze od gothic 1",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well. It has been and still is a great game, probably the best one in the Gothic series if you consider both technical and storytelling.\r\nBy modern standards, I imagine there would be a lot of complaints about stiff controls and such, but for the most part, this game is balanced around that.\r\n\r\nWhat you are getting here is a good, classic action adventure RPG where you can spec your hero into various classes that focus on different things. Except for the path of the mage, which is the exclusive way to get access to rune magic, you are still free to learn whichever combat style you want: one handed or two handed swords, hammers, staves and axes, and a variety of bows and crossbows. The other classes can still use \"single use\" magic items, which are of course more limited but still allow tactical magic use on occasion.\r\nGood planning ahead is rewarded with a sense of feeling very powerful (although you will still be put in your place occasionally), but you cannot really screw up your stat growth so badly that you become unable to complete the game. As a general rule of thumb: use stat increasing items after you have trained your stats from teachers to where you want/need them. In the core game, I recall you being limited to learning 100 stat points; this limit is increased to 200 if you are playing with the addon, but training becomes more expensive after your stats reach certain thresholds. I have to admit that I have not played the core game since it originally came out - I like the game so much better with the addon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The advantages of the first game are multiplied, and the weaknesses are fixed. An absolute masterpiece!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Thank you for Gothic 2 dan Piranha Bytes that makes this amazing and the best game that i ever know, I've been playing this game since i was in junior high school. Those are great Time when i playing this game when i was a kid. Thank You Gothic 2 and Piranha Bytes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great game, nostalgia aside it remains a great game for its time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gothic II: Gold Edition — aww, such a great game!\n\nOne of my absolute favorites! Fantastic atmosphere, great characters… I love it and highly recommend it! 💜",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game I have ever played. When it first came out I played it for years.  +3000h cant say for sure. \r\nThat final Paladin Armor ... <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complete 10/10 game. One of the best RPG games I've ever played and probably the best of its era. Its really difficult at the beginning of the game, but if you invest enough time you can get really OP, so I think the difficulty is perfect. The game refuses to spoil you a lot of the time, you really have to work for a good build, but its definitely worth it. The NPCs, storyline, and quests in this game are all unique and fun, really memorable characters and there's so much content. \r\n\r\nI will say that because its a really old game, a lot of the mechanics are outdated and janky but it doesn't take long at all to get used to, and I don't think it takes away from the enjoyment (mods definitely fix a lot of those issues as well)\r\n\r\nIts hard to get into a game like this because of how difficult it is at first (the game shows no mercy) but its definitely worth giving it a chance and having patience, its too iconic to miss out on if you love RPGs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the spine 1.43 config module of the freeware-tool \"spine\" seems to be in condition of a nedessity to fix.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hoo boy did it take me a while, but i finally get the combat and leveling. game is so fun after clearing that hurdle lmao. tips for beginners:: take your time, enjoy the world, and ALWAYS SAVE BEFORE FIGHTS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My favorite game. I've been playing it since childhood times and I'm playing it now when I'm older. Highly recommended. Also it's status in the Polish community is legendary.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best game in the series, hands down, it does a god job on picking up where the last game ended. Plus the story is amazing. This one is actually the best game in the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "did not expect to spend so much time the land of mytrana. Great gameplay overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best danged game of all time. Especially with mods and overhaul mods. Personally love masty's l'hiver, or the early acces Eternal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Always will be my comfort game, clasic immersive RPG with great gameplay (despite janky combat system) with a lot of great mod and great community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relentless in the beginning. Rewarding in the middle. Godlike at the end\n\n9/10\n\nОтдельный респект за русскую озвучку",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fully voice acted, Classic RPG, Story is good for me. if you already used to modern \"RPG\" it will be a hassle to getting used to the controls etc, but when u got used to all of that, u easily get emersed to this franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HEY YOU\n*turns around 180 degrees*\nEND\n\nNo seriously, this game has a special place in my heart",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's Gothic man, nothing more to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing much to say tbh,masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xardas brabbelt lieblich.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, sadly use Nintendo patent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Paladins are the best--change my mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best classics out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game as all these years ago!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "przeszłem całe, kozak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "handsome game\n\n\nmogged fallout",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than first episode\n12/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "вторая лучшая рпг игра",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You shouldn't believe everything you hear.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best RPG I've ever played despite all of its bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Like its prequel, its awsome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best rpg ever",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Legendary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blast from the past",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can hoard cheese and beer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "des gspiarsch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What with?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEst game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For Innos!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "banger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nostalgy :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "polecam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hell yeah",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TOP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "G.O.A.T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Gothic 2[/b] starts right after the events of [b]Gothic 1[/b] and remains faithful to the original formula: a detailed, scenic world, open to satisfactory exploration as your skill and equipment allow; advancing ranks in morally ambiguous factions; skill acquisition through trainers; strict build focus (melee, ranged, or magic); restrictive armour-dependent survivability; early grind and late-game overpowerment; and, of course, the charming mandatory address: \"Hey you!\". Several key NPCs from the first game also play a prominent role in the second, and during the second chapter, you get to revisit the Valley of Mines, where the first game took place.\n\n[b]Gothic 2[/b] stands out with detailed multi-stage investigation quests that take you to multiple beautiful locations across different biomes, featuring interesting characters with their own distinct personalities and daily routines. This all adds to the immersiveness that the game series is beloved for by its fans.\n\n[b]Night of the Raven[/b] adds even more of that, effectively doubling the game's content. It also ramps up the difficulty quite a bit. Overcoming this requires a lot of grinding in the early game, which may feel overwhelming at times, as does the amount of extra information and quests thrown at you from the beginning. However, this is balanced by an additional game area with new biomes, three new factions, stronger weapons, and an intricate quest line that integrates nicely into the main game.\n\nAside from some poorly communicated hints in certain quests and the constant backtracking (which is less problematic once you get a hold of teleportation stones), there isn't really much to complain about. [b]Gothic 2[/b] is a solid genre classic that, above all, offers an immersive and exciting world that's fun to explore.\n\nI greatly recommend it to all fans of dark fantasy and hope that, someday, it will receive a remake just like the first game did.\n\n[b]My overall rating[/b]: [u]9/10[/u]\n\nEven better with [url=https://www.nexusmods.com/gothic2/mods/91?tab=description]Vurt's graphic overhaul[/url]and [url=https://www.nexusmods.com/gothic2/mods/95]Hedin's sky textures[/url].",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I will leave the cat here, so that everybody who passes by can pet it and give it a thumbs up and awards.\n　　　 　　／＞　　フ\n　　　 　　| 　_　 _ l\n　 　　 　／` ミ＿xノ\n　　 　 /　　　 　 |\n　　　 /　 ヽ　　 ﾉ\n　 　 │　　|　|　|\n　／￣|　　 |　|　|\n　| (￣ヽ＿_ヽ_)__)\n　＼二つ",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best sequels in gaming. Gothic II improves on nearly every aspect of the original Gothic though it carries forward one unfortunate staple of the series bugs. The story picks up directly after Gothic. The nameless hero (a running gag, as he’s always interrupted whenever he tries to introduce himself) has destroyed the barrier and freed the prisoners, but ended up trapped himself. His mentor, Xardas, rescues him in a weakened state after some time has passed, just as a new and greater threat emerges on the island of Khorinis. Meanwhile, on the mainland, the war against the orcs is going poorly, and the king has sent his paladins to secure as much magic ore as possible since magic weapons are humanity’s best chance. On Khorinis, the king’s increasing taxes have sparked uprisings among the people.\r\n\r\nThe game shines in its characters, humor, and world. The story is excellent, full of twists and surprises, and it’s especially rewarding for players of the first game you’ll reunite with old friends and be hit with waves of nostalgia. Gothic II is a prime example of how to create memorable NPCs you genuinely care about. The lore and world building are expanded with more about the gods, faith, politics, and society. As before, you’ll need to choose a faction, and there are rumors of a hidden thieves’ guild not to mention a chance to revisit some familiar places. The world was massive for its time, and there’s plenty to explore, but beware  you can wander into areas far too early, and you won’t be ready for what lurks there. Once again, bows are king in combat, and I’d recommend sticking with them. A new addition is the crafting system you can become an apprentice in a profession (you can dabble in several, but eventually must choose one). Weapon forging, animal gutting, potion brewing there’s plenty to experiment with. The leveling system remains the same earn XP, level up, then spend skill points to boost stats or learn abilities from trainers. A quick tip stats get more expensive after certain thresholds, so raise them just below the increase, then push them up in larger increments to save points.\r\n\r\nOverall, Gothic II is a classic that still holds up today. Its atmosphere, characters, and story continue to win players over. And with the Night of the Raven expansion released later and widely considered the ultimate Gothic experience (after patches, of course) the game became truly legendary. Gothic 3, hindered by development troubles, couldn’t live up to it, and Gothic 4 felt more like a name grab for a broader audience.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "One of the best games ever made!\r\nI play this game almost every year just to relive the experience once again.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The best RPG I’ve ever played. No auto HP regen, no teleports at the very beginning of the game, and no stupid mounts.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game, 81.6h on steam to do all I did. \n- Loved walking around exploring; there are no quest markers or yellow paint anywhere, all quests require you to read/listen to dialogue details and then there's also a questbook, which just gives a general idea of what was already said so there's stuff you actually gotta figure out\n- Enemy AI is not just walk forward and swing at you, they will also backstep or block attacks when in range, some animals will also sidestep to avoid being hit, although they will walk straight towards you when engaged, sometimes getting stuck on terrain (lmao)\n- Dragons are a bit weird with their fire breath attack, doesn't seem to have a proper counter and it just does dmg and pushes me away\n- Has a few mechanics attached to framerate, like jumping to climb onto walls/ledges, where sometimes the character just refuses to grab and climb on higher framerates than 60, but most notably is that dragons have a tiny health regen passive, which heals for hundreds a second if the game is not capped at 60fps and makes them unkillable (lmao)\n- Controls are a bit dated and weird at first, but it's easy enough to get used to\n- Story was really cool, got me invested until the very end and had no stupid main story missions to just make the game last longer (looking at you, FFXVI)\n\nOverall I'd give it a personal score of 8.6~9",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "w nazwie 2 jest od drugi najlepszy system walki w grach rpg, niestety pomylili się przy pisaniu obliczeń obrażeń, tak byłby lepsze od gothic 1",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well. It has been and still is a great game, probably the best one in the Gothic series if you consider both technical and storytelling.\r\nBy modern standards, I imagine there would be a lot of complaints about stiff controls and such, but for the most part, this game is balanced around that.\r\n\r\nWhat you are getting here is a good, classic action adventure RPG where you can spec your hero into various classes that focus on different things. Except for the path of the mage, which is the exclusive way to get access to rune magic, you are still free to learn whichever combat style you want: one handed or two handed swords, hammers, staves and axes, and a variety of bows and crossbows. The other classes can still use \"single use\" magic items, which are of course more limited but still allow tactical magic use on occasion.\r\nGood planning ahead is rewarded with a sense of feeling very powerful (although you will still be put in your place occasionally), but you cannot really screw up your stat growth so badly that you become unable to complete the game. As a general rule of thumb: use stat increasing items after you have trained your stats from teachers to where you want/need them. In the core game, I recall you being limited to learning 100 stat points; this limit is increased to 200 if you are playing with the addon, but training becomes more expensive after your stats reach certain thresholds. I have to admit that I have not played the core game since it originally came out - I like the game so much better with the addon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The advantages of the first game are multiplied, and the weaknesses are fixed. An absolute masterpiece!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Thank you for Gothic 2 dan Piranha Bytes that makes this amazing and the best game that i ever know, I've been playing this game since i was in junior high school. Those are great Time when i playing this game when i was a kid. Thank You Gothic 2 and Piranha Bytes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great game, nostalgia aside it remains a great game for its time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gothic II: Gold Edition — aww, such a great game!\n\nOne of my absolute favorites! Fantastic atmosphere, great characters… I love it and highly recommend it! 💜",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game I have ever played. When it first came out I played it for years.  +3000h cant say for sure. \r\nThat final Paladin Armor ... <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complete 10/10 game. One of the best RPG games I've ever played and probably the best of its era. Its really difficult at the beginning of the game, but if you invest enough time you can get really OP, so I think the difficulty is perfect. The game refuses to spoil you a lot of the time, you really have to work for a good build, but its definitely worth it. The NPCs, storyline, and quests in this game are all unique and fun, really memorable characters and there's so much content. \r\n\r\nI will say that because its a really old game, a lot of the mechanics are outdated and janky but it doesn't take long at all to get used to, and I don't think it takes away from the enjoyment (mods definitely fix a lot of those issues as well)\r\n\r\nIts hard to get into a game like this because of how difficult it is at first (the game shows no mercy) but its definitely worth giving it a chance and having patience, its too iconic to miss out on if you love RPGs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the spine 1.43 config module of the freeware-tool \"spine\" seems to be in condition of a nedessity to fix.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hoo boy did it take me a while, but i finally get the combat and leveling. game is so fun after clearing that hurdle lmao. tips for beginners:: take your time, enjoy the world, and ALWAYS SAVE BEFORE FIGHTS.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I feel like the positive reviews are nostalgia combined with stockholm syndrome. \nThe game is mid at best, but it's too full of bugs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There has been an ongoing internet debate among RPG connoisseurs for years now about whether Morrowind or Gothic 2 is the better game. It never really concerned me since I grew up on TES 3 and heard about Gothic but never paid any real attention to it, apart from the disastrous launch of Gothic 3. A couple of years ago I finally sat down and finished the first game, and now being done with its sequel, which, to be fair, is more of a massive expansion pack to the first game than an independent game, I am quite conflicted on what to think about it. \n\nThe well-thought-out and interesting world-building from the first game gets replaced by nothing really. The main story is a badly justified fetch quest and murder spree. There are, on paper, interesting ideas presented, like the supposed peasant uprising, against the occupational forces of the Paladins that sort of took control of the port city of Khorinis. But that doesn't amount to anything tangible within the game.\n\nThe typical “rags to riches”/“you scratch my back, I scratch yours” based quest lines still are done well, same with the cutthroat tone, and are a core strength of the Gothic games and their more low-fantasy approach.\n\nA lot of what Gothic 1.2 does well always has some caveat, one step forward, two steps back design behind it. The character building that happens through learning points that are awarded after every level-up makes for an interesting and engaging progression system. Do I level up my attributes so I can use a better weapon? Or should I rather level my weapon proficiency so I can fight better? Instead I could forgo any “real” progress that makes me stronger by learning crafting or pickpocketing. This creates a great dichotomy, which results in planning and a soft mix-maxing since attribute points can also be acquired to some extent without utilizing precious LP.\n\nBut with the constant uphill battle that is the game's difficulty, every weapon and skill upgrade often feels less impactful and more like trying to catch up and level the playing field. Which in turn means a lot of the exploration is its own reward instead of feeding into the character building process. \n\nMorrowind’s more strictly numbers-based combat is boring and, quite frankly, shit, but Gothic's approach of animation interrupting and trying to get enemies stuck on world geometry is not fun and also shit. Hit and hurt boxes are a mess, the worst offender being the Dragons. Thankfully, much like Morrowind, the combat can be cheesed even if it remains a bad but big part of the game.\n\nThe game's control scheme is quite fascinating, being able to play the game just with one hand. But character movement, the aforementioned combat, and especially the constant struggles with traversal due to the world geometry and asinine collision boxes remain a consistent headache.\n\nThere is no denying that Gothic 2 is a decent game, and anyone interested in Western RPGs should play it at least once. I kept playing until the end despite, or more in spite of, the issues. But much like the first game, I don’t think I will remember it fondly, much less replay it at any point. Gothic 2 fails as a sequel for me because the world-building is so much weaker than its predecessor; the same goes for the story. All the game systems were already in place in the first game, but Gothic 2 fails to make any meaningful changes to traversal, combat, character building, and so on. All unique and interesting systems feel lacking and underdeveloped. All issues were already present in the first game but don’t get addressed here. \nMy disappointment stems from the fact that there are so many great ideas here that are undercooked, half-baked, and lacking proper cohesion, especially since I wish more games would follow a lot of the ideas that are presented here.\n\nPlay it, especially if you like RPGs, or even if only to check it off some list, but looking at Piranha Bytes and its trajectory, it feels like the idea, less the execution, of Gothic was lightning in a bottle that the developers were never really able to properly realize and iterate upon. The constant attempts to replicate Gothic 2, the lack of expanding and developing different games, and the subsequent shutdown of the studio make it clear that there were massive structural and underlying issues plaguing the development team and why Gothic 2 is such a flawed but disappointing game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WARNING: SUBJECTIVE OPINION!\n\nI want to like this game, but i cant, it has a lot of improvement from the original but it didnt catch me like the original, maybe is the setting maybe im playing wrong but i did feel all the flaws from the original but harsh here, my playthoung was confusing, the quest are very vague and the progression hard and unbalanced, dont judge me theres a lot of good qualities here but its was overshadow by my bad playthoung, maybe i will give it a second chance in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible clunky combat and Gameplay it's just not fun!\r\n\r\nGothic II Gold Classic more like Gothic II Piece of trash!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to get into this since I’m a big fan of old RPGs like Morrowind, but I just couldn’t. The controls are awful and it feels really scuffed to play, even knowing how old RPGs usually are.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Must have been a long time ago.  \r\nFighting is so quirky Im pushing this crap aside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game dont even run, why the fuck is it for sale?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a good example of the discrepency between what people say they want in a game versus what actually serves to create a better game. At first glance, Gothic 2 is a significant improvement on the first game: a bigger more expansive world with more things to do, better controls and combat, less bugs, \"better\" graphical fidelity. A lot of the public discourse seems to mirror this view and recommends Gothic 2 as the best Gothic game. Having played both Gothic 1 and 2 as an adult, I would have to hard disagree and strongly recommend Gothic 1 as a game with a much better sense of its own unique style and location, and one that counter-intuitively avoids many of the pitfalls of this game by simply being smaller and more linear. A better way to put it might be that if I was young/impressionable and impressed more by things like scale or polish, this would definitely be the game, but playing old games for the first time as an adult, exactly the opposite is true. If you want more details, read my Gothic 1 review.\n\nIf the argument for Gothic 1 was based on all the ways it strays from the formula we expect from modern open world games, Gothic 2 moves more in that direction by cluttering the experience with lots of (imo unnecessary and non-additive) quests. The starting town of Khorinis is amazing and the highlight of the game. It also encapsulates the best part of Gothic 1 -- settlements/towns with fun/interesting npc interactions. Much of the game is solid and closely on par with Gothic 1 in gameplay, but lacking some of the atmosphere given by the setting and aesthetics of the first. Unfortunately, I chose to, on the recommendation of many people online, to play the Night of the Raven version of the game. This version adds a whole new expansion area / story and also significantly increases the difficulty by changing skill point acquisitino. According to many, the difficulty increase is necessary given the extra content. I think this might be true, but unfortunately the game does not do a good job of slotting the expansion in a specific part of the overall game to make the intended progression obvious. The difficulty increase simply makes the game feel more grindy and I just ended up using a difficulty customizer mod online that let you modify your exp and skill point multipliers to tweak the game to an acceptable difficulty. The expansion also fell flat for me, felt like a tedious fetch quest involving a sub story that I wasn't particularly invested in. Perhaps the style of the story would appeal to people who were exposed to this game in 2005 but to me, it felt like a worse charmless version of Gothic 1. I would recommend a new player to play the classic version (not NoTR) of the game, and if they've played Gothic 1, perhaps try not to grind or find some mod to increase the difficulty. I think if I had done this, I might have been left with a less tedious view of the mid-late game tainting what was a fairly great start. Khorinis has a lot going for it and the relationship between the various factions was interesting, and if the game had been taken in a different direction story wise, it could have done amazing things with the premise and the relationship between the Paladins, city militia, and Mercenaries. Instead, there is an overarcing plot of evil dragons that you are blandly informed of at the very beginning of the game and sets the tone for the rest of your gameplay. This is quite unlike 1 where there is no clear main story until much later and which unfolds naturally, if a little campy. Anyway, I might need to come back to this once I've had some time to more clearly process/remember the parts of the game that were excellant before the progression ruined it for me. \n\nI do want to emphasize as in the first review that Gothic 1 is a real gem and worth playing. There is a video review that shares my enthusiasm for 1 and lack of it for 2, but highly recommends the total conversion mod for 2 called \"The Chronicles of Myrtana: Archolos\". A group of Polish devs have essentially created a completely new game in the Gothic world that from this reviewer's impressions is significantly better than 2, so the review might sway you to pick up 2 in order to play Archolos. \nhttps://www.youtube.com/watch?v=N6ImFZzK_oE",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}