{
  "positive": [
    {
      "review": "The gun play is by far the best in the series.\nThe story is by far the worst in the series.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Not Every likes the main villains in this game but other than that games really good overall for a person looking to have a good time playing a FPS looter shooter",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very very very bad story, about livestreamers... but gameplay is top tier like its better than any other game gameplay wise, but if ur into streamers with a bad fanbase as a villain, play this game",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game begins weakly, and I find the dialogue and comedy largely a miss for me; however, once you leave Pandora and start unlocking more inventory, encountering additional characters, acquiring cooler guns, and gaining new skills, the game becomes a lot of fun, especially when playing with friends. If you enjoy first-person shooters and loot-based games, I recommend giving it a try.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Zane is the man. Gameplay, humour, gore, loot - its got it all. Top notch.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really, Really fun, but play 1 and 2 before this one or else nothing will make sense.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loud, chaotic, and full of loot. Exactly what Borderlands should be. Gunplay feels great, the worlds are huge, and the co-op is a blast.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Explosively kill enemies, get OP loot, bully an underleveled boss, forget to eat, keep playing, go to sleep, return to Borderlands 3.\r\n\r\n10/10, Don't forget your gold and diamond keys.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is in the context of the first 3 games.\r\nI've been a fan of the franchise from the beginning and this one is my favorite of the bunch. Played all characters to max level and did every piece of content in the game. It's all very fun and rewarding.\r\n\r\nThe combat is the best in the series. It's also the most modern in the series and has the best QoL features. Each vault hunter plays differently and there's a lot of end game content available. The DLCs are some of the best in the franchise.\r\n\r\nPower creep has made the campaign too easy. Legendary drop rates during the story are a bit too high. Personally, I found the main story okay. There are some annoying characters, but overall I didn't find them too bad. However, I am in the minority and the community really didn't like the story.\r\n\r\nOverall, it's a fun game with a lot of content and highly recommended if you like the looter shooter genre or the Borderlands franchise.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Improves heavily on Borderlands 2. About 65 hours of gameplay with all the relevant side missions, logs, etc. Didn't do the slaughter house or post game stuff, just kinda seems like a lot of mindless shooting when there's no questing. But the content that is there is fun, dense, and very consistent unlike BL2 where the last third of the game is very hollow feeling. Has actual boss battles this time around, first one you had the end boss and Duncachino's mom as the only challenging big fights. Lots more unique and even at times OP-AF guns, BL2 I think you had 7 or 8 legendary guns whereas this time they just shower you with them, as long as you do enough sidequesting/exploring to get that chance loot.\r\nMost of the characters are solid. Sir Hammerlock comes back with a lot of fresh interactions, I think him and Tina were my favorite from the last game. Unfortunately Birdboy is back and as winy as ever, and then there's Ave, because isn't that what you want in your game, a kid that's even winier than birdguy.\r\nMore focus on abilities, and skills.\r\n\r\nWish there was a Hard difficulty setting. While in BL2 I mostly ever died from jumping backwards off \r\ncliffs, and I did die a lot around lvl 10 as Moxxie's champion, but especially as the game progresses and you get the harder hitting guns, and tuned up skill tree for you and your companion, that's when things can get stale as you're to badass now.\r\n\r\nThis game is buggy though. Holy crap. It crashed a lot early on, and have to periodically drop the texture streaming down, and keep it on DX11. Even though it's very light on resources, and I played Tina's Wonderland prior with no problems ever and that game is on the same engine, and seemed more resource intensive. \r\nAlways seemed to be a gamble if the menus for changing gear would want to work. Drop pods wouldn't always spawn, etc.\r\nIt was rarely game breakingly bad like full crashes, but compared to the other games in the series(idk about BL4 yet), it's definetly more glitchy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I used to be a vault hunter like you...\nBorderlands will always be a comical wasteland and always super playable, the addition of a cult with these crazy god figures leading the bandits, love it. Brilliant guns as usual!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from someone who's never played any Borderlands prior to this one, the RPG aspect of the game and core mechanics are AWESOME.\n\nAwesome in terms of gameplay smoothness and fun aspects, as well as the endless possibilities of how to play rather than having to \"follow a meta\".\n\nFilled with stuff to do and loot to get, but the story is rather corny and drags on near the end, failing to capture one fully in terms of engagement and interrest.\n\nThe DLCs are amazing though and provide some unique loot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is pretty fun :3, i love the characters, and combat feels really good. its not super hard, but its also not easy (when ur playing on normal)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid Borderlands game. Main story a little odd but apart from that it was so much fun to play. Flowed really well and the weapons loads of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "way better then 2 — shooting is very fun, locations are different (visually) and switch quickly, quite fun to play even alone\n\nI only wish they stepped openworld at least to a level of decade old far cry game — it feels to much like a empty corridor with interactive points. even rage 2 was able to did it.\n\nplot is cringe, but i don't get what other people expected from game about midgets and blooper bots",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, shoot and loot, yummy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very hard at times, in my case coop with good players is necessary to complete some battles. But it is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent graphics and kind of reminds me of if fallout 76 had a baby with Apex legends then that baby had a baby with Halo. Its a lot of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely some of the best gunplay in gaming, but my god is the writing terrible. Even the side quests are bad. Game slaps though, throw some music on to drown out the dialogue\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing this game for 5 hours non-stop (I have never play the game before). \r\nTHIS GAME IS ABSOLUTE CINEMA! by gameplay story graphic and even the detailing, everything is really perfect in my opinion.\r\n\r\nFrom my experience right now, it is the best AAA game I have ever had fr. (sorry for my languages)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a huge guy for story games and i am extremely picky i always aim to finish 100% exploration and all missions for the games i play and that’s whats i do most of the time.\n\nI know this game received a lot of hate but if i was u i wouldnt listen to it as most of the time those are people who dont enjoy the games as it is. This game was really fun exploring and the fighting too also building ur playstyle to how u want it. This was worth it Just go for it and dont listen to others. I cant wait to buy borderlands 4.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better Graphics, Better gunplay, The Vault Hunters are fun and their abilites are fun to use. The only thing about this game that keeps me from re-playing it somtimes is Cringe Queen Tyreen. other then that This game is fun, The DLCs are great aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 3 — A Chaotic Carnival of Guns and Mayhem\n\nBorderlands 3 isn’t just a shooter; it’s a masterclass in over-the-top combat, explosive humor, and relentless loot-driven chaos. From arid wastelands to alien worlds, every environment is packed with enemies, secrets, and outrageous encounters that keep players constantly engaged.\n\nCombat is fast, frenetic, and endlessly satisfying. With hundreds of unique guns, abilities, and skill combinations, every firefight feels distinct and exciting. Chaining combos, exploiting elemental effects, and coordinating with teammates turns every battle into a thrilling spectacle. Boss fights are chaotic and memorable, demanding strategy, quick reflexes, and adaptability to survive.\n\nExploration and progression are both rewarding and addictive. Discovering hidden loot, completing quests, and upgrading characters gives a constant sense of growth, while the game’s vibrant worlds are filled with eccentric characters, easter eggs, and absurd humor that make every journey memorable.\n\nCooperative multiplayer amplifies the fun, allowing friends to dive into chaos together and experiment with synergies across different characters and playstyles. Even solo, the game’s relentless action and variety keep momentum high and engagement constant.\n\nVisually, Borderlands 3 is bold and expressive. Its signature cel-shaded art style makes every gun, enemy, and explosion pop with personality, and the eclectic soundtrack perfectly complements the game’s manic energy.\n\n[h3]Final Verdict:[/h3]\nBorderlands 3 is a riotous, action-packed shooter that rewards experimentation, skill, and chaos. Explosive, endlessly replayable, and wildly entertaining, it’s a must-play for fans of looter shooters and irreverent humor.\n\n“A chaotic, loot-filled joyride of guns, explosions, and absurd humor.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐☆☆ 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my experience, so far, Borderlands 3 is an excellent addition to the Borderlands Series. The story progression is satisfying and gives one a sense of anticipation; that being in expectation of the next epic revelation which unveils another facet of the jewel which is the lore and story that the Borderlands Series so enticingly, and entrancingly, unfailingly delivers to those beholden.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 3 was a blast to play. The gunplay is smoother, the loot is nonstop, and each Vault Hunter feels unique. The humor is hit or miss, but missions with Pain and Terror were some of my favorites—they nailed the chaotic Borderlands vibe. The Calypso Twins aren’t as strong as past villains, but the story still keeps things moving. Overall, it’s fast, chaotic, and exactly what I wanted from a Borderlands game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite Borderlands! I extremely love Borderlands 2 and we all know that the story and the villain in the 2 is better but literally everything else is better here and you have more variety. I really like the spaceship sanctuary it's a really cool main hub. Also, Moxxi is probably the only female NPC in a video game that I ''fell in love'' with lol. She is stunning and I really like her personality! This game is incredible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Borderlands 3 delivers exactly what I want with crazy guns, smooth gameplay, and non-stop action. Fun solo, even better with friends. Runs great and feels satisfying every time I jump back in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "same addictive formula that I liked in BL2 but with a slight woke vibe to it, which I did not like very much, another thing I did not appreciate is the annoying f*ckass tendency to spoil puzzles in like first 5 minutes, I found myself saying stfu many times other than this... good optimization—the game worked on my potato just fine, impressive graphics even on the lowest settings, and excellent sound design",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice looter-shooter game with a variety of weapons to choose from.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the last fun and actually *playable* borderlands \r\npretty funny jokes for some, quite annoying for the latter\r\n*(unless you have a 5090)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good entry for the series, I'd say.\r\n\r\nAs someone who loves immersive stories, BL3 was lacking. But I'd say the gunplay, skills, and fights were a fair tradeoff. \r\n\r\nHad my fair share of fun grinding with the boys back in lockdown.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What I like most about the game is the Legendary Drop Rate. I'm not one who likes farming for legendaries like B2. Pain in the but, kill the same guy ten times and get nothing. lol\r\nDislikes can't think of anything at the moment. Other than that great game and very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoy playing it on my rog ally x and my pc. i played BL2 when i was younger and this is a fun game as well. great visuals and runs great! i have not tried BL4 yet. would be cool but ill buy that when it comes on steam sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its borderlands, its good. its what you expect from the franchise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "went back to bdl3 after realizing that bdl4 won't run on my computer and it still slaps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun! \r\n\r\nPlease note, this game is only fun when nobody is talking. I'd rather have my teeth pulled sober rather than listen to these characters again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to loot and find rare guns, the story line is alright but im not here for the story, just here for the headshots and dopamine rush when I get a good weapon drop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game to lose time in with a lot weapons and verry good content .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the plot/story itself is honestly awful, but the gameplay is sm fun and feels great. i recommend the game itself but not the company's and ceo's practices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The characters in this game are the least fun of the franchise, but the gameplay is the best until BL4.\nThe gameplay is great, the levels are fun, the vehicles are diverse, and it's great in multiplayer. A very fun entry, but every character build is boring partway through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played BL3 Moze run. then Played BL2 salvador. both runs were pretty long, easy but a bit boring since the characters I chose. However right after Playing BL2 I went back on BL3 asap and did a 2nd run with a different VH (Zane). Much more fun than the 1st playthrough and Honestly this game is a good sequel and honestly on par with 2. BL2 had better story ofc  but gameplay was much better same with QOL changes like fast travel without a station. This game is not bad as people may say I find it to be based on how you play the game since personally moze was not fun for me but since here power is like salavadors you can swim through game if youre new however with any borderlands run ever character see the ability, skills trees, and playstyle till you find a fun one, not a OP one cause It can get boring and please don't forget you can respec this isnt skyrim you aint stuff to one thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 3 is the best looter shooter I've ever played. Absolutely amazing, satisfying and rewarding game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a lot of fun playing this on console. Bought it again in case friends want to play. Also I don't think I finished the console version. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll keep this simple, It's a 7/10. But I still had a ton of fun with it. The story ain't as bad as everyone says it is but it's nowhere near bl2. The gameplay just kinda gives you dopamine at every corner, from loot to shooting to abilities. It's just kinda turn your brain off game. If it's on sale, pick it up, because still selling this at 80 bucks is criminal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good gameplay, mid story dragged out the campaign the final boss is really easy but still had fun and thats all that matters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People get too huffy and puffy about the story. Gameplay is pretty awesome. DLC is fun, and the few twists in the story were entertaining. Worth a play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bigger, flashier, and smoother gunplay — though the writing’s hit or miss. Still a blast with friends and chaos everywhere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game a lot. \r\nBL1 was a gamble with a lot of last minute reworks of most of the visuals and atmosphere in game that set a new standard in the looter shooter genre. BL2 took a different path but used the same skeleton to make one of the most beloved games of all time. \r\nNow BL3 went down many of the same design paths that BL2 did but with one massive problem, the games writing is some of the most unbearable and unfunny dribble that ive ever seen. The villains are miserable to listen to and invoke a type of cringe that doesn't just parody streamers and influencers, it makes you not want to play the game with dialog volume above 0%. I will note the all of the DLCs are written by a different head writer and deliver on what you'd expect from a borderlands game, unfortunately they follow behind a main game story that cant be totally skipped or ignored. \r\nThe visuals are great if not a little overcrowded at times, the gameplay and buildcrafting is the best out of the games up to 3, the open world is pretty good but feels stretched thin by the last planet you find your way to, and the price tag for all of the games content is a bit high but goes on sale regularly enough to be more than accessible if you wishlist and wait for it. \r\nIf you like borderlands 2, this should be right up your alley if you can stomach the god awful antagonists long enough to explore the gameplay and loot to their upper limits.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible gunplay, awesome artstyle, bajillion of guns BUT...\n\nSuch incredibly annoying voice-acting, just abysmal. The Calypso Twins and every last one of NPCs that has voice-lines in this game can kiss my ASS! 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel like Borderlands 3 doesn't really deserve all the hate it gets. This still feels like a Borderlands game, with outrageous and fun guns to use, loot explosions, lots of silly humor, and fun gameplay. I will say that some of the character dialog gets tiresome with how hard it tries to be \"edgy\", and while it can be kind of cringe at times, it didn't ruin the experience for me.\r\n\r\nThe game still looks and feels quite good, and chasing loot is as addictive as ever. By the end of the game I had a shotgun called The Butcher which just hosed down all enemies with a nearly never-ending spray of bullets, totally trivializing the final boss and all enemies before it, but dang was it fun to use! In BL2 I used a lot of sniper rifles, but they all seemed pretty terrible in this edition. Pistols are actually surprisingly amazing in this one, along with many assault rifles and the occasional shotgun. \r\n\r\nI didn't touch the endgame, as just chasing loot for its own sake doesn't interest me, but I hear if you're into that it's good in this game (I also only played solo). With how cheap this game now goes for, I'd say it's worth a playthrough if you're a fan of the series. If you're new to Borderlands, definitely start with 1 and 2 first. Not bad!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I like it so far. Gameplay is good as usual, I like the maps and the design of Sanctuary, the classes are more fun than BLTPS imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you've played Borderlands, you know what to expect. The Gunplay, the adult humor, and the childish humor, all wrapped up in a \"Go save the world\" experience! If you haven't played Borderlands, well its a Comedy-centric FPS with a very distinct gaming experience. Everything from throwing your gun when its out of ammo so it can explode, to guns that shoot other guns, its all here. Great game to play, Phenominal game to play with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unpopular opinion. best borderlands game on the market.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just like Borderlands! Except... uhh... THREE! Quite good so far, will update if necessary!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sure this game does get a bad rap for its writing and over-blown voice acting. Claptrap and the Calypso Twins do get annoying, however they can be ignored. That said the game overall is pretty well done, gunplay is great, graphics are great, animations are smooth and crisp, and the game does seem to run really well on a mid-range PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The humor is still sophomoric, the loot is still epic, the feeling is still incredible. It's Borderlands 3! This is a great looking, loot loaded action adventure FPS. If you're looking for a shooter that's not a CoD or Borderlands, you can do way worse than Borderlands 3. This game is a huge amount of content for a great content, with or without a sale. With four DLC packs, the game doesn't end when the main story does. Definitely worth the buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No other game addicted me more than Borderlands 3 & 4. It's full of action, humour and fun that makes you feel good. Cartoonish style graphics are timeless and will still look good even after 10 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "always liked he borderlands franchise awesome games. ill keep coming back and forth to play them!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fuckass story but hey atleast the gameplay's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, I take back what I said before. The game is fun asf.\nI still have some issues with the writing and AVA being rewarded for just being a stupid idiot.  But it is what it is, we don't play Borderlands for the story do we? 8/10 BECAUSE THE GAMEPLAY IS DOPE ASF.  \nGraphics are really good imho.  Much better than BORDERLANDS 4.  Where the performance is crap. Still, that game is also very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was both good and bad, some  bugs here and there. but overall i had a good  experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it feels to easy, like as if the game was on easy mode even if i put it on the hardest level. i kinda like it tho, addicting to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is an upgrade from 2 in nearly everything BUT story. if you want some of the best gunplay in the franchise but dont want to hear the ongoing droning that is the calypso's obnoxious dialogue then play this game on mute. But build variety is through the roof with some of the best end game content the franchise has had yet. though said content is a bit too easy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Randy-slop, if you install the dialog and cutscene skip mod it's pretty ok. I DON'T HATE IT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whether or not I would recommend a game to other players is dependent on other factors. \r\n\r\nAre they a fan of looter shooters and don't care much for plot? This game is serviceable for them.\r\n\r\nAre they a fan of Borderlands for the zany humor, charismatic characters, and memorable villains? You should play BL2 again. This game feels soul less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played like 20 hours on PS4 when it came out. Not quite Borderlands 2, but it's a good game. Dialog is a little rough.\r\n\r\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O men this game is pure chaos , is grate . Don't understand all the hate, yea isn't  perfect ( not like B2 because that was one time lighting  in a bottle) , it's stupid fun ,grate gun feelings ,good graphics , stable frame rates and so on.\nNow let's see B4....... OMFG is an abomination with Unreal 5 with all of i'ts crap , a force open world , no  funny at all, with stupid game mechanics and so on. Don't support that crap!!!!!\n\nScore : 87 /// 100\n\nPs and they ported this one on the switch and is grate ( with downgrade graphics ) but a grate port on the go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You know the way this is set on being a comedy - dramatic game. Its really fun and hilarious that one time it is just pure comedy and the next, just pure drama and tension. The weapons are indeed intresting though i would think that it would need more logic behind some weapons but.....eh its comedy so who cares! :D \n\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "แนะนำ สนุกมาก เพลิน ๆ ขนาดไม่มีเวลาเล่น นาน ๆ ครั้งเข้ามาเล่นบรรยากาศการเล่นก็ไม่เปลี่ยน",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. No idea why people hate it so much. Guns and systems are super fun. Making wild broken builds is also very silly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the awful story pacing and some borderline insufferable characters and plot points, this game surpasses the gameplay of Borderlands 2, and imo has the best gameplay in the entire series and in the whole looter shooter genre.\n\nTons of loot, multiple difficulty settings, the characters are fun to play and each has a large quantity of builds viable for endgame activities, easy to drop legendaries, a rich variety of environments - all that without counting the DLCs.\n\nIt was worth its price at release, and is still well worth your money at the current.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, terrible everything else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story and the writing isn't the best, and boss immune phases are awful, but apart from those this is some of the most fun i've had with a game. will definitely revisit in few months. play with a friend or two if you're thinking of playing.\r\n\r\nif this had at least a decent story bl3 would be leagues above bl2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story writing was not nearly as bad as people made it seem although ava was a bit annoying, gameplay wise, its a blast and the skills and gun play are bounds better than the previous games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, love all the borderlands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it a fun shooting game if you have played border lands you know what your getting loot loot and more loot cheezy humor interesting art style just a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good story wise but still enjoyable characters, art style and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get cool guns,trickshot enemies, kill some bosses, and do whatever else you fuckin want. this shit is so peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love Borderlands one of the best Borderlands games, havent played 4 yet but i bet its awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for 67 hours (sorry, I HAD to make a review). I highly recommend playing, I beat the game in like a week with my boyfriend :p. He played a lot more than I have (400 hours or so) and he loves replaying the stories & DLC's. I love this game, I got it as a gift from him, and it's been worth it playing with him :). Only downside about buying that bundle, it doesn't include the Season 2 Pass, which has additional items (like Amara's 3rd skin), etc. Other than that, I love this game ! six sevennn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To get the bad out of the way first:\r\n| The characters from the Telltale games had their character assassinated pretty hard.\r\n| The main story is bad.\r\n| Maya and her apprentice were handled poorly.\r\n\r\nBut aside from that I actually really enjoyed my time with this game. The build-making, the gameplay, the maps, and the remaining characters were all a treat. As you might expect, I enjoyed the side content far more than the main game.\r\n\r\nWhile I'd happily replay Borderlands 2's campaign over and over again for its story and build making, I'd also happily play Borderlands 3 again in the future for the remaining side content I didn't touch yet and the gameplay.\r\n\r\nI'd recommend it on a sale to anyone who wants more Borderlands and can put up with the aforementioned problems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You know what to expect. Great game, fun classes, fun campaign, fun coop...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love and hate this game, \n\nThe gameplay is second to none, its truly one of The best feeling looter shooters out there (I haven't played BL4 yet)\nEvery gun feels unique and has a personality and each playthrough results in endlessly different guns and run feelings. \n\n\nBut the Villains. Mannnn they suck, its the corniest Millennials humour mixed in with just being unlikeable. \n\nThey ruin the story, the side missions are fun and enjoyable. I love FL4K, one of the best heroes. \n\n\nPlay for the shooting, ignore a wide part of the story especially when the cringe twins show up\n\nI haven't even got the strength to play it for a second time. I wish the story was gripping to make me want to play it through. BL3 is something I enjoy playing through more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "to be fair after finished the campaign overall i love the experience of smooth fast paced fight, lot of gun option, skill system and cool soundtrack especially on katagawa ball boss part BRUH solid 9/10 amazing, BUT !!! the story campaign its SOOOO BAAD HOLY its like you takin care full femchild and femboss fightin each other, even the dialogue and jokes really make me want to punch my monitor fr 3/10 on writing its full of bs agenda yikes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TS IS AWSOME, MIGHT BE THE BEST GAMES EVERY WHEN YOU HIT HEADSHOTS THEY EXPLODE AND YOU CAN RUN PEOPLE OVER WITH A SHREDDER TRUCK THAT TURNS CORPSES INTO BIOFUEL",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "BORDERLANDS has always been a goated game. 3 is the best and will always be the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kind of a big time spend but great gun play worth the money. ALSO BUY DLC NOT THE SAME WITHOUT IT(ALL DLCS)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a cool and action game but it goes too fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game but an incessantly horrible narrative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another in the Borderlands series.  The damage meters are very well done.  The guns have a great feel.  Fun story and stunning graphics.   This is one to have in your collection.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun but i dont liek that its so damn hard to defeat the bosses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hate the story and the new characters. Love the new guns and maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is terrible, but 3 is better. Good to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pokemon with guns but turn off the dialogue unless you HATE fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hmm yes indeed good, i love how they die. explosion, moxxi beans is fit, i love gambling and beans, i goon to her, yes, no scooter L but beans yes, but i still love gambling, the way the story is fun, and i love gambling and tablelegs, ellies jugs are big, but still gambling i love it, grenade nipple yes! eridium beans negative, but gambling always there tooth! unless money no, yes gambling money no yes gambling,  beans is fun yes tomorrow in the beans underneath the beans with gambling ellies jugs, i like fortnite i dont like women they scare me. :thumbs_up:, BeamNG.drive, Overall, I believe Fortnite is a pretty good game, however there is no gambling so minus one point! Thank you dearly for reading my review and I hope you understand my beans and gambling, teeth. eeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee sorry just squeezing out.. teehee im shy, beans..\n\n\n\n\n\n\n\n\n\n\n\nhello im john\n\n\n\n\n\n\n\n\n\n\n\nbye john\n\n\n\n\n\n\n\n\n\n\nI LOVE GAMBLING AND BEANS table-leg\n\n\n\n\n\n\n\n\n\n\n\n\nyes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\npythagoras theorum\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntriganomotry\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nhave you ever had thought that john is not adam but you also think john is adam at the same time? well no? neither that kinda weird\n\n\nBYEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE\n;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stupid twins steal the life of the hero. \r\n\r\ncool mono-wheel car that looks like general grievous's walking vehicle. epic. \r\n\r\nclaptrap is a retard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love the end game only bad part is the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Borderlands 3 – The Ultimate Loot-Fueled Galactic Adventure[/b]\n\n[i]Borderlands 3[/i] is a spectacular continuation of the franchise, taking everything that made Borderlands 2 a classic and amplifying it across an entire galaxy. With frenetic first-person combat, absurd humor, and an unparalleled variety of weapons, it delivers one of the most chaotic, addictive, and fun experiences in modern gaming. From the first mission to the final boss, the game keeps players engaged with nonstop action, explosive loot, and memorable characters.\n\nThe universe of [i]Borderlands 3[/i] is massive, diverse, and visually stunning. Each planet — from the neon metropolis of Promethea to the volcanic wastelands of Nekrotafeyo, the swampy backwaters of Eden-6, and the moon-like landscapes of Pandora’s moons — is packed with secrets, collectibles, and eccentric NPCs. The cel-shaded art style remains bold and timeless, giving the game a comic book aesthetic that perfectly complements its over-the-top tone.\n\nCharacters are at the heart of the Borderlands experience. The new antagonists, the Calypso Twins, bring chaotic energy and charisma to the story, building on the legacy of Handsome Jack. Vault Hunters — Amara, Moze, Zane, and FL4K — each offer unique abilities, skill trees, and combat styles, making every playthrough different. Their personalities are distinct, and combined with fan-favorite returning characters, the narrative is packed with humor, absurdity, and occasional emotional moments. Supporting characters such as Claptrap, Tiny Tina, and others continue to deliver memorable dialogue and comedic highlights.\n\nGameplay in [i]Borderlands 3[/i] is as explosive as it is rewarding. Loot is everywhere, and the weapon variety is staggering, with thousands of guns featuring elemental effects, random modifiers, and ridiculous combinations. Skill trees are deep, allowing players to experiment with creative builds and synergies. Combat feels fluid, satisfying, and chaotic, with every encounter offering the thrill of discovery and experimentation. Co-op play amplifies the fun, letting friends coordinate attacks, chain abilities, and wreak havoc across every battlefield.\n\nBoss encounters are over-the-top and cinematic, often requiring strategy and teamwork while rewarding players with epic loot. Side quests are clever, bizarre, and packed with personality, often referencing past games and providing hilarious scenarios that expand the lore of the Borderlands universe. Exploration is always rewarding, with hidden areas, rare enemies, and valuable gear scattered across the planets.\n\nPost-launch content in [i]Borderlands 3[/i] takes the game even further. DLCs such as “Moxxi’s Heist of the Handsome Jackpot,” “Guns, Love, and Tentacles,” “Bounty of Blood,” and “Psycho Krieg and the Fantastic Fustercluck” add hours of new story content, planets, Vault Hunters, and weapons. Each expansion maintains the game’s humor and chaos while introducing new mechanics, environments, and challenges that keep the experience fresh and exciting long after the main campaign is completed.\n\nThe soundtrack, sound design, and voice acting are top-notch. High-energy tracks accompany intense battles, while comedic dialogue and character banter enhance the absurd charm of the world. Every explosion, gunshot, and elemental effect feels impactful and satisfying, making combat as fun to hear as it is to execute.\n\n[i]Borderlands 3[/i] is a triumph of design, humor, and gameplay. It combines explosive action, absurd humor, endless loot, and deep RPG mechanics into a cohesive, highly replayable experience. Whether you’re exploring new planets, discovering insane weapons, experimenting with builds, or causing chaos with friends in co-op, Borderlands 3 delivers an unforgettable, over-the-top adventure across the galaxy. It is a worthy successor to the franchise, an exemplary loot shooter, and one of the most fun, chaotic, and replayable games of its generation.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsBEFWsHrq4YLduTzCALyudS]here[/url][/b]\n\nSubscribe To My Youtube - https://www.youtube.com/channel/UC1ZOvQERjGtRkl7ImTcDzdw?sub_confirmation=1\nJoin My Discord - https://discord.gg/uM94ehT7hv",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best gunplay Out of all Borderlands till now PEAK.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Gameplay might be an improvement but... story is just straight up fan fiction, 100% cringe. Some genuine asinine fangirl must've fell in love with Vaughn from Tales from the Borderlands and thought how she could've further the story of this franchise with the cringey humor of Vaughn of which was written deliberately to be made fun of and cringed at.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "The gameplay is really good, but the story is fucking awful, and that's like 70% of the fun on a borderlands game",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "This game is like pulling teeth. What was a random trash game with fancy color and guns has rapidly turned into a game of corporate degenerates self projecting their ideas onto the masses. To start, I used the steam family so that I didn't have to waste hundreds of US dollars on this pile of crap. The amount of fecal matter that was literally shoved down my throat though out my play though was anything but amazing. I played the least \"Minority\" character Zane who goes though out the adventure talking about killing his family who are \"Space Irish\" and complaining about Rich people. The corporate writers make sure that everyone goes around talking about smelling farts, eating farts, looking at \"Juicy Turds,\" calling people gun sluts over five guns that are not different or special in anyway, and lastly eating butts. This is what we like to call in the real world self projecting(The people who made this game actually enjoy all the stuff listed above!) I hate the fact that there's an army of rainbow dyed haired woman in this game, that I'm being insulted every five minutes by my own girl bosses. I felt better every time one of my flavor of the week girl bosses got beat up, killed, or almost put to death. I would be in a middle of a fight and one dyed haired girl would run past my scope screaming about how she's lost control of her bowels, and my first instinct is to forget what I'm shooting at just to make their head pop like a water balloon! Every male character is either soy boy waiting for some tiny woman to fix all their problems, every black dude is either gay, crippled, stealing, or gay and crippled. I think my favorite fight was when a black dude was trapped as a pink bear and a woman kept making monkey noises at him until I cleared out a room full of monkey-like creatures that throw nothing but poop. Side-missions are a must miss in this game as they are whiny losers making you steal, murder, and kill for the KARL'S revolution that's NEVER coming for \"Them.\" There's NO ITALIANS in space, so how are there any fascist?(Further proving that nobody at gearbox ever read the 15 paged book on fascism.) Don't do side-missions. Having to rob civilians, feed revolutionaries burgers and coffee, and get them free sex so that they can fight their oppressors is bullshit(and they would love to eat that at gearbox). The color of guns no longer matters and gun levels don't matter either. I have a level fourteen(14) gun I found at the start of the game that I'm still using at level thirty(30). Grey guns are worth more than most purple or orange guns which the game throws at you like cheap hot dogs. Most bosses are just slightly powered up goons. Most of them I just stood still and did nothing as their health bars emptied out. You can't even enjoy your own music as the game and random points blast crappy music the developers THINK sounded good. Most music played in the background sounds like someone fudging about with a single instrument, or just straight up clown music. The only positive that Borderlands 3 has taught me was how the revolutionary army thinks, taking over radios to brainwash masses, steal and murder for supplies, and their unhealthy obsession with butt holes.(go get a stomach infection, and don't go to a hospital.) I'm glad I didn't spend a penny on this DLC infected game.(the final bosses advertises a DLC and mock the player for not owning it) My advice as an experienced Vault Hunter, find something you're passionate at and NEVER PLAY THIS GAME; YAHOOOOO!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game has easily the best gunplay in the franchise\n\nThe issue is that you spend more time standing listening to the unskipable unnecessarily long vomit-inducing beyond terrible dialogue than shooting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It is no coincidence that this game released at the time it did. A pioneer victim of the exponential enshittification of everything digital (and airborne). Consumers froth from the mouth at the prospect of a fiendish EULA and DEI \"Woke Mind Virus\" but couldn't even name one proper criticism devoid of sensationalism. Borderlands 3 is a bad game because it is poorly made.\n\nUn-skippable quip-heavy dialogue (yes, even on subsequent playthroughs) that is a modern day Marvel fan's wet dream, poor art direction that trades Borderlands' strikingly-simple bold comic book scratchiness for overdesigned neon rainbow with sheen on everything, and...  the combat is actually pretty solid. Kept me running around and shooting for 80 hours while I had my iconic baby sensory videos playing on my phone and 12 Google Chrome tabs running multiple 10 hour ASMR Mukbangs. You won't be disappointed if you don't expect the enemy AI to do anything other than stick their head right into the barrel of your gun.\n\nBorderlands 2 was an exciting time to be a gamer. Borderlands 3 is a gamer time exciting was an to be.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know if it's because it's been a while since I played BL2, but this game (particularly the story), is so predictable and watered-down that I almost can't push through. You like Claptrap, right? Every character acts like Claptrap now. Everything is a mockery of itself. Only thing that makes it worth is playing with friends, yet on LAN the gameplay is severely laggy and unpredictable. Gunplay is good, looting is fun, but I truly hope BL4 redeems this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is really worth about 40 bucks given how many game u get and how the rest of the skill tree is locked behind dlc.this game is 5 years old as of writing this review and yet they still charge 60 , the reason is simple They dont want to sale you game at justified prices. If you are getting into the series Try buying the game with a CD key or looking up a youtube vi. imo anything pass 40 or 30 bucks for any borderlands game is wild. these games as basic shooters with an ugly cel shader on them and  dull gameplay that repeats each fight",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I remember having a lot of fun back then, playing BL2. I saw the game was 5€ so I gave it a try but goddamn, this humor did not age well. It feels so..Reddit.\n\nAlso, seasonpass this, battlepass that, 4 bazillions DLC's, ...\nBlow me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This must be the most unbearable shit-ass story I have ever seen in my entire life, fuck this half cooked script, fuck the awful characters and their stupid \"development\", this sets the bar in hell for story telling. the gameplay is good though.\n\nI'd recommend installing a mod to get rid of the story altogether or at least mute the character's voices. (believe me it's THAT bad.)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The gunplay has greatly improved since the last game but the story is an absolute slog and the playable characters have very boring abilities that makes it hard to play to a unique strength.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's bad but with good features, shooting can be a blast and graphic are a step up. Just can't bring myself to finish the game. Story killed my joy every time I play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After BL2 + BLPS this game sucks. AAA slop. Garbage enemy AI, forced companions, long loading times\r\nAnd 150GB to install. Skip",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wont allow to go online. it says network error. I am already linked to gearbox however issue persist.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gameplay and animations are a lot better than the first game, writing is worse. makes it more bearable for me personally cause i hated the feel of the gunplay in b2, still eh though. Ts mid xd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cesspit of a Story, last Borderlands game I will ever purchase. 2K Is ruining this Franchise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "OK, let me explain the good thing first. If you like the previous borderlands gameplay loop, you are pretty much going to get it here. That's the only good thing i have to say about this game. \r\n\r\nThe story is god awful. The cast and writing is so bad. The amount of times I wanted to bang my head over the choices the made for the story was agonizing. It feels like the vault hunters are pulled to the side while the female cast gets the full stage. The vault hunters don't even participate in any of the cutscenes, they are nowhere to be found. \r\n\r\nAlso be ready to get soft locked multiple times in this game when an enemy phases through the wall or an npc for some reason doesn't want to move.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun combat and looting sim, but it lost a lot of its identity from the previous games. The main story was cringe, and some of the characters are just bad or boring. \n\nThat said, the Revenge of the Cartels event is fantastic and was one of the few redeeming parts of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Currently the game has a memory leak or some sort of instability that keeps on crashing the game. I have 33 hours played and this used to never happen but it's been over a year since I've played..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I buy it more than year ago. One of the biggest crap in my library. \nGunplay 0/10\nGameplay 3/10 \nStory -1000000/10\n\nThis game is so awful that when i hear someone saying about it or i think about it. It gives me a shiver. But still better then Starfield.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The gameplay is fantastic. Shooting feels powerful, inventory management functional, story pretty generic. What I couldn't stand after 20 some hours was just how feminazi the whole thing is. Girl power girl power bad men bad men. Slapstick is good, but feminazi... no. I am not against strong female protagonists. I loved Kill Bill, Wonder Woman, Buffy the Vampire Slayer! Queen Victoria yes! But it's like they have to constantly shove meow-power up your a** or your face. And the characters suffer because they are so one-dimensional. So no. I am glad I bought it on sale for 5 bucks. 20 good hours of shootin, no more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "first impression on this isn't a good one, the immersion breaking siren psychic visuals are terrible, nothing against the actress at all, but why would you use a real life actor when the BL universe has been a animated world since its first release ? and, not sure why they didn't patch it to align with a BL visual, I cant be the only one that finds it to be out of place.\nand its lost the feel and look that the first release's have by pushing the graphics to more detail and a more realistic look that seems to clash with the original BL animated world.\nAND the are a few QOL's like the main map not pointing North and rotating with the character just bug me.\nTHAT SAID, the combat is good there are added mechanics like mantle been added and I'm still enjoying the story a lot, ..... full review when I complete my first character.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was gonna do a bit where I gave a half-joking review on every game in my steam library and then gave a genuine review of this game where I recommended it despite its shortcomings but after playing BL4 it showed me just how bad this game is. Some good moments but they're few and far between amidst a slog of agony. Best parts of this game are two of the DLCs. Krieg and the Fantastic Fustercluck is some of the best character study I've ever seen in a video game story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible story, like genuinely bad. do NOT play for the story. 5 year old gacha fans have better story writing than this. only good thing is shooting in coop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not as good as 2, could be better and have more interesting characters... forced to play solo cause my friends hated this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A lot to process at once, at least for me. Gets very overwhelming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ngl kinda mid for a borerlands game rip gearbox",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a liberal run world would be like. If you can use the mod to disable dialog, it's ok.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy shit this game sucked. How could I forget to leave a review?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "atrocious writting, wtf are these characters bruh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just a worse version of the second game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "did you know? randy pitchford put a medieval mode into borderlands 3! look up \"randy pitchford medieval times\" to learn more!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i was laughing so hard at the poop jokes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the worst AAA title to date, gang shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst Borderlands game I have ever played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "游戏老是出错",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another example of wishing there was a \"Mixed\" option on steam reviews.\n\nTLDR: Gameplay is very good. Story is downright atrocious (at points).\n\n\nWithout too many spoilers, a obnoxious character is forced into the story, causes many bad events to happen to fan favorite characters but the writers wrote it in a way that she's supposed to be justified, and we're to feel bad for her despite everything being HER fault for being an obnoxious little brat that throws tantrums constantly. Downright some of the worst storytelling choices I have seen in a long time.\n\nWhich really sucks because this is the most competent the series has felt in terms of gameplay. Skill trees are really well thought out, guns are fun and even some of the sidequests are pretty funny.\n\nIf you do play it either get ready for these things are just set dialogue to 0.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this shit is fucking terrible HOLLLYYY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "whoever decided Maliwan weapons should have a charge up should be fired",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When this girl is on fire!😳",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ol game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just gonna kill baby girl then give me a great value big headed siren teen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why do they think they are funnier than they are?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "kill 999 bots > repeat 999 times > end",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "turrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pewdew",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ETR",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You're reeeeeally exhausting with the in-game ads about BL4. 2 different ads this week, full-screen, unskippable, which you're forced to see and interact with (you have to press a key in order to close it), and even then, you'll have to see it forever on the bottom left corner in the main and pause menus and there's no freaking way to get rid of it unless the company creates another update to delete it. This same thing happened with \"Tales from the Borderlands\" and \"Tiny Tina's\", and they'll keep the ad in there until they release BL5 or some other remotely related stuff. i'm so fed up with this.\n\nI paid for my game a good amount. I don't have to see ads on it.",
      "voted_up": false,
      "votes_helpful": 113
    },
    {
      "review": "Gameplay might be an improvement but... story is just straight up fan fiction, 100% cringe. Some genuine asinine fangirl must've fell in love with Vaughn from Tales from the Borderlands and thought how she could've further the story of this franchise with the cringey humor of Vaughn of which was written deliberately to be made fun of and cringed at.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\r\n\r\nImportant Info in Terms of Service:\r\n• Mods are a bannable offense\r\n• Display of Cheats/Exploits is bannable\r\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\r\n• You can be banned for using a VPN while connecting to online servers\r\n• Cannot access game content on a Virtual PC\r\n\r\n\r\nCollected Data Types:\r\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\r\n• Protected Characteristics: Age and gender\r\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\r\n• Billing Information: Payment information (credit / debit card information) and shipping address\r\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\r\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\r\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\r\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\r\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 364
    },
    {
      "review": "The gameplay is really good, but the story is fucking awful, and that's like 70% of the fun on a borderlands game",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "What an incredibly frustrating piece of software this is. I will be transparent: I have not completed this game. I have tried to play this game several times over the year, but I cannot bring myself to play it. It is not that the gunplay is awful, it is the gameplay. When I say gameplay, I do not mean the way you run, jump, shoot, or anything like that. The multiplayer works smoothly. It is partially at how unbelievably awful the writing is. How incredibly obnoxious every character is. \"Uhh, that is just the Borderlands aesthetic\" NO! I played Borderlands 1, 2, and pre-sequel, and it is like this game took the obnoxiousness and cranked it up to 100. The writing was on the wall in the beginning when you are unable to progress because you must listen to Claptrap talking about something completely irrelevant. He is obnoxious, isn't that funny? You are unable to do anything for 2-3 minutes, because you absolutely must listen to this awful piece of dialogue that adds nothing to the game.\n\nBut let us ignore Claptrap for now, let us talk about almost any other quest in this god-awful game. You just have to listen to these awful dialogues from time to time amongst characters before you are able to do anything. Sometimes NPCs are next to each other, and they just talk about... nothing relatable. They are just being obnoxious and the \"quirky comedy dialogue\" that is barfed from their mouth makes you roll your eyes.\n\nAn NPC needs to WALK to some sort of terminal and just press a button? Well, they will slowly walk towards the terminal, stop halfway there, talk about their hair and that they are amazing, walk towards the terminal again, stop, talk about something irrelevant, walk towards the terminal, stop, talk, then they walk and finally get to the terminal. They need to press one button, but of course that is not possible, because every character in this game has the mental capacity of a rotten peanut. So they will sit there and try to click, but it is not working. The animation goes on for about 40 seconds until you finally get prompted to just punch the terminal and everything goes along smoothly while the NPC screams \"WOAAAH YOU FIXED IT! I CANNOT BELIEVE YOU DID IT! I mean, I guess I can because I am here in person witnessing it now, but that does not change the fact that this is an exceptional moment in time that-\" you get the gist of it.\n\nThe game forbids you to enjoy this game, it forbids you! And when you are out questing, the quests mostly consist of these stages. Walk to area, hordes of enemies spawn. \"Clear the area.\" You keep on clearing out enemies, but they keep spawning because it is obviously timed. When you do it, you walk towards the quest marker, then an NPC talks to you over the radio talking about irrelevant information. After a minute, they say \"hacking the door now.\" Then you can continue. You fight through small waves of enemies, then you come to a new area. \"Clear the area\" pops up, queue enemies spawning, kill them. Then there is an elevator, you press to call the elevator, but it takes forever for it to come down, so queue either radio chatter from insufferable NPCs or new hordes of enemies spawning. RINSE AND REPEAT!\n\nI cannot for the life of me recommend this game. I hate it, good lord I hate this game so much. It is so bad, I was a better man before I experienced this garbage.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Cringe writing... the story is a huge mess, disappointing, frustrating and I only have 6h... also, it runs kinda bad for what it looks like.\n\nBe careful!, Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware...\n\nAlso Bitchford suggests refunds for Borderlands 4 players with outdated PCs\n-> I asked for a refund and I have an RTX 4090 with an i9 13900kf, for god sake, just stfu...\n\nAlso Bitchford tells gamers to code their own engine instead of blaming them for poor optimization of Borderlands 4.\n-> What about you shut the f*ck up you son of a b*tch and just sell a finished product? you motherf*cker.\n\nI'm sorry for insulting but it's too much...\n\nI continue to be f*cki*g confounded that 2K or Take-Two hasn’t made this guy shut the f*ck up.\n\nSeriously, every time he opens his mouth he drums up controversy. Every single time. He killed Battleborn because he couldn’t stop running his mouth. He made everything think Borderlands 4 was gonna cost $80 for nothing. And now he’s saying this.\n\nJust shut the f*ck up man.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "There is funny bad writing and just bad unfunny writing and this is bad unfunny.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "waited years to finally play this after hearing the dreaded rumours of how bad it was. i wanted to give this game a chance. i really, really did. the gameplay was fantastic! very clean combat and movement system that i thoroughly enjoyed! i'd say, purely gameplay wise, this is the best game of the series.\n\nstory wise? character wise? enjoyment wise? the absolute worst. 99% of the characters from previous games were incredibly out of character & honestly badly written. not to mention the main story is pretty ass - i enjoyed it for a little, near the end, but then absolutely LOATHED the ending.\n\ni was also really excited to play the handsome jackpot dlc! timothy is my favourite character from pre-sequel and i'm a big moxxi enjoyer too. i'd heard really good things about this dlc, so i dared to hope. said hope quickly came crashing down,\n- timothy's story has barely been retained from pre-sequel & his character feels pretty bland because of it \n- INCREDIBLY glitchy! any time moxxi's hologram showed up, her audio didn't trigger for me - nor did her subtitles. i wasn't able to follow the plot simply because i wasn't allowed to hear it!\n- not to mention: my FINAL CUTSCENE glitched & turned completely black as soon as it started. i could still hear the audio and see the subtitles, but i had NO cutscene whatsoever. thankfully my friend that i was playing with was streaming the game at the same time so i was able to watch it through them\n\ni've been left thoroughly disappointed lol. i will never, in good conscious, recommend this game to someone. skip it for all i care!",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "New Eula spy software in the game\nTake-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Borderlands aka Take-two and 2K games have updated their games even their older games. THIS INCLUDES COLLECTS USERNAMES AND PASSWORDS, IP LOCATIONS AND BROWSER HISTORY DATA.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Joguei 220 horas. Estava jogando, faltou luz, voltou luz, liguei meu pc, entrei no jogo, meu personagem lvl 40 ta corrompido. O jogo nao deixa eu jogar com o personagem corrompido. Sou gamer à mais de 20 anos e nunca vi isso. Já vi \"jogos salvos\" serem corrompidos, mas nunca um personagem EM SÍ. Imagina jogar por horas e pegar vários itens e por causa de uma queda de energia você perde tudo. Péssimo",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Gearbox is just another wannabe \"triple A\" studio which can't even make a working game anymore and blame their customers for it. Imagine if everyone couldn't do their job properly and instead of getting fired they could just blame the customer for it. It's thanks to this unprofessional, disrespectful and arrogant attitude over the years that I won't recommend any of their products anymore or consider them a real game developing company. They have turned into scammers disguised as software developers, they will take your money, underperform and spit in your face as soon as you start speaking out against this attitude",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly the new EULA sucks pure acid, ruining a masterpiece of a game.\nThe whole 'you pay money to get the game but don't own it' type of sh*it.\nAllegedly 2k spent too much time with real life Krieg - the conductor of the poop train.\nSo yeah, keep that in mind, when you think about getting any of the Borderlands games.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is like pulling teeth. What was a random trash game with fancy color and guns has rapidly turned into a game of corporate degenerates self projecting their ideas onto the masses. To start, I used the steam family so that I didn't have to waste hundreds of US dollars on this pile of crap. The amount of fecal matter that was literally shoved down my throat though out my play though was anything but amazing. I played the least \"Minority\" character Zane who goes though out the adventure talking about killing his family who are \"Space Irish\" and complaining about Rich people. The corporate writers make sure that everyone goes around talking about smelling farts, eating farts, looking at \"Juicy Turds,\" calling people gun sluts over five guns that are not different or special in anyway, and lastly eating butts. This is what we like to call in the real world self projecting(The people who made this game actually enjoy all the stuff listed above!) I hate the fact that there's an army of rainbow dyed haired woman in this game, that I'm being insulted every five minutes by my own girl bosses. I felt better every time one of my flavor of the week girl bosses got beat up, killed, or almost put to death. I would be in a middle of a fight and one dyed haired girl would run past my scope screaming about how she's lost control of her bowels, and my first instinct is to forget what I'm shooting at just to make their head pop like a water balloon! Every male character is either soy boy waiting for some tiny woman to fix all their problems, every black dude is either gay, crippled, stealing, or gay and crippled. I think my favorite fight was when a black dude was trapped as a pink bear and a woman kept making monkey noises at him until I cleared out a room full of monkey-like creatures that throw nothing but poop. Side-missions are a must miss in this game as they are whiny losers making you steal, murder, and kill for the KARL'S revolution that's NEVER coming for \"Them.\" There's NO ITALIANS in space, so how are there any fascist?(Further proving that nobody at gearbox ever read the 15 paged book on fascism.) Don't do side-missions. Having to rob civilians, feed revolutionaries burgers and coffee, and get them free sex so that they can fight their oppressors is bullshit(and they would love to eat that at gearbox). The color of guns no longer matters and gun levels don't matter either. I have a level fourteen(14) gun I found at the start of the game that I'm still using at level thirty(30). Grey guns are worth more than most purple or orange guns which the game throws at you like cheap hot dogs. Most bosses are just slightly powered up goons. Most of them I just stood still and did nothing as their health bars emptied out. You can't even enjoy your own music as the game and random points blast crappy music the developers THINK sounded good. Most music played in the background sounds like someone fudging about with a single instrument, or just straight up clown music. The only positive that Borderlands 3 has taught me was how the revolutionary army thinks, taking over radios to brainwash masses, steal and murder for supplies, and their unhealthy obsession with butt holes.(go get a stomach infection, and don't go to a hospital.) I'm glad I didn't spend a penny on this DLC infected game.(the final bosses advertises a DLC and mock the player for not owning it) My advice as an experienced Vault Hunter, find something you're passionate at and NEVER PLAY THIS GAME; YAHOOOOO!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The story and writing is bad.  No getting around it, the villains are bad, the allies are bad, the side characters are bad.\r\n\r\nGameplay is good, but listening to the characters talk is tiresome.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Girl boss to the max. Precursor to the abominations that have been coming out for the AAAA studios. They kept the qualified devs long enough to make the game play good but story is atrocious.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game has easily the best gunplay in the franchise\n\nThe issue is that you spend more time standing listening to the unskipable unnecessarily long vomit-inducing beyond terrible dialogue than shooting",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game should have a hard mode on the first run. Why is there not a hard difficulty option, its either easy and normal. Normal is a joke.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring plot, boring locations, boring skills.\nBL2 was waaaaaay better.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "If you want a game with stuff to do that is Borderlands themed, then yes.  \r\n\r\nThe best way I can describe it is, the game is like stale bread that been toasted to heck and doused in better and being told it's fresh.  Characters wasted, not only in bad writing or plot, but also killed off.  \r\n\r\nWonderlands is honestly a better game then this, and it's shorter and more fulfilling.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It is no coincidence that this game released at the time it did. A pioneer victim of the exponential enshittification of everything digital (and airborne). Consumers froth from the mouth at the prospect of a fiendish EULA and DEI \"Woke Mind Virus\" but couldn't even name one proper criticism devoid of sensationalism. Borderlands 3 is a bad game because it is poorly made.\n\nUn-skippable quip-heavy dialogue (yes, even on subsequent playthroughs) that is a modern day Marvel fan's wet dream, poor art direction that trades Borderlands' strikingly-simple bold comic book scratchiness for overdesigned neon rainbow with sheen on everything, and...  the combat is actually pretty solid. Kept me running around and shooting for 80 hours while I had my iconic baby sensory videos playing on my phone and 12 Google Chrome tabs running multiple 10 hour ASMR Mukbangs. You won't be disappointed if you don't expect the enemy AI to do anything other than stick their head right into the barrel of your gun.\n\nBorderlands 2 was an exciting time to be a gamer. Borderlands 3 is a gamer time exciting was an to be.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR:\r\ncombat is good\r\nstory, quests and characters are not\r\n=> PLay Borderlands 2 or the PreSequel instead\r\n\r\nCombat:\r\nYou can now slide and shoot while sliding, which is cool\r\nRaditation weapons are fun to use\r\nCryo is okay, but less cool than in the pre-sequel\r\nMaliwan guns are horrible to use, but most most guns are okay (similar to previous titles)\r\nNo jumppacks is disapointing\r\n\r\nProgression:\r\nYou get too many legendaries and they are whay too powerful\r\nThis makes game way to easy and you cant play on a harder difficulty\r\n\r\nOver the course of the story, you travel to different planets\r\nThese look quite good and different, especially towards the end of the game\r\nHowever, they dont feel much different\r\nFor example, all have the same gravity; having atleast one with lower gravity would have been fun\r\n\r\nStory:\r\nCringe, annoying, boring - nothing compared to the previous titles\r\nThere are multiple stupid cutscenes\r\nThe end-boss is quite underwhelming and the cutscenes are boring/annoying\r\nBest to just skipp all cutscenes\r\n\r\nCharacters:\r\nCringe, boring, annoying - Far from the badass characters we had before\r\nSpecifically for playable characters:\r\nAmara is cringe\r\nZane is too much \"How do you do fellow kids?\"\r\nZanes kit can be quite fun but most voicelines get annoying realy quick\r\n\r\nOverall, the Game feels like \"How do you do fellow Borderlands-gamers?\" and that does not make for a good time",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Steam forces me to write why it was bad, it's just a bad borderlands game. I would prefer just to give it a thumbs down and not have to write this like I could if I press recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the last game i bought on release night for xbox one at gamestop. the rage i felt rebuying it for pc for $5 on sale years later.\n\nreally enjoy the gameplay, the guns feel so tight and the character skills dont feel too overpowering, theyre a nice compliment. \n\nthe story? not good. the gun variety? not great. the glitches? plentiful. the maps? a nightmare to navigate. i felt just enough joy playing it that i might poke a few more times, maybe try another dlc, but probably not the same hundreds of hours of replay as pre-seq and 2. thoroughly enjoyed jackpot up until the rushed ending and ginormous amount of glitches we encountered along the way. \n\nremaster bl1/bl2 into this engine and i will be happy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disclaimer: playing this on steam deck.\n\nI bought this game a while ago and just stopped playing for a bit but I booted it up yesterday and it's literally unplayable now. Everytime I launch it if I'm lucky it crashes right after the claptrap loading screen. I've looked everywhere and tried different fixes, played around in desktop mode, verified the files, deleted shaders, tried different launch options, just about anything you can think of I've tried and it still crashes everytime on my steam deck. At this point I'm just done trying so steam deck users beware lol maybe theres a fix but i haven't found it yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mechanically I think this is a huge step up from the Presequel, with Moze and Flak being particularly interesting, and build paths in general feeling pretty unique, but I've grown less fond of shooters with age, and with the story obviously offering nothing its hard to personally recommend this. DLC pricing was also atrocious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]If you see me playing this game, it's because I'm forcing myself to finish it.[/h1]\n\nI bought it for a discount years ago and forgot about it. Recently, after years away from PC gaming I've decided to-- see what I did there? I'm yapping. And you couldn't care less because the reason you're reading this is to find out why I DON'T recommend this game, but I'm dragging it unnecessarily... see? I did it again. \n\nAnd that's it. That's how this game is written. You want to finish the mission and move onto something else but the NPCs are constantly yapping, trying way too hard to be witty and funny and what's worse, you literally cannot progress until they finish talking... at first it's cringeworthy, but over time it becomes exhausting and it drains your soul. There's something seriously wrong with the writing of your game if players have to go out of their way to COMPLETELY SILENCE character dialogue in order to make it bearable.\n\nOther than the bad writing/mediocre story, we got:\n\n[h2]A worse soundtrack[/h2]\nIt's good at times but a strong 5/10 if compared to BL2's. The volume is so low I had to lower SFX and crank the music up, and even then, it's only noticeable in combat/bosses. The rest of the game feels silent... where is the atmosphere?!\n\n[h2]The loot system is f*cked[/h2]\nReach lvl13, enemies drop lvl14 gear. Reach lvl15, enemies drop lvl17 gear. I bore with it at first because I thought \"my level must be too low\", but it never stopped happening. This is how the game works apparently. Out of 16 weapons in my backpack right now, I can't use 10 of them because I'm underleveled, despite strictly sticking to main story missions within my level. This is just bad game design lol\n\n[h2]Questionable game design practices[/h2]\nConsidering who's the Gearbox CEO, it comes at no surprise that the game has its share of predatory anti-consumer practices, such as full-screen ads for Borderlands 4, and a lot of paywalled mission markers. Why does the game show quest markers for DLCs that I don't own? Ahh, this must be the \"premium game for premium gamers\" that Bitchford talked about.\n\nThe more I play this game, the clearer it is for me that Gearbox peaked with Borderlands 2, and it's been downhill since then. The steep decline in writing and product quality is palpable. Glad I bought this for a huge discount and I sat out BL4 (another mess). Gearbox is dead to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gearbox, shift, whatever you wanna be called please fix your shitty ass servers this is crazy. I was just giving bl3 another try and now all day the servers have been down *edit*, I remember why I stopped playing bl3 when it came out, one word, Ava. *Spoilers* that stupid poor written character got Maya killed for no reason and Ava is the literally worst character worse than the twins.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "*Going through my library to review games I played outside of Steam*\n\nGunplay is much improved from Borderlands 2 and it's still a good time with friends. But the writing is so atrocious and mission/world design is so bad that it brought the embarrassment felt for being a Borderlands fan to what I thought was the lowest it could be (I was so wrong).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I thought I wrote a review for this game when I finished playing it the first time around, but man... it's not worth it at all.\r\n\r\nBorderlands 3 is a continuation of Borderlands 2, where new Vault Hunters would embark on opening new vaults while they are faced with a nemesis that wants to use that power for... control. Ugh, I've forgotten their names but that is how forgettable and bland these villians are, on top of the horribly-written story that makes story-characters extremely incompetent to the point that you can't help but laugh and eye-roll at the same time.\r\n\r\nThe villians are two brother-sister duo that seek to take control of the vault. And they're social media personalities (or whatever the fuck they are) that use their platform to get their way while attempting to have dialogue with the current Vault Hunters. Please note I said \"attempt\": Their dialogue is absolutely cringeworthy and their attempts of wit is abysmal.\r\n\r\nThe Vault Hunters are cool - with interesting powers, ults, and skill trees that'll make you curious how you wanna build out your character. \r\n\r\nAnd as usual: The (only) good thing in this game is the gunplay, which BL devs always manage to hit on the head. That's the ONLY fun thing about BL3.\r\n\r\nHowever, no matter the price drop, I do not recommend at all. The gunplay will be the only thing that might keep you playing, but you're asking to torture yourself. Avoid this, please.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "one of the worst stories in any game ive ever played. the combat is fun i guess but its not challenging at all. its kind of just mindlesly stimulating. if you want a good story dont play this. if you want to run around shoot things and collect shiny loot then maybe play it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i tried to like it, the story is a mess, barely any story with the previous cast that made bl2 amazing, not terrible just underwhelming and a missed opportunity, instead you have a bunch of nothing characters constantly yapping that doesnt make any sense, jokes over done or dragging it for too long. but I will say the actual gameplay with the story aside, is really good, the guns do feel great, I'm not too happy with the changes they made to maliwan guns however i do like the diverse builds you can use in combat, there is some replay value, if you loved bl2 for the replay value and are still eager to play this please just keep the dialogue volume muted. PS fxck off randy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "beat intro, gets purple shield. does 1 side quest gets legendary. uninstall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Returned because they disabled split screen co-op in the PC version. Choose a different game, or get it on a console.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The story, writing, and all new characters suck. The game play is better than borderlands 2 but worse than borderlands 4 so there's really no more incentive to play this game anymore.Just go play borderlands 4 for game play or borderlands 2 for the peak of the series.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is really worth about 40 bucks given how many game u get and how the rest of the skill tree is locked behind dlc.this game is 5 years old as of writing this review and yet they still charge 60 , the reason is simple They dont want to sale you game at justified prices. If you are getting into the series Try buying the game with a CD key or looking up a youtube vi. imo anything pass 40 or 30 bucks for any borderlands game is wild. these games as basic shooters with an ugly cel shader on them and  dull gameplay that repeats each fight",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shall start with the positives. The gun play is probably best part of the game with lots of different variety of weapons to choose from and mostly all feel great to use.\nGame looks great although I love the aesthetic every Borderlands game so might just be personal bias.\nThey expanded more on build choice between characters. How you build your skills to suit your character and play style.\n\nNow the negatives which there is many. Firstly everyone's main complaint the story is utter garbage. The villain twins streamer gimmick fades off pretty quickly not that it was good in the first place. Then they are just left as boring normal bad guys that wanna do stupid bad guy things I guess to become all powerful destroyers? Just comparing them to Handsome Jack who has more intention and personality behind him. The only slight interest I found was watching Troy having some sibling rivalry before his boss fight.\nAlso doesn't help that most of the dialogue from many characters is just awful.\n\nProbably the most annoyed I've been with characters, especially how some older ones were treated. To only name the few I enjoyed, Zero for just being funny. Brick and Mordecai cause they barely appear enough to ruin them. Then Wainwright Jakobs for actually being a badass against some of the big villains. Most the other characters get some sort of downgrade or just suck as they are being introduced in this game, Ava being famously horrible! And my personal dislike for Tannis throughout the series and she gets so much of the screen time and a sudden \"upgrade\" that really benefits the plot progression for her.\n\nFollowing that many of the cut scenes tend to depict stupid scenarios that just make no sense. Characters in trouble or deaths where we just stand and watch it unfold. The twins could of killed our group multiple times throughout the story but just doesn't. [spoiler]And the specific scene where Lilith could easily restore her powers from Tyreen unconscious like how Ava gets Maya's but just doesn't.[/spoiler]\n\nI found the UI to be a bit of a mess. Fast travelling was a bit of a pain to navigate through and my method of picking up every item singularly and marking them as trash was very tedious. Once you have a permanent loadout you're set to use however the option to auto sell on pickup was very useful.\n\nI didn't really enjoy the variety of enemys and designs. Only thought the eden 6 dinosaur creatures were fun with cool designs. Bosses are the worst in this game, with a lack of main bosses to begin with and no interesting designs. I'd really only praise the first vault boss Rampager for being a cool design and the vehicular boss Carnivora for it's use of vehicle gameplay.\n\nAnd to finish off the ending is just underwhelming. The final boss fight is small in comparison to what it should have been. And siren powers just become a plot point to save the day. Ends up treating the cast like they're just superheroes compared to how they were in BL2 and BL1.\n\nThe DLCS aren't really as good either however are at least more interesting. Each being short stories about other characters in a situation we have to help fix. They all expand on other characters more such as Krieg, Timothy/Handsome Jack Double, Gaige & Deathtrap, Wainwrght and Hammerlock among many more. Each of the DLC are relatively fun and not as stupid as base game plot.\n\nThere are many other negatives people could point out I have just mentioned my main points. Overall TLDR though this game lore wise sucks and even annoys me. But if you mute, ignore and just shoot things the game play is pretty good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i love this game so much but theres no NATIVE splitscreen and it pisses me off man",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gunplay, as always is improved over the first two games, but Jesus Christ everything else sucks butt. Level design does NOT reward exploration like previous titles and action is separated by too much nothing. Levels are too big, because the designers love their terrible vehicles so much and combat is too short to feel satisfying. Fun to shoot things, but not enough things to shoot and I have to listen to meme-y bullshit constantly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not even on sale.  5.5 hours in and I'm honestly not exaggerating when I say about 20 minutes of that was actually shooting people, the rest was wishing to die while people written by teenagers yapped in your ear.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Although the gameplay improved, this one lost the essence present in the 2. There is no more of that acid humor, no more twists and drama like the previous... It's all wrong.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Auf einmal der gesammte Spielstand weg und angeblich nur 2-3 Std gespielt. Stunden habe ich mit dem game verbracht und nächtelang gezockt. Sämmtliche DLCs durch und gelootet was das zeug hällt. und jetzt alles weg alles umsonnst.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This must be the most unbearable shit-ass story I have ever seen in my entire life, fuck this half cooked script, fuck the awful characters and their stupid \"development\", this sets the bar in hell for story telling. the gameplay is good though.\n\nI'd recommend installing a mod to get rid of the story altogether or at least mute the character's voices. (believe me it's THAT bad.)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They destroyed the lore, killed off my favorites characters and to top it all off I can't even permanently remove this game from my account, there's a convenient error when trying to remove it.  \n\nIf you're looking for a lead up to Borderlands 4, don't buy this game. It's the worst game in the franchise, lacks soul, story telling, and personality.  The game play and graphics is the same old but minus good writing and innovation. Save yourself the money and slogging through crap gameplay and story.  Seriously, this game soured my thoughts and views for this entire franchise and company.  It's that bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros:\n- Fun gun-play\n- Cool areas\n- Cool new mechanics like sliding\n\nCons:\n- Boring characters\n- Boring story\n- Terrible humor, betrayal to the previous titles\n- Killing off everything that related to previous titles\n- Worst of all: Overwhelming loot abundance. The game condescends by throwing immense loot amounts at you, and mostly stuff that's only few % better than the equipment you already have. If you enter a room, you are faced with at least 10 new guns. The game doesn't let you just run through and enjoy, it throws chests at you every 3 steps. IF you have OCD, stay away from this game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont usually write reviews but just stay away from this game, ppl are saying the gameplay is good but the story is bad. THAT'S WRONG the gameplay is a massive step down from bl2 and even bl1. all boring nonsense, i barely got past the tutorial even though i've played bl2 10 times over. stay away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to love borderlands and I couldn't praise it and the company enough.\r\nBorderlands 3 was the turning point for me, even after buying a dlc that never came for the pre-sequel. The gameplay is great, but the story is cringe. A character named ava has managed to make me hate everything about this game. If you play it, mute all dialog and remove all subtitles. My pc is more than capable enough to run this game, but after 30 minutes, i'm down to single digit fps drops. The CEO is a complete creep and shill. He made this game'e antagonists after mean streamers that bullied Randy Pitchford.\r\n\r\nTLDR: If you play this game, mute it and remove subtitles. Do not buy it for more than $20.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The gun play is amazing. That is the only good quality about this game. The writing is some of the most annoying obnoxious drivel I've ever heard. My friend and I could not pay attention to anything said after a while. It is so boring and forgettable. BL2 had some fun writing that you never really get tired of. This game I was grateful when it was over. I'm uninstalled as soon as I was finished. Hopefully BL4 will have good writing and good gameplay.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If there's one thing that will never change about Borderlands it's the fact that every single game is optimized by Cr4p-Tr4ap - employee of the month (every month).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Probably the best combat and skill tree systems in the whole series, worst everything else\n\nOnly play if you don't care about a main story or meaningful loot drops, just play for brainless fighting and to get ur gambling addiction fix since \"legendaries\" in this game become more common than commons very early on\n\n\nListen to ur own music instead of listening to the main quest-line, side quests can be ok at least they're more bearable to do\n\n(I also have 85+ hours on console)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good Looter Shooter but Ava and the Story. Does not make it worth playing. I recommend getting it for free on Epic if that deal comes again or get it on a Sale (75% to 90%).",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}