{
  "positive": [
    {
      "review": "In just 12 hours, I have determined this is the best WW2 RTS I have played since Blitzkrieg. Tons of fun playing the dynamic conquest game mode. Finish the tutorials, watch/read a few tips and tricks guides, and you will be set!\n\n50 hour update: I still enjoy what this game has to offer. Like other reviews state, the AI is a little clunky, but nothing that really distracts me, or that I can't account for. The dynamic conquest and campaign is where is spend most of my time playing, because I haven't really desired more.\n\nHere are some tips that changed the game up for me:\n[olist]\n     [*] when entrenching, use shift to set them all up without having to click multiple times, and use k to disband the squad so they stay with their foxhole\n     [*] when not mobilized, get out of your supply vehicles, this will keep them safe(er) from the enemy. \n     [*] Your units will run out of ammo before they run out of gas. \n     [*] Infantry stats matter, understand them.\n     [*] When playing dynamic conquest, you can loot and use equipment left on the battlefield in later matches, or sell it to afford more of your own. Save a tank crew for your final deployment so you can go around to repair.\n[/olist]",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "This game only recently came to my attention, quite a while after its release — which is surprising, since I’ve always loved games set during World War II.\r\n\r\nIn my opinion, I’ve played almost every title that explores this theme, and this one might be among the very best. The fact that it’s a simulation and also allows you to control any unit directly in a quasi–first-person view adds tremendously to the overall experience. The landscapes, the level of detail, and all the little touches the developers paid attention to are simply fantastic. For example, the way soldiers react when they’re hit — how they fall, the realism of the animations — may seem like a small thing, but it greatly enhances immersion.\r\n\r\nI definitely recommend it — whether for the mission mode or the practically endless research-based conquest and defense gameplay.\r\n\r\nIf I could suggest one improvement, it would be to allow players to preview units or vehicles in the research tree before unlocking them — like seeing the size of a squad or the layout of a tank. Maybe there’s a way to do that and I just haven’t figured it out yet.\r\n\r\nAnother great addition would be if soldiers could receive medals or distinctions as their XP and rank increase, or if there were a main commander character leading the troops who could earn unique decorations — that would make the experience truly next level.\r\n\r\nIn short, I highly recommend this game to anyone who enjoys deep and strategic WWII simulations!",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "One of the best games I’ve ever played in my life. I’ve played all the other WWII RTS games, and I can tell you this one is worth the price. The developers not only care about the game itself, but they also care about the community.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I'm mainly a combat flight simmer.  I've also put a good bit of time into FPS games.  This game is my first foray into the tactical RTS genre (unless you count old board games from Avalon Hill as a kid).  That's some of my background fyi.  But if you're a lover of WW2 history like me, and/or games in this genre, I can't recommend Gates of Hell: Ostfront and its DLC's highly enough!  I've found it VERY challenging, but equally addictive!  (1000 hours invested now, in ~2 years!).  I've played almost no multiplayer - only 1 story mission with a friend, so far.  It was super fun, & far easier to manage all the assets.  I plan to do a LOT more COOP mode in this game.  I suck when lots of micro'ing is required, so I'd do poorly against most human players.   But If you want accuracy, numbers, and interaction - which the game delivers in spades - then the micro is just a necessary evil.  I love the historical battles they depict in the campaigns (even though they're hard for me to win).  But I think Conquest is my favorite mode right now.  I'm able to beat the 'heroic' level AI most of the time now, but I still lose some too.  Some people complain there are too few Conquest maps and I'll concede we could use more. But I believe the devs will provide more over time based on their outstanding track record of free updates & improvements.  Regardless of that, their open modding format means if you really tire of all the existing Conquest maps, you can just start using some of the excellent mods that offer them (along with more factions, other time periods, etc., etc.). That's what I'll do if needed.  In short I have nothing but very high praise for the team at Barbwire.  THANK YOU for a fabulous piece of work, guys!!  Looking forward to \"Finest Hour!\"",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game was on sale so I checked it out. I'm immediately hooked. It's like you took 'close combat' 30 years into the future and gave it steroids. Awesome game 10/10",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "a truly lovely rts game , basically men of war but much better more detailed and with loooooooonger missions , if only it had free dlc's",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "First time playing dont understand the controls then uninstall then download again then try to undrestand the controols by watching you tube then understood then playin the german campain played till the normal difficulty then buy the DLC \nWould reccomend to my friends",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game and its developers are the kind that give hope to us, the customers. It's clearly made with passion, with our feedback being heard and a amazing attention to detail.\n\n It does have some flaws, like the unit pathfinding and the enemy spam in some defense sections. However, the missions, historical recreation of the maps, sound design, and constant updates improving the game make it a gem in the genre.\n\n Two great bonuses are the infinite amount of mods in the Steam Workshop and the co-op mode. I'm having a lot of fun playing Conquest and Last Stand with my friends.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best strategy game there is. Far exceeds Men of War: Assault Squad 2 in every way except modding",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "love this game its great even with no dlc but i STRONGLY recomend them as they make it so fun and of course the mods are great but remeber to update otherwise they will mess with youre game",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Call to Arms: Ostfront is exactly the evolution I always hoped to see from the classic Men of War series. As someone who has spent countless hours playing every MoW title, I can confidently say that Ostfront feels like a true step forward modernized, smarter, and more dynamic in every sense.\r\n\r\nOne of the standout improvements is the AI. Gone are the days of soldiers running into gunfire like they’re eager to meet the afterlife. Units behave with a level of intelligence that genuinely changes the flow of battle. They take cover intuitively, flank with purpose, and respond to threats with a situational awareness that makes every engagement feel intense and believable. Their use of support equipment and emplacements make them a lot more difficult to fight against and work around. It’s easily one of the biggest upgrades over Men of War and a major reason the game feels so fresh. Also the first person ability with direct controlling units while a bit gimmicky can be quite useful in some situations where line of sight is important and can be quite fun playing as a individual soldier.  \r\n\r\nAnd then there are the dynamic campaigns, my absolute favourite addition. Each mission feels alive, with shifting objectives, changing battlefronts, and the sense that your decisions impact a larger campaign map. No two playthroughs feel the same. The way the game blends strategic planning with boots-on-the-ground direct control is just incredibly satisfying. I genuinely love diving into these campaigns; they keep me hooked for hours at a time.\r\n\r\nOverall, Call to Arms: Ostfront is more than just a follow-up to Men of War, it’s an improvement in nearly every area. Better AI, deeper gameplay, more replayability, and a modern polish that breathes new life into the genre. I absolutely love what the developers have done here, and I can’t wait to sink even more time into its dynamic battlefields and for the new British faction update coming soon!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best RTS or I'd even say... The best RTS game I have ever played. Hands down. I can't stop playing it, its like opium.\n\nEven though I have had a roller-coaster of a journey with COH. I have to let it go to play this full time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As other have mentioned, this game's biggest issue is probably the AI. Units have horrible pathfinding and require constant babying to get the to do what you actually want. Tanks will go side on to the enemy and get themselves killed, units will get stuck, ignore orders and do absolutely jack shit sometimes. However I think the gameplay, strategy and modding support more than make up for the issues this game does have. There's nothing else quite like it on the market (at least nothing with the same je ne sais quoi as this one). \n\nAnd seriously, check the mods out there's some cool-ass stuff in the workshop.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game earned my Labor of Love Award 2025\n\"This game has been out for a while. The team is well past the debut of their creative baby, but being the good parents they are, these devs continue to nurture and support their creation. This game, to this day, is still getting new content after all these years.\"\n\nThere has Never been a bad update, patch, bug fix, lack of content, creativity, or community.\n\nBarbed wire studios innovates and leads the RTS foundation and bed rock for fun, free, and creative experiences.\nI have never been let down by this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This gam is a very good rts thats goooood and worth playing.\nPS:this game is for people with autism.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an amazing game developed by devs that obviously love what they're doing. The AI is not the smartest, but the CPU AI is by design smarter than yours (or you'd just lean back and watch your AI do your work for you). Small annoyances here and there, but only detectable once you develop an obsession and put in hundreds of hours into the game (\"why can I do this with [this vehicle] but not with [this other vehicle], type of annoyances). \n\nThe Discord channel is great where you can report bugs (which are addressed in 99% of the cases, unless it's a bug introduced by the game engine, which may take longer to address), and suggest new features (but be prepared to make a case for why you want a specific unit/weapon/vehicle introduced, and oftentimes to other more knowledgeable community members with severe WW2 autism), etc. Modding is limited by the engine but there are amazing community modders out there whose mods have eventually made it into the core game. I wish they could work more on the Conquest Game mode a bit more, but the devs have made meaningful strides there as well. \n\nThe game can trigger tons of emotions: anxiety, despair, victory-induced euphoria, adrenaline kicks, and pure satisfaction, and the occasional rage quitting.\n\nI generally play Hell Let Loose, and I compensate the itch to have more overall macro control with micromanagement (and play other maps and environments) with Gates of Hell: Ostfront. Obviously not the same game, but they'll definitely scratch the same itch centers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]9.5/10[/h1]\nIt's truly a shame that such a gem remains overlooked.\n\nI find it hard to understand how a game of this caliber has stayed niche — its current player base hardly does justice to its quality. Although the game has some flaws, such as dated graphics and occasionally dumb AI, these do little to overshadow its status as one of the best WWII RTS/RTT games in history.\n\nIf you come across this game, I highly recommend giving it a try. I've seen many players intimidated by this game's controls and end up walking away. What I want to say is don’t be deterred by its so-called \"hardcore\" label, the game is quite intuitive and user-friendly if you give it a sincere try. It deserves to be enjoyed by a much wider audience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite literally the best GEM engine Game made thus far, especially compared to the Travesty that was MoW2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is pretty solid. It's an enjoyable WW2 RTS where you can choose between two different paths. Enjoy single-player gameplay “your way,” or prepare for highly competitive multiplayer (featuring a lot of first-person shooting, which is debatable in terms of effectiveness, but still fits the game).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been a ww2 strategy rts gamer for a long time and was surprised i haven't heard about this game until i saw the new trailer for the common wealth. I bought the game bundle and tried the game out for the first time 1 week ago. This game is awesome. I have always wanted a ww2 rts game, real in depth strategy, 3rd person control of individual units or platoons type off game. The game mechanics are very good. I will most 100 percent purchase the  commonwealth dlc , Im very happy with all this dlc and the quality of each one. I love the fact that it takes me hours  to complete a single mission. The ww2 immersion is on point and I would recommend this game to anyone who loves ww2 rts, strategy, 3rd person control games. I hope the developer keeps making dlc for the next 10 year and include factions like Italy, Japan, Canada, China etc. I would like the developers to keep up there good work and keep improving on the visuals and add even more unique units from ww2 and keep making these awesome campaign missions.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "\"One of the best World War II games I have ever played, after Men of War: Assault Squad 2. I definitely recommend it.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ну что можно сказать, игра определенно имеет хорошие и положительные стороны в его большинтве, в эту стоит играть хотя бы ради динамических компаний ибо они действительно могут увлечь. Одиночные миссий ну... meh... Скучные и порой бывают моменты кгда миссия не продолжается пока не убьёшь засевшего в кустах партизана. Мультиплеер, ну нормлаьный, многие жалуются на рассинхроны но я не заметил каких то прям фундаментальных проблем с ними, а так думаю рекомендую вам приобрести это, игра определенно имеет будущее, 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I refunded this game because I didnt care for the mechanics or graphics. I rebought it because I didnt give the game a chance.  The mechanics are finicky especially in 1st person. There is a bit of glitchiness such as your troops screaming TANK When you destroyed and killed everyone on the other side. But if you play over a day worth of gameplay you will get used to the mechanics and figure out strategies and honestly, really enjoy what the game offers. Its like Hell Let Loose but at the same time not really. I truly respect it for being its own unique thing.\n\nEdit: Also, I also realized I never gave this game a chance when I realized there was an active modding community. Adding more and more hours to the game. Improving things like graphics, gameplay etc.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really good rts\r\nAI is a little janky\r\nand before you get used to the controls you'll be malding.\r\nOtherwise amazing, great attention to detail, lots of missions, units, the sound effects.\r\nThis games developers really listen to feedback, it's a real labor of love.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is a GAME CHANGER to strategy games. Having the ability to play as a soldier or commander and control a squad in first or third person. Also the ability to pick up other fallen soldiers weapons and use them in other matches. Over time you could have an OP squad or have all your squads be OP further on down the war is amazing, (In single player). You can also do the same thing on multiplayer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Company of Heroes meets foxhole and hell let loose. Considering how much you can do with different mechanics I'm suprized it doesn't have game breaking bugs but other than a larger learning curve than simpler games it's fantastic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games ever made, a must for any RTS fan! \nThe makers continue to improve the game years after release with lots of free upgrades and ones to purchase",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great rts game for the ww2 genre, but pathfinding and AI needs a lot of work. I have to spend way too much time micromanaging my units or else they'll make irrational decisions that get them killed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game with a lot of content! Great historical detail and accuracy!\r\nThe developers continue to support the game and add content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this series since the early days of Men of War and I can say with confindence that this is the best, most polished iteration of the series. You really see how the devs put huge effort into every subsystem and little detail.\n\nThe game is a joy to play, with frequent updates. The latest expansions are incredible and well worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! One of the best strategy games out there! Very good managment level, and dynamic campaign with units gathering experience is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best top-down strategy games I've had the pleasure of playing! Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Massive improvement on the Men of War series. Keeps everything we loved and improves on so much more. Runs well on my potato laptop. Mods are great, DLC I haven't touched yet. Conquest is an interesting take on Skirmish mode, not sure if I like it as a replacement, I think both modes side by side would be best, sometimes I just want a quick battle against bots and not a whole campaign. Overall great game if you're a fan of the Men of War series or WW2 and RTS in general",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has given me an unbelievable amount of fun in all of my hours playing it, despite the fact I have none of the DLCS ( which I'm very sad about especially with the soon to release British DLC that I've wanted for a long time, but know I probably won't be able to ever get it :( sadly), base game is extremely fun, some mods are worth while downloading off the workshop, just wish I had the DLC's to enjoy and play even more of conquest with them. Game is better than any other WW2 RTS I have ever played and I just hope that I can enjoy this game for even more years to come. Base content is already insane, with the DLC's probably adding god knows how many more units and features to the game. A VERY worthwhile purchase and is something that I would hope any RTS player can enjoy at some point in time, especially if they can afford the additional content for the game as well. \nPS: Only major bug I've ran into was when I received an achievement on steam for a secret objective for a DLC I don't have, I just got it while trying out one of the campaign levels. No clue how I got it, but its there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very much a must have. You can tell the Devs love their game. Can control units and split them into individuals. 1st person control as well. It's common for me to spend a couple of hours on a mission with reinforcements build up defense and planning an attack. would like to see more skirmish missions and base building structures. With 2583 hours in this game, you can guess how much i love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing ww2 strategic and tactical game of incredible detail.  A successful player will harness the nuance of the game mechanics at a micro scale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all time favorite games, as a long time RTS and FPS fan i have found the balance between the two categories to be incredibly fun. Each play stay feels like a equally enjoyable game. This game has the perfect amount of depth and playability. I always look forward to more new games and DLC's.  \n\nI wish they would add an ability to unit stats before unlocking them in the research section of conquest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best RTS around from the last couple of years, while it might feel very hard at first with the intensive micro its not as hard as it seems. Also don't forget to check the Editor, there is endless replayability with community content, and you can custom create your own battles fairly easily.\n\nOverall its a very solid game with constant updates and devs that actually care in improving the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Base game and DLC aren't cheap, but the US DLC and the Finns are well worth it for what you get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just the best in it's genre- full stop. The full each-unit control spoiled all other RTSs for me- and that's a good thing.\n\nIt does come with a healthy patch of JANK- while that's expected for the potential amount of units on the field that have to be animated.\n\nOnly thing 2 things I wish for is: \n1. A persistent lobby system for Conquest mode which could work for my second point-\n2. \"Player 1-2-3-4\" pre-battle unit allocation, or just straight up different unit-call-in system for Conquest mode.\n(being a host in conquest is a frustrating mess)\n\nThat aside... if Devs are thinking of new games or DLCs to make... more time periods like WW1 and Cold War that would be welcome across the board, I bet (yeah there are workshop mods, I tried moist of them, but they are pretty unfinished, prone to crashing and often out of date).\n\nOverall- I love the Game and the Devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far the best WW2 RTS you can play, with frequent love from it's development team and yearly plans to update + add new DLC content to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing GoH for years, and still love it. Some mechanics are not perfect, but the overall experience is way better and more realistic than other titles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let's not be afraid to say it – the best RTS of its kind on the market. In a certain sense, it's almost without competition if you're looking for realistic gameplay in the theater of World War II, since Sudden Strike 4 is just okay, Blitzkrieg 3 is bland as lukewarm tap water at its best moments, Company of Heroes 3 hasn't had much of an idea for itself since launch day, and Men of War II played a game against itself that it knows how to play and lost by mutual walkover, but that's another topic altogether.\n\nWhat you can love it for…\n\nUnbelievable attention to detail – from uniforms, vehicles, weapon mechanics to the prepared maps.\n\nAbsolutely extraordinary and unprecedented ability to perform epic actions on the battlefield. I don't know of another game of this type where you can select a single soldier who picks up a rocket launcher from a fallen enemy to flank an enemy tank from behind, hit it just right to set the ammo compartment on fire, leading to a turret-tossing spectacle where the turret crashes into a building, collapsing part of it and killing two enemy soldiers… nope, I just don't know of any.\n\nThe complexity of everything we do: manage ammo, position units to the centimeter for optimal visibility, every battle is a challenge, every clash requires an individual approach, and sometimes you end up playing 5D chess with a well-placed and covered anti-tank gun if you don't have the right countermeasures.\n\nCo-op with another fan of the topic is a bullseye.\n\n…and what to think twice about\n\nUneven AI – unfortunately, both enemy and ally AI can be inconsistent, especially in conquest mode. They attack incoherently, defend clumsily, and sometimes feel like \"spicy\" shooting range dummies. It's not a total disaster and can surprise you at times, but it's an area where the developers still have work to do.\n\nDespite everything, a fairly high entry barrier, especially if you're not a fan of micromanagement.\n\nThe full price with DLCs is a bit off-putting, but I can't say I regret the purchase (if someone wants to test if this type of game is for them, it's worth grabbing the original – Men of War: Assault Squad 2, which - on sale - costs less than a kebab).\n\nThe rest is silence and depends on the player's preferences. No doubt it's a product aimed at a specific target audience, and if you're in it, you can sink many hours here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is probably the most in depth WW2 game if you like being on the field or commanding. A great succesor of the Men at war games for the modern audience. The availability of mods and Dlcs at this point make it something to keep an eye on. P.S-VOTE FOR LABOR OF LOVE AWARD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game and it gets better with each update. Only small complained i can make is the AI of the units have an IQ below the outside temperture during the winter war.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun tactical game to play with friends, without them this game is still a little too unpolished to recommend buying. \n\nThe A.I is lackluster(understatement) the game is seriously unoptimized and full of bugs, but the moment you blow up a Tiger with a trooper that crawled half way across the map wielding a satchel charge and you hear your friend having a meltdown all your complaints will wash away. \n\nP.S If you ever need a high value target dead do it yourself the A.I may have glaucoma",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An outstanding experience. The sequel that MOWAS2 deserved, building on all gameplay and visual elements established by the previous title. The dev team always keeps a small, manageable, and achievable scale of updates and improvements, with new content always feeling fresh and worthwhile. Existing content receives constant support and improves in quality over time. Game gets rebalanced often, and well. New gamemodes are added frequently enough to keep interest from waning. Lots of replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AWESOME!!!! Mix of RTS and third person shooter. Requires actual effort/strategy to complete, run and gunning = death! A bit of a learning curve but awesome overall. 10/10 would recommend!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly pretty fun, protip, get MACE for fun conquests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with a lot of labor being put into it by a small but dedicated team. a true labor of love game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun neat game that managed to improve over MoWAS and push it to the next level",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun tactical RTS, with good sounds and models. first person direct control of individual units is great. only complaint is the sometimes heavy micromanaging of units to use units at their most effective.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best small-squad realistic RTS I've played. For the hours of thoughtful gameplay and ongoing development, this game is worth every penny a hundred times over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In a world where  true *Men of war Call to Arms into the Gates of Hell* to fight for RTS genre, Ostfront steps forth to save the genre.\n\nIn my view, the best CINEMAtic, most epic RTS (albeit clunky from time to time)  that actively keeps on giving and  expanding on its quality content, features slowly shaping the \"perfect game\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good RTS. Its designed with realism in mind, all units have thier own inventory, you can controll each unit in third or first person view in addition to normal rts mode.\r\nThe Unit variety is insane and only grows with each DLC.\r\nThere is even a dynamic campaign where your build your own army and can repair enemy equipment to take or sell for your own army.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want to describe this game but my words are unable to describe such a masterpiece. It is true I have not played for that long but I will address the AI path finding for new players.I do not suffer from the AI path finding. Yes, there is a few times it happened but some people are exaggerating this problem to a point it stops possible new players from coming. I find this game great but much of it is locked behind DLC's. That is my only complaint as you can have an enjoyable experience without them and the modding community is supreme. I recommend this game to try out and add it to their game library as even when it is somewhat boring the modding community spices your experience up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute masterpiece!\n\nI play almost exclusively Dynamic Conquest, some of these features I mention don't apply as much in multiplayer.\n\nYou can micromanage inventories and take direct control of every individual unit on the field. Not only that, but they will be in every battle until they die or you dismiss them. Every person has a name. I actually care to keep everyone alive through every battle unlike other games where you just spawn more nameless pawns out of a barracks to send to the slaughter.\n\nTank warfare has been meticulously crafted. I never cared for tank battles in games until now. Armor is thicker/thinner at certain points, the size/type of munitions will play a major role in the outcome, and your tanks have actual crewmembers rather than it just being a lifeless hunk of metal. The tracks/engine can get damaged, leaving the tank stranded and vulnerable to molotovs, anti-tank grenades, etc. You'll have to make quick decisions such as choosing to evacuate your crew and have them run to safety while hoping they don't get mowed down by machine guns. \n\nThose are two of my favorite points but there is so much more.\n\nThere is still so much untapped potential in this game, and I hope they continue to work on this for years to come.\n\nIf you want a strategy game that was made with tremendous passion and attention to detail, this is it. I will happily pay extra for more DLCs and new games so long as the developers keep their spine and don't give in to the same ideologies that are showing up in the games of many AAA developers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game... It's not just a game, it's an experience of blood, sweat, and tears.\nWhen played singleplayer this is an incredible real time strategy game, with a fantastic direct control mechanic and inventory system, an awesome sucessor to the men of war series.\n\nHowever, when played in the multiplayer modes, whether it is the conquest campaign or the skirmish missions, it becomes both a comedy and an intense World War Two simulator. No other game I have played give you command of an entire platoon of troops, while letting you run around inside with a flamethrower, or give a MG-42 to your commanding officer taken from the hands of a deceased enemy soldier. The graphics may be aging compared to modern games, but in no way are bad, the lighting of a tank's machinegun on a night map is one of the greatest sights in video-games today.\nThis is the game you did not realise you wanted, but will love after you play it for the first time.\nWhat are you waiting for Lieutenant? The troops need your command on the front lines, we'll be in Berlin by Christmas!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game of the ww2 RTS ever made. Developers has done so much for the community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mortars fall all around the position. the rattle of machine guns is near constant. someone is screaming. I must check each inventory to find the snazziest hat. highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must have tactical combat strategy game, very moddable as well too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great developers, great mods and community.\nBuy this game if you like WW2 RTS that can become anything from a COD campaign to a Zombie Apocalypse.\nThe mods and developers make this game great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very challenging and promising strategy game with option to take direct control of individual unit. Dynamic campaign is amazing. It's a pity that there are so few maps available and that the optimization is quite poor / bad. I hope that in the future developers will improve game performance, graphic quality, refine AI and add more maps and more extensive dynamic campaign,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for single player missions and for multiplayer PVP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best WW2 RTS You can find\nHas awesome graphics and detailed models while not being too resource heavy to run\nYou can mod the game which gives a lot of posibilities and extra stuff to do, multiplayer is really fun with friends but solo gameplay is very enjoyable aswell. Can't wait for more DLC's!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, if not the best and most detailed, customisable and comprehensive WW2 RTS on the market.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of if not the best ww2 strategy games I have ever played. Its got the most comprehensive list of equipment ever used in WW2 media. I applaud the developers for their commitment to historical accuracy and detail. Not only that, they continue to update this amazing game with high quality updates.\n\nIn a time where we get nickeled and dimed for every bit of content, these guys update their older dlc offerings with even more free content. There are a few quirks with AI and its pathfinding but man this game is beautiful in its simulation of WW2 warfare. \n\nWell worth the time and money spent! Great job Barbedwire Studios! Because of you guys, I got to learn more about Finland and the Winter War.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A work of love, Mods are getting better and better!\nA must buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, the best WW2 strategy game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ill be honest I only play conquest but I love this game and I always come back to this game! never get sick of it. Endless mod support and constant updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game and the atmosphere. But it's best played with and against friends. The AI in conquest are not too bad. Playing conquest with friends is where I had the most fun. My biggest frustration however is the pathfinding with large rocks, your tank will get stuck on the edge, and just get stuck trying to move forward. Or the infantry will scale them, instead of moving around them and one will get stuck on top pinning the entire squad to stay with them. If you can deal with that and you have some friends you'll be good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the direct control features ❤️\n\n\n\n\n\ni can experiment a lot more in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve never liked RTS games, but Call to Arms – Gates of Hell: Ostfront is special. What immediately caught my attention was the ability to control each unit in third-person, the tank battles are phenomenal. The game’s sound design is a show on its own, nothing is more satisfying than the roar of the Tiger I’s 88mm cannon.\n\nOn top of that, the dev team is always delivering constant improvements and new DLCs.\n\nI can say with absolute certainty that this is the best World War II themed game I’ve ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great RTS game with in-depth mechanics that are a nice combination of the old stuff with some new game enhancements on top. By no means is this game for everyone, but if you enjoy a difficult and rewarding gameplay loop, fun with friends and the second World War as a background setting, you'll no doubt like this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's definitely some quality of life changes needed for the game AI but all around, Great game. I love playing custom maps from the modding community and and being able to control most of the field. Only got to play with 1 friend on Defending along side, and we got overrun and had a blast. Its still somewhat hard for a new player to get used to it but once you play it for a while, the field can flip just like that. Lets also not forget the details the devs put in for the vehicles, not all vehicles are 1:1 Detailed but really damn close. The fact you can fight in early part of the war with little light panzers all the way to the late war with King tigers Is still awesome and really can make you feel like a WW2 General no matter what team your on. I could go on more but i don't want to Write a Paragraph. All-in-all, Great game and I recommend you try it out yourselves. I'll see you out there War Commanders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably the best RTS game I have ever played. Devs surely are putting a lot of effort into making this game. Judging by how challenging the campaigns are. I'd recommend playing the campaign at veteran mode so they won't be too easy or too hard. \nLearning about game features and controls can be tricky at first, but once you become familiar with them, this game can be very enjoyable. Even though AI pathfinding will sometimes make you want to quit. Overall 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Men Of War, but better. Totally addicted with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy good WW2 RTS, probably the best one out there, albeit with it's quirks and issue, but you can defo overlook those with this much content and replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game one of the best RTS WW2 games, if you like mods and mod compatibility go to call to arms but if you want ww2 stuff this is the best option.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed the men of war series and this just takes the cake for one of the best WW2 strategy games out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a fun WW2 RTS you've honestly found it I love the mechanics and models of the game, mostly the sounds of the game are amazing from the guns, explosions, and voice lines it honestly gives a WW2 feel. \nMy most favorite thing is the little quips the solders will say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still love this game, love to set up AT position's or entrench with tank's when defending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has come so far from where it started. The developers have literally poured love into this game and it shows. May CTA - Gates Of Hell forever thrive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth getting just for the star wars and warhammer 40k mods alone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better visually than MOWAS 1 and 2 gameplay is fun and addictive. Smoking a panther across the map with direct control while aiming at a pole is the most satisfying thing you can do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has one of the best Developer teams behind any game I've played. Every update is well-made and every DLC is well priced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for all RTS lovers. i say it is worth every cent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best WW2 RTS game I played since COH 1, the game have too much detail and required huge learning curve, critical thinking, and micromanaging skills that sometimes makes you overwhelmed, it's not like you just relax sit and play and clicking everywhere on the screen without any clue, it requires some amount of brain cells to use to play. For the new players the best strategy to play this game is to complete bootcamp tutorial in Germany campaign first and then play first 3 missions in that campaign to get the grasp of it, the atmosphere, sound effects and graphics are detailed too and very much close to these AAA RTS titles.    \n\nNow for some negatives the game requires some CPU cores optimization and AI pathfinding (one of my Panzer 3 purposely blew up my fuel truck for no reason by running over it due to AI path finding lmao) mainly as many of the players are also experiencing, and with some of the gameplay UI is too small, frames rate drops are sometimes becomes bad in the conquest and in few of the campaign missions when there is a huge destruction and with many buildings, trees, and infantry units on the map and these are just the issues that stopping this game from best WW2 RTS to great, and it needs to be fixed. Hoping that devs will fixed these issues in the upcoming updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its ok, but its literally just Assault Squad 2 with slightly better graphics and sounds. The AI still sucks, the vehicles behave the exact same as AS2, the UI is worse honestly, the game randomly deactivates whatever mod i have loaded so i have to go do it again. I bought this because i thought it looked like a good successor for AS2, but its basically the same game with a new coat of paint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Massive potential, excellent work so far. This game, alongside its predecessors, holds a special place in the lineage of RTS gameplay. Imperfect, as other reviews have identified, but worth an investment. I find that conquest mode alters my attitude toward unit-preservation in a grounded, rewarding way. Veterancy matters. 3rd person play - in the midst of an intense battle - has an incredible immersion-factor which history-buffs and aestheticians will likely enjoy in their own ways. As conquest mode matures in its own right, and modders gain a better grasp of the game's structure, CTA GoH: Ostfront has the potential to truly instantiate a singularity in RTS history. Great stuff, would recommend - if you can stomach some learning curves, and a bit of (charming) jank.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A worthy sequel to Men at War the game is better in all aspect and probably the best in it's genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite various issues, it's still fun and the mods just increase the fun value imo. The game price is.. fine but if you really want everything I'd say wait for a sale to get the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "anyone who says this game is bad or gives it a bad review is just butthurt because they have to use their brain hit more than two buttons to win. skill issue]\n\nThe game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, \nEasy to control RTS that's true to the origins from WW2, as a tank nerd myself I'm very happy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A mix of three things I like; fps shooter, strategy, resource management. Now only needs a roleplay element to become perfect in my eyes. A custom character would be so good to have, like a commander that could level up and receive personal traits or skill points",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story missions are confusing and even bullshit hard on higher difficulties, but the game is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Coop game, but could do with a bit more polish",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game in every way. Its best in the genre right now and attention to detail is amazing. campaigns are great. CO OP mode is perfect. DLCs are fun. Great job from developers and i hope they keep up the good work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Лучший духовный продолжатель идеи Men of War. Разрабы, я в вас верю, продолжайте выпускать обновления и пофиксиите уже сраный ИИ.\nи да..\nНЕМЦЕФИЛЫ, идите на далекое эротическое",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game was worth the 35 Euros. Campains are good, and there are some good workshop mods. Sounds are realistic too.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "[h1]Great RTS, But the AI will make you uninstall[/h1]\n\nThis is probably the best RTS in its genre. The [b]attention to details[/b] is amazing, the [b]atmosphere[/b] and historical accuracy you feel like you're really there. It feels great to play, [i]up until[/i] it doesn't.\n\n[h2]Why I'm so frustrated[/h2]\n\nThe game gets ruined by an [b]immense amount of AI spamming[/b] in some missions. It gets to the point where it's literally unplayable. Strategy doesn't matter when the enemy gets infinite units, as the game just turns into a meatgrinder where you focus on endlessly killing AI tanks and hoping yours survive.\n\nTo make things even worse, sometimes your own AI just picks a weird path and runs straight into the enemy for no reason. So you're fighting an enemy that's a perfect micromanager, while also trying to stop your own guys from getting themselves killed like idiots. It's frustrating as hell.\n\nA lot of these missions are likely meant for co-op, but [b]you can't host your DLC missions for friends who don't own them[/b]. Since the game's missions are mostly locked behind DLCs, I was forced to play them alone. I can micromanage a few squads, but trying to defend a huge area against an overwhelming amount of AI attacking you (on a mission where you are the one supposed to attack) makes me uninstall this game.\n\nAnd when the AI starts spamming, the performance starts to show some cracks. It all just becomes a huge, laggy mess.\n\n[h1]Final verdict[/h1]\n\nBasically a hit-and-miss game.\n\n[b]BUY THIS FOR CO-OP[/b], if your friend has enough money to buy all the same DLCs.\n\n[b]AVOID THIS FOR SINGLEPLAYER[/b], unless you're ready to waste hours battling an AI that's 100 times better at micromanaging crap than you are. I really liked this game, but I've got enough of AI spamming bullshit.",
      "voted_up": false,
      "votes_helpful": 148
    },
    {
      "review": "I RECOMMEND THIS GAME 100% .........its maybe the best game ww2 ever, certainly among rts games i believe its king. but this game has been out for a while, its bread and butter is conquest id even argue its the main appeal of the game but for some reason the devs are so hesitant to bring meaningful change to it. maybe the devs dont see the appeal or its not their flare or maybe its a pain in the arse to work on i dont know but i really want to know why we havent seen any major updates to the mode. end of the day ill gladly keep throwing money at this game because its easy to see the passion. I DO RECOMMEND THIS GAME BUT im giving it a thumbs down because its like watching that friend whos talented doin well for himself but you know he can be doing so much more",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game would be great, were it not for the absolute most dogshit retarded AI ever in the history of RTS. If you enjoy being forced to babysit dozens of braindead units that will literally kill themselves or bend over spreading their cheeks for the enemy if left to their own devices, buy this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the amount of babysitting you have to do to your own dudes is COMICAL. a shame because the game looks and sounds great, but the AI is actually just so absurdly retarded that it makes playing the game incredibly frustrating.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I dont know how people comparing this boring and bland gameplay and effects with MoW. Controls are clunky, explosions feels like fart. Navigation problems are not even the worst problem in this game. This game doesn't even know what 'taking cover' is which is a must in this type of game.\nThis game might be fixed later but right know in this state, I would mod MoWAS2 and stay there.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "don't list games supporting partial controller support that do not in fact work!\njust don't list it as a part of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Call to Arms: Gates of Hell: Ost Front is an interesting combination of tactical level RTS and first-person shooter set during WW2 on the East Front, 1941-45. Graphics are quite good and the game offers a wide variety of equipment from both German & Soviet arsenals. The sim/FPS shooter aspect is an engaging high point. At times, combat can convey a real feel for the chaos of battle. However, numerous design flaws, & unnecessary micromanagement spoil what could be a potentially great game. \n\nGoH possesses an incredible amount of detail and control over individual units (particularly infantry); however, these detailed features end up causing unneeded over-complexity which leads to constant micromanagement. If the game had some decent AI that allows you to give general orders to groups of units it wouldn’t be a problem; but other than some basic defensive commands for individual units, you have no help with this respect. \n\nAdditionally, there is little comprehensive feedback indicating what you’ve done once you’ve given orders. Location markers that note your troops destination only appear if you’re clicked onto a unit, and there’s nothing to affirm whether your unit is positively aiming at an enemy target. So you’re largely left trying to memorize what you’ve targeted & where you’ve sent numerous units. Pausing the game helps little, since this feature limits many of your unit’s actions. \n\nA lack of a decent battlefield overview is another major defect. The mini-map is a muddied cluster of symbols that gives inaccurate locations and a highly restricted camera narrows your overall map view down to a small segment of the battlefield. So it’s hard to get a comprehensive view of combat during battle. Frequently you’ll find yourself unable to locate enemy units at critical times when your troops are being annihilated.\n\nOn top of this, virtually all battles require some sort of needless preparation in order to complete objectives. This primarily amounts to manually supplying each infantryman with special weapons, reorganizing numerous infantry squads, hastily planting mines, or hectically sending your units to defensive locations around the map just before the enemy arrives. It’s quite time consuming and, frankly, annoying. At the very least, the game should have some sort of set up phase that allowed the player to equip & place his units on the map before the battle begins. \n\nSo in the end, you find yourself spending much more time trying to organize, equip and command your troops than attending to the enemies attacks. When you do get around to engaging the enemy, you’ll find yourself hyper-focused on small areas of the enemy’s assault while all other parts of the map are completely ignored. In larger battles, ones where many dozens of units are involved, you’ll simply be overwhelmed by everything that’s happening. \n\nSo, overall, Gates of Hell is a mixed-bag. It can be genuinely entertaining, but unfortunately far too frequently, it’s just an aggravation to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everyone compares this to the Men of War series and for good reason, it is a direct clone (like trust me, if you have played them, even the objective complete music is the same lol). It has some really wicked aspects and fun mechanics but PAINFUL ones that just ruin the experience. And the AI is what everyone says.. its sh!t, you have to baby sit everything which is impossible. And the difficulty settings are frankly f#cked. If you play on a lower setting just to have a casual game, the defensive missions will literally just make you sit there for an hour with maybe 5 tiny waves of enemies its unbearably boring. Do not buy this game for more than loose change, I haven't even been able to finish 1 of the 2 campaigns because it is just agonising to slog through",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PC crashed when i was saving now if I even click load/save/continue it will crash the game ive done everything im going to leave this review here until some dev or someone can help but for now I cant even play the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not entertaining it's not on sale at the time of this review id say you shouldn't buy it. Oh and people are not overblowing the AI issues its really that bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game iself is playable and enjoyable.But there are many oh many minuses. Lets start with pathfinding, You must get to object Z from K, sure thing i will just use the most stupid and dangerous way to do it. Why drive though a wooden fence when i can drive around whole village? Only direct control save this from absolutely horrendous losses. In addition if you tow your vehicles and think they would que on the roads/paths in order to get where they need to get you would be assuming wrong, 99% of time they ram in towed stuff and outright destroy it, making defense/ attack harder or outright supidly impossible. Oh and that 1% is when tow vehicles just lose their towed equipment on the way. Your units see enemy charging, they will open fire and demolish them right? Wrong, They will let them get right in grenade range/or ignore them and get f-d themselves. Only thing that saves this are autocannons, cause they will attack ANYTHING and i mean anything. 2cm autocannon will attack KV-1, Tiger etc. even though it cant even scratch chrome off of them. Please fix at least pathfinding. Then i would be happy and wouldnt have to restart my campaign two to three times because pathfinding issue destroyed my AA or ground AT weapons.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand why this has such good reviews when one of the most very obvious features is missing. No ability to download mods on the fly. Like every multiplayer lobby has mods, and you have to go an manually search for each and every one of them, then restart the game, and then go into the options and enabled them after that, which caused my game to freeze up thus requiring yet another restart, and this is all just to join 1 match. The game is decent, but mod support is AWFUL.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont like this game. The UI is pretty bad and you troops need to much micromanaging so playing third person is not   something you do a lot. The tutorial is awful and extremely slow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "35 dollars to babysit every troop on the field one by one as the enemy AI advances simultaneously across the board with ease, oh and then the upside down tanks that spawn in late game making you waste your combat points.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the worst AI possibly ever made in a video game. pong is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes on start up constantly. You have to keep deleting the shader cache in order to play past the main menu.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Garbage to play in coop ,mods desynchronized even when its loaded in the same order like WTF...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well I love CTA, but my negative review comes for the common wealth DLC. I was super excited to see the British being added. Buuuuuut reading reviews for the DLC, most of the common wealth research lines are locked unless you own another older DLC..... I do not want to buy a DLC just to buy the actual DLC I want to play that makes zero sense to me as a consumer. So my review is gonna be a negative.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunately, it's a very unintuitive game. What a waste of 10 euros.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate this fuck ass game its so bad never play this ever DONT EVER PLAY THIS FUCK ASS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it only looks better than MoWAS2 plays horrible comparatively the AI will have your units constantly walking backwards towards their targets",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Performance optimization is abysmal. I have a 7800 and a 5080 along with 128gb of RAM and have installed this on 2 different M.2 Gen 4 SSD's. 1v1 Skirmish turns into a damn powerpoint presentation when my PC should be able to easily handle this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Totally unenjoyable single player. Easy difficulty is a joke, normal is impossibly annoying to win. What a mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's fun but sadly the game isn't very well balanced. Germany is objectively speaking the best faction in the game in PvP with some of the other factions not even having an S tier option in doctrine picks while Germany has multiple. \r\nIt's not that they need to be nerfed, it's just that other factions need the real things that they had in history to cover their weaknesses. America for example has infantry that are all insanely expensive, so they can't get on the field very well, but a simple fix would be to discount the cost of MPs or whatever filler squad you wanted. \r\n\r\nBut nope, instead some factions are effectively crippled for no real reason sadly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unintuitive/clunky mouse-interface combined with unfinished game play make this game unplayable and a waste of money. This is one of those games that show \"all mission objectives complete\", but the mission never ends - leaving you wandering around an empty battlefield trying to find out what you missed but everything is completed...bugs in the \"are objectives complete?\" check, make the game unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If u want to play men of war assault squad 2 with good graphics and visual effects, this one's for you. However, playing singleplayer or conquest makes you feel like babysitting babies with guns. Ai can be just plainly stupid. For example, when I order a tank to go somewhere, it will sometimes just destroy a ammo truck in the way; tanks sometimes refuse to aim automatically when attacked by the enemy AT. There are instances where you become frustrated with how braindead Ai can be. \n\nAlso conquest lacks replayability. Each enemy faction just functions the same way. The only variety you'll get is how units look. \n\nHonestly, instead of introducing new factions, they should rework the ai or enhance conquest experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game overall but get ready for the ai to shoot you through the smallest crack",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really didn't like the interface and controls. It just wasn't fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Super clunky, only worth when 75% discount.\r\nRepeated frustrations with getting your units do do something.\r\nOrder a tank to take out the major armour threat? It'll refuse to move into position, instead opting to shoot infantry. (You'd have to micro the shit out of it for it do what you want.)\r\nI've had my own infantry ignoring the key bind to go prone.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You will lose tanks in MP because the dumb ai will turn the Tank when you are not looking, which the enemy will take advantage of and move in for the kill, since side armor is weaker than front armor. \n\n\nBarbedwire Studios, Digitalmindsoft you added a option for tanks to only move backwards to prevent this issue when moveing can you do it again but for when the tank is not moveing?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the ai is beyond retarded but everything else is cool",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No gore. Bad voice acting. Ui from hell. Why canot do someone a actually good company of hero's",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is nothing intuitive about this game. absolutely do not like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WAITING FOR SERVER\r\nEXPERIENCING PREFORMANCE DROP\r\nWAITING FOR SERVER\r\nEXPERIENCING PREFORMANCE DROP\r\nWAITING FOR SERVER\r\nEXPERIENCING PREFORMANCE DROP\r\n\r\nYeah, what the F*CK EVER MAN! How about you worthless developer f*cks tear the whole game down and rebuild it in an engine that's not over TWENTY(!!!) years old?!! My friend and I had to repeat the same Downfall level SIX TIMES because the engine kept chocking on c*ck and disconnected me every single time!\r\n\r\nAbsurdly ridiculous how you people managed to keep the same circle jerk for TEN years with such performance issues! Your game is practically Men of War/Faces of War with lots of makeup on and that's pretty much it!\r\n\r\nI can swallow the fact that the graphics are outdated and, more importantly, that the AI is either broken or down right stupid... but these performance issues are a complete deal-breaker for me. Happened once or twice? No sweat. Happens continuously? No thanks.\r\n\r\nAlso crazy how you're crapping out new DLCs, but sh*t like this is either simply overlooked or, better yet, a given for anyone trying to play the game.\r\n\r\nUninstalled and not playing until you get your heads out of your as*es and do something about it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "so Great and cool Game with Potato server system",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everything fun is dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "truly the resource desynchronisation detected of all time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Alt f4 does not instant close the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Im gonna haunt the Clown Motel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fix the controls make ai not stupid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "have fun reloading",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 playable factions without dlc???????????????????????????????????????????????? insane",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont load",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Vladimir > Volodymyr",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dogshit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Great RTS, But the AI will make you uninstall[/h1]\n\nThis is probably the best RTS in its genre. The [b]attention to details[/b] is amazing, the [b]atmosphere[/b] and historical accuracy you feel like you're really there. It feels great to play, [i]up until[/i] it doesn't.\n\n[h2]Why I'm so frustrated[/h2]\n\nThe game gets ruined by an [b]immense amount of AI spamming[/b] in some missions. It gets to the point where it's literally unplayable. Strategy doesn't matter when the enemy gets infinite units, as the game just turns into a meatgrinder where you focus on endlessly killing AI tanks and hoping yours survive.\n\nTo make things even worse, sometimes your own AI just picks a weird path and runs straight into the enemy for no reason. So you're fighting an enemy that's a perfect micromanager, while also trying to stop your own guys from getting themselves killed like idiots. It's frustrating as hell.\n\nA lot of these missions are likely meant for co-op, but [b]you can't host your DLC missions for friends who don't own them[/b]. Since the game's missions are mostly locked behind DLCs, I was forced to play them alone. I can micromanage a few squads, but trying to defend a huge area against an overwhelming amount of AI attacking you (on a mission where you are the one supposed to attack) makes me uninstall this game.\n\nAnd when the AI starts spamming, the performance starts to show some cracks. It all just becomes a huge, laggy mess.\n\n[h1]Final verdict[/h1]\n\nBasically a hit-and-miss game.\n\n[b]BUY THIS FOR CO-OP[/b], if your friend has enough money to buy all the same DLCs.\n\n[b]AVOID THIS FOR SINGLEPLAYER[/b], unless you're ready to waste hours battling an AI that's 100 times better at micromanaging crap than you are. I really liked this game, but I've got enough of AI spamming bullshit.",
      "voted_up": false,
      "votes_helpful": 168
    },
    {
      "review": "this is hands down the best RTS game on the market where the devs focusing on a new form of a gameplay called conquest mode, where you take one territory after another from enemy hands, and defend the territories you have taken, every territory gives you a certain type of resources to purchase new units .BUT here is where the problem starts !!\n\nthe conquest mode has a huge potential, but devs after many years of the game release , barely scratched that surface ...the conquest mode should feel like an actual war going on, where the territories you took, you can build on them defenses and these defenses actually stay , and build a real military bases ..\n\nsecond issue, AI rushes the tech tree , this totally strips you from unlocking every unit in the game and using it , as they will become useless against their advanced tier tanks .. \n\n3rd issue, i want to see more mission variety, as every game is literally the same, defend an empty land, or take an empty land.. \n\n4 issue, i wish there is a way where we can customize the troops inventory before the battle starts, purchasing light and heavy weapons to place them inside their inventory \n\nconquest mode is the bread and butter of this game, and the DEvs need to improve it,it should feel like a real war room, instead of what it is right now, just another skirmish mode .. \n\nif you can bypass these problems, then this game is really good , but since the game devs arent fulfiling the true potential of the conquest mode, i have to give it a negetavie review",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "The game's pathfinder is awful, and the AI is easily exploitable. The amount of units the AI gets is tied to how many units the player brings in, which makes exploiting the AI way too easy.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Terrible product with so many broken little elements it just becomes a rolling ball of dung. I cannot understand how a company can neglect it's product for so many years while pumping out this many DLCs and begging for purchasing of supporter packs in the main menu. \nTactical RTS with imprecise and clunky controls, missing functionalities and lack of QoL is just a recipe for distaster. Stay away.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the amount of babysitting you have to do to your own dudes is COMICAL. a shame because the game looks and sounds great, but the AI is actually just so absurdly retarded that it makes playing the game incredibly frustrating.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There's a lot I wanted to like about this game, but in the end I had two major issues. \n\nThe first was technical, on my PC (a fairly new machine) the game crashed to desktop more than once in a couple hours when trying to load up Conquest mode. It sometimes worked, but sometimes not. Too unstable for me to justify the purchase.\n\nThe second was gameplay related; this is personal preference, but when i could load into a mission the lack of a pause button made for a miserable experience. In a game where you have to think about how to manage your troops, I believe the player is at an extreme disadvantage against an AI that can make such decisions across the whole battlefield at once. YMMV on that, but I can't recommend the game when such a simple feature would make it a lot more fun for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game would be great, were it not for the absolute most dogshit retarded AI ever in the history of RTS. If you enjoy being forced to babysit dozens of braindead units that will literally kill themselves or bend over spreading their cheeks for the enemy if left to their own devices, buy this game",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I dont know how people comparing this boring and bland gameplay and effects with MoW. Controls are clunky, explosions feels like fart. Navigation problems are not even the worst problem in this game. This game doesn't even know what 'taking cover' is which is a must in this type of game.\nThis game might be fixed later but right know in this state, I would mod MoWAS2 and stay there.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought primarily to play Conquest mode, since the idea is interesting but was poorly executed in previous games.\n\nSadly, it mostly just a neverending zerg rush by battle 3-4.... they're tripping over dead bodies, yet still rush on until I'm out of ammo basically. Not fun at all really; seems like they got neigh unlimited reinforcements pool.\n\nToo bad, I hoped GoH's vision of conquest would differ, but eh :(",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "don't list games supporting partial controller support that do not in fact work!\njust don't list it as a part of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Call to Arms: Gates of Hell: Ost Front is an interesting combination of tactical level RTS and first-person shooter set during WW2 on the East Front, 1941-45. Graphics are quite good and the game offers a wide variety of equipment from both German & Soviet arsenals. The sim/FPS shooter aspect is an engaging high point. At times, combat can convey a real feel for the chaos of battle. However, numerous design flaws, & unnecessary micromanagement spoil what could be a potentially great game. \n\nGoH possesses an incredible amount of detail and control over individual units (particularly infantry); however, these detailed features end up causing unneeded over-complexity which leads to constant micromanagement. If the game had some decent AI that allows you to give general orders to groups of units it wouldn’t be a problem; but other than some basic defensive commands for individual units, you have no help with this respect. \n\nAdditionally, there is little comprehensive feedback indicating what you’ve done once you’ve given orders. Location markers that note your troops destination only appear if you’re clicked onto a unit, and there’s nothing to affirm whether your unit is positively aiming at an enemy target. So you’re largely left trying to memorize what you’ve targeted & where you’ve sent numerous units. Pausing the game helps little, since this feature limits many of your unit’s actions. \n\nA lack of a decent battlefield overview is another major defect. The mini-map is a muddied cluster of symbols that gives inaccurate locations and a highly restricted camera narrows your overall map view down to a small segment of the battlefield. So it’s hard to get a comprehensive view of combat during battle. Frequently you’ll find yourself unable to locate enemy units at critical times when your troops are being annihilated.\n\nOn top of this, virtually all battles require some sort of needless preparation in order to complete objectives. This primarily amounts to manually supplying each infantryman with special weapons, reorganizing numerous infantry squads, hastily planting mines, or hectically sending your units to defensive locations around the map just before the enemy arrives. It’s quite time consuming and, frankly, annoying. At the very least, the game should have some sort of set up phase that allowed the player to equip & place his units on the map before the battle begins. \n\nSo in the end, you find yourself spending much more time trying to organize, equip and command your troops than attending to the enemies attacks. When you do get around to engaging the enemy, you’ll find yourself hyper-focused on small areas of the enemy’s assault while all other parts of the map are completely ignored. In larger battles, ones where many dozens of units are involved, you’ll simply be overwhelmed by everything that’s happening. \n\nSo, overall, Gates of Hell is a mixed-bag. It can be genuinely entertaining, but unfortunately far too frequently, it’s just an aggravation to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Whilst I really appreciate the artistry that goes into this game along with the detailed missions, varied and authentic factions, the clunky friendly ai is too noticeable. This game often feels like it has not been efficiently play tested. If my troops have perfect field of vision through a garrisoned building, they should be able to effectively hold their own on advancing infantry. The ballistics are inconsistent with vehicles. A Panzer III auf e should not struggle against a Stuart. Please provide an option or feature to spread infantry across multiple cover, over a wide area. Also, the AI in conquest spams artillery and machine guns. The way battles work forces you to play unrealistically. Using buildings is utterly useless unless with snipers. Improved enemy ai with more competent tactics would really help gameplay quality. However much I enjoy the game, I cannot give it a thumbs up until I see significant improvement. Vehicles are also terrible with pathfinding. And please allow infantry to vault fences/low walls?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "enemy has superior firepower in like, everything. bro how am i supposed to learn the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I RECOMMEND THIS GAME 100% .........its maybe the best game ww2 ever, certainly among rts games i believe its king. but this game has been out for a while, its bread and butter is conquest id even argue its the main appeal of the game but for some reason the devs are so hesitant to bring meaningful change to it. maybe the devs dont see the appeal or its not their flare or maybe its a pain in the arse to work on i dont know but i really want to know why we havent seen any major updates to the mode. end of the day ill gladly keep throwing money at this game because its easy to see the passion. I DO RECOMMEND THIS GAME BUT im giving it a thumbs down because its like watching that friend whos talented doin well for himself but you know he can be doing so much more",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I truly enjoy the game a lot my only problem is i cannot get the mission koenigsburg cauldron to work and no matter what i do (uninstall and reinstall, verify integrity of game files, or reach out to customer service) i have not got a single fix I wish that i could play the mission i payed for but unfortunately i guess not the same error message pops up every time. Other than that it is a really fun game and have had a great time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cant save a dynamic single player campaign whilst 'in battle'.  Given this could take several hours on a large map, this is a GAME BREAKING FAIL.  Off to bed having abandoned my first campaign only 1.5 hours in after taking 1 objective, at least another hour for the 2nd as I'm learning as I go as a new player. I'll look for a workable solution tomorrow but failing that, I'll be refunding 🤬",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love the concept of the game, but it is NOT realistic at all. Not to mention the absolutely horrid A.I. under your control. i cant tell you how many tanks and other units i've lost due to it. I wouldn't think it's that hard to make it where your units will actually look and shoot at what you tell them to. i can only play a mission or two before the A.I. puts me off enough to just get off the game. On a different note, the A.I. will absolutely spam AA and tank units, so much so that one battle will see the armor casualties reach what a whole war front took. This time period was all about infantry and artillery with the occasional tank- not 5 tanks being supported by an AA spam and like 2 infantry squads.\n\nAlso, GIVE US BACK THE ABILITY TO CHOOSE WHICH UNITS ARE ALLOWED. Why are you degrading the game and taking features away? All my complaints would disappear if i could take AA units out.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Everyone compares this to the Men of War series and for good reason, it is a direct clone (like trust me, if you have played them, even the objective complete music is the same lol). It has some really wicked aspects and fun mechanics but PAINFUL ones that just ruin the experience. And the AI is what everyone says.. its sh!t, you have to baby sit everything which is impossible. And the difficulty settings are frankly f#cked. If you play on a lower setting just to have a casual game, the defensive missions will literally just make you sit there for an hour with maybe 5 tiny waves of enemies its unbearably boring. Do not buy this game for more than loose change, I haven't even been able to finish 1 of the 2 campaigns because it is just agonising to slog through",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PC crashed when i was saving now if I even click load/save/continue it will crash the game ive done everything im going to leave this review here until some dev or someone can help but for now I cant even play the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not entertaining it's not on sale at the time of this review id say you shouldn't buy it. Oh and people are not overblowing the AI issues its really that bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game iself is playable and enjoyable.But there are many oh many minuses. Lets start with pathfinding, You must get to object Z from K, sure thing i will just use the most stupid and dangerous way to do it. Why drive though a wooden fence when i can drive around whole village? Only direct control save this from absolutely horrendous losses. In addition if you tow your vehicles and think they would que on the roads/paths in order to get where they need to get you would be assuming wrong, 99% of time they ram in towed stuff and outright destroy it, making defense/ attack harder or outright supidly impossible. Oh and that 1% is when tow vehicles just lose their towed equipment on the way. Your units see enemy charging, they will open fire and demolish them right? Wrong, They will let them get right in grenade range/or ignore them and get f-d themselves. Only thing that saves this are autocannons, cause they will attack ANYTHING and i mean anything. 2cm autocannon will attack KV-1, Tiger etc. even though it cant even scratch chrome off of them. Please fix at least pathfinding. Then i would be happy and wouldnt have to restart my campaign two to three times because pathfinding issue destroyed my AA or ground AT weapons.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand why this has such good reviews when one of the most very obvious features is missing. No ability to download mods on the fly. Like every multiplayer lobby has mods, and you have to go an manually search for each and every one of them, then restart the game, and then go into the options and enabled them after that, which caused my game to freeze up thus requiring yet another restart, and this is all just to join 1 match. The game is decent, but mod support is AWFUL.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont like this game. The UI is pretty bad and you troops need to much micromanaging so playing third person is not   something you do a lot. The tutorial is awful and extremely slow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "35 dollars to babysit every troop on the field one by one as the enemy AI advances simultaneously across the board with ease, oh and then the upside down tanks that spawn in late game making you waste your combat points.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the worst AI possibly ever made in a video game. pong is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes on start up constantly. You have to keep deleting the shader cache in order to play past the main menu.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Garbage to play in coop ,mods desynchronized even when its loaded in the same order like WTF...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well I love CTA, but my negative review comes for the common wealth DLC. I was super excited to see the British being added. Buuuuuut reading reviews for the DLC, most of the common wealth research lines are locked unless you own another older DLC..... I do not want to buy a DLC just to buy the actual DLC I want to play that makes zero sense to me as a consumer. So my review is gonna be a negative.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unfortunately, it's a very unintuitive game. What a waste of 10 euros.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I hate this fuck ass game its so bad never play this ever DONT EVER PLAY THIS FUCK ASS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it only looks better than MoWAS2 plays horrible comparatively the AI will have your units constantly walking backwards towards their targets",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Performance optimization is abysmal. I have a 7800 and a 5080 along with 128gb of RAM and have installed this on 2 different M.2 Gen 4 SSD's. 1v1 Skirmish turns into a damn powerpoint presentation when my PC should be able to easily handle this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Totally unenjoyable single player. Easy difficulty is a joke, normal is impossibly annoying to win. What a mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's fun but sadly the game isn't very well balanced. Germany is objectively speaking the best faction in the game in PvP with some of the other factions not even having an S tier option in doctrine picks while Germany has multiple. \r\nIt's not that they need to be nerfed, it's just that other factions need the real things that they had in history to cover their weaknesses. America for example has infantry that are all insanely expensive, so they can't get on the field very well, but a simple fix would be to discount the cost of MPs or whatever filler squad you wanted. \r\n\r\nBut nope, instead some factions are effectively crippled for no real reason sadly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unintuitive/clunky mouse-interface combined with unfinished game play make this game unplayable and a waste of money. This is one of those games that show \"all mission objectives complete\", but the mission never ends - leaving you wandering around an empty battlefield trying to find out what you missed but everything is completed...bugs in the \"are objectives complete?\" check, make the game unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If u want to play men of war assault squad 2 with good graphics and visual effects, this one's for you. However, playing singleplayer or conquest makes you feel like babysitting babies with guns. Ai can be just plainly stupid. For example, when I order a tank to go somewhere, it will sometimes just destroy a ammo truck in the way; tanks sometimes refuse to aim automatically when attacked by the enemy AT. There are instances where you become frustrated with how braindead Ai can be. \n\nAlso conquest lacks replayability. Each enemy faction just functions the same way. The only variety you'll get is how units look. \n\nHonestly, instead of introducing new factions, they should rework the ai or enhance conquest experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game overall but get ready for the ai to shoot you through the smallest crack",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really didn't like the interface and controls. It just wasn't fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Super clunky, only worth when 75% discount.\r\nRepeated frustrations with getting your units do do something.\r\nOrder a tank to take out the major armour threat? It'll refuse to move into position, instead opting to shoot infantry. (You'd have to micro the shit out of it for it do what you want.)\r\nI've had my own infantry ignoring the key bind to go prone.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You will lose tanks in MP because the dumb ai will turn the Tank when you are not looking, which the enemy will take advantage of and move in for the kill, since side armor is weaker than front armor. \n\n\nBarbedwire Studios, Digitalmindsoft you added a option for tanks to only move backwards to prevent this issue when moveing can you do it again but for when the tank is not moveing?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the ai is beyond retarded but everything else is cool",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No gore. Bad voice acting. Ui from hell. Why canot do someone a actually good company of hero's",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is nothing intuitive about this game. absolutely do not like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WAITING FOR SERVER\r\nEXPERIENCING PREFORMANCE DROP\r\nWAITING FOR SERVER\r\nEXPERIENCING PREFORMANCE DROP\r\nWAITING FOR SERVER\r\nEXPERIENCING PREFORMANCE DROP\r\n\r\nYeah, what the F*CK EVER MAN! How about you worthless developer f*cks tear the whole game down and rebuild it in an engine that's not over TWENTY(!!!) years old?!! My friend and I had to repeat the same Downfall level SIX TIMES because the engine kept chocking on c*ck and disconnected me every single time!\r\n\r\nAbsurdly ridiculous how you people managed to keep the same circle jerk for TEN years with such performance issues! Your game is practically Men of War/Faces of War with lots of makeup on and that's pretty much it!\r\n\r\nI can swallow the fact that the graphics are outdated and, more importantly, that the AI is either broken or down right stupid... but these performance issues are a complete deal-breaker for me. Happened once or twice? No sweat. Happens continuously? No thanks.\r\n\r\nAlso crazy how you're crapping out new DLCs, but sh*t like this is either simply overlooked or, better yet, a given for anyone trying to play the game.\r\n\r\nUninstalled and not playing until you get your heads out of your as*es and do something about it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "so Great and cool Game with Potato server system",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "everything fun is dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "truly the resource desynchronisation detected of all time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Alt f4 does not instant close the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Im gonna haunt the Clown Motel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fix the controls make ai not stupid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "have fun reloading",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 playable factions without dlc???????????????????????????????????????????????? insane",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wont load",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}