{
  "positive": [
    {
      "review": "So I really enjoy this game, the atmosphere is well done, graphics are really good, and the proximity chat is superb.  \n\nThe only things I could really Critique and say needs work are the animations and reset/break dividing segments as you type.  The small break as your clock is reset seems just a little too long, and the animation that trigger when you mess up and have the roulette sequence begin seems like a waste of time.  Maybe instead of an un-skippable cut scene in the middle of typing your vision goes blurry from the stress of having the gun pointed at you instead and a small head bob like you're trying to avoid being hit, making it a little more difficult to type but doesn't take away the ability to all together.\n\nthe only other thing I would like to see that's not in the demo, is at the end of each round being able to compare your WPM to the winners WPM and being able to compare how much better or worse you were from first place. Not something that would make or break the game but would be a nice little feature.  played a couple games with a someone who had to be typing at somewhere around 180 WPM because this guy was absolutley flying through the game.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "love it, but yet needs a greater amount of text to type. very repetitive at the moment.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "You won't question your typing skills until you seat yourself at this typewriter.\nNot a single quick type event or typing derby will compare to this.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "its fun but i feel like the unskippable roulette animation just makes it more frustrating than it adds to the tension. in most games if you get 1-2 roulettes you're pretty much just done for. I feel like it wouldn't be so much of a problem if everyone in the lobby didn't get shot as soon as someone wins..maybe have the winner be able to escape alive,,but add a timer to where everyone will die if they don't finish in time after someone wins..idk\n\nalso a basic matchmaking system that groups players based off their wpm would be nice,,some games feel like they go way too quickly when someone is clearly far better than the rest of the lobby\n\nall and all,,its a really fun battle royale game,,but it could use some tweaks to encourage finishing in time instead of just exiting to the main menu when you have a bad chance at winning. give it a try though for sure\n\n\nalso,,,a whole segment with a harry potter quote,,,ew..it was an interesting typing challenge if there wasn't one thats exactly like it and without quoting anything from jk rowling",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "such a fun game, my brothers and i found it randomly and couldn't seem to get off. Very addicting, we said \"one more round\" probably 10 times. Simple and very well done.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love these kind of games.   I can't wait for it to release sooooooo I can race against my friends, haha. I love making bets (raises eyebrows). They might carry me in a shooting game, but this is a game where I can shine, haha.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love it, something I'm actually really good at! I can't wait for the full version to come out. A leaderboard will be really cool to see.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's interesting but i'd only buy it if i know i can play with players that speak my own language because i can't be as fast as i am if i have to write english. my keyboards keys are sorted differently. so i'd hope there will be language specific server options.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game so far, not sure how they will add any depth to it, but as a small game for learning typing, having a cool atmosphere and feeling the pressure to develop fast, this game is great. (Only done demo so far).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I looove this game on an abnormal level lmao. It's very out of the box & different. Never would've thought a ''Battle Royale typing game'', would've been on any of my wishlists. \n    I also enjoyed the fact there is proximity chat to hear other players while ''fighting for your life with each word''. Lobbies are pretty quiet now, but this will definitely get toxic in the future LOL (excited). Can't wait for more prompts. \n    Things to possibly add; \n  A PRACTICE/OFFLINE MODE!! Would be beneficial as a ''warm up'' before you have to fear for your life during games lol. \n      A DIFFICULTY MODE- this could involve more advanced prompts, or less advanced. If at a certain point of reaching a level the lower levels could be locked? They could have their own separate stats + combined depending on how many modes to make an overall profile stat. I know this is in the works!  Not sure how something like that could be worked out on, but would be nice if some people wanted more of a challenge (: (some prompts even have some nice laughs along with it!)\n        Overall; GREAT GAME! Never thought i'd be stressing over my next letter.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know why this game is so addicting but I just want to keep typing and typing. Don't see where the full game can go from the demo though, will have to wait and see.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AWSOME GAME. \njoin a game someone spams the mic with breathing , sound was funny I missed up , I die , 10/10 \n\nit's also helped my touch typing speed . will by at release",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The concept is fantastic. It's simple but it works and is a lot of fun. Unfortunately, like every other online game, people will ruin it and I've already seen a fair amount of cheating. I'm really concerned how rampant that will be once this gets a full release. For this game/concept especially it'd only take a small percentage of cheaters to completely ruin the game for everyone else.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, very fun and unique game. Saw it on a video and fell in love. Learning curve is easy and can be also used to improve your KPM (keys per minute). Awesome experience and would, for sure, play it again multiple times and would buy a final release. \n\nHere's a general review:\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☑ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing typing game. The atmosphere really adds a layer of intensity to make the typing more challenging as you try to navigate your anxiety, being watched by a masked, trenchcoated gentleman, ready to pull the trigger in a game of Russian Roulette. Good typing practice too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, but needs work with balancing. I type all day at work and I still do not hold a candle to \"Fat Beef\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked this. I'm not a big fan of Battle Royal type games (in part because I suck at them), but this was fairly enjoyable to play. The one thing I can see about this game getting old is the replay value. Typing over and over again with nothing to change the round, I can see getting bored real quick. One way I can see to prevent that is adding a shop where, after a round, you can use points from that round to buy tools to help in the next game, like adding a device that writes for you, giving a boost to your writing, or you can pay the guards looking over you to distract the lead typist for a moment to help you catch up. Something that keeps the main gameplay loop but adds some spice to keep it from getting old quickly.\nBut I'm really looking forward to the main game coming out. I see a lot of good coming out of this game, and it's a refreshing take on the battle royale genre. Keep up the great work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first thought with this game is that it was just a typing game that would get boring quickly.... Well I was wrong. I feel on the edge of my feet every round and the text has still come up at different text most of the time. I would reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: This game is startlingly good. I'm looking forward to full release!\n\nI was introduced to this as a fun twist on the typical \"Typing Simulator\" game. Something that would be different from  the classic, railroaded -Type-Well-To-Shoot-Stuff- style you would find in \"The Typing of the Dead\", or similar titles. \n\nOh boy, what a fun and refreshing twist this is. This isn't some heroic battle, typing to defend humanity from an undead evil or alien onslaught. Oh no. Not this game. \n\nNo, in this game you are not a hero with a gun busting down doors to save dramatic damsels. \n\nYou are a worker sitting at a typerwriter who's only job is to type well enough not to die.\n\nThat means typing better than your neighbor. That means typing faster than you thought you were capable of, under pressure that -of course- isn't actually present but is no less perceived despite it's non-existence. \n\nThe soundscape the game drops you into is droning, eerie, with an inexpressible chill that makes each tactile press of keys bouncing around the dark chamber echo in some primal, afraid part of the mind. It's incredible. \n\nI found myself not just competing with my fellows in the typing chamber, but waging all out war on my own average and personal bests to see them improve. \n\nI won't spoil all of the best bits ;) go give it a go while it's a demo. \n\nYou won't regret it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games you can play is an educational one, and it also improves your typing speed — but only if you already know the basics of ten-finger typing. Otherwise, this game will do nothing but make you frustrated\nI’m waiting for the full version of this game — it’s really amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Caught a small bug where I hosted and the game started for everyone but I couldn't see the text to type - only the bar\n\nBut that only happened once.\nI enjoy this and its only the dang demo\n\nCan we have customization on the table and or the character when the full game is out?\nThis is such a great idea",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i used to challenge my classmates to rounds of nitro type (which they subsequently started declining as i had a wpm of 80 at 11) and now i can finally relive my love of competitive typing as an adult\n\nbut instead of english it's gibberish. and latin.  \n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself and the concept are fun. You can communicate with others using your voice or just distruct them.\nIt's great when you hear people are finished their lines and NPCs reloading their revolvers and trying to kill players. It's a bit stressful. The game also has great graphics and pleasant sound.\nIt's also funny when you are type a line and the more write, the higher the cost of making a mistake.\nAtmosphere in this game is great. I think this game is the best practice for typing.\n\nI must not tell lies.\nI must not tell lies.\nI must not tell lies.\nI must not tell lies.\nI must not tell lies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun, my main gripe is the animation that plays when you type something incorrectly, as it fully takes away your ability to type. In such a game most people, not wanting to waste any time, will attempt to type the sentence immediately after messing up in an attempt to keep themselves in their groove. However, with an animation such as that, none of your inputs are accepted thus making you \"mess up\" again because while you were halfway through the sentence, the game only just NOW started to accept your inputs once more. It forces you to sit and wait every time you mess up instead of immediately trying again, which makes keeping yourself zoned in rather hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun game, i thought it was all serious but what caught me off guard is that in one of the games i played the script i had to write was all full of brain rot with typos needless to say i died after the first check point. xD\n\n[h1] Overall 10/10 [/h1]\n\n[list]\n    [*]Fun Action Typing Game\n    [*]Coercion\n    [*]1945 Vibes\n[/list]\n\n[h2] Absolute Gameplay! [/h2]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anxiety-inducing and white-knuckling keys with bated breath. Brings me back of the good ol' days of learning to type. A must-have for all classes with the reliance on auto-fill/auto-correct, yet we can't, I know. Love it and looking forward to the Final Release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome demo, Final Sentence seems to be setting up to be THE ultimate, competitive, high-stakes typing experience. Definitely needs a little smoothing out around the edges but the bones here are good. \n\nThe atmosphere is dark, dystopian, and immersive. The challenge presented can fluctuate a lot even if you're a good typist; sometimes the prompts are simple, sometimes they're rather complex and finger-twisty. \n\nRecommendations:\n\nLeaderboard: Promotes competition and game longevity. On a further note, there should be an in-depth stats screen after each game that shows how other players did in that round as well as yourself.\n\nSpectator Mode: The idea of a spectator mode would be way more engaging and interesting if you could either walk around the room (as an invisible entity (or not)) for the remainder of the match or switch to the perspective of the remaining players to actually see how they are typing.\n\nGame Modes: I saw another user suggest alternate game modes such as last-man-standing or team-based and that is an amazing idea. Just anything else that users can play to shake things up after playing a lot of the 'main' game mode.\n\nCustomization(?): Seeing as how we can level up I'm assuming we will be unlocking things as we win or play. It would be cool if you could alter how your character looks, possibly your type writer, or your player card. Obviously you would earn these things by winning matches, achieving certain high scores for WPM or accuracy, etc.\n\nMultiplayer: It would be nice if you could load into a public match with a friend or two instead of having to play an entirely private match in order to play with friends.\n\nPrompts: The game should definitely have more prompts. There IS good variety in what is here so far but it can be disappointing to load into several 'De Beers' matches in a row. More passages from literature, other media, and more custom prompts would greatly enhance replayability. \n\nAnyways, this is an amazing game with a very unique concept; and it's executed very well. Can't wait to see what the full release has in store.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is epic! Probabily one of the intense games I've ever played. Also I'm so fast at typing so this is right up my alley.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty interesting game. Battle Royal on a typewriter against other players and you can't make mistakes or you play Russian roulette with a revolver.  Honestly one of those games you can sit drink a beer talk with friends in Discord . It gets pretty funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played in final sentence demo, so here my review\n\nthe main idea of this game is really good: your total consentrate on typing process really feels very nervious, then you make a mistake my heart skipped a beat. sound design also on high point, hearing how someone nearby you completing round per round and you forget how to type a question mark is sound hilarious, but it gave me cold chill.\n\nBut that`s all\n\nno replayability, no music, no debuffs or hard mode, you can't play it for too long, it`s just become boring.\nIn my utopia world I see this game like good competitor of buckshot roulette: good intense music, items to distruct your oponent and gunholder man, pvp, death run with \"no mistake\" mode and so much more\n\nthis demo has good potential to become something much bigger and better, but for now 5.5 symbols per second/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love typing, and want to beat other people at it: This is the game for you. \n\nNeat concept for a BR style game, just wish there was some customization for your typewriter and maybe some cosmetics. Otherwise it's straight-forward and simple to play.\n\nCan't wait for release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is unintentionally the funniest game I have ever played. The proximity chat addition is fantastic, and my heart is thumping from a typing simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A message to the developers: don't listen to the complaining players, don't change your game.\nIt's fun, simple, and effective. I'll buy it as is, hoping it doesn't change.\nA game that's been \"rebalanced\" several times isn't as fun as the original version.\nA perfect game is a game with both strengths and weaknesses.\nThanks !\n\nFor the players : if you lose, first have fun and just try to be better\nplay with friends and it's better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In summary: Fun and very tense at all times. Success feels earned and defeat feels fair. \n\nThe game builds a tense atmosphere in multiple ways - you're competing with many others to be the last one standing, but you can also be eliminated at any time if you make too many mistakes. The aesthetic and atmosphere, visual and sound, are very well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly great game concept. A Battle Royale typing game. Genius and surprisingly very fun. I hope the developers add more to the game and hope the community can keep it alive with support.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stress simulator might be a better term than BR. an that's fine. The atmosphere is great and polished, it doesnt feel at all like those games where someone installed some unreal assets and turned the lighting down. This game has a ton of potential. All that is lacking is interaction and gameplay mechanics between players needs to be increased maybe. It's more of a racing game than BR right now but it really works well at that core, which is something that they can obviously build on in huge ways. This was a breath of fresh air, being shot in the face because of my butterfingers. Strongly Recommend people try this out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☑ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☑ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☑ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In a long time not a single game has had me trembling and sweating, but when i saw i was first and i had 1 sentence to win i was about to faint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☑ Potato\n☐ Decent\n☐Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☑ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story - (that i know of yet, but this is just a demo so maybe when it releases)\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐To infinity and beyond\n\n---{ Price }---\n☑ It's free! ( The demo is free so play it). \n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun. I've played a few small hundred matches, won quite a few. and generally enjoy testing my typing skills when bored.\nWhat isn't fun is Time.\nRestaurats. It's always restaurats. I get it, its a funny thing to promote the Restaurats game. I didn't know about Restaurats until I saw a trailer and thought \"They, isnt that a prompt in Final Sentence?\"\nBUT NOW. ITS EVERY SINGLE PROMPT I PLAY.\nIt's a fun way to promote another game, and it's a good prompt to keep up just because. But! Making it so common that it's just annoying man. Every other match is restaurats. Its nothing else, there are like 50 different prompts to keep things spiced up, and you waste it on endless promotion for a game that so many are going to buy anyways. WE LOVE COOP FRIEND GAMES. Don't ruin your typing game just for promoting another game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great concept, especially as a typing sim trainer.\n\nbattle royale? no, (where is my ability to camp-out till the last second for a zero word typed win?) (satire)\nspeed typing simulator? sure, in its current state i guess.\nfor dyslexic people? No. \nfor people who can type without looking at the keyboard read and able to comprehend all the deliberate grammatical errors while forcing themselves to NOT spell correctly.... its a nightmare i swear......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it's perfect, but if there was a bit more motivation and maybe a few more game modes, it would be even more fun than it already is. I'd appreciate it if some of the things I mention got added to the game. There are also a few other things I'd love to see added:\n\n1. Playable Guards Mode\nExplanation: It’s as simple as it gets. Instead of everyone being players, every typist is a bot and every guard would be a real player. When bots make mistakes, you shoot them — gives both sides a purpose and intensity.\n\n2. Realistic Avatars\nExplanation: An update that adds more lifelike and customizable characters. It makes the game more immersive and motivational to play when you can represent yourself in different ways.\n\n3. Progression & Rewards System\nExplanation: Add XP, levels, and unlockable cosmetics or effects. Something to keep players grinding and feeling rewarded for improving their typing skills and accuracy.\n\n4. Typing Challenges / Endless Mode\nExplanation: An endless typing mode with escalating difficulty or unique challenges (like typing under pressure, limited vision, or timed sprints) would make replayability way higher.\n\n5. Online Leaderboards\nExplanation: Competitive leaderboards for speed, accuracy, and kill count (for guards). Adds competition and motivation for players to come back and climb ranks.\n\n6. Co-op or Team Mode\nExplanation: Let players team up as groups of guards or typists. Imagine working together to survive or defend against waves — it’d be chaotic in the best way.\n\n7. Voice Lines / Reactions System\nExplanation: Guards or players could have voice lines or sound cues when performing well, getting kills, or messing up. Would make it feel more alive and immersive.\n\n8. Environmental Variety\nExplanation: Different map settings (office, prison, digital world, futuristic arena) so it doesn’t feel repetitive. A little change in scenery adds tons of atmosphere.\n\n9. Training / Practice Room\nExplanation: A calm mode for players to practice typing without pressure. Could show detailed stats or graphs of progress over time.\n\n10. Custom Game Settings\nExplanation: Let players tweak bot behavior, typing difficulty, damage, or visual effects. Great for content creators or those who wanna mess around with friends.\n\n11. Achievements / Challenges List\nExplanation: Give us things to chase — like “type 1000 words flawlessly” or “win 10 rounds as guard without missing a shot.” That sense of accomplishment keeps people hooked.\n\n12. Better Sound & Visual Feedback\nExplanation: Make typing and shooting feel more satisfying — better sound effects, camera shakes, particle effects, maybe even a slow-mo effect when you hit something clutch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun idea, but feels more like a game jam project than an actual game; I think it's more or less put its entire thesis in the demo. Still, if the developers have a plan for how to iterate upon the core concept and make it deeper, I'd be interested to see it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun premise, I am waiting to see where it goes. One small complaint is the limited resolutions if playing in windowed mode. Made it really hard to see what the heck was on the screen a few times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a promising idea but the matchmaking is currently too primitive. \n\nI consider myself a better-than-average typist — not exceptional! just better than average! — so of course I was curious to see how I measured up. I figured I'd probably win the first few rounds against random kids, until the game got a handle on my skill level and started matching me with my peers. \n\nWell, I just played for nearly an hour, 17 matches in a row, leveling up to level 54... and at the end of all that I was *still* winning every single match by a large margin. This does nothing for my ego! It just makes me feel bad because I'm ruining game after game for people who should never have been matched with me. They deserve competitive play and so do I! I'm sure that there are plenty of other people playing this game who are faster than me, but it seems to be making no effort to match me with them. What's the fun in that, for anyone?\n\nAlso, as a prig I must say: the whole totalitarian torture thing is in poor taste, and using \"Saigon Execution\" as the key art shows that they know exactly what they're doing and are unrepentant. Dudes, watch the news and grow up. You wanna see something *really* scary? We live in a world where people blithely make stuff like this just to amuse (and desensitize) callow teenagers.\n\nGiving a thumbs up all the same because this is just a demo and hope springs eternal: maybe it will improve? Like I said, there's a promising idea here, and I was having fun before I realized how meaningless my victories were. I still want to know how I *really* rank...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Demo was fun for 30min. Hope the full release has way more content.\nI think there needs to be some sort of catch up mechanic for slow typer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GENIUS IDEA!!!! I LOVED it! Great competition but when you loose you don't feel......angry lol. Honestly, if you're cheating I feel horrible for you. This is a really fun game with good fun like competition but I'm sure there are f*t sweats out there taking it very seriously. I hate PVP games BUT this one was an absolute BLAST (especially when you get people with microphones)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was awesome!! Played through the demo missions in a flash, and got 3 wins and up to level 12. Can't wait for the full release!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good vibe, making me so stressful when typing in game, I think as expected by the game devs. Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atmosphere is great, and for anyone who enjoys typing it's even better. Excited for release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really cool atmosphere, exceptional sound design, fun format. quite addictive \n\nbad: ~99.9% sure they pad each round with like 50-75% bots to both insulate your ego and make you want to re-queue right away \n\nI get why they do it, but hope they invent a better fix for both of those problems. still love the game though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As much as I enjoy playing this game, there are some key points that really need to be improved.\n\nThe MOST important one is the text. I often make mistakes between dot and comma, like they are so small and cannot be seen and making a mistake takes you all the way back. The text isn't very clear which discourages playing when I mistake a letter for another such as i and l. It would be nice if we had an option to switch test color and/or font as an example. Not to mention this game favors accuracy way too much compared to WPM which isn't realistic to me as i type pretty fast and still do end up making mistakes, one letter as a mistake doesn't usually destroy so much progress but overall it is a great concept and i will most likely buy during release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game had me typing like my life depended on it. It’s such a simple yet brilliant idea — a typing roulette that somehow makes you both laugh and panic at the same time. I was literally fighting for my life typing in this game 💀💀",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i bever won beqause offf tyking it bwong.\n\nPS. it is a funny idea in a game lol. I am already very glad that i finish Top 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really good. My only complaint as a low end PC user, is that if the game randomly freezes, or i got into a second game, it would crash immediately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seriously decent game here, useful, but also fun, and the battle royale aspect actually brings the tension. It's great. I've only played the demo, but public voice chat is.....a choice. I can see it definitely being used as a psychology tactic to put people off, but overall I just ended up muting it, too many jokes flying around that were not okay, but that's not on the devs. (but worth thinking about). Only thing that crippled me (as a semi-professional typist) was the inability to adjust the spellings for my region of the world. I speak and type English, but do not use American spellings, which mean those Z's in words, and the lack of U's in words like colour and armour frustrated me. While I understand you're meant to spell whats on the screen, not the words (the tomato/cucumber script argh!) I felt it actually disadvantaged me compared to someone who could fly through. Maybe another language or another localisation for UK spellings as a huge chunk of the world does actually use those spellings. Overall though, a lot of fun, something I will be coming back to for a few minutes regularly, and hopefully when the game comes out for real I'll grab it for some fun with mates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game excited to see what's to come. Highly recommend the demo just to get a sample.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is overall a really good game, I've always been a fan of typing, even if it's just for fun. Here are some thing I would like to see in future updates/the full game (as I'm sure many others would too.)\n-Customizing your desk space/customization of your character you play. I think this would help others players who are playing together on a VC can better find one another, considering that some of the numbers that are on the desks we can't see from certain angles. \n-Turning your head all the way around or walking around once you die would be very cool. I'm not a fan of sticking in the one spot when I die. If the friend I'm playing is on the other side of the room, I end up going on my phone and waiting until the game is over with to start the next game.\n-AUTO READY UP! I would love to get put into a game once I am ready to start the next game. I'd rather not go into the main menu and press two buttons just to start up a new game.\n-Private matches.\n-Opponent matching. Some of the prompts are very repetitious, or just a bunch of random words that don't make sense. (Which I understand is part of the game to make it a little more difficult). If we could get paired or put into lobbies with other opponents that have the same WPM, I think that would be a little more fun. Sometimes the match is over in 30 seconds because someone is either really fast at typing, or they're using a cheat.\n-CHEATS! Please devs! There was someone I played with that had 500 WPM on their account. Makes no sense!\n\nSorry, it wasn't much of a review..haha. But I absolutely love the idea of this game, the graphics, the design AND THE SOUND EFFECTS! Very nice! Keep up the good word, devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play with friends who are willing to say out-of-pocket things on the mic. If you do, it's one of the most hilarious and enjoyable experiences. Great for up to 40 people in a group!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The pace of this game is too intense, and it's less playable since every time if you don't get the first place, you will die, resulting in loss of interest. But I like the background settings. It will be really fun for someone good at typing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's actually fun to play! I lack the ability to write without looking so it gets pretty intense for me haha. Since I'm bilingual I can tell you that for spanish I found some accent mistakes in game, but nothing that can't be fixed later on. (It's <cronómetro>, not <crónometro>.) Unless.. it was intentional heheh\n\nFor the future, would be nice to be paired with people that meet your speed and/or level. For the moment, solid game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so so fun.\nplaying this on stream with twitch viewers is great. can't wait for the full drop!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it is good for a demo but there is definitely work to be done. There for sure needs to be something to match with players at your skill level. Also I think the levels is a bit awkward? It just moves up a bit too fast. I feel like it should take a game or two to go up one instead of moving up five every game, but maybe that's just me being nitpicky. i also think the break in typing is annoying because it makes it feel difficult to catch up with people who are ahead of you but again that's probably just me being nitpicky. Overall, I think it is a good game and I will most likely be getting the full game release, it is just a bit frustrating right now <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun idea for a typing game. it was fun hearing the proximity chat of all the different people in the room and their reactions. Loved that. I agree there should be \"groupings\" of how fast people type because its unfair for slower typers vs faster typers. I myself averaged 98 WPM (with mistakes) and was able to easily beat several rounds. Kind of a \"feels bad\" for the slower ones, i wish they had their own challenge group :( so i dont feel like im massacring them just cause i wanna go fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, practicing my English typing speed. However, my game crashes when I start round 2. Is it because that my laptop is old?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting concept, but it kinda sucks if you have an azerty keyboard, trying to type everything as a qwerty keyboard lol, especially the symbols.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I HATE THIS GAME for some reason i cannot bring myself to stop playing it, I'm sitting at 18.4 hours now, even got all my friends hooked. Please somebody save me from the purgatory that is Final Sentence...\n\nin all realness, i can't wait for the full game to come out so i can play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's awesome. Couldn't recommend it more. You can feel the intensity. The devs did an excellent job turning simple typewriting into something you can feel your life depends on it - the sounds in this game really do the job marvellously. I don't think I've ever heard gunshots in the game as intense as ones in this game. I've enjoyed this game to the point that once I've reached past level 10 I didn't want to play again, just to make sure I don't lose, lmao. I think it's gonna be a great party game and one that you can enjoy solo. Also, hats off to whomever has selected the texts for the typists - my millenial soul has loved the old memes throwback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is pretty cool. just typing really. not my TYPE of game. i wish you could be one of the guys to shoot people that would be kinda cool i guess.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game!!! well not really a game lol. finally i don't have to practice typing on a boring browser coz with this i feel like i have to be better every time :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was amazing fun! I didn’t realize how much time had passed while I was playing the demo. I will definitely be picking up the release version when it becomes available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really regretting not using those keyboard covers in computer class rn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am huge fan of typing and I really like the concept, but the only thing that's currently holding me back in the demo is the latency of the servers. Having to type out everything only to see the characters on the screen lagging behind is causing me to keep breaking my rhythm. There's still balancing issues, but overall I still enjoy the Battle Royale given that it is a demo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was getting shouted at by some random russian dude while writing animal sounds in order not to die.\n\n10/10\nreminds me of my childhood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing concept, simple effective and intense. Incredible FEEL and atmosphere. Play with some mates or queue up with randoms. 10/10 would type again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's more fun that you'd think. If you've got an hour to kill, this isn't a bad way to spend it. That said, I feel that I am getting shot on the first bullet a little too often, but maybe that's the joy of Russian Roulette.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As far as the demo goes, I think it's good, I'm just not sure how progression is going to work in order to keep me invested long term. I won about half the rounds I attempted, but considering the type of game it is, im not sure what you can add to keep people invested.\n\nSome of the things you have to type are kind of annoying too, had instances where words weren't spelled right to begin with.\n\nOverall its a fun way to flex your typing, but if you can manage to win a few rounds, there isn't much to look forward to at least from the perspective of playing the demo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, I didn't realize how much I backspace when I type",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like it and there is a lot of promise, but please take out the binary one. It got boring quickly and I had it twice in a row.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hope Arabic will be added because there is a large Arab audience. I would be very happy if Arabic were included so we can enjoy it even more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me typing like a mad man at 90+ WPM with no errors... and some Baba Yaga finishes before me.\n\nI've never known such fear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐⭐⭐⭐⭐\n\nFinal Sentence is sooooo good!! 😍\n\nIt totally flipped what I expect from a battle royale: instead of shooting, I’m typing under pressure, every mistake feels real. The atmosphere of a typewriter, the revolver at your head, the tension… it’s AMAZINGG. I found myself amped each round, trying to stay calm and precise while others dropped out. If you’re into competitive, weirdly thrilling multiplayer experiences and you’re confident with your keyboard skills  this is absolutely worth a go!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was very interesting\n\nI want it to be playable on Mac OS too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stickybear typing meets a six round revolver\n\nand it fuqs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is fun, work on my typeing speed for my life, it's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely frustrating but funny.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very bad game, and I do not recommend. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it ! it challenging me for more aware with not typing wrong XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atmosphere is great, and for anyone who enjoys typing it's even better. Excited for release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just shit up and take my money when fully realease the game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "octopuses have three hearts and blue blood",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lost the roulette, won a new fear of keyboards. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Лучшая игра для лечение опечаток :D\nА так весьма простая",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Octopuses have three hearts and blue blood.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "challenging and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Added to wish list, could see myself really getting hooked on the ranked mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak ragebait for myself, but i keep playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "COOL\nBut the game needs more gameplay modes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantasic lan party game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "typeracer with good graphic.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Needs a lot of work to balance the game to make it fun for the average person. Anyone who types or uses a computer professionally or frequently has a huge advantage over everyone else and 1 or 2 people usually have a huge lead. It just seems to always end way too quickly for most people to enjoy it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it's type racer but with reddit(derogatory) sentences, sometimes weak horror or with some writing quirk, and opponents who are generally worse at typing. there's two big things that distinguish it from type racer; you have to restart a sentence if you make a mistake, and when you make 3 mistakes you are given a time penalty that also has a chance of ending your run, flavored as russian roulette. there are breakpoints every handful of sentences where you have to wait before typing the next sentence, but as everyone has to wait the same amount of time as far as i can tell, it just serves as a break from typing that i personally didn't find any value in. i'd just prefer typeracer.com, i dont see what this adds to the typing genre more than an uninspired squid game-esque horror atmosphere that lacks depth.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "the texts are incredibly annoying. Typing the same sentence over and over again, random gibberish or texts without spaces is just added difficulty for no reason.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Why can't there be just... normal sentences to type?\n\nEvery game has repetitive things like:\n\nqwe qwe qwe qwe qwe tre trw trq\nasd asd asd asd asd asf adf \n\nStuff like this isn't fun to type.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A Fantastic idea for a game being destroyed by it's execution.\n\n9/10 rounds is just writing gibberish sentences or words, which is not something I am here to test or practice. I'd rather get good at writing actual sentences.\n\nI hope someone the devs either take this idea and improves it or someone else takes it's concept and makes a better game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was so excited for this when I read the concept, and was so disappointed when I actually tried it.\n\n\"Final Sentence is a Battle Royale typing game.\" It's not a battle royale, it's a basic typing speed test against other players, an identical experience to something like typeracer.com. \n\nThe horror atmosphere feels great, but you don't get to actually interact with the game world since it's just a typing test. Nothing was done to innovate on this very, very basic gameplay premise. Games like The Textorcist, Blood Typers, or even the classic Typing of the Dead are some great examples of how you can interpret typing as gameplay in creative ways. \n\nThis game, on the other hand, is doing the bare minimum. You could make this same game in 500 different settings. You can make people do a typing test on a beach. Typing test on a volcano. Typing test on a skyscraper. It's still just a basic typing test if you're not actually adding gameplay elements that go beyond individually testing a bunch of people's wpm. It feels like a wasted concept.\n\nIt's like baking the most bland cake imaginable and then slathering it with a special icing that's currently on trend (horror gaming) and then everyone going WOW THIS CAKE IS PEAK! \n\nis it? is it peak? or do you just like eating icing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely no balanced matchmaking of any kind, always somebody done in 1:30 more than 40% ahead of even the guy in second, already long gone. only fun if you enjoy getting shot before you get halfway done or are someone who types up articles for a living.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm a freak for typing games. This is such an unfortunately disappointing experience, and was obvious in the first three rounds. The amount of punishment for accuracy is so heavy that it just makes the game completely unfun and punishes typing fast. The ideal player for this game hunts and pecks at 55WPM.\n\nThe idea of a typing battle royale sounded like a blast, until I realized that the biggest adversary is misinputs or double-presses, so much so that other players being faster or slower felt completely unimportant.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "personally i think this game is wildly unfair with the matchmaking. i feel they need to implement a matchmaking system to go against players with similar WPM's for a bit of fairness among players. the game has massive potential- and i understand its still in DEMO, but i really think some matchmaking of some sort would improve the game in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed this game somewhat. I type at about 80 wpm comfortably and up to 130 wpm depending on the sequence so it's usually me competing for first place. With that said, what more is there to this game once you've won a few times? There's no information supplied so you can learn about what you were just typing about such as the extracts from the war? There's no progression other than just levelling as far as I can see. I'm not really seeing a reason to keep playing this. Despite winning a good majority of the games, I'm still actually struggling with seeing certain letters or characters and this is because I'm colour blind. I get that the lighting is chosen for effect but this seems like an unfair advantage and there is no colourblind mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage font, difficult to tell if its Caps or not. The red highlight for incorrect letter is too deep, potentially masking over the over. Texts are boring, basically typing same one sentence or paragraph over and over and with how the game flows/process, im not sure if it can follow faster typings. \n\nOverall I find this to be neutral. If I have to pay for this (based on Demo), might as well go TypeRacer.\n\nWould only recommend if they add interesting features.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This pretty much always ends with a typing pro (the target audience of this game I'm sure) leaving everyone in the dust. If nothing changes, there's never a chance for any average joe to come even close to winning and the playerbase is going to dwindle. At the end of the day this is a typing game and the goal is to teach typing, don't punish people for being slow. \nI have 2 suggestions. Firstly errors should be immediately fixable. Often you'll get a strike and immediately restart the line before the little sound effect finishes, boom second strike. Its a game about speed, stop slowing me down. To that end, the little loading bar between passages is frankly pointless because everyone has to wait through them anyways. Just ditch them or let me start the next paragraph before it's over. \nSecondly, everyone dying as soon as one guy finishes really really sucks. It's practically a given that I wont win a round because I'm just an average typist. Instead, what could be more fun (but still stressful!) is if the game went into sudden death after a player finishes first. Then, every error is an immediate spin in roulette rather than just a strike.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand this is just a demo but this will be purely about my experience with this demo. It's a fun concept at first but the novelty of the atmosphere wears off after the first few games when you start to realize where the frustration starts to kick in.\n\nI find myself hitting alt+F4 the instant I make 3 mistakes but it's not due to rage. It's funny that in a game with no momentum or comeback mechanics it snowballs pretty heavily unless nearly everyone in the room has the same skill level which is next to impossible. Outside of the top 3, maybe 4, the majority of the room doesn't stand a chance at winning all it takes is to look at the \"race\" markers to see everyone's positions. Before halfway into the race you know whether you're gonna win or lose. The problem is that the game immediately ends when the first player finishes, so there's no further competition between everyone else. On top of that, the only stat getting tracked is whether you won or not, so 2nd place is equal to last. \n\nEven if you remove all HUD info and remove all sound from other players so that you can't even tell how far they are from the newline *DINGS* from their typewriters, this issue isn't solved because there's a general pattern to being able to tell anyways. I've only played a few hours but that's enough for me to know that you can still get 1st place if you mess up once or twice in a section, but if you ever have to play russian roulette there's a 5% chance you have at getting 1st.\n\nThat's why I alt+F4. The animation of putting the bullet in the gun is so long that it pisses me off and I stop caring if I live or not. I close the game instantly because I just want to get into another room where I actually have a chance of winning instead of playing out a lame duck scenario. They need to make it more interesting for the rest of the room or have the option to play different modes less frustrating than the one in this demo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun for about 10 minutes then its fun wears off and its pretty boring. Goodluck as you will face people that have impossible typing speeds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "typing game that favours accuracy WAY too much over wpm. realistically if you make even one mistake at the end of a sentence you essentially lose any chance of winning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun concept, but crashes over 50% of the time a round starts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many typos in this game. typeracer.com better 3/10 u fix typos 7/10 u fix having to wait after mistake 8/10 but typeracer.com is a 10/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would rather play typeracer than this buggy game. The game either needs skill based matchmaking or some way to balance the game. Once someone with a decent typing speed gets the lead, it's pretty much impossible for them to lose.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is too hard, add some easy difficulty because in every game there are only pros, you have no chance of winning or some sort of ranking, for example, put players of your level, pros against pros and beginners against beginners, and everyone just talks and gets hurt, they should do something about it, but it would be a good game anyway, but that's why I dislike it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a typing game that is all too keen on stopping you from typing. You type a passage correctly, you are forced to wait an eternity before being allowed to continue onto the next passage.\nYou make a mistake, you are forced to wait until the line resets.\nYou make three mistakes, you are forced to wait until the man loads a gun and shoots you in the face.\nI also didn't like being shot in the face.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make it so there's at least an elimination system. If one person wins, it's over for everyone else.\nSome random desk jockey will lap everyone and it makes it not fun.\ncool concept, bad for replay value.\nIf you want to teach people to increase their words per minute, make it so we can actually have a chance.\nADD PRIVATE LOBBIES\nSincerely,\neveryone who played this game and wasn't paid to leave a positive review",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was fun when i started since i have a 100wpm speed, then matchmaking randomly decided to start giving me matches with brainrot and incorrect spelling making typing harder and messing up my muscle memory cause I never had to type a 9 year olds F graded English test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute trash. You would never type any of the prompts on this garbage game.\n\nThe number of times I died with a single bullet in the chamber was completely unacceptable, and suggested that I should never play the lottery, as well as never step out of my house, ever again.  \n\nNo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many keystroke are counted as errors that are not errors. Cool downs are frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has shitty prompts and bad key registry. Nitro Type is better than this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really love it when the game doesn't know that there is a \"D\" in \"driver's wanted\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you dont like to feel stupid then its not a game for you. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To repetative right now...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is straight dog shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't lose",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems fun enough, but it is very irritating to get repeated pages that are not excerpts from books or spoken english. For example, \" qwe qwe qwe qwe qwe qwr asd asd asd afd ads\". I get they are designed to trip people up, but I wish you could opt out of these, as I dont find them to have good flow, or be very fun at all to play.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "More an interesting experience than something I could see myself paying actual money for.",
      "voted_up": false,
      "votes_helpful": 67
    },
    {
      "review": "The game would be far better if it was more 'last man standing' than a race. If somebody is wildly ahead, there is no counterplay and there isn't enough runway for them to screw up.\n\nHas potential.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Cool idea, but not a battle royale, just a race. I hate all the gibberish instead of normal sentences.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "I was hoping for a neat Battle Royale spin on Typeracer, but it's akin to just playing Typeracer in a much heavier standalone app:\n\n[list]\n[*] No elimination of players between \"rounds\" unless they make mistakes – a winner-takes-all, everyone-gets-eliminated-at-the-end experience. That's not a BR, that's just a free for all.\n[*] The text selection logic needs refinement: not enough variance (one game we wrote the same sentence... 24 times), and too many \"hard\" sentences in the form of lots-of-symbols-and-random-characters, which is more frustrating than challenging.\n[*] Forced pauses between \"rounds\" which break your typing flow state [i]and[/i] artificially inflate game match length. I couldn't wait to be done typing \"octopuses have three hearts and blue blood\" 24x, but had to wait an extra ~75s (15s per round pause) to escape that lobby a 2nd place loser (insult to injury).\n[*] Forced pause at the end of a match – can't queue/get in another lobby without having to watch the forced elimination cutscene first. Should be skippable after the first mandatory watch.\n[*] Unclear what accruing a higher level/XP gets you, so there's no real reward for grinding this.\n[/list]\n\nWill have to see where this goes (it [i]is[/i] just a demo), but as it stands now, it's hard to recommend.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I know it's still demo but the game still has a lot of work to be done, there is no balancing of any kind, maybe if they were to match people with their people closer to their WPM, but right now there a lot of speed typing that just take the fun right our of it, and maybe make different modes for it as well, like last man standing where there is no end, but the last one alive wins, as of now though, it's not very fun, I liked it at first but after while it gets pretty bland.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "[h1]The review[/h1]\nI'm a pretty good typer and love typing games, so I decided to give this a shot. I played three times after the tutorial. I forfeited one of these games.\n\nThe idea is interesting. The game has potential. The atmosphere and graphics are on point, and the gameplay itself is fun.\n\nBut the issue is : if someone is taking a big lead (which happened in my two complete games), you basically have no way to close the gap. And that's because the game has too many \"time wasters\".\n\nThe first time waster, which is the one I think is legit, is making you restart the whole sentence if you make a mistake. It's quick, it's instant, you just waste the time to retype what you already typed.\n\nThe second time waster is the mandatory break between section. The total text you have to type is divided in sections, and at the end of each, you have a few seconds where you can't do anything. The sections themselves are fine (they also act as resets for the third time waster), but I think the wait should be removed, or changed. Because said wait seems to be the same for everybody, that prevents you from catching up with the first place.\n\nThe third time waster is the worst and should definitelly be removed : the roulette. Each time you make 3 mistakes in one section, you have to play Russian Roulette and risk being eliminated. And the animation *is so damn long*. It feels longer than the mandatory break, you waste so much time, and it makes the gap between you and the others even bigger because it is a wait only those who trigger a roulette suffer. And it feels like a double punishment : you already have to redo the whole line, and then you have to wait super long to be able to get back in the game. The game I forfeited was because I triggered two roulettes so I was basically cooked. In my opinion, the shot should be instant (especially because you can see the guy hold the gun up on your second mistake, so no need to animate him hold the gun up) and not take longer than the line reset when you make a mistake.\n\nIn short : because of the mandatory break and the roulette, once someone has one or two sections in advance on you, you pretty much lost. Fighting knowing you have no chance to win is not fun. Better forfeit and start a new lobby than waste time.\n\nAs such, even though I love the concept and I see efforts have been poured into this project, I cannot recommend this game in this state.\n\n[h1]Suggestions[/h1]\n\nMy first suggestion is to remove the mandatory break and the roulette animation. Just have the black coat man fire immediately without a pause. It will remove some of the drama of the roulette triggering when it's a blank, but it won't remove the shock of being shot if it's a live round and right now it's more frustrating than scary.\n\nMy second suggestion is to remove the snowball effect of taking the lead : the leader has too much leeway.\nMaybe make it so everyone has to wait each others at the end of each section, so the next section starts with everyone at the same point, and add a bullet to the bottom 50% players' roulette. That way, you still insentize everyone to be one of the quickest as to not get rouletted, which keeps the stress high and still pushes them to make mistake and trigger the roulette, while not having someone who's so obviously in the lead that people cannot catch up. It could be a second play mode, with the current one being a \"Quick Play\" type mode.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "There's a cheater problem. Joined 3 consecutive games, I see the progress bar as a yellow line shoots for first. Then the third game, my neighbour typing like a man out of nightmares and DING! They finish 4 whole sentences in 2 seconds? I definitely expected to run into 150 words a minute people... but not 999 words a minute.\n\nIt's an interesting game. Needs protection from these kinds of people. Or i'm garbage with a skill issue. Who knows. I do have an idea though to make the game better.\n\nI would say to fix this issue would be to add a matchmaking system built on the typing speed of each user over time. That way, cheaters with GODLY speeds only compete with other cheaters. Meanwhile, those with the same word type speed are competing with others of the same skill. Challenging and fair.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I want to love this so bad, but after a few rounds there are a number of glaring issues:\n\n- The punishment for mistakes is extremely brutal, and makes no allowance for skilled typists who can feel a mistake before it even hits the screen, and instantly backspace it - which is true of the vast majority of skilled typists. This game basically grates on your brain if that's how you type by never allowing you to do it.\n\n- The text it has you typing starts out normal, but it very quickly turns into memes, misspellings, literally \"qwertyuiop asdfghjkl zxcvbnm ---''' zxc zxc zxcbnm bnm bnm asdhjk asdhjk\" type stuff that is just miserable to slog through, once again punishing skilled typists by basically blue-shelling them. There's even a section that is literally just a giant block of [i]binary code[/i] - as in, a giant pile of ones and zeroes. Really?\n\n- There is a forced waiting period every few lines of something like ten whole seconds where you just have to sit there and watch the first place advantage you secured for yourself vanish to nothing - five times every round or so, which is aggravating, and once again punishes skilled typists.\n\nBetween the forced waiting periods every few lines, the very long mistake animations, and the gibberish it often asks you to type, it is essentially impossible to get into any kind of flow state or rhythm - you're always having to stop, wait, reset, and begin again, over and over again the whole time. It is not fun. \n\nIf you type faster than, say, 60WPM and consider yourself a good typist, this game will take every single possible opportunity to balance against you, punish you for being fast, or otherwise negate your skill to allow slower typists to catch up. I get what they're going for, balance-wise, but it makes the game absolutely miserable for the exact kind of person who is likely to pay for this and keep the community alive long-term.\n\nIf this is to be worth purchasing and sticking with as a game, it needs to be a lot more pleasant of an experience for people who are actually skilled at typing, and not treat them like a bug to be ironed out for the sake of hyper-casual players who will not stick with it long term. This is a multiplayer game - you need the diehards to keep the servers alive.\n\nIt seems like the intent was to balance out highly skilled typists so they don't just cream the beginners...\n\nBut instead, it [i]punishes[/i] highly skilled typists. It feels more punitive, trolling, annoying and aggravating the better you are at typing - like the balance for everyone else comes at the cost of your fun and QoL.\n\nI think this decision will bear out very badly in the long term if you don't change how you handle it.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Why can't there be just... normal sentences to type?\n\nEvery game has repetitive things like:\n\nqwe qwe qwe qwe qwe tre trw trq\nasd asd asd asd asd asf adf \n\nStuff like this isn't fun to type.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's an interesting and funny concept but the novelty wears off quickly and it got annoying pretty fast. The fact that you don't realize you made a typo when it jumps you to the start of the line, and you typo again because you didn't realize that you have to restart the line is annoying but, ok, call it skill issue for me. But then there are also some matches with lots of pauses/breaks that ruin my flow. And then also some sus people that are typing really fast, like why would you even cheat at this game. It's like cheating on Duolingo. Anyway, it doesn't feel like I get to type a whole lot before the match ends so it doesn't really give me a chance to improve my typing either. I probably spend an equivalent amount of time queuing up as I play in a match. Maybe you can choose to queue up for either one match at a time, or 3 matches in a row? Or a sprint mode with no pauses, and a marathon mode with no/relaxed rules pew pews? Either way, I think you're better off playing Typeracer if you really want to improve. This is me coming from 90-100 WPM.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fix the matchmaking and it'll be a good game + going up against bots sucks, i did a session test and every match i played was with bots not a single actual human.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Needs a lot of work to balance the game to make it fun for the average person. Anyone who types or uses a computer professionally or frequently has a huge advantage over everyone else and 1 or 2 people usually have a huge lead. It just seems to always end way too quickly for most people to enjoy it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it's type racer but with reddit(derogatory) sentences, sometimes weak horror or with some writing quirk, and opponents who are generally worse at typing. there's two big things that distinguish it from type racer; you have to restart a sentence if you make a mistake, and when you make 3 mistakes you are given a time penalty that also has a chance of ending your run, flavored as russian roulette. there are breakpoints every handful of sentences where you have to wait before typing the next sentence, but as everyone has to wait the same amount of time as far as i can tell, it just serves as a break from typing that i personally didn't find any value in. i'd just prefer typeracer.com, i dont see what this adds to the typing genre more than an uninspired squid game-esque horror atmosphere that lacks depth.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "A Fantastic idea for a game being destroyed by it's execution.\n\n9/10 rounds is just writing gibberish sentences or words, which is not something I am here to test or practice. I'd rather get good at writing actual sentences.\n\nI hope someone the devs either take this idea and improves it or someone else takes it's concept and makes a better game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bizarre game, its not a battle royale at all, just a typing race. once someone reaches the end of the prompt, everyone else loses instantly. i am a fast typer so i won all ~5 games i played -- while it is funny to see everyone else die, it feels like it'd be frustrating to lose. there should be some way to attack the person in the lead, or something.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is pretty fun but in less then an hour of playing I already started seeing repeat typing tests which means at any time you'll likely be against some people that seen a given test before which isn't equal footing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THe concept is nice but I'm not into the competitive nature of it. I'd play if it had a single player mode.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I remember in middle school, I would love typing.com (or at least the competitive experience of it) since there were these timed quizzes that were high-quality, and there were lessons that were genuinely helpful and a great bridge builder to getting better at typing. However, a lot of the early typing.com lessons had phrases that were not only repetitive to type, but mind-numbing and extremely boring. Phrases like \"abc abc abc abc\" and \"the the and and but but\" repeated over and over again.\n\nMost of this game is just that. \n\nWhat a dogshit way to ruin a great atmosphere.\n\n(Doesn't help this game is also (1) not a battle royale, there is no way to do anything to other players except voice chat if that's your thing, and (2) is extremely punishing; some of these phrases take me a second to write, and one slightly tricky line can get you fucked for the rest of the game)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the gameplay is entirely typing and you're giving us dog shit prompts where we type the same sentence 30 times with 1 more letter in it. moron.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like the concept, did 7 matches in under 15 minutes.\nBut not sure if I'd play this, two of my matches had players saying verbally abusive things and I couldn't figure out how to turn the voip off and they were quite loud.\nNeeds to have the voip toggleable.\n\nCould be a good game though but not recommending just cause of the voip problem.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game shows promise if it can build itself some more interesting systems, but it fails to do this. Any mistake in this game costs enough time to kill your run, and with others working at my pace with even higher accuracy, it makes it incredibly demotivating to keep playing. The roulette animation is so long that your run is over even if you don't die right then and there unless you're already leading by one morbillion to the point where I just left a game after I got locked into it because I was dead in the water already.\n\nIt'd be neat if they let you keep typing mid-animation and they sped things up ever so slightly, because besides the off-chance you die on the gunshot, this game is otherwise so, so punishing. I'd like to say I'm good at this, but the moment I get put into lobbies around my skill level, I immediately fall to the wayside. I also hope rounds are longer going into the full game, which is the implication I'm seeing; hopefully, they'll have fixed some of the issues by then.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was so excited for this when I read the concept, and was so disappointed when I actually tried it.\n\n\"Final Sentence is a Battle Royale typing game.\" It's not a battle royale, it's a basic typing speed test against other players, an identical experience to something like typeracer.com. \n\nThe horror atmosphere feels great, but you don't get to actually interact with the game world since it's just a typing test. Nothing was done to innovate on this very, very basic gameplay premise. Games like The Textorcist, Blood Typers, or even the classic Typing of the Dead are some great examples of how you can interpret typing as gameplay in creative ways. \n\nThis game, on the other hand, is doing the bare minimum. You could make this same game in 500 different settings. You can make people do a typing test on a beach. Typing test on a volcano. Typing test on a skyscraper. It's still just a basic typing test if you're not actually adding gameplay elements that go beyond individually testing a bunch of people's wpm. It feels like a wasted concept.\n\nIt's like baking the most bland cake imaginable and then slathering it with a special icing that's currently on trend (horror gaming) and then everyone going WOW THIS CAKE IS PEAK! \n\nis it? is it peak? or do you just like eating icing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really liked this game, but I can only ever play one match before the next match makes the game either fatally crash or freeze on start-up. *Will probably change this review if the issue ends up getting fixed eventually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The amount of times I died off of the first roulette is actually mind-boggling. What incentive do i have to play if I am in the lead with a huge gap, then the FIRST TIME I make 3 mistakes in a row, I'm dead. I'd understand if this was something that truly happened 16 percent of the time. But when I die from the first roulette in one out of every THREE games I play, I no longer wish to play anymore. It is not fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't recommend if the servers on release are going to have the same ass connection.\nIf my internet is good enough to play CS, it should be a hundred times good enough to play this, yet the game regularly fails to connect after finding a match, and when the match is over the stats won't load sometimes and the game won't count.\nAt this very moment I'm stuck at 1100 ping and a \"Bad Connection\" error while being able to comfortably browse and watch videos.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game looked really spooky and at first it got my heart racing, but I expected more. Idk if they will add more to this game (I did just only play the demo)  but it wasn't the spooky vibe I was going for. I thought the rounds would progress and as you typed it would reveal more lore, like why these people are trapped here writing in the first place. The words could be keys as to why they are here and how to escape and then if someone keeps playing rounds and winning they will eventually escape. But after playing a round or two I got to the sentence\" can I haz cheeseburger\" and a ton of other early 2000s memes plus disney song lyrics??? that made me cringe so hard i had to quit and uninstall. I really hope they make this game more interesting cuz I would love to play again if so.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Visually cool, but gameplay is very similar / been done before to the point where it gets boring very fast\n\nRussian Roulette after 3 errors feels very gimmicky, as if you fuck up basically once, you're done because a flawless player is going to run you over, game promotes typing slow asf\n\nNot to mention when you try leaving a match you are greeted with the death animation that lasts 10 years BRo i just want to leave the match and quickly queue another one bro\n\nAlso #1 player winning kills all of the other players is kinda dumb\n\nHonestly this format wouldve been WAYYYY more better if it was like fall guys where X amount of people qualify, and then start a new 1000 page essay for everyone at the same time, that way if you fuck up, its not going to guarantee you a 2nd place and theres 0 comeback that you can do\n\n\nBtw Babble Royale better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "To be honest would be a actual good game if it wouldnt either disconnect middle of game like no you cant type anymore or atleast there would be more living servers since it tooks like ages to find a server whats being hosted",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is not very interesting if you don't have a QWERTY keyboard. Please add support for other types",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is a bit one note, unclear if the released game will somehow introduce anything in the way of additional mechanics. The vibe and feel is cool, top notch (except lack of variety in the ambience, etc), but ultimately the thing that left a poor impression was the selection of 'scripts' to type: there's a decent amount of variety, but based on how many repeats I saw, not nearly enough.\n\nMostly, though, I just didn't like the gimmick scripts. One is all meme references. One is just gibberish. One has no spaces and is all camelcased like programming but the game doesn't care about upper/lower case. The one that made me finally just alt-f4 and decide to leave my review was the one where it's in english as if written by a non-literate child - maybe it's a reference to something I don't get, but being forced to type *incorrectly spelled* words in a typing game is a the worst. I don't love the 'qwe qwe qwe qwe qwf' type ones either but there's no mental overlap of a desire to fix typos.\n\nThere are other things the game could address like accessibility features (there's no ability to resize text, etc). \n\nI suspect this game will be overrun with cheaters eventually, though that didn't seem the case yet. The only 'weird' thing I saw was someone typing about 10x faster than anyone on one of the 'qwe qwe qwe' levels. \n\nRight now the competition level seems varied, I won a number of rounds, and lost a number too.\n\nFinally., how do you add voice chat to a game about typing without having text chat (during lobby or mid-round breaks). Seriously.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely no balanced matchmaking of any kind, always somebody done in 1:30 more than 40% ahead of even the guy in second, already long gone. only fun if you enjoy getting shot before you get halfway done or are someone who types up articles for a living.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun, but almost unplayable on 60% keyboard.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the texts are incredibly annoying. Typing the same sentence over and over again, random gibberish or texts without spaces is just added difficulty for no reason.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a freak for typing games. This is such an unfortunately disappointing experience, and was obvious in the first three rounds. The amount of punishment for accuracy is so heavy that it just makes the game completely unfun and punishes typing fast. The ideal player for this game hunts and pecks at 55WPM.\n\nThe idea of a typing battle royale sounded like a blast, until I realized that the biggest adversary is misinputs or double-presses, so much so that other players being faster or slower felt completely unimportant.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "personally i think this game is wildly unfair with the matchmaking. i feel they need to implement a matchmaking system to go against players with similar WPM's for a bit of fairness among players. the game has massive potential- and i understand its still in DEMO, but i really think some matchmaking of some sort would improve the game in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've enjoyed this game somewhat. I type at about 80 wpm comfortably and up to 130 wpm depending on the sequence so it's usually me competing for first place. With that said, what more is there to this game once you've won a few times? There's no information supplied so you can learn about what you were just typing about such as the extracts from the war? There's no progression other than just levelling as far as I can see. I'm not really seeing a reason to keep playing this. Despite winning a good majority of the games, I'm still actually struggling with seeing certain letters or characters and this is because I'm colour blind. I get that the lighting is chosen for effect but this seems like an unfair advantage and there is no colourblind mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage font, difficult to tell if its Caps or not. The red highlight for incorrect letter is too deep, potentially masking over the over. Texts are boring, basically typing same one sentence or paragraph over and over and with how the game flows/process, im not sure if it can follow faster typings. \n\nOverall I find this to be neutral. If I have to pay for this (based on Demo), might as well go TypeRacer.\n\nWould only recommend if they add interesting features.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This pretty much always ends with a typing pro (the target audience of this game I'm sure) leaving everyone in the dust. If nothing changes, there's never a chance for any average joe to come even close to winning and the playerbase is going to dwindle. At the end of the day this is a typing game and the goal is to teach typing, don't punish people for being slow. \nI have 2 suggestions. Firstly errors should be immediately fixable. Often you'll get a strike and immediately restart the line before the little sound effect finishes, boom second strike. Its a game about speed, stop slowing me down. To that end, the little loading bar between passages is frankly pointless because everyone has to wait through them anyways. Just ditch them or let me start the next paragraph before it's over. \nSecondly, everyone dying as soon as one guy finishes really really sucks. It's practically a given that I wont win a round because I'm just an average typist. Instead, what could be more fun (but still stressful!) is if the game went into sudden death after a player finishes first. Then, every error is an immediate spin in roulette rather than just a strike.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand this is just a demo but this will be purely about my experience with this demo. It's a fun concept at first but the novelty of the atmosphere wears off after the first few games when you start to realize where the frustration starts to kick in.\n\nI find myself hitting alt+F4 the instant I make 3 mistakes but it's not due to rage. It's funny that in a game with no momentum or comeback mechanics it snowballs pretty heavily unless nearly everyone in the room has the same skill level which is next to impossible. Outside of the top 3, maybe 4, the majority of the room doesn't stand a chance at winning all it takes is to look at the \"race\" markers to see everyone's positions. Before halfway into the race you know whether you're gonna win or lose. The problem is that the game immediately ends when the first player finishes, so there's no further competition between everyone else. On top of that, the only stat getting tracked is whether you won or not, so 2nd place is equal to last. \n\nEven if you remove all HUD info and remove all sound from other players so that you can't even tell how far they are from the newline *DINGS* from their typewriters, this issue isn't solved because there's a general pattern to being able to tell anyways. I've only played a few hours but that's enough for me to know that you can still get 1st place if you mess up once or twice in a section, but if you ever have to play russian roulette there's a 5% chance you have at getting 1st.\n\nThat's why I alt+F4. The animation of putting the bullet in the gun is so long that it pisses me off and I stop caring if I live or not. I close the game instantly because I just want to get into another room where I actually have a chance of winning instead of playing out a lame duck scenario. They need to make it more interesting for the rest of the room or have the option to play different modes less frustrating than the one in this demo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun for about 10 minutes then its fun wears off and its pretty boring. Goodluck as you will face people that have impossible typing speeds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "typing game that favours accuracy WAY too much over wpm. realistically if you make even one mistake at the end of a sentence you essentially lose any chance of winning",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun concept, but crashes over 50% of the time a round starts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many typos in this game. typeracer.com better 3/10 u fix typos 7/10 u fix having to wait after mistake 8/10 but typeracer.com is a 10/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would rather play typeracer than this buggy game. The game either needs skill based matchmaking or some way to balance the game. Once someone with a decent typing speed gets the lead, it's pretty much impossible for them to lose.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is too hard, add some easy difficulty because in every game there are only pros, you have no chance of winning or some sort of ranking, for example, put players of your level, pros against pros and beginners against beginners, and everyone just talks and gets hurt, they should do something about it, but it would be a good game anyway, but that's why I dislike it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a typing game that is all too keen on stopping you from typing. You type a passage correctly, you are forced to wait an eternity before being allowed to continue onto the next passage.\nYou make a mistake, you are forced to wait until the line resets.\nYou make three mistakes, you are forced to wait until the man loads a gun and shoots you in the face.\nI also didn't like being shot in the face.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Make it so there's at least an elimination system. If one person wins, it's over for everyone else.\nSome random desk jockey will lap everyone and it makes it not fun.\ncool concept, bad for replay value.\nIf you want to teach people to increase their words per minute, make it so we can actually have a chance.\nADD PRIVATE LOBBIES\nSincerely,\neveryone who played this game and wasn't paid to leave a positive review",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was fun when i started since i have a 100wpm speed, then matchmaking randomly decided to start giving me matches with brainrot and incorrect spelling making typing harder and messing up my muscle memory cause I never had to type a 9 year olds F graded English test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute trash. You would never type any of the prompts on this garbage game.\n\nThe number of times I died with a single bullet in the chamber was completely unacceptable, and suggested that I should never play the lottery, as well as never step out of my house, ever again.  \n\nNo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many keystroke are counted as errors that are not errors. Cool downs are frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has shitty prompts and bad key registry. Nitro Type is better than this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really love it when the game doesn't know that there is a \"D\" in \"driver's wanted\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you dont like to feel stupid then its not a game for you. 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To repetative right now...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is straight dog shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't lose",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems fun enough, but it is very irritating to get repeated pages that are not excerpts from books or spoken english. For example, \" qwe qwe qwe qwe qwe qwr asd asd asd afd ads\". I get they are designed to trip people up, but I wish you could opt out of these, as I dont find them to have good flow, or be very fun at all to play.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "More an interesting experience than something I could see myself paying actual money for.",
      "voted_up": false,
      "votes_helpful": 67
    },
    {
      "review": "The game would be far better if it was more 'last man standing' than a race. If somebody is wildly ahead, there is no counterplay and there isn't enough runway for them to screw up.\n\nHas potential.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Cool idea, but not a battle royale, just a race. I hate all the gibberish instead of normal sentences.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "I was hoping for a neat Battle Royale spin on Typeracer, but it's akin to just playing Typeracer in a much heavier standalone app:\n\n[list]\n[*] No elimination of players between \"rounds\" unless they make mistakes – a winner-takes-all, everyone-gets-eliminated-at-the-end experience. That's not a BR, that's just a free for all.\n[*] The text selection logic needs refinement: not enough variance (one game we wrote the same sentence... 24 times), and too many \"hard\" sentences in the form of lots-of-symbols-and-random-characters, which is more frustrating than challenging.\n[*] Forced pauses between \"rounds\" which break your typing flow state [i]and[/i] artificially inflate game match length. I couldn't wait to be done typing \"octopuses have three hearts and blue blood\" 24x, but had to wait an extra ~75s (15s per round pause) to escape that lobby a 2nd place loser (insult to injury).\n[*] Forced pause at the end of a match – can't queue/get in another lobby without having to watch the forced elimination cutscene first. Should be skippable after the first mandatory watch.\n[*] Unclear what accruing a higher level/XP gets you, so there's no real reward for grinding this.\n[/list]\n\nWill have to see where this goes (it [i]is[/i] just a demo), but as it stands now, it's hard to recommend.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I know it's still demo but the game still has a lot of work to be done, there is no balancing of any kind, maybe if they were to match people with their people closer to their WPM, but right now there a lot of speed typing that just take the fun right our of it, and maybe make different modes for it as well, like last man standing where there is no end, but the last one alive wins, as of now though, it's not very fun, I liked it at first but after while it gets pretty bland.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "[h1]The review[/h1]\nI'm a pretty good typer and love typing games, so I decided to give this a shot. I played three times after the tutorial. I forfeited one of these games.\n\nThe idea is interesting. The game has potential. The atmosphere and graphics are on point, and the gameplay itself is fun.\n\nBut the issue is : if someone is taking a big lead (which happened in my two complete games), you basically have no way to close the gap. And that's because the game has too many \"time wasters\".\n\nThe first time waster, which is the one I think is legit, is making you restart the whole sentence if you make a mistake. It's quick, it's instant, you just waste the time to retype what you already typed.\n\nThe second time waster is the mandatory break between section. The total text you have to type is divided in sections, and at the end of each, you have a few seconds where you can't do anything. The sections themselves are fine (they also act as resets for the third time waster), but I think the wait should be removed, or changed. Because said wait seems to be the same for everybody, that prevents you from catching up with the first place.\n\nThe third time waster is the worst and should definitelly be removed : the roulette. Each time you make 3 mistakes in one section, you have to play Russian Roulette and risk being eliminated. And the animation *is so damn long*. It feels longer than the mandatory break, you waste so much time, and it makes the gap between you and the others even bigger because it is a wait only those who trigger a roulette suffer. And it feels like a double punishment : you already have to redo the whole line, and then you have to wait super long to be able to get back in the game. The game I forfeited was because I triggered two roulettes so I was basically cooked. In my opinion, the shot should be instant (especially because you can see the guy hold the gun up on your second mistake, so no need to animate him hold the gun up) and not take longer than the line reset when you make a mistake.\n\nIn short : because of the mandatory break and the roulette, once someone has one or two sections in advance on you, you pretty much lost. Fighting knowing you have no chance to win is not fun. Better forfeit and start a new lobby than waste time.\n\nAs such, even though I love the concept and I see efforts have been poured into this project, I cannot recommend this game in this state.\n\n[h1]Suggestions[/h1]\n\nMy first suggestion is to remove the mandatory break and the roulette animation. Just have the black coat man fire immediately without a pause. It will remove some of the drama of the roulette triggering when it's a blank, but it won't remove the shock of being shot if it's a live round and right now it's more frustrating than scary.\n\nMy second suggestion is to remove the snowball effect of taking the lead : the leader has too much leeway.\nMaybe make it so everyone has to wait each others at the end of each section, so the next section starts with everyone at the same point, and add a bullet to the bottom 50% players' roulette. That way, you still insentize everyone to be one of the quickest as to not get rouletted, which keeps the stress high and still pushes them to make mistake and trigger the roulette, while not having someone who's so obviously in the lead that people cannot catch up. It could be a second play mode, with the current one being a \"Quick Play\" type mode.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "There's a cheater problem. Joined 3 consecutive games, I see the progress bar as a yellow line shoots for first. Then the third game, my neighbour typing like a man out of nightmares and DING! They finish 4 whole sentences in 2 seconds? I definitely expected to run into 150 words a minute people... but not 999 words a minute.\n\nIt's an interesting game. Needs protection from these kinds of people. Or i'm garbage with a skill issue. Who knows. I do have an idea though to make the game better.\n\nI would say to fix this issue would be to add a matchmaking system built on the typing speed of each user over time. That way, cheaters with GODLY speeds only compete with other cheaters. Meanwhile, those with the same word type speed are competing with others of the same skill. Challenging and fair.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I want to love this so bad, but after a few rounds there are a number of glaring issues:\n\n- The punishment for mistakes is extremely brutal, and makes no allowance for skilled typists who can feel a mistake before it even hits the screen, and instantly backspace it - which is true of the vast majority of skilled typists. This game basically grates on your brain if that's how you type by never allowing you to do it.\n\n- The text it has you typing starts out normal, but it very quickly turns into memes, misspellings, literally \"qwertyuiop asdfghjkl zxcvbnm ---''' zxc zxc zxcbnm bnm bnm asdhjk asdhjk\" type stuff that is just miserable to slog through, once again punishing skilled typists by basically blue-shelling them. There's even a section that is literally just a giant block of [i]binary code[/i] - as in, a giant pile of ones and zeroes. Really?\n\n- There is a forced waiting period every few lines of something like ten whole seconds where you just have to sit there and watch the first place advantage you secured for yourself vanish to nothing - five times every round or so, which is aggravating, and once again punishes skilled typists.\n\nBetween the forced waiting periods every few lines, the very long mistake animations, and the gibberish it often asks you to type, it is essentially impossible to get into any kind of flow state or rhythm - you're always having to stop, wait, reset, and begin again, over and over again the whole time. It is not fun. \n\nIf you type faster than, say, 60WPM and consider yourself a good typist, this game will take every single possible opportunity to balance against you, punish you for being fast, or otherwise negate your skill to allow slower typists to catch up. I get what they're going for, balance-wise, but it makes the game absolutely miserable for the exact kind of person who is likely to pay for this and keep the community alive long-term.\n\nIf this is to be worth purchasing and sticking with as a game, it needs to be a lot more pleasant of an experience for people who are actually skilled at typing, and not treat them like a bug to be ironed out for the sake of hyper-casual players who will not stick with it long term. This is a multiplayer game - you need the diehards to keep the servers alive.\n\nIt seems like the intent was to balance out highly skilled typists so they don't just cream the beginners...\n\nBut instead, it [i]punishes[/i] highly skilled typists. It feels more punitive, trolling, annoying and aggravating the better you are at typing - like the balance for everyone else comes at the cost of your fun and QoL.\n\nI think this decision will bear out very badly in the long term if you don't change how you handle it.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "Why can't there be just... normal sentences to type?\n\nEvery game has repetitive things like:\n\nqwe qwe qwe qwe qwe tre trw trq\nasd asd asd asd asd asf adf \n\nStuff like this isn't fun to type.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's an interesting and funny concept but the novelty wears off quickly and it got annoying pretty fast. The fact that you don't realize you made a typo when it jumps you to the start of the line, and you typo again because you didn't realize that you have to restart the line is annoying but, ok, call it skill issue for me. But then there are also some matches with lots of pauses/breaks that ruin my flow. And then also some sus people that are typing really fast, like why would you even cheat at this game. It's like cheating on Duolingo. Anyway, it doesn't feel like I get to type a whole lot before the match ends so it doesn't really give me a chance to improve my typing either. I probably spend an equivalent amount of time queuing up as I play in a match. Maybe you can choose to queue up for either one match at a time, or 3 matches in a row? Or a sprint mode with no pauses, and a marathon mode with no/relaxed rules pew pews? Either way, I think you're better off playing Typeracer if you really want to improve. This is me coming from 90-100 WPM.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fix the matchmaking and it'll be a good game + going up against bots sucks, i did a session test and every match i played was with bots not a single actual human.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Needs a lot of work to balance the game to make it fun for the average person. Anyone who types or uses a computer professionally or frequently has a huge advantage over everyone else and 1 or 2 people usually have a huge lead. It just seems to always end way too quickly for most people to enjoy it.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}