{
  "positive": [
    {
      "review": "The best game in history, the best series of the Metro series, in my opinion, the graphics are very wonderful and the story is very beautiful.\nWe play the role of a risk-seeking and risk-taking man named Artyom, who always goes through many difficulties, including boss fights and facing strange creatures and enemies. In addition to these, there is a woman named Anna who loves us with all her heart and thinks of us and puts herself in danger for us.\nIt is a very good game, highly recommended, Hashem's DLC is very useful and entertaining",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "G F*CKING G\n\nSuperb Series / Saga. Took a while to complete Metro Exodus unlike 2033 and Last Light. Atmosphere here on Exodus definitely was an improvement compared to the previous series. However I still do think that the \"thriller\" genre or vibes was greater in the previous series. I guess the \"Metro Atmosphere\" or \"Underground\" atmosphere was just giving more goosebumps or suspense compared to Exodus which is definitely a clear definition of what an open world is or as it is. From the snowy atmosphere to dessert and to aquatic setup is a blast to experience. Ending was... Well we don't get to have the endings that we \"always\" have wanted don't we? :)\n\nPrevious series took me 10 to 11 hours of gameplay to complete the game but this particular one took me 21hrs to complete the game. Double the experience and definitely double the fun in exploring the vast environment of the game.\n\nDefinitely a solid pickup to get the Metro Bundle series. Had a lot of suspense from the first saga till the last and definitely would would come back to start a new run. \n\nLong Live Artyom! Or.....\n\n100/10\n\nPurely played handheld on my Rog Ally X and Steam Deck. Performance is superb with some minor dips in just the very end or at least before the credits roll out.\n\nEdit: After doing my research, smh I got the bad ending welp. It is what it is. Guess I should've showed mercy instead of rage-killing the foes lol. Still a superb experience!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Metro Exodus takes the claustrophobic tension of the earlier games and expands it into a sprawling, semi-open world — without losing its soul. You play as Artyom, leaving the tunnels of post-apocalyptic Moscow to search for a new life on the surface.\r\n\r\nThe game masterfully balances quiet exploration with brutal combat and powerful storytelling. Each region — from frozen forests to sun-scorched deserts — feels alive, dangerous, and hauntingly beautiful. The world tells its story through every ruin, radio transmission, and fleeting human moment.\r\n\r\nVisually stunning and emotionally gripping, Metro Exodus is both a survival shooter and a deeply human journey about hope in a dying world.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Metro Exodus, developed by 4A Games and published by Deep Silver, represents a major turning point in the Metro series, taking its tense, claustrophobic survival horror roots and expanding them into a vast, open-world journey across a devastated post-apocalyptic Russia. It is both a continuation and a reinvention, following the story of Artyom, the silent protagonist from the previous games, as he leaves behind the dark tunnels of the Moscow Metro in search of a new life on the surface. What unfolds is a remarkable odyssey across a shattered landscape, carried by a haunting mix of human desperation, fragile hope, and the quiet beauty that still lingers in a ruined world. It is a game that manages to be grim and breathtaking at the same time—an experience that balances moments of intense combat and survival with periods of reflection, exploration, and storytelling rarely seen in first-person shooters.\n\nThe decision to move beyond the underground tunnels of the earlier games was a bold one, but it pays off magnificently. Metro Exodus takes players on a journey that spans an entire year, moving through multiple regions and biomes, from the frozen remnants of Moscow’s outskirts to the burning sands of the Caspian desert and the overgrown valleys of the Taiga. Each location is semi-open in design, allowing freedom of exploration while maintaining the series’ focus on atmosphere and tension. This hybrid approach works remarkably well—the game never loses the tightly scripted intensity that defined its predecessors, yet it introduces a sense of scale and unpredictability that keeps the experience fresh. Whether scavenging for filters in the wasteland, fighting off mutated creatures in abandoned ruins, or navigating the Aurora train that serves as your mobile home, every area feels alive, dangerous, and meaningful.\n\nSurvival remains at the core of the experience. Artyom is not a super-soldier; he is a fragile human in a hostile world. Resources are scarce, weapons require maintenance, and every bullet feels precious. The game’s crafting system deepens this tension by allowing players to assemble ammunition, filters, and weapon modifications at workbenches or in the field. This mechanic encourages cautious exploration and creates a tangible sense of progression as your tools evolve alongside your journey. The combat itself is methodical and weighty—guns feel heavy, enemies are deadly, and stealth remains a vital option for those who prefer patience over confrontation. The AI can be inconsistent at times, with some encounters feeling brilliantly unpredictable and others oddly mechanical, but when the systems align, the combat offers an immersive mix of tension and satisfaction that few shooters achieve.\n\nThe shift to open areas also allows the game to breathe in ways the earlier entries never could. Between firefights and scavenging runs, Metro Exodus offers moments of quiet introspection—sitting by a campfire with your companions, listening to a conversation between crew members, or simply watching the sunset through a cracked visor. These scenes lend emotional weight to the journey, grounding it in the humanity of its characters. Artyom’s companions aboard the Aurora—his wife Anna, the pragmatic Colonel Miller, and a host of fellow soldiers and survivors—form the emotional backbone of the story. Their interactions feel genuine, with each having their own hopes, fears, and motivations. The game takes time to explore these relationships, allowing you to form attachments that make later events hit harder. The writing is understated but effective, often conveyed through natural dialogue rather than exposition, and it contributes to the sense that these people are truly fighting for something more than just survival.\n\nFrom a technical standpoint, Metro Exodus is a visual powerhouse. 4A Games has always been known for pushing hardware boundaries, and here they outdo themselves. The game’s environments are richly detailed and often stunning—snowy ruins glisten with eerie beauty, sun-drenched deserts shimmer with heat, and night sequences envelop you in darkness punctuated by flickering lights and glowing radiation. The lighting system, particularly in the Enhanced Edition with full ray tracing, creates scenes that border on photorealism, enhancing immersion to a level that few games match. Weather patterns, dynamic day-night cycles, and environmental storytelling all contribute to the sense of a living world that continues to decay and adapt long after humanity’s fall. The sound design is equally masterful, with distant roars, creaking metal, and muffled footsteps combining to create constant unease. Even the simple act of breathing through a gas mask—a series hallmark—remains one of the most effective tension-building mechanics in gaming.\n\nThe narrative itself is both epic and intimate, balancing the personal story of Artyom’s quest for hope with a broader look at the remnants of civilization. The pacing can vary, with certain sections slowing down to emphasize exploration and emotional beats before ramping up into explosive set pieces. Some players may find these shifts jarring, particularly those expecting the tightly linear structure of previous Metro games, but the variety ultimately enriches the experience. Each chapter feels distinct, offering different gameplay rhythms and emotional tones, from desperate survival in desolate landscapes to moral choices that determine the fate of both individuals and entire communities. The game’s endings reflect these decisions, reinforcing the theme that in a world already destroyed, what matters most is how you choose to live.\n\nDespite its ambition, Metro Exodus is not without flaws. Certain technical issues, such as stiff animations or minor bugs, occasionally break immersion. The stealth mechanics can feel inconsistent depending on environmental design, and the AI behavior sometimes swings between sharp and oblivious. Additionally, while the narrative offers powerful moments, some characters outside the core cast receive limited development, and the moral choice system—while impactful—can feel binary in execution. Yet even with these shortcomings, the game’s atmosphere and craftsmanship overshadow its imperfections. Every chapter, every ruined village or abandoned factory, tells a story through its design, inviting players to piece together fragments of humanity’s past while forging their own path forward.\n\nMetro Exodus succeeds not only as a continuation of a beloved series but as a statement of ambition from 4A Games. It transforms a once claustrophobic survival horror experience into a sprawling yet intimate journey about resilience, faith, and the enduring search for home. The result is a rare kind of shooter—one that values patience and emotion as much as precision and firepower. It’s a haunting, beautiful, and deeply human story set against the desolation of a dying world. For those who embrace its deliberate pacing and attention to detail, Metro Exodus offers an experience that lingers long after the credits roll—a testament to the idea that even in the darkest corners of apocalypse, hope can still find a way to shine through the dust.\n\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Oyunu oynamakta uzmanlaşmak ayrı konu , anlamsızca yarasa kümeleri ile rastgele hasar alıp boss savaşını gece radyoaktif yağmurda başlatmak ayrı.Elinin ayarı olur insanın.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I thought escaping the Metro meant I was done wearing a gas mask. I was wrong. Turns out, the world is still a giant toxic mess, but now it's got more trees and fewer rats that look like tiny bears.\n\nThis game is basically a post-apocalyptic road trip across Russia in a train named the Aurora.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "MAMMA MIAAAAAAAAAAAAAA, che gioco signori PERFETTO c'è qualche bug ma pochi.\r\nCHE STORIAAAAAA PAZZESCA, è da tempo che cercavo un gioco del genere.\r\nottimo finale.\r\nABSOLUTE CINEMA.\r\nora mi compro i dlc peffozza",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite its age, the game still delivers top-tier storytelling and visuals.\nUnfortunately, it’s held back by severe freezes and save-corruption bugs that the devs still haven’t fixed after all this time — seriously disappointing.\n\nBut when it comes to the narrative, both the base game and the two DLCs are absolutely flawless. Brotherhood, family, love, homesickness — every emotion hits perfectly. These writers should be hired to teach today’s studios how to tell a real story.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You can really feel the level of care that went into this game. It's one of the last games released before the current UE5 slop era of gaming.\n\nThe graphics are amazing, and very performant. I easily get 500 FPS on 2560x1440 on the non-enhanced version. This level of performance puts any recently released game to shame.\n\nIf you're looking for a fantastic story driven FPS, this is one of the best. I recommend non-enhanced if you care about motion clarity, the enhanced version performs much worse and doesn't really look that much better. (I also recommend looking up how to turn off mouse acceleration and smoothing)\n\nFantastic work by 4A. It's tragic games are no longer made by people who care this much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A balance of linear progression while keeping a open world experience choosing to crouch around enemies, row around them, run by them or fight them, theres a lot of similar experiences like that. The gun customization, different guns, the inworld map and having to pull out your backpack to craft limited items create an immersion like no other game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An Unforgettable Post-Apocalyptic Journey \r\n\r\nMetro Exodus is not just a game; it’s an emotional journey through a ruined world filled with danger, hope, and breathtaking moments. From the very beginning, it feels like you’re living inside a real story. The characters are incredibly well-written, and every choice you make feels meaningful.\r\n\r\nThe visuals are stunning. The open areas are rich with detail, each region having its own atmosphere—from frozen wastelands to dry deserts. The lighting and shadows are phenomenal, especially in dark tunnels or during sunsets over destroyed landscapes.\r\n\r\nGameplay is perfectly balanced:\r\n\r\nDeep weapon customization\r\n\r\nLimited resources that make every encounter intense\r\n\r\nA smooth blend of stealth and action\r\n\r\nAtmospheric music that enhances every scene\r\n\r\nBut the heart of the game is its story. It's emotional, human, and makes you feel truly connected to the crew of the Aurora. Even the quiet moments around the campfire are memorable and meaningful.\r\n\r\nMetro Exodus masterfully combines open-world exploration, a dark and immersive atmosphere, emotional storytelling, and exceptional artistic detail. It’s one of the best post-apocalyptic experiences you can have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good game, that I recommend.\n\nPros:\n- Interesting, human, likeable characters. No insufferable girl boss, for example.\n- Very nice visuals.\n- Various environments. Watching the scenery from the moving train is something unique, that I had never seen rendered that well so far.\n- Good story.\n- No DEI. This game is NOT for the modern audience.\n\nCons:\n- Linear (might be a pro for some).\n- Controls are too consolish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fine. good game I'd say. As with previous metro games, the mechanics are tight, and the immersion is really good.  But it unfortunately lacks some of the claustrophobic horror of the original 2 games. The fact that, if you so please, you can rest until daytime and eliminate night activities all together makes for a funny experience. 6 or 7/10 from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Extremely well executed characters and story. And obviously an extremely pretty game. If you want DLCs tho or to achievement hunt, get the enhanced edition coz the steam achievements don't transfer between the two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed 2033 and Last Light but holy, Exodus is beyond those two. Dead City is definitely peak - one of the best gaming experience that I had ever pleasure to play. Absolutely beautiful and at the same time depressing piece of modern art. DLCs are also very solid and they don't fall off from quality of the main game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "so good la the story is enjoyable but i hate the spiders and also the electric variant fuck it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metro was the only series of games that got me to play the same game more than once. With this one; it was no different. That bieng said; i knew comming in; that this instalment was different from the other two games; so i was worried that it wouldn't hit the same; that it would try and pretend it was somthing that it's not... Boy was i wrong.\n\nThis game is everything i've come to expect from a Metro game, but more. Dark winding tunnels, replaced with a mixture a semi-open world and linear levels, each with thier own unique aperance and theme. Both filled with a plethora of things to do, paths to explore, etc etc. Characters have loads of unique dialog and can feel like real poeple when interacting with them. \n\nAs well as that, The new Morality system used to determine what ending you get, has greatly improved from last light. Instead of having to play Balalajkas and Mandolins, eavsdropping on conversatoins, donating to the poor and having to go the pacifist route whenver humans are involed in a combat senario;  You simply have to not be an ass, by not killing anyone isn't evil and doing the good dead here n' there. Bandits and other animals are free to slaughter, and won't affect your morality. \n\nOnly point i think the game lacks in is the weapon selectoin. in both 2033, and last light; i enyojed the large selectoin and mix of both pre-war, and improvised weaponry. In exodus; they Carried other only a handfull of weapons; with a more advanced attachment system. If you enjoyed using the azbats or siaga in LL (like me) best you can do here is attach a belt fed or box magazine to a shambler. I Don't hate this system, but i'd love to see more weapons that survived the war in this game... (i suppose it does fit the setting though... the game is mostly set in the middle of nowhere)\n\noveral, it's and easy reccomendatoin. 4A games cooked 3rd time in a row.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly very good game, i liked the story alot, the gameplay was decent, level design was good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but it would be better if I didn't crash on large maps all the time despite having a 4060 Ti.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game of the metro series\ngraphics, the story, the gameplay, all of it is 10/10\nmakes a grown man cry...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! I have beaten both metro 2033 redux games (the previous ones). I like metro exodus for it's graphics and great story. It does a really nice job to keep your interest in playing it but I got too scared of the mootants so I quit for two months and then continued. I don't recomend it to people that get scared easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me, this game is \"A beautiful overrated and incredibly annoying test of patience\".\n\nThe intro were so effing long I had to go into the game folder and delete those darn three videos and you should do the same if you don't want to spent an hour long watching that shjt when you first start the game.\n\nSlow pace, so much walking. There are literally 10 more badass soldier on the train and I have to do all the work for them, alone, make no sense. And my chick and her sugar daddy keep yelling at each other all the time.\n\nNPCs talk a lot and continuously, and argue endlessly, one person hasn't finished speaking yet and the other has already jumped in and yelling. The English dub is really bad, cringe and tense with a weird accent, I had to switch to Russian dub to listen to it less annoying.\n\nAnnoying buzzing sound (on my watch I guess) really drive me crazy!! WTF what that? Idk if it is a bug/glitch or game's feature but I can not stand it any second. F that sheat!\n\nOne thing that seemed really cool at first but turned out to be really ridiculous was the sound effects, for example when an NPC was talking, I was standing right in front of them but when I turned the camera left/right/behind I couldn't hear them anymore, it was funny and ridiculous.\n\nWell, based on the \"very positive\" reviews on steam, the game doesn't seem bad at all, maybe it just isn't for me, after 5 hours I'm lost it and I'm like \"fvck that shjt I'm out\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There needs to be better controller view sensitivity options, but this is one of the best in the Metro series. Take your time in this game. Every action or inaction has consequences. Yeah you can kill the bridge guards, but then you will be branded a satanical heretic and the next area will have more guards ready.\n\nTake your time and explore every building and nook and cranny and dear god put your mask on when it starts raining. \n\nWhen you get to the Urals, tell them Moscow is still alive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal game, but the acting (regardless of language) and cutscene animations are kind of weird and awkward. 9.5/10 overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(note, I have over 80 hours combining Metro Exodus and the Enhanced Edition)\n\nAbsolutely phenomenal game.\n\nThe story is so rich, the graphics are absolutely beautiful, and the game is short enough to be playable for a person with a packed schedule. If you're a fan of anything apocalypse-related, I would recommend this game.\n\nMy only complaint is that you have to always pay attention, because if you miss a bit of dialogue then you can miss out on side quests, weapon upgrades, and morality points\n\n 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is a little bit buggy but the story is so fucking peak!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing through the trilogy I can say without a doubt that metro is my favorite game series, I love every moment these games have to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\n• Good gameplay\n• Large maps\n• High-quality graphics\n• Addition of new game mechanics\n\nCons:\n• Change in Miller’s appearance\n• Reworked mutant graphics appear already in Moscow; the explanation of a “different type of mutation” feels illogical since we are still in Moscow\n• Save system – the game does save, but when loading it sometimes places you elsewhere or up to 20 minutes back, even though the save timestamp shows only 5 minutes ago (I'll probably get a bad ending because I don't have the patience to do it correctly five times in a row.\")\n• Miller has prosthetics from the start; it would be more interesting to first see him in a wheelchair and gradually show him getting back on his feet (could include 1–2 extra missions)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metro Exodus is easily the biggest and best game of the series; all the hard work and development 4A Games built up since 2010 culminates in an expansive and poignant adventure with just a few small stumbles along the way.\r\n\r\nSome time after Metro Last Light, Artyom clings to the hope that a better life exists beyond the underground tunnels. By chance, him and his wife Anna discover a fully functioning train and a long-buried truth that has been hidden for decades. A long journey begins as Artyom, Anna, Colonel Miller and the rest of the Order set out to find a new home. The story is certainly the best yet with a genuinely likeable and charismatic group of characters. From a writing standpoint, Anna has been vastly improved from the last entry and there is a greater sense of hope that compels you onward.\r\n\r\nBut the developer didn't stop there; they drastically expanded the scale and scope of the levels, taking some inspiration from Metal Gear Solid 5 and other open-world titles. The Volga River and Caspian Desert chapters are both brilliant showcases of building landscapes that feel real. There are no tickbox objectives, tedious busywork or pointless collectables. Everything has been hand-crafted from bandit camps to the main missions. It all blends so well with the franchise's deep immersion and completionists will gladly explore every nook and cranny.\r\n\r\nThe gameplay remains as visceral and engaging as ever with a few important tweaks. The bullet economy is gone, replaced by a handy crafting system. With tons of different weapons, attachments, repairs and upgrades, you have more free rein over your chosen armaments. The stealthy approach is also much more viable with the day/night cycle feeding right into your infiltration. There's a good balance between humans and monsters in combat and the title still packs plenty of tension with Artyom's fragile health pool.\r\n\r\nIt has some issues here and there, namely some ocassionally clunky movement and a lacklustre boss fight or two, but Metro Exodus is a must-own for all fans of shooters, horror and atmospheric immersion. There's no doubt that 4A are at the top of their game and I'm looking forward to what they put out next. The Two Colonels and Sam's Story DLC packs are also worth getting to expand things further.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the people who are crashing, try running with direct x 11 not 12.\nGood game though it needs more testing and bugs fixed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ru: Великолепная игра и лучшая одна из лучщих частей в серии игр Metro! Игра оставила много впечатлений и жмоций от прохождения!\n\nEn: A magnificent game and one of the best installments in the Metro series! The game left a lasting impression and a lot of angst!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this is a really great game. The enhanced edition runs great, but if your PC can only handle the classic edition or you're a person like me who wants to get all the achievements in both, be prepared for a lot of crashes freezing and bugs. Most of the times when the game freezes it completely locks your screen to the point where only available option is hard restart of your PC. Caspian chapter is the biggest problem had to play through that chapter for the 5th time because i'm trying to finish the game in iron mode and with each crash i have to start from the beginning. The game it self is great so i'm still giving it thumb up, but the classic edition is borderline unplayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Настоящий герой, Слав, это не тот, кто в сияющих доспехах и красивой позе. Герой — тот, кто делает, что нужно сделать.\r\nИ запачкаться приходиться, и кровь проливать, а он всё равно делает, потому что так надо. Мужик — он потому и мужик, что это понимает...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game overall; however, I am slightly disappointed because I expecting this  to be fully open-world experience, whereas it is predominantly linear ....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterful game, perhaps the best purchase I've made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it really is an immersing game, loved the story aspects and even today graphics looks top notch. never was a fan of apocalypse stories till this game, it really is one of a kind. Maybe thats just me cuz I havent tried stalker tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its refreshing a change on the usual,maybe not so \"metro \" as usual,but its a well executed change with the little details that makes the big diference",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not really a big fan of FPS games. I'm more into sim/building games. But I really enjoyed Metro Exodus and the two extra chapters. The option to be stealthy with human foes made for some great tactical game play. The attention to details in general was great and there was a surprising level of character/story development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommended, yes. but keep this in mind\n\n7/10 IF the game work properly.\nwth is BugTrap? I don't have any 3rd party program(if that the case) on my rig, let alone have any program run in background except STEAM, tried disable STEAM in-game overlay and it work Once! of all 46 games I played, this is the first and only one that have a problem, when the game crashed it not even let me Alt+f4 to close, I have to restart my pc. other games before and after this one is work FINE.\n\nunlike the first two, some change are good and some don't\nchange from press E to hold E to interact with some object is annoying, like to open heavy door is okay but just to pick up drop? it obstacle for fast pacing moment which is one of strong point of the Metro.\n\nin the highest difficulty(I think?, cuz I don't get it while playing on normal) they force you to listen almost the entire conversation of enemies, especially when playing stealth, if I break/knock/kill one, the glitch came in, no knock/kill prompt appear for next target even while alarm is not raise.\n\nrun, jump or climbing ladder is frustrating sometimes, can't walk normally up stair without sliding back or get slow down with no reason, jumping not gonna work properly when needed, slightly over jump can drift you far away or drop dead if it happened around the cliff's edge and it suck the most when it happen while play on IronMode \n\nwhen hardcore removed HUD is challenging but E was not work properly, it frustrating af. also the game auto save work less often than I expected, it not even save after visit the workbench or get out of the bed/base, I explore the map a bit then something go south, it loaded back to a save an hour ago. auto saved file can even corrupted itself.\n\nall and all, play on normal difficulty is FINE to the end\nbut upper difficulty while the game is limited itself, many thing is not the same\n\nachievement\nfor finding postcard(maybe the dairy too) have to collect in one playthrough, chapter select work, yes. but if start \"new game\" with no Plus, the achievement on STEAM will reset\nnew game+ modifiers, there is no way to check what else modify you select after start if you forget them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good overall storyline (have not read the books) in a coherent and consistent world. Challenging and varied gameplay (indoors & outdoors). Stable software (single freeze up early on)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to sit back and relax with a solid background story (normal mode).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good storyline and i will repeat to play this game again..good team work developer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the story...  Worth playing twice to get the good and the bad ending.  Runs well on silicon valley Mac, at least the Mac Studio....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am writing this just after completing the game(enhanced edition, idk why normal edition's playtime is displayed). And I would say the ending quite shook me to the core. (In a good way). A perfect conclusion to the trilogy, no wonder this is inspired from a book and it does great amount of justice to the time you invest in playing this trilogy. The game is visually pleasing and provides an immersive gameplay experience so much so that you get in the shoes of the main character. I really liked how Artyom does not utter a single word in the whole game apart from game loading screens.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, reminds me of The Last of Us. I love how its open world and theres multiple quest lines you can go on and you get to choose what you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good, I liked the experience and immersion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic Story rich game, Love it. Altho there are some bugs i've encountered in chapter Volga and Caspian which are follows:\r\n1) sometimes knock out or kill prompt doesn't appear on time or appears very late or don't at all.\r\n2) in caspian chapter, before falling down while driving if i exit the car, the death leading animation don't come, which means i survived instead of dying BUT my use button by default \"F\" key stopped working at all. I can't open anything, enter car, turn lights on or off etc OFC no knockout too, it's like i'm living soul or ghost.\r\n3) in side mission of taking care of sniper in Caspian chapter, once i acquire sniper scope and enemy reinforcement arrived they can attack me behind metal wall with ease no matter how good i am hiding, i'm talking about right side near to the stairs. They can hit me there even behind wall of cabin, but not on left side near ladder and zip-line.\r\n\r\nother than that game is worth playing. I must say i will rate 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Es buenisimo, pero es el peor de la saga es de lo mejorcito de la industria y mas con los otros dos anteriore , un 8.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Criminally underrated and absolutely worth playing.\r\nThe story is deeply emotional and beautifully told, the gameplay is smooth and engaging, and the environments are rich and diverse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm on my 2nd play-through (got the bad ending the 1st time and I'm going for the good ending) \nWhat to even say? This is likely one of the best games ever made. Sure it has flaws, but it makes up for them by being so damn immersive and engaging. I don't want to spoil anything but I will say: this is not a \"true open world\". That being said, it is still so damn good that I started my 2nd play-through right after finishing my 1st, which is EXTREMELY RARE for me. It's just so damn good, I missed a lot of stuff on my first play-through while also spending nearly 10 hours just exploring Volga! Just so damn good. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely a 10/10.  The Metro series is an under appreciated game series in the story driven, post apocalyptic genre.  This is the 3rd installment, where the hero, his wife, and comrades escape a post nuclear Moscow, where they have been living underground. They escape to the greater world, where much adventure awaits.  Despite the Russian setting, it is actually a Ukrainian production.  There are many cultural touches, one of the most basic is that they escape and journey by train rather than car.  The game play, combat, and settings are all top notch and creative, but for me it is an engaging plot and characters as they struggle together that keeps me coming back.  i've replayed this game more often than i should have.  The DLC's, especially Sam's story, are first rate and worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best overall Metro game. I would like more Metro though and less open world. Also the driving and the boat is not good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I have ever played. Absolutely stunning, perfectly post-apocalyptic. Pulls you in from the start like the rest in its trilogy, incredibly immersive, incredibly good. There is something beautiful about this game I find hard to describe, from the characters to the environments, just something about it makes it one of a kind. Truly one of the few 10/10 games out there, and a work of pure art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unbelievable attention to detail, atmosphere and passion. Must play if you're into story/horror survival games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Overall 8.8/10.\nThe only negatives for me are the sometimes clunky movement and AI which is either very good or quite the opposite on higher difficulty but it can as well be ignored.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've recently decided to play through all 3 Metro games more or less back to back. I have finished 2033 a bunch of times, same thing with Last Light. Exodus I stopped playing the first time, more or less halfway through the third open world-ish area of the game, and have not touched it for a few years. I held the firm opinion, that the Metro games kept getting worse with every installment. And while I think in a way, that is true, I think objectively speaking, Exodus is better than Last Light at least.\n\n2033 will forever be my favorite, Exodus does not even get close. \nLast Light is fun and obviously shares the same amazing atmosphere. \nAnd then Exodus is better than I originally gave it credit for, but still falls flat in a lot of areas.\n\nPersonally, I think the narrative of the Metro GAMES was always kinda weak. I've not read the books... YET, but from what I've been hearing, the first game, 2033, followed the book the most closely, and is the one Dmitry Glukhovsky worked alongside the closest, and I think you can tell. Artyom being a silent protagonist is rather silly, it will always be silly, there was never a time in gaming history, where a silent protagonist was better than a voiced one, specifically when the same character in the books is nowhere near a silent protagonist. And the dark ones continuing to try to communicate with humanity, despite it obviously being very unhealthy for us, is also kind of a ???, because its clearly been established, that they aren't evil, and intelligent enough to understand that they are hurting us. So I don't understand, why they'd provoke us, by continuing to attempt to communicate with us? I don't really feel as bad about shooting the missiles at them, as the game probably wants me to. Because in a way its like, what did they think would happen? \"Every encounter with these people has ended with them either dead, crazy or hospitalized. I am sure they do not hold any grudge towards us\". So the narrative as it is told through the game is kinda eh, but I do appreciate the attempt, and if a few core things were rewritten, it would genuinely be really cool conceptually. \n\nLast Light is a little more coherent in some aspects, and I think the larger focus on the Metro as multiple micro-nations is definitely really cool, but it suffers from similar problems.\n\nExodus' story is... not amazing, if you treat it as 1 large story, but if you treat chapters as individual stories, the perception changes quite a bit. \nThe first area, the Volga, is cool, and really hits you with a similar atmosphere, to what S.T.A.L.K.E.R. had. The no-electricity fish cult is neat, but a little shallow. I also think its akward that they're using weaponry made using machinery, aka, electricity. I think it'd be cooler, if they had like, handmade weaponry, such as a handgonne maybe. Firearms that you could have realistically made without power tools.\nThe Yamantau bunker is such abysmal dogshit narratively, its actually insane. Rarely have I seen someone fuck up that bad. Literally the only redeeming quality of Yamantau is, that it was a fun shooting gallery, that was about it. Other than that, it was just silly, thats all it was. It was cartoonish, and not in a good way. Some of the notes you can pick up especially, just make you feel embarrassed for whoever wrote those. Imagine writing something for a game, and you deadass put \"M mmm MMa ma me mme me mmmeeeeat\" into a note. You know, because the people of Yamantau are cannibals? You get it?... Yeah, this is genuinely so bad. Yamantau could have been such a cool area, if the developers simply... toned it down... A LOT. I think it would have been really memorable, if the cannibals were calm and collected, maybe even playing along with the idea, that they are the remaining government, until they actually manage to get you to bring the train there, and you end up having to save everybody. Instead, its just the average Black Ops: Zombies map...\nThe second open world-ish area of the game, the Caspian, is also cool, but genuinely just too long. This is most likely very not true factually, but it feels as if the Caspian part of the game, is like 60% of the entire experience. I am not playing Metro, so that I can walk/drive through a desert, for who knows how long. I think the baron is kind of funny, because he got a similar relationship to us, as Rais from Dying Light had with the protagonist, which is, that its just kinda one sided. Its like that meme with the lion shouting at the monkey, who's just kinda looking at the lion in a smug way. I think they could have done a bit more with the resistance against the baron, because we didn't actually do too much overall, aside from one very obvious point, which I guess wasn't even necessarily our doing.\nThe third and last open world-ish area of the game, the Taiga, is probably my favorite, genuinely. Not just do I think that the faction there is really interesting, but I am also VERY happy, that out of all 3 open world-ish areas, its the least open one. Metro, as the name suggests, plays, or at least played, inside a Metro system, aka, you could probably not get any more linear, by design, if you tried. So when I started Exodus for the first time, and was met with semi-open worlds, I was immediately put off. I thought the Taiga was a good compromise between open world, and the linearity that the Metro franchise is known for. Aside from the borderline forced non-lethal stealth, which was partly so ass due to my inability to quicksave, due to playing on ranger hardcore, there isn't too much I have to complain about in the Taiga.\nThe last area of the game, the Dead City, is definitely one where Metro showed once more, at what it truly shines, which is linearity and atmosphere. Going through the Dead City feels almost surreal, which was most likely the intention. I also don't actually have too much of a problem with [spoiler]Miller's death[/spoiler]. Often the issue is, that games will try to forcefully make a [spoiler]characters death sad[/spoiler], which often just ends up making it feel silly. And while the like, epiphany that Artyom has, after returning from the Dead City, where you talk to [spoiler]Miller's ghost, where he actually tells you something new, somehow, aka, clear proof that straight up super natural things exist in the Metro universe, aside from just strange anomalies[/spoiler], is rather silly. His actual [spoiler]death[/spoiler] was done really well, and made sense. Its very believable that [spoiler]his old ass body, simply couldn't deal with these crazy amounts of radiation[/spoiler].\nI think the actual ending ending is a little too abrupt, personally, I wouldn't have minded if, instead of [spoiler]Miller's ghost somehow telling them where to go[/spoiler], we would have had maybe 10 - 20 minutes more of walking around and watching cutscenes, and listening to dialogue, until Artyom and the gang find a nice place to live by themselves. Maybe with a little cutscene where its like \"8 months later\", and you can clearly see Anna being pregnant, and then the camera fades to black. That would have been a pretty cool ending, I think.\n\nOverall, I'd give Metro Exodus an 8/10. Originally, the first time I tried playing through it, I would have probably given it a 6/10, but now that I actually gave it a chance, I'd say its definitely worth playing, especially if you enjoy post-nuclear soviet settings, which personally, I am a sucker for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A true immersive game with great story telling. Very well written, though sometimes the autosaves seems to currupt time to time and it gets flusterating when one time it works normaly and the other it doesnt, but over all very excalent game. Same goes for \"Last light\" and \"2033\" both are amazing. Very recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this is one of the best post-apocalypse games & stories I have ever found.  There are also some levels of the game that felt & how exploring them offered you a variety of useful tools, upgrades, & attachments.\n\nGameplay - (9/10) - I like the way you can switch between combat and stealth, but you also almost always end up trying to scrape up every bit of ammo you find which honestly is very fitting for the game's world.\nEnvironment (10/10) - I am a bit biased with this, but I love post-apocalypse environments. There is a surprising amount of detail in everything in this game. The graphics are also very pretty. even if they can make a good pc stutter a bit. \nStory (10/10) - You get introduced to the characters & world almost seamlessly, with the lore of world being given to you in a variety of mediums. Whether it's via collectibles, the main characters dialog, optional interactions with npcs, or even just the way the environments are constructed. (I have never read the books so I have no reference to the source material, but even as a standalone story, it was great.)\nExploration (7/10) - I will say, there is a lot of land to cover when exploring the open levels, but there really isn't much to actually find. But this game series has always been more linear anyways.\n\nAnyways, love the game, probably ain't gonna play it again unless I have a lot of free time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game in nearly every aspect. The story is immersive (although I highly recommend you play the previous games to get the most out of it (in fact I would read the books if I were you, they are great as well)), the graphics are very good and the DLCs are also worth it. The only problem I have with this game is the movement, I'm not sure if it has to do with my settings, but even after 70h I still feel like I can't always aim normally or I'm going to become the next man to go to the moon when jumping over an obstacle. \r\nOverall: Highly recommend if you like the post-apocalyptic genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just know this game is pretty hard on your PC. I have a high-end setup, and it was getting hot after about 30 minutes of playing. I had to keep checking my PC’s temperature using monitoring software. It was fine overall, but not very pleasant. I’ve played heavy games like Cyberpunk and others, and this issue only seems to happen with this game. Besides that, it’s fun to play, and I recommend it if your PC can handle it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i waited so long and bought it but my grapic requirement didnt meet but now im on school laptop enoying it with most minimium requirement and boy im glad i waited",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] The Beginning of a Beautiful Friendship and the End of an Addiction [/h1]\nMetro Exodus ended up being my absolute favorite of the series and honestly one of the most stunning games I have ever played. After spending so much time in the dark tunnels of the earlier games finally stepping out into the open world felt incredible. Seeing forests deserts rivers and ruined cities instead of endless метро stations made everything feel fresh while still keeping that same heavy Metro atmosphere.\n\nThe story felt more personal than ever. Traveling with the crew on the Aurora made the world feel alive and connected. Every stop on the journey had its own mood and struggles and I actually cared about the people I was moving forward with. What made it hit even harder was how the choices you make shape the experience. The decisions you take along the way don’t just affect endings they affect characters you grow attached to and moments you don’t realize matter until it is too late. Choosing wrong can genuinely be painful and it makes every action feel personal and heavy in a way few games manage to pull off.\n\nGameplay felt like the perfect blend of survival and freedom. Exploring at your own pace sneaking through enemy camps scavenging for parts and upgrading weapons made every area feel meaningful. Resources stayed tight enough to keep tension high but never so punishing that it stopped being fun.\n\nAnd the visuals are just unreal. From sunlight breaking through ruined buildings to storms rolling over open fields this game constantly made me stop just to look around. It is the best looking game I have personally ever played and nothing else has matched the sense of immersion it gave me.\n\nMetro Exodus felt like everything the series had been building toward. It kept the heart of Metro while giving it room to breathe and grow. If you play the trilogy in order this is such a powerful payoff and hands down my favorite experience of them all.\n\nEdit: GET THE DLC'S THEY ADD SOOOOO MUCH MORE DEPTH TO THE STORY!!!\nhttps://store.steampowered.com/app/889921/Metro_Exodus__Sams_Story/\nhttps://store.steampowered.com/app/889920/Metro_Exodus__The_Two_Colonels/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do love this game and recommend playing it. with Tessellation on.\n\n\n\nthe only problem I have with this game is the time it takes after changing video settings, which can take too long like it's year 2004 hardware all over again.\nit looks like this:\n\n\nApplying Changes........................1%................................................................................................................................................................................................................................................................................................................................................2%........................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................3%................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................4%........................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................5%................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................-5%........................................................................................................................................................................................................................................................................................................................................................................................................................................................................-4%................................................................................................................................................................................................................................................................................................................................................................................................-3%................................................................................................................................................................................................-2%........................................................................................................................................................................................................................................................................-1%........................................................................................................................................................................................................................................................................fuck this game i can't change a graphic setting without this cancerous tumorous process lol. besides this mere thing, great game. even though I am at the very beginning. reviews are mostly positive so it says a lot more than my frustration with a small problem in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Content is great. Game crash is still present at the lighthouse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Radioactive Russia simulator... Do I really need to say more? 10/10 game F YEAH!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spoiler alert !!!!!!!!\n\n\n\n\n\n\n\n\n\n\n\ni love the game but i hate the ending i literaly cried if they would make a dlc were are an ending where both survive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best story game i have played, underrated game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Гра класна сюжет топ і графіка оптимізація непогана нехватає щоб в реальності москву розбомбили",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "rare game that's better than the prequels\r\nW russian developers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Metro + fantastic graphics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rarely the third game in a series is good, this game was one of them",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ima be honest i cried\n\n(Ps my low playtime is because i played this game on another pc)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few trilogies that dont lose quality over each installment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so awsome, best story mode ive played in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "забросил под конец когда в логове людоедов был, а так игра норм",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its not like Stalker. In a way its better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "two colonels chapter is enough to make a grown man cry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You get to sound the trains whistle ..... 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best story game ever played!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Trilogy, must play if you like metro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great end of metro trilogy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. What about Online Coop ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a huge fan of this series. Grounded, gritty, and immersive all around.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Average Fallout fan vs. Based Metro Exodus enjoyer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "own this on multiple system great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Husband simulator",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games ive ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved every second of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is one of the best games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "игра имба советую",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "the game keeps hardcrashing, enemies shoots you through walls, sees you through walls, and some NPCs are busted on normal mode. Nothing that is really impossible to beat, it only really begins to be a problem at certain levels of Caspian; I never ran into any of these issues before that part of the game\n\nIt really upsets me, since the game itself is not bad at all, it's actually really well made. But you can not make up for people complaining about hardcrashes for years, and never fixing it",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "What kind of game releases in 2019 with the default fov at 60 and no fov slider? No game worth buying at full price at all. Yes I know you can change it in the configs but it's super fucking annoying to do so and the various overlay effects (gas mask, injured/hurt, binocular, etc.) don't fit the fov and are super immersion breaking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game (I've beaten it on xbox as well) but there are some technical issues and hard crashes. Bugs that have existed since the game came out but have been ignored. Obviously it can be frustrating and seriously hinder the experience. Besides that though, there is a lot to like. Decent characters, decent story, better gameplay than previous titles, naturally. Easily the worst thing about all metro games is its \"choice\" system that is extremely vague and not thought out at all. It is extremely brain dead \"morality\" and there is no gameplay or characters moments that explain this BEFORE things that affect the outcome of a level happen. It's extremely frustrating and there is only a quick save option so you have to figure it out before your save is overridden if you want to go back. There is just some many annoying things about this game that really shouldn't be happening this late in the \"game\" for Metro. Biggest issue with the story is Artyom still not talking in game and it's just silly, he really needed to find his voice in this title because it seriously hinders the story. I really want to like this game more- this game should have been a minimum of an 8/10. With all its issues however I can only say its a 6/10- damn shame. Only buy on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "having to wait 5 minutes for the game to \"apply settings\" every time you change your graphics options is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashes during the developer intros. Total garbage. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved the previous Metro games and played both almost endlessly, but I don't think I can recommend this game for the people that really enjoyed the other games. I LOVE the story and atmosphere of this game, and the visuals and crafting mechanics are a good addition but holy crap can this be a slog when it comes to getting all the moral points if you want to be a \"good\" person at the end of each level, or if you like exploring everything in general. Don't get me wrong I enjoy exploring and the combat is also very fun, but running around a map maybe TEN TIMES the size of the biggest level in Last Light while having the stamina of a newborn baby gets very annoying very quickly. Sure you get a car sometimes but having to get in and out of the car after the 50th time when scavenging or exploring gets super annoying, even though its only a few seconds of an animation. If I was able to run for way longer without running out of stamina every 10 seconds or if I overall moved a bit faster I feel like it would fix this issue, but as of now I'm really not enjoying the exploration like I did in the previous titles.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would really like to have been able to enjoy this game, unfrotunately the game is unstable and prone to crashing. Which, if it happens, seems to have a VERY high likelyhood of just... Deleting/corrupting your save files. I've done the intro three times by now, it is getting really tiresome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't remember why i used to be so obsess over this game back them, either it aged like milk or it always was boring asf",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game frequently crashing on certain parts of the game i know the devs trying to ragebait me i just cant prove it\n(game is fine besides this issue)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balancing is crap you will struggle in the intro and the rest of the game is a literal breeze minus the broken stealth segments. holy crap who playtested this game? this breaks the bridge level entirely bc:\r\n\r\nThe requirements for a perfect clearing of the levels fail to trigger making a perfect game a crap shoot; you fail stealth sections without any alerted enemies\r\n\r\nevery weapon you get sucks and the level clear penalty for your material makes upgrading weapons a chore\r\n\r\nthe exploration is as shallow as can be and literally crap compared to shovelware like \"mad max\" (mad max is a bad game but at least it DOESNT PENALIZE YOU FOR THE SCRAP YOU COLLECT EVERY TIME YOU CLEAR A REGION FOR \"REPAIRS\")\r\n\r\nThe enemies are bullet sponges and playing on any difficulty higher than normal is just garbage. they shoot you from across the map in fog you cant see through then take several shots to the hear AFTER THEIR HELMET AND MASK FLY OFF\r\n\r\nI dont remember this game sucking that bad at launch and didnt review it but holy crap i cant recommend this game at all. just read the books, its sad that all of the metro games suck but they changes this to play more like stalker. like i seriously just want to wander in the wastes and collect trinkets and shoot the occasional skag/hostile scavenger, this is all just artificially difficult to pad out playtime. i remember how short this crap is and on my current playthrough i havent even stolen the strain yet and ive died 30+ times. \r\n\r\nDo not buy this game and if you do play it on normal bc its just trying to pass the 2 hour refund deadline; NOTHING you do in the rest of the game minus that stupid gas filled tunnel on the third map are as hard as this horrible intro. like they have seriously made the intro as bad as atomic hearts for some reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes at startup. Seems to be a known issue dating back a number of years, and has not been fixed by the developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "metro exodus  have so many buggy and the game freeze at random time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HAVE LOST ALL MY 10 HOUR LONG PROGRESS BY NOTHING. WHAT THE HELL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game breaking bugs prevent progression",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poo poo game. Stick with first two.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It Crashes all the Time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So overrated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I do like the game itself and enjoy it's immersion, I cannot recommend it because I'm stuck after 30 hours of play...\r\n\r\nA game-breaking glitch happened where I can not advance the story at all, despite trying everything I knew to try.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Really good game so far, but lots of obnoxious crashing, visual, and gameplay bugs. Forcing me to shutdown my computer is just annoying. Hopefully this is a me problem.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "the game keeps hardcrashing, enemies shoots you through walls, sees you through walls, and some NPCs are busted on normal mode. Nothing that is really impossible to beat, it only really begins to be a problem at certain levels of Caspian; I never ran into any of these issues before that part of the game\n\nIt really upsets me, since the game itself is not bad at all, it's actually really well made. But you can not make up for people complaining about hardcrashes for years, and never fixing it",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is a plain ok for me, followed by a couple of technical problems with it. First of all, it runs on a separate window instead of through Steam which results in various crashes, when alt+tabbing for example. Secondly, I couldn't roam the Caspian level because the vehicle was stuck between desert particles; I was unable to move it and roamed through the level on foot. \n\nStory-wise, there were a few enganging moments but nothing too serious nor it had the crisp of the other two installments in the franchise. Side-stories, additionally, felt too detached and quite \"empty\". Combat is mediocre with some erratic movements from the enemies. Point-blank range can fail and for long-range there were no distinct physics that would result in avoiding the target (or maybe I couldn't identify them)\n\nThe reason I uninstalled, and thankfully I played Two Colonels DLC first, is the autosaves that did not happen for half an hour in the Sam's Story DLC. That resulted in a huge loss of progress. However, that issue was not present in the main game and the flow was fine,\n\nOverall, I would rate this as 3/5 and 2.5 with decimals allowed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is good, but it keeps crashing and crashing and crashing AND CRASHING!!!! WHY!!\n\nWould recommend if it stops crashing before I get into the game tho...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1] Metro Exodus: A Metro game that doesn't belong [/h1]\n[h2] Intro [/h2]\nI am a long time fan of the entire Metro franchise, playing all the games it has to offer and reading plenty of the books as well. As a long time fan, I need to say that this game doesn't feel like Metro at all, it doesn't have that same vibe that the original metro or metro last light games had.\n\nThe game itself can be very clunky at times, especially with vehicles and the bunch of glitches they have. There are soft-lock issues, movement glitches and generally just bad level design at times.\n\n[h2] Game Design [/h2]\nThe game design itself is very lacking, and to me, pretty disappointing. The partial open world levels get very stale, very quick. Every level is the same, you get some more of the story, you get random quests and need to roam the map often repeating similar actions etc. It is just not very interesting and it is very, very repetitive.\n\n[h2] Morale [/h2]\nThe morale system is very bad, I went on every \"side quest\" that was morale related, like bringing back a guitar or teddy bear etc. expecting that it would be enough for a good ending, but I was SHOCKED when I finished the game and got one of the worse endings. Ends up, you need to use this games awful stealth mechanics at any time you can in order to get the good ending, which is quite absurd, considering you aren't exactly going around and killing a bunch of good people.\n\n[h2] Conclusion [/h2]\nAll in all, I can see how some people might enjoy this game, especially those that aren't necessarily long time Metro fans, but to me this game is disappointing and I cannot recommend it. For a Metro game, it should either be full open world or fully linear like usual, a semi open world level game is too hard to pull off good with a universe such as Metro.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like this game (I've beaten it on xbox as well) but there are some technical issues and hard crashes. Bugs that have existed since the game came out but have been ignored. Obviously it can be frustrating and seriously hinder the experience. Besides that though, there is a lot to like. Decent characters, decent story, better gameplay than previous titles, naturally. Easily the worst thing about all metro games is its \"choice\" system that is extremely vague and not thought out at all. It is extremely brain dead \"morality\" and there is no gameplay or characters moments that explain this BEFORE things that affect the outcome of a level happen. It's extremely frustrating and there is only a quick save option so you have to figure it out before your save is overridden if you want to go back. There is just some many annoying things about this game that really shouldn't be happening this late in the \"game\" for Metro. Biggest issue with the story is Artyom still not talking in game and it's just silly, he really needed to find his voice in this title because it seriously hinders the story. I really want to like this game more- this game should have been a minimum of an 8/10. With all its issues however I can only say its a 6/10- damn shame. Only buy on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been 6 fucking years can you guys fix the caspian level already so I can actually complete the fucking game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the previous Metro games and played both almost endlessly, but I don't think I can recommend this game for the people that really enjoyed the other games. I LOVE the story and atmosphere of this game, and the visuals and crafting mechanics are a good addition but holy crap can this be a slog when it comes to getting all the moral points if you want to be a \"good\" person at the end of each level, or if you like exploring everything in general. Don't get me wrong I enjoy exploring and the combat is also very fun, but running around a map maybe TEN TIMES the size of the biggest level in Last Light while having the stamina of a newborn baby gets very annoying very quickly. Sure you get a car sometimes but having to get in and out of the car after the 50th time when scavenging or exploring gets super annoying, even though its only a few seconds of an animation. If I was able to run for way longer without running out of stamina every 10 seconds or if I overall moved a bit faster I feel like it would fix this issue, but as of now I'm really not enjoying the exploration like I did in the previous titles.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "having to wait 5 minutes for the game to \"apply settings\" every time you change your graphics options is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would really like to have been able to enjoy this game, unfrotunately the game is unstable and prone to crashing. Which, if it happens, seems to have a VERY high likelyhood of just... Deleting/corrupting your save files. I've done the intro three times by now, it is getting really tiresome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes during the developer intros. Total garbage. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What kind of game releases in 2019 with the default fov at 60 and no fov slider? No game worth buying at full price at all. Yes I know you can change it in the configs but it's super fucking annoying to do so and the various overlay effects (gas mask, injured/hurt, binocular, etc.) don't fit the fov and are super immersion breaking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game frequently crashing on certain parts of the game i know the devs trying to ragebait me i just cant prove it\n(game is fine besides this issue)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balancing is crap you will struggle in the intro and the rest of the game is a literal breeze minus the broken stealth segments. holy crap who playtested this game? this breaks the bridge level entirely bc:\r\n\r\nThe requirements for a perfect clearing of the levels fail to trigger making a perfect game a crap shoot; you fail stealth sections without any alerted enemies\r\n\r\nevery weapon you get sucks and the level clear penalty for your material makes upgrading weapons a chore\r\n\r\nthe exploration is as shallow as can be and literally crap compared to shovelware like \"mad max\" (mad max is a bad game but at least it DOESNT PENALIZE YOU FOR THE SCRAP YOU COLLECT EVERY TIME YOU CLEAR A REGION FOR \"REPAIRS\")\r\n\r\nThe enemies are bullet sponges and playing on any difficulty higher than normal is just garbage. they shoot you from across the map in fog you cant see through then take several shots to the hear AFTER THEIR HELMET AND MASK FLY OFF\r\n\r\nI dont remember this game sucking that bad at launch and didnt review it but holy crap i cant recommend this game at all. just read the books, its sad that all of the metro games suck but they changes this to play more like stalker. like i seriously just want to wander in the wastes and collect trinkets and shoot the occasional skag/hostile scavenger, this is all just artificially difficult to pad out playtime. i remember how short this crap is and on my current playthrough i havent even stolen the strain yet and ive died 30+ times. \r\n\r\nDo not buy this game and if you do play it on normal bc its just trying to pass the 2 hour refund deadline; NOTHING you do in the rest of the game minus that stupid gas filled tunnel on the third map are as hard as this horrible intro. like they have seriously made the intro as bad as atomic hearts for some reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't remember why i used to be so obsess over this game back them, either it aged like milk or it always was boring asf",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Main character who died in the last game is suddenly alive at the start of this one despite the game keeping the same story. Should've stayed epic exclusive so I wouldn't have wasted my money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes at startup. Seems to be a known issue dating back a number of years, and has not been fixed by the developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "metro exodus  have so many buggy and the game freeze at random time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HAVE LOST ALL MY 10 HOUR LONG PROGRESS BY NOTHING. WHAT THE HELL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poo poo game. Stick with first two.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It Crashes all the Time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So overrated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I do like the game itself and enjoy it's immersion, I cannot recommend it because I'm stuck after 30 hours of play...\r\n\r\nA game-breaking glitch happened where I can not advance the story at all, despite trying everything I knew to try.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Really good game so far, but lots of obnoxious crashing, visual, and gameplay bugs. Forcing me to shutdown my computer is just annoying. Hopefully this is a me problem.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "the game keeps hardcrashing, enemies shoots you through walls, sees you through walls, and some NPCs are busted on normal mode. Nothing that is really impossible to beat, it only really begins to be a problem at certain levels of Caspian; I never ran into any of these issues before that part of the game\n\nIt really upsets me, since the game itself is not bad at all, it's actually really well made. But you can not make up for people complaining about hardcrashes for years, and never fixing it",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is a plain ok for me, followed by a couple of technical problems with it. First of all, it runs on a separate window instead of through Steam which results in various crashes, when alt+tabbing for example. Secondly, I couldn't roam the Caspian level because the vehicle was stuck between desert particles; I was unable to move it and roamed through the level on foot. \n\nStory-wise, there were a few enganging moments but nothing too serious nor it had the crisp of the other two installments in the franchise. Side-stories, additionally, felt too detached and quite \"empty\". Combat is mediocre with some erratic movements from the enemies. Point-blank range can fail and for long-range there were no distinct physics that would result in avoiding the target (or maybe I couldn't identify them)\n\nThe reason I uninstalled, and thankfully I played Two Colonels DLC first, is the autosaves that did not happen for half an hour in the Sam's Story DLC. That resulted in a huge loss of progress. However, that issue was not present in the main game and the flow was fine,\n\nOverall, I would rate this as 3/5 and 2.5 with decimals allowed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is good, but it keeps crashing and crashing and crashing AND CRASHING!!!! WHY!!\n\nWould recommend if it stops crashing before I get into the game tho...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1] Metro Exodus: A Metro game that doesn't belong [/h1]\n[h2] Intro [/h2]\nI am a long time fan of the entire Metro franchise, playing all the games it has to offer and reading plenty of the books as well. As a long time fan, I need to say that this game doesn't feel like Metro at all, it doesn't have that same vibe that the original metro or metro last light games had.\n\nThe game itself can be very clunky at times, especially with vehicles and the bunch of glitches they have. There are soft-lock issues, movement glitches and generally just bad level design at times.\n\n[h2] Game Design [/h2]\nThe game design itself is very lacking, and to me, pretty disappointing. The partial open world levels get very stale, very quick. Every level is the same, you get some more of the story, you get random quests and need to roam the map often repeating similar actions etc. It is just not very interesting and it is very, very repetitive.\n\n[h2] Morale [/h2]\nThe morale system is very bad, I went on every \"side quest\" that was morale related, like bringing back a guitar or teddy bear etc. expecting that it would be enough for a good ending, but I was SHOCKED when I finished the game and got one of the worse endings. Ends up, you need to use this games awful stealth mechanics at any time you can in order to get the good ending, which is quite absurd, considering you aren't exactly going around and killing a bunch of good people.\n\n[h2] Conclusion [/h2]\nAll in all, I can see how some people might enjoy this game, especially those that aren't necessarily long time Metro fans, but to me this game is disappointing and I cannot recommend it. For a Metro game, it should either be full open world or fully linear like usual, a semi open world level game is too hard to pull off good with a universe such as Metro.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like this game (I've beaten it on xbox as well) but there are some technical issues and hard crashes. Bugs that have existed since the game came out but have been ignored. Obviously it can be frustrating and seriously hinder the experience. Besides that though, there is a lot to like. Decent characters, decent story, better gameplay than previous titles, naturally. Easily the worst thing about all metro games is its \"choice\" system that is extremely vague and not thought out at all. It is extremely brain dead \"morality\" and there is no gameplay or characters moments that explain this BEFORE things that affect the outcome of a level happen. It's extremely frustrating and there is only a quick save option so you have to figure it out before your save is overridden if you want to go back. There is just some many annoying things about this game that really shouldn't be happening this late in the \"game\" for Metro. Biggest issue with the story is Artyom still not talking in game and it's just silly, he really needed to find his voice in this title because it seriously hinders the story. I really want to like this game more- this game should have been a minimum of an 8/10. With all its issues however I can only say its a 6/10- damn shame. Only buy on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been 6 fucking years can you guys fix the caspian level already so I can actually complete the fucking game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the previous Metro games and played both almost endlessly, but I don't think I can recommend this game for the people that really enjoyed the other games. I LOVE the story and atmosphere of this game, and the visuals and crafting mechanics are a good addition but holy crap can this be a slog when it comes to getting all the moral points if you want to be a \"good\" person at the end of each level, or if you like exploring everything in general. Don't get me wrong I enjoy exploring and the combat is also very fun, but running around a map maybe TEN TIMES the size of the biggest level in Last Light while having the stamina of a newborn baby gets very annoying very quickly. Sure you get a car sometimes but having to get in and out of the car after the 50th time when scavenging or exploring gets super annoying, even though its only a few seconds of an animation. If I was able to run for way longer without running out of stamina every 10 seconds or if I overall moved a bit faster I feel like it would fix this issue, but as of now I'm really not enjoying the exploration like I did in the previous titles.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "having to wait 5 minutes for the game to \"apply settings\" every time you change your graphics options is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would really like to have been able to enjoy this game, unfrotunately the game is unstable and prone to crashing. Which, if it happens, seems to have a VERY high likelyhood of just... Deleting/corrupting your save files. I've done the intro three times by now, it is getting really tiresome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes during the developer intros. Total garbage. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What kind of game releases in 2019 with the default fov at 60 and no fov slider? No game worth buying at full price at all. Yes I know you can change it in the configs but it's super fucking annoying to do so and the various overlay effects (gas mask, injured/hurt, binocular, etc.) don't fit the fov and are super immersion breaking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game frequently crashing on certain parts of the game i know the devs trying to ragebait me i just cant prove it\n(game is fine besides this issue)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balancing is crap you will struggle in the intro and the rest of the game is a literal breeze minus the broken stealth segments. holy crap who playtested this game? this breaks the bridge level entirely bc:\r\n\r\nThe requirements for a perfect clearing of the levels fail to trigger making a perfect game a crap shoot; you fail stealth sections without any alerted enemies\r\n\r\nevery weapon you get sucks and the level clear penalty for your material makes upgrading weapons a chore\r\n\r\nthe exploration is as shallow as can be and literally crap compared to shovelware like \"mad max\" (mad max is a bad game but at least it DOESNT PENALIZE YOU FOR THE SCRAP YOU COLLECT EVERY TIME YOU CLEAR A REGION FOR \"REPAIRS\")\r\n\r\nThe enemies are bullet sponges and playing on any difficulty higher than normal is just garbage. they shoot you from across the map in fog you cant see through then take several shots to the hear AFTER THEIR HELMET AND MASK FLY OFF\r\n\r\nI dont remember this game sucking that bad at launch and didnt review it but holy crap i cant recommend this game at all. just read the books, its sad that all of the metro games suck but they changes this to play more like stalker. like i seriously just want to wander in the wastes and collect trinkets and shoot the occasional skag/hostile scavenger, this is all just artificially difficult to pad out playtime. i remember how short this crap is and on my current playthrough i havent even stolen the strain yet and ive died 30+ times. \r\n\r\nDo not buy this game and if you do play it on normal bc its just trying to pass the 2 hour refund deadline; NOTHING you do in the rest of the game minus that stupid gas filled tunnel on the third map are as hard as this horrible intro. like they have seriously made the intro as bad as atomic hearts for some reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't remember why i used to be so obsess over this game back them, either it aged like milk or it always was boring asf",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Main character who died in the last game is suddenly alive at the start of this one despite the game keeping the same story. Should've stayed epic exclusive so I wouldn't have wasted my money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes at startup. Seems to be a known issue dating back a number of years, and has not been fixed by the developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "metro exodus  have so many buggy and the game freeze at random time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HAVE LOST ALL MY 10 HOUR LONG PROGRESS BY NOTHING. WHAT THE HELL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poo poo game. Stick with first two.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It Crashes all the Time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So overrated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I do like the game itself and enjoy it's immersion, I cannot recommend it because I'm stuck after 30 hours of play...\r\n\r\nA game-breaking glitch happened where I can not advance the story at all, despite trying everything I knew to try.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Really good game so far, but lots of obnoxious crashing, visual, and gameplay bugs. Forcing me to shutdown my computer is just annoying. Hopefully this is a me problem.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "the game keeps hardcrashing, enemies shoots you through walls, sees you through walls, and some NPCs are busted on normal mode. Nothing that is really impossible to beat, it only really begins to be a problem at certain levels of Caspian; I never ran into any of these issues before that part of the game\n\nIt really upsets me, since the game itself is not bad at all, it's actually really well made. But you can not make up for people complaining about hardcrashes for years, and never fixing it",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is a plain ok for me, followed by a couple of technical problems with it. First of all, it runs on a separate window instead of through Steam which results in various crashes, when alt+tabbing for example. Secondly, I couldn't roam the Caspian level because the vehicle was stuck between desert particles; I was unable to move it and roamed through the level on foot. \n\nStory-wise, there were a few enganging moments but nothing too serious nor it had the crisp of the other two installments in the franchise. Side-stories, additionally, felt too detached and quite \"empty\". Combat is mediocre with some erratic movements from the enemies. Point-blank range can fail and for long-range there were no distinct physics that would result in avoiding the target (or maybe I couldn't identify them)\n\nThe reason I uninstalled, and thankfully I played Two Colonels DLC first, is the autosaves that did not happen for half an hour in the Sam's Story DLC. That resulted in a huge loss of progress. However, that issue was not present in the main game and the flow was fine,\n\nOverall, I would rate this as 3/5 and 2.5 with decimals allowed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is good, but it keeps crashing and crashing and crashing AND CRASHING!!!! WHY!!\n\nWould recommend if it stops crashing before I get into the game tho...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1] Metro Exodus: A Metro game that doesn't belong [/h1]\n[h2] Intro [/h2]\nI am a long time fan of the entire Metro franchise, playing all the games it has to offer and reading plenty of the books as well. As a long time fan, I need to say that this game doesn't feel like Metro at all, it doesn't have that same vibe that the original metro or metro last light games had.\n\nThe game itself can be very clunky at times, especially with vehicles and the bunch of glitches they have. There are soft-lock issues, movement glitches and generally just bad level design at times.\n\n[h2] Game Design [/h2]\nThe game design itself is very lacking, and to me, pretty disappointing. The partial open world levels get very stale, very quick. Every level is the same, you get some more of the story, you get random quests and need to roam the map often repeating similar actions etc. It is just not very interesting and it is very, very repetitive.\n\n[h2] Morale [/h2]\nThe morale system is very bad, I went on every \"side quest\" that was morale related, like bringing back a guitar or teddy bear etc. expecting that it would be enough for a good ending, but I was SHOCKED when I finished the game and got one of the worse endings. Ends up, you need to use this games awful stealth mechanics at any time you can in order to get the good ending, which is quite absurd, considering you aren't exactly going around and killing a bunch of good people.\n\n[h2] Conclusion [/h2]\nAll in all, I can see how some people might enjoy this game, especially those that aren't necessarily long time Metro fans, but to me this game is disappointing and I cannot recommend it. For a Metro game, it should either be full open world or fully linear like usual, a semi open world level game is too hard to pull off good with a universe such as Metro.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like this game (I've beaten it on xbox as well) but there are some technical issues and hard crashes. Bugs that have existed since the game came out but have been ignored. Obviously it can be frustrating and seriously hinder the experience. Besides that though, there is a lot to like. Decent characters, decent story, better gameplay than previous titles, naturally. Easily the worst thing about all metro games is its \"choice\" system that is extremely vague and not thought out at all. It is extremely brain dead \"morality\" and there is no gameplay or characters moments that explain this BEFORE things that affect the outcome of a level happen. It's extremely frustrating and there is only a quick save option so you have to figure it out before your save is overridden if you want to go back. There is just some many annoying things about this game that really shouldn't be happening this late in the \"game\" for Metro. Biggest issue with the story is Artyom still not talking in game and it's just silly, he really needed to find his voice in this title because it seriously hinders the story. I really want to like this game more- this game should have been a minimum of an 8/10. With all its issues however I can only say its a 6/10- damn shame. Only buy on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been 6 fucking years can you guys fix the caspian level already so I can actually complete the fucking game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the previous Metro games and played both almost endlessly, but I don't think I can recommend this game for the people that really enjoyed the other games. I LOVE the story and atmosphere of this game, and the visuals and crafting mechanics are a good addition but holy crap can this be a slog when it comes to getting all the moral points if you want to be a \"good\" person at the end of each level, or if you like exploring everything in general. Don't get me wrong I enjoy exploring and the combat is also very fun, but running around a map maybe TEN TIMES the size of the biggest level in Last Light while having the stamina of a newborn baby gets very annoying very quickly. Sure you get a car sometimes but having to get in and out of the car after the 50th time when scavenging or exploring gets super annoying, even though its only a few seconds of an animation. If I was able to run for way longer without running out of stamina every 10 seconds or if I overall moved a bit faster I feel like it would fix this issue, but as of now I'm really not enjoying the exploration like I did in the previous titles.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "having to wait 5 minutes for the game to \"apply settings\" every time you change your graphics options is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would really like to have been able to enjoy this game, unfrotunately the game is unstable and prone to crashing. Which, if it happens, seems to have a VERY high likelyhood of just... Deleting/corrupting your save files. I've done the intro three times by now, it is getting really tiresome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes during the developer intros. Total garbage. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What kind of game releases in 2019 with the default fov at 60 and no fov slider? No game worth buying at full price at all. Yes I know you can change it in the configs but it's super fucking annoying to do so and the various overlay effects (gas mask, injured/hurt, binocular, etc.) don't fit the fov and are super immersion breaking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game frequently crashing on certain parts of the game i know the devs trying to ragebait me i just cant prove it\n(game is fine besides this issue)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balancing is crap you will struggle in the intro and the rest of the game is a literal breeze minus the broken stealth segments. holy crap who playtested this game? this breaks the bridge level entirely bc:\r\n\r\nThe requirements for a perfect clearing of the levels fail to trigger making a perfect game a crap shoot; you fail stealth sections without any alerted enemies\r\n\r\nevery weapon you get sucks and the level clear penalty for your material makes upgrading weapons a chore\r\n\r\nthe exploration is as shallow as can be and literally crap compared to shovelware like \"mad max\" (mad max is a bad game but at least it DOESNT PENALIZE YOU FOR THE SCRAP YOU COLLECT EVERY TIME YOU CLEAR A REGION FOR \"REPAIRS\")\r\n\r\nThe enemies are bullet sponges and playing on any difficulty higher than normal is just garbage. they shoot you from across the map in fog you cant see through then take several shots to the hear AFTER THEIR HELMET AND MASK FLY OFF\r\n\r\nI dont remember this game sucking that bad at launch and didnt review it but holy crap i cant recommend this game at all. just read the books, its sad that all of the metro games suck but they changes this to play more like stalker. like i seriously just want to wander in the wastes and collect trinkets and shoot the occasional skag/hostile scavenger, this is all just artificially difficult to pad out playtime. i remember how short this crap is and on my current playthrough i havent even stolen the strain yet and ive died 30+ times. \r\n\r\nDo not buy this game and if you do play it on normal bc its just trying to pass the 2 hour refund deadline; NOTHING you do in the rest of the game minus that stupid gas filled tunnel on the third map are as hard as this horrible intro. like they have seriously made the intro as bad as atomic hearts for some reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i can't remember why i used to be so obsess over this game back them, either it aged like milk or it always was boring asf",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Main character who died in the last game is suddenly alive at the start of this one despite the game keeping the same story. Should've stayed epic exclusive so I wouldn't have wasted my money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes at startup. Seems to be a known issue dating back a number of years, and has not been fixed by the developers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "metro exodus  have so many buggy and the game freeze at random time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HAVE LOST ALL MY 10 HOUR LONG PROGRESS BY NOTHING. WHAT THE HELL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poo poo game. Stick with first two.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It Crashes all the Time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So overrated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While I do like the game itself and enjoy it's immersion, I cannot recommend it because I'm stuck after 30 hours of play...\r\n\r\nA game-breaking glitch happened where I can not advance the story at all, despite trying everything I knew to try.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Really good game so far, but lots of obnoxious crashing, visual, and gameplay bugs. Forcing me to shutdown my computer is just annoying. Hopefully this is a me problem.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "the game keeps hardcrashing, enemies shoots you through walls, sees you through walls, and some NPCs are busted on normal mode. Nothing that is really impossible to beat, it only really begins to be a problem at certain levels of Caspian; I never ran into any of these issues before that part of the game\n\nIt really upsets me, since the game itself is not bad at all, it's actually really well made. But you can not make up for people complaining about hardcrashes for years, and never fixing it",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is a plain ok for me, followed by a couple of technical problems with it. First of all, it runs on a separate window instead of through Steam which results in various crashes, when alt+tabbing for example. Secondly, I couldn't roam the Caspian level because the vehicle was stuck between desert particles; I was unable to move it and roamed through the level on foot. \n\nStory-wise, there were a few enganging moments but nothing too serious nor it had the crisp of the other two installments in the franchise. Side-stories, additionally, felt too detached and quite \"empty\". Combat is mediocre with some erratic movements from the enemies. Point-blank range can fail and for long-range there were no distinct physics that would result in avoiding the target (or maybe I couldn't identify them)\n\nThe reason I uninstalled, and thankfully I played Two Colonels DLC first, is the autosaves that did not happen for half an hour in the Sam's Story DLC. That resulted in a huge loss of progress. However, that issue was not present in the main game and the flow was fine,\n\nOverall, I would rate this as 3/5 and 2.5 with decimals allowed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is good, but it keeps crashing and crashing and crashing AND CRASHING!!!! WHY!!\n\nWould recommend if it stops crashing before I get into the game tho...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1] Metro Exodus: A Metro game that doesn't belong [/h1]\n[h2] Intro [/h2]\nI am a long time fan of the entire Metro franchise, playing all the games it has to offer and reading plenty of the books as well. As a long time fan, I need to say that this game doesn't feel like Metro at all, it doesn't have that same vibe that the original metro or metro last light games had.\n\nThe game itself can be very clunky at times, especially with vehicles and the bunch of glitches they have. There are soft-lock issues, movement glitches and generally just bad level design at times.\n\n[h2] Game Design [/h2]\nThe game design itself is very lacking, and to me, pretty disappointing. The partial open world levels get very stale, very quick. Every level is the same, you get some more of the story, you get random quests and need to roam the map often repeating similar actions etc. It is just not very interesting and it is very, very repetitive.\n\n[h2] Morale [/h2]\nThe morale system is very bad, I went on every \"side quest\" that was morale related, like bringing back a guitar or teddy bear etc. expecting that it would be enough for a good ending, but I was SHOCKED when I finished the game and got one of the worse endings. Ends up, you need to use this games awful stealth mechanics at any time you can in order to get the good ending, which is quite absurd, considering you aren't exactly going around and killing a bunch of good people.\n\n[h2] Conclusion [/h2]\nAll in all, I can see how some people might enjoy this game, especially those that aren't necessarily long time Metro fans, but to me this game is disappointing and I cannot recommend it. For a Metro game, it should either be full open world or fully linear like usual, a semi open world level game is too hard to pull off good with a universe such as Metro.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like this game (I've beaten it on xbox as well) but there are some technical issues and hard crashes. Bugs that have existed since the game came out but have been ignored. Obviously it can be frustrating and seriously hinder the experience. Besides that though, there is a lot to like. Decent characters, decent story, better gameplay than previous titles, naturally. Easily the worst thing about all metro games is its \"choice\" system that is extremely vague and not thought out at all. It is extremely brain dead \"morality\" and there is no gameplay or characters moments that explain this BEFORE things that affect the outcome of a level happen. It's extremely frustrating and there is only a quick save option so you have to figure it out before your save is overridden if you want to go back. There is just some many annoying things about this game that really shouldn't be happening this late in the \"game\" for Metro. Biggest issue with the story is Artyom still not talking in game and it's just silly, he really needed to find his voice in this title because it seriously hinders the story. I really want to like this game more- this game should have been a minimum of an 8/10. With all its issues however I can only say its a 6/10- damn shame. Only buy on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been 6 fucking years can you guys fix the caspian level already so I can actually complete the fucking game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the previous Metro games and played both almost endlessly, but I don't think I can recommend this game for the people that really enjoyed the other games. I LOVE the story and atmosphere of this game, and the visuals and crafting mechanics are a good addition but holy crap can this be a slog when it comes to getting all the moral points if you want to be a \"good\" person at the end of each level, or if you like exploring everything in general. Don't get me wrong I enjoy exploring and the combat is also very fun, but running around a map maybe TEN TIMES the size of the biggest level in Last Light while having the stamina of a newborn baby gets very annoying very quickly. Sure you get a car sometimes but having to get in and out of the car after the 50th time when scavenging or exploring gets super annoying, even though its only a few seconds of an animation. If I was able to run for way longer without running out of stamina every 10 seconds or if I overall moved a bit faster I feel like it would fix this issue, but as of now I'm really not enjoying the exploration like I did in the previous titles.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "having to wait 5 minutes for the game to \"apply settings\" every time you change your graphics options is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I would really like to have been able to enjoy this game, unfrotunately the game is unstable and prone to crashing. Which, if it happens, seems to have a VERY high likelyhood of just... Deleting/corrupting your save files. I've done the intro three times by now, it is getting really tiresome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes during the developer intros. Total garbage. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What kind of game releases in 2019 with the default fov at 60 and no fov slider? No game worth buying at full price at all. Yes I know you can change it in the configs but it's super fucking annoying to do so and the various overlay effects (gas mask, injured/hurt, binocular, etc.) don't fit the fov and are super immersion breaking.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game frequently crashing on certain parts of the game i know the devs trying to ragebait me i just cant prove it\n(game is fine besides this issue)",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}