{
  "positive": [
    {
      "review": "An excellent horror game, but the most interesting part was in the house. \nPersonally, I found the episode on the ship boring.\nAnd probably the biggest downside is the monotonous monsters.\n\n7/10.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Resident Evil 7 is one of my favorite entries in the series. It’s a true reboot that brought back the classic horror and survival atmosphere fans loved in the early games. The story pulls you into the terrifying world of the Baker family, where every step could be your last.\n\nThe gameplay change is the biggest shift — the series moved to a first-person perspective, making the horror feel closer and more personal. The focus is now on exploration, limited resources, and constant tension, rather than pure action.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This is the game that brought Resident Evil back to life for a reason. The game is awesome!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Resident Evil 7: Biohazard’s shift in perspective and its Texas-Chain-Saw-Massacre-inspired setting intensify the scaremmersion, with unexpected twists that heighten an already gripping story in a nightmarish return to classic survival horror.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "RE 7 was an incredible journey from start to finish. What struck me the most was the psychological depth of the story. The game doesn’t rely only on jumpscares or gore; instead, it builds an unsettling narrative that slowly gets under your skin. I was fully immersed from the very beginning, and the tension never really let go. Every twist hit at the perfect moment and kept me completely hooked.\n\nThe world-building is another major highlight. The environments, small details, and characters all work together to create a story that feels carefully constructed and genuinely thought-provoking. You can feel that every room, note, and encounter has a purpose, and that makes exploring incredibly rewarding.\n\nThe DLCs also deserve a mention, they're a must-play. They add great post-game content that feels meaningful rather than just extra filler, and they gave me even more appreciation for the whole game.\n\nIf I had to point out one weaker part, it would be the section on the ship. It slows down the pacing and drops a bit of the tension that the game builds so well elsewhere. It’s not bad, just noticeably less gripping compared to the rest.\n\nOverall, Resident Evil 7 is another excellent entry in the saga. Finishing it at 100% was absolutely worth it, and I’d highly recommend it to anyone who wants a tense, atmospheric, and memorable horror experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A tight, unsettling survival horror. The Baker house is insanely atmospheric and the tension never lets up. A disturbing, memorable experience from start to finish. Must play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely worth experiencing.  A triumphant return for Resident Evil",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is my favorite and first game that truly got me into the resident evil franchise. \n\nI think Ethan being a blank slate character just make things feel all so relatable and adds more to the realism. This wouldn't be a horror game if you cannot feel your character's anxiety.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Resident Evil 7: Biohazard\r\n👍 “Ethan Must Die” more like I Must Cry\r\n\r\nThis game made me question my life choices.\r\nMain story? 10/10 immersive, terrifying even my pants filed for early retirement.\r\n\r\nBut then I tried to 100% it.\r\nEthan Must Die appeared like a cursed relic from hell.\r\nRandom guns. Random loot. Random trauma.\r\nI’ve seen slot machines with better odds.\r\n\r\n50 attempts later, I’m no longer a man…\r\n I’m a molded creature powered by caffeine and regret.\r\nMy family stopped asking what I’m doing. My dog looks disappointed.\r\nEvery time Ethan dies, a piece of my soul leaves my body and joins the Baker family.\r\n\r\nWould I recommend it?\r\nAbsolutely. It’s a masterpiece.\r\nWould I play “Ethan Must Die” again?\r\nOnly if Capcom pays for my therapy.\r\n\r\n🔥 10/10 Ethan died, I died, we all died.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is a very scary and horrifying experience but it plays very well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The shift from third person to first person makes this Resident Evil the scariest in the franchise by far! Until Resident Evil 9 comes out this is the scariest game I think I've ever played, at least on my first playthrough. Get it to experience this masterpiece before 9 comes out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a tough journey I had been gone through this game. Highly recommended for those who likes the psychological horror genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best story games i played .... anyone might notice some glitches rarely but over all its worth it 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not a survival horror expert by all means, but this game is really good. Keeps you on the edge of your seat most of the time. It does not try to scary you with cheap tricks like screamers. Instead it creates tension with limited resources and really makes you feel like you're completely alone in the abandoned house somewhere in the swamps with little to no idea of what the hell is going on and how to simply survive those horrors beyond comprehesion. One of Capcom's finest. 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Omg this is such a good resident evil game it has perfect diversity between action and horror, the storyline and the bakers, it adds up so well and its really fun to play aswell 10/10 recommend so bad for everyone:) awesome game def worth buying too",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very good RE game, Surely my favourite after RE4 Remake. I would recommend this to players who like horror and action. this game is true thriller. but the ship section is the worst. its like a 2/10 section on a 10/10 or even 11/10 game. but everything else is good and very enjoyable.9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been a long time Resident Evil fan and have played basically all of them except for some of the more obscure ones. With that in mind, I honestly think that 7 was a fine addition to the franchise and made for a unique and enjoyable experience. Scuffed Chris Redfield notwithstanding of course. I just recently played through this game again and enjoyed it just as much as I initially did. When the game was first announced, I was admittedly skeptical that the game's formula wouldn't translate well to a first person perspective, but I was pleasantly surprised that it worked well. Of course, it doesn't play like your average Call of Battlefield CE FPS so don't expect slide canceling and drop shotting. What you'll get is a good first person horror experience that is a fun ride in a unique setting. I give this game 7 Chris Redfield Boulder Punches out of 7.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good setup and great gameplay about third of the way through the story. Then it speeds up so that you don't get bored having to deal with the same 2 common types of monsters. \nLooking great even 8 years after the release. Sound design is great as well.\nStory is neither here nor there for me. It felt more skewed to \"just stupid\" than \"so stupid it's funny\" that we come to expect from RE. It has some good moments and some very, very boring clicnes.\nIt doesn't really connect to any other RE in a meaningful way. Remove couple of documents and rename one character and it would be a game in it's own competently built world.\n\nGood game in general. Well worth the time.\n\nP.S. DLC sucks.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is very fun at the beginning and its events were really exciting and even scary.\nHowever, as I progressed, some parts became a bit boring and more action than horror.\nStill, overall, it’s an enjoyable game.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This one feels like a haunted house ride designed by someone who actively enjoys watching you panic. The shift to first-person completely transforms the series’ vibe—it becomes claustrophobic, personal, and uncomfortably intimate. The Baker family is easily one of the most memorable groups of antagonists in the franchise. You never feel safe in their house; every creak and shadow keeps you alert in that deliciously miserable horror-game way. The pacing dips a bit in the final chapters, but the overall experience is intense and surprisingly emotional. If you like your horror slow, atmospheric, and sweaty-palmed, this is a standout entry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(+) Its something different totally Resident Evil franchise before. As a RE player, i liked the new gameplay and new something story. Graphics is awesome\r\n(-) Not Action anymore, Not RPG anymore. Its real Horror game. I dont like about this changed and too many puzzle !\r\n\r\nRATE : 7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hate being chased and cant with horror games, still i try sometimes\nturned to the mighty xqc for the gameplay\nit looked good, in many ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My life got ruined by this game, it is very addicting and I can't stop playing.\r\nEverything is perfect (besides the End of Zoe DLC.)\r\nWelcome to the family son.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best recently released resident evil's i honestly wish i could replay it with that same energy of not knowing what was around every corner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Ambiance is good, the gun play ain't bad.\r\nThe Boss fights are Easy, too Long, and Boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GENUENLY A SCARY game and i love it the story lore and everything is good W game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First actual horror game and it didn't disapoint, highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 7: Biohazard marks a bold and terrifying return to the series’ survival horror roots. By shifting to a first-person perspective, the game plunges players directly into the claustrophobic and unsettling world of the Baker family, delivering an intensity and immersion rarely seen in horror games.\r\n\r\nThe atmosphere is pitch-perfect: every creaking floorboard, shadowy hallway, and grotesque detail contributes to a constant sense of dread. The game’s visuals and sound design are exceptional, combining to make even familiar settings feel deeply menacing.\r\n\r\nGameplay emphasizes survival and careful strategy. Ammo and resources are scarce, forcing players to think before they act and heightening the tension of every encounter. Puzzles and exploration are intelligently designed, rewarding curiosity while maintaining a constant sense of vulnerability.\r\n\r\nThe story is gripping and horrifying, blending psychological terror with body horror in a way that feels fresh yet unmistakably Resident Evil. The Baker family, particularly Jack Baker, are unforgettable antagonists whose presence keeps players on edge throughout.\r\n\r\nOverall, Resident Evil 7: Biohazard revitalizes the franchise with a terrifying, immersive experience that balances horror, story, and gameplay flawlessly. It’s a must-play for both longtime fans and newcomers seeking a true survival horror thrill.\r\n\r\nRating: 9.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall, Resident Evil 7 is a pretty intense ride. Coming from Resident Evil 2 remake, this one definitely hits way harder in the scare department, even if the first-person view makes some of the boss fights feel a bit awkward. The DLCs are a mixed bag, some fun, some not really my thing, but they’re unique enough to keep things interesting. \r\n\r\nAll in all, it’s a solid horror experience that’s worth checking out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The scariest thanksgiving game of all time, even after a speedrun I was still scared by some of the events that happens within the game. A lot of secrets to uncover, as well as a good amount of side content as well. Overall, would still recommend it to anyone that wishes to go though with this game during the season of Thanksgiving, and truely be apart of the family.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RE7 is an incredible survival horror game. Of all of the Resident Evil games that I have played, it contains the least action, but is better for it, as it really shines best when exploring its dark, twisted setting. The best section of the game involves going through the large Baker house - a dilapidated estate in Louisiana Bayou. It's a truly inspired setting, and Capcom nailed the Southern Horror vibe incredibly well - it's extremely authentic and believable. The attention to detail is amazing, and it's the most memorable haunted house/house of horrors setting in any media that I've been exposed to. The story is excellent, and very intriguing, as you piece together why Ethan is there, what's really going on, and what happened to the Baker family. They're extremely memorable villains and very menacing as well. Also, even nearly 9 years after release, at the time of writing, the game looks incredible. Up close, some of the character models are showing age, but in the moment-to-moment, the visual fidelity is awesome and the performance is incredible. I also enjoyed the 1st person setting much more than I thought I would - I think it's absolutely necessary for the kind of game they crafted, and it is more immersive than the 3rd person RE games, by necessity, as that's really what you're getting here - a very engaging and immersive horror experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after almost 140h pretty much, since i also played it on console, i can honestly recommend re7 with my whole chest; it’s one of those games that somehow manages to be creepy as hell but still kinda.. soothing? like you’re walking around this disgusting mold-infested nightmare house, but your brain’s just locked into that “ok let me solve this entire building like it’s one giant nerd puzzle” mode. the pacing hits that perfect spot too: chaos one minute, then you’re standing there staring at a weird shadow puzzle feeling like einstein because you rotated a plastic bird correctly. the whole game turns into this satisfying loop of “survive, explore, uh oh, puzzle time,” and it scratches that exact itch of horror mixed with logic.\nidk, it’s just one of those games where even when you’re stressed, you’re vibing,  like a cozy panic. and if you’re a puzzle/atmosphere nerd like me, it’s honestly peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MASTERPIECE. It's the most scary game of the franchise. I'm not a speedrunner but I'm really thinking about speedrunning this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whenever I seen the game for the time I only had a ps4 an I heavily loved and enjoyed the game. Now that i have my PC I was able too have the same experience that I a long time ago. Thank you Capcom for making such a wonderful game and others like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game has a pretty middling story, a pretty terrible protagonist, and it sort of falls off in the second half. There are no puzzles which go beyond ‘find three different colored things to open the thing door,’ and there is almost nothing in this game which does not exist outside of decades old, well established horror tropes.\n\nDespite all of that, this game is STILL A BANGER. Yeah my wife is a bitch and has crazy spaghetti hair, I don’t even give a damn its still a banger. Yeah the second half is much worse than the first half, you know what other game has an even worse second half? DARK SOULS, and that game? Yeah chat, you guessed it, BANGER.\n\nEthan Winters is a dipshit and I cannot excuse his actions but the rest of the cast are really good. Jack Baker is so scary and his actor put in 110% effort, getting chased by him can wildy swing between pee-my-pants terrifying and pee-my-pants funny. Him laughing and giggling while stalking you, and going “I seeee youuuuuu!” when he spots you, what an incredible character and enemy design. (Ethan ruins it, of course, whenever he opens his mouth but Jack is still my goat.)\n\nPast Jack, it is not quite as good, but still enjoyable. Big ups to Margy, I killed that damn bug bitch but she seemed nice. Lucas is a shithead who pussed out after I got through all his coward ass traps but thats okay I forgive him. I actually found the decision between my wife (i think her name was Mia, idk) and Zoe to be difficult. Let me lay it out for you.\n\nMia Pros:\nMy Wife\nKissed me\nKnown her for many years\n\nMia Cons: \nWeird Spaghetti hair\nLied to me about being secret umbrella agent (cringe)\nCut my hand off (wtf babe)\n\n\nZoe Pros:\nFunny\nNormal human hair (huge)\nHelps me out the whole time\nSense of humour (funny 2)\n\nZoe Cons:\nFrom Louisiana (weird accent)\nNot as funny as Jack (but nobody is, so not big deal)\n\nIn the end, I picked my wife because the other one dies anyway and my choice doesn’t matter, but it was a real moral conundrum for a moment there.\nBack to that funny thing, I think RE7 balances horror and levity really well, offsetting tense moments with spots of relief or humor, and then doubling down on the anxiety. This game is crazy spooky, and has some of the best audio design ever. The first few hours I had to take a break every 15 minutes because you are just hearing weird shit all of the time, and can’t tell exactly how far away it is; just some of the best atmosphere building in any game ever. \n\nThe music is great, the characters are really well performed (fuck you ethan) and the house is very big and very cool. I think I am going to remember this house for years to come, each and every inch of it has been etched into my mind.\n\nSo in the end, yeah, you can poke a bunch of holes in it, and critique it to shreds if you want, but instead of being a big nerd and analysing everything, I will say that I really enjoyed my experience of playing this game, and I won’t forget it for many years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a lot to say about this game. Firstly, its not like any other Resident Evil game, it's so far from the familiarity of heavy action-packed gameplay and instead focusses solely on horror, horror and horror. Biohazard 7 truly broke the mould (no pun intended) of what everyone knew the franchise was about. Aesthetically, gameplay-wise, narratively, everything about this has been carefully crafted to be it's own independent story without too much reference to the other games. This is perfect, it's a breath of fresh air and grounds the player in the world that they're in through the eyes of Ethan Winters. We're not just playing as Ethan Winters, we feel like we are Ethan Winters weaving our way through a great story with just the right amount of exposition, tension, action, and emotion.\n\nThere are hardcore fans of the Resident Evil franchise who have been there since the beginning and express their discomfort with the new direction this game took. It's so different that it doesn't actually feel like a Resident Evil title, but instead an actual horror game like Silent Hill, Still Wakes the Deep, Find Yourself, etc etc. Whether you like the game or not depends. Do you want another heavily action packed resident evil with boulder-punching Chris Redfield with an ocean of bullets, or do you want something fresh, subtle, with amazing narrative and story?\n\nPersonally, I think this is by far the best Resident Evil title ever. Though, that's mostly because the game rejuvenated the franchise and attracted new fans which contributed to the popularity of the remakes and new titles after that. That and the fact that the game is just perfect. It's a beautiful gem. If I had to give first place to any other Resident Evil game, it would be Resident Evil 4 remake, then RE8 Village and then RE2 remake.\n\nThis game is amazing and everyone should try it whether you like horror, are a resident evil fan or neither. The game is just that good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics are great.  The controls are minimal.  Death is only semi-frequent; very far from the pointlessness of the Dark Souls games.  Also, the ambience in this thing is amazing.  Very horror-centric.  It's made up for whatever the heck RE 6 was supposed to be, and wasn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing through a bunch resident evil games lately and this one really captivated me. The game play is fun, the story is interesting, and by far the art direction is fantastic. I can only describe as a blend of disgusting imagery and beautiful area design (mostly disgusting though since it takes place in Louisiana). While shorter than other resident evil games I think even without dlc this game would be worth buying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(May be spoilers) To be honest I was frustrated the first time I played the game, the 'tyrant' character is overwhelming at first, and bug type enemies can be annoying in any game. But this game is excellent, and probably the scariest in the Resident Evil series. I have played through it several times now and the intensity remains, I still get scared sometimes.\nIt helps that the difficulty level changes some things about the game loop. DLC is also excellent, with several options that add to the story.\nRuns very well for me, both on AMD and Nvidia.\nReview Score: 9.6/10\n\nStory: 9.5\nGameplay: 9.5\nGraphics: 9.5\nMusic: 10\nHorror: 9.5\nGame Time: 6-10 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far the scariest game in the series. The first person perspective makes it a lot more intense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, DLC'S are fire and all have different gameplay aspects to them I can see how this can be peoples fav game I would deff come back to this peak 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, it’s a great revival of the series, bringing back the true horror focus that Resident Evil should have never moved away from.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was reluctant to try this game due to it being in first person. Having played it now, I fully understand how this game saved this franchise. This by far is one of the best horror games that exist. A true return to form for Resident Evil. This game is a must play. DO EVERYTHING, YOU'LL HAVE FUN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game, in terms of horror it's definitely the best RE title. Atmosphere is spot on and the story is well crafted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice story, decent exploration, enough of scary moments, some puzzles. I'd say this adventure definitely worth your time and money, especially on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolute standout—easily one of the best horror experiences available right now. The atmosphere is intense, and the jump scares are expertly placed, keeping you on edge at every turn. I especially loved the addition of the first-person perspective; it adds a whole new level of immersion, and I honestly don’t understand the criticism it gets. In my opinion, this is firmly in the top five Resident Evil titles. A truly unforgettable experience. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took me a year to finish the main campaign of this game because it scared me shit-less\r\n10/10 would soil my pants again\r\n\r\nplus the free not a hero story is fun (although the graphics look so weird and faded in comparison to the main game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good experience according to me, and my favorite RE.\nGraphics - Very Good\nJumpscares- Excellent\nStory - Excellent\nCombat- Very Good\nCharacter Development- Very Good\nA must play if you are a fan of Resident evil, or outlast Franchise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un giro inesperado en la longeva carrera de la saga de Capcom que se ganó el corazón de muchos.\r\nUna atmósfera increíble que eleva el terror, que antaño se presentaba de forma ligera, y lo lleva a ser el protagonista indiscutible de esta entrega.\r\nCon guiños aquí y allá a otros títulos de la saga buscan enlazar con éxito la historia con el resto del universo y personajes.\r\nGráficos excelentes, jugabilidad notable y narrativa con subidas y bajones pero muy interesente, una perspectiva que aún no se había concebido.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the First resident evil Game I finished, and still my favorite.\nThis is a love letter to the origin of resident evil, that being the horror aspect of the games, and by god does it deliver.\nThis game is put together with so much effort that its almost surprising capcom is only asking for $20, do yourself a favor and play this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best res games, that's true. \ni like the score, the plot, the characters, and the genuine horror level, both psychological and visceral.\ni played this with my mom and she really fw it.\nmost res games aren't in any particular order in terms of major story, but play this one before 8, it'll make more sense, for Ethan's arc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Boss game..better than 5 & 6 combined...how the f**k ethan managed to father a child in village after his ordeal...that's some serious testicular fortitude..Least he didn't have to punch a boulder or 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome addition to the series - new POV and lots of scares - puzzles aren't too difficult and the story is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of mods, Abusive dad and a crazy spider woman aswell as a crazy lunatic son....... This game cannot get better 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] I ASSUME A REAL SURVIVAL–HORROR [/h1]\n[h2] –PREFACE– [/h2]\nIt is been one my favorites for a while, yet i wasn't able to beat it on madhouse difficulty switching back mid game to normal second time of playing, i still think it is quite impressive work in survival-horror terms for its time. Here are my drawbacks and upsides as of stuff which stands out:\n[h3] - - - Drawbacks [/h3]\nThere are few. Related to unskipable cutscenes, blocked backdoors as in classic horror movies, bloody 4 leg molded monster which is not really a drawback rather the thing i do not like, maybe shooting mechanic, and for some people like me MADHOUSE difficulty, especially margaret boss battle in the greenhouse. [h3] If you about to play on madhouse prep yourself heavily for this battle! [/h3]\n[h3] + + + Upsides (Now here game shines) [/h3]\n[olist]\n[*] Instantly sets up classic horror atmosphere with weird video message, arrival by car to abandoned territory, firstly silent atmosphere, stairs scene, then family introduction, that hopeful cop episode and some more.. it all screams classic (think texas chainsaw massacre, saw and maybe even jeepers creepers and outlast game).\n[*] Story. It is not much relative to previous games, but separately works perfect or near perfect, thats for i praise ethan winters installments of RE so much, because they work not as resident evil games. Toward the end it gets revealing and even dramatic with flashbacks, jack bakers confession, lab, escape through mines to guest house so geniusly, cinematic transition of eveline to its last form and finally dramatic epic ending. (Damn, even credits made me watch them and listen to that memorable nice go tell aunt rhody song)\n[*] Quite gory and amoral scenes with severed leg/hand, gut eating iconic dinner, deputys body rip off, margarett spider mutation and many more.\n[*] Bakers estate design. I do not care that much for the rest sections of the game, but the house design with all level content, secret/alter passages and details is a separate respect. Each location has something special and involving about it. One of my definite favorites is lucas' birthday quest, just brilliant.\n[*] Stealth mechanic. Which is quite essential in some parts especially on madhouse. It is more or less normally implemented, nothing special, but it nicely fits here.\n[*] DLCs. There are various and all nice i think. Some related to branches of story (end of zoe, not a hero, daughters, bedroom), and others are mini-game acrady gameplay alike (jacks's birthday, ethan must die, nightmare, and quite addictive 21). My favs likely are original branch of story with new gameplay mechanics in end of zoe, involving escape quest with margaret in bedroom and for sure deadly gambling of 21.\n[*] I could carry on with many points but here are some mechanics or takes i think made this game special: vhs tapes playthroughs, phone calls, saferoom storage for item management, cassettes for saving game on madhouse, coins and bird cages, some puzzles, codex watch, choice between two endings with relatively different consequences and some more..\n[/olist]\n[h2] –VERDICT– [/h2]\nBriefly, game is full of proper horror design, nicely settled story and ain't cheap gameplay value. Maybe its sequel comes with better visuals, locations, characters and cinematic/epic edges, i think biohazard is doing its job in survival-horror genre much better. My final word is:\n[h1] GREAT [/h1]\nP.S. [spoiler] I used to give a higher rank to this game much earlier, but upon replaying it on madhouse and being grown, perhaps some perception changed or i just stayed unsatisfied after losing margaret on madhouse, struggling with her for about couple of hours (literally), and then i just switched to normal difficulty save which i thankfully got and completed latter half of the game with second ending. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RE7 Biohazard is amazing that it was 1st person, for the first time in RE history. I liked it even if it took some time to get used to. Details are amazing and immersion is top notch as always expected from a RE game (except 1 or 2 titles [ Chris Meteor Killer] )\n\nRE7 wins the \"most horror resident evil games\" award. This here is the one that focuses the most on the horror element.\n\nWish it has been a little more longer. Only negative thing in my opinion is how short it is. However better than RE8 Village.\n\nThe new E-Virus is an awesome idea but I can see that the whole fungi thingy was probably inspired by The Last of Us, however the Mold is still unique and original. \n\nHow things evolved with Umbrella in the background and overall how the story has been pushed is awesome for the RE universe / lore. \n\nA must play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I regret not playing Resident Evil 7 sooner; this game absolutely blew me away. It’s a bold shift from the older entries, diving fully into first-person terror and embracing pure horror in a way the series hadn’t done in years. The atmosphere is tense, claustrophobic, and filled with some truly unforgettable body horror.\n\nI loved every minute of it. Honestly, this might be my favourite Resident Evil game.\n\nGameplay: https://www.youtube.com/playlist?list=PLcelqKIhYMSs35HIQ3J5zcjjexmU_o1LB",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best and scariest resident evil that has came out. 10 out of 10 would recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game- Had to get an Ultrawide mod and wish that was supported natively.  As most RE games, I strongly recommend. Great experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident evil 7 is the best horror game i have ever played. The games atmosphere and everything's just perfect I strongly recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun and scary in everyway it is even better in vr if you download the mod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is easily one of my top 10 favorite video games of all time.\r\n\r\nI have no issue putting this alongside Ocarina of Time, Symphony of the Night, etc as an all-time infinitely-replayable classic that still hasn't gotten old even after dozens upon dozens of playthroughs & hundreds of hours. \r\n\r\nI don't know what it is about the Ethan Winters duology, but this game & Resident Evil: Village are just so much fun, each in their own way. I can't recommend this game enough, & if it's your first playthrough, take it slow, look over every detail, search every nook & cranny, read every piece of lore, & I promise you, you will leave satisfied.\r\n\r\nThen, you have like 8 different pieces of DLC ranging from really fun Wave minigames to entire prequel Story modes & sequel modes, too. Wondering how all this started? Play Daughters. Wondering what happened afterward? Play Not a Hero & End of Zoe. Wondering what happened to Clancy, the ever-dependable cameraman from the tape at the beginning? Play Nightmare, Bedroom & 21. \r\n\r\nTake my word for it, as a life-long hardcore Resident Evil fan, Resident Evil 7 is a MUST-have, MUST-play title that still gets its worth even hundreds of hours in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A completely different experience from the previous titles, but still with that Resident Evil feel. Probably the scariest character is still my wife, both in the game and in real life, so I chose to save Zoe. In the end, I had to repeat it so that the DLC and the rest of RE8 would make sense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10.\nThe best first person horror game I've ever played. From the Erie main house to the gross bug cabin and the sadistic trap house, this game hits all the marks. Re-branding the Resident Evil franchise into a true horror experience not seen since the original 3 games. The bosses feel challenging but fair and the puzzles challenging at times but not overly impossible with smooth combat and gore, this game hits after hit on awesome content.\n\nThe game just doesn't stop after an awesome main experience, the DLC's are awesome. From the end of Zoe and Chris cleaning up, we get a true ending to this chapter of the story, followed by 21 a card game DLC that's engaging and horrifying without feeling out of place. \n\nNow onto the only bad thing I have to say about this game, i not the biggest fan of Mia I think she could've been flushed out as a charter more and the whole ship sections slows the game right down and just didn't need to be as long maybe could've skipped the second segment with Ethan and just had the flashback. Other than this, I have nothing bad to say about this game, truly a fantastic piece of art that is held as one of my Top 10 of all time.\n\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a very morbid-like and frightening atmosphere which makes the anxiety greater. I love all the Resident Evil series. The fact that in this RE7 it has returned to its old direction and placed its focus on fear and survival gives a very good feeling. I myself liked both the action of RE6 and the horror of 7. This game is unrivaled. Thank you <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that brought the Resident Evil franchise back to life. Had an absolute blast completing every achievement, especially the DLCs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally broke the fear factor of playing this game fully and wow was it worth it. The gameplay itself is smooth and the transition away from third person is great and makes it more immersive. Overall beating the main game and the dlc's i can confirm this is a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game that embraces all the classic Resident Evil mechanics, sure to please long-time fans.\r\nStructured into seven levels, the story evolves from a more intimate, grotesque swamp-bound house of horrors to a full-blown spectacle of paranormal and moster chaos. Did it succeed? Not entirely.\r\nWhile the experience remains consistently gripping and terrifying, the final level/sequence feels rushed and underwhelming, leaving a bittersweet aftertaste. It's a solid 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is super fun but also sad when you learn the lore would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top-notch Resident Evil game. Probably my 3rd favorite in the franchise behind RE4 (original or remake) and RE2 remake. (10/10)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't like the gameplay as much as RE2 remake (don't criticize the order I play them!!) but mannn the story is good.\r\n\r\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended by a friend, this was my first Resident Evil. I'm not familiar with horror games, having a action/gdr gaming background, so this is a newbe opinion. I think the atmosphere is great, especially in the first couple of hours. I got scared a lot, but also got a lot of tension, built up by narrow and dark places. I think the second half of the game it's lower in quality, you shoot a bit too much in my opinion and it makes you lose the wonderful feeling of impotence you had in the beginning. One thing i didn't like was the inventory system, having to go back and forth from the deposit chest gets annoying pretty fast, i just don't see the point it, especially for key items. Fun experience overall, scary, full of gore and violence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No doubt a great game, but if you really want to turn it up a notch make sure to play with the VR Mod by PrayDog. I played the PSVR version before. But the PC version with VR Mod is hands down the best way to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing horror, story and gameplay. what more can you ask for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great horror experience. Get it on sale. More of a one and done kinda game but that's because the game is based around the horror element which they nail. Fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, fun and scary, literally the best horror/survival game I've ever played, hands down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will find the man who decided to add ammo based damage to this game and force feed him to a furnace. Other than that amazing first person entry into the resident peak series. + Donuts in the garage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who ever created the blackjack mode for this game. Respectfully Go Fu** yourself guy. that mode made me divorce my wife due to the stress. 10/10 game btw.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The tape from the poster next to my desk peeled off while fighting molded. I genuinely thought  they came into my room irl\n\nGreat game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "รู้สึกพลาดมากที่ไม่ยอมเล่นสักทีมัวแต่กลัวอยู่ได้ สนุกสุดๆมุมกล้องแบบนี้คือชอบมากแต่แคบไปหน่อยโดยรวม เสวสุดๆใครไม่ลองขอร้อง ลองเถอะลดราคาก็ถูกชิบหาย",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a well-rounded game. You get a balance horror and combat. Especially the jumpscares, those were good. Storytelling is interesting if you pay attention. Documents are fun to read also. My favorite thing about the game is the characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Ascended\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, it's fun and terrifying. It plays like a Resident Evil title which makes it unique to other zombie shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They took Resident Evil series into a new direction, and majorly succeeded this time. That was amazing. Dreadful, hauntingly spooky atmosphere that I haven't seen since OG Silent Hill games. Beautiful!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been thoroughly terrified throughout the game since the start. Has a pretty good story too. Would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game the storyline is a bit questionable but its a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story and characters really stand out in this game. I feel like the story has great pace and slowly reveals itself as you plunge deeper into the madness. The characters are nuanced and relatable; their depth unfolds as the game progresses. This is just a well-crafted, creepy entry in the RE franchise. Despite my bias of being a long-time fan of the series, it's hard to find anything to knock this game for. Just solid, survival-horror fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has returned to us with everything we love: an exciting story, classic gameplay, and dark, tension-filled horror.\nI hope the company continues to focus on these elements that have revived the true spirit of the series, without introducing new main characters.\nWe just want to preserve the original atmosphere of the game that we’ve loved since the very first titles.\nIn this installment, I truly feel that Resident Evil has returned to its roots, after the differences seen in parts six and seven. 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El juego que salvó a toda una saga cuando volvieron al terror puro y duro con un personaje que es tan fracasado en el lore que ni siquiera tienen la decencia de enseñar su cara. Aún así mejor protagonista que los imbéciles de Rebecca y Billy, hostia como de negro me ponen esos gilipollas. Redfield parece un cocainómano en este juego pero al menos su DLC es gratis para concluir la historia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazingly replayable story that always keep you wanting to play more. Never a boring moment in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I picked up a teddy bear, which started to get black...\nPutted it down and used flamer to burn it down...\nDevs did not think about burning animation for it.\n0/10 ;) \n\nJokes aside, I tought it is going to be a walking sim of a horror with poor replayablity and gameplay mechanics, but it is pretty good and I am going to replay it in a future. Attention to details and some variety of possible outcomes in game surprised me. Its atmospehere is thick and jjumpscares are not the only things keeping it together.\n\nUSE CACAO+ for lighting, HBAO is bugged and the other things is poor. Also large reflections are kind of goofy, when your body or weapons move around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☑ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story, mood, pacing and the whole setting of the game was great I had a fun time with this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very scary, the main story is really good and the horror is awesome, way better than most re games also the dlc is good fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good return to form from the last main line RE6 being Action heavy based. This brings the roots back to survival horror. While the baker family leaves some to be desired they are a solid A tier introduction into this series. The main character ethan winter is not that interesting of a main character, but found the story to be interesting enough to keep me intrigued for an around 8 hour campaign. Enemy variety outside the baker family are very limited as well. Well designed jump scares, and moments to keep the tension high throughout the entirety of the game. Overall 7.5/10 on a scale which has the likes of RE4 and RE2 remakes at a 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game! I love the story and I LOVE Ethan! I just recently got the game and I am almost done with my 3rd play through and some DLC. My only complaint is I wish I had more access to chem fluid compared to gunpowder and herbs AND that Capcom gave us more story line of Ethan Winters. If you like horror, puzzles, and fighting bad guys you will love the resident evil games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best resident evil game fair warning the boat section of this game will make u blow ur brains out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "havent even beaten the first part of the game and yet i am shiting my self, this shit is peak but it aint for the weak(i am one of the weakXD). This is prob the best horror game i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh boy this game has been dusting for years in my library after finishing it for the first time back 2019, and god damn this game is still so pleasant to play.\r\n\r\nResident Evil 7 is, to me, the scariest Resident Evil to date and the best one of the franchis as an entry as well. The game is short, but really effective (you can finish this game in around 10 hours if you're exploring and reading everything, but fastest for me has been below 4 hours since it is needed for trophies).\r\n\r\nThe game is quite intense, you follow the story of Ethan Winters, that tries to find your 3 years long gone wife in the middle of Bayou... Out of nowhere ! It seems fishy but that's the intro, the game will show you many gross stuff throughout the game and the ambiance will make you be on alert at every corner of that damned house for the entirety of your night there. There is some actions next to the survival-puzzle-horror aspect that is really good, and to dig into replayability you'll have the \"wonderful\" trophies and the DLCs that actually deserves their price (Nightmares my beloved). \r\n\r\nBut what got me back into this game and pulled me beneath the water with this game, was all the lore, the story, the characters and the really strong feeling of \"why am I here in the first place ?\" because in the end of this night, you're just a civilian that got dragged into a really horrible story that gets beyond your understanding, just to, for a slight chance that might be in vain, to find your wife that was presumed dead 3 years back. \r\nAnd that made me connect to Ethan, because, I too, have lost significant others, they were there, then the next day it was like they had never existed in the first place, only to find years later a note, or a confession letter telling they left or that they just got **lled. and that link lingered through my whole 3 playthrough, and when the quote of the bad ending came there, I saw myself of the past still searching for those significant others months later their vanishing.\r\n\r\nThat's what made me want to do that 100%, A link between my story and a Fictional character's story who's just a script behind lines of codes and 3D models. This is what gaming is for me and that is the meaning for me to do a completionninst, just because I love it, and because it resonated with me.\r\n\r\nAnd I hope, if you buy this game after this review*, that you'll be able to link to Ethan, as I did, for another reason or the same ! \r\n\r\n\"When one door closes, another opens.\"\r\nNever get out of the light, be safe y'all :)\r\nPeace\r\n\r\n*as I 'm speaking right now dear buyers, the game is still in discount for 19.99 $ with the sequel RE8 that I now have to buy too lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best in the series, single-handedly revived the resident evil games. Fun gameplay, dreary, southern-gothic environments, delightfully mad characters, and all around bloody good fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "glitches and other things your going to encounter i tryed getting a key form a room that was supposed to apperar but it never did.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Now that the dust settled on RE2, and more than half a decade passed since i last played RE7, i REALLY notice how all the fun moments of this game take place on a tightly scripted roller coaster. 7 years ago i was terrified and didn't notice at all, but now standing in the one spot that the game allows me to not be seen by \"daddy\" feels very boring and over-designed. Since RE7 came out about 3 years after Alien Isolation, i really expected there to be a much more open map, or options to fight back against anyone else than the molded. After all, the invincible family promote exactly the same gameplay as the Alien: stalk and hide. \r\nAmnesia: The Bunker clearly had the same aspirations, and took a tighter designed approach to its core loop with an algorithmically randomized bunker that prompts the player to figure it out on their own, instead of bombarding them with duller and duller chase sequences.\r\n\r\nBut everytime you are allowed roam around an area at your own pace you are either set up for the next jumpscare (eta <2 minutes), or you just fight molded. Large goo guys. They have big heads that burst open on headshots. They walk as if they have a stick up their ass. And they are veeeery boring, i even remember how dull i found them when i first played it. And unlike the first RE games, there is no real way to walk by them without wasting large amounts of ammo. sad.\r\n\r\nI never made it to the ending since i heard that was where the molded stuff peaks, and i feel i've REALLY seen enough of it by now. All the best parts of this game are a tasteless and gory slasher film. Exactly what RE needed at the time, but not what i cherish about the series at all. 2/5",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I love Resident Evil franchise... and I hate this game.\nHard to explain but I don't like the FPS style for that kind of game, I think it's boring and too much \"disgusting wannabe\". I tried and quit 2 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 2 hours, the pacing feels off and the horror didn’t land for me. Might appeal to fans of slow-burn tension, but I couldn’t get into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am so happy that i pushed uninstall of this glitch after I gave it another chance...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chainsaw boss is a nerd unrealistic point in a game where you try your best to keep the game realistic and game tries its best to keep it unrealistic, that is it. Game on its own good be such a good one, shame they did not think a second about difficutly disproportion. Even with youtube tutorials this fight does not make sense so i delete this shit forever. Thanks God it is 2025 and there is so much else to be played in the series, probably at least better in way that it is allowed to not cybersporting the playthrough. Total disappointment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not the best resi game gets very boring later on",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "13 hour game is wildly small, and for triple A game, and it has almost nothing to do with actual resident evil lore, might as well be resident evil 4 story/ same for village",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst in the series I've played so far. mechanics are ass, puzzles blow, atmosphere poop, worst boss fights in the series except the first jack fight, adding on to that, most underwhelming final boss i think I've ever seen. RE2 and 4 made me expect something amazing but what I got was hot shit. first act of the game was awesome though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is my least favorite part of the RE series. It has almost no connection to the main series. It feels like it was a Saw game or something, and they slapped the RE label on it at the very last minute. \nThe additional DLC is just awful. I launch Resident Evil, and they make me play cards, then boxing, then feed Jack. The Ethan Must Die mode is pure torture. Everyone hates the 6th game, and I hate the 7th. At least the 6th was fun, but here they just bully the player.\nIf you take away the mockery of the player and call the game not RE, then it was a good game for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really love Resident Evil series and I wanted to complete my collection with the new Resident Evil games, but Resident Evil 7 makes me angry, not because it's an FPS now or a new character or different story. IT'S BECAUSE THE CHARACTER CAN'T RUN! Everything is so slow, unlike the remakes, where everything works, but, RE7 makes you angry, not because of enemies, or the story, or a new perspective, because it wasn't built as it should. I understand most reviews are positive, and I really want this series to keep on going, but if my character can't run like a normal person and make everything slower, then it's not a Resident Evil game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awful game!  Just simply terrible! No control over what the main character can do, its just like a script! Blatantly obvious that Steam pack a load of fake reviews into this platform just to get sales!  Look at the negative reviews as these are the only ones you can really trust!  Dont use Steam!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So far it has been the worst Resident Evil I have played.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you call this good but call RE6 bad you should seek medical help",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "卡普空的便秘游戏",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "modern RE sucks, play RE1 instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It gets boring after the first hour",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Survival+",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is pretty good and scary however towards the end when you have to play as mia has to be some of the worst fucking game design ive seen in a fucking video game (slight exaggeration)\n\nThis shitty segment is so god awful and un-fun that it reminds me of the MJ missions from spiderman and oh my fucking god i cant live through that shit again\n\nMold zombies are fine and a good game mechanic when there are only 2-3 of them, like in the basement. However the mia segment just packs the whole map with them and instead of giving you a shotgun or 44, they give you a fucking peashooter that takes more than 20 fucking headshots to kill a normal moldy. \nOn top of this, there are hardly any fucking heals or ammo throughout the ship so any time you get swarmed, instead of feeling suspense like you did playing as Ethan, you just feel fucking annoyed because you just used your last fucking heal when you were gang banged by 3 other moldies. \n\nIn conclusion, this game is good until the mia section, which isnt until the end so you can at least enjoy the good part of the game until then",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Now that the dust settled on RE2, and more than half a decade passed since i last played RE7, i REALLY notice how all the fun moments of this game take place on a tightly scripted roller coaster. 7 years ago i was terrified and didn't notice at all, but now standing in the one spot that the game allows me to not be seen by \"daddy\" feels very boring and over-designed. Since RE7 came out about 3 years after Alien Isolation, i really expected there to be a much more open map, or options to fight back against anyone else than the molded. After all, the invincible family promote exactly the same gameplay as the Alien: stalk and hide. \r\nAmnesia: The Bunker clearly had the same aspirations, and took a tighter designed approach to its core loop with an algorithmically randomized bunker that prompts the player to figure it out on their own, instead of bombarding them with duller and duller chase sequences.\r\n\r\nBut everytime you are allowed roam around an area at your own pace you are either set up for the next jumpscare (eta <2 minutes), or you just fight molded. Large goo guys. They have big heads that burst open on headshots. They walk as if they have a stick up their ass. And they are veeeery boring, i even remember how dull i found them when i first played it. And unlike the first RE games, there is no real way to walk by them without wasting large amounts of ammo. sad.\r\n\r\nI never made it to the ending since i heard that was where the molded stuff peaks, and i feel i've REALLY seen enough of it by now. All the best parts of this game are a tasteless and gory slasher film. Exactly what RE needed at the time, but not what i cherish about the series at all. 2/5",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "glitches and other things your going to encounter i tryed getting a key form a room that was supposed to apperar but it never did.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Resident Evil franchise... and I hate this game.\nHard to explain but I don't like the FPS style for that kind of game, I think it's boring and too much \"disgusting wannabe\". I tried and quit 2 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 2 hours, the pacing feels off and the horror didn’t land for me. Might appeal to fans of slow-burn tension, but I couldn’t get into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am so happy that i pushed uninstall of this glitch after I gave it another chance...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chainsaw boss is a nerd unrealistic point in a game where you try your best to keep the game realistic and game tries its best to keep it unrealistic, that is it. Game on its own good be such a good one, shame they did not think a second about difficutly disproportion. Even with youtube tutorials this fight does not make sense so i delete this shit forever. Thanks God it is 2025 and there is so much else to be played in the series, probably at least better in way that it is allowed to not cybersporting the playthrough. Total disappointment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not the best resi game gets very boring later on",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "13 hour game is wildly small, and for triple A game, and it has almost nothing to do with actual resident evil lore, might as well be resident evil 4 story/ same for village",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst in the series I've played so far. mechanics are ass, puzzles blow, atmosphere poop, worst boss fights in the series except the first jack fight, adding on to that, most underwhelming final boss i think I've ever seen. RE2 and 4 made me expect something amazing but what I got was hot shit. first act of the game was awesome though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is my least favorite part of the RE series. It has almost no connection to the main series. It feels like it was a Saw game or something, and they slapped the RE label on it at the very last minute. \nThe additional DLC is just awful. I launch Resident Evil, and they make me play cards, then boxing, then feed Jack. The Ethan Must Die mode is pure torture. Everyone hates the 6th game, and I hate the 7th. At least the 6th was fun, but here they just bully the player.\nIf you take away the mockery of the player and call the game not RE, then it was a good game for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really love Resident Evil series and I wanted to complete my collection with the new Resident Evil games, but Resident Evil 7 makes me angry, not because it's an FPS now or a new character or different story. IT'S BECAUSE THE CHARACTER CAN'T RUN! Everything is so slow, unlike the remakes, where everything works, but, RE7 makes you angry, not because of enemies, or the story, or a new perspective, because it wasn't built as it should. I understand most reviews are positive, and I really want this series to keep on going, but if my character can't run like a normal person and make everything slower, then it's not a Resident Evil game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awful game!  Just simply terrible! No control over what the main character can do, its just like a script! Blatantly obvious that Steam pack a load of fake reviews into this platform just to get sales!  Look at the negative reviews as these are the only ones you can really trust!  Dont use Steam!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So far it has been the worst Resident Evil I have played.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you call this good but call RE6 bad you should seek medical help",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "卡普空的便秘游戏",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "modern RE sucks, play RE1 instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It gets boring after the first hour",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Survival+",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is pretty good and scary however towards the end when you have to play as mia has to be some of the worst fucking game design ive seen in a fucking video game (slight exaggeration)\n\nThis shitty segment is so god awful and un-fun that it reminds me of the MJ missions from spiderman and oh my fucking god i cant live through that shit again\n\nMold zombies are fine and a good game mechanic when there are only 2-3 of them, like in the basement. However the mia segment just packs the whole map with them and instead of giving you a shotgun or 44, they give you a fucking peashooter that takes more than 20 fucking headshots to kill a normal moldy. \nOn top of this, there are hardly any fucking heals or ammo throughout the ship so any time you get swarmed, instead of feeling suspense like you did playing as Ethan, you just feel fucking annoyed because you just used your last fucking heal when you were gang banged by 3 other moldies. \n\nIn conclusion, this game is good until the mia section, which isnt until the end so you can at least enjoy the good part of the game until then",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Now that the dust settled on RE2, and more than half a decade passed since i last played RE7, i REALLY notice how all the fun moments of this game take place on a tightly scripted roller coaster. 7 years ago i was terrified and didn't notice at all, but now standing in the one spot that the game allows me to not be seen by \"daddy\" feels very boring and over-designed. Since RE7 came out about 3 years after Alien Isolation, i really expected there to be a much more open map, or options to fight back against anyone else than the molded. After all, the invincible family promote exactly the same gameplay as the Alien: stalk and hide. \r\nAmnesia: The Bunker clearly had the same aspirations, and took a tighter designed approach to its core loop with an algorithmically randomized bunker that prompts the player to figure it out on their own, instead of bombarding them with duller and duller chase sequences.\r\n\r\nBut everytime you are allowed roam around an area at your own pace you are either set up for the next jumpscare (eta <2 minutes), or you just fight molded. Large goo guys. They have big heads that burst open on headshots. They walk as if they have a stick up their ass. And they are veeeery boring, i even remember how dull i found them when i first played it. And unlike the first RE games, there is no real way to walk by them without wasting large amounts of ammo. sad.\r\n\r\nI never made it to the ending since i heard that was where the molded stuff peaks, and i feel i've REALLY seen enough of it by now. All the best parts of this game are a tasteless and gory slasher film. Exactly what RE needed at the time, but not what i cherish about the series at all. 2/5",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "glitches and other things your going to encounter i tryed getting a key form a room that was supposed to apperar but it never did.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Resident Evil franchise... and I hate this game.\nHard to explain but I don't like the FPS style for that kind of game, I think it's boring and too much \"disgusting wannabe\". I tried and quit 2 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 2 hours, the pacing feels off and the horror didn’t land for me. Might appeal to fans of slow-burn tension, but I couldn’t get into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am so happy that i pushed uninstall of this glitch after I gave it another chance...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chainsaw boss is a nerd unrealistic point in a game where you try your best to keep the game realistic and game tries its best to keep it unrealistic, that is it. Game on its own good be such a good one, shame they did not think a second about difficutly disproportion. Even with youtube tutorials this fight does not make sense so i delete this shit forever. Thanks God it is 2025 and there is so much else to be played in the series, probably at least better in way that it is allowed to not cybersporting the playthrough. Total disappointment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not the best resi game gets very boring later on",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "13 hour game is wildly small, and for triple A game, and it has almost nothing to do with actual resident evil lore, might as well be resident evil 4 story/ same for village",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst in the series I've played so far. mechanics are ass, puzzles blow, atmosphere poop, worst boss fights in the series except the first jack fight, adding on to that, most underwhelming final boss i think I've ever seen. RE2 and 4 made me expect something amazing but what I got was hot shit. first act of the game was awesome though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is my least favorite part of the RE series. It has almost no connection to the main series. It feels like it was a Saw game or something, and they slapped the RE label on it at the very last minute. \nThe additional DLC is just awful. I launch Resident Evil, and they make me play cards, then boxing, then feed Jack. The Ethan Must Die mode is pure torture. Everyone hates the 6th game, and I hate the 7th. At least the 6th was fun, but here they just bully the player.\nIf you take away the mockery of the player and call the game not RE, then it was a good game for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really love Resident Evil series and I wanted to complete my collection with the new Resident Evil games, but Resident Evil 7 makes me angry, not because it's an FPS now or a new character or different story. IT'S BECAUSE THE CHARACTER CAN'T RUN! Everything is so slow, unlike the remakes, where everything works, but, RE7 makes you angry, not because of enemies, or the story, or a new perspective, because it wasn't built as it should. I understand most reviews are positive, and I really want this series to keep on going, but if my character can't run like a normal person and make everything slower, then it's not a Resident Evil game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awful game!  Just simply terrible! No control over what the main character can do, its just like a script! Blatantly obvious that Steam pack a load of fake reviews into this platform just to get sales!  Look at the negative reviews as these are the only ones you can really trust!  Dont use Steam!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So far it has been the worst Resident Evil I have played.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you call this good but call RE6 bad you should seek medical help",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "卡普空的便秘游戏",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "modern RE sucks, play RE1 instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It gets boring after the first hour",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Survival+",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is pretty good and scary however towards the end when you have to play as mia has to be some of the worst fucking game design ive seen in a fucking video game (slight exaggeration)\n\nThis shitty segment is so god awful and un-fun that it reminds me of the MJ missions from spiderman and oh my fucking god i cant live through that shit again\n\nMold zombies are fine and a good game mechanic when there are only 2-3 of them, like in the basement. However the mia segment just packs the whole map with them and instead of giving you a shotgun or 44, they give you a fucking peashooter that takes more than 20 fucking headshots to kill a normal moldy. \nOn top of this, there are hardly any fucking heals or ammo throughout the ship so any time you get swarmed, instead of feeling suspense like you did playing as Ethan, you just feel fucking annoyed because you just used your last fucking heal when you were gang banged by 3 other moldies. \n\nIn conclusion, this game is good until the mia section, which isnt until the end so you can at least enjoy the good part of the game until then",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Now that the dust settled on RE2, and more than half a decade passed since i last played RE7, i REALLY notice how all the fun moments of this game take place on a tightly scripted roller coaster. 7 years ago i was terrified and didn't notice at all, but now standing in the one spot that the game allows me to not be seen by \"daddy\" feels very boring and over-designed. Since RE7 came out about 3 years after Alien Isolation, i really expected there to be a much more open map, or options to fight back against anyone else than the molded. After all, the invincible family promote exactly the same gameplay as the Alien: stalk and hide. \r\nAmnesia: The Bunker clearly had the same aspirations, and took a tighter designed approach to its core loop with an algorithmically randomized bunker that prompts the player to figure it out on their own, instead of bombarding them with duller and duller chase sequences.\r\n\r\nBut everytime you are allowed roam around an area at your own pace you are either set up for the next jumpscare (eta <2 minutes), or you just fight molded. Large goo guys. They have big heads that burst open on headshots. They walk as if they have a stick up their ass. And they are veeeery boring, i even remember how dull i found them when i first played it. And unlike the first RE games, there is no real way to walk by them without wasting large amounts of ammo. sad.\r\n\r\nI never made it to the ending since i heard that was where the molded stuff peaks, and i feel i've REALLY seen enough of it by now. All the best parts of this game are a tasteless and gory slasher film. Exactly what RE needed at the time, but not what i cherish about the series at all. 2/5",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "glitches and other things your going to encounter i tryed getting a key form a room that was supposed to apperar but it never did.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Resident Evil franchise... and I hate this game.\nHard to explain but I don't like the FPS style for that kind of game, I think it's boring and too much \"disgusting wannabe\". I tried and quit 2 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 2 hours, the pacing feels off and the horror didn’t land for me. Might appeal to fans of slow-burn tension, but I couldn’t get into it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am so happy that i pushed uninstall of this glitch after I gave it another chance...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chainsaw boss is a nerd unrealistic point in a game where you try your best to keep the game realistic and game tries its best to keep it unrealistic, that is it. Game on its own good be such a good one, shame they did not think a second about difficutly disproportion. Even with youtube tutorials this fight does not make sense so i delete this shit forever. Thanks God it is 2025 and there is so much else to be played in the series, probably at least better in way that it is allowed to not cybersporting the playthrough. Total disappointment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not the best resi game gets very boring later on",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "13 hour game is wildly small, and for triple A game, and it has almost nothing to do with actual resident evil lore, might as well be resident evil 4 story/ same for village",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst in the series I've played so far. mechanics are ass, puzzles blow, atmosphere poop, worst boss fights in the series except the first jack fight, adding on to that, most underwhelming final boss i think I've ever seen. RE2 and 4 made me expect something amazing but what I got was hot shit. first act of the game was awesome though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is my least favorite part of the RE series. It has almost no connection to the main series. It feels like it was a Saw game or something, and they slapped the RE label on it at the very last minute. \nThe additional DLC is just awful. I launch Resident Evil, and they make me play cards, then boxing, then feed Jack. The Ethan Must Die mode is pure torture. Everyone hates the 6th game, and I hate the 7th. At least the 6th was fun, but here they just bully the player.\nIf you take away the mockery of the player and call the game not RE, then it was a good game for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really love Resident Evil series and I wanted to complete my collection with the new Resident Evil games, but Resident Evil 7 makes me angry, not because it's an FPS now or a new character or different story. IT'S BECAUSE THE CHARACTER CAN'T RUN! Everything is so slow, unlike the remakes, where everything works, but, RE7 makes you angry, not because of enemies, or the story, or a new perspective, because it wasn't built as it should. I understand most reviews are positive, and I really want this series to keep on going, but if my character can't run like a normal person and make everything slower, then it's not a Resident Evil game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awful game!  Just simply terrible! No control over what the main character can do, its just like a script! Blatantly obvious that Steam pack a load of fake reviews into this platform just to get sales!  Look at the negative reviews as these are the only ones you can really trust!  Dont use Steam!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So far it has been the worst Resident Evil I have played.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you call this good but call RE6 bad you should seek medical help",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "卡普空的便秘游戏",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "modern RE sucks, play RE1 instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It gets boring after the first hour",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck Survival+",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}