{
  "positive": [
    {
      "review": "Best survival game I've had the pleasure of playing. Looking forward to any future updates/dlcs.",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "Revolutionary game that dares to ask the question: \n\n\"what if you made a survival game fun.\"",
      "voted_up": true,
      "votes_helpful": 329
    },
    {
      "review": "One of, if not the best, survival/craft games I've ever played. Bespoke of the days of half life and the SCP world; Abiotic factor is like the lovechild of both and rolled with the idea \"What if you wern't the HEV hero of half life, but a hapless scientist\". \r\n\r\nWorking to escape a resonance-cascade-like disaster heralded by a organization of cult-like humans calling themselves \"The order\"; and all of the released creatures that the order by proxy released. \r\n\r\nI couldn't reccomend this game higher.",
      "voted_up": true,
      "votes_helpful": 70
    },
    {
      "review": "Usually I don't really like survival crafting games. The whole loop of gathering resources, managing meters, and unlocking better recipes to do it all again never clicked for me. I gave Abiotic Factor a try for its Half-Life 1 inspired setting and graphics and I don't regret it. This game is great especially with a friend or two as you're using office supplies to create weapons to fight your way through the underground research facility. Besides a few moments it never really felt like a grind. Its a geat loop of exploring, scavenging, and trying not to get killed by interdimensional horrors. For the price, it's a steal, and if you've got a friend to play with, it's even better. If you're like me and are skeptical about survival games, this one's worth giving a shot",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "You know that exciting feeling in your first day in your new job? This game is that but better!\n  Yeah you get no money but you get a cool game full with interdimensional aliens, some freakish, some little cute ones, no bugs ( I got none in my playthrough), different weapons, science stuff and of course you can fish!\n  The story is well implemented through the levels and the way you progress in your craft needs, you see how your first day at your new job can be.... chaotic...\n  From the items descriptions to the graphics and the story, the game have a lot of charm, easter eggs and little details that will make you laugh a bit.\n\n  This game have [b] life [/b] not [b] half [/b] of it, worth every penny.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "[h1] Abiotic Factor – Science, Survival, and Shenanigans Underground [/h1]\n\nAbiotic Factor drops you into the sprawling underground labs of GATE, a research company packed with “the world’s greatest minds.” On your very first day, a containment breach unleashes creatures from other dimensions, trapping you and up to five fellow scientists deep below the surface. Now, survival means crafting, scavenging, and occasionally smacking monsters with office furniture.\n\nPart Half-Life, part survival sandbox, the game mixes humor, horror, and creative crafting into a surprisingly deep experience. You start with basic tools and scraps, but soon you’re inventing weapons, building base camps out of cubicle walls, and even decorating your safe zone with fridges and arcade machines. The ability to flatpack and move furniture is a particularly clever touch.\n\nWhile Abiotic Factor can be played solo, it truly shines in co-op, letting you and your friends survive the madness together. You’ll manage hunger, thirst, and even bathroom breaks (yes, really), all while exploring a maze-like facility full of clever level design, looping shortcuts, and dangerous secrets. Each area feels distinct, and venturing deeper introduces stranger worlds beyond our own.\n\nCombat can be clunky early on, and the crafting menus occasionally awkward, but the charm and depth of its systems make up for it. The writing is witty, the setting is full of discovery, and there’s a real sense of progression as you unlock new perks, gadgets, and areas.\n\nAfter 10 hours, it’s clear there’s still so much left to uncover. Abiotic Factor is one of those rare survival games that balances depth, creativity, and personality, rewarding both careful thinkers and chaotic experimenters.\n\nFollow My Curator Page: https://store.steampowered.com/curator/44271151/",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "The only game that filled a very specific gap in my heart while waiting for a certain third instalment.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of the best survival crafting games I've ever played, super slept on.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "[h2]The air feels different...[/h2]\n\nIn Half-Life you played as Gordon Freeman. In Opposing Force you played as Adrian Shephard. In Blue Shift you played as Barney Calhoun. In Abiotic Factor you play as Isaac Klei... nah.. this game is a thing of its own. Though sometimes it does feel like playing Half-Life more than Half-Life itself.\n\nSo what is Abiotic Factor? It's a highly immersive survival crafting game heavily inspired by Half-Life (with some Half-Life 2 sprinkled in). Your aim in this game is to explore, survive and escape an abandoned science facility. The survival aspect is pretty strong in this one; you not only have to manage your hunger, thirst and toilet needs, but also consider radiation, heat and cold, sickness, bleeding, etc. Oh yeah, you can also easily break your bones if you jump from a high enough distance which would otherwise feel \"not that high\" (thanks to other video games spoiling us). All of this sounds overwhelming, right? Well, surprisingly, it's not. Sometimes it's relaxing even, because there is no time limit and you can focus on building and beautifying your base instead of advancing the story. The overall game difficulty is knowledge-based, which means challenging if you go in blind (I highly recommend doing so), but becomes pretty manageable/easy once you figure it out. The lore and story bits are also top notch.\n\nI know Clair Obscur: Expedition 33 will sweep the awards this year (rightfully so), but I definitely think Abiotic Factor deserves an award one way or another. I had great fun playing it and looking forward to playing more DLCs and sequels for it. So I highly recomme...\n\n[b]GRAYSON: Hey.[/b]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "very uniquely satisfying survival game with many many little quality of life features and a really long story progression that never feels repetitive. Base building feels very fun and personalized and the whole atmosphere of the game is filled with little quips and fun details that fit the world so well. A pleasant mix of maze like corridors and branches of Black Mesa, and the mysteriousness of SCP. My only point of frustration with the game is combat in the later stages of the game where enemies really really hurt and some are really annoying to deal damage to, or kill. But if especially if you play with friends, it's still a very fun time.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This game is so insanely good its crazy\nThe amount of content you get for the price is incredible \nMy favorite survival craft I have ever played!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Filled to the brim with fun, beautifully designed levels that reward exploration, and fantastic sound design + soundtrack. A must play if you are a fun of the survival-craft genre, especially if you enjoy half-life or sci-fi action in general.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Phenomenal game. I strongly recommend it.\n\nBasically a crafting survival Half Life, and surprisingly big and rich in content. \nI played it solo but it's even more fun with friends. Just find some who have enough time and like games like this.\n\nAlso seems to be getting even more content in the future, though probably as DLCs. Mods will be very cool if they get popular since the game seems easy to grow in cool ways. Hopefully they create some official modding support later on.\n\nEdit: Hopefully they don't just pump out Homeworlds as DLC's.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A difficult but fun game. I wish the graphics were better but I suppose that it is part of the whole Half Life aesthetic the game has.\n\nRecommended if you like survival/crafting games, FPS RPGs, and the Half Life games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Imagine Half Life 1 and Project Zomboid had a baby but the baby is a scientist, architect and an artist at age 3. That's Abiotic Factor. \n\nI can't recommend this game enough, there's so much stuff in this game you really just have to experience it yourself.\n\nObviously it suffers from suvival game syndrome - you gotta farm additional crafting materials if you're playing in a group and you have to look at the wiki where to find that specific material you need to craft that one cool thing you wanted to have.\n\nIt would be nice to hover over the material that you got/need and it tells you for example: \"Drops from Dr. Phluberblop in Manufacturing\" or \"Commonly found in The Super Cool Mega Lab\".\n\nOne of my additional complaints that bothers me more than anyone else is that no matter what cosmetic you choose or what armor you wear, your first-person arms and sleeves will always be Labcoat White, which is annoying, if you look down you can see your equipped leg armor and a bit of your torso armor, but your hands always stay the same, FIX IT!!! Please. :-)\n\nOther than that, this game is phenomenal, GOTY material unironically.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The setting of the game is so much like half-life 1 but its a survival game with multipler and i love it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best survival crafting game and it's not even close.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Always aspired to become a mad scientist?\n\nOne of the view games I couldn't stop playing until the very end (and beyond). \nSo much love for detail, the weird (but good) kind of humor, and if you enjoyed HL you'll get the amazing nostalgic excitement from playing Abiotic Factor.\nIt's not only fun and creative, it implements horror elements and a SCP-esque athmosphere aswell.\n\nMuch better with a fellow mad scientist!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "tl;dr: It is a very long and sometimes tedious Half-Life 1 with crafting-survival.\r\n\r\nWhat if Half-Life wasn't linear and instead each segments of black mesa were inter-connected? What if you didn't have the almighty HEV suit? What if overcoming hurdles didn't mean solving valve puzzles or blasting through? What if Half-Life was beatable no less than 90 hours? This game answers all of those questions with \"yes\", for better or worse.\r\n\r\nGame has a story and you explore more and more of a facility, but it can be frustrating when you just want to get to the next section, so I don't recommend binging it and trying to \"casual speedrun\" it though, still, gathering some resources just to get to the next section can be very annoying and taxing on your mental health.\r\n\r\nIt's quite innovative to have craft-survival game set in a pre-made enclosed space (as opposed to procgen open-world) and somehow concept works, most of the time. It doesn't quite work when you need to collect some rarer resources since they only respawn in \"parallel universes\" or \"Anteverses\" as game calls them.\r\n\r\nSome of the game mechanics and very specific things are non-intuitive so prepare to visit the wiki or do your own \"research\" on item descriptions, maybe you're smarter than me and you'll figure some things out on your own.\r\n\r\nI wish my friends were playing this game (with me).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A game where you can make your friends eat shi. Literally. That alone is worth a thumbs up, bruh.\n\nBut seriously, though, the game is funky, weird, awkward and yet quite cool.\n\nGameplay-wise think of your classic half-life 1 crossover with some survival game w. deep craft mechanics, where you need to craft armor, consume the food and build a base. \n\nStory and the world takes a lot of inspiration from multiple universes, like (once again) half-life, SCP, maybe a bit of stargate sprinkle even? \n\n(minor spoilers below) \nThe premise itself claims that \n[spoiler] you work as a newcomers in a non-governmental secret science facility, which learned how to open portals to different dimensions. That allows us to make scientific wonders and advances humanity's technology level at light speed. The most unusual objects are taken from such worlds and are kept inside the facility under a huge reliable lock. Think of your SCP objects held in cameras, w. description, safety precautions, measures to sustain & control them. \n\nHowever once the portal to another dimension opened, that connection cannot be fully closed and, what's worse, it impacts our planet too. E.g. Destruction of a distant universe might collapse our world as well. Or an (un)friendly visitor might want to check what's happening on our side of the portal, for example. \n\nNeedless to say that we're playing with fire, so when 'The Order', (a secret society of humanity protectors. Or at least that's what they call themselves) finds out about our discoveries, they immediately send the execution crew to purge everything with fire, killing all the witnesses, stopping the experiments and destroying the facility.\n\nBut something goes seriously wrong and instead of making a swift n easy win, The Order causes actual resonance cascade, a bit similar to half-life. The facility locks down, so nobody can come in, or out. \n\nNow our task is to survive and escape the facility. For that we'll have to restore facility's functionality by gathering the necessary materials via travelling to the other dimensions. \n\nEach of such worlds takes inspirations from different games by the way. Resident evil, silent hill / the mist, dark souls, black mesa's xen, to name a few.[/spoiler] \n(end of the premise part) \n\nThen again, it's not like majority of players are going to follow the storyline when they are messing with friends. And trust me, the game gives you lots of ways to troll the folks.\n\nAnyways, yes. Me like. Me recommend. Buy it! Good gaem!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really great game both as a singleplayer or multiplayer experience, survival crafting with an interesting story driven focus. Sometimes it's hilarious, sometimes it feels like a horror game. I found multiplayer to be a bit more enjoyable because you have to grind for resources and a lot of them are location specific so having more people just makes it all go a bit smoother. The level design is very good, the center of the facility acts like a hub area with trams that unlock as you progress, and lots of looping paths that connect back to main areas unlocking side doors as you go along. So many items you can craft and collect as you build up your main base and pocket bases scattered around the map. Completely worth the full price, insane deal when it goes half off.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I never played any Half Life game so I'm not really fond of the aesthetic of Abiotic Factor. I played with a friend who loved the green couches for nostalgia reasons and I told him straight up they are ugly. They are so ugly that I \"accidentally\" salvaged them and had to scour the whole map for a new set of green couches to appease him. That being said, Abiotic is AWESOME. It explores a different perspective from the tree-chopping open world survival games out there. The map is carefully designed and I can't praise the devs enough for adding QoL base features. I am really sad I finished the game twice so soon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely incredible how much they squeezed into this game. You really keep thinking \"this is gotta be it right? They couldn't possibly push this further.\" But then they just keep pushing it forward. It just keeps going, and never in a \"can we wrap it up already\" kind of way. Playing with friends was easily the most fun I had all year.\n\nHonestly, one of the best survival/crafting games I have played.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game has quickly become one of my all time favorite games\r\n\r\nit's a survival game developed by a passionate and amazing team, spearheaded by a guy who fuckin hates the genre and uses that hatred as fuel to improve the less enjoyable parts of survival. The amount of love and care is put into every single aspect of the game is astounding. \r\n\r\nstuff i love:\r\n-general gameplay loop feels smooth and well thought out. So its a great pick for an intro to the genre!\r\n-you feel yourself getting stronger throughout your playthrough. Not just in skills but also things such as utility and QoL\r\n-a massive and details map to explore with little secrets sprinkled all over the place\r\n\r\nmy only real gripes with the game are:\r\n-leveling some skills is exceedingly painful without altering sandbox settings\r\n-most starting professions quickly lose their usefulness as you progress. Making their specific skill XP buffs obsolete around the mid-game\r\n\r\nall around its an amazing game that deserves way more love than it gets!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Greatest story driven survival game ever made. Also a phenomenal deal for the price. Easy to get an 80hr playthrough solo.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Imagine playing Half Life as a scrawny scientist instead of Gordon Freeman. This is the most satisfying survival game ive played, and you can tell a lot of love was poured into it. A lot of the weapons feel great to use, and having the ability to upgrade your starting gear to keep its bonuses later on is great. Building a base in an abandoned office space just feels awesome.\n\nMy only big gripe is with the story. Once you've made it decently far, your goal of escaping GATE feels neglected, and it starts to feel like your only goal is just getting to the next area.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is truely the game that keeps on giving. And I mean this in the best way possible! We thought that this was maybe a quick 10h game but the size of this game is incredible. And it just doesn't get boring. There is so much variety in level design and mechanics.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You will lose yourself in the game, but also be lost in the facility...\n\n\n...like seriously, i've forgotten which path to get to my base, please help.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Absolutely amazing game that combines some of my favourite themes and makes it enjoyable to play. The gameplay loop is engaging, the desire to explore more and figure out more things about the situation going at the G.A.T.E. facility is always present and the game really never managed to bore me. It is perfectly playable solo OR in co-op. Also, an amazing example of a game that actually gets trough the early access phase properly! It has good roadmaps, good quality control, good contact with the community. All in all, 10/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I enjoyed the game, just finished it. The main issue i had was how the later areas lacked the fun elements of the early ones like the office, the dam, etc. Maybe the devs got tired around the end game chapters such as the Praetorium  section (which i hate cause it is a big as empty space where you have to follow corridors to point A to B then it's over). The final boss was okay, i was already done with the game around the 90 hr mark but due to how grindy it gets during the late game due to the resource gathering for armor and crafting the necessary materials to finish the quest... well, shit get's tedious. \n\nOverall I do recommend it as a solo experience (Multiplayer makes it more fun) you might need to tweak the settings to make it less tedious. I have little hope for the dlc but i dunno... we shall see.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best survival game ever created. Took me 100 hours to beat the game and I still have a lot to discover in this hand-crafted world. Every survival game I've played before kept my attention only for a couple of hours, but Abiotic Factor is so fun I'm actually addicted. Absolute 10/10 game, the developers are just amazing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "holy crap i have never reviewed this game. despite being a game releasing the same year as expedition 33. this game is a great laid back experience for you and like one other person. story rich if you love the SCP series and also being a badass scientist. the grind feels worth it and all the tasks you complete feel like they carry purpose. excited for 2.0 so i can buy all the dlc at once :3c",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For me this is GOTY and probably one of the best games in last 5 years and i have played A LOT of games!!!\r\nIt has it all : Survival mechanics, RPG elements, great story, great ambience.\r\nAlso a great tribute to Half Life full of nice gameplay ideas.\r\nI would certainly rerun it on Co op i and i am sure it will be a blast.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Why is Abiotic Factor good?  It's a Half-Life and SCP mash-up in co-op with some New Zealand sprinkles on top.  Everything about this game is good, how about that?  I bought in during early access and I DON'T regret it.  Amazing.  10/10.  Thank you, islanders.\r\n\r\nFor a more technical review, the game is a co-op survival enterprise that takes place in a secret research facility that is deep underground called GATE.  The game begins when you enter this vast complex.  When you start your own server there are many sandbox settings you can play with to tweak the difficulty and because the devs are cool, they give guidance on which settings will alter the experience from what they intended for the game originally.  Up to 6 players can join a vanilla server.  You start with nothing beyond picking a character class which might give you some passive buffs (and debuffs--to a very detailed extent) and the first character you interact with is a salty scientist who just wanted to get a coffee in the cafeteria and \"Now all hell has broken loose\", which is an understatement.  There is a lot of dark humor throughout the game as the story progresses and the progression is seamless in the sense that you need to upgrade your keycard access (an in-game item) to actually get access to deeper levels in GATE.  As you go deeper, the enemies become tougher and you learn more of the dense lore and it's a very natural feeling which is more than I can say for a lot of slop games with arbitrary difficulty curves.  I also appreciate the fact that there is a storyline to follow from beginning to end but the game doesn't force you to progress if you don't want to.  Hell, if you want to, you can just kick back and fish for hours.\r\n\r\nQuickly, it is a survival game so there is hunger, thirst, radiation (and other environmental hazards), a rest/sleep mechanic and most everything you own you have to make yourself at some kind of crafting table.  The visual style is a \"low poly\" type on par with say, Valheim, (which I also love) in fact you could say these two games are two sides of a coin--one fantasy/mythology themed and the other science-fiction themed.  I want to stress that fans of SCP lore will love Abiotic Factor for all of it's discoverable lore (there is a massive in-game journal devoted to this).  Deep Field (devs) do regular surveys of their players and continue to add content to what is obviously a passion project for them.  There is nothing to stop them from adding a new level to GATE on a regular or semi-regular basis as I know that I will eat that stuff up and I'm sure I am not alone in this.\r\n\r\nTo conclude and be concise: you should buy this game with money.  I am skipping story discussion because all you need to know is a calamity occurs in GATE and now you have to survive it.  Off you go then!  Mondays, AMIRITE?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is an exceptional survival game that draws heavy inspiration from Half-Life. It is, without a shadow of a doubt, one of the most engrossing and charming games that I have ever played. The environments are beautifully crafted, and exploring them and learning more about this world is an absolute wonder.\n\nAbiotic Factor is a funny and extremely creative sandbox experience, with a special focus on exploration and crafting, that gives you a multitude of ways to play. If you want to just get weapons and power through each zone, you can do that. If you want to spend countless hours, meticulously designing and decorating your base and building up defences, you can do that. If you want to be a nomad and keep moving around the map, you can absolutely do that as well. \n\nThere are tons of decorative pieces and craftable items for you to find, so if that’s your sort of thing, you’ll probably have a blast here. The game is quite ingenious in the way that pretty much everything that you can craft has this really unique DIY look to it. Things absolutely look like what some scientists would pull out in the event of finding themselves stranded and unsupervised, and I absolutely love it.\n\nThe combat felt clunky at first, but once I got the hang of it, it’s decent enough that it didn’t get in the way of my enjoyment. There’s a decent variety of weapons at your disposal, and, as you progress through each zone, the game keeps introducing new tools, which keep the game interesting and fun.\n\nWhat surprised me the most about the game was how the whole map is laid out. The game takes place in an underground research facility, and there are various areas of said facility that you’ll be able to explore, but what is so fascinating is how well they are interconnected. The layout makes sense, and the shortcuts are game-changing. A door that you might find early in the game might give you a direct way to access an area of the map that you’ll only be able to access much later down the road.\n\nWith all that being said, I must admit that, even though the ending leaves things open for future content, or even a sequel, it still left a bit of a sour taste in my mouth. To put it bluntly, it felt rushed, but the journey was absolutely worth it.\n\nAbiotic Factor is an absolute blast, and I’m sure that if you’re a fan of survival games, you’ll have a wonderful time here. If you’re also a fan of Half-Life, then I wholeheartedly recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Take half life mix it with crafting/base building and add in lots of SPC lore and insanity. Love this game. Don't eat the poo stew!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game I hardly heard anyone talk about - the Half-Life inspiration was very well received, the balancing of progression felt great, exploring the environments was a real treat. Overall, the game delivered far more than my expectations and is now cemented as one of my favorite survival games of all time. Looking forward to seeing the continued content updates the devs have roadmapped!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Half-Life meets SCP Foundation as a survival game in an underground facility in the Australian Outback.\nNo huge empty procedurally generated open worlds here, just handcrafted peak.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Abiotic Factor is such an amazing game, it will delight you at every turn and reward you for thinking out-of-the-box.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is highly deceptive, it seems at first glance a very simple survival game based around half life's black mesa facility but the more you play..the deeper you get, more depth is revealed.\n\nDefinitely worth the price tag in full and a true survival/adventure experience that only gets better with friends.\n\nnow excuse me..I need to use the facilities.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the funnest survival crafts I have played in years. The envrionment is amazing and really sets it apart from other survival games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is long form, with an amazing plot. It quickly made it to my top 10 games of all time. Just buy it and thank me later.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Coop game I've played in a while, and that's saying a lot, these devs deserve more love, keep up the good work guys.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best survival games I’ve played. If you want a survival game with an actual goal, a bit of humor, skill progression, and an SCP-like world, this is the game for you. The art style is also a huge standout for me. It gives strong Half-Life vibes, though  I’m pretty sure that’s part of the inspiration behind some of the game’s themes. \n\nThere are so many different sectors and “other” locations to explore, and every one of them was a delight. You can play with friends, but if you don’t have any available, that’s A-OK the game is still just as fun solo.\n\nI wish I could give this game a double thumbs up; it was that enjoyable. They also plan on releasing more content after 1.0, I’m excited to see where they take it next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I could not have foreseen this game being one of my favourite games of all time, but it has captured my love for half life and strung me along a familiar yet new experience. Such an unforgettably fun survival game this is",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Snubbed for nominations, this game blew me away simply put.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Coop half life with base crafting and survival mechanics. Seems like a really good game, too bad I never finished it because my duo left..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very interesting immersion sim take on a survival crafter genre, with map design akin to something you'd see in Metroidvanias, with lots of shortcuts that wrap entire map into itself many times over. Every area feels unique and fun to explore too.\nGame does have some issues, though, and most of them could be fixed by spending some time on adding content to vanilla game, rather than expanding the scope into DLCs. Armor progression seems slower than it should be, endgame weapons and gear lack in variety, Labs feel disappointing as an area with most of entities being locked behind closed doors, and Residence Sector and everything that comes after feels rushed with all the reskinned enemies that add nothing to the game and barely any new crafting components.\n\nGreat game, and I look forward to returning to it once it gets a good deal of content updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’m playing on Steam Deck solo and the game runs smooth with no problem. Can’t wait to unravel all the many layers. Thumbs up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is great! Put a little more work post hydroplant though. feels a bit rushed after that!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished Abiotic Factor and I loved the whole experience. The story is great, there's tons of crafting and skill building, as well as base building. You can build you base pretty much anywhere because you eventually will be able to make teleporters. I enjoyed farming, making food, building, and resource gathering. I played with my boyfriend and the guns and upgrades is what he really enjoyed. The last 3 sectors felt kind of rushed as well as the ending, I wish they made it longer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best game of the decade (no cap). I cry a little each time I have to kill a potato. RIP little buddies",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the better survival crafting games in the genre. A mix of Half-Life + SCP. \n\nExploration is very enjoyable and unlocking new areas is always fun with them sometimes opening up shortcuts back to other areas. Combat can be varied with multiple approaches to taking down enemies. Standard run and gun works but if you're a bit more creative you can set up death traps. Lore is also very interesting especially if you're into SCP content. There are a lot of systems like cooking, fishing, farming so there is always something you can do.\n\nWith the game being set in a facility you would think that eventually that you would run out of resources but the game does have a solution for that.\n\nHonestly worth it at full price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best survival crafting game I have played.\nAbiotic Factor is an excellent coop game that combines survival crafting with a linear story that has great pacing throughout.\nGrab some friends and buy this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best survival/crafting game in years, perhaps ever, bar none.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got the game to coop play with friends but as we exceeded the coop limit, luckily I have my own server and thanks to Devs actually being awesome and offering a dedicated server, guess what?\n\nI have been running a permanent world for my friends since early access!\n\nThat alone the fact you can run your own server without having to pay some \"partner\" is worth a recommendation. Keep up the good work guys and I hope you will be a good example to other Online game developers.\n\n\nStory, World and Gameplay is awesome and the fact it clearly is inspired / pays homage to the good ol' Half-Life and even its meme side? God I love it.\n\nWe started it because \"Hey that looks like joke version of Half-Life with coop and private servers!\" and then we actually well still play it so yeah if you got a few friends to vibe with, I absolutely recommend getting the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games in its genre, every time it manages to catch me off guard and ropes me in further. Came for funny Half Life 1 graphics. Stayed for the absolute 10/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love playing survival crafting games with my other half and this is a great twist on the genre. Love the horror/scp universe/half life influences. Would recommend. \"I love coffee in my coffee hole\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been on a \"retro\" game kick lately and so happy to have come across this wonderful gem! This game is great in many ways, I love the retro feel and the innovative style that allows this game to carve out its own feel! This game I highly recommend as its like nothing else I have played and I can tell so many others feel the same way! You can get lost in the fun and simplicity!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is survival-craft Half-Life, mixed with SCP. Better with friends, but still good solo. Very dynamic on gameplay settings, so you can craft your own experience. (Would recommend increasing item durability)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved every second of it, there's an enormous amount of content and exploration that is just incredible, man, it's the best survival game I've played in a good good while too, and it's so much fun in Co-Op.\n\nHighly recommended if you're a big fan of both Half-Life 1 and Project Zomboid!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TL;DR: Game is a 10/10. Do yourself a favor and just play the game. I'm not usually one for such emphatic recommendations, but Abiotic Factor checks all the boxes for me and truly deserves the high praise.\n\n...\n\nThis game is one of only four games I'd ever give a 10/10 rating to. I've been gaming for 25 years and I've not been hooked and genuinely interested in a game but for a handful of times in my life, but Abiotic Factor pulled it off and earned its place amongst the top 5 games I've ever played.\n\nAbiotic Factor is endlessly replayable despite its 'linear' story, and is packed full of charm, soul, and fun. It's a fresh take on the tired, old survival genre. It mixes multiple media inspirations into a quirky, science-y crafting survival game. And it does so in a fresh, innovative way that makes me grin ear to ear when I'm playing it. It's one of those games where I can tell the devs really do love and care about their game and community and I'm so glad that such a dev team, game, and community exists in this day and age.\n\nI cannot recommend this game enough to anyone who likes survival games. The survival elements are done well and are highly customizable, so you can have as much or as little struggle as you desire (although more granularity wouldn't hurt!). If you're a fan of the SCP universe, there's something here for you. If you liked Half-Life or Half-Life 2, there's something here for you as well.\n\nIf you like cool sci-fi stories, there's definitely something here for you. You'll probably end up waiting an hour or two between each major story beat (which are given to you through recordings of various science team members), but the downtime between each story beat is full of interesting survival and crafting gameplay, so it's not a problem at all and actually subtly enhances the effect of each shred of story you're told.\n\nWhen you first play Abiotic Factor, you have no idea what is going on. Alarms are blaring, lockdowns are in place, and a only a small handful of people are present inside the facility in which this game takes place. What happened? Who did it? Can we fix it? Can it be stopped? Am I in danger? You don't know - neither you, the player, nor your character. The game intelligently nudges you to be scientific about your approach to the game. Experiment, explore, and come up with your own ways to solve the various problems you'll run into. There's a shocking number of ways to solve a single problem. Therein lies the beauty of Abiotic Factor. It's your game, play it the way you want to, but remember who you are!\n\nAnyway, I could go on and on about this game, but I've already written a small book on it. If you've made it this far, thank you for reading! Now, if you don't mind, I have more science to do...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it when the Developers trick you into playing a different game than the one you thought you were playing. Thought i was gonna be playing Survival game with science lab theming. instead i played A narrative game about the Horrors of Unrestrained scientific Experimentation on things beyond our understanding, Reminiscent of classical Science Fiction with a side of Eldritch horror and the Occult. Loved every minute of it, Cannot wait for more, but Don't rush.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Looks like a game from 50 years ago, but once we've played the game a bit the style felt right and immersed us.\n\nThe gameplay is the best survival game I have ever played period. Every mechanic is fun, fits the world and is neither too much nor too simple.\n\nThe depth of this game is insane, we are about 40% through the story after 60ish hours, yet it doesn't ever feel like a drag because there's always new stuff to explore, read, try out and unlock.\n\nVery much recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dr. Manse, Reporting. \nAbiotic factor is potentially the best game ever. No more games need to be made, just more Abiotic factor",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is probably one of the greatest games I’ve played in the past 10 years. It brings a breath of fresh air to the survival genre and blends ideas from other great games in a really clever way. A lot of its inspiration clearly comes from Half-Life 1 & 2 and even the SCP Foundation. Honestly, that alone sold me the SCP games we’ve gotten so far have been mid at best, but this one takes those concepts and does wonders with them. You can use SCP-like entities in your base, they attack you, you explore other dimensions there’s a ton of variety.\n\nOn top of that, it has a Terraria-style progression system where you find new things that unlock new recipes. It’s also a blast with friends. I played it with my girlfriend expecting maybe 20 hours of gameplay, and I ended up getting around 80.\n\nMy personal rule for a good price-to-gameplay ratio is $1 per hour, so spending $35 and getting double that in hours was absolutely worth it. Highly recommend this for causal and non-causal gamers alike!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun survival craft game that has a good balance of story and survival elements. Lore is interesting and keeps you wanting to explore new areas of the map. Some survival games drop you into an open world where you can explore anywhere without reason. In Abiotic Factor, the map is thoughtfully crafted. New areas are unlocked in a way that connects the story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably one of my fave survival games, the story was pretty good as well, exploration was fun. More games should also let you craft from nearby chests. Base building is a bit on the shallow side, mostly just your crafting benches + chests, rarely had a need for setting up defenses. Voice acting was top notch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just buy it! Best survival game out there at the moment. Also don't forget to give him coffee for his coffee hole...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "complete mix of inspiration and one of the most memorable games I've played\r\nthe environment they created is just so well done and somehow feels nostalgic right away",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best Survival crafting games of all time. Excellent depth and interesting world, very heavily inspired by Half Life 1, with a fun sprinkling of SCP. If you're a fan of those themes and you like survival crafting games, this is a must play.\n\nIf I was to comment on downsides, I would say the game is balanced around Co-op play, so while totally playable in Solo, its very difficult in certain sections. Also the game is VERY long, if you could consider that a downside.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game both with and without friends. Theres so much to do and the progression feels really smooth, as well as all the voices, you can tell everyone fits their characters role and isn't soulless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely a very fun survival crafter with a decent story. Lots of goofy shit to invent and cobble together, too",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun, a lot more content then you expect and full of surprise. \nIt's a mix between half-life and scp in a survival game.\nI love the estethic, the story is fun, the items are goofy.\nThe coop is REALLYYYYY fun. The devs are still actively working on it.\nNo ai slop.\nThanks Deep Field Games for such an amazing game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best survival games out there. Love the atmosphere, the crafting, the mini games... \r\nI especially enjoy it because it's more of a linear style game, which they worked out quite well in a survival environment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best multiplayer survival experiences I've ever played. Survival Half Life in a world heavily inspired by SCP is such a fitting combination, and the multiplayer experience especially works so well. I'm not generally a fan of the open world survival genre, but there is just the right combination of mechanics to keep me engaged. The story being so interesting helps too. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game.\n\nFrom the style it was done in to the mechanics, i enjoyed every bit of it. The only downside i have with this game, is that iv run out of things to do in it save for improveing my base more and more. And yet i still play it now and then.\n\nEasily my favorite game this year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\r\n-The game just has a sort of magic to it\r\n-Immersive and interesting world, lore, and story\r\n-Portal worlds you temporarily travel to each have great character to them\r\n-Many things to craft; enjoyable base building\r\n-A variety of enemy types to kill and collect things from\r\n-Great jokes revolving around coffee (you'll see)\r\n-Game is of significant size\r\n-Developer finished the game since early access and has made a roadmap for future updates\r\n\r\nCons:\r\n-Furniture cannot respawn in the main world, so resource gathering is more difficult\r\n-Crafting sometimes requires too many resources",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game combining half life and SCP with unlimited potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite a unique take on the sandbox genre, heavily mixed with a linear story that lasts 50+ hours and more. Imagine a co-op Half-Life 1 where you can build and craft, with a little bit of SCP sprinkled on top. The survival elements aren’t annoying and even add some comedic moments from time to time. I wish it had better gunplay and combat, though, and NPCs with more complex AI behaviours. But all of this is carried by the impressive level design. The G.A.T.E. Cascade Research Facility feels like a (sur)real location and is fun to explore even without all the action inside.\r\n\r\nTo conclude: highly recommended, especially with friends. I’m hoping for new updates and some adjustments to the late-game content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Abiotic Factor is what happens when gamers turned developers who truly love Half-Life, Deus Ex, and SCP actually get to make the game they've imagined. The dang carbuncle is the barnacle, the tarasque is the gargantua, the freaking pest is the headcrab, exors are the vorts man! \nThe lore of this survival craft is very good, you’re a scientist in a underground facility way bigger than the 10GB leads on lol There are about six different containment failures at once and the story is told through hundreds of PDAs, emails, security logs, and intercom announcements. \n\nAlone or with friends, this game fornicates, sooo hard",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This review is going to be brief for the purpose of getting the Steam Awards Badge at Level 4.\n\nThis game is completely Divine. There are a couple bugs but it is, as far as I'm aware, a pretty small team, who've made a very large game with multiple valid playstyles, a very story rich world that's a joy to discover to dos and don'ts of. Better with a friend obviously but there's more then enough to play it all by yourself (even If I'd probably recommend mildly tinkering with the Sandbox settings.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great sandbox survival game set in a research lab, where you're an employee having to recover from a catastrophic accident. The game is great. It has co-op multiplayer & dedicated servers. The developers continue to add to the game. What's not to like?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you love Half Life 1 and the Survival gender, this game is made for you.\r\nAnd one last thing, play this game with friends !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A survival game with the spirit of Half Life and Portal.\nA blessed mix.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enjoy your first day at a secret scientific facility where everything something goes wrong and now you gotta find your way out.\nLovely marriage of Half Life graphics and feels, with SCP-like lore, and a surprising amount of exploration.\nPick your best combination of job and traits, grab your office supplies, and get rid of some pests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TLDR - This is my favourite survival game so far, and I have played a fair bloody few! If you ever wanted to try to survive a Resonance Cascade inside an SCP facility, this is the game for you.\n\nAbsolutely stunning game, loved every moment of it. The design of the world, both thematically and mechanically, works incredibly well, and I've never played a game that felt like it respected my time this much. \n\nYou'll never have those survival-game moments of having to walk for an hour just to reach the place you need to be to actually progress; the facility uses vertical space and a looping design to make sure that you're opening new shortcuts as you're progressing through the sectors. \n\nYou'll (almost) never have those moments where you lose everything and need to farm for six hours just to get back to where you were. If you die, you drop your stuff, but not the stuff you're wearing or that is on your hotbar (i.e. most of the stuff you're actually using). \n\nEach sector is interesting, enemy entities require particular solutions, and the base sieges make base building entertaining rather than a simple progress gate. \n\nMy one critique is that sometimes certain item recipes were locked behind crafting or looting a particular item that could be part of the game that you were not personally engaging with (for example, fishing).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What if you played Half Life from the perspective of a scientist trying to survive and figure things out after the resonance cascade? Also instead of aliens everything is very SCP themed? That's Abiotic Factor.\n\nYou're coming into work to do science and stuff but everything has gone off the rails. So you're coming into work, as are a bunch of friends, and you're all trying to survive, craft, and get to the bottom of the mysteries.\n\nOn one hand, if you're going in solo, it loses a lot. But with a group of 3-6, it really shines. Each player can pick a couple of things to specialize in and there's plenty of story to keep you going for a while. \n\nIt's a little janky, but charming.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Deserves more recognition, game is very fun with friends. \nLoot goblin base building game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very well made& fun to play alone or with friends. \n\nGreat game if you like survival, story & base building/customization.\n\nIf you like those things give this game a try!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you had to buy a survival game, you'd have to buy this one. One of a kind game. I can easily see companies trying to imitate the formula they have created. Looking forward to what the company has coming next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Egy kedvesen kaotikus kutatóként finoman bejárod a labor rejtett zugait, együttműködsz társaiddal, óvatosan gyűjtögeted a hasznos dolgokat, és gyengéd elszántsággal igyekszel túlélni a különös, más világból érkező lények között. Minden lépésed egy apró, hősies kaland a békés kitartás jegyében.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While I do love this game, it has its annoyances, mostly every new area is a massive maze to traverse. It IS fun to do, but makes the game draw out, which can be good and bad. It's progression scales well. Plenty of new items to unlock as you keep going which is massive. Currently at 88 hours and still have quite a bit to go with my now duo (was 3). The story isnt drawing me in super well. Mostly on how its just dialog. It just doesn't stick to me. The voice acting is well done, the graphics are what they are, not really bothersome to me. Cooking / farming was fun until it was just 2. Now i really only make what I have. No real reason to make the side dishes because we're trying to rush the rest of the game lol. It's addicting for sure, and not many bugs at all. Definitely a few, maybe 1 or 2 crashes so far. Really is a damn good game for what it is. The whole theme of it is up my alley though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game takes everything i hate about survival games and replaces it with everything i love about Half Life 1. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game and love the survival aspect of the game. Cant what to see what else could be coming out in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You should probably tweak XP values for a smoother time, but between the item grind and exploration this was a great ~80hr campaign and super fun with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good game. Actual sleeper hit. If you dont like it at first, like i did, I implore you to give it an extra 30 minutes. The game is a legit gem.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A survival crafting game with respectably deep lore and a progression system that doesn't treat you like you're dumb? Uh, count me in.\n\nIt's got some kinks to work out, sure, but it's an indie game and you can feel the love the devs put in at every turn. Plus, it keeps me from feeling the need to play Overwatch, so.... Deep Field, my life is yours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2][i] confused scientist screams [/i][/h2]\r\n\r\nGame is totally worth the price of admission. Plenty of story for lore masters, gameplay is engaging yet not unfair which makes it a very good time, be it solo or with friends.\r\n\r\nGraphics-wise, it runs under Unreal Engine 5 so I have seen more performance hitches than not due to Lumen-oriented global illumination, but without it the game looks a little too flat. With it? Oh boy.\r\nGraphics give that vibe of Half-Life games without being outright rip-offs, which really sell the environment of it being a Black-Mesa-like facility that would house SCPs.\r\n\r\nGameplay-wise, there is a lot of stuff to do, starting with base-building - which becomes a large key factor for survival, leveling and preparation for combat/exploration of the facility. Build-wise, I sort of missed the consistency with the snap-grid system that the cubicle walls have, but that was easily solved with mods. Plenty of facilities to build however, and further on the base develops an almost TD-like genre if you're not willing on defending your base on your own.\r\n\r\nCombat is quite tight, good amount of weaponry that'll give you options start-to-finish. Initially I expected to not see enough firearms for a full ranged build but I was not dissapointed after beating this game. Melee is an option too for the bonk builds.\r\n\r\nProgression is quite satisfying - altbeit a little backtrack-ey at times, - but it gives one just enough to keep one hooked to keep playing - it sure did keep me playing!\r\n\r\nThe game also supports cross-play with stationoids and game pass users, so you can co-op this with your friends - regardless of the platform!\r\n\r\nNow, this wouldn't be a review if there weren't a few criticisms. First and foremost, the aforementioned UE5 engine and Lumen lightning system usage. Nothing wrong with it, but it taxes one's PC quite heavily to deliver that global illumination, which kinda gatekeeps a lot of players out(though with some tuning, even Steam Deck players can run it).\r\nAdditionally, combat early on is a little bit of a glass cannon run until you get a hold of more armor/weapon options, especially in one particular sector that had me die repeatedly. But, if you keep your wits about, you should be fine.\r\nFinally, base-building could benefit from having unified snap-grid system, as opposed to just leaving it to cubicle walls. But like I said - a drop-in mod solved that right away.\r\n\r\nOverall, a very good game and I'm happy to see it's a candidate for the Golden Joystick awards for GOTY and best Indie of the year! Thank you and congratulations to the folks at Deep Field for making it so far with this game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The merging of survival and a throwback FPS in the style of Half Life 1 works far better than you'd expect. Both halves are fully fleshed out- The FPS part is fun and feels good, but also  provides direction and removes most grind from progression. The survival mechanics modernize the FPS side while making it keep some of the feel of the inspiration.\n\nAll in all, probably the most fun I've had with a single game in years.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "If you like first person exploration crafting style games then this might be one for you.\r\n\r\nUnfortunately, it seriously misses the mark with my crew and I.  I'm now 29 hours in and not feeling any desire to return.\r\n\r\nAbiotic Factor has a fun visual style, great humor, and a fun premise which gave all of us Half-Life 1 vibes, but it started out quite rough and only got worse from there.\r\n\r\nThe base game is so frustrating that we had to adjust many of the settings as far as item degradation and stack amounts, enemy health and respawning, friendly fire, how quickly hunger/thirst/bathroom needs/fatigue drain, the whole works.\r\n\r\nIt is a game of constantly micro-managing everything, of endlessly running around being lost looking for more supplies which you can't carry back with you because of limited inventory space.  Everything needs maintaining.  Weapons feel like they tickle enemies while they have no trouble hitting you, and good luck trying to hit them back.  Some of the melee weapons feel painlessly slow, not in animations but clicking repeatedly and having nothing happen (lightning spear.)  Projectile weapons lack any feeling or feedback and are extremely difficult to aim.\r\n\r\nTrying to figure out where to go is another nightmare because the map is useless and the objectives, not to mention how you affect the world, are often not clearly presented.  We constantly have to switch over to various wikis and videos to figure out what we're missing, or how to turn off weather anomalies while we keep getting irradiated, or any number of steps which constantly breaks immersion and adds to our frustration.  I wound up spending a large amount of my time boiling water and cooking soups because I felt so lost.\r\n\r\nThe game is built solid.  It runs smooth and never crashed on us.  It's gotten overwhelmingly positive reviews so people are obviously enjoying it.  But for the three of us this game is its own level of hell.  I can't personally recommend it, but if it seems interesting then I would encourage reading more reviews and watching some gameplay videos so you can get a better understanding of it.  Just be prepared for a lot of busy work.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I'm clearly in the minority based on the feedback here. But I just don't get the hype or appeal. I love open world survival games. I have over a dozen of them. But this just feels like a step back in almost every way. Looting isnt satisfying after a while, exploring new areas (RISE) is time consuming and gets you little to no rewards. It was well said in sequelitis that you don't want people to be like ugh I gotta go check that room in a game about checking rooms. Every new upgrade is tedious back and forthing even with us setting up portals for ourselves with extra tables. Combat is fine, but aspects of it are awful. I went a max stealth build and stealth armor. What for? The enemy barely ever loses sight of you and chases you around several corners. So much for that strat. It's an okay game but every time my buddy and I boot it we just go sigh here we go again. We aren't happy, we just want to be done. And that's now how these games should be. Maybe we are missing something? But this just isnt the game style I expected based on reviews.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "great opening, great mid game but after the mid-point of reactor the game suck ass, become grindy as fuck, no new enemies except variant upon variant, every enemies makes you fking bleed so you always need to have a terra-fuck ton of bandage, and even then you can fail the healing process, \nnear the end they just spam 15 enemies per room just to slug the fk out of the game, felt the same for shadow gate were the map is like 3 inch big and you need to make null grenade aka no fun exploration just farm, \nfarm exp bc now there's 20 fking lvl and it takes way too much time they added training equipment but its a band-aid fix to a problem they caused, at some point there's a bridge with a bradley that kinda is the boss of the zone that just shoot you with a machine gun, every shot makes you bleed and the solution to destroy it, is to grab the grenade that are down the bridge and throw them at his face, \nnever mentioned and it never happened that you needed to do smth like that and ofc they rushed the prod of the endgame so it feels super disconnected and the ending (boss&story) sucks ass , yes its only 40~ bucks but i would have preferred to pay 60 buck upfront and have the full game not rush, or finish the \"game\" early and released the last part as dlc but most player would felt betrayed so they just butchered the end of the game and called it a day.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "A very nice, grindy survival-flavoured game. Very hard recommend for people who just like to explore and/or appreciate Half-Life aesthetic and community memes or reading SCP lore. The game has a very solid atmosphere throughout most of the game and the plot is interesting to follow... All until the 1.0 content. Personally, ending feels botched and the final locations for some reason break the usual pace of adding new enemies on newer locations - they just reuse previous ones instead. The plot feels like it takes a nosedive, but that's just IMHO and I probably feel this way because most of the mystery and charm around the \"unknown\" is gone when everything is revealed. Or my expectations were just that high? \nTL;DR - Not a bad game, but it's specifically targets the Half Life and SCP fans, otherwise you might just want to play a better (co-op) survival game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A very nice, grindy survival-flavoured game. Very hard recommend for people who just like to explore and/or appreciate Half-Life aesthetic and community memes or reading SCP lore. The game has a very solid atmosphere throughout most of the game and the plot is interesting to follow... All until the 1.0 content. Personally, ending feels botched and the final locations for some reason break the usual pace of adding new enemies on newer locations - they just reuse previous ones instead. The plot feels like it takes a nosedive, but that's just IMHO and I probably feel this way because most of the mystery and charm around the \"unknown\" is gone when everything is revealed. Or my expectations were just that high? \nTL;DR - Not a bad game, but it's specifically targets the Half Life and SCP fans, otherwise you might just want to play a better (co-op) survival game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game but the optimization is terrible and makes the game rather laggy when playing co-op with anyone that doesn't have a pretty new pc. Other than that this is one of my favorite survival games I just hope they work on making it more optimized.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i've thought this game was trash. I only played it because my friends hate themselves and like pain, like this game. This game is pain. This game is also super boring and I wanted to die throughout most of it. It makes me angry and sad and angry and sad. I hate this game with a passion. I will finish it however because I hate myself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHATEVER! Note that Wand mod: is the king of fixing balance issue. \nSo many things wrong with this game I'm not going to even care to waste my time to post what they are more so it will never change how much of a waste of time to even play things that have noting to do with a great idea. Buy at your own risk, good luck you have been warned.  Also due to posting real issue and being honest all the time leads to being block by all the dev's due to they black list your reviews of truth that hurts there feelings. 11/24/25:\nNote: that their is a lot of good things in the game that makes sense and just recommend this game but no excuse for poor maps that would lead you to the objective and let the good gameplay keep you form getting their and yes their is good game play here be had but running back and forth and getting lost is not my idea of a good progressive game with little no directional points just icons that flout around and don't get me started with these slow moving transportation rails it a joke and leading you for one to another point is like writing a whole map in your head after that no replay.  The story is broken with side areas and other such things. Like for example if any one even see this other than the dev's is the point less ice area that feel like an old jump game made out of the 90's for an items that has no real reason to get it just for another point less weapon that is not as good as you already have and the goes along with armor and the huge amount of items needed to do it.  \nMAP IS MY KEY ISSUE don't the dev's understand how to make game of the past with a huge area's to find like directional key pointing the directional arrow key in front of the character of the next quest out your journal. WHATEVER and making sure to put items in the area of the quest need to build items with a good stacking tool to allow the broken returning to base or craft out of a base you carry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ultimately, I did enjoy Abiotic Factor, but when I reflect on the game and my experience, the most resounding feeling I have is disappointment. I feel like what I was sold on was \"what if Half Life One, but you play one of the helpless scientists struggling to survive instead of playing the action hero.\" The actual gameplay ends up more like, \"what if Gordon Freeman, except he needs to take breaks to sleep and poo\". The game ultimately feels too combat focused for what I wanted, and the combat gameplay is pretty mediocre for something that feels as central to the gameplay loop as it ends up being.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "An absolutely horrendous experience, coming to this game with an expectation of polished game with a half life coat of paint is setting yourself up for a disappointment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Any game that's a survival crafter that does not have shared storage space while crafting is a huge no for me. There is nothing more annoying then constantly having to memorize every recipe, and have to constantly swap items in and out of storage / backpack to craft / build.\n\nIt's a shame other than that the gameplay seemed decent. I just refuse to play crafting games that don't do shared storage with crafting benches.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want to play with a controller, better to wait. So clunky and buggy, especially when use craft menu. Most of time, it does not even show craft components. Constant switch between mouse inputs and controller inputs, and make the game lagging.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is Dr Derek Manse reporting on the absent from the game dimension: Uhh this game is dogshit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring bullet sponge enemies with hit scan weapons, random grind to make progress at story points, stops being fun after the first half of the game. Bad weapon balance and not solo player friendly (I played it solo)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Starts out as an adventure game with a unique lab and supernatural setting, turns midway into a tedious survival crafting game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hate to say it since I really wanted this game to be lovely. The \"Laboratory escape\" themes and the SCP-style writing grabbed me, as did the design and art. But the gameplay itself is where it falls short. \"Slog\" is the word that comes to mind. The endless stamina management, extended combats, farming resources just to stay alive - Half your inventory is dedicated to ammo, bandages, healing, radiation sheilding (not hyperbole) and then there's even things like a weight limit on top of that. \r\nYour base needs power. Your tools break. Your food decays. Everything is just a massive time sink that makes you greet new challenges with not excitement but dread. I even tured down the durability and hunger decay to nearly 10% after a while and it STILL felt unfun. \r\nSo I cannot in good conscience reccomend this game. i've played it thoroughly, with friends and solo, with QOL and without. And I didn't really have as much fun as I did just reading the SCP wiki online. I really did try to like it but It was too damn hard.\r\n\r\n5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Progression is unsatisfying and the combat sucks badly",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wish i had refunded this game.  \"find someone who knows about power cells'.  its a guessing game. wander around confused until you figure it out. if you ever do. great. thx",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "100+ shortcut doors feel less rewarding the more you open them and more like poor level design",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crafting is a headache. more so with other players. And the game is all about crafting. Good developmant team. Great community. Great support but I just get too much of a headche from the gameplay and lack of quality of life ui design, bad combat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I absolutely love this game and although it pains me to do this, I gotta leave a negative review until they resolve a bug I just encountered.\nI had a full LARGE storage crate disappear from my base.\nThis crate was completely filled with resources that would take forever to grind back.\nI'm currently halfway through the reactor sector and this has grinded my playthrough to an absolute halt.\nI have submitted a bug report in hopes this can be resolved, but to have materials I grinded my entire playthrough for, to completely disappear from a place that was supposed to be safe, is one of the worst types of bugs that can occur in this type of game, save for a full save corruption.\nI cannot in good conscience recommend Abiotic Factor currently with this type of risk.\nOnce resolved I will happily flip this review!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I loved this game don't get me wrong. But the ending left such a sour taste in my mouth. following an obvious villain was stupid and on top of that we didn't even escape?!?! The ending was rushed I hope they add a good ending post 1.0.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game runs poorly for the artstyle they chose. ending is booty cheeks as well as the hive minded community who sets the development team on a golden throne. this game doesn't reward you for making it to the endgame if anything it feels like it's actively punishing you gameplay and storywise, I min maxed skills and gear (sprinting, strength, sharp, aiming, reloading etc.) (hardlight saber, quantum pick, rocket launcher, magbow, A.T.O.M.S set) Carrying a whole fortnite loadout in my hotbar having separate weapons and occasionally an extra armor set to deal with enemy damage resistances and the multitude of overtuned endgame enemies but still I struggle. excluding the min maxing this is by far one of the most grindiest games I've laid my hands upon (that's coming from a destiny player) realistically I have no idea how the average player is supposed to beat this game in a reasonable amount of time. the \"poop\" mechanic is such an annoying gimmick it's only purpose is to stall gameplay and very rarely make fertilizer not only that it's kinda just childish with it's implementation the voicelines are cringeworthy and a fugging toilet minigame???? im not one to outright hate on poopoo fart haha humor but it just felt like it was meticulously handcrafted to only be funny/ entertaining to toddlers and maybe people missing their frontal lobe. this brings my next tangent Abe and Janet. literally two of the worst written character's I've had to endure in any sort of media I've consumed. not only is 98.7% of their dialog an absolute snoozefest, they have two of the most annoying personalities you could give a character (maybe you could make it work with better writing but thats not the case) and the developers act like you automatically LOVE these characters, as they reappear numerous times as you progress throughout the game to spew more garbage I feel like they were ripped from a marvel script it's genuinely so unfunny having to sit through some of the dialog and they killed one of the only interesting characters for a marvel bit and STILL expect the player to like them, which to the people that actually do like those two characters please please PLEASE. go back to coco melon with your sippy cup. I know that people have differing opinions and humor but their writing and personalities are objectively terrible. only reason I was able to finish and 100% the game was because I was an adderall fiend which makes chores fun and this game is 80% chores. tldr this game has diminishing returns with every aspect of it degrading the further you progress. im too tired to finish this autistic rant i'd rather not waste anymore time writing a review if you can call it that, that will fall on ignorant and deaf ears. \n\n(P.S if ur gonna leave a jester award thx for the points ima spend it on more furry backgrounds)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "crashes, has massive potential, my pc is top tier, fix it and i'll buy and play with mates",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wayyyy too long and boring after a while. The game gets progressively worse in each zone leaving you with a typical “void zone with floating and broken terrain” that is very typical of the “end zone” crap every “inventive” dev comes up with.\n\nThis is the biggest drop in gaming quality I have EVER seen. The game starts off at an 8/10 and drops to a 3/10 towards the end. DO NOT BE MISLED INTO THINKING THIS GAME IS GOOD ALL THE WAY THROUGH. IT IS NOT WORTH YOUR TIME.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Endgame completely breaks down the survival aspect in favor of turning into \"Half-Life but you have no ammo, die in a few hits, and the enemies have 5x the health they reasonably should have.\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the first game I have refunded from Steam (I think!).  I hate hate hate the constant twitchy, janky combat.  I can barely tell if my hits are landing, and I die.  I tried looking for hints and tips and what I read is the combat only gets more intense and more difficult.  Watching the preview video of the crush expansion you can see the total FPS combat orientation.  Pity.  I thought it was a different game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't ROLL with the current gyro settings, YAW'mean?\n\nIt's a great game but better gyro options would be nice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After playing through this game mostly twice, I don't recommend it unless you are a fan of survival crafting games. I thought the Half Life / SCP skin would carry a game design that was more favorable to action as opposed to survival crafting ... and maybe it did, but not enough. The game seriously dragged on and by around halfway through I was just tired of having to go get stuff to craft stuff to make progression items *after* reaching the progression point. Plus traversal isn't particularly fast, even with jetpack. My advice though is never make the jetpack, stick with the long jump pack. \n\nIs the game *good* ? Yes, it has compelling level design and a lot of content. But it's a time sink that I don't think is worthwhile. You'd probably get more mileage out of a JRPG.\n\nI really wish this was just a simple first person shooter, and not a survival crafting game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like how unrealistic the food and sleep requirements are. If you don't sleep or eat within a few hours of game time, the character dies. \n\nThis may be common to the genre but it ruins it for me almost immediately. \n\nThe food/sleep requirements change this \"survival\" game into a roguelike or puzzle game. I honestly don't know how people enjoy it. It's so tedious.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not sure what the hype is about. Maybe i'm playing it wrong. I'm trying to get all of the components for the keypad hacker and I need to destroy like three robots. However, I can't beat them by myself. It's taking me a couple hours just to wait for a robot to spawn in the third floor. \n\nDefinitely need weapons to beat them. I don't want to craft a battery and a chopinator. Too much crafting to battle a single uninteresting enemy.\n\nTrying to fight enemies is a bit too complex. As I play more and more, I became sick of how much effort it takes to take down one enemy.  I'm having issues trying to heal having to respawn each time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "probably top 3 or top 5 worst games of 2025 maybe only worth getting when 90% or 95% off",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is yet another survival crafting game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would be a great game\nIf had anybody to play it with",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game does not work with remote multiplayer.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}