{
  "positive": [
    {
      "review": "Wallpaper Engine is utterly pointless and I cannot recommend it enough. It serves no practical purpose. It is a digital peacock feather, a frivolous luxury for your screen. It will not make you more efficient. It will, however, make you the proud owner of a desktop that sparks joy every single time you minimize a window.\n\nIt’s a $5 masterpiece of digital decadence. Just be prepared to explain to your friends why your computer sounds like a jet engine preparing for takeoff just to display a screensaver you never look at.\n\nFinal Thought: My GPU now has a permanent sweat gland, and my productivity is in witness protection. Worth it.",
      "voted_up": true,
      "votes_helpful": 72
    },
    {
      "review": "It's a super cool tool to get a wide variety of nice wallpapers though i highly recommend a +18 filter, it's unfortunately flooded with perverse crap. I dunno why the devs don't do something against it",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "10/10 absolute must-have!\n\nWallpaper Engine is hands down the best app you can have on your PC when it comes to desktop customization. A massive library of animated wallpapers created by the community, millions of styles — from chill vibes to cyberpunk, minimalism, anime, and gaming aesthetics.\n\nBest of all: it doesn’t slow down your PC, and wallpapers automatically pause while gaming, so zero FPS drops. You can also add your own music, effects, interactive elements, and even create your own projects.\n\nThe app is easy to use, stable, frequently updated, and honestly addictive — after buying it, you’ll probably spend more time browsing wallpapers than playing actual games.\n\nIf you want your desktop to come to life and look like a million bucks — get it, no hesitation. Worth every penny!\n\n100% recommended",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "it's fookin wallpaper engine, ya spend it once and already ya get like 50+ wallpapers for it on yo pc ready to go, some also got like mini games on them too if that's ya thing",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This software truly has no equals. I must admit, I don't really use it for wallpapers, but to do animations.\nI'm a musician, and Wallpaper Engine is beyond great to make simple but dynamic animations for my song visualizers.\nThe only feature I'd request is to make an option to export the wallpaper loop as a video file, so people like me won't have to record the screen every time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its wallpaper engine.\nGood review.\nHow can you ever be a person to review this as not recommended?\nIf you're one of those few people, Do better.\n\nGet it best 10 bucks ever spent.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Been using Wallpaper Engine for nearly 10 years and really hasn't let me down. Works for just about any setup you may have in terms of monitors, resolutions, quality, etc. Pretty much endless types of wallpapers. Just search what you want and theirs probably a wallpaper for it. Sadly not supported on Linux as of yet.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Wallpaper Engine is one of the best customization tools out there for making your desktop feel truly personal. It lets you use animated, interactive, or even audio-responsive wallpapers that bring your screen to life. The variety is incredible — from calm, scenic loops to high-energy gaming visuals — and you can even create your own using the built-in editor.\n\nPerformance-wise, it’s great too. Wallpaper Engine automatically pauses or reduces usage when you’re gaming or running intensive apps, so it doesn’t slow down your PC. The Steam Workshop integration makes browsing and downloading wallpapers super easy, with thousands of community-made options available for free.\n\nOverall, it’s creative, lightweight, and endlessly customizable — a simple but powerful way to make your desktop feel unique and alive.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "An great and seemingly infinite repertoire of high quality animated wallpapers for whatever tastes you desire.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "you ever see those crappy tacky ahh wallpapers with some gaymer rgb goku or some big titty anime gooners wallpapers, or maybe one of those incredibily soulless \"minimalistic\" pictures with a bunch of iphone clock fonts on it in some pc setup video on youtube? this is where it came from. \n\nthis is basically what the ps3 themes taken from those obscure XMB websites...but on pc instead. pretty good!\n\nwould recommend to turn the anime filtering on just saying. mfs out have the worst taste of all time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been using Wallpaper Engine, and it’s honestly really good. It lets me set cool animated wallpapers, and there are tons of options especially anime and aesthetic ones. It runs smoothly on my PC and doesn’t slow anything down. I like that it pauses automatically when I’m gaming too. It’s paid, but totally worth it for how good my desktop looks now.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "really good wallpapers and its not blurry",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its amzing and has so many things to choose im glad i brought it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So much amazing wallpapers, \"wink\" \"wink\"\r\nyeah honestly some great memes and pretty great resolution on a many if u know what u looking for.\r\nBiggest advantage all in one app, u can also create ur own, idk how but ill get to it eventually, or just get it here from some other editor onto app.\r\n\r\n97/100\r\n\r\n(just some things can sometime not be as many if not generally popular or worse quality, but very rarely)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extrodinary it makes my desktop look beautiful at the cost of my electricity bill and fps worth it tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, those were the best 5 bucks I've spent in a long time. The software works flawlessly, the choices are limitless and the option that gives you the chance to create your own wallpapers is just the cherry on top. Highly recommend this product  (especially if you're an anime fan)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great way to make still game screenshots in to animated wallapers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wallpaper Engine is a must-have application that brings your desktop to life with limitless, high-quality, and surprisingly performance-friendly animated backgrounds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, totally worth it to set up some amazing desktop and phone wallpapers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best 5$ ive ever spend in my entire life. Greatest app for backgrounds ive seen so far. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect for background wallpaper and somehow you feel a sense of calmeness rushing over you after you pick some specific chill wallpapers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not really 100% needed, in your life; But it's a good paid wallpaper app to decorate your PC more, I wouldn't say it's 100% worth the 5 bucks\nbut if you want the full customization, and show your own work via wallpapers, then it's definitely worth it, there's a lot of fandom made wallpapers and they actually kick ass with atmospheres fitting your mood for example.\n\nA: Get it if you want good wallpapers\nB: Get Lively Wallpaper as a free alternative before buying Wallpaper Engine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love that there are so many wallpapers to choose from and that it works seamlessly with my pc background without having to open the app everytime I turn on my computer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just saw a workshop of this game for 10 second and I saw so much 18+\nbest experince",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't really a game, but you can get some great wallpapers from it live or still. At first I had a hard time figuring out how to use the software, but once I did it was so easy and I recommend getting it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to use and a ton of options to choose from, from static backgrounds to audio responsive and more. Good product, have used it for years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great app, even for non-gamers. Very easy to use, adopts useful tools (such as porting wallpaper to your phone). \n\nIf you are a gamer, this is a MUST HAVE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty easy to use, feel like i don't use it super often, it's just annoying to have it running in the background since it takes quite a bit of processing power, other than that if you're just trying to make your setup look good for a video or just want to have it look nice while you're not using it i'd reccomend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts still fun game to play but only if they fixed the anti-cheat system it would be fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "surprisingly not anti customer. it doenst try to sell your data (at least i think), doesn't try to upsell. its a good utiltiy. does what it says on the tin well! and is supported by the devs till now :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sh*t tons of wallpapers to choose from, You go crazy over which wallpaper to get and which to not. At first wallpaper engine seems like a waste of money but when slowly the realisation comes over that it's not even that bad and my desktop looks sexy af, wallpaper engine seems worth it. I Definately rcommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best app for wallpaper ever.. Just hat's off. So less PC resource use almost neglegible, always free and unlimited wallpapers, daily new wallpapers, omg... What an app !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best personalization tool I have ever acquired. Does exactly what it says on the tin, runs all your wallpaper needs with simplicity and efficacy. If you just wanted some animated wallpapers, cool. If you wanted to create the perfect, most elaborate, customizable wallpaper, can do that too. Easy worth while buy, perfectly priced for its worth; a humble 5$.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good baja blast background makes me lick my screen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very difficult game... made me release the beast many different times but i guess its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would say its very good because you can find some very interesting wallpapers for all ages",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool program, and the user generated content is typically pretty great too! So much creativity. Love having an animated wallpaper :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️⭐️ Wallpaper Engine – A Must-Have for Anyone Who Wants Their Desktop to Feel Alive\r\n\r\nWallpaper Engine is one of those rare customization tools that transforms your desktop from a static workspace into something vivid, personal, and genuinely inspiring. People enjoy Wallpaper Engine because it blends creativity, performance, and limitless customization into one polished package.\r\n\r\nWhat makes it so enjoyable is the sheer variety of content available. Users can choose from animated wallpapers, interactive scenes, subtle motion graphics, or even full 3D environments. Whether you want calming landscapes, futuristic sci-fi animations, artistic loops, or fan-made designs from your favorite shows and games, there’s a wallpaper for every mood and aesthetic. The Steam Workshop integration means you’re not limited to pre-installed themes—there are hundreds of thousands of community-made wallpapers that you can browse, rate, and download instantly.\r\n\r\nAnother reason people love it is how remarkably optimized it is. Despite the high-quality animations, the program is designed to use minimal system resources. It automatically pauses or reduces rendering when you’re gaming, using full-screen applications, or working on something intensive. This makes it ideal not only for casual users but also for gamers, streamers, and professionals who want visual flair without sacrificing performance.\r\n\r\nWallpaper Engine is also incredibly customizable. You can tweak color schemes, adjust animation speeds, add effects, and even build your own wallpapers using the built-in editor. For creative users, this feels almost like having a lightweight motion-design studio at your fingertips. And for people who simply want a beautiful background, it’s easy to pick something and let it run right away.\r\n\r\nWho is it made for?\r\n\r\nGamers who want to match their desktop to their favorite titles or create a themed setup that feels cohesive.\r\n\r\nCreative individuals who love experimenting with design, animation, and visuals—or who want to create and share their own wallpapers with the community.\r\n\r\nPC enthusiasts and setup lovers who care about aesthetics and enjoy crafting a desk or battlestation that feels unique.\r\n\r\nCasual users who just want something more dynamic and visually appealing than a static wallpaper.\r\n\r\nStreamers and content creators who want backgrounds that make their workspace look polished and professional.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good for wallpapers, incredible art",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly love the amount of content the community has made for this that is so well made. Plus so much of it is just so fun. Like the audio reactive wallpapers, the trail effect ones, the depth effect along with puppet effects too. Just so many good ones to choose from to be honest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best full price digital product in my life\nJust looking on the animated screen makes me bliss ...\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️⭐️ A Must have App for Anyone Who Loves Personalizing Their PC\r\n\r\nWallpaper Engine has honestly become one of my favorite things on my PC. I didn’t expect it to make such a big difference, but it completely transformed how my desktop feels. The library of wallpapers is insanely huge, everything from relaxing landscapes to crazy futuristic animations and the best part is that there’s something for literally every mood.\r\n\r\nPerformance wise, it’s surprisingly light. I was worried it would slow my system down, but it barely uses any resources, and it even pauses automatically when I’m playing games. Super thoughtful design.\r\n\r\nThe customization options are where it really shines. Being able to tweak colors, effects, and even create my own wallpapers makes the whole experience feel personal. It’s not just wallpapers it’s like having a mini creative playground on your desktop.\r\n\r\nIf you like making your setup look clean, unique, or just more you, Wallpaper Engine is absolutely worth it. For the price, it’s a steal and its literally the best purchase i have made on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is amazing best wallpaper app for pc/laptop gamers and the graphics are so beautiful that overheats my pc and also recommended wallpaper 10/10 5 stars\n\n(also not good for weak or poor laptop/pc's best for gaming laptops and gaming pc)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Clean work. Been running it for a while and it still feels fresh. Nice job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do like it but I have problems with my system either that I have 3 screens or just my configuration, the  problem creeps up mostly when its running and I'm also watching videos on youtube or on webpages  that stream video, but my system freezes up and its quite annoying. Other than that I have no problems recommending this program to people who love to decorate their wallpaper specially with animations and video,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love my bacgrounjds on it and it always turns on with no struggle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best investment you could ever make on Steam. If you enjoy customization, then go for this, it's worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good quallity and a lot of wallpapers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing program. Wonderful for looping a video as a desktop background. Not the easiest to use or setup unfortunately and there is more of a learning curve than there should be.. but overall well worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has various options, worth the price cuz then you use it forever and they always come out with new wallpapers from the games or the series you like the most :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]The Gold Standard for Dynamic PC Customization[/h1]\r\n\r\nWallpaper Engine isn’t a game — it’s a creative tool that transforms your desktop into a living canvas. From animated scenes and particle effects to interactive wallpapers and full 3D environments, the software gives users near-limitless ways to personalize their PC. With an intuitive editor, excellent performance optimization, and an enormous Steam Workshop library, it has earned its reputation as the best customization app on the platform.\r\n\r\nThe biggest strength of Wallpaper Engine is its flexibility. You can browse thousands of community-created wallpapers from subtle ambient animations to high-energy visuals, anime loops, game-inspired scenes, nature landscapes, music visualizers, and even fully interactive projects. No two desktops ever need to look the same.\r\n\r\nPerformance is surprisingly smooth. Thanks to smart optimization, the application uses minimal CPU/GPU resources, automatically pausing or reducing quality during gaming or full-screen apps. Even older systems can run lightweight wallpapers without noticeable impact. For power users, the customization controls are deep: FPS limits, quality settings, playback rules, multi-monitor support, and per-wallpaper tweaks.\r\n\r\nThe built-in wallpaper editor is a standout feature. It allows anyone even users with zero animation experience to create custom wallpapers using layers, effects, particle systems, and simple logic triggers. More advanced users can import full 3D scenes or develop HTML/Javascript-based interactive wallpapers. The editor alone feels worth the price.\r\n\r\nThe workshop ecosystem is enormous and constantly active. You can follow creators, browse curated lists, or search by tag and style. The rating system keeps quality high, and the diversity of content means there’s always something new to discover.\r\n\r\nIf there’s a downside, it’s that certain high-end 3D wallpapers can be demanding on weaker hardware. Some wallpapers push heavy particle effects or high polygon models and will spike usage, though this is more a content issue than an engine flaw. A small number of older apps or laptops may experience compatibility quirks, but these are rare and usually fixable with setting adjustments.\r\n\r\nUltimately, Wallpaper Engine succeeds because it respects users’ hardware, gives them creative freedom, and provides endless personalization at a low cost. Whether you want a relaxing ambient scene or a flashy showcase for your desktop setup, it delivers with style and stability.\r\n\r\n[h3]The Good:[/h3]\r\n\r\nMassive customization options with powerful yet easy-to-use tools.\r\nExcellent performance optimization with intelligent resource management.\r\nHuge, active Steam Workshop full of high-quality wallpapers.\r\n\r\n[h3]The Bad:[/h3]\r\n\r\nSome high-end 3D wallpapers can be demanding on older PCs.\r\nOccasional compatibility quirks with specific apps or drivers.\r\nThe sheer amount of content can be overwhelming for new users.\r\n\r\n[h3]Ratings:[/h3]\r\n\r\n[b]Overall:[/b] 9 / 10\r\n[b]Visual:[/b] 9 / 10\r\n[b]Gameplay:[/b] - / 10\r\n[b]Story:[/b] - / 10\r\n[b]Audio:[/b] - / 10\r\n[b]Playability:[/b] - / 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wallpaper engine is by far the best wallpaper app to ever exist would highly recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy it if you got the money AND if you like good quality live wallpapers. You can also upload your own wallpapers, live or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great application has very good wallpapers and the animations are nice and smooth, no problems running using or anything at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like pretty much everything and there really isn't anything that I dislike and it's a pretty good wallpaper app and I suggest it  and recommend it too anybody looking for some good wallpapers it's worth the 5 dollars and better then any other wallpaper app including lively wallpaper",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Using an OLED and slab this wallpaper engine, never feel so good for spending money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of anime, like a lot but there is sum other good stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First live wallpaper software I ever used, and probably the only one I will ever use. Has an android app too where I can dl the wallpapers from my desktop app and use them on my android phone as live wallpapers. \n\nThanks to steam workshop there is a live wallpaper someone has created for every single thing you can possible think of. Hundreds of thousands of wallpapers. \n\nI would recommend this for anyone using windows 1000%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the wallpapers in the app and i found many that were just perfect for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wallpaper Engine on Steam is a simple yet powerful way to bring life to my desktop. Instead of static images, I now enjoy animated and interactive wallpapers that reflect my mood and personality. The huge library of community creations makes it easy to find something fresh every day, while the customization options let me fine-tune performance and visuals to fit my setup.\r\n\r\nWhat I love most is the creative freedom—the built-in editor allows me to experiment and even design my own wallpapers. It runs smoothly, pauses during games, and supports multiple monitors without hassle. While it can be a little distracting to spend time browsing wallpapers, the joy of having a personalized, dynamic desktop far outweighs that.\r\n\r\nFor its low price, Wallpaper Engine is a must-have for anyone who values creativity and personalization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "must need essential. so many options so you can always change your current wallpaper if you're ever tired of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool and customizable, even though its not exactly super \"useful\" but i dont care honestly just super neat and priced very well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you get great goon material off of here bro and its so accessible bc its on your background bro 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice wallpapers by the community, you can find just about anything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a comunidade cria bons wallpapers, só é uma pena que não funcione no Linux",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing! It has alot of wallpapers and not forget it is mobile compatible and transferring said wallpaper to phone is so simple!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best and efficient for live walpappers!!!\r\nBeen using it for a while and it has options to pause the live wallpaper automatically when other apps are open",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "difficult but enjoyable combinations of midairs, triple shell jumps, etc. music player feature seems silly but i don't ever mind more features in something. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Theres a wide variety of wallpapers for one to choose, some of which are artistically wonderful and others I use as a shitpost. Overall, Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing to say much abt this but it's really good thing for wallpapers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its amazing tons of options and makes your setup and monitor look better. 10/10 I recommend it is also only 5$ so I say you should get it if your into making your setup look good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very cool you can get 3d good quality live moving wallpapers plus it can make cool effects follow your mouse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good has a lot of animated wallpapers really worth it works on double monitor too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "man i LOVE WALLPAPER ENGINE it makes my old splatoon wallpaper that i made when i was 13 into a ultra clear ad smooth moving wallpaper i love this app i would recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was really double-minded about buying Wallpaper Engine, but it was definitely worth it. It offers thousands of customizable, beautiful wallpapers. I was concerned about high RAM usage at first, but many wallpapers are lightweight and I haven’t faced any issues. I would definitely recommend buying it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i mean there isnt really much to say you select the wallpaper and it gives you the wallpaper like its not some insane rocket science",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is good so many  customization and workshops is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All wallpapers you ever need, want and think of are right here ranging from Edits, Memes, Simps and full blown Hentai video/dances all in one click.\n\nIt’s confusing at first but you’ll get it in 1 to 4 minutes of using it. Also doesn’t effect your gameplay while running live wallpapers in the background from my experience although i think it doesn’t.\n\n10/10 Remember to not stay on too long. People do start asking questions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the coolest and most neat \"game\" that I have bought on Steam. Literally have had so much fun with decorating my PC the way I want. W Devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a pretty good quality wallpaper app, although many people don’t actually use it to set wallpapers (sadly).🥵🥵🥵",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this app it has so may options to choose from i just love all the good quality live wallpapers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it speaks for its self its a great app for some bad ass wallpapers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty kool for what it is also i love the retrowave and miku backgrounds 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like putting anime girls onto the background and looking at them while my CPU and GPU are running on 100% usage. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "top 1 best helpful, beautiful, hot, sexy, insane, extra hot, pretty app of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great performance, lots of amazing wallpapers to use. 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good for cool bachgrounds would recomend even though other apps such as rainmeter exist this is just soo much better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "totally haven't been doom scrolling the workshop to download hundreds of wallpapers that i will never use, i'll never regret buying this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of great options for wallpapers and great settings for idle pcs or pausing for gaming!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome to add some flare to your desktop, super affordable and worth it. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tons of wallpapers and u can mute and pause them whenever u want. Worth the few dollars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i bought it but it hasnt shown up in my library and it still has the add to cart? it lets me play it through the bay page but it also stiill has the add to cart pop up, and it took my money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have found some great stuff on here, it is easy to set up and understand, I would recommend this to anyone I come across who has a windows pc. (btw if someone can comment on this explaining how I can get the little widgets at the bottom of the saturn wallpaper to do anything that would be greatly appreciated!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite literally the best purchase I've ever made on Steam... You can do whatever you want for desktop backgrounds, no joke. Infinite possibilities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, lots of gooner wallpapers but thats just a plus lwk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Wallpaper Engine. It's one of my essentials.\r\nNothing much to add, that's it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]⭐ Wallpaper Engine – My Monitor Has Never Been Happier ⭐[/b]\n\nI went in thinking this was “just wallpapers.”\nNow I’m out here spending 2 hours customizing backgrounds like I’m decorating a digital mansion.\n\nMy PC doesn’t even feel like a PC anymore —\n[b]it feels like a museum of moving art, cursed memes, anime chaos, space nebulae, and questionable choices at 3AM.[/b]\n\nI switch wallpapers so often it’s basically a mini-game at this point.\nSometimes I spend more time choosing wallpapers than actually playing any real games.\nIf productivity had a hitman, this app hired him.\n\nPerformance?\nSmooth.\nOptions?\nEndless.\nMy sense of self-control?\nGone.\n\nIn short:\n[b]If you ever wanted to treat your monitor like a fancy pet that needs attention every 10 minutes — this is the software for you.[/b]\n\n[b]Highly recommend. Your screen will thank you. 👍[/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its got loads of great wallpapers for every theme you can think of",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Software really improves and sets the mood of your room when the computer is idling.\n\nTip* : Control + D often to witness wallpaper beauty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very good and very good animations and balanced",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "They need to add an option to filter out AI wallpapers. It's getting ridiculous lately.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "在纵容下住在男人裤裆里的软件，这么性压抑怎么不互相用后面解决？",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "There's a lot of amazingly cool wallpapers, but they're all community made and it doesn't support Linux natively. If you really want, you can buy it, but it's totally replaceable with free alternatives",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Almost perfect, just doesn't run on my computer.\n\nIf only it worked on Linux.\nWill update my review if it magically starts working.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Mostly crowded by AI generated content with no option to report it or filter it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The software is great and I used to enjoy it. But for many years the search function and categorization is so broken you just get spammed with cheap AI softcore and hardcore porn. \n\nSetting it to G rated does not work. Its like using pornhub to search for a video game trailer and frankly Im just done with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing app! I would recomend it, but there is a big problem with it right now for me.\n\nDevelopers, please make it possible to hide wallpapers made by a certain author! There is a person there that already uploaded hundreds of assets that are a couple megabyte edits of games and tv shows, and they are FLOODING search results, making it an awful expirience.\n\nOnce this feature is available I'll give this app a thumbs up and a good review!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ive used this app for over a year a year and and it never gave me any trouble, well recently ive noticed that its been crashing a lot! i cant even open the app without it crashing! its so annoying because ive scanned the files and done so much so the app wont crash, ive even uninstalled a sound system and it still crashes. it just lets me have one wallpaper, and i cant change it bc the app crashes! im so over it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have tried installing and uninstalling this more than once and it still breaks my computer. I'm not really sure how to fix it so I just assume it's not compatible with my hardware.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First off, there's nothing here that Sucrose doesn't do better. You dont have to pay money just to display a video as your wallpaper. \n\nSecond off, the editor and customization is super easy to use. This is a good use of this software, if you want to edit something for your exact use case. \n\nThirdly, its hard to find good wallpapers. Anime slop destroys every keyword, and people don't accurately tag their stuff. \n\nBut this is a great piece of software. It just works. \n\nI recommend if you're not getting enough from Sucrose - but most people shouldn't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I purchased the software, but there are no amazing wallpapers. There are many other software programs that offer high-quality wallpapers, even 4K videos and wallpapers, for free. The developer created the software and then left it. Now, there are only cringy wallpapers in the download area, such as low-quality ones, with no sense of design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after a while of having it it runs and dispalays your wallpaper but you can no longer see the ui and then it doesent open at all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cool wallpapers but the performance is so bad literally 90% gpu usage on the lowest setting on a 5090. i got this app and have barely used it because it bogs down my pc even when the wallpapers are paused, how does a paused wallpaper take up 40% of a gpu?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Windows is already bloated enough, the amount of system resources used by Wallpaper Engine isn't that bad, until windows decides it wants to prioritize some scummy data harvesting tool mid game making the resources Wallpaper Engine uses less tolerable. not only that, more people are switching to a Linux OS for gaming. there's plenty of friction points but with Linux distros like SteamOS, Bazzite, Pop!_OS getting more and more notoriety by well know PC gamer icons like GN and J2C. the new polished UIs that are leaning towards user friendly appeal. all of which will soon be sending PC gamers to a Linux based OS in no time. using the Steam analytics as \"reason\", seems more like an excuse to me, to not develop a Linux platform shows that the devs (talented yes) are lazy and don't really care about their community. They're going to happily pick low hanging fruit, conning younger kids and being completely unbothered by the users who abandon their favorite wallpaper so they can go enjoy actual gaming with a Linux OS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is just pay to get porn. the workshop is full of it and the only way you can get rid of it there is by pressing approved. what if i don't want just approved? this needs better moderation honestly. i'll keep using this, but this isn't ok to just mindlessly give anyone creative control to add anything they want.\r\n\r\nsome of my options for making this better are below. these probably wont be added because the team/people behind this obviously don't read reviews, but here they are:\r\n\r\n1. BETTER MODERATION FOR NSFW CONTENT. Just remove Mature rating in general because nobody uses it.\r\n2. filter for nsfw content. it's self explanatory.\r\n3. give people more creative freedom without the effects of putting whatever you want on it no matter if it's a s*x scene of what.\r\n4. make it more versatile and useful. the entire thing looks bland.\r\n5. reduce the lag/gpu people always get. i know it's easier said than done, but still. that sucks.\r\n\r\nif one of the people on the team ACTUALLY reads reviews, please for the love of god at least acknowledge the first 2 about the nsfw content. i can't scroll until after the second page on no custom filters in the workshop page. i know there's an in-game version that's better, but i sometimes just want to scroll that instead because it's quicker to use sometimes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute piece of trash. For 4,99€ you are getting an app that has wallpapers that you can download from google and animated wallpapers for which you can use Lively Wallpaper (which is free btw)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended\r\n\r\nThis program caused high GPU usage on my laptop while I was on the desktop. My RTX 4050 stayed active at idle, the temperature stayed high, and Windows started to lag. Basic actions slowed down, including opening File Explorer and hovering over icons. Closing the program fixed the issue at once and returned the system to normal performance.\r\n\r\nThe program has many features, but the default behaviour can push GPU load far above what you expect for a wallpaper app. Users with laptops should be careful, because heat builds up fast when the fans run in silent mode.\r\n\r\nIf you use a laptop or prefer a cool and quiet system, I do not recommend this program unless you only use static or low-load wallpapers and adjust every performance setting by hand.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "VERY GUNERINGS GAMES I NOT WANTEDS TO GAMES TU GUNERINGS PLEZ FIX GUNERS GAIMS NOT RICOMANDED",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many garbage wallpapers and too difficult to find the good wallpapers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shits ass im stuck on a old update half the wallpapers dont work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WARNING!! VIRUS CARRYING SOFTWARE!!\nNo, this is not a joke.\nI'm playing games one night before calling it for bed, the following morning I plan my day by starting up with the bois and then progressing to my homework later the day. Shockingly enough to my surprise, when I booted up my PC; it was followed by constant flashing on the screen with a missing task bar.. I try looking up solutions, nothing worked. Eventually I gave up and took it to the technician. Showed them my videos and the error message that was popping up on my screen \"shellhost.exe\". Naturally when the tech saw this error msg, he asked me if I had any desktop modifying softwares like \"fence\" or some other example. They explained to me that shellhost is a crucial part in displaying what's on my monitor, they heavily believed it was this application when I brought it up. Thankfully enough after an hour, they call me back with free of charge: didn't take him long. Bro explained to me the problem and how I can prevent this in the future. I hook up my pc and boot it up when I arrive back home, fortunately I finally had my fucking task bar back without any constant annoying ass flashing on my screen (in other words, I had full accessibility over my OWN PC again). First thing I did was uninstall this trojan horse and backed up all my files, after installing an anti-virus application. \nDo not throw your money away on this virus inviting malware. I trusted it at first, and so will everyone else. Do not make the same mistakes I did. Uninstall this software, get rid of it; or it'll get rid of your PC first.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its alright if you really wanted an animated wallpaper but imo not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too unpredictable at times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gives me a waIIpaper and it pIays music",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CANT EVENM USE MY COMPUTER BERCAUSE THIS SHIT IS SLOWING IT DOWN FUCK THIS SOFTWARE ITS SCAM ASF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if it supported macos and linux it would be really good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unnecessary use of battery life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cant recommend this till they fix the AI slop problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you dont need this, just get a normal wallpaper",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refund button is nice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The amount of porn in the workshop is mind boggling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "full of anima slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nothin good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Linux support when?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too much hentai",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "add a remove ai filter please",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is really hard to use",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not enough porn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mnogo e mazno brat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "turn you into a gooner",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "add linux support.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "play it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "проста хуєтень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dodo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nigger",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "amine car",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MOCNYGAZ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "):",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ts trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WHY THE FUCK IS THIS FULL OF ANIME PORN YOU FUCKING WEIRD SONS UH BITCHES. LIKE HUH, WHAT.I TYPED IN SCREAM, AND GOT FEET AND ASS. EXPLAIN YOURSELF. I TYPE IN HALLOWEEN, YA KNOW, MICHAEL MYERS, AND GUESS WHAT, MORE FUCKING ANIMATED SINNING NUNS WITH THEIR FUCKING MILK SAGGERS OUT. WHY IS THIS A THING. MONEY BACK. RIGHT NOW. RIGHT TF NOW. I MEAN YESTERDAY.  anybody defending this needs to be investigated and sat down with chris hansen immediately. check their names in the epstein files as well. i now know why they ordered 500 hot dogs. i want no more glizzys. not that this has anything to do with the original post. but. fuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "67",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fvd",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ycugfvgjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjcc yeah",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "hghg v vgfj",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They need to add an option to filter out AI wallpapers. It's getting ridiculous lately.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Full of AI slop. Needs to have a big time GenAI content purge before I can recommend using this app in good conscience.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Too many Degenerate, Pornography, AI Content, and NSFW Content I wouldn't recommend this thing is nothing but a software for porn addicts and most of all i'm never trusting it ever again -_-.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "its good enough i wont refund or uninstall it, i like the great ultrakill backgrounds and the usefulness of the wallpapers, makes it look like it isnt running on windows, but theres alot of problems especially the fact the search isnt even accurate enough to get what i want, also can yall remove nsfw all together, i see them in the everyone section which is gross, i even saw illegal content at sum point which is disgusting like what is wrong with yall",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Besides the absolutely egregious amount of porn, it's pretty good for wallpapers. Still not gonna recommend it because it's just better to avoid if you don't want to contract a porn addiction",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The developers excel at introducing new features that enable users to create innovative and high-quality wallpapers, with over a dozen great options available. However, there is a tremendous number of poor-quality and disgusting wallpapers that I have to filter out, which make up the majority of what is offered. In fact, I’ve found better wallpapers by using my own browser or by inserting a video as a background. Over the past few years, I haven't seen much improvement in the quality of available wallpapers, and fewer than a handful of things that are of good quality come out each year. It’s not the fault of the developers; rather, it seems to be due to the influence of people who are addicted to 'you know what.' It appears there is a biased or botted influence on the negative content, which is evident in what has been ranked highly in the system, too, which is why I am seeing what I am seeing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "在纵容下住在男人裤裆里的软件，这么性压抑怎么不互相用后面解决？",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Extremely unoriginal a lot of IP's and looks like not very much room for creative freedom. Seems to be a lot of censors for violence but porn is A-O-K yea I'll use it but it's because there is nothing else of quality and that is not a compliment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There's a lot of amazingly cool wallpapers, but they're all community made and it doesn't support Linux natively. If you really want, you can buy it, but it's totally replaceable with free alternatives",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Almost perfect, just doesn't run on my computer.\n\nIf only it worked on Linux.\nWill update my review if it magically starts working.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "constant fliockering. can't fix it messed with a bunch of settings, no luck.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "$4.99 isn't a bad price tag for software that ultimate just downloads and runs your choice of background whether it's a standard image, animated, or even interactive. \n\nBUT  \n\nThis is one of those rare Steam products that deliberately aggressively prevent you from using it on alternate accounts, meaning you have to switch accounts back to your main one or whatever account you purchased/got gifted it on just to mess with some settings or change something. \n\nWhy??? Why in gods name are you trying to force users of your app into paying for more copies just for convenience? Even if someone is library sharing this app with a family member, is that really so bad? It's terrible practice to inconvenience your customers just to try and squeeze another $4.99 out of them for software that basically amounts to a launcher for community made wallpapers. \n\nIn the meantime, I will not recommend this software until I am able to use it on alternate accounts instead of having to waste a couple minutes waiting for steam just to switch between my accounts, hopefully in the future I can rejoice over this absolutely minor inconvenience being changed in my favor.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "its an amazing product that really livens your wallpaper on both mobile and desktop, the only big downside and why i don't recommend it, is that AI \"art\" is pretty common, i don't feel comfortable having AI as background in any way and it's unappealing that there's no way to disable AI \"art\" from appearing, on the plus side, a lot of people have done really cool wallpaper edits of existing artwork of video game artwork, or even art of their own! In that regard, i can absolutely recommend Wallpaper Engine to anyone who is wanting to liven their wallpaper in a great way, but as it stands, as there is no way to discern AI to real art, i simply do not feel comfortable recommending it",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As cool as it is to have animated or multiple backgrounds on multiple monitors, this software causes GPU instability and power issues. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just want this to be setup and work but it changes wallpaper randomly. (safemode etc.)...  Im not going to wallpaper engine settings everytime i start my pc to choose my wallpaper. Sometimes i got it on 1 monitor only even tho i have two and need to manually put in on the second monitor. Shouild be free and open source and it would be better",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]Repeated game crashes[/h1]\r\n\r\nEvery game i play is vert unstable and crashes. When i quit Wallpaper Engine it all works fine. It worked fine for a while and it was very cool but now it is just an annoyance when my games crash. \r\n\r\nFunny thing though: [u]It works fine with my laptop.[/u] \r\n\r\nI cannot solve this issue myself and i'm just tired of my other games crashing. [b]I tried some pausing settings so that when i have another window open it pauses but they just did not work[/b]. Cool software but it is just not fit for my system. I will continue to use it on my laptop though.\r\n\r\nI don't know if this should be recommended or not since it is a cool app and i will continue to use it on another system but overall it has caused be more frustration than good",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Some of the wallpapers I subscribed to just disappeared for no reason. But after subscribing, the files should’ve already been downloaded locally, and yet they got deleted. It wasn’t until today that I realized it had been secretly doing these things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mostly crowded by AI generated content with no option to report it or filter it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The software is great and I used to enjoy it. But for many years the search function and categorization is so broken you just get spammed with cheap AI softcore and hardcore porn. \n\nSetting it to G rated does not work. Its like using pornhub to search for a video game trailer and frankly Im just done with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing app! I would recomend it, but there is a big problem with it right now for me.\n\nDevelopers, please make it possible to hide wallpapers made by a certain author! There is a person there that already uploaded hundreds of assets that are a couple megabyte edits of games and tv shows, and they are FLOODING search results, making it an awful expirience.\n\nOnce this feature is available I'll give this app a thumbs up and a good review!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ive used this app for over a year a year and and it never gave me any trouble, well recently ive noticed that its been crashing a lot! i cant even open the app without it crashing! its so annoying because ive scanned the files and done so much so the app wont crash, ive even uninstalled a sound system and it still crashes. it just lets me have one wallpaper, and i cant change it bc the app crashes! im so over it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have tried installing and uninstalling this more than once and it still breaks my computer. I'm not really sure how to fix it so I just assume it's not compatible with my hardware.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First off, there's nothing here that Sucrose doesn't do better. You dont have to pay money just to display a video as your wallpaper. \n\nSecond off, the editor and customization is super easy to use. This is a good use of this software, if you want to edit something for your exact use case. \n\nThirdly, its hard to find good wallpapers. Anime slop destroys every keyword, and people don't accurately tag their stuff. \n\nBut this is a great piece of software. It just works. \n\nI recommend if you're not getting enough from Sucrose - but most people shouldn't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I purchased the software, but there are no amazing wallpapers. There are many other software programs that offer high-quality wallpapers, even 4K videos and wallpapers, for free. The developer created the software and then left it. Now, there are only cringy wallpapers in the download area, such as low-quality ones, with no sense of design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after a while of having it it runs and dispalays your wallpaper but you can no longer see the ui and then it doesent open at all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cool wallpapers but the performance is so bad literally 90% gpu usage on the lowest setting on a 5090. i got this app and have barely used it because it bogs down my pc even when the wallpapers are paused, how does a paused wallpaper take up 40% of a gpu?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Windows is already bloated enough, the amount of system resources used by Wallpaper Engine isn't that bad, until windows decides it wants to prioritize some scummy data harvesting tool mid game making the resources Wallpaper Engine uses less tolerable. not only that, more people are switching to a Linux OS for gaming. there's plenty of friction points but with Linux distros like SteamOS, Bazzite, Pop!_OS getting more and more notoriety by well know PC gamer icons like GN and J2C. the new polished UIs that are leaning towards user friendly appeal. all of which will soon be sending PC gamers to a Linux based OS in no time. using the Steam analytics as \"reason\", seems more like an excuse to me, to not develop a Linux platform shows that the devs (talented yes) are lazy and don't really care about their community. They're going to happily pick low hanging fruit, conning younger kids and being completely unbothered by the users who abandon their favorite wallpaper so they can go enjoy actual gaming with a Linux OS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is just pay to get porn. the workshop is full of it and the only way you can get rid of it there is by pressing approved. what if i don't want just approved? this needs better moderation honestly. i'll keep using this, but this isn't ok to just mindlessly give anyone creative control to add anything they want.\r\n\r\nsome of my options for making this better are below. these probably wont be added because the team/people behind this obviously don't read reviews, but here they are:\r\n\r\n1. BETTER MODERATION FOR NSFW CONTENT. Just remove Mature rating in general because nobody uses it.\r\n2. filter for nsfw content. it's self explanatory.\r\n3. give people more creative freedom without the effects of putting whatever you want on it no matter if it's a s*x scene of what.\r\n4. make it more versatile and useful. the entire thing looks bland.\r\n5. reduce the lag/gpu people always get. i know it's easier said than done, but still. that sucks.\r\n\r\nif one of the people on the team ACTUALLY reads reviews, please for the love of god at least acknowledge the first 2 about the nsfw content. i can't scroll until after the second page on no custom filters in the workshop page. i know there's an in-game version that's better, but i sometimes just want to scroll that instead because it's quicker to use sometimes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute piece of trash. For 4,99€ you are getting an app that has wallpapers that you can download from google and animated wallpapers for which you can use Lively Wallpaper (which is free btw)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended\r\n\r\nThis program caused high GPU usage on my laptop while I was on the desktop. My RTX 4050 stayed active at idle, the temperature stayed high, and Windows started to lag. Basic actions slowed down, including opening File Explorer and hovering over icons. Closing the program fixed the issue at once and returned the system to normal performance.\r\n\r\nThe program has many features, but the default behaviour can push GPU load far above what you expect for a wallpaper app. Users with laptops should be careful, because heat builds up fast when the fans run in silent mode.\r\n\r\nIf you use a laptop or prefer a cool and quiet system, I do not recommend this program unless you only use static or low-load wallpapers and adjust every performance setting by hand.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "VERY GUNERINGS GAMES I NOT WANTEDS TO GAMES TU GUNERINGS PLEZ FIX GUNERS GAIMS NOT RICOMANDED",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many garbage wallpapers and too difficult to find the good wallpapers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shits ass im stuck on a old update half the wallpapers dont work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WARNING!! VIRUS CARRYING SOFTWARE!!\nNo, this is not a joke.\nI'm playing games one night before calling it for bed, the following morning I plan my day by starting up with the bois and then progressing to my homework later the day. Shockingly enough to my surprise, when I booted up my PC; it was followed by constant flashing on the screen with a missing task bar.. I try looking up solutions, nothing worked. Eventually I gave up and took it to the technician. Showed them my videos and the error message that was popping up on my screen \"shellhost.exe\". Naturally when the tech saw this error msg, he asked me if I had any desktop modifying softwares like \"fence\" or some other example. They explained to me that shellhost is a crucial part in displaying what's on my monitor, they heavily believed it was this application when I brought it up. Thankfully enough after an hour, they call me back with free of charge: didn't take him long. Bro explained to me the problem and how I can prevent this in the future. I hook up my pc and boot it up when I arrive back home, fortunately I finally had my fucking task bar back without any constant annoying ass flashing on my screen (in other words, I had full accessibility over my OWN PC again). First thing I did was uninstall this trojan horse and backed up all my files, after installing an anti-virus application. \nDo not throw your money away on this virus inviting malware. I trusted it at first, and so will everyone else. Do not make the same mistakes I did. Uninstall this software, get rid of it; or it'll get rid of your PC first.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its alright if you really wanted an animated wallpaper but imo not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too unpredictable at times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gives me a waIIpaper and it pIays music",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CANT EVENM USE MY COMPUTER BERCAUSE THIS SHIT IS SLOWING IT DOWN FUCK THIS SOFTWARE ITS SCAM ASF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if it supported macos and linux it would be really good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unnecessary use of battery life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cant recommend this till they fix the AI slop problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you dont need this, just get a normal wallpaper",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refund button is nice",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The amount of porn in the workshop is mind boggling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "full of anima slop",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}