{
  "positive": [
    {
      "review": "Initially, when I first saw this game and played it. It was quite boring to be blunt. Basic, turn your brain off game where you collect unique objects to sell. \n\nI picked it up again after years of not touching it. I wanted to 100% it. To pay tribute to someone I really care about, who is now gone from my life. \n\nI started to read the letters and lore. Nearing the end of the game, I got very uncomfortable. The letters, the soundtrack, everything started to make me really, really uncomfortable. I started to reminisce a lot, but I pushed through. I then got to the last letter of the game. Where the credits began to play. \n\nI cried, a lot. The irony begins when I learned the game is about closure and being okay with letting go. Small spoilers from here on. \n\nYou leave an unresolved past behind, one that you shared with someone you deeply cared about. The letters represent the memories that tend to arrive at a delay. The lore capsules all around the world tell a story of someone who gave up their big dream to stay with the one they loved. You are the opposite, you follow your dreams, a dream that your relationship no longer aligns with. The glass desert represents that part of you that hurts and needs extra attention to heal. It made me uncomfortable because that was its design, its the ruin of a bittersweet past.\n\nThis is a beautiful story told through a game with a silly face. It tells you it's okay. It's okay to let go and let your paths separate. You can love someone enough to stop holding them in place. You can still love them from a distance. Even if it feels like they're a thousand light years away.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Relaxing, until you get the quantum slimes, fuck those physics-breaking demons.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Chill game, lots of cute slimes, good story, long game. 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really cute game, its very good for when I need something to play just to chill, love the artstyle and the cute silly slimes\nLoved the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Flawless game!! Everything is done perfectly, the exploration, the farming itself and the automatisation that comes later. Even the achievements are fun too get. Only thing I could complain about is that there's no way you're finding every secret with just exploration. 100% in 42 hours.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Lovely chilled game! Get rich by cramming unethical numbers of your pets into cages, before force-feeding them, then selling their poop. Don't forget to deal with any unwanted additions by drowning them!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Slime Rancher brings joy and calm: collect slimes, explore the world, and enjoy every day on the ranch",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a really cute and fun and relaxing I like upgrading my ranch and the mini games the most",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 100% completing the game, i must say that this is the most fun i have had in a while, i can tell the \r\ndevelopers put a lot of passion and care into making this game, AMAZING music, good story, EXTREMELY entertaining, cute slimes everywhere you look and lots of content.\r\n\r\nThere are of course some very small issues in this game, but there are so many good features and the game is so much fun that i can't complain about them.\r\n\r\nThis game is worth every penny, 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the chillest game I've played. If you want to relax after a stressful day, just launch the game and herd some slimes.\nAt first it wasn't even clear what my goal in the game was. The game isn't explicit about it, but it comes naturally as you progress your ranch and explore. There are plenty of upgrades to unlock and lots of slime combinations to experiment with. There are set corral spots along your ranch, but you can put anything there, so the game is mostly a sandbox too.\n\nThere was just one small thing that annoyed me during the gameplay. When you explore, you can find small \"treasure chests\", but you won't be able to unlock these until much later in the game. And there is no way to mark these on your map, so you basically have to find all of them again once you obtain the key. My advice is to mark them manually on a screenshot of the map after you find one (or simply download a map checklist).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game. bro I searched for a secret ending for 2.5 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're needing a cozy game I definitely recommend, I haven't been able to stop playing for a few days and the slimes are super cute :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came for the cuties, stayed for the achievement hunting, was a lot of work but pretty rewarding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute and fun game with lots of cool mechanics/features and slimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so cute i love everything about it, running around just to catch some cute creatures. i could spend days away in this game for nothing other than to just enjoy all the cuteness. crashing the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely lovely game. Slimes are adorable and the atmosphere is as calm as a day in the beach",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun to play, runs like butter even on a pretty low end laptop. Absolutely worth the money, very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most relaxing game ever, and is so fun to play alongside others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cute game I didnt especially like the non-safe version but some people would really like that as well im sure... all the suspense and all lol anyways really fun and cute game. entertaining!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is enjoyable and has a difficulty curve thats hard in the start but easies out to simple ranching for a word of advide spoiler: give the giant pink slime i thinks called a gurdo so you can get a key to progress faster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think that if you like a bit of strategy without feeling like theres a large pressure to advance this game would be good for you, you can easily get lost in a cycle of just plort selling and farming for hours. You also can just leave and come back and it feels very organic when you open the game back up and just get back to what you were already doing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slime Rancher is a game about a carefree childhood.\n\nSlime Rancher is a game where you can pick up a controller, lie back in a chair and relax.\n\nI first played it when I was about twelve with my mom, we could run around and catch slimes for hours:)\n\nLess about me, more about the game, and the game is incredible.\n\nThe artstyle is very pleasing to the eye, the graphics aren't the best, but they don't hurt the eyes at all, and the slimes look cute:)\n\nThe gameplay isn't very deep, but it's addictive and relaxing.\n\nSo, I don't have many words about this game, but I love it very much, I bought it 2 times and would gladly buy it again if I had to, 11/10, a must-buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game a long time ago through HumbleBundle and I have such fond memories of it. It is so fun to discover slime island piece by piece. It is also really really cozy. 10/10 would reccommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it's a chill, relaxing (sometimes a bit stressful if you have lag) game to put a few dozen hours into",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You may think it's a game about managing a ranch with a bunch of cute slimes, but it's actually a game about being a capitalistic monster cramming as many slimes as you can into a single cage to maximize profits. You explore to progress the story, I explore to find new business potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill ranching game. Got everything you'd need to sit down and waste some time with your brain mostly off. Colors are vibrant, gameplay is easily grasped, low stakes. The perfect kind of game. Looks like there's lore through mail and reading if you're into that - or just speed through it if you don't care - doesn't seem to matter. Excited to see what else there is in store later in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally my comfort game. So so cute highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game on sale and started playing early in the evening. After a while I checked the time and realised it was 1 AM.\n\n10/10 will probably do the same tomorrow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit this game is so adictive even when i beat it since release as a child , better than bee swarm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that has the best advantage of simple maps, slime being so cute and adorable, and being able to memorize maps quickly\n\nAnd a game that entertains you with a lot of challenges. Season 2 has a little bit of a complicated map, so if you're not good at finding your way, I recommend 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hope the creators of this game know that I'm in love with them. Nearly every single part of this game is perfect, and the ones that aren't are mostly small frustrations that I can forgive. The colours, graphics, sound design, mechanics, and basically all components to this game all scratch an itch that after years of searching no other game has been able to reach. I love this game, and I love every person involved in creating it. I am giving each and every one of them a tender smooch on the forehead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute and fun, suitable for people that enjoys farming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i remember when this game came out i was a kid and i saw gameplay of it on youtube now i have the chance to play it and its a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game not hard and very relaxing to watch the slimes bounce around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so much fun. I love the world and how vivid the colors are in the environment, and the slimes are freaking adorable!!\r\n\r\nI wish there were more NPC interactions, as you mostly only chat when doing missions for them. The ending was also kinda meh, and not super spectacular.\r\n\r\nRush mode was a challenge for the final achievement, but I had a lot of fun with it at the end. It didn't frustrate me much like a lot of other speedrun challenges do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is literally fantastic, I'm so happy I could FINALLY play it after YEAARRSSSS. If you like animal crossing, stardew valley or other such games, this is for YOU",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game! There are so many different areas and lots of secrets to unlock. The slimes are so cute! :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Childhood game, absolutely still love it to the max!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a good game, I like to catch different slimes and loads of fun activities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute little slime-farming game. perfect for listening podcasts while gaming - casual with gorgeous graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing quite like completing a drone automated slime ranch, trying out rush mode, and it having such wildly different \"run around like a mad man\" strategy but somehow still feeling like the same game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a nice, chill, and addictive game that you can pick up any time when your bored. Also its worth grinding, which is not even that hard, so what more can you ask for!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game years ago, when i was about 10 years old, it was one of my first PC games. I got a new PC and logged back in when i was 16, and i still find the same joy, having fun exploring and trying to finish the games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the 2 best open world game i've ever played  i think colecting the slimes and food is really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very fun, relaxing and easy to get into",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very cute game with gorgeous environments, brilliant graphics, tons of things to do, fun NPCs to learn about, and a beautiful story to unravel as you play. Even if you don't find yourself particularly interested in the story within Slime Rancher, it provides you with a lot of content on the ranch, as well as the other locations on the Far Far Range, to keep you hooked and playing for hours. From growing plants, to handling slimes, to unlocking new areas, and even more; I never felt that there was a time where I was bored, or had nothing to do, while playing this game. I totally recommend this game if you're looking for something cosy, artistically stunning, fun, relaxing, and utterly adorable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems like just a typical cozy game at first, but words cannot even describe how beautiful of an experience this is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a wonderful game to unwind to. It's cozy and hella cute. You really don't need anything more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so good and the soundtrack just compliments it so well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i never realized that such a little game would have such a crazy story. I didn't even intend on beating the game yet and was trying to search for gold when i didn't even realize it was right in front of me, being played by me. Thank you Monomi Park. Can't wait to play slime rancher 2 once I 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10\n\nthis game rekindled my passion for gaming when it was at an all time low and burnt out from playing the same three games.\n\nI can't explain nor put it into words how much I recommend playing this game, even if you usually don't play farming sim type games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(i give this game a 7,5 out off 10 Plorts)\n\n💬Text review💬:\nQuite a good game, very dumb fun your goal is to start a farm with slimes by solving small puzzles or crafting items to explore more area's to get more slimes so you can keep them on your farm and sell their \"plorts\" which is fecal matter?\nYeah the main thing is to explore and find new slimes so you can sell higher rarity plorts for more money.\nWith the money and plorts you can make upgrades for your boots or such eventually even gadgets that farm rare resources or help you around your farm/ranch.\nThe slimes can merge which makes them drop both corresponding plorts so theres some fun gimmicks.\n\nThe music is very good it fits alot with the cutesy aesthetic it is very whimsy and pretty well made.\nThe artstyle is really cute as well it is very colourful and energetic. Yet the textures and motion in this game makes me wridly feel sick altough i think this is a me issue.\n\nWhat i can say is that it is a good game there is definetly a reason every youtuber played this a few years back.\nIt is kind off like a tycoon you upgrade ranch plots and yourself to get more money and plorts to get a better production.\n!!!If you dont care about the smaller story but gameplay i suggest buying the second one, its better!!!\n\n📃CHECKLIST REVIEW📃:\n💗 Audience 💗\n☑ Beginners\n☑ Casual Gamers\n☑ Normal Gamers\n☐ Expert Gamers\n\n🌟 Graphics 🌟\n☐ Bad\n☐ Alright\n☑ Good\n☐ Beautiful\n\n🎙️Voice acting🎙️\n☑ None?\n☐ Bad\n☐ Alright\n☐ Good\n\n🎼 Music 🎼\n☐ Bad\n☐ Alright\n☐ Good\n☑ Really good\n☐ Fantastic\n\n☠️ Difficulty ☠️\n☑ Easy\n☐ Average\n☐ Hard\n☐ Unfair\n\n🪲Bugs 🪲\n☐ Bugs destroy the game\n☐ Lots of bugs\n☐ Few Bugs\n☑ You can use them for speed-run\n☐ Nothing encountered personally\n\n📚 Story 📚\n☐ There is none i think\n☐ Bad\n☑ Alright\n☐ Good\n☐ Fantastic\n\n🎮 Game-play 🎮\nCute/cottagecore\nGrindy\nTycoon\nExploration\nGoofy fun\n\n🕧 Game time / Length 🕧\n☐ Really short (0 - 3 hours)\n☑ Short (4 - 8 hours)\n☑ Few hours (10 - 20 hours)\n☐ Long (40-60 hours)\n☐ Very Long (60-100 hours)\n☐ Extremely Long (100+ hours)\n\n💵Price / Quality 💵\n☑ Full price (meh you'll wait for sales on games anyway)\n☑ Wait for Sale\n☐ Don't buy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very colorful and joyous game to play on your free time, with several slimes to ranch, places to discover, and even mods! I love this game very much, having fun messing with mods, speedrunning and just playing in general! I'd recommend this game to just about anyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The OST is burnt into my brain to the point where I'll find myself humming tracks randomly while doing tasks. This game is such a classic and I've played it on almost every possible device. I love this game with my whole heart and I think everyone should get a chance to play this game. Please, if you haven't already, buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love thiz game so bad it'z so sigma and epic and cute and I can genuinely play it for hourz at a time,, highly recommend !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much! It's so cute and fun, and relatively low-stress, which is good for my anxiety :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game and I'm so happy that once you're done with this one there's a second! huge fan of both games. thanks devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have replayed this game twice and I will do it thrice. It's choppy, but refined in gameplay and story like few others I know. If you are interested in Slime Rancher 1 or 2, get this and then play 2. You'll thank me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great relaxing expirience for those who are tired of high stakes online games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The slimes are so cute!\r\n\r\n...Some of them... Some kill you, instead.\r\nWorth it for 30 bucks. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Un bonito juego de granja, simple y divertido. Es muy interesante que haya tantas formas de ganar dinero y que el juego fomente explorar distintas es genial.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The slimes are so adorable! Moreover, the environments are easy on my eyes (the lighting is just right too) and isn't as overwhelming as the sequel game, and I do like the cozy soundtrack here also.  Thus, I've been enjoying the casual exploration and game play. c:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY sigma guys but i do recomend getting the game on the deals or getting the second one first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. My brother introduced it to me years ago and it instantly made its way into my heart. even years later I like to make visits back to see it and play. If you love cute little critters and lots of nooks and crannies to stick your nose into than this is the game for you, from the absolutely adorable art style to the maze of secrets that is the map, I am sure you'll find something to love. The only 'bad' thing to this game, in my opinion, is how somewhat grindy and repetitive it can be. Once you have a ranch going it can feel a little boring having to sell all your plorts because its just back and forth and back and forth, but once you get it automated that goes away for the most part. I think the rest of the game more than makes up for it though, with the wide variety of slimes and areas to explore. The side minigames are a great pick if you'd like to spice things up while bored, two. All in all, this game is an adorable adventure on the first play, and a fun way to pass the time when coming back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The visuals and sounds in this game are so fun. I find myself enjoying so much about this game. I especially love that there are so many different challenges within the game so it keeps me engaged each time I play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "These little guys are awesome. They just hang out, be cute, and make me money when I feed them. Personally, the gameplay loop feels fresh every time despite its repetitiveness. Only a couple hours in but I'm already addicted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6.7 hours in and I really like this game! I've thoroughly enjoyed playing this game for 6.7 hours! it's been a really fun 6.7 hours so far, and I might play it for even longer than 6.7 hours! I personally recommend playing this game for longer than 6.7 hours if you're into a cozy grinding game! that is my personal opinion after playing this game for 6.7 hours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if you like something relaxing and calm, Tarr slimes and hungry largo slimes are usually the only things that will attack and they're easy to calm down or get rid of pretty fast. Wouldn't recommend to anyone that wants a fast paced game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "do you want to spend 50 hours running after slimes? then this is the game for you, just a warning, you will be obsessed, you will want to collect every single one, and in the end they WILL esscape and eat all of your food lying around\r\n\r\nPS. if anyone knows how to keep quantum slimes, please let me know",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of my favorite games to play when  I need to take a break from everything and relax. It is very easy to forget how long you are playing the game when all you are focusing on is the colorful slimes in front of you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! just dont spawn 10000 chickadoos it will break your computer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so addicting, genuinely belongs in a hall of fame for GOATS of gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wonderful game, wonderful dialogue and cute slimes... literally what is there not to like about this game??? This is a really cozy game as you don't really need to try hard enough to have fun as there are a lot of cute slimes to fuse and discover. I wasn't expecting the ending to be sad or anything like that as from start to finish I was just having fun exploring maps and fusing slimes. But really, this is a fun game and would recommend to those who like cute creatures and farming !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is soooo fun. I haven't played it as much on Steam but played a ton on xbox years back. Genuinely one of my favorite games. It's so cozy and relaxing, the storyline is great but minimal, and the mechanics are easy to understand. The exploration/adventure aspect is a big plus for me. I love being able to combine the different types of slimes however to make largos. Overall a great game in my book.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game to pass the time on. Cute slimes, fun secrets. Easy mechanics and guides you through instead of throwing you in like some games I played has.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A relaxing game that sadly becomes boring after unlocking all the worlds (about 15 hours)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An adorable game that i had a wonderful time playing, leaving this review since i forgot to do so before",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, although i get lost a lot even with the map lol i wish fast travel was easier to unlock\r\notherwise i love this game but it does get a bit tedious if you still don't have the upgrades like the drones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slime Rancher is a YouTube classic, I distinctly remember its boom of popularity being far more wholesome than the others at the time, and it's still a pack of that wholesomeness.\r\n   It's really hard to describe, but somehow the game manages to make walking around the same areas multiple times fun, because this time you have a goal, and the next time you go through, that goal is different. Sometimes you're going in to get slimes, sometimes to collect resources and make money, and sometimes to collect secret items. Although it sounds simple, it's weirdly engaging, as you have to take care of the slimes in your ranch as well, getting upgrades for them and yourself.\r\n   How the game makes those upgrades important is by starting you out with very few options and cash, giving you a goal right from the get-go: Make your own life easier. Be with more sprinting time, more storage, or even means of defense. I think the overall gameplay and item-gathering is superior to its sequel. It's way less greedy and grindy, and you can get what you're going for way faster.\r\n   Now I'll stop being vague and talk about the environments: First you have the Dry Reef, simple slimes, simple shore beach with some plateaus, perfect to begin. The Indigo Quarry introduces you to more dangerous slimes, water, and risky jumps. The Moss Blanket loves its aggressive slimes, and is very intricate on how to find the secret items. The Ancient Ruins is a maze that is fulfilling to solve, and the Glass Desert, well, it really is the final area and isn't afraid of you knowing. You'll spend a lot of time on these, as well as the extra areas that were added later with updates. They are all great, extremely memorable, and without a single bad or unforgiving place.\r\n   Ranching-wise, it's okay, it has methods of automation which is always good, but it's not complex, and that might appeal to some. If you like decorating though, there's a lot to choose from, but they need resources that might be better off used in upgrades.\r\n   The graphics were also not much at the time and is now also overshadowed by Slime Rancher 2, but it's not bad to look at, and the style itself is on point. The music is fantastic, you don't get tired of it, and it fits the wonder of exploration very well.\r\n   This game is easy, you're only going to die if you fall accidentally, but some puzzles may take time figuring out. Replay value: absolutely. Achievements and secrets: yeah, you're going to need a guide.\r\n   Not much else to say besides the fact that the vibe this game gives is great and might really cheer you up. It may be old now but it's still gold.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is pure happiness. the Slimes are incredibly cute and make noises bound to put a smile on your face! and it's not really a story-based game, so you can ranch as much as you like. the only pet peeve i have is that it's a bit grindy with some resources and unlocks, but once you unlock the [spoiler] glass desert [/spoiler] it's a good bit less grindy, and more \"oh boy let me find this slime and prepare a house for him!\" :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very calming game that doesn't require insane brainpower to play, easily can be played with music, youtube, or media on the side. Great game, addicting at that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Did not expect the bittersweet yet touching subplot with Casey and the comparison between Hob and Bea... in a goofy slime game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far with how long I've played the game (100%d it), I have encountered very few bugs, most of which were funny and/or didn't get in the way of my enjoyment of it! The game may be repetitive at times, but there's always something to do, even if it's just goofing around.Other things to note of is the story is fascinating, the soundtrack is lovely, and I always find myself wanting to return to this game, even though I had finished it's story. Absolutely worth every penny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, cute lil slimes. Its fun and relaxing, super easy to get into and impossible to put down. It kind of reminds me of minecraft in a way? its something play from time to time, never fully growing out of it and when you come back to it, it feels like you never left. \n\nI had and still have fun playing this game, even after the main game/story is completed. Now i just need to 100% it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overwhelming but in a good way somehow??? once you get going you get into this rhythm and you realize you've been playing for 3 hours straight with no breaks. amazing art style, the glowing slime is so cute T_T\r\n\r\nit is a little confusing at first setting everything up like graphic and making the game fit your screen but other then that its good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun and relaxing game to chill and lay back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really recommand the game, very fun and cute. I relaxed so much by playing this game❤️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute and adorable exploitation and slavery \nbest of both worlds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. It's fun, cute & easy to get lost in. My only thing I could slightly complain about is the fact that its not multiplayer. I think multiplayer would make this game sooooo much more fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite games of all time. Used to play it on my X-box when i was younger. Some of my fondest memories. The games peak. Would really recommend. I've lots about 500 hours total on this game. 10000% worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy and chill. Most of the time until the Tarr get you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love farming slimes and farming plants and this game has really good quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, Slime Rancher surprised me more than I expected. I started playing it a couple of years ago thinking it would be a simple and cute game… and I ended up completely hooked, raising slimes like they were my own pets. Its relaxed atmosphere has something very special about it: exploring a new biome, finding a rare slime, or simply tidying up the ranch is incredibly comforting.\n\nIt's one of those games you start playing \"for a little while\" and, before you know it, hours have passed. It's not perfect—it can get a bit repetitive at times—but the tranquility and warmth it conveys more than make up for it. Each slime has its own personality, and watching them hop around the ranch always brightens my day.\n\nIf you need a game to disconnect, relax, and feel good, this is the one for you. For me, it was a truly wonderful experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Speaking from over 300 hours of experience on my other account...\r\n\r\nThis game's alright I guess",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, cute. and wholesome game at best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is really good but really boring.\n\nThe achievements are really grindy, it was not a fun experience.\n\ncompleted in: 17 hours.\n\nstill a really great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun! Very simple, and very interesting little game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good, very nostalgic for me at least, pretty chill and fun to play if stressed out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Adorable, easy going, and overall just a game to pass the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cute and cozy game, love the exploration,lore and ofcourse farming slimes",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Slow, boring, grindier in the end game than some roblox tycoons I've played. It's just overall not a very good feedback loop and I think people glazing this game just don't play very many games like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty much a mid game, gets boring quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "extremely cute\nextremely boring and tedious",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Second time playing through, I got to the Glass Desert again (10 hours in) and I got hit by the same feeling that had me drop the game 6 years ago:\n\nThe game has limited automation and it often feels like it actively hinders automation, so much of the game is just busywork what with the limited hotbar and item-stacks. It's just annoying and hard to enjoy the game knowing that the ranch is falling apart if you're not constantly doing busywork to keep the slimes fed. \n\nMoney is also worthless by the mid-game, I don't even have a purpose in playing now except to speed through to the ending. But that's not enough justification to care to keep playing it, it's too annoying to keep sinking hours in to this trying to combat the poor end-game or near-end-game design choices stacking up.\n\nIt was nice playing the first half of the game though, shame the second half is just so annoying",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm sad I didn't like It more because I really had expectations. Sadly It was abit empty and boring to me. It's just a bunch of daily chores.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The start is really entertaining but once you get to the Slime Lab it's really tedious.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game gets pretty repetitive and boring. The slimes are \"cute\" and that's the whole game. For the most of my time I explored the map - but it's just so plain and boring. This game isn't even relaxing and satisfying either. My slimes kept running away and breeding on their own and it pissed me off so much. I love chill little games (don't get me wrong), but this wasn't enjoyable for me. After 3 hours of playing I can say that I don't want to play it anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was fun at first but I was left just wandering around aimless after I set up a profitable farm",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly hate hating on this game. Love the style the gameplay everything is GREAT but it is just so BORING. I tried. again and again. I can't see myself playing this game for more than 30 minutes at a time. The first time I played I was having so much fun. Later I was just playing for the sake of playing, doing whatever I can without actually doing anything because it was boring. It really started to kick in when I got to Glass Desert. I'm all for the goofy slime gameplay, but something about this game just makes it unplayable. I'm not saying don't buy it it's probably just me, but i've only been having fun in the Rush Mode.. kinda. I'll try playing the game again at some point, and if I do i'll do an update, but until then the dislike stays.. sadly.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I cracked this game many, many years ago but never played it the \"correct\" way, which brought me to buying the game some days ago.\nInitially fun, but with each hour spend it progressively gets more grindy, filled with extreme amounts of backtracking. You want to remove the backtracking? Grind insane amounts of resources for two teleporters. \nGrinding, backtracking, grinding backtracking.\nAfter around 6 hours I've basically seen like 80-90% of the game and because of the stuff the game expects me to do right now I definitely don't feel like continuing.\nI wish I'd enjoy it more, maybe the second game is better in that regard.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its exciting when you first start playing and its fun in the first couple of hours but after that its just repeating the same stuff. Go out for food, explore the same locations over and over again, get keys sell plorts. Gameplay stays the same through the entire game with small changes. If you want it then buy it but its not that good like people on social medias say.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Slow, boring, grindier in the end game than some roblox tycoons I've played. It's just overall not a very good feedback loop and I think people glazing this game just don't play very many games like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty much a mid game, gets boring quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "extremely cute\nextremely boring and tedious",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Second time playing through, I got to the Glass Desert again (10 hours in) and I got hit by the same feeling that had me drop the game 6 years ago:\n\nThe game has limited automation and it often feels like it actively hinders automation, so much of the game is just busywork what with the limited hotbar and item-stacks. It's just annoying and hard to enjoy the game knowing that the ranch is falling apart if you're not constantly doing busywork to keep the slimes fed. \n\nMoney is also worthless by the mid-game, I don't even have a purpose in playing now except to speed through to the ending. But that's not enough justification to care to keep playing it, it's too annoying to keep sinking hours in to this trying to combat the poor end-game or near-end-game design choices stacking up.\n\nIt was nice playing the first half of the game though, shame the second half is just so annoying",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm sad I didn't like It more because I really had expectations. Sadly It was abit empty and boring to me. It's just a bunch of daily chores.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The start is really entertaining but once you get to the Slime Lab it's really tedious.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game gets pretty repetitive and boring. The slimes are \"cute\" and that's the whole game. For the most of my time I explored the map - but it's just so plain and boring. This game isn't even relaxing and satisfying either. My slimes kept running away and breeding on their own and it pissed me off so much. I love chill little games (don't get me wrong), but this wasn't enjoyable for me. After 3 hours of playing I can say that I don't want to play it anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was fun at first but I was left just wandering around aimless after I set up a profitable farm",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly hate hating on this game. Love the style the gameplay everything is GREAT but it is just so BORING. I tried. again and again. I can't see myself playing this game for more than 30 minutes at a time. The first time I played I was having so much fun. Later I was just playing for the sake of playing, doing whatever I can without actually doing anything because it was boring. It really started to kick in when I got to Glass Desert. I'm all for the goofy slime gameplay, but something about this game just makes it unplayable. I'm not saying don't buy it it's probably just me, but i've only been having fun in the Rush Mode.. kinda. I'll try playing the game again at some point, and if I do i'll do an update, but until then the dislike stays.. sadly.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I cracked this game many, many years ago but never played it the \"correct\" way, which brought me to buying the game some days ago.\nInitially fun, but with each hour spend it progressively gets more grindy, filled with extreme amounts of backtracking. You want to remove the backtracking? Grind insane amounts of resources for two teleporters. \nGrinding, backtracking, grinding backtracking.\nAfter around 6 hours I've basically seen like 80-90% of the game and because of the stuff the game expects me to do right now I definitely don't feel like continuing.\nI wish I'd enjoy it more, maybe the second game is better in that regard.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its exciting when you first start playing and its fun in the first couple of hours but after that its just repeating the same stuff. Go out for food, explore the same locations over and over again, get keys sell plorts. Gameplay stays the same through the entire game with small changes. If you want it then buy it but its not that good like people on social medias say.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Slow, boring, grindier in the end game than some roblox tycoons I've played. It's just overall not a very good feedback loop and I think people glazing this game just don't play very many games like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty much a mid game, gets boring quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "extremely cute\nextremely boring and tedious",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Second time playing through, I got to the Glass Desert again (10 hours in) and I got hit by the same feeling that had me drop the game 6 years ago:\n\nThe game has limited automation and it often feels like it actively hinders automation, so much of the game is just busywork what with the limited hotbar and item-stacks. It's just annoying and hard to enjoy the game knowing that the ranch is falling apart if you're not constantly doing busywork to keep the slimes fed. \n\nMoney is also worthless by the mid-game, I don't even have a purpose in playing now except to speed through to the ending. But that's not enough justification to care to keep playing it, it's too annoying to keep sinking hours in to this trying to combat the poor end-game or near-end-game design choices stacking up.\n\nIt was nice playing the first half of the game though, shame the second half is just so annoying",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm sad I didn't like It more because I really had expectations. Sadly It was abit empty and boring to me. It's just a bunch of daily chores.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The start is really entertaining but once you get to the Slime Lab it's really tedious.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game gets pretty repetitive and boring. The slimes are \"cute\" and that's the whole game. For the most of my time I explored the map - but it's just so plain and boring. This game isn't even relaxing and satisfying either. My slimes kept running away and breeding on their own and it pissed me off so much. I love chill little games (don't get me wrong), but this wasn't enjoyable for me. After 3 hours of playing I can say that I don't want to play it anymore.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was fun at first but I was left just wandering around aimless after I set up a profitable farm",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly hate hating on this game. Love the style the gameplay everything is GREAT but it is just so BORING. I tried. again and again. I can't see myself playing this game for more than 30 minutes at a time. The first time I played I was having so much fun. Later I was just playing for the sake of playing, doing whatever I can without actually doing anything because it was boring. It really started to kick in when I got to Glass Desert. I'm all for the goofy slime gameplay, but something about this game just makes it unplayable. I'm not saying don't buy it it's probably just me, but i've only been having fun in the Rush Mode.. kinda. I'll try playing the game again at some point, and if I do i'll do an update, but until then the dislike stays.. sadly.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I cracked this game many, many years ago but never played it the \"correct\" way, which brought me to buying the game some days ago.\nInitially fun, but with each hour spend it progressively gets more grindy, filled with extreme amounts of backtracking. You want to remove the backtracking? Grind insane amounts of resources for two teleporters. \nGrinding, backtracking, grinding backtracking.\nAfter around 6 hours I've basically seen like 80-90% of the game and because of the stuff the game expects me to do right now I definitely don't feel like continuing.\nI wish I'd enjoy it more, maybe the second game is better in that regard.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its exciting when you first start playing and its fun in the first couple of hours but after that its just repeating the same stuff. Go out for food, explore the same locations over and over again, get keys sell plorts. Gameplay stays the same through the entire game with small changes. If you want it then buy it but its not that good like people on social medias say.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Slow, boring, grindier in the end game than some roblox tycoons I've played. It's just overall not a very good feedback loop and I think people glazing this game just don't play very many games like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pretty much a mid game, gets boring quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "extremely cute\nextremely boring and tedious",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}