{
  "positive": [
    {
      "review": "GOATED studio making GOATED games since 2010s. 10/10 game. Absolutely love it! NPCs are very responsive and adapt intuitively to your fighting style. I'm impressed by the depth of combat moves AI can pull of at times. \r\n\r\nLarian studio, please, keep making more quality games like these. 😎",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "I bought Baldurs Gate 3 due to the hype and was honestly not that impressed. Divinity 2, however, does what in my opinion that game didn't. It's characters and their story lines are much more interesting, the world is gray and thought provoking, much of the 'evil' in the world has rational reasons or justifications. On top of that, the combat is fun and has so many synergies and play styles and doesn't feel overly RNG based or frustrating. Play with a guide on hand though, as some stuff is very hard to figure out.",
      "voted_up": true,
      "votes_helpful": 37
    },
    {
      "review": "Divinity: Original Sin 2 is an amazing RPG and a perfect choice for fans of Baldur’s Gate 3. It’s clear that many ideas later seen in BG3 started here. The story is well written and the characters are interesting. The story is strong, but most of it is told through dialogue and text, so it doesn’t feel as cinematic as BG3. Combat is turn-based, fun, and challenging. The game makes great use of combining elements and surfaces, so there’s always something to experiment with. Most situations can be solved in different ways. The world is full of side quests, hidden spots, and interesting situations. Exploring is genuinely rewarding. The whole game was played in Honour mode in co-op, and it was an incredible experience. Encounters were great and every mistake could be fatal. This game is a great option that is worth playing. It does not have modern cutscenes, but the story is great, fun combat, and co-op mode more than make up for it. Highly recommended for anyone who enjoys BG3 or turn-based RPGs in general.\n\n[h2] Pros: [/h2]\n- Great game design\n- Phenomenal story\n- Co-op mode\n- Wonderful music\n- High replayability\n- Freedom in solving quests\n\n[h2] Cons: [/h2]\n- Lacks cutscenes\n\n[h1] Overall rating: 9/10 [/h1]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "My objective of obtaining source failed so miserably that Malady traversed through the endless realms searching for the answer to where to go next without feeling the same level of anguish she felt from watching my inability to follow instructions :)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the best RPGs ever made, deep systems, incredible characters, and endless room for creativity. A masterpiece of modern role-playing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Ways you can build your character are diverse, and you can really go nuts- no holding back. The story is excellent, and when you’re done with the game you feel like you’ve had a great adventure. I recommend playing with an origin character, but that’s not necessary. If you’re coming from Baldur’s Gate 3, this game’s combat is a bit more “sticky.” Even so, I consider this game the better of the two. The narrator and music are 10/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "big fights ☑️\nbig fires ☑️\nbig lizards ☑️\nbig betrayals ☑️\nhow to become god in [strike]3[/strike] easy steps ☑️\n\nmy first Larian game, and it made me trust them fully with whatever came and will come afterwards (and oh how they delivered with BG3)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Similar to the first game, but some of the gameplay refinements are well appreciated. Less hidden object puzzles and such. Overall the game is challenging enough to keep my interest and the branching paths of choice in story is enough to offer replayability.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty good game. Started in a bucket hat and ended in a bucket hat and my wife became divine. So a pretty solid game, will be playing again after a break. :) <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has a really good story and gameplay, but it's better for singleplayer. For playing with a partner DOS1 is better.\r\n\r\n+ better character creating menu\r\n+ there is a way for endless changing your character's look and stats without loosing skills\r\n~ maybe better role system\r\n- I don't like new physical and magical armor system, it forces to attack with weapon OR magic, without combining.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Análise em PT-BR logo abaixo\n\nThis is one of those great games where you think, \"Why didn't I play this sooner?\". Divinity Original Sin 2 (DOS2) is the sequel to the already acclaimed DOS by Larian, who are also responsible for Baldur's Gate 3 and all Divinity games. And it felt so good to play this game right after playing the first one; everything here is better: more lore, more exploration, more skills, and more fun and challenging battles.\n\nThe lore is excellent and everything in the game fits together; it's incredible how even the side quests offer more depth. The graphics are better, more detailed; every piece of equipment is more beautiful than the last, and each item adapts to the race—the same helmet, for example, will have a different look for each character when equipped.\n\nExploration is rewarding. There's no grind here, but it will help you reach the recommended level for the tougher battles, besides opening up alternatives to solve the main quests.\n\nThe soundtrack is incredibly good. I recommend choosing Lohse as a companion for a wonderful surprise at the end of her personal quest.\n\nIn short, it was more than 200 hours well spent, and I'm rooting for Larian to release the third game with the improvements made in BG3.\n\nEsse é daqueles jogos bons que pensamos, \"por que não joguei isso antes?\". Divinity Original Sin 2, é a sequência do já aclamado DOS da Larian, responsáveis também por Baldurs Gate 3 e todos os jogos Divinity. E como fez bem jogar esse jogo logo depois de jogar o primeiro, tudo aqui é melhor, mais lore, mais exploração, mais skills, batalhas mais divertidas e desafiadoras. A lore é excelente e tudo no jogo se encaixa, é incrível que até as quests secundárias se aprofundam mais. Os gráficos estão melhores, mais detalhados, cada equipamento é um mais bonito que o outro, e cada item se adapta a raça, o mesmo capacete por exemplo, vai ter um visual para cada personagem ao ser equipado. A exploração é recompensadora, não tem grind aqui, mas vai te fazer chegar no level recomendado para as batalhas mais difíceis, além de abrir alternativas para resolver as quests principais. A trilha sonora é absurda de boa, recomendo escolher a Lohse como companheira, para uma supresa maravilhosa no fim da quest pessoal dela. Enfim, mais de 200 hrs bem gasta e torcendo pra Larian lançar o terceiro jogo com as evoluções feitas no BG3.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can't manage a regular D&D session? Play this. Excellent in co-op, no doubt it would be amazing in solo as well. Now also has a massive array of workshop mods. Ludicrous level of replayability and branching paths.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best RPG's ever made. It has both engaging gameplay and a very high personality, it really puts you immersed into the world.\nYour stats have a high impact both gameplay-wise and roleplay-wise, which is really rewarding when you discover a good combination while putting you in character.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got angry at the final fight and left a negative review, it's actually pretty good aside from the fights where there is some random condition to stop enemies from infinitely respawning, like the final fight.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only have 100+ hours because my brother used my account. I don’t like it that much",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, put in over 100 hour into and just finished. I put off playing the game for year because I heard how long of game it is. I should have played it years ago was well worth the investment in time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As I understand it, this game was a proof of concept to get a license to work on the Baldur's Gate 3 title.\r\n\r\nIt's not D&D in any way, but the mechanics are pretty close and worth playing. (Probably more so if you have friends, too.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Boy, did I hate the original Original Sin. Uninteresting protagonists with gratingly chirpy voice acting, needless and annoying pixel hunting-based \"puzzles\", a mandatory and tedious world-wide Easter egg hunt before progressing to the game's final stage, DOS1 had it all, where \"it\" is anything that makes you want to claw to the bottom of your eye cavities.\n\nIs DOS2 any better? Hell yes. But annoyingly, it has its own bagful of crappy design decisions. First, and worst of all, behold the tonnage of stupid, obscure, burdensome puzzles that quagmire pacing. I am a self-identified point and click adventure enjoyer. I even have a fondness for the genre's janky, non-intuitive riddles. And still DOS2 manages to make me seethe with its sloppy, crappy, time-dumpstering, no good, joy-impeding brain teasers (described as such because they make you want to tease your brain out of your skull with an elephant gun). By the game's third act, if I spent more than 30 seconds puzzling over a garbage mental challenge, straight to a Wiki I went for the answer, because fuuuuck that. \n\nSecond, it's disappointing how much DOS2 revolves around CC'ing your oppenents before they can CC you. When the latter happens, boy is it a drawn out spectator shart of an experience whereby you sit idly for a few minutes waiting for the the punchline that is inevitably a Game Over screen. \n\nCan you build your party around this CC-incentivized combat system? Of course. The easiest path is to make your characters focus exclusively in either Physical or Magic-based damage, and to Glass Cannon-ize every last one of them. Is it enjoyable to do so? Well not when I feel forced to. \n\nOverall, DOS2's story, main cast of characters and voice acting are all loads better than its predecessor. But I played this whole damn game with an undercurrent of annoyance that neither BG3, Tyranny, Shadowrun, Pillars, nor Disco Elysium subjected me to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, story could be better but still holds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game overall, definitely one of the best games I've played. Anyone wanna try out this game should be careful with the items since you might accientally sell or throw away key items. Almost all the acts in the games are great, execpt the last one in Arx can be really frustrating with some ridiculous enemies and annoying quests. I recommend following a spoiler-free guide if you ever reach Arx.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So after sinking way too many hours into this game (and restarting like five times because I can’t decide on a class), I can safely say Divinity: Original Sin 2 is one of the best RPGs I’ve ever played. It’s the kind of game where you tell yourself “I’ll just play for 30 minutes,” and suddenly it’s 3am and you’re arguing with a talking skeleton about morality.\n\n✔ The Good Stuff\n\nThe combat is amazing. It’s turn-based but super creative — every fight feels like a puzzle. You can set the floor on fire, electrify puddles, teleport enemies off cliffs… basically, if something looks like it might do damage, it probably will. The game really rewards experimenting, and sometimes accidentally blowing up your own team (it happens more often than I’d like to admit).\n\nThe story and characters are great too. Everyone has their own weird backstory, and the choices you make actually matter. You can talk your way out of fights, cheese bosses with clever tactics, or just cause chaos because you felt like it. There’s a lot of freedom, almost too much — I kept getting distracted by random quests I found while snooping around people’s houses.\n\nAlso, co-op is a blast. It’s rare to find a game where you can play a full RPG with a friend and have the world react to both of you. Half the fun is watching your buddy pick dialogue options that get the whole party in trouble.\n\n⚠ The Annoying Stuff\n\nIt’s definitely not a casual game. The learning curve is pretty steep, especially in the beginning. The game hands you a spoon, a stick, and a piece of string and expects you to figure out how to survive. Also, inventory management is… a lot. Thank god for backpacks.\n\nDifficulty spikes can be rough too. One minute you’re wiping the floor with enemies, and the next you walk into the wrong area and get deleted in one turn.\n\n🎯 Final Thoughts\n\nIf you love deep RPGs with tons of freedom, tactical combat, and the occasional moment of “wait, did I really just set my own team on fire?”, this is absolutely worth playing. It’s a big, messy, fun, insanely detailed game that rewards you for thinking outside the box. Not perfect, but honestly pretty close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my first time playing a CRPG, and thanks to this game, I completely fell in love with the genre. The freedom and possibilities it offers are incredible, letting me tackle challenges and shape the story in so many ways. The story itself is captivating, full of twists and meaningful choices. My companions quickly became more than just allies. Their personalities, humor, and struggles made me genuinely care about them, and over the course of the game our bonds grew so strong that I truly enjoyed every interaction with them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty good.  Its gameplay is interesting, and the abilities are truly unique in many cases.  I also enjoy there is a lot of versatility in what builds players can make and what builds can go well together.  The characters are compelling, and the story is engaging (although it might take some time to start up if you are not familiar with the franchise).  It can be a little difficult to start up given how different this game is from others like it.  Once the economy of the game is understood, and the armor/CC mechanics, the game is really fun.  \r\nThe only real downside I would report is the magic, which will at times lead to damage being delt that was not intended.  That being said, this is not often an issue, mostly a nuisance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "arcade baldurs gate 3. the only thing it lacks is an alignment tracker of your evil deeds making the games ending really weird unless killing everybody really did save them?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a Godwoken now!!\r\n\r\nThis game is freaking awesome!! please get it and play it. You can create your own character or pick the preset one. All with back story and choices that lead to out come of event for each one. Story is very driven, think about it like The Witcher 3 but with turn based strategy with things you can do like, pick pockets, lied or convinced people to believe you. Just good stuff. Please support the developer and get this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I completed Act 1 and had great joy with the game in that part but unfortunately Act 2 did not really managed to captivate me as I felt extremely bored with the gameplay, although Act 2 looked stunning I had enough with the game after completing Act 1. With Act 2 the combat felt extremely tedious and using the same skills over and over do not really provide a good sense of gameplay to me even if the enemies and the places I use them in changes. \n\nA great game and I think its writing and lore is much more better then Baldurs Gate 3 but gameplay-wise I don't think this game manages to evolve itself enough to keep it interesting. Still, it was a great joy to leave Fort Joy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I cant get over how much I love the Divinity games, as well as Larion studios. The story telling is just incredible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10 kind of challenging. The lore and story didn't pull me in much but I enjoyed the game play regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun trip down memory lane and a great way to see great story telling in games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dificult entry step, but oh boy it's worth it. I started on Explorer mode and some fights are easy, even too easy, so I’ll probably use Classic mode in my next playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoyed BG3, you’ll almost certainly love this too. The combat system is different, but it’s incredibly fun once you get into it. The voice acting is solid, and the visuals/animations still hold up impressively well for a 2017 release. I’m having a great time with it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I cant believe I just found this game.  The story is completely gripping leaving you yearning for more.  The character each have depth and with their own story lines.  The battles are well placed and meaningful.  The graphics, especially for a game at this age, are stunning.   A complete masterpiece.   I would dare to say its even better than BG3.   This is game is a must for any true RPG'er.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As opposed to Baldur's Gate 3, this game has an original onset in its world and storytelling, it has Larian's quirky, goofy handwriting and fantasy style. All things that should not have been in Baldur's Gate 3. This is what Larian used to be before they made the mistake to tap into an old and outstanding franchise set in a dark fantasy realm. Better enjoy DOS2 than BG3. DOS2 includes a brilliant combat/skill-system and likeable characters and story. All this, because they were free when designing it and didn't have to try to include a foreign ruleset. I think as a native Larian game this is the pinnacle. Enjoy (Coming from someone who is not a Larian fan, but played all their games back in the days starting with Divine Divinity)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Divinity Orginal Sin 2 is the predecessor of Baldur Gate's 3. It is one of the best games produced by Larian Studios and will remain one for many years to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the game that revitalized my love of gaming. This is a close-to-perfect western RPG. It has flaws but the rest of the game is so immaculate and unique I do not care. This game is fun and its even better with friends. It is impossible to not recommend this game to anyone who loves RPGs. It also completely revived the love for strategic turn based combat for the industry and thank god for that.\n\nThis is a game that if I meet a new friend, I always suggest we do a play through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall it is a great game with a really deep and engaging story and gameplay. It does have a bit of a learning curve though; and some bits can get slightly tedious. But beyond that I do not regret buying this game and playing through it fully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing. the first game i played from larian. combat is fun and engaging. plenty of options for whatever build you want to make, and it is very fluid. story is engaging and has a lot interesting ideas and plot points. so many different ways to play and abilities to make use of.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is goated. I've played it so many times even after playing Baldur's Gate 3. I find the combat in this game more satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games I wish I could go back and experience again for the first time. If you're looking for a CRPG, this is the gold standard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steam store description says \"The critically acclaimed RPG that raised the bar\".\n\nI agree with this description 100%. I enjoyed this more than Baldur's Gate 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Divinity: Original Sin 2 taught me many things: friendship, betrayal, tactical brilliance and that Pyroclastic Eruption is basically an oh-**** nuke disguised as a spell. \n\nForget strategy, why carefully position your party when you can just press the ‘delete enemies’ button? I cast it once and accidentally ended a fight, a forest, and possibly the concept of balance in friendship itself. Sorry Charlie, better to wait for the next encounter~\n\n10/10, would crater the map again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the meaningful choices you make along the way, they really have impact on the game without breaking it. \r\nIf you are like me that always wanted a tabletop RPG experience, but don't have nerd friends, go for it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible! That's all I can say for this game! Thank you Larian for making this type of game! Wonderful, fabulous, idk what else I can say! Incroyable!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's over and I cried when I had to say goodbye to my companions.\r\nWhat a great game!\r\nLianna :O)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I thing you can play it multiple time try dif. build and choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than 1 for sure, still has some issues.\r\nHeavily implied you should play with origin characters.\r\nStealing cap for items is cringe.\r\nAfter quests some NPCs would run away at the speed of light. What is this shit?\r\nLeadership is much worse then in 1. Crafting is still ass.\r\nStat rng on items is wild. You can get a two-handed sword with +2 to single-handed weapons.\r\nIn the end, fight with Rex and Kraken is MUCH MUCH MUCH harder than fight with LITERAL GOD.\r\nEnding slideshow is ass and buggy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great RPG, choices matter, Great music and story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most interesting mechanics in RPG games. It makes sense that Larian was able to provide such a great experience with BG3 after that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was recommended to me and is worthy of paying it forward. Great story so far with tons of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, great world to explore. Nice story and a good amount of humor in the dialogue",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite all time games. Worth many replays with different characters and combinations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has exhausted me  as i just got 100% achievements, but its honestly very fun. Mods are fully optional for the game itself is amazingly done. \nSebille best girl, also make bigger discounts for bg3, thanks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing CRPG, great writing, characters, graphis, gameplay, lots of choices. 100% good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first time playing DOS2 was a fail because the many rules and details felt confusing and too complex. After 2 years, and because I loved BG3, I decided to give the game another try. While the companions were not quite as deep as BG3's, the amazing combat system more than made up for it, DOS2 def is a superior game when it comes to combat while BG3 has better story and dialogue. I was so so so hooked by the game that it took me a long 32 hours just to get out of the first map. [h1]TL:DR[h1] Another Masterpiece by Larian.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best turn based rpgs ever made. I personally prefer it to bg3 due to having less restrictions on build customization. Story is great, characters are great, and the ability to play how you want makes the game feel great. Only thing I wish was that it was a little easier to get specialized arrows for the ranger class. I never know when I am gonna get more so I end up hoarding them for 95% of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. I was fortunate enough to show it to my husband and he was instantly hooked on it as well, so we bought him a copy to play together. I enjoy this game so much so that I actually have it on three different systems; PC, XBox, and Switch. Even the first game was great, too, though the sequel is so much better in every single way. The story is great, too, as well as the characters. A genuinely great RTS game. Absolutely worth the pricetag, especially if you end up nabbing it on sale! Do not pass this title up if you're into these kinds of games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Magnificent... I came here after playing BG3, and I'm gladly impressed by DOS2.\r\nGreat game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game with deep strategic combat and no bad dicerolls to annoy you. If you enjoyed BG3, you owe it to yourself to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little slow and awkward at first but finds it's groove quickly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "starts out super slow and has a funky small font dialogue when played on PC, but once you get your first companion (go with their talents), you have an engaging game play.  This is not for those who really like up in your face spell graphics, because it is similar to more of a turn based Diablo like spell play.  The world is really beautiful and fun to explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games ever. After the success of BG3, I can't wait to see how Divinity Original Sin 3 will be like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a GREAT game and peak RPG. As a musician myself I love how the music is deep and atmospheric, which in my opinion is much more memorable than the soundtrack of Baldur's Gate 3.\n\nThe combat is snappy, almost too repetitive but still rich and satisfying, where you feel good to line up multiple enemies into a single spell like Lazer Eyes, Fan of Knives... However, it's a shame that on harder difficulties, the best plan is always to constantly retreat so that you separate the enemies while forcing them to spend action points chasing you. It's a common problem in RPGs and I do wish this game rewarded you more for staying in the enemies faces and walking into a brawl instead of starting the engagement from afar.\n\nPersonally, I had a more fun time playing this game with a party of 2 Lone Wolves (the trait that buffs you for being solo) than a full group of 4. I guess that's because the flow goes faster if you are playing with less characters (not to mention their capabilities to kill are buffed).\n\nAnother criticism I have of this game is that, while Act 1 and Act 2 are spectacular, Acts 3 and 4 are less so. Despite that, it's absolutely worth to play this game and see the whole thing for yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so fun!! I think its more difficult gameplay wise to BG3 and there's definitely some things that they took from this and improved upon in BG3 and so it felt weird to go backwards (also the way the AOE attacks just ruin the battlefield is funny and also a bit annoying lol) but all in all this game has a wonderful story and intriguing characters. Can't wait for DOS3!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm having fun in finally getting a chance to play this. It's really well done. My main complaint is that there isn't a key to press to highlight all objects that can be interacted with. The ALT key only highlights some things and seems to be mostly just loose items on the ground, but not the chests, boxes, barrels, etc. I've looked everywhere in the settings and don't see anything to adjust that. It really bothers me as all modern day CRPG's have this feature, so it's strikingly odd for them to have never programmed it into this game. Almost like it's intentionally left out with it working on some things but not others. Grr!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play with friends, especially when its hard to play regularly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I guess this was a long time coming. I have spent over 300 hours trying to complete this game. However, after over 7-8 unsuccessful tries of finishing the game co-op with a friend, I decided to solo this adventure and today, I finished what is rightfully a legendary game. It is an adventure filled to the brim with lore and story and action at every turn. I know a lot of people do not like the turn based combat but this game does it so well and also the constant challenge of the fights keeps you hooked wanting to do better and understand the mechanics of the games. It is a simple game with various consequences to your actions ultimately leading you to decide if you wish to be the all ruling GOD or give in for the world peace. The characters are really well written with each having a story of its own to keep you hooked to them till the end. Everyone gets a happy ending of sorts and it is a bittersweet decision to be done. It can get overwhelming considering the length of the game but you gotta keep pushing. ACT 2 is the biggest section of the game where the story sets in deep but the rest of the acts are quite small. I say play this one alone at first and then, if you have the patience for a second run, go for it with mods for QOL improvements. Overall, I had a blast playing this and I am so glad I was able to finish this game. \r\n\r\nAnother masterpiece from the great Larian Studios. ❤️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best RPG I have played.\nVery nice secondary characters, the combat is fun (too much fire sometimes), and the story is actually good. I don't have any problems with this game or any criticisms. The number of hours you can play with new runs, characters, and decisions is overwhelming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first bought this game I clocked in 90h in a single week and believe me, my playtime on steam is not accurate to the real hours I have poured into this gem of a game. I couldn't put it down. Never before I had seen such passion and care put in an RPG, from story to dialogue to exploration and combat, and the music! The soundtrack is simply divine.\nI knew I was in for something special the moment I was able to pick an origin instrument at character creation, one that would define the tone of the soundtrack I would hear throughout the entire game.\nIt's insane.\nWe all know Baldur's Gate 3 and yeah, it's amazing, but this one is better. If you liked BG3 and you are now browsing Larian's catalogue, I cannot reccomend this game enough. I wish I could replay it for the first time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly, as someone who’s played almost 500 hrs of BG3. I found myself enjoying this game a lot. The characters look much more interesting and I love the art style and unique armor design for individual race characters. As for the story, I actually found it really engaging though a bit confusing at first. With the characters I do wish romances were explored a bit more but maybe that’s just me being used to BG3 romance. Regardless, I can find myself putting the same hours as I’ve had on BG3 in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I give Divinity: Original Sin 2 a narrow yes.\n\nThe pros:\n\n[list]\n    [*]Core gameplay that is a technical marvel\n    [*]Characters who are immediately engaging and memorable\n    [*]Beautiful art and setting\n    [*]Very open-ended and non-linear\n[/list]\n\nThe cons:\n\n[list]\n    [*]Broken learning curve--the game expects players to play through on an easy difficulty first because players are not informed early on of pivotal (and usually non-standard) factors later in the game, and it is a long ways into the game before players can respec (unless they use an add-on which disables achievements).\n    [*]The combat is novel but the novelty breaks down after a while.  It's cool that players can effectively \"hack\" the game, but combat reaches the point where players need to repeat the same hacks over and over again.  Combat relying on hacks isn't as robust as more vanilla combat systems.\n    [*]The over-arching story is creative but I personally don't like it.  However, I do enjoy the main character's side-stories.  Like many games these days, I wish the narrative stuck more to personal drama than grasping for cosmic drama.\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! Loved it from the start really but if you are not familiar with rpgs or crpgs you'll probably have a hard time at the start but don't let that discourage you, its worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun battles, great RPG party building, and good story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite RPGs, Larian talent to create unique stories with a very wide range of tones and fun, creative fights really makes me hope for a 3rd game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The BG3 before BG3. This game is so fun, I can't can't wait for the next chapter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game a few times. Never get bored of it. It is just this amazing. Both alone and with my wife. \n\nI've never been much into RPG games of this type before and I am glad that I wasn't because the first time experience I got was so rewarding and fun. \n\nRich story, fluid and well designed combat. What more can you expect from a RPG? Please give this game a try. You will not regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really well made game. I am having a lot of fun playing it. Very similar to Baldur's Gate 3, which I loved. I recommend it to anyone who enjoys fantasy RPGs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ever with the insanely fun battles and lots of cool builds and spells. The story and the characters are also great. Definitely recommended for everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely not my usual type of game, but ended up loving it and doing multiple runs. Way better game than Baldur's Gate 3. This is like Baldur's Gate 3 except makes sense, has way cooler animations, better classes, and better story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's okay, and personally i was incredibly tired of the game and combat after leaving the first island. Probably just not for me, but the beginning of the game was wonderful. Buy it on a sale or in a bundle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it. Yes, it really does scratch that itch after BG3. (That's why I tried it). The quests are engaging, the visuals are crisp and vivid, the world is large and gives much to discover, and the combat is fun and gives room to experiment and try new things. I do like the characters. Very much recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a decent game but I am just not a big fan. BG3 is vastly superior in every way. Recommend this on sale.\n\nPlaying on Tactician, the combat is just tedious. Crowd control is unique in this game, and it is effected by shields. You have a physical damage HP shield, a magic damage HP shield, and your HP. Certain status effects require one type of shields HP to be fully removed before they can be applied. So basically you you put your physical damage on casters, and your magic damage on melee. CC when their shields are down. Rinse and repeat. \n\nLeveling system is meh. You have a memory stat that limits how many skills you can have active at once. Your skills are bought so you have to be very choosy early game on what skills you actually want for your class (boo). \n\nGear RNG is annoying. I dislike games that have \"Requires X dex to wear\" and then the gear adds +str +str based skill on it. The gear adds to your physical/magical HP so it is critical to keep putting new pieces on even if the bonus stats suck.\n\nSmall complaints but they stack up. Story is solid enough. Voice acting is decent. If I could turn down the difficulty and finish the story I would, but it requires a restart. So I just won't be finishing this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing after i put 200+ hours into Baldurs Gate. Fill a void of style of gaming i never knew i needed. I will forever play Larian games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a much better experience than bg3 except for the difficulty curve... gets a bit aggressive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, while it is missing some things, it is overall ridiculously well built for when it was made!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took me four tries to finally come around and finish this game without getting interrupted and forgetting to come back to the game--but I will say that this game is fantastic and I would not hesitate to recommend it to anyone who was curious.\r\n\r\nIt's a challenge, but a damn good read at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting game overall, it has huge lore and side quests, also you will have a lot freedom for exploration and experience. my time disappears every time I open this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A timeless banger that is forever cursed to be one of those under the radar games that only blesses those who find it and pull the trigger on play. Divinity: Original Sin 2 is funny like that. It is quite possibly the greatest local co-op, campaign, turn-based rpg game of all time (rivaled only by you know what).\r\n\r\nThe world and it's inhabitants are masterclass, the writing and voice performances are captivating, and the combat is as creative as it is chaotic. If you have never played this game, you are missing out on something every video game enjoyer should experience at least once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best rpg game the choices and methods to do stuff is too good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great turn based game. Love the story, pace, character development. Well good old RPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is rich and the gameplay was fun\r\n\r\nKeep in mind to have for each character\r\n- atleast one source summon, and one totem summon\r\n- healing abitity\r\n- restoring physical and magical armor ability\r\n- teleportation is a must\r\n- have self teleportation must such as tactical retreat\r\n- one powerful source power\r\n\r\nKeep in mind the following\r\n- generously use the Lady Vengeance mirror to respec\r\n- have a repair hammer\r\n- make a note on the map for skillbook merchants (remember, once you clear an act, the area is not accessible from the next act, hence think real hard as to how to efficiently make an use of an act to maximise your level\r\n- invest in your main character first, then others, as they might abandon you :-(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty rough gem to get into at first, im not sure if i would continue to play it if i wasn't playing it with a friend. \r\nYou will for sure not be able to see if you want to refund in 2 hours of playing because it does get better later on as you figure things out, but still feels very frustrating with the mechanics of the game\r\nPlease add sex 👍",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Larian have done the impossible and cracked the code on how to make the perfect games. I adored the depth of the lore, the characters, as well as the combat. DOS2 is such a satisfying RPG whether you want to play co-op or single player. You'll find yourself growing attached to the range of characters and different factions, and it is just wonderfully addictive and such a full fleshed out world to fall into & just get lost for 100 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "filled with esoteric bits of random lore and things to do, the first blind playthough feels kinda like the first red dead redemption 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BESTTTT!!!! It's so freakin fun, the voice acting is PERFECT! The story line is exciting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I lost my virginity to a crazy ass hot elf with daddy issues and she loves me. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They somehow made a better game then Divinity: Original Sin, which was already close to perfection. Thank you Larian for making such wonderful games that always help me whenever I'm feeling down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is like the dream comes true. A great game with the polished combat system (not balanced, but satisfying to interact), decent plot and a lot to explore. IMO much more deserved to be recognized than the BG3. Favorite RPG of all times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took 6 years, but my party finally finished the campaign for the first time.\n\n10/10 but will not be playing so soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm leaving a positive review to counteract my friend-of-poor-judgement's negative review",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Easily my favourite modern CRPG! The atmosphere and writing is top notch. Larian nailed the humor in this one. The combat is excellent as well, loved trying out different combinations of spells and effects. 10/10 this is a must play if you enjoy fantasy RPG's",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Great game ruined by the ending.  Came back to this after never having completed it before.  Recurring theme with Larian games is amazing story and mechanics, but absolutely awful initiation in fights.  You either need to always sweat position for them or you have an unavoidable rigged fight.  Ending sequence involves a multistage fight where not once, but twice you are forced to have your characters amassed like idiots close together.  Can't really pregame potions with the no pause setup, summons despawn before  battle.  Stacking initiative is kind of pointless as it forces a start rotation.  This isn't highest difficulty, this is forced nonsense that removes all strategy.  All of your characters are force pulled in so that you can't hedge against the eventual fight.  The two different sides of enemies ignore each other to attack me exclusively.  I have absolutely no idea what the developers were expecting you to do here other than play one exact specific way cheesing certain stats, which is extremely boring.  Feel like I wasted my time on this playthrough, unless I use cheats to just skip to the story conclusion. \r\n\r\n9/10, just salting that the end fight is so poorly designed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really want to love this but i just cant, the world and characters are very interesting and cool but combat system with basically 3 hp types is very annoying to play around with even with all the build flexibility in the world that this game provides",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont understand why some say this is a \"masterpiece\". This game according to me is far inferior to the first one. If you like to try and control the battlefield with CC and such, you will be disapointed. They have nerfed that into the ground compared to the first game. When it comes to the story, you will have to either do a free for all in co-op (pray that you get to talk to every npc with your character before some other character does this that might render said npc unavailable) or do a single player play through. But even in solo, you will have to make sure every henchmen talks to every npc in order to not risk missing out on important parts of their story. This if you ask me, is just frustrating design and overall dumb. Get the first game instead and pass on this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashes frequently. Different places, different times, whether playing a few minutes or for longer periods of time. Crashes in Fort Joy walking into arena. Crashes in Reaper's Coast. Game simply exits. No error message, warning, or indication about to exit. Just back to desktop.\n\nWindows recommended compatibility settings for Windows 8. Larian support page recommended running game directly without Steam. Still crashes on windows 10. Played fine for a while. Then doesn't play fine. \n\nCamera is visually disorienting when edge panning due to elevation changes (trees, cliffs, anything similar). Camera jumps high, jumps low. When scrolling around to see where to go, find a chest, road, or something, this is just plain awful.\n\nFind a place you want to go on the big map? No way to click a point and instruct party to go there. Exit map and walk there bit by bit or scroll the area (with that disorienting up / down camera going across terrain), find your spot, click and hope your party doesn't stop for ground obstructions or obstacles.\n\nMario 64 has better camera free look than Divinity OS 1 or 2.  That's on Nintendo 64! \nI don't know how beta testers didn't get headaches from this camera in Divinity 2.\n\nGeneral rule of thumb appears to be destroy opponents before they get turns. Enemy turns take a long time. Sometimes, game decides to think about what to do (I guess?) so a minute or so later, finally completes that opponent's turn. Now do it again for the other 5+ in the fight. No way to skip this waiting.\n\nBattles are so monotonous on enemy turns, I do something in another monitor. Maybe that's why I get crashes ... trying to play windowed. I don't know. Battles are time consuming and boring. Wait, wait, and wait some more. Oh, you're incapacitated? No turn for you. Now wait again. Oh, look, still incapacitated. Just reload game, try to knock them into incapacitated statuses first. Or just explore elsewhere, come back with another level or two, and wonder why they were difficult at all.\n\nSome waypoints should be closer, especially when a story quest sends you somewhere repeatedly. \n\nThe quest log ... is unusable the more quests appear on the list. No search option. So you play along, get a message such and such quest updated, go to look. Spend 20 minute reading them line by line looking for this quest that IS NOT THERE!! Where is it? I don't know. I saw the message, I know the name. I can google it. I cannot find it in the log. The log is USELESS clutter. The internet is easier if you're looking for a particular quest, details, story, or what to do. The built in quest log in this game is unusable as it enlarges with various quest tidbits. A search feature would help immensely here. Same for inventory for finding something. Some prankster designed a chest that you must be in precisely the right camera position to actually reach. Thankfully, there's a skill to just put stuff like that into your inventory without that level of work. After 5 minutes of trying to copy from a youtube video, I gave up and used the spell. That's just bad design.\n\nGame's a time suck. Get used to it eventually. Pace of combat is slow. You can click faster than the game is ready, ending up walking somewhere instead of actually using a skill from your hotbar. Camera is horrible for elevation up / downs. Other games have similar jerkiness in their camera movements as well. This game, you have to look around and that's difficult to have occur so much, even just rotating around to see the terrain for a battle.\n\nOh, and my favorite is staring at the game waiting for combat to advance only to see the message: Not your character's turn. Have to go click on your portrait to do your turn. The game didn't put it there automatically. Seems random when it occurs.\n\n I must've put in 30+ hours without a crash. Then, one day, crash after crash. Install new software? No. Change drivers? No. Skip playing a week or so, then put in a long time - all the way to Arx with maybe two crashes. Fire up next day, try a new game for kicks to experiment, four crashes before even escape Fort Joy. That's not fun.\n\nDivinity OS 2 has easier inventory management (still a pain with a lot of stuff) and equipping gear, spells, etc. than Divinity 1. Game 1 is more stable on my windows 10. Game 2 crashes - a lot. That's what sucks the fun right out of number 2.\n\nAlso, divinity 2 has less of all that creepy blood emphasis of game 1.\nIt just crashes repeatedly :(\nSo no, I wouldn't spend a dime on it in this state. But I already have it, so I'm stuck with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Divinity: Original Sin 2 is one of those games that remind you why you fell in love with RPGs in the first place.\r\nThe humor? Chef's kiss.\r\nThe characters? Absolute chaos goblins with personality.\r\nThe graphics? Weirdly gorgeous for a game that’s not exactly new anymore. Honestly, half the time I forgot this thing came out years ago, because everything looks like it has been polished by a team of very dedicated fantasy elves.\r\n\r\nAnd the classes? Amazing. You can basically create anything from a teleporting rogue assassin who politely stabs people in the face… to a necromantic violinist who heals by bleeding on things. Truly art.\r\n\r\nBut then… Source Points happen.\r\n\r\nAh, yes. Source Points. The magical energy that fuels your strongest abilities, your coolest spells, is needed to acomplish dungeons/quests, and—apparently—your greatest frustration in life.\r\n\r\nIt’s not that the game limits you on them. That would actually be interesting, right? Making tough choices, thinking strategically, feeling the weight of your decisions?\r\n\r\nNope.\r\nDivinity says: “You can refill them endlessly, dear player!”\r\nAnd then quietly adds:\r\n“…Just run back and forth like a lost chicken to do it.”\r\n\r\nWhy?\r\nWhy give me infinite refills… but only if I prove my dedication by jogging across Rivellon like I’m training for a marathon?\r\nWhy ruin the pacing of such a brilliant game with a mechanic that feels like an unpaid internship?\r\n\r\nInstead of epic adventure, I get Source Point Fetch Quest Simulator 2017.\r\n\r\nAnd that’s when my enthusiasm died a dramatic, theatrical death. Not by combat. Not by a boss. But by pure, uncut inconvenience. It’s like the game whispered:\r\n\"You like fun? Too bad. Go touch another puddle of ghost juice, peasant.\"\r\n\r\nSo, Divinity: Original Sin 2 is still an incredible game with unforgettable humor, beautiful visuals, and rich gameplay.\r\nBut Source Points?\r\nYeah, no. Hard pass. When a mechanic makes me feel like I’m clocking in for my shift, I put down the controller and walk away.\r\n\r\nFinal Verdict:\r\nA masterpiece held hostage by a mechanic that thinks I have the free time of a bored god. If Larian ever patches Source Points into something less annoying, I’m back in. Until then… Rivellon, it’s not you. It’s your weird energy system.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I found this game to be a real slog to be honest. While I would like to give it the thumbs up due to the overall quality of the game, I found the multitudinuous quests cumbersome and uninteresting (much like all the NPCs), which required endless backtracking and busywork that felt more like a chore than entertainment. On the positive side, I mostly enjoyed the combat system.\n\nWhile I almost always complete a game once I start it (even if I put it to rest for a while), after encountering another dead end after 30 hours of gameplay, I just don't have the motivation to go on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Single player character creation - and thus the game - seems to be broken on M-series macs - after you make your character, it just says \"waiting\" and pinwheels into application not responding. The same game files work fine on intel macs, save files created on intel macs work fine on M-series macs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had to go through a ton of log-in options before playing the game which was mediocre at best. Have deleted it and is now where it belongs...the bin!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most confusing and frustrating games I've played. The game mechanics were fine, although I hate to lose a turn from being knocked down, but plot of the main stories and side quests were convoluted and often felt like a waste of time. Peeper's side quest was the last straw for me. I loved Baulder's Gate 3 so I know that Larian can make great games, but this was not it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really would love to like this game. It has engaging combat, a great multiplayer and interactivity that I have not seen before.\nThe start at Fort Joy is amazing to play. It's the best balanced and the most well-rounded. I always knew where to go, always found new things to explore and I never felt lost story wise.\n\nAll of this starts to turn around in the following acts and I feel like it gets worse or at least more glaring the further you progress. \nThese glaring issues for me are:\n\n[b] \"Open World\" [/b]\nOn Fort Joy the open world felt rewarding. The battles were challenging but beatable. So, I was delighted to see what may come after Fort Joy.\n\nWhat I ended up finding were \"natural\" level barriers that forced my friend and I to follow a linear route to so that we could beat the battles (note that we played on normal).\nFinding this linear route after the game told us to pick and choose where we wish to go next just felt confusing. In total it took us a month to progress (we played once every week). We desperately staked out which area might be appropriate for our level 12 characters. I still remember each area of the second act and which level is associated with. \nPerhaps we where unfortunate to not have chosen this path. Mayhaps, we simply overread an important dialog pointing us towards the right direction.\nThe only thing I know for sure is that the only for us beatable area was [spoiler]in the top left corner[/spoiler] of the map.\n\nYou have to pass multiple other areas with higher levels to get there.\nNevertheless, this area was still a mighty struggle. We fought with everything we had. We strategized about each battle. After every loss we took notes, regrouped and attacked again. Every potential \"exploit\" we could see, we utilized.\n\nThis level of tenacity does not feel appropriate for a normal difficulty playthrough at least not for me.\n\n[u]Recommendation[/u]\nThe pre-set levels with the exponential leveling system to not work together with the \"open world\" aspect of the game.\nI'll get more in-depth with the leveling in the next part, but giving the player the directive to \"reign freely\" while setting fixed levels to the enemies does not add up. \nAdjusting the enemies to the level the player is feels way more appropriate. Maybe, sprinkle in some fixed levels as a boss to really stop the player if the story demands it, but putting this everywhere is just misguided. \n\nEspecially since it let to us loosing track of the story completely. We started each quests, but we could never finish them due to the battles. So after a week or two we came back to the quest without having a clue of what was going on. (The in-game journal is quite lack luster on this regard)\n\n[b]Levelling[/b]\nIn total you can get up to level [spoiler]21[/spoiler], which feels a little low looking at other RPGs. The issue I have with this is that you are at level [spoiler]12 when leaving Fort Joy[/spoiler]. This leads to the weird situation that levels are exponentially more important the closer you get to the max level.\n\nAt first you may be able to win a battle against a two levels higher foe, but towards the end if you are not on the same level as your enemy, you get demolished.\nWe literally couldn't defeat the final boss since we were one level below it. Coincidentally, we also were at a point were we felt like we completed every quest available to us. After trying for another fruitless three weeks, we loaded a previous save and tried to squeeze out another level so we have even an inkling of a chance.\n\nAs a [u]recommendation[/u] I can just offer a proper re-balancing of the later areas and a plead for general level cap increase. In the last stages of the game seeing the next level XP requirement to be in the millions is disheartening.\n\n[b]Quest Management[/b]\nA more minute point but it feels like the bad cherry on top of the issue cake. \nThe in-game journal feels in-adequate to help the player remember story points and even gist's of quests. The best you can hope for is a red marker on your map, and a small to-do entry. The point of the quest, the afflicted affiliations and the severity are often not included. \n\nEspecially after our 3-week excursion through level barrier hell, we essentially reached a point of mindless \"red flag grinding\". I at least felt like a zombie trying to stave my XP-hunger by any means possible. So, every found quest was like a 3-star prepared meal and I devoured it as far as I could, but the chef seemed to hate me and always put glass shards in the food so that I had to come back to it later after my gums were accustomed to the \"difficulty\" (Essentially I needed to level to beat a foe)\n\nEverything combined together let to me loosing completely any inkling of the story.\n\nA small anecdote concerning story. My friend and I felt like we managed to skip great chunks of it unwillingly. One example for this is the story around Gareth.\n\nFor me it felt as follows: [spoiler]The great leader Gareth managed to escape the prison island Fort Joy with the help of his divine acquaintances (us). Together they set sail to Reaper's Coast where Gareth's parents resided. He immediately went to his parents but Magisters seemed to have been a step ahead of him. The battle did not take long, but neither did the triumph. Beneath rubble lay two corpses ... his parents. Silently he buried them. A deep anger begins taking hold of Gareth. Before he could do anything reckless his two divine acquaintances appear. He told them what happened. The trio stood there silently. Until one divine spoke up: \"It is what it is, bro\".\n\nThese words quiet the anger immediately and Gareth went back to the ship never do to anything of note again.\n[/spoiler] \n\nI do not know how one should experience his tale but this is beyond ridiculous.\n\nThis was roughly the experience I had with almost all of the story points which is why during the end credits I felt like I was being introduced to new characters since I could not for the life of me remember who any of the characters even where.\n\nMy [u]recommendation[/u] for this one would be to add more information to the journal, and to add a glossary to keep track of the different parties, their goals and what the situation currently is. The chapters setup did not help at all. It rather added to the confusion because some quests where chapter-overlapping, so they never disappeared.\n\n[b]Gear[/b]\nI had a very unique problem with gear throughout the whole game. Namely, I was often stuck with too low leveled gear because of set combos. These set combos gave me unique traits which I liked, but I could never transition smoothly to a new set due to bonuses of the set combo.\n\nSo my solution would be to upgrade my gear, but there is no way to level up gear. There is a DLC-esque bundle modifications containing the gear sisters. Which adds four sister merchants in the game which sell you (limited) quantities of gear upgrade ingredients. Even if you managed to pay their insanely steep prices (easily 10k per PIECE). Their limited quantity would not even allow you to upgrade a full set of unique gear ONCE.\n\nI re-iterate my final gear that was a 5 piece armor set, was physically not possible to be upgraded fully ONCE even if I collected ALL the armor upgrade ingredients.\n\n[u]Recommendation[/u]: Please let me upgrade my gear, I'm begging you.\n\n[b]Overall[/b], I think the game has a fantastic premise, but these points just gave me such frustration while playing that I simply felt saddened by the thought of what could be. If I'm just unlucky with how my playthrough went please tell me what I could have done. I'd really love to find my appreciation again for this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is mostly fine, and if I enjoyed text driven puzzle games, I would give this much more of my time, however, sometimes I just want to be able to wander around killing stuff and playing with the combat system, and, as of the first chapter, this game has very little action with a lot of running around talking to people and searching for hidden loots that might be what the quest was talking about... \r\n  The combat seems fun enough, with a high degree of versatility, and there is a standard selection of classes with a dynamic class system and plenty of magical treasures and abilities which you can learn from finding skill tomes in the world.... I would really like for this game to evolve to be open world where you can just wander around ignoring quests and puzzles if you choose, but this game seems to be a series of puzzle quests with some action mixed in.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game could be one of the greatest, but the sheer amount of crashing I experience just trying to play this game means I cannot recommend this game at all. Loading saves has about a 20% success rate of working with most attempts leading to infinite loading or the game freezing, frequently needing a restart of the computer. Then there are the crashes during the game. Frequently, the game will stop responding and soft lock my computer, usually needing a hard reset to continue using it. This is so disappointing due to the potential this game has. I've tried every fix I could find and I have tried to just push through it, even though it sometimes takes upwards of 30 minutes to successfully load a save, but I cant keep putting up with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just get Baldur's Gate 3 instead. It is a much less frustrating experience. Gameplay is a slog and that gameplay experience is riddled with bugs you will have to work around",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's balancing and systems are still as unfun as I remember. Also there's an annoying launcher now? Had to look up how to bypass that asap. Just play BG3, it's just better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a good game. An amazing even. Perhaps one of the best RPGs that exist. I see all the effort and how genuinely worked-through the game is. I'm sure it was a lot of work and effort, gameplay-wise, voice acting -wise, and in many other ways.\n\nI just genuinely didn't enjoy playing it. Not because it's bad, but because (as it turned out) it's not in my taste. I should have probably catch it and not play BG3 (which I disliked too). After an hour in this game I feel exhausted and get a headache (it's not even due to the strategic difficulty: I enjoy stellaris for example or actual D&D).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game feels a bit stiff and emphasis is put on the story. I didn't like the gameplay since there is no real strategy taken into account. Very big hype maybe for the story but too much hype for the gameplay and so-called strategy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game loading time is pathetic, it freezes and doesnt advance half the time, and its not my pc's fault because i can play way more demanding game like baldur's gate easily with no problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea how in the earth this game got that much of upvotes at this point. Literaly it forces you to play pretty much at the same way while pretending as if it is not forced. Enemies at your level may one shot your characters like they mean nothing. Tries to be too complicated while making the fights uncessarily unfun and smothering. Do you have a tank in your party. Too bad. AI will God damn b-line to your rogue-mage directly for he-she has the lowest defense. Do you want to prevent that? Still too bad. Cause phy-magic our won't let you do smt to them pretty much. Do you want to get the initative first so you can have the upper hand? Nope. Cause AI cheats and always gets first move so it bulldoze your party. So you seek to cheese on most cases as such sending one member from the start then moving the others in next. God what a frusturating experience...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As always, Larian studios makes it beyond frustrating to simply find where to go. It's not a fun element (in my opinion) to waste non stop time walking around the map trying to simply find where to go.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute GARBAGE compared to DOS1. Literally 100% of everything is worse and it makes me so sad that I bought it and spent this long playing it just to be so disappointed. Absolutely every aspect was a step back from the first. Rest in piss, you will not be missed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a lot of text\ntoo lazy to read \nI want to play a game, not read a book 1/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Friends started a game without me. Allowed me to join halfway through. Playing Red Prince. Had no control over my build, terrible equipment, and can't influence the story at all.\n\nNot a great first experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not sure how I even made it 53 hours... kept pushing myself to get a little further in the game for no good reason other than I spent money on it? The story and gameplay are fine I guess, but I would say after about 20 hrs in I was pretty bored with it. Eventually got to a new area and I thought it would get fun for me again, like the first few hours were, but nah... I'm just bored with the pace and theme of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A fun game however I don't like the way God has been depicted in it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for something to scratch a BG3 itch, you will not find it here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game... until you arrive to Arx...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for more BG3 experience then stay away from this piece of shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game blows",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gareth is dumb, a real madman!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too many bugs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not even MMO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game looks good, runs well and has awesome soundtrack. Mechanically there is rather complex system both as classes go and the combat is challenging even on the easier difficulties. Even the lore and the world you explore is a bit unique and interesting. And there is a narrator with a nice voice. Oh yeah, almost all text has voice actors as well! It is very well made RPG game with neat features like coop.\n\nSo why the thumbs down? The story. It is like they forgot to hire a writer. Your band of misfits has zero reason to stick together, in fact they have motivation to kill each other, but they never do. The game's story is like visiting theme park: nice to see what is all around, but there is no logic cohesion to it. After you escape the first island the story falls apart.\n\nIf you can disable your brain or play this game while high, it will be fun ride. Sadly, i have higher standards for my \"classic\" RPG games where story is the only thing which MUST be there.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Maybe this game could have been considered \"good\" at the time it released, it doesn't qualify by modern standards. It is so slow and so clunky as to become a struggle of will just to keep playing. But the real issue for me is the quest design; I literally can't solve any of the main objectives. It's too obscure, with too many hidden obstacles that I'm sure the developers though were clever but just end up serving as audience abuse. Bottom line: it isn't fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game ruined by the ending.  Came back to this after never having completed it before.  Recurring theme with Larian games is amazing story and mechanics, but absolutely awful initiation in fights.  You either need to always sweat position for them or you have an unavoidable rigged fight.  Ending sequence involves a multistage fight where not once, but twice you are forced to have your characters amassed like idiots close together.  Can't really pregame potions with the no pause setup, summons despawn before  battle.  Stacking initiative is kind of pointless as it forces a start rotation.  This isn't highest difficulty, this is forced nonsense that removes all strategy.  All of your characters are force pulled in so that you can't hedge against the eventual fight.  The two different sides of enemies ignore each other to attack me exclusively.  I have absolutely no idea what the developers were expecting you to do here other than play one exact specific way cheesing certain stats, which is extremely boring.  Feel like I wasted my time on this playthrough, unless I use cheats to just skip to the story conclusion. \r\n\r\n9/10, just salting that the end fight is so poorly designed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Possibly one of the most frustrating games I've ever played. I did a full two player run with a friend on Classic difficulty, start to finish. After having played through BG3 twice and enjoying it, I expected this game to feel similar. Do not make that mistake.\nThis game has major balancing issues, but not combat wise, but knowledge wise. If you go into this game knowing and looking up everything, you'll probably clear it all no problem, but going into this game blind will result in you getting your ass handed to you. Surprise encounters out the wazoo, enemy immunities that can screw up a majority of builds, the physical/magical split. Oh and some of the puzzles are absolutely idiotic. Then there's the add-ons, fantastic additions if you don't care about achievements, but if you do, you gotta keep em off, which really sucks given they're all QoL things that exist to make this boring game significantly less frustrating. Want to be able to see ghosts without clicking a button? Tough luck, no achievements for you. Want to replenish a resource that isn't hard to get but takes like 20 seconds at the end of each fight to replenish at the click of a button? No achievements allowed.\nAlso lets talk about build variety. And how it sucks. Do you want a hybrid magic/physical guy? Enjoy gimping yourself. Heck, do you want half mage half physical team members? Enjoy gimping your team. You pretty much have to go all in on one type by the end of the game because of the game's magic/physical armour health system. Oh and you better hope you get good levelled gear on level, or your armor will be too low and this game becomes CC hell, because almost every ability has an unavoidable CC once your armor is gone.\nAlso by the end of the game, you better have at least 5 points in polymorph if you want to do anything, cause if you don't, good luck with your builds.\nAlso civil skills are stupid. Maybe if you got more points it wouldn't be as dumb, but lockpicking eats lockpicks success or failure, same with identifying, so you better have a mask of the shapeshifter or an undead in the party if you don't want to deal with that crap.\nFinally, ignoring balancing issues, enemies regularly jumping out of nowhere to fight you, the fact that the game has levelled randomized loot, the weirdly rushed ending to many story arcs and the fact that the game tells you nothing, the game is broken. Numerous times, dialogues that were supposed to happen didn't, things that didn't seem like they were supposed to happen did happen, and my friend and I literally skipped the final boss because the game bugged out, and we just... didn't fight it.\nAll in all, this is probably one of the most frustrating games I have ever played, that punishes you with disabling achievements for trying to make the game not even easier, but a smoother experience. Also you're locked into your companions for the whole game, so you better like em once you pick em. Honestly, just play BG3 again, that game despite having some similar issues is a million times better, and doesn't have that stupid magic/physical armor mechanic.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Crashes frequently. Different places, different times, whether playing a few minutes or for longer periods of time. Crashes in Fort Joy walking into arena. Crashes in Reaper's Coast. Game simply exits. No error message, warning, or indication about to exit. Just back to desktop.\n\nWindows recommended compatibility settings for Windows 8. Larian support page recommended running game directly without Steam. Still crashes on windows 10. Played fine for a while. Then doesn't play fine. \n\nCamera is visually disorienting when edge panning due to elevation changes (trees, cliffs, anything similar). Camera jumps high, jumps low. When scrolling around to see where to go, find a chest, road, or something, this is just plain awful.\n\nFind a place you want to go on the big map? No way to click a point and instruct party to go there. Exit map and walk there bit by bit or scroll the area (with that disorienting up / down camera going across terrain), find your spot, click and hope your party doesn't stop for ground obstructions or obstacles.\n\nMario 64 has better camera free look than Divinity OS 1 or 2.  That's on Nintendo 64! \nI don't know how beta testers didn't get headaches from this camera in Divinity 2.\n\nGeneral rule of thumb appears to be destroy opponents before they get turns. Enemy turns take a long time. Sometimes, game decides to think about what to do (I guess?) so a minute or so later, finally completes that opponent's turn. Now do it again for the other 5+ in the fight. No way to skip this waiting.\n\nBattles are so monotonous on enemy turns, I do something in another monitor. Maybe that's why I get crashes ... trying to play windowed. I don't know. Battles are time consuming and boring. Wait, wait, and wait some more. Oh, you're incapacitated? No turn for you. Now wait again. Oh, look, still incapacitated. Just reload game, try to knock them into incapacitated statuses first. Or just explore elsewhere, come back with another level or two, and wonder why they were difficult at all.\n\nSome waypoints should be closer, especially when a story quest sends you somewhere repeatedly. \n\nThe quest log ... is unusable the more quests appear on the list. No search option. So you play along, get a message such and such quest updated, go to look. Spend 20 minute reading them line by line looking for this quest that IS NOT THERE!! Where is it? I don't know. I saw the message, I know the name. I can google it. I cannot find it in the log. The log is USELESS clutter. The internet is easier if you're looking for a particular quest, details, story, or what to do. The built in quest log in this game is unusable as it enlarges with various quest tidbits. A search feature would help immensely here. Same for inventory for finding something. Some prankster designed a chest that you must be in precisely the right camera position to actually reach. Thankfully, there's a skill to just put stuff like that into your inventory without that level of work. After 5 minutes of trying to copy from a youtube video, I gave up and used the spell. That's just bad design.\n\nGame's a time suck. Get used to it eventually. Pace of combat is slow. You can click faster than the game is ready, ending up walking somewhere instead of actually using a skill from your hotbar. Camera is horrible for elevation up / downs. Other games have similar jerkiness in their camera movements as well. This game, you have to look around and that's difficult to have occur so much, even just rotating around to see the terrain for a battle.\n\nOh, and my favorite is staring at the game waiting for combat to advance only to see the message: Not your character's turn. Have to go click on your portrait to do your turn. The game didn't put it there automatically. Seems random when it occurs.\n\n I must've put in 30+ hours without a crash. Then, one day, crash after crash. Install new software? No. Change drivers? No. Skip playing a week or so, then put in a long time - all the way to Arx with maybe two crashes. Fire up next day, try a new game for kicks to experiment, four crashes before even escape Fort Joy. That's not fun.\n\nDivinity OS 2 has easier inventory management (still a pain with a lot of stuff) and equipping gear, spells, etc. than Divinity 1. Game 1 is more stable on my windows 10. Game 2 crashes - a lot. That's what sucks the fun right out of number 2.\n\nAlso, divinity 2 has less of all that creepy blood emphasis of game 1.\nIt just crashes repeatedly :(\nSo no, I wouldn't spend a dime on it in this state. But I already have it, so I'm stuck with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Welp, That's over a hundred hours of my life I'll never get back. The fact this is Overwhelmingly positive on steam makes me feel like I played a different game. Whether it be the boring characters, Clunky game play, confusing story or the straight up stone walling of some boss fights this game has no end to the bs it throws at you, 3/10 throwing the shields is fun. Skeletons are cool. fyi the reddit of this game sucks dick. Ask a basic question and youll be hit with something along the lines \"turn the difficulty done lol\" or \"You should just do this exploit in act 1\"",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i really want to love this but i just cant, the world and characters are very interesting and cool but combat system with basically 3 hp types is very annoying to play around with even with all the build flexibility in the world that this game provides",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why some say this is a \"masterpiece\". This game according to me is far inferior to the first one. If you like to try and control the battlefield with CC and such, you will be disapointed. They have nerfed that into the ground compared to the first game. When it comes to the story, you will have to either do a free for all in co-op (pray that you get to talk to every npc with your character before some other character does this that might render said npc unavailable) or do a single player play through. But even in solo, you will have to make sure every henchmen talks to every npc in order to not risk missing out on important parts of their story. This if you ask me, is just frustrating design and overall dumb. Get the first game instead and pass on this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a good game, but hear me out. \n\nThis is a negative review because the game has insanely high review scores BUT it has some glaring issues. \n\nThere's a bit of a catch though. It's the fact that I've only become frustrated enough to leave a negative review after multiple playthrough's. This is because I was so pleased with my initial experience that I was willing to overlook the issues back then. I am not willing now. \n\nThe worst issue here is the simple fact that many fights in this game feel borderline unwinnable unless you already know how the fight will go before going into it and take steps to give yourself as much advantage as possible. This doesn't feel like \"tactical\" gameplay and is very frustrating, probably the most of any of the issues this game has. \n\nThe second biggest issue is that you can really easily screw yourself over just because you talked to someone with the wrong character, which btw can be very hard to avoid in certain situations where npc's approach and initiate dialogue after a fight or something. They just go for the nearest npc and you can't well control that. If you are playing with friends, this mostly manifests as the player with the character who has persuasion having to be the one who goes first everywhere to talk to all npc's and see all new areas, otherwise you might fail some essential dialogue option. Feels like it punishes the other players for exploring.  \n\nThe rest of the issues have mostly to do with jank or bugs, like quest entries and markers not updating properly (this happens ALOT, but thankfully actual quest progression rarely breaks). But one of my biggest personal issues is the fact that many near-essential game changes that come bundled with the game and were made by the devs are treated as mods and disable your achievements. Like, really? Almost all of them are quality of life improvements that should have just been part of the base game, don't get me wrong it's extra nice to have the option, but not if it punishes you for using them. \n\nIt's a good game, and you probably owe it to yourself to play it if you are a fan of crpg's, BUT it still has issues which may not be conveyed to you by the high review score. That's why I decided to write this.\n\nAh yes one final thing. Traps in this game are on a limited, short timer, which counts independent of the combat turns. They are fucking useless. Absolute garbage and waste, baffling design decision that I still struggle to comprehend. Normally I love a good use of traps in games like this (Underrail is the absolute king of this plus also stealth) but in this game it is awful. But that may be just me, cause I'm a traps enjoyer.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Not enjoying the combat system. It's doable but I don't enjoy how it creates challenge. For example pre-positioning enemies in good positions and clumping up the party (when the fight happens on a new map), setting them them up to get blasted before they can do anything. Or, just making enemies far stronger than the party members, forcing you to figure out what areas to avoid by dying and reloading. The game does a poor job explaining how things work. You get a lot of options and variables without context, and you need to pick wisely or suck. It all results in having to google how things work, and meta-gaming before fights, which is detrimental to the immersion.\nAlso, the game world is supremely bleak and depressing; I don't need a game for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I essentially had to force myself to get to the end of this game, after owning it for years and restarting it repeatedly. It's gorgeous, D:OS1 is one of my favorite games, and I was so excited to play the hero characters and experience their storylines, but playing this game was [b]tedious[/b]. Several puzzles were so nonsensical and presented so blankly that I (like many other players, it seems) kept having to go online just to figure out what I was supposed to do... which ended up making the puzzles boring. Same with a lot of the combat (one of my favorite parts of D:OS1) - there's giving players a satisfying challenge, and then there's forcing the player to slog through endless tedium. This was unfortunately the latter.\n\nThe ending...oof. I chose the option I thought was best, and it ended up being cynical and depressing. Looking online, it sounds like the other endings aren't any better. The epilogue was dull as dirt and droned on for way too long.\n\nI can't even say \"well, I'm glad I finished it at least\". It just wasn't fun. Huge bummer. Guess I'll go replay D:OS1 again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Divinity: Original Sin 2 is one of those games that remind you why you fell in love with RPGs in the first place.\r\nThe humor? Chef's kiss.\r\nThe characters? Absolute chaos goblins with personality.\r\nThe graphics? Weirdly gorgeous for a game that’s not exactly new anymore. Honestly, half the time I forgot this thing came out years ago, because everything looks like it has been polished by a team of very dedicated fantasy elves.\r\n\r\nAnd the classes? Amazing. You can basically create anything from a teleporting rogue assassin who politely stabs people in the face… to a necromantic violinist who heals by bleeding on things. Truly art.\r\n\r\nBut then… Source Points happen.\r\n\r\nAh, yes. Source Points. The magical energy that fuels your strongest abilities, your coolest spells, is needed to acomplish dungeons/quests, and—apparently—your greatest frustration in life.\r\n\r\nIt’s not that the game limits you on them. That would actually be interesting, right? Making tough choices, thinking strategically, feeling the weight of your decisions?\r\n\r\nNope.\r\nDivinity says: “You can refill them endlessly, dear player!”\r\nAnd then quietly adds:\r\n“…Just run back and forth like a lost chicken to do it.”\r\n\r\nWhy?\r\nWhy give me infinite refills… but only if I prove my dedication by jogging across Rivellon like I’m training for a marathon?\r\nWhy ruin the pacing of such a brilliant game with a mechanic that feels like an unpaid internship?\r\n\r\nInstead of epic adventure, I get Source Point Fetch Quest Simulator 2017.\r\n\r\nAnd that’s when my enthusiasm died a dramatic, theatrical death. Not by combat. Not by a boss. But by pure, uncut inconvenience. It’s like the game whispered:\r\n\"You like fun? Too bad. Go touch another puddle of ghost juice, peasant.\"\r\n\r\nSo, Divinity: Original Sin 2 is still an incredible game with unforgettable humor, beautiful visuals, and rich gameplay.\r\nBut Source Points?\r\nYeah, no. Hard pass. When a mechanic makes me feel like I’m clocking in for my shift, I put down the controller and walk away.\r\n\r\nFinal Verdict:\r\nA masterpiece held hostage by a mechanic that thinks I have the free time of a bored god. If Larian ever patches Source Points into something less annoying, I’m back in. Until then… Rivellon, it’s not you. It’s your weird energy system.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I found this game to be a real slog to be honest. While I would like to give it the thumbs up due to the overall quality of the game, I found the multitudinuous quests cumbersome and uninteresting (much like all the NPCs), which required endless backtracking and busywork that felt more like a chore than entertainment. On the positive side, I mostly enjoyed the combat system.\n\nWhile I almost always complete a game once I start it (even if I put it to rest for a while), after encountering another dead end after 30 hours of gameplay, I just don't have the motivation to go on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Single player character creation - and thus the game - seems to be broken on M-series macs - after you make your character, it just says \"waiting\" and pinwheels into application not responding. The same game files work fine on intel macs, save files created on intel macs work fine on M-series macs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had to go through a ton of log-in options before playing the game which was mediocre at best. Have deleted it and is now where it belongs...the bin!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most confusing and frustrating games I've played. The game mechanics were fine, although I hate to lose a turn from being knocked down, but plot of the main stories and side quests were convoluted and often felt like a waste of time. Peeper's side quest was the last straw for me. I loved Baulder's Gate 3 so I know that Larian can make great games, but this was not it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really would love to like this game. It has engaging combat, a great multiplayer and interactivity that I have not seen before.\nThe start at Fort Joy is amazing to play. It's the best balanced and the most well-rounded. I always knew where to go, always found new things to explore and I never felt lost story wise.\n\nAll of this starts to turn around in the following acts and I feel like it gets worse or at least more glaring the further you progress. \nThese glaring issues for me are:\n\n[b] \"Open World\" [/b]\nOn Fort Joy the open world felt rewarding. The battles were challenging but beatable. So, I was delighted to see what may come after Fort Joy.\n\nWhat I ended up finding were \"natural\" level barriers that forced my friend and I to follow a linear route to so that we could beat the battles (note that we played on normal).\nFinding this linear route after the game told us to pick and choose where we wish to go next just felt confusing. In total it took us a month to progress (we played once every week). We desperately staked out which area might be appropriate for our level 12 characters. I still remember each area of the second act and which level is associated with. \nPerhaps we where unfortunate to not have chosen this path. Mayhaps, we simply overread an important dialog pointing us towards the right direction.\nThe only thing I know for sure is that the only for us beatable area was [spoiler]in the top left corner[/spoiler] of the map.\n\nYou have to pass multiple other areas with higher levels to get there.\nNevertheless, this area was still a mighty struggle. We fought with everything we had. We strategized about each battle. After every loss we took notes, regrouped and attacked again. Every potential \"exploit\" we could see, we utilized.\n\nThis level of tenacity does not feel appropriate for a normal difficulty playthrough at least not for me.\n\n[u]Recommendation[/u]\nThe pre-set levels with the exponential leveling system to not work together with the \"open world\" aspect of the game.\nI'll get more in-depth with the leveling in the next part, but giving the player the directive to \"reign freely\" while setting fixed levels to the enemies does not add up. \nAdjusting the enemies to the level the player is feels way more appropriate. Maybe, sprinkle in some fixed levels as a boss to really stop the player if the story demands it, but putting this everywhere is just misguided. \n\nEspecially since it let to us loosing track of the story completely. We started each quests, but we could never finish them due to the battles. So after a week or two we came back to the quest without having a clue of what was going on. (The in-game journal is quite lack luster on this regard)\n\n[b]Levelling[/b]\nIn total you can get up to level [spoiler]21[/spoiler], which feels a little low looking at other RPGs. The issue I have with this is that you are at level [spoiler]12 when leaving Fort Joy[/spoiler]. This leads to the weird situation that levels are exponentially more important the closer you get to the max level.\n\nAt first you may be able to win a battle against a two levels higher foe, but towards the end if you are not on the same level as your enemy, you get demolished.\nWe literally couldn't defeat the final boss since we were one level below it. Coincidentally, we also were at a point were we felt like we completed every quest available to us. After trying for another fruitless three weeks, we loaded a previous save and tried to squeeze out another level so we have even an inkling of a chance.\n\nAs a [u]recommendation[/u] I can just offer a proper re-balancing of the later areas and a plead for general level cap increase. In the last stages of the game seeing the next level XP requirement to be in the millions is disheartening.\n\n[b]Quest Management[/b]\nA more minute point but it feels like the bad cherry on top of the issue cake. \nThe in-game journal feels in-adequate to help the player remember story points and even gist's of quests. The best you can hope for is a red marker on your map, and a small to-do entry. The point of the quest, the afflicted affiliations and the severity are often not included. \n\nEspecially after our 3-week excursion through level barrier hell, we essentially reached a point of mindless \"red flag grinding\". I at least felt like a zombie trying to stave my XP-hunger by any means possible. So, every found quest was like a 3-star prepared meal and I devoured it as far as I could, but the chef seemed to hate me and always put glass shards in the food so that I had to come back to it later after my gums were accustomed to the \"difficulty\" (Essentially I needed to level to beat a foe)\n\nEverything combined together let to me loosing completely any inkling of the story.\n\nA small anecdote concerning story. My friend and I felt like we managed to skip great chunks of it unwillingly. One example for this is the story around Gareth.\n\nFor me it felt as follows: [spoiler]The great leader Gareth managed to escape the prison island Fort Joy with the help of his divine acquaintances (us). Together they set sail to Reaper's Coast where Gareth's parents resided. He immediately went to his parents but Magisters seemed to have been a step ahead of him. The battle did not take long, but neither did the triumph. Beneath rubble lay two corpses ... his parents. Silently he buried them. A deep anger begins taking hold of Gareth. Before he could do anything reckless his two divine acquaintances appear. He told them what happened. The trio stood there silently. Until one divine spoke up: \"It is what it is, bro\".\n\nThese words quiet the anger immediately and Gareth went back to the ship never do to anything of note again.\n[/spoiler] \n\nI do not know how one should experience his tale but this is beyond ridiculous.\n\nThis was roughly the experience I had with almost all of the story points which is why during the end credits I felt like I was being introduced to new characters since I could not for the life of me remember who any of the characters even where.\n\nMy [u]recommendation[/u] for this one would be to add more information to the journal, and to add a glossary to keep track of the different parties, their goals and what the situation currently is. The chapters setup did not help at all. It rather added to the confusion because some quests where chapter-overlapping, so they never disappeared.\n\n[b]Gear[/b]\nI had a very unique problem with gear throughout the whole game. Namely, I was often stuck with too low leveled gear because of set combos. These set combos gave me unique traits which I liked, but I could never transition smoothly to a new set due to bonuses of the set combo.\n\nSo my solution would be to upgrade my gear, but there is no way to level up gear. There is a DLC-esque bundle modifications containing the gear sisters. Which adds four sister merchants in the game which sell you (limited) quantities of gear upgrade ingredients. Even if you managed to pay their insanely steep prices (easily 10k per PIECE). Their limited quantity would not even allow you to upgrade a full set of unique gear ONCE.\n\nI re-iterate my final gear that was a 5 piece armor set, was physically not possible to be upgraded fully ONCE even if I collected ALL the armor upgrade ingredients.\n\n[u]Recommendation[/u]: Please let me upgrade my gear, I'm begging you.\n\n[b]Overall[/b], I think the game has a fantastic premise, but these points just gave me such frustration while playing that I simply felt saddened by the thought of what could be. If I'm just unlucky with how my playthrough went please tell me what I could have done. I'd really love to find my appreciation again for this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is mostly fine, and if I enjoyed text driven puzzle games, I would give this much more of my time, however, sometimes I just want to be able to wander around killing stuff and playing with the combat system, and, as of the first chapter, this game has very little action with a lot of running around talking to people and searching for hidden loots that might be what the quest was talking about... \r\n  The combat seems fun enough, with a high degree of versatility, and there is a standard selection of classes with a dynamic class system and plenty of magical treasures and abilities which you can learn from finding skill tomes in the world.... I would really like for this game to evolve to be open world where you can just wander around ignoring quests and puzzles if you choose, but this game seems to be a series of puzzle quests with some action mixed in.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game could be one of the greatest, but the sheer amount of crashing I experience just trying to play this game means I cannot recommend this game at all. Loading saves has about a 20% success rate of working with most attempts leading to infinite loading or the game freezing, frequently needing a restart of the computer. Then there are the crashes during the game. Frequently, the game will stop responding and soft lock my computer, usually needing a hard reset to continue using it. This is so disappointing due to the potential this game has. I've tried every fix I could find and I have tried to just push through it, even though it sometimes takes upwards of 30 minutes to successfully load a save, but I cant keep putting up with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just get Baldur's Gate 3 instead. It is a much less frustrating experience. Gameplay is a slog and that gameplay experience is riddled with bugs you will have to work around",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's balancing and systems are still as unfun as I remember. Also there's an annoying launcher now? Had to look up how to bypass that asap. Just play BG3, it's just better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a good game. An amazing even. Perhaps one of the best RPGs that exist. I see all the effort and how genuinely worked-through the game is. I'm sure it was a lot of work and effort, gameplay-wise, voice acting -wise, and in many other ways.\n\nI just genuinely didn't enjoy playing it. Not because it's bad, but because (as it turned out) it's not in my taste. I should have probably catch it and not play BG3 (which I disliked too). After an hour in this game I feel exhausted and get a headache (it's not even due to the strategic difficulty: I enjoy stellaris for example or actual D&D).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game feels a bit stiff and emphasis is put on the story. I didn't like the gameplay since there is no real strategy taken into account. Very big hype maybe for the story but too much hype for the gameplay and so-called strategy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game loading time is pathetic, it freezes and doesnt advance half the time, and its not my pc's fault because i can play way more demanding game like baldur's gate easily with no problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea how in the earth this game got that much of upvotes at this point. Literaly it forces you to play pretty much at the same way while pretending as if it is not forced. Enemies at your level may one shot your characters like they mean nothing. Tries to be too complicated while making the fights uncessarily unfun and smothering. Do you have a tank in your party. Too bad. AI will God damn b-line to your rogue-mage directly for he-she has the lowest defense. Do you want to prevent that? Still too bad. Cause phy-magic our won't let you do smt to them pretty much. Do you want to get the initative first so you can have the upper hand? Nope. Cause AI cheats and always gets first move so it bulldoze your party. So you seek to cheese on most cases as such sending one member from the start then moving the others in next. God what a frusturating experience...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As always, Larian studios makes it beyond frustrating to simply find where to go. It's not a fun element (in my opinion) to waste non stop time walking around the map trying to simply find where to go.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute GARBAGE compared to DOS1. Literally 100% of everything is worse and it makes me so sad that I bought it and spent this long playing it just to be so disappointed. Absolutely every aspect was a step back from the first. Rest in piss, you will not be missed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a lot of text\ntoo lazy to read \nI want to play a game, not read a book 1/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Friends started a game without me. Allowed me to join halfway through. Playing Red Prince. Had no control over my build, terrible equipment, and can't influence the story at all.\n\nNot a great first experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not sure how I even made it 53 hours... kept pushing myself to get a little further in the game for no good reason other than I spent money on it? The story and gameplay are fine I guess, but I would say after about 20 hrs in I was pretty bored with it. Eventually got to a new area and I thought it would get fun for me again, like the first few hours were, but nah... I'm just bored with the pace and theme of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A fun game however I don't like the way God has been depicted in it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for something to scratch a BG3 itch, you will not find it here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game... until you arrive to Arx...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for more BG3 experience then stay away from this piece of shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game blows",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gareth is dumb, a real madman!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too many bugs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not even MMO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game looks good, runs well and has awesome soundtrack. Mechanically there is rather complex system both as classes go and the combat is challenging even on the easier difficulties. Even the lore and the world you explore is a bit unique and interesting. And there is a narrator with a nice voice. Oh yeah, almost all text has voice actors as well! It is very well made RPG game with neat features like coop.\n\nSo why the thumbs down? The story. It is like they forgot to hire a writer. Your band of misfits has zero reason to stick together, in fact they have motivation to kill each other, but they never do. The game's story is like visiting theme park: nice to see what is all around, but there is no logic cohesion to it. After you escape the first island the story falls apart.\n\nIf you can disable your brain or play this game while high, it will be fun ride. Sadly, i have higher standards for my \"classic\" RPG games where story is the only thing which MUST be there.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Maybe this game could have been considered \"good\" at the time it released, it doesn't qualify by modern standards. It is so slow and so clunky as to become a struggle of will just to keep playing. But the real issue for me is the quest design; I literally can't solve any of the main objectives. It's too obscure, with too many hidden obstacles that I'm sure the developers though were clever but just end up serving as audience abuse. Bottom line: it isn't fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game ruined by the ending.  Came back to this after never having completed it before.  Recurring theme with Larian games is amazing story and mechanics, but absolutely awful initiation in fights.  You either need to always sweat position for them or you have an unavoidable rigged fight.  Ending sequence involves a multistage fight where not once, but twice you are forced to have your characters amassed like idiots close together.  Can't really pregame potions with the no pause setup, summons despawn before  battle.  Stacking initiative is kind of pointless as it forces a start rotation.  This isn't highest difficulty, this is forced nonsense that removes all strategy.  All of your characters are force pulled in so that you can't hedge against the eventual fight.  The two different sides of enemies ignore each other to attack me exclusively.  I have absolutely no idea what the developers were expecting you to do here other than play one exact specific way cheesing certain stats, which is extremely boring.  Feel like I wasted my time on this playthrough, unless I use cheats to just skip to the story conclusion. \r\n\r\n9/10, just salting that the end fight is so poorly designed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Possibly one of the most frustrating games I've ever played. I did a full two player run with a friend on Classic difficulty, start to finish. After having played through BG3 twice and enjoying it, I expected this game to feel similar. Do not make that mistake.\nThis game has major balancing issues, but not combat wise, but knowledge wise. If you go into this game knowing and looking up everything, you'll probably clear it all no problem, but going into this game blind will result in you getting your ass handed to you. Surprise encounters out the wazoo, enemy immunities that can screw up a majority of builds, the physical/magical split. Oh and some of the puzzles are absolutely idiotic. Then there's the add-ons, fantastic additions if you don't care about achievements, but if you do, you gotta keep em off, which really sucks given they're all QoL things that exist to make this boring game significantly less frustrating. Want to be able to see ghosts without clicking a button? Tough luck, no achievements for you. Want to replenish a resource that isn't hard to get but takes like 20 seconds at the end of each fight to replenish at the click of a button? No achievements allowed.\nAlso lets talk about build variety. And how it sucks. Do you want a hybrid magic/physical guy? Enjoy gimping yourself. Heck, do you want half mage half physical team members? Enjoy gimping your team. You pretty much have to go all in on one type by the end of the game because of the game's magic/physical armour health system. Oh and you better hope you get good levelled gear on level, or your armor will be too low and this game becomes CC hell, because almost every ability has an unavoidable CC once your armor is gone.\nAlso by the end of the game, you better have at least 5 points in polymorph if you want to do anything, cause if you don't, good luck with your builds.\nAlso civil skills are stupid. Maybe if you got more points it wouldn't be as dumb, but lockpicking eats lockpicks success or failure, same with identifying, so you better have a mask of the shapeshifter or an undead in the party if you don't want to deal with that crap.\nFinally, ignoring balancing issues, enemies regularly jumping out of nowhere to fight you, the fact that the game has levelled randomized loot, the weirdly rushed ending to many story arcs and the fact that the game tells you nothing, the game is broken. Numerous times, dialogues that were supposed to happen didn't, things that didn't seem like they were supposed to happen did happen, and my friend and I literally skipped the final boss because the game bugged out, and we just... didn't fight it.\nAll in all, this is probably one of the most frustrating games I have ever played, that punishes you with disabling achievements for trying to make the game not even easier, but a smoother experience. Also you're locked into your companions for the whole game, so you better like em once you pick em. Honestly, just play BG3 again, that game despite having some similar issues is a million times better, and doesn't have that stupid magic/physical armor mechanic.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Crashes frequently. Different places, different times, whether playing a few minutes or for longer periods of time. Crashes in Fort Joy walking into arena. Crashes in Reaper's Coast. Game simply exits. No error message, warning, or indication about to exit. Just back to desktop.\n\nWindows recommended compatibility settings for Windows 8. Larian support page recommended running game directly without Steam. Still crashes on windows 10. Played fine for a while. Then doesn't play fine. \n\nCamera is visually disorienting when edge panning due to elevation changes (trees, cliffs, anything similar). Camera jumps high, jumps low. When scrolling around to see where to go, find a chest, road, or something, this is just plain awful.\n\nFind a place you want to go on the big map? No way to click a point and instruct party to go there. Exit map and walk there bit by bit or scroll the area (with that disorienting up / down camera going across terrain), find your spot, click and hope your party doesn't stop for ground obstructions or obstacles.\n\nMario 64 has better camera free look than Divinity OS 1 or 2.  That's on Nintendo 64! \nI don't know how beta testers didn't get headaches from this camera in Divinity 2.\n\nGeneral rule of thumb appears to be destroy opponents before they get turns. Enemy turns take a long time. Sometimes, game decides to think about what to do (I guess?) so a minute or so later, finally completes that opponent's turn. Now do it again for the other 5+ in the fight. No way to skip this waiting.\n\nBattles are so monotonous on enemy turns, I do something in another monitor. Maybe that's why I get crashes ... trying to play windowed. I don't know. Battles are time consuming and boring. Wait, wait, and wait some more. Oh, you're incapacitated? No turn for you. Now wait again. Oh, look, still incapacitated. Just reload game, try to knock them into incapacitated statuses first. Or just explore elsewhere, come back with another level or two, and wonder why they were difficult at all.\n\nSome waypoints should be closer, especially when a story quest sends you somewhere repeatedly. \n\nThe quest log ... is unusable the more quests appear on the list. No search option. So you play along, get a message such and such quest updated, go to look. Spend 20 minute reading them line by line looking for this quest that IS NOT THERE!! Where is it? I don't know. I saw the message, I know the name. I can google it. I cannot find it in the log. The log is USELESS clutter. The internet is easier if you're looking for a particular quest, details, story, or what to do. The built in quest log in this game is unusable as it enlarges with various quest tidbits. A search feature would help immensely here. Same for inventory for finding something. Some prankster designed a chest that you must be in precisely the right camera position to actually reach. Thankfully, there's a skill to just put stuff like that into your inventory without that level of work. After 5 minutes of trying to copy from a youtube video, I gave up and used the spell. That's just bad design.\n\nGame's a time suck. Get used to it eventually. Pace of combat is slow. You can click faster than the game is ready, ending up walking somewhere instead of actually using a skill from your hotbar. Camera is horrible for elevation up / downs. Other games have similar jerkiness in their camera movements as well. This game, you have to look around and that's difficult to have occur so much, even just rotating around to see the terrain for a battle.\n\nOh, and my favorite is staring at the game waiting for combat to advance only to see the message: Not your character's turn. Have to go click on your portrait to do your turn. The game didn't put it there automatically. Seems random when it occurs.\n\n I must've put in 30+ hours without a crash. Then, one day, crash after crash. Install new software? No. Change drivers? No. Skip playing a week or so, then put in a long time - all the way to Arx with maybe two crashes. Fire up next day, try a new game for kicks to experiment, four crashes before even escape Fort Joy. That's not fun.\n\nDivinity OS 2 has easier inventory management (still a pain with a lot of stuff) and equipping gear, spells, etc. than Divinity 1. Game 1 is more stable on my windows 10. Game 2 crashes - a lot. That's what sucks the fun right out of number 2.\n\nAlso, divinity 2 has less of all that creepy blood emphasis of game 1.\nIt just crashes repeatedly :(\nSo no, I wouldn't spend a dime on it in this state. But I already have it, so I'm stuck with it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Welp, That's over a hundred hours of my life I'll never get back. The fact this is Overwhelmingly positive on steam makes me feel like I played a different game. Whether it be the boring characters, Clunky game play, confusing story or the straight up stone walling of some boss fights this game has no end to the bs it throws at you, 3/10 throwing the shields is fun. Skeletons are cool. fyi the reddit of this game sucks dick. Ask a basic question and youll be hit with something along the lines \"turn the difficulty done lol\" or \"You should just do this exploit in act 1\"",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "i really want to love this but i just cant, the world and characters are very interesting and cool but combat system with basically 3 hp types is very annoying to play around with even with all the build flexibility in the world that this game provides",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont understand why some say this is a \"masterpiece\". This game according to me is far inferior to the first one. If you like to try and control the battlefield with CC and such, you will be disapointed. They have nerfed that into the ground compared to the first game. When it comes to the story, you will have to either do a free for all in co-op (pray that you get to talk to every npc with your character before some other character does this that might render said npc unavailable) or do a single player play through. But even in solo, you will have to make sure every henchmen talks to every npc in order to not risk missing out on important parts of their story. This if you ask me, is just frustrating design and overall dumb. Get the first game instead and pass on this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a good game, but hear me out. \n\nThis is a negative review because the game has insanely high review scores BUT it has some glaring issues. \n\nThere's a bit of a catch though. It's the fact that I've only become frustrated enough to leave a negative review after multiple playthrough's. This is because I was so pleased with my initial experience that I was willing to overlook the issues back then. I am not willing now. \n\nThe worst issue here is the simple fact that many fights in this game feel borderline unwinnable unless you already know how the fight will go before going into it and take steps to give yourself as much advantage as possible. This doesn't feel like \"tactical\" gameplay and is very frustrating, probably the most of any of the issues this game has. \n\nThe second biggest issue is that you can really easily screw yourself over just because you talked to someone with the wrong character, which btw can be very hard to avoid in certain situations where npc's approach and initiate dialogue after a fight or something. They just go for the nearest npc and you can't well control that. If you are playing with friends, this mostly manifests as the player with the character who has persuasion having to be the one who goes first everywhere to talk to all npc's and see all new areas, otherwise you might fail some essential dialogue option. Feels like it punishes the other players for exploring.  \n\nThe rest of the issues have mostly to do with jank or bugs, like quest entries and markers not updating properly (this happens ALOT, but thankfully actual quest progression rarely breaks). But one of my biggest personal issues is the fact that many near-essential game changes that come bundled with the game and were made by the devs are treated as mods and disable your achievements. Like, really? Almost all of them are quality of life improvements that should have just been part of the base game, don't get me wrong it's extra nice to have the option, but not if it punishes you for using them. \n\nIt's a good game, and you probably owe it to yourself to play it if you are a fan of crpg's, BUT it still has issues which may not be conveyed to you by the high review score. That's why I decided to write this.\n\nAh yes one final thing. Traps in this game are on a limited, short timer, which counts independent of the combat turns. They are fucking useless. Absolute garbage and waste, baffling design decision that I still struggle to comprehend. Normally I love a good use of traps in games like this (Underrail is the absolute king of this plus also stealth) but in this game it is awful. But that may be just me, cause I'm a traps enjoyer.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Not enjoying the combat system. It's doable but I don't enjoy how it creates challenge. For example pre-positioning enemies in good positions and clumping up the party (when the fight happens on a new map), setting them them up to get blasted before they can do anything. Or, just making enemies far stronger than the party members, forcing you to figure out what areas to avoid by dying and reloading. The game does a poor job explaining how things work. You get a lot of options and variables without context, and you need to pick wisely or suck. It all results in having to google how things work, and meta-gaming before fights, which is detrimental to the immersion.\nAlso, the game world is supremely bleak and depressing; I don't need a game for that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I essentially had to force myself to get to the end of this game, after owning it for years and restarting it repeatedly. It's gorgeous, D:OS1 is one of my favorite games, and I was so excited to play the hero characters and experience their storylines, but playing this game was [b]tedious[/b]. Several puzzles were so nonsensical and presented so blankly that I (like many other players, it seems) kept having to go online just to figure out what I was supposed to do... which ended up making the puzzles boring. Same with a lot of the combat (one of my favorite parts of D:OS1) - there's giving players a satisfying challenge, and then there's forcing the player to slog through endless tedium. This was unfortunately the latter.\n\nThe ending...oof. I chose the option I thought was best, and it ended up being cynical and depressing. Looking online, it sounds like the other endings aren't any better. The epilogue was dull as dirt and droned on for way too long.\n\nI can't even say \"well, I'm glad I finished it at least\". It just wasn't fun. Huge bummer. Guess I'll go replay D:OS1 again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Divinity: Original Sin 2 is one of those games that remind you why you fell in love with RPGs in the first place.\r\nThe humor? Chef's kiss.\r\nThe characters? Absolute chaos goblins with personality.\r\nThe graphics? Weirdly gorgeous for a game that’s not exactly new anymore. Honestly, half the time I forgot this thing came out years ago, because everything looks like it has been polished by a team of very dedicated fantasy elves.\r\n\r\nAnd the classes? Amazing. You can basically create anything from a teleporting rogue assassin who politely stabs people in the face… to a necromantic violinist who heals by bleeding on things. Truly art.\r\n\r\nBut then… Source Points happen.\r\n\r\nAh, yes. Source Points. The magical energy that fuels your strongest abilities, your coolest spells, is needed to acomplish dungeons/quests, and—apparently—your greatest frustration in life.\r\n\r\nIt’s not that the game limits you on them. That would actually be interesting, right? Making tough choices, thinking strategically, feeling the weight of your decisions?\r\n\r\nNope.\r\nDivinity says: “You can refill them endlessly, dear player!”\r\nAnd then quietly adds:\r\n“…Just run back and forth like a lost chicken to do it.”\r\n\r\nWhy?\r\nWhy give me infinite refills… but only if I prove my dedication by jogging across Rivellon like I’m training for a marathon?\r\nWhy ruin the pacing of such a brilliant game with a mechanic that feels like an unpaid internship?\r\n\r\nInstead of epic adventure, I get Source Point Fetch Quest Simulator 2017.\r\n\r\nAnd that’s when my enthusiasm died a dramatic, theatrical death. Not by combat. Not by a boss. But by pure, uncut inconvenience. It’s like the game whispered:\r\n\"You like fun? Too bad. Go touch another puddle of ghost juice, peasant.\"\r\n\r\nSo, Divinity: Original Sin 2 is still an incredible game with unforgettable humor, beautiful visuals, and rich gameplay.\r\nBut Source Points?\r\nYeah, no. Hard pass. When a mechanic makes me feel like I’m clocking in for my shift, I put down the controller and walk away.\r\n\r\nFinal Verdict:\r\nA masterpiece held hostage by a mechanic that thinks I have the free time of a bored god. If Larian ever patches Source Points into something less annoying, I’m back in. Until then… Rivellon, it’s not you. It’s your weird energy system.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I found this game to be a real slog to be honest. While I would like to give it the thumbs up due to the overall quality of the game, I found the multitudinuous quests cumbersome and uninteresting (much like all the NPCs), which required endless backtracking and busywork that felt more like a chore than entertainment. On the positive side, I mostly enjoyed the combat system.\n\nWhile I almost always complete a game once I start it (even if I put it to rest for a while), after encountering another dead end after 30 hours of gameplay, I just don't have the motivation to go on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Single player character creation - and thus the game - seems to be broken on M-series macs - after you make your character, it just says \"waiting\" and pinwheels into application not responding. The same game files work fine on intel macs, save files created on intel macs work fine on M-series macs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Had to go through a ton of log-in options before playing the game which was mediocre at best. Have deleted it and is now where it belongs...the bin!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most confusing and frustrating games I've played. The game mechanics were fine, although I hate to lose a turn from being knocked down, but plot of the main stories and side quests were convoluted and often felt like a waste of time. Peeper's side quest was the last straw for me. I loved Baulder's Gate 3 so I know that Larian can make great games, but this was not it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really would love to like this game. It has engaging combat, a great multiplayer and interactivity that I have not seen before.\nThe start at Fort Joy is amazing to play. It's the best balanced and the most well-rounded. I always knew where to go, always found new things to explore and I never felt lost story wise.\n\nAll of this starts to turn around in the following acts and I feel like it gets worse or at least more glaring the further you progress. \nThese glaring issues for me are:\n\n[b] \"Open World\" [/b]\nOn Fort Joy the open world felt rewarding. The battles were challenging but beatable. So, I was delighted to see what may come after Fort Joy.\n\nWhat I ended up finding were \"natural\" level barriers that forced my friend and I to follow a linear route to so that we could beat the battles (note that we played on normal).\nFinding this linear route after the game told us to pick and choose where we wish to go next just felt confusing. In total it took us a month to progress (we played once every week). We desperately staked out which area might be appropriate for our level 12 characters. I still remember each area of the second act and which level is associated with. \nPerhaps we where unfortunate to not have chosen this path. Mayhaps, we simply overread an important dialog pointing us towards the right direction.\nThe only thing I know for sure is that the only for us beatable area was [spoiler]in the top left corner[/spoiler] of the map.\n\nYou have to pass multiple other areas with higher levels to get there.\nNevertheless, this area was still a mighty struggle. We fought with everything we had. We strategized about each battle. After every loss we took notes, regrouped and attacked again. Every potential \"exploit\" we could see, we utilized.\n\nThis level of tenacity does not feel appropriate for a normal difficulty playthrough at least not for me.\n\n[u]Recommendation[/u]\nThe pre-set levels with the exponential leveling system to not work together with the \"open world\" aspect of the game.\nI'll get more in-depth with the leveling in the next part, but giving the player the directive to \"reign freely\" while setting fixed levels to the enemies does not add up. \nAdjusting the enemies to the level the player is feels way more appropriate. Maybe, sprinkle in some fixed levels as a boss to really stop the player if the story demands it, but putting this everywhere is just misguided. \n\nEspecially since it let to us loosing track of the story completely. We started each quests, but we could never finish them due to the battles. So after a week or two we came back to the quest without having a clue of what was going on. (The in-game journal is quite lack luster on this regard)\n\n[b]Levelling[/b]\nIn total you can get up to level [spoiler]21[/spoiler], which feels a little low looking at other RPGs. The issue I have with this is that you are at level [spoiler]12 when leaving Fort Joy[/spoiler]. This leads to the weird situation that levels are exponentially more important the closer you get to the max level.\n\nAt first you may be able to win a battle against a two levels higher foe, but towards the end if you are not on the same level as your enemy, you get demolished.\nWe literally couldn't defeat the final boss since we were one level below it. Coincidentally, we also were at a point were we felt like we completed every quest available to us. After trying for another fruitless three weeks, we loaded a previous save and tried to squeeze out another level so we have even an inkling of a chance.\n\nAs a [u]recommendation[/u] I can just offer a proper re-balancing of the later areas and a plead for general level cap increase. In the last stages of the game seeing the next level XP requirement to be in the millions is disheartening.\n\n[b]Quest Management[/b]\nA more minute point but it feels like the bad cherry on top of the issue cake. \nThe in-game journal feels in-adequate to help the player remember story points and even gist's of quests. The best you can hope for is a red marker on your map, and a small to-do entry. The point of the quest, the afflicted affiliations and the severity are often not included. \n\nEspecially after our 3-week excursion through level barrier hell, we essentially reached a point of mindless \"red flag grinding\". I at least felt like a zombie trying to stave my XP-hunger by any means possible. So, every found quest was like a 3-star prepared meal and I devoured it as far as I could, but the chef seemed to hate me and always put glass shards in the food so that I had to come back to it later after my gums were accustomed to the \"difficulty\" (Essentially I needed to level to beat a foe)\n\nEverything combined together let to me loosing completely any inkling of the story.\n\nA small anecdote concerning story. My friend and I felt like we managed to skip great chunks of it unwillingly. One example for this is the story around Gareth.\n\nFor me it felt as follows: [spoiler]The great leader Gareth managed to escape the prison island Fort Joy with the help of his divine acquaintances (us). Together they set sail to Reaper's Coast where Gareth's parents resided. He immediately went to his parents but Magisters seemed to have been a step ahead of him. The battle did not take long, but neither did the triumph. Beneath rubble lay two corpses ... his parents. Silently he buried them. A deep anger begins taking hold of Gareth. Before he could do anything reckless his two divine acquaintances appear. He told them what happened. The trio stood there silently. Until one divine spoke up: \"It is what it is, bro\".\n\nThese words quiet the anger immediately and Gareth went back to the ship never do to anything of note again.\n[/spoiler] \n\nI do not know how one should experience his tale but this is beyond ridiculous.\n\nThis was roughly the experience I had with almost all of the story points which is why during the end credits I felt like I was being introduced to new characters since I could not for the life of me remember who any of the characters even where.\n\nMy [u]recommendation[/u] for this one would be to add more information to the journal, and to add a glossary to keep track of the different parties, their goals and what the situation currently is. The chapters setup did not help at all. It rather added to the confusion because some quests where chapter-overlapping, so they never disappeared.\n\n[b]Gear[/b]\nI had a very unique problem with gear throughout the whole game. Namely, I was often stuck with too low leveled gear because of set combos. These set combos gave me unique traits which I liked, but I could never transition smoothly to a new set due to bonuses of the set combo.\n\nSo my solution would be to upgrade my gear, but there is no way to level up gear. There is a DLC-esque bundle modifications containing the gear sisters. Which adds four sister merchants in the game which sell you (limited) quantities of gear upgrade ingredients. Even if you managed to pay their insanely steep prices (easily 10k per PIECE). Their limited quantity would not even allow you to upgrade a full set of unique gear ONCE.\n\nI re-iterate my final gear that was a 5 piece armor set, was physically not possible to be upgraded fully ONCE even if I collected ALL the armor upgrade ingredients.\n\n[u]Recommendation[/u]: Please let me upgrade my gear, I'm begging you.\n\n[b]Overall[/b], I think the game has a fantastic premise, but these points just gave me such frustration while playing that I simply felt saddened by the thought of what could be. If I'm just unlucky with how my playthrough went please tell me what I could have done. I'd really love to find my appreciation again for this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is mostly fine, and if I enjoyed text driven puzzle games, I would give this much more of my time, however, sometimes I just want to be able to wander around killing stuff and playing with the combat system, and, as of the first chapter, this game has very little action with a lot of running around talking to people and searching for hidden loots that might be what the quest was talking about... \r\n  The combat seems fun enough, with a high degree of versatility, and there is a standard selection of classes with a dynamic class system and plenty of magical treasures and abilities which you can learn from finding skill tomes in the world.... I would really like for this game to evolve to be open world where you can just wander around ignoring quests and puzzles if you choose, but this game seems to be a series of puzzle quests with some action mixed in.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game could be one of the greatest, but the sheer amount of crashing I experience just trying to play this game means I cannot recommend this game at all. Loading saves has about a 20% success rate of working with most attempts leading to infinite loading or the game freezing, frequently needing a restart of the computer. Then there are the crashes during the game. Frequently, the game will stop responding and soft lock my computer, usually needing a hard reset to continue using it. This is so disappointing due to the potential this game has. I've tried every fix I could find and I have tried to just push through it, even though it sometimes takes upwards of 30 minutes to successfully load a save, but I cant keep putting up with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just get Baldur's Gate 3 instead. It is a much less frustrating experience. Gameplay is a slog and that gameplay experience is riddled with bugs you will have to work around",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game's balancing and systems are still as unfun as I remember. Also there's an annoying launcher now? Had to look up how to bypass that asap. Just play BG3, it's just better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a good game. An amazing even. Perhaps one of the best RPGs that exist. I see all the effort and how genuinely worked-through the game is. I'm sure it was a lot of work and effort, gameplay-wise, voice acting -wise, and in many other ways.\n\nI just genuinely didn't enjoy playing it. Not because it's bad, but because (as it turned out) it's not in my taste. I should have probably catch it and not play BG3 (which I disliked too). After an hour in this game I feel exhausted and get a headache (it's not even due to the strategic difficulty: I enjoy stellaris for example or actual D&D).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game feels a bit stiff and emphasis is put on the story. I didn't like the gameplay since there is no real strategy taken into account. Very big hype maybe for the story but too much hype for the gameplay and so-called strategy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game loading time is pathetic, it freezes and doesnt advance half the time, and its not my pc's fault because i can play way more demanding game like baldur's gate easily with no problem",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea how in the earth this game got that much of upvotes at this point. Literaly it forces you to play pretty much at the same way while pretending as if it is not forced. Enemies at your level may one shot your characters like they mean nothing. Tries to be too complicated while making the fights uncessarily unfun and smothering. Do you have a tank in your party. Too bad. AI will God damn b-line to your rogue-mage directly for he-she has the lowest defense. Do you want to prevent that? Still too bad. Cause phy-magic our won't let you do smt to them pretty much. Do you want to get the initative first so you can have the upper hand? Nope. Cause AI cheats and always gets first move so it bulldoze your party. So you seek to cheese on most cases as such sending one member from the start then moving the others in next. God what a frusturating experience...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As always, Larian studios makes it beyond frustrating to simply find where to go. It's not a fun element (in my opinion) to waste non stop time walking around the map trying to simply find where to go.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute GARBAGE compared to DOS1. Literally 100% of everything is worse and it makes me so sad that I bought it and spent this long playing it just to be so disappointed. Absolutely every aspect was a step back from the first. Rest in piss, you will not be missed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a lot of text\ntoo lazy to read \nI want to play a game, not read a book 1/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Friends started a game without me. Allowed me to join halfway through. Playing Red Prince. Had no control over my build, terrible equipment, and can't influence the story at all.\n\nNot a great first experience.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}