{
  "positive": [
    {
      "review": "⚔️ Despite its rawness and bugs, it's still a solid and good survival game. It has a great medieval barbarian fantasy atmosphere and captures the spirit of Conan's lore. The locations may seem large, but they're actually not that big. They may also seem empty at first, but that's not true either. There are plenty of resource places and points of interest that contain useful items, not junk. The world is completely free to explore, and there's a clear explanation of what you can do (a lot of professions). Even without the overpriced DLC's, there's enough content. The standard difficulty won't let you relax, but it's fair, although the ranges of some weapons can be a challenge, especially on bosses. However, even in singleplayer, you're on a server; there's no pause, you'll have to find secluded spots and monitor your stats, as exiting to the main menu resets your dungeon / quest progress (but even so, items / mobs respawning too fast, requiring adjustments).",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This is the title that sparked my love for survival games, with more memories tied to this than any other that I have played over the years. It will always be ‘one of the greats’ in my eyes.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I’ve been playing Conan Exiles since day one of Early Access, and watching this game evolve has been incredible. What started as a rough survival experience has grown into one of the most content-rich and immersive survival RPGs you can play today.i kinda burned out after 2500 hours but i still return from time to time.\n\n- Massive, brutal open world\n- Building system that’s still one of the best in the genre\n- Combat improved drastically over the years\n- Thralls, pets, mounts — the game within the game\n- Tons of content updates, new areas, dungeons, and systems\n- Amazing modding community\nWhether you play solo or with friends, there’s always something new to do.\nExploration feels rewarding, base building feels meaningful, and the world has that gritty Conan atmosphere that just pulls you in.\n\nIf you enjoy survival games, Conan Exiles is a must-play.\n10/10 — From Early Access to now, the game only gets better.\nP.S. Play on dedicated servers ,official are to slow and  empty",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is really one of the greaters games when it comes to open world survival craft. The building and compainion menagement mechanics are spot on. Mapmaking is excellent. The gameplay is immersive and has a very pleasing soundtrack.\n\nIf you like to build superb bases you have plenty options with buildskins, for which most of the DLC's are worth buying. The combat system is not too complex and likable. The biomes are interesting and fun exploring and wont bore you very easily.\n\nWhen you're a solo gamer like me and don't quite like most basebuilding PVP gameplay mechanics the hybrid PVP/PVE servers are a great option if you still want the thrill of some battle engagement with other players.\n\n Definitely an amazing game if you're into this kind of genre.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "After over 10k hrs between Xbox and P.C., I can honestly say this is is my favorite game that I love to hate! \n\n[b]Caveat emptor![/b] Wait until it's on sale if you're going to subject yourself to this frustratingly buggy P.O.S., or better yet, run while you still can!\n\nThere are plenty of other reviews that enumerate many of the reasons for my opinion. I suggest reading a few of them before buying Conan Exiles.  I'm still going to recommend it because I'm an addict and I want to share the agony and the ecstasy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you are looking for another survival base building game I would 100% suggest this game for you I now bought this game for my Xbox 2 times (one for a friend) and now again for PC. Most things are easy to understand/figure out but you might still need to look a couple of things up.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "There's a lot to say but also little to say.\r\n\r\nIt's pretty solid. There's a little SoMeThInG fOr EvErYoNe.\r\n\r\nIf you're into RP the roleplay scene for this game is still huge and going.\r\n\r\nNew updates love to break the game.\r\n\r\nlol u can be naked lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "By Crom, this game has seen so much change since early access .I've sunk 1000's of hours into the game brought all the expansions and more, the community dlc is incredible and did it all with the best of friends .\n\nexperience every thing the first time with those you trust, the desert claims the weak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. Only played singleplayer, it runs great it has a great thematic. \n\nOnly bug i encounter is the one where the thralls fall under the terrain but they get back up after you move.\n\nBut it can t stop my enjoyment of running arround with 2 half dressed females and a rhino caravan just exploring and building.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Much better on PC as console and scratches an itch that other similar games can't.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's just ARK but better. Now, I'm not the most accurate reviewer because I play survival games for the sandboxy/progression-typeish shit. I can say this game is pretty good at that. It's got a whole lot to offer, fun combat, and a decent community (mileage may vary). Not to mention mod support, so pretty much anything is possible. As far as survival games go, this is one of the best in my opinion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game to play with friends, love the open world",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I’ve ever played! It offers a massive world full of events.\n\nPros:\n- A huge, eventful world.\n- Diverse regions with stunning visuals.\n- Eye-pleasing colors.\n- Exciting and impressive boss fight mechanics.\n- Freedom to build your own city with all the details you choose.\n- Perfect for fans of adventure, role-playing, and exploration.\n\nCons:\nYou can only play with friends by renting or creating a server, and in regular (Co-op) play, you can’t stray far from the host; if the host dies, other players are automatically teleported to them. However, you can play on official servers if you want, but you won’t be alone with just your friends.\n\nPersonal Rating:\n8 out of 10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It certainly is one of the games of all time. Okay to sink some hours in while in Co-op, but it really shines either in multiplayer servers or RP servers (Provided it is a good Christian server, amen.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun but defiently not worth 40 dollars there are a bunch of bugs and cheap game mechanics the npcs ai is very stupid and easy to trick the spawn rate is also weird i build my base on a island and aligators keep spawning there its really annoying and dlc feature items are listed on the crafting menu! very very very cheap for a 40 dollar game! still overall the game is fun you can kidnap people, slash peoples head off and funny stuff more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coan Exiles is a fun game. \n\nBeen playing this with friends PvE style with great joy. Some observations:\n- Lots of things to do, explore and investigate. It does not feel like a grind.\n- Enjoyable graphics\n- The world feels empty at certain places, probably ment as space for PvP style base building.\n- Buggy, but amazingly most bugs seem to restore themselves",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good survival game with decent follower and pet systems and good base building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing better than spending days building a base and searching far and wide \"converting\" dozens of thralls, only for your friend to summon a god to accidently step on it.......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devs really need to start paying attention to the server crashes. They are getting worse. I like the game but sooooo many issues it's becoming not fun anymore. Most days I can't even log into the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great with friends, loot pillage and enslave you enemies, I wouldn't play much with out my pals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is GREAT!\nThere are certain bugs here and there but for the most part it's a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is extremely fun and easy to play. If you have read any of the books, then you will find it very simular. Now each server will have different mods so you may want to try several servers to see which setup you like most.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game, ecpeshally with mods. better with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan is still a very immersive first person survival game. I find myself having to go back and replay the game every few months!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game as long as you stick to PvE it if you even think of switching to pvp you will regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok late to this but loving the game play and the fact the Devs are still supporting it in 2025 ! WOW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, the art style and creative direction is excellent and a one of a kind experience; the large world feels lived in and haunting in the most beautiful and compelling way but the game's greatest drawback, a poor combat system, takes away from the overall enjoyment and makes the game mediocre... I can still highly recommend the game to any survival fans or fans of the Conan universe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Long term playability.  Massive game with lots to discover",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to love Dune because of how much I love Conan Exiles. But all Dune did was drive me back to Conan. \r\n\r\nThis game is easily the most beautiful base builder I've ever played, and my friends and I have had SO MUCH FUN with over 700+ hours of server time over the years. Soooo much to explore, and all of it feels like someone took the time to put it there. Rare weapons and armor, rare companions, leveling, all the things you want in an RPG too.\r\n\r\nDefinitely the most fun if you have a crew to play with, but the public servers are pretty friendly from what I've experienced.\r\n\r\nFuncom, just come back to your elder child and expand the map, or hell build a new one. I'll even pay for map DLC and be a happy fan. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing for a long time, compared to other survival games, I think the most successful game is 10/10! Also, I have my own server for this game, the theme is \"Dominants and Slaves\", RP/ERP/PvE, we also have a PvP Arena. The server is international, free from politics, the main language is English, but there are Russian and French channels. IP: 178.213.115.90:7777 [url=http://178.213.115.90/]server site[/url] [url=https://discord.gg/Brgy8nxq5R]Server Discord[/url]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoying this game a lot! I like the combat, exploration and base building but I wish there were more story content and less bugs and crushes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan exiles still fun to play , either solo or multiplayer server. Granted took funcom a bit to find a groove, once found it did keep getting better. Ofc had few bugs coming in and breakinbg mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game - a little buggy here and there, but overall fun. I love the building mechanics. Thralls are fun to deal with. Combat is a bit tough for those of us who just aren't good at it, lol. But overall, I'm enjoying the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the games that deserves more attention and love from the global gaming population. I think its true potential has not yet been revealed to the wider audience for some unknown reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried lots of survival games but I always return to this veteran's embrace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most immersive games I've played. The open world is big enough and lively.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan Exiles is a buggy, sometimes chaotic, crazy mess.  That being said, I've enjoyed the last year I've played the game.  The game will shine in how you want to play it.  There are servers with try hard pvpers, there are ones more laid back, there are RP and PVE ones as well.  They all have their pros and cons.  I played on an official server my first 120 hours, I learned a lot, and enjoyed the game.  The server I was on had nice people.  But then I found an RP server. I've played many rpg and mmorpg games before, but never really delved into actual RP.  This was a private server mind you, so they had their own set of rules on how things were to be done, and overall, it was very reasonable.  But as I started RPing, with Conan as the backdrop, something clicked, and the game really became alive for me!  I was about done with Conan on the official server, about ready to uninstall, having got a good fill from it.  But when I found others who were adding to the world, creating RP story lines with each other, that's when the game truly grabbed hold of me.  Now, at just over 1k hours, I think I can say that this is worth it.  Yes, there are bugs, there are issues with hackers in game, sometimes you build something for hours, only for it to randomly decide to despawn the next morning.  But if you can find others to play with how you want, you'll find a game where you can have many amazing hours in.  Especially if it's on sale, give it a try, don't get any of the dlc unless you really want to do more with it, as it'll not add to your enjoyment early on. Also, respect your admins on the private servers, they do a lot of work trying to keep those things running smooth for everyone, don't be a d!ck.(I can't say for official server admins as I never encountered them, if they have any)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is filled with bugs. it crashes a lot. but it is really fun to play despite all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those reviews where I wish in between thumbs-up and thumbs-down, there was a \"meh\" button. That's very rare for me. I love gaming. I buy games when I am truly interested in them and the great majority of my reviews are strong positives. \r\n\r\nFirst... maybe Conan Exiles I just played in the wrong order. If I played it 5 years ago, my opinion would be much more positive. But from where we now are in the survival / crafting / building genre, CE hits me like a dumbed-down Soulmask. I love the genre generally and finding ones with minions / thralls / henchmen is a special sub-cat that I long for. But the CE thralls are so much dumber than in Soulmask. Yeah, they can serve at a workstation, but you only get a benefit if they are a crafter of that time and their bennies apply to the station. There is zero automation. Yeah, they can go with you to a fight, but only one of them, and it doesn't really matter how you equip them--their level will dictate their effectiveness and stats no matter how you gear them. Yuck. Let my previous booty make them better.\r\n\r\nIn comparison to Soulmask, the CE map also feels empty, with many of the same types of critters scattered around like you were grinding in an MMO region with not nearly the variety of SM's beasts. Crocs and spiders, spiders and crocs... oh, now hyenas. Hyenas everywhere. I thought there would be a mix of cities here, wilderness, and camps, but it's mostly all camps with a few scattered keeps. Overall, these dynamics make the map feel smaller than either SM or Enshrouded--but it still takes forever to get anywhere because fast travel is very sparse and it takes a long time to earn the right to a mount. Multiple bases? Well, okay. But are you going to run back and forth ten times to bring your stations or are you going to speak the hours to farm them all over again? A drag either way. Not what I RPG for.\r\n\r\nWhere Conan shines is the mix of cultures, including armors (light, medium and heavy), weapons, and detailed building styles. So much more to offer in all those areas than any other survival games bc of the mix of armors and outfits related to the Roman / Greek / China / Japan / Medieval French / barbarian analogues in that lore. Beautiful! And the base-building is nice with lots of fun decor... but the tasks you do there are slow, and not nearly as detailed or automate-able as SM. As a special complaint, while the \"Journeys\" are a great idea, teaching you in-depth one skill set at a time, the game gives you no help at all understanding your next step. A particular galling one was the need to make bricks to build a planter which is the minimalist way CE does farming. The furnace should be the place where you can see how to make them, but zippo. I was confused. Real bricks are made of molded clay and baked. In CE, with no info to indicate it, you bake rocks. What? Yes, rocks. Go brake a rock, stick the pieces in the furnace, and bake. Presto, bricks! Not only does it make no sense--I couldn't find it intuitively. There is also no tip in the furnace UI nor the journey. Frustrating.\r\n\r\nSo, here's CE. A behind-the-times by a decade survival, crafting, building game with minions. Beautiful in the breadth of its lore. Skinny everywhere else.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better open world games I've played. It's taken them years toget it all patched so it works OK but it's fairly stable now and certianly fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, after 4366 hours played I guess I should write a review; \n\nThis is a great game, a lot of fun espeically with friends. \n\nThe issues are: Funcom. Their moderation team are not great, banning people for nothing, but letting hackers run rampant.  Toxicity. So many toxic kids on this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. 10/10 would get lost in a dungeon and lose all my equipment again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came here to support Funcom by playing the game that is closest to Dune: Awakening that I could find.  All the haters can keep hating, I just wanna play games that I love from a developer that I love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly love this game. I played a shit ton on Playstation back like 5 years ago, but getting back into it on PC with some friends lately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game on both play station and one Xbox and it was the first game i got on my Pc. if you enjoy open world survival games and uncovering the mysteries of the land then this game is a good choice for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keeps you going, crafting system seems to be pretty balanced between each other. Impressed with the interactions with the followers/Thralls. Been very enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "active mods, active devs, single player/offline available, open world character customization, and yes pretty people.\r\n\r\nyeah, I'd pay for microtransactions to support this, let the homies still have fun without them tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very creative game. I enjoy playing this game with my friends. Definitely would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just started late in the games life but even at that I am having a fantastic time.  I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The battles are challenging and moving forward in the game can be a serious challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want to preface that while I love this game, I avoided it for a very long time and even when I did cave and buy it, I came [b]very[/b] close to returning it because it feels very poorly made. Many aspects of the game are extremely dated or janky, Particularly the UI looks especially low quality. Even for the time this game came out, it just doesn't look very pretty or play particularly well. 200 Hours later, I am willing to recommend this game, but with a lot of Caveats. I am not going to speak about PVP in this game as I don't really enjoy engaging in it, and it's rather dead/inactive at this time.\n\nThe Combat is really not great. You can tell this game released during the \"Souls-like\" Hype era where iframe dodge rolls and weighty animations were in almost every action game, but it misses that mark. Attack animations from even the lightest weapons still manage to feel sluggish, yet floaty at the same time. Certain attacks can just stunlock you endlessly, while others wind up for a year just to tickle the enemy. It's really not great and balance is all over the place, despite Funcom regularly nerfing \"overpowered\" weapons. Information and stats on the wiki also regularly do not match what is in the game, so it is difficult to confirm information about anything due to largely outdated or inaccurate sources. \n\nBuilding on the other hand is simple yet robust. It follows the standard no-grid, foundation-based snapping build systems many survival games use with a Valheim-like stability system. But I have two gripes with Building: First, many of the games' structures and numerous crafting benches are way too large (the map room and animal pen are both 7 x 7 foundations wide), meaning you need a lot of space and have to make a pretty large base. But the world really lacks in good, flat areas to build and there is no way to terraform outside of stacking foundations. Additionally, in Singleplayer, building is rather pointless. Your base does not [b]ever[/b] get attacked unless you intentionally call a \"Purge\" to siege your own base. Obviously not the case in PVP, which is largely dead, but in PvE Singleplayer, Basebuilding is literally just to make a large area to hold the 20+ different Crafting benches. It is fun though if you are into building specifically.  \n\nThe Thrall System is probably the most unique aspect of Conan Exiles. You can rescue or capture various crafters and fighters, convert them to your faction, and position them to guard your base, travel with you as a bodyguard or help with crafting items (Crafters do not craft for you, but they do increase craft speed and the quality of items crafted. There is a surprising amount of depth to this system in terms of traits, appearances, etc. The caveat with this system is that it is extremely prone to glitches, most infamously that thralls can just glitch and disappear from your world, permanently removed without any explanation. The chance of this is significantly reduced by disabling the \"Living Settlements\" feature, which causes thralls to walk around and socialize with each other. But to this day, there is still no true fix for this issue and the feature is outright disabled on official servers.\n\nFinally, Monetization. This is probably the most controversial aspect of Conan Exiles. Not only is there over $100 worth of Paid Cosmetic DLC Packs (most of which is Building sets themed after a certain culture), but there was also formerly a Paid Battle Pass which was replaced with a Paid Shop known as the Black Lotus Bazaar, where you can buy microtransactions using a premium currency known as \"Crom Coins.\" The Community is pretty much united on the fact that these Shop Items are disgustingly overpriced, Flamboyant Feasts for example is a Dining Table that costs nearly $27, though they regularly list it \"discounted\" for $17. This is significantly worse value than the Previous DLC system where you would get 3 full sets of armour, dozens of building pieces, decorations and weapons that were all thematically cohesive with each other, for around $10. As an added Caveat, Cosmetics and Items purchased via the Bazaar cannot be used in Offline Play. Should the servers close, all of those cosmetics will be gone with no way to recover them. This is not even mentioning the price to Host/Rent a server for online play and the game costing $40-50 on Steam, depending on Region. For what it is, this game is needlessly expensive and the developers seemingly haven't directed any of these funds towards actually fixing core issues with the game, such as Thrall Loss glitches mentioned above.\n\nIf any of those are deal breakers, I would say Palworld is extremely similar and way more reasonable in terms of cost for what you get, despite totally different art directions. And if you already played Palworld and liked it, I am confident you will enjoy this game as the Building and Crafting Systems are very similar, and the thrall system is functionally identical to the Pal system in Palworld in that you capture slaves and put them to labor. Both games are also a bit janky, but work fine enough. I would argue Palworld's \"thrall\" system is a little more satisfying and interesting, but that Conan has better base building and much better character customization, equipment and general gameplay. If you like one, you will probably like the other, though Conan Exiles has much less ethical monetization compared to Palworld's constant free Updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game. i love survivors. i love conan. this brings both to me. idc what anyone else says i love playing in the exile lands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the older survival games it shows its age, especially in PVE, but its still a solid and quite meaty experience with plenty of content to explore and a decent amount of lore if you're into that.  It deserves a recomendation.  Just know you're gonna deal with a little jank here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game. I play it in co op so that I can learn without getting attacked. I play the PVE part of it as I am not good with PVP tactics.  I would recommend this game to anyone who has a creative spirit and just enjoys starting from scratch and building up from there. :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a completely different world. I don't know what you expect from games, but I don't think you'll regret playing this one. It's perfect for those who love detailed games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic sandbox survival - for Conan's fans and not only.\r\n+Pros: Great music and not-too-bad graphics. You can set up your own game, which can offer you much freedom, especially in combination with the tons of mods you can choose from - make it as you like.\r\n-Cons: The combat system is a major flaw.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!  Lots of replay value and hours and hours of game time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall the game is pretty fun and the combat is entertaining. There is a lot to do in the game. The story is pretty sparse and the direction seems pretty aimless at time. I have enjoyed what I have played so far, but you can literally get lost in the desert and wonder around for hours to days and that gets boring quickly. A little more direction would vastly improve the game but overall pretty solid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic, atmospheric and rich survival game. I play with a ton of mods and can't put the game down. It is beautiful to play; the scenery is gorgeous. There is a story element and little bits of lore to piece together with very limited progression quests. If there were lots of quests and a number of plot lines, I could play forever! (I think some mods do this and in time, I may try them).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world, classless system with great building and RP mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is not what it was 8 years ago on release, has had most bugs worked and removed, there is plenty to keep busy for hours and enjoy with friends. The building is a blast and the animal/pet farming is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played survival games before, amazing. Excellent game first time in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its like all Funcom stuff.  Fun until you max your character, then boring as shit because they never add anything new because they are still trying to fix all the bullshit bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan Exiles – Who would’ve thought grinding stone could be this fun?\n\nNo, seriously — I’ve probably spent over 100 hours purely mining stone, which is the most basic material in the game. But that’s what I love about Conan Exiles: even the simplest resources stay relevant all the way up to the highest-tier building pieces.\n\nI have an absolute blast planning and designing my base builds. The building system is deep, creative, and satisfying, and it’s what keeps me coming back.\n\nWhere the game falls a little short is NPC interaction — it’s not the most immersive in that regard. But as long as you’re playing on a realm with a decent population, the community and player interactions more than make up for it.\n\nThis is a fantastic game that I highly recommend. You don’t even need to be a Conan fan to enjoy it — in fact, after hundreds of hours playing, it could’ve been set in almost any universe and I’d still love it just as much. Conan Exiles stands on its own as an incredible survival sandbox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thought that this game wasn't going to be any good a year ago and I was very wrong. Been playing it since then and still love the game. If you like Survival, Fighting, Building and grabbing all the loot you can..then this game is for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I have found this game to be a lot more fun then most other survival crafting games. The combat is more complex and can turn against you in a instant. Death comes often, yet the game doesn't feel unfair. \r\nI would highly recommend giving it a try if this type of game sounds fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've been playing conan on xbox since halloween 2018 and new to pc conan but overall amazing game loving the graphics on the pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty great game. The building side of things is fantastic. Combat feels a bit clunky but not too bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well its like this Conan Exiles is a great game, but i found out Steam makes it even better, let you customise the game the way you want to play it, i reckamend Steam Workshop too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless fun game world either single player or online or private with friends, if you use mods especially this is the ultimate sandbox world to build or be or do anything you could possibly want in this type of setting. \r\n\r\nthough it can be a bit complex at first and you get bound by rules if you join others servers.  It's worth the effort to learn how to use admin tools or mods for your own game or hosting if you find the base game lacking but it's a good place to start so you're not overwhelmed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7 years ago today my life was taken from me. they took everything and yet however i dont really care cause the game is amazing and i always come back to it. was a bit sad to see the battle pass go away but with mods this games building is not like any other survival game out there. 10/10 recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun game, been playing it on & off for years now from Xbox to PC, Fun solo and even more fun with friends or apart of a community server. The 1st/ main map (Exiled Lands ) is a nice large map with heaps of biomes to explore or live. 100% recommend checking it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an excellent survival, crafting, building, roleplaying, PVE and PVP game. It's a ton of fun. I am totally addicted, and I've bought all the DLC and I don't care if I could have got the DLC cheaper elsewhere I want to support the game. It's fantastic, if you like Conan it's sure to be a hit, but even if you are not already a Conan fan, the game systems, especially the building systems, are excellent, the game world is huge, beautiful, interesting, detailed and alive, and the game is just a ton of fun. I am playing on an RP-PVP server as an Innkeeper, I've built my inn, and served several customers already, and will be holding a weekly event at my inn. I plan on playing on a non-RP server too for that experience. But the game is great, and there's a server out there for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game isnt bad, it just isnt for me.\nnow that im thinking about this more im not into survival games idk why i even bought it im gonna upvote it either way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "greatest game for peepl who love to fight steal and dodgeroll",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan is pretty cool it may not have a lot of quests, However it's an open world , basically a giant sandbox, It's got personal quests too , quite a few actually .It's got the Pvp vibe like most , but the Pve is pretty awesome as well .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with friends and even solo. I came from Ark Survival Ascended and fit right in. Tons of mods to play with. Some cons are loading times as you have to load into the funcom server first, then launch the game that you already launched then wait for it to load and watch the same loading video every single time you load in. But overall 9/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for years, I find myself constantly coming back to it, despite its flaws.\nThe game used to be SO much more difficult, until the devs nerfed the hell outta everything and buffed the loot, which should be reverted, I liked the challenge (Not the demon dogs, though.)\n\n8/10, would recommend to anyone that likes the survival genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for a game that was never meant to be what it is now, its done good, different time i feel it would of been a icon in its genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, very confusing game progression - to me it's a little too open world but I like following quests. Lots of cool mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game so much i always get lost in the game that i forget what time it is. if you like games where you can find and fight strong enemies or just here for the story and finding all the clues left around the map then this is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game.  i loved valheim when it went in early access during covid.  Wish i had known about this at the time!\nfun crafting, decent combat, but honestly just so many systems to explore.  go get some pets, some thralls, have a party\n\nserver stability can be problematic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Survival game with two small circles, and one long sloppy oval, need I say more?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Survival game with tits, needn't say more too be honest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels kind of unfinished, but still a fun experience. Definitely worth the $8 when on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game launch from FUNCOM Launcher and verrryyyyy longgggg respon... i must wait 10-15menit to get start...\ngame is good, fun... but long respon to launch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and engaging lots to see and do. fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conan Exiles: A Savage, Rewarding, and Epic Survival Sandbox\n\nRating: Highly Recommended / A Must-Play for the Genre\n\nFuncom's Conan Exiles isn't just another entry in the crowded survival genre—it's a brutal, bloody, and beautiful spectacle that carves out its own niche. Set in the savage world of Robert E. Howard’s legendary barbarian, this game provides an unparalleled sense of scale, freedom, and true conquest. If you're looking for a survival experience that emphasizes epic building, rewarding exploration, and visceral combat, your journey in the Exiled Lands begins now.\n\nThe Good: What Sets it Apart\n\n1. The Exiled Lands: A World of Grand Scale and Detail\nThe map is simply huge, featuring stunningly diverse biomes that feel handcrafted and steeped in lore. From the scorching southern deserts and dense eastern jungles to the frozen north and the volcanic lava fields, every region presents a new survival challenge. The ability to climb almost any surface fundamentally changes exploration, making you feel like a true adventurer looking down on the world you aim to conquer. Finding ancient ruins, hidden dungeons, and cryptic lore notes is genuinely rewarding, creating a cohesive and deep fantasy world.\n\n2. Building is King: Unleash Your Inner Architect\nThe building system in Conan Exiles is arguably the best in the survival space. It’s intuitive, flexible, and allows for massive, architecturally complex structures. Whether you want to build a sprawling medieval fortress, a secluded cliffside base, or a humble riverside village, the variety of building pieces and aesthetics (especially with the DLC packs) is immense. Successfully defending your massive base during The Purge (an NPC army invasion) gives an incredible feeling of hard-earned permanence and accomplishment.\n\n3. Thralls, Religion, and Sorcery: Unique Systems for Domination\nThe Thrall system is a fantastic, thematic feature. Capturing NPCs, breaking their will on the Wheel of Pain, and then employing them as guards, crafters, or entertainers adds a layer of depth other games lack. Furthermore, the introduction of the Sorcery system has added an exciting new dimension to the endgame, allowing players to corrupt their bodies for dark magic, summon demons, and even ride winged monstrosities. And for true scale, few things top summoning a massive God Avatar to crush your enemies’ fortifications—it’s pure, over-the-top Conan fantasy.\n\n4. Visceral and Brutal Combat\nCombat is fast-paced, action-oriented, and unapologetically bloody. With a wide variety of weapon types, light and heavy attack combos, and the need for well-timed dodges and blocks, fights feel substantial and decisive. The M-rated gore visuals are a key part of the experience, delivering the brutality you expect from the Conan universe.\n\nThe Drawbacks (And Why They Don't Ruin the Fun)\n\nLike any massive open-world survival title, Conan Exiles isn't without its jank. New players should be prepared for a steep initial learning curve, as the Journey system, while helpful, doesn't immediately explain the deep crafting and thrall mechanics. Additionally, the game has had its share of bugs over the years, though Funcom has consistently released large updates to improve quality of life and polish. If you can push past the first few hours of struggle, you'll find the deep systems waiting to reward your persistence.\n\nFinal Verdict\n\nConan Exiles is a triumph of fantasy survival. It succeeds where many others fail by delivering not just a sandbox, but a rich, atmospheric world where you truly feel like you are earning your power from nothing. The unparalleled building freedom, the massive scope of the map, and the satisfying progression from a naked exile to a powerful warlord or sorcerer make this a highly recommended purchase. Grab your friends, choose your god, and carve out your own legend in the Exiled Lands.\n\n\nRecommended Mode: PvE-Conflict (for low-stakes PvP during limited hours) or dedicated private/modded servers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "iv played conan exiles in the past like back in 2015 way diffrent story. \r\ni still do like how it has keep some of the old school real conan from the before times up to now \r\nbut man these new changes are nice. but i do have some complants about the games user abilites \r\n\r\n- the corser do not line up with what your clicking \r\n- how the camra shacks around during battle \r\n- there no custome abilites for you to make the game way easyer or hearder solo or co op\r\n- thats it only three problems but still a fun game, # batter then ark survival \r\n\r\nwould i recomand playing this game by solo or with friends yes i would so reconmand it why \r\nits a nice chiller MMO game that still holds its core game ID. thank you dame devs for making such a fun game thats has survived the test of time. ill happy be playing conan for who nows how long. have a nice day people.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Conan Exiles is an open-world survival game developed by Funcom, set in the brutal universe of Conan the Barbarian.\n\nThe gameplay revolves around gathering resources, crafting tools and weapons, building settlements, and surviving in a hostile desert landscape. Players begin with nothing and must manage hunger, thirst, and shelter while defending themselves against creatures, NPC factions, and other players in online modes.\n\nCombat is real-time and melee-focused. Weapons include swords, spears, bows, and improvised tools. Blocking, dodging, and stamina management are essential, and progression unlocks stronger gear and crafting recipes. The system is simple but effective, especially in co-op or PvP play.\n\nThe world is large and diverse, featuring deserts, jungles, frozen mountains, and ancient ruins. Exploration rewards materials, lore fragments, and hidden dungeons. Environmental hazards and weather effects increase survival tension.\n\nBuilding is one of the game’s strongest features. Players can construct anything from small shelters to massive fortresses, using an intuitive placement system. Thralls—NPCs captured and enslaved—can be assigned as workers or guards, adding depth to settlement management.\n\nVisually, Conan Exiles uses the Unreal Engine to create detailed landscapes and character models. The aesthetic is gritty and violent, consistent with Robert E. Howard’s source material. Performance is stable on most systems, though large builds and online servers can cause occasional slowdowns.\n\nOverall, Conan Exiles is a robust survival sandbox that balances crafting, combat, and exploration within a harsh, mature setting. It rewards long-term investment and creativity but demands patience and resource management. Ideal for players who enjoy open-world survival with a darker, more visceral tone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This review, based on my personal playtime, provides a quick and structured overview of the game's key aspects without a lengthy read. The categories are designed to cover the essential aspects of the gameplay experience.\n\n<==[ Graphics ]==>\n   ☐ Exceptional\n   ☑ Solid\n   ☐ Average\n   ☐ Basic\n   ☐ Insufficient\n\n<==[ Audio ]==>\n   ☐ Exceptional\n   ☑ Solid\n   ☐ Average\n   ☐ Basic\n   ☐ Insufficient\n\n<==[ Gameplay ]==>\n   ☐ Innovative\n   ☑ Solid\n   ☐ Average\n   ☐ Clunky\n   ☐ Outdated\n\n<==[ Story ]==>\n   ☐ Captivating\n   ☐ Solid\n   ☐ Average\n   ☑ Weak\n   ☐ None\n\n<==[ Character Customization ]==>\n   ☐ Enormous\n   ☐ Extensive\n   ☑ Average\n   ☐ Limited\n   ☐ Bare-bones\n\n<==[ Wokeness ]==>\n   ☑ Non-Existent\n   ☐ Minimal\n   ☐ Subtle\n   ☐ Explicit\n   ☐ Agenda-Driven\n\n<==[ Performance ]==>\n   ☐ Smooth\n   ☐ Stable\n   ☑ Laggy\n   ☐ Frequent Crashes\n   ☐ Unplayable\n\n<==[ Bugs ]==>\n   ☐ No Bugs Noticed\n   ☐ Minimal\n   ☑ Sporadic\n   ☐ Numerous\n   ☐ Excessive\n\n<==[ Longevity ]==>\n   ☐ Endless\n   ☐ Long-Lasting\n   ☑ Moderate\n   ☐ Short-Lasting\n   ☐ Just a few hours\n\n<==[ Grind ]==>\n   ☐ Negligible\n   ☐ Minimal\n   ☑ Moderate\n   ☐ Extensive\n   ☐ Extreme\n\n<==[ Mod-Support ]==>\n   ☐ Enormous\n   ☑ Extensive\n   ☐ Average\n   ☐ Limited\n   ☐ None\n\n<==[ Balancing ]==>\n   ☐ Perfectly Balanced\n   ☐ Well-Balanced\n   ☑ Average Balanced\n   ☐ Poorly Balanced\n   ☐ Extremely Unbalanced\n\n<==[ Community ]==>\n   Server Dependent\n\n<==[ Monetization ]==>\n   ☐ P2P\n   ☐ F2P + MTX \n   ☑ P2P + MTX\n   ☐ P2P + Subscription\n   ☐ P2P + Subscription + MTX\n\n<==[ ★★★☆☆ ]==>\n\nAn average but good game that neither convinces nor disappoints. 3★",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its pretty fun. Finally something that I can enjoy like Ark with more simplicity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can \"tame\" similar to ark......but ethically and morally different.........\n\n\nhas swords tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been looking for a new (different game) for awhile; saw this one for sale and always heard hype about it. Although never really tried my hand at survival type games; and although I will attest to other reviews where adjusting to the playstyle definitely took some acclimating to.\n\nI am blown away, once I got the hang of things and figured out how to manage everything; game runs like a dream, its beautiful, highly mod-able, workshop has countless active updated mods to supplement and enhance the baseline experience. It has a unique style like a Sims/Eldenring/Skyrim amalgam; have yet to find a game that allowed this level of freedom with such a mysterious world to explore and uncover, 10/10 recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brutal survival with a ton of depth. Building your own fortress in a savage world is super satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EXCELLENT GAME! I HAD IT ON PLAYSTATION AND AFTER THE UPGRADE TO PC I BOUGHT IT AGAIN. IM TRYING TO FIND CLANS FOR PVP BUT ITS STILL FUN TO PLAY SOLO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. played a lot of different saves. could use an update and a new map.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game great story line enjoy with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Janky but fun survival crafting in an awesome setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun, open and pretty free roams",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Sure the armors were cool and characters look great, but damn the crafting system is a damn mess. You gotta mod it to actually know how things are done and which recipe is what. There's no goal in this game, a thing to aim for. Why am I getting stronger, why do I grind my levels and my attribute and make my gear better? Just to defeat a boss that respawns the next day. No story, no escalating factor to make you continue on.\r\n\r\nI gotta give it to the thrall system though, you can collect the tier 4 thralls like pals and keep them in your base and just hang around, that's it really. I thought I could lead warbands, but I can only take in 1-2 followers in the end. What is this, Captain Acheran levels of logistics? (Warhammer reference)\r\n\r\nYou'd think a game where they allow full nudity and showing off genitals and big boobs would keep people playing, but it isn't, we also want content too. A reader would probably say, \"this game shines best on PVP servers!\" and my response to that is nay, that is just a distraction and not fun in the end, because it will just end with the player killers with the same question after everyone leaves \"what now?\".\r\n\r\nThe true enemy in this game aren't the monsters and npcs, or the other players grifting you, nay, the true enemy is the damn servers, the bugs, and especially the damn bugs. You know how many times a tier 4 thrall I was trying to capture went through the damn terrain to be never seen again? Or how many times I got stuck inside my horse or thrall because they walked too close and I have no choice but to kill my character and have to do a walk of shame back to their location only to find out my gear magically disappeared and just be devastated on all the stuff I lost? Don't even get me started on the damn combat, holy hell it's annoying getting surrounded by enemies and getting stunlocked and unable to leave or fight back. Of course the lag and server issues contribute to this problem, but man this game is frustrating.\r\n\r\nOh and before I forgot, the portal system where you get corruption sucks. Its just a mechanic so you would spend more time standing around watching your dancers or whatever to bring down your corruption. I find that a waste of time, I'd rather just take a debuff on smaller genitals or something. haha",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It is so unfortunate that this game is such a missed opportunity. So many great ideas are just tossed in as an afterthought and none of them were ever fully realized. Not only that but each update breaks the game more than it aids it. The creative team has changed multiple times over the years and none of them were ever able to fix the mess of their predecessors. \n  Despite the poor state of the game, playing it has brought me the greatest highs I have ever experienced, all thanks to the people I met ingame. The saving grace of Conan Exiles is that it is a sandbox and it is up to the players and their creative imagination to have fun while playing. \n  Sadly  the community of players has taken constant attacks from none other than the company's community managers who instead of helping the community thrive and flourish do exactly the opposite. The FunCom Community Management team's only goal is to protect the reputation of their broken game at all cost.  Community management should be renamed to Crowd Control. In other live service games, oh yes, this game is a live service game, the community manager's purpose is to support the community and ensure player satisfaction. Not here. The sole purpose of Funcom community management division is to bully players who are whistleblowers and to silence them at all means necessary. Personal player tickets addressing game breaking bugs are deleted which forces the players to resort to public discussions asking for help. Hundreds of hours of gameplay progress gone with a release of a patch is the every day norm in Conan Exiles. Player bases full of max level gear and companions wiped due to game developer incompetence. If you dare to ask what happened you will be faced with a ban. \n  Selfishly, most of us kept coming back despite the bans and the bully management because we naively believed that this is a one time thing, or probably a mistake. It was not. This is Funcom's way. This company has always been lazy and greedy. Their internal politics is to quickly create half baked games and heavily invest their resources into false promotion and advertising, pay influencers to misrepresent the state of the game , and of course higher a low paid team of henchmen a.k.a Community Management team a.k.a Crowd Control and have them bully any player who blows the whistle on how poor their top dollar product really is. This is Funcom's business model for all their games, just look at their brand new product Dune Awakening...but I digress.\nIf you respect your time and money please stay away and thank you for reading my honest experience with this game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Conan-as a game-is a great game but the support Funcom provides is horrible and Funcom is the reason I cannot recommend this game. At present, virtually none of the American servers are working on a steady basis and haven't been for weeks. Funcom has said nothing about this and I can assure you players are furious about it. This game has had update after update which generates bugs that the company has been very slow to even address and there are the lag issues this game is notorious for. This game took good care of Funcom, it's a pity Funcom doesn't take better care of it. The reason I never bought Dune-and I never will-is because of Funcom.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is straight-up asscheeks. The UI sucks, key bindings are horrible (Pressing Q makes you lose things while accessing crates & benches—seriously?) and the HUD looks ugly as hell. The follower system is a joke too — you can get stuck under your own horse and have to kill yourself just to get out. Thralls always blocking you, item descriptions are vague, and the quests? Absolute garbage.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "First, in concept its a great game. Sadly, its ruined by its childlike management. Its over 7 yrs old now, and has more bugs, STILL, than an anthill. Writing this after STILL YET experiencing server crashes for days in a row. Conan is not a game where you need to be logged off unexpectedly, unless you LIKE having to replace all your hard won gear over and over. FFS.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Exceedingly difficult to play alone, there are encounters in this game which require thoughtful strategy and murderous intent. If your tribe isn't prepared to deal with the hazardous situations that the combat in this game has to offer, you can end up food for the dead.\nI only bought this game to play it with some people who were intent on rushing through the content together. I am a timid sort and only really enjoy playing games casually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, the company running it however is the worst company ever , do not buy their dlc and do not buy their bazaar items, the official servers are full of hackers and cheaters often with admin panel level cheats that shift delete bases or even your playable characters. DO NOT BUY THE GAME DO NOT GIVE FUNCOM ANY MONEY.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "terrible choppy gameplay, npc;s did not move and hit detection was null, it was a multiplayer server, only one now as of Nov 11 2025 that has 60 out of 70 players, all the rest are empty, sorry but the game has over many problems i could not play it. the game kept moving me back several yards after traversing as if major lag. i have a 5090 and a 9050x3D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely riddled with game breaking glitches, couldn't even get armor to stay equipped. For reference, both ARKs (SE and SA) are much more stable and polished games. Not worth the $8 I paid, which I'll be getting back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is good and I enjoy playing, but the support is very bad: I started playing in the only server in my region that had a decent ping (90) and after having gathered some resources the server disappeared\r\nThen I started again on a new server with more ping (110), not ideal but it was still possible to play.\r\nAgain, gathered some resources and leveled up (a week playing), never seen other players nor even other players buildings though, but still it was interesting. But then suddenly I was banned.\r\nI tried to contact the developers as suggested by google but the support page in the game's site was 404.\r\nThen after reading more I found a forum, I tried to ask why I was banned and I was sent to a form where I  had to fill in many things like my email, my steam id, my name, my everything but I got no answer,. just an automated email asking again for the same data.\r\nThen I tried a third server with even more lag, again, gathered some resources and leveled up to start the fun part (3 or 4 days of playing), and again, the server is down every other day and I can't play anymore.\r\nLooks like it is quite abandoned also, I have only seen another player in 2 weeks and the server list always shows like 3 or 4 people spread among the first 20 servers, many servers with 0 players.\r\nWhen I can play, it is fun, and the game is good, really, but it is worthless when no server is available and restarting from scratch every 3 or 4 days becomes boring.\r\nI would recommend to check service availability in your region before purchasing if you wish to give it a try.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game wont launch, fatal error message. Can get it to open with internet disabled soon as i turn iton game crashes with fatal error. Funcom app seams to be the issue. No available workarounds bought game 5 years ago can not refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, and a great game if you like explore build and craft, but at full price which is what I am going to review it as, it's way too niche' to recommend. On sale, especially for something like ten bucks, it's an incredible content trough. \r\n\r\nBut considering its age, it's just way too jank and buggy. Some jank is endearing, some jank is game breaking, and the fact that the game \"Cooks in\" some admin features like being able to teleport your Thralls to you, shows they know it's broken and took the easy way out.\r\n\r\nStill, if you're one of the chosen few autistic enough to enjoy exploring, crafting and building for its own sake, this will definitely get the dopamine pumps goin. Aside from character graphics and boss fights, there is one particular unity-based survival craft game that does everything else in this game only better. I won't name it out of courtesy and respect I have for what this game does well though.\r\n\r\n+Exploration\r\n+Combat (For essentially a P2P MMO)\r\n+Style\r\n\r\n-Bugs\r\n-The community (You all are into some messed up mods)\r\n-The Developers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to play fine. Now the thralls fall through the mess and are lost forever, shrines and other crafting stations will just refuse to craft. Why play when key components are completely broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can not recommend this game.\n\nAfter 5+ years of ownership and a sparse 500+ hours, the game has not gotten any better and only slightly more stable. (Still Fatal Error crashes randomly with a full clean, vanilla install.)\n\nThe main reason as to why, is the game is designed very poorly on a fundamental working level.  Conan Exiles requires some degree of modding to have ANY amount of replay/play value.  The single greatest detriment to replay & play value is the single solo/co-op save. Due wholly to their attempt to get players to buy in to their Battle Pass, which would be fine if this game had not been plagued with general performance, stability and play-ability issues.  This game is not worth paying for.\n\nIf you do not plan to spend 10+ minute load time on a dedicated server you have applied and joined to or potentially plan to pay for and run yourself with massive overhaul mods, don't bother.  Regional locks and restrictions have only gotten worse with the global social recession stemmed from child neglect. (Seriously parents, stop with the neglect of your children and blaming society for your own mistakes, failures and inadequacies as a parent and human.)  Further on this topic is a can of worms I rather not open further.\n\nIts not worth it to Funcom to fix or address any of their fundamental issues, only put out more poorly implemented updates.  This game is not F2P, yet it plays and operates as such.  Their official public servers have the same issues any other survival builder has always had and contineus to has.\n\nLets look at why you as a player REALLY wants to give the game a try.  You saw a video or clip or w/e of some streamer playing it and having a perceived good time with others. (undoubtedly with a fully overhauled mod set on a private server that is either not still up, closed or exclusively monetized to join)  Just not and if you do, only on the steepest of seasonal sales.  It will make your buyers remorse less, when you blow away your return policy limitations just trying to get the mod-set configuration and joining of servers down.\n\nFull Disclosure:\nMy first 10 hours were spent just trying to play the game, for any length of time without a Fatal Error, to make any progress.\nMy next 400 Hours were spent on a private server that was HEAVILY modded and took over 10 minutes to load and connect.  It was enjoyable outside persistent performance issues.  The last straw was returning player drama from the 'founding' group, i wasn't interested and just left.\nMy next 100 or so hours were spent checking back after major updates, trying to see what mods I could manage to play with solo.\nAny time I spend in the game now is with specific mods to scratch the horny itch of building and having me/my character DP'd by a couple of thralls with plenty of other action going on around. A Conan 'Bacchanalia' of sorts with Admin on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Completely toxic community. Barely playable game online or offline.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even recommend buying this product at all. In fact I'm edging to implore anyone reading this to not buy this game if you don't wanna feel like how I feel.\n\nThis game becomes a crappy Hindenburg after a short while. At the beginning and mid gameplay, it was fun, but all the end game is just straight BS.\n\nBugs, glitches, and all the crap that should've been fixed over the years since the game's been launched, and it all just has left me hating on the devs complete incompetence, and lack of ability to even listen to their community.\n\nLike this is as bad as Ubisoft listening to their player base.\n\nThis game is cool to a point. Everything after that point is just irritating disappointment since the devs haven't done sh*t to their POS of a game.\n\nFuncom. If you read this. Fix your god awful game. Otherwise this review stays the same.\nListen to your community, and fix your game. Cuz updating the game engine to UE4 ain't gonna fix anything if you don't fix the bugs, glitches, and other inconsistencies that plagues this game.\n\nPS: The guy with the magic wand on the cover art is extremely deceiving since the most you can do with magic is make a horrendously lame ice bridge to get thrown off of cuz of how glitchy it can be to some players, and to use it for pure utility. There's no fireballs. There's no lightning. Just sorta beneficial buffs to find ores.\n\nInsanely disappointing cuz I was looking forward to being a magic user.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's fun, and a great game if you like explore build and craft, but at full price which is what I am going to review it as, it's way too niche' to recommend. On sale, especially for something like ten bucks, it's an incredible content trough. \r\n\r\nBut considering its age, it's just way too jank and buggy. Some jank is endearing, some jank is game breaking, and the fact that the game \"Cooks in\" some admin features like being able to teleport your Thralls to you, shows they know it's broken and took the easy way out.\r\n\r\nStill, if you're one of the chosen few autistic enough to enjoy exploring, crafting and building for its own sake, this will definitely get the dopamine pumps goin. Aside from character graphics and boss fights, there is one particular unity-based survival craft game that does everything else in this game only better. I won't name it out of courtesy and respect I have for what this game does well though.\r\n\r\n+Exploration\r\n+Combat (For essentially a P2P MMO)\r\n+Style\r\n\r\n-Bugs\r\n-The community (You all are into some messed up mods)\r\n-The Developers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dev staff don't give a shit about the players or the product. This used to be a good game. Now they only care about the $$ this is a money milking machine for 10cent games. They probably steal your financial information and disseminate it to the CCP as well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much jank/bugs to be fully enjoyable. \nYou need multiple wiki pages open to know what to do/what to look for.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The american servers are experiencing outages daily, certain servers are down for multiple days at a time, trying to get in contact with anyone at funcom is worse than with Blizzard. Do not buy this game right now, I have poured so many hours into this, its one of my favourite survival games on the market. But in its current state it is a buggy laggy mess",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "abandonware game, not worth the eight bucks it was on sale for.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "more bugs than under a junkies skin its actually insane for such an old game how rubbish it is everytime u start to get ahead the game cuts u down with bugs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fix coop for the love of god tether sucks and I get sent through three loading screens every time I die.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "too many problems with luncher and battleyes in asia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got this for free, buggy mess. \n\nFix your f&^%en game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buns straight buns save ur money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros: Sandbox map done correctly, impressive places to explore, satisfying building mechanics, freedom of character creation and customization, roleplay potential, great modding community.\r\n\r\nCons: Physics more broken than a Bethesda title, fighting mechanics are frustratingly awful.\r\n\r\nI can't decide if I like the game or not, the only 2 cons overshadow the pros this game has. Your character will be stunlocked with every bit of damage it takes, which isn't that bad in a 1v1 but the game often throws hordes at you. If you are facing more than 3 enemies at once there's no skill involved, you are facing with a win and lose condition. If the enemy strikes you once, even if you take just a tiny bit of damage, the other enemies will attack right after, getting you stunned again. You will wait hopelessly as you watch your health drain with no way out of the situation. If you aren't the one to strike first you DIE. \r\nYou can forget about dodging, both enemies and companions will block any way you have of getting out of a sticky situation. At worst you will get stuck in the physics, defenseless, with the enemy stabbing at you. You will die to the buggy environtment more often than not.\r\nThe fighting mechanics as they are heavily incentivises using a one heanded melee with a shield, so you can forget about freedom of customization or roleplaying if you wanna get somewhere.\r\nBecause of this, exploration is more frustrating than fun. There are no stealth mechanics, nor AOE options that won't hurt you as well, meaning your only choices are between melee fights or fleeing .\r\n\r\nTLDR: as much as I like it, I honestly can't recommend it. If you want the experience this game has to offer I'd suggest Palworld, same pros without the cons, +guns, +better follower AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mouse to pointer is off in game control panel.  I can hardly use the setup screen.  The mouse works fine in the everywhere else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it baffles me to see that you add shit but dont fix bugs. \n\nif the december update fixes the outstanding bugs, i will recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "funcom sucks, the monetization sucks, ai sucks, the changes suck, gamebreaking bugs, coop tethering... sad... I love the conan universe (read tons of the books, comics etc) but cant get behind it. gameplay is jank as all hell. OVERPRICED as fuck, and then look at the dlc? yeah fucking right. suck my flacid pee pee.\n\nsandbox survivals are my favorite. this isnt it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One day battle eye just decided to stop working and took the game with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game, definitely. The only thing I don't like about this game, is the game developer themself, Funcom. So, while I like this game itself, it's Funcom I give the negative review about due to Funcom's actions to players just trying to play and have fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gotta love a game where the game itself is only 40$ but all the dlc stuff is almost 120$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Couldn't honestly recommend when there's so many better games in this genre, especially with such a high price. The only problem really is that it's a bug ridden mess. You 100% will encounter some kind of game breaking shenanigans.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great fun game with so much potential but just ruined by all the bugs. Constant crashing my whole computer, bugging out in bosses and resetting, followers just glitching out, never to be seen again, ect ect ect. \r\nAfter being out this long and for the high price i could not recommend a game with this many game ruining bugs. Such a shame as has huge potential.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "https://youtu.be/4BwTbPl2knI\n\nDefinitely a complete feeling 'one of these' survival crafting game that can be rewarding after investing large amounts of playtime, but without that are generally thin otherwise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Impossible to play Co-Op.  Friend can never join the server.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A trash game just . Your dont like your mony go buying ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game helped cure me of my crippling arachnophobia.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes all the time and support is no help at all.  DO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i was on my way to build a base and then fucking cthulhu appeared and killed me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buggy and never any fixes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "IT DID NOT LOAD IT ON:Y SHOWED ME THE WEBSITE \"funtime\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MY TRASHY EX PLAYS THIS SO NO THANKS!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has been abanadon.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buyers beware!!!! this game is a broken nightmare of its former self ,not worth your time the developer keeps adding content adding content again and again without considering what it will do to the existing game. lag spikes some lasting up to 30 seconds, and detail will go out of focus . when we complain, they ignore no respect for the fan base!!!!!\nit all falls on deaf ears.",
      "voted_up": false,
      "votes_helpful": 309
    },
    {
      "review": "While I love this game, I'm unable to recommend it at this time due to how much of a buggy mess it has become. Just to list few notable issues that I encountered during my most recent playthrough: thralls falling through the ground and needing to be rescued from the void, the game crashing when trying to remove food from an animal pen, my character respawning in an entirely different dungeon from the one I died in, and finishing move animations for claw-type weapons not working while in the Midnight Grove dungeon. And believe me when I say that this is just the tip of the iceberg when it comes to all of the bugs I've encountered.\n\nAlso for a month-long period they replaced the easiest dungeon in the game with a special late-game variant. During this time, there was no way to play the normal version. This normally wouldn't be that big of an issue for me, if it wasn't for the first step of the \"Dungeon Delver\" journey (which takes you through most of the game's dungeons) requiring you to complete this dungeon before you can get credit for completing any of the others.\n\nFor these reasons, as much as I love this game, I simply can't recommend it in its current state. I sincerely hope that Funcom continues to work on and improve it in order to get it back to a better state.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Its not bad really but its more of a quest type game collecting and crafting. But that side is so slow.\r\n\r\nIts also 100Gb of hard drive which seems a lot for how basic the game graphics and game play is. I enjoyed playing it but it takes so much space and i need that for other games.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "It is so unfortunate that this game is such a missed opportunity. So many great ideas are just tossed in as an afterthought and none of them were ever fully realized. Not only that but each update breaks the game more than it aids it. The creative team has changed multiple times over the years and none of them were ever able to fix the mess of their predecessors. \n  Despite the poor state of the game, playing it has brought me the greatest highs I have ever experienced, all thanks to the people I met ingame. The saving grace of Conan Exiles is that it is a sandbox and it is up to the players and their creative imagination to have fun while playing. \n  Sadly  the community of players has taken constant attacks from none other than the company's community managers who instead of helping the community thrive and flourish do exactly the opposite. The FunCom Community Management team's only goal is to protect the reputation of their broken game at all cost.  Community management should be renamed to Crowd Control. In other live service games, oh yes, this game is a live service game, the community manager's purpose is to support the community and ensure player satisfaction. Not here. The sole purpose of Funcom community management division is to bully players who are whistleblowers and to silence them at all means necessary. Personal player tickets addressing game breaking bugs are deleted which forces the players to resort to public discussions asking for help. Hundreds of hours of gameplay progress gone with a release of a patch is the every day norm in Conan Exiles. Player bases full of max level gear and companions wiped due to game developer incompetence. If you dare to ask what happened you will be faced with a ban. \n  Selfishly, most of us kept coming back despite the bans and the bully management because we naively believed that this is a one time thing, or probably a mistake. It was not. This is Funcom's way. This company has always been lazy and greedy. Their internal politics is to quickly create half baked games and heavily invest their resources into false promotion and advertising, pay influencers to misrepresent the state of the game , and of course higher a low paid team of henchmen a.k.a Community Management team a.k.a Crowd Control and have them bully any player who blows the whistle on how poor their top dollar product really is. This is Funcom's business model for all their games, just look at their brand new product Dune Awakening...but I digress.\nIf you respect your time and money please stay away and thank you for reading my honest experience with this game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This would be the best game ever created if it were not for the uncontrolled hackers and the constant server crashes which keep the servers down for most of the day. It is a terrible shame because this game is pretty much unplayable in the state that it is currently in. I wish Funcom could pull it together and save this game, it really is a great game.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Fun game to play with others but drags on when playing solo, the game been out for many years now and still has many bugs small and big which will end up wasting your time deleting your items  and giving you a headache, there is players on official servers which can and will cheat and seem to have admin powers and will use them to delete walls of your base check what you have and then replace it and raid it when you are offline taking all your stuff and you can see they are doing this as they will only raid parts of your base which has good stuff and not the rest of the base even what is on your body when your corpse cant be looted by others for hrs but is anyway by them with a min of them killing you, so ya fun game to play as long you don't get many bugs or bad actors when playing but its unlikely.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is straight-up asscheeks. The UI sucks, key bindings are horrible (Pressing Q makes you lose things while accessing crates & benches—seriously?) and the HUD looks ugly as hell. The follower system is a joke too — you can get stuck under your own horse and have to kill yourself just to get out. Thralls always blocking you, item descriptions are vague, and the quests? Absolute garbage.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Sure the armors were cool and characters look great, but damn the crafting system is a damn mess. You gotta mod it to actually know how things are done and which recipe is what. There's no goal in this game, a thing to aim for. Why am I getting stronger, why do I grind my levels and my attribute and make my gear better? Just to defeat a boss that respawns the next day. No story, no escalating factor to make you continue on.\r\n\r\nI gotta give it to the thrall system though, you can collect the tier 4 thralls like pals and keep them in your base and just hang around, that's it really. I thought I could lead warbands, but I can only take in 1-2 followers in the end. What is this, Captain Acheran levels of logistics? (Warhammer reference)\r\n\r\nYou'd think a game where they allow full nudity and showing off genitals and big boobs would keep people playing, but it isn't, we also want content too. A reader would probably say, \"this game shines best on PVP servers!\" and my response to that is nay, that is just a distraction and not fun in the end, because it will just end with the player killers with the same question after everyone leaves \"what now?\".\r\n\r\nThe true enemy in this game aren't the monsters and npcs, or the other players grifting you, nay, the true enemy is the damn servers, the bugs, and especially the damn bugs. You know how many times a tier 4 thrall I was trying to capture went through the damn terrain to be never seen again? Or how many times I got stuck inside my horse or thrall because they walked too close and I have no choice but to kill my character and have to do a walk of shame back to their location only to find out my gear magically disappeared and just be devastated on all the stuff I lost? Don't even get me started on the damn combat, holy hell it's annoying getting surrounded by enemies and getting stunlocked and unable to leave or fight back. Of course the lag and server issues contribute to this problem, but man this game is frustrating.\r\n\r\nOh and before I forgot, the portal system where you get corruption sucks. Its just a mechanic so you would spend more time standing around watching your dancers or whatever to bring down your corruption. I find that a waste of time, I'd rather just take a debuff on smaller genitals or something. haha",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Many players online report that, on official servers, their base gets deleted after a (few) week(s) of not playing.\nThere's not that many populated non-official servers if you're outside NA or EU.\n\nJudging by the positive reviews, i guess its the kind of game that could be great on the right server.\nEven so, the early combat is lacking. The pike/spear doesn't even strike at the crosshair, but the game has a battlepass.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I wanted so desperately to enjoy this game but in the end I could never maintain the interest.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Game actually good and has so much potential but.. you are always 1 bug away to lose months work. I don't know if the devs are aware that \"months of work\" equals someone's time of precious life. You grind materials, thralls, levels, you spent your evenings to build your bases, craft weapons and armors then while you were happily roaming the world game suddenly crashes. You would think that it's ok, I was in a safe place, you think? \n\nYou immediately came back to the game, only to see your character butt naked, you are in somewhere you were not supposed to be, your inventory is empty. Guess what, you would think that as soon as the game crashed and you went offline then your character should cease to run right, hahaha you wish, your character kept running ridiculously until dying in some arbitrary place. Congratulations, your precious time, all of your work, all that fun, flushed through the toilet, because the devs hate you! Why did you buy their game and caused them to get paid, now they will have to fix bugs and they hate it too because they have no idea why the bugs are exist.\n\nYou had it coming with buying and playing this game, it is all your fault. When you read these lines you might think that, hmm this is an old comment, surely the game is almost bug free now. Welcome to the club :)\nAnd to Funcom; I have a name suggestion if there will be another expansion, Conan Exiles: Age of F.. you gamers.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Lost in the last generation. I want to rate this neutral but if you ask again, I'll say no.\n\nReview for single-player, solo, modified to lessen grind server.\n\nPositves:\n\n- large, huge 100GB world map to explore\n- solo, singleplayer mode, tuned settings and play however you want\n- mature, adult themed. There's nudity, religion/cults and the brutal, harshness is nicely portrayed. \n- really robust build system and the crafting is expansive and deep\n- movement and combat are quick and fast but look below\n- in-game tutorial/journey is pretty well fleshed out\n- quite cheap \n\nNegatives:\n\n- buggy and framedrops on modern hardware\n- atrocious UI and also DLC items show up in the crafting/UI so you get confused which one is the base/normal, irritating and simply a bad, dark business practice\n- FOV change while sprinting and not smooth camera movements, so you might get motion sick or get headaches\n- horrible, horrible AI and enemies, you climb up a rock and just keep shooting arrows, they will come near you and de-aggro, just repeat\n- just boring and bland, world is big af but kinda haphazard and repetitive\n- combat is a mixbag, some animations and moves are cool, sometimes it works, sometimes it feels bad\n- QoL features missing\n- in-game cosmetic store \"bazaar\"\n\nI think the game sometimes shines to roleplay your He-Man & Conan fantasies but I don't really think it offers anything exciting or new or fun that other games in the genre provide. Ark Survival/Ascended or Palworld are more fluid, fun and are exciting and have absolutely crazy ideas in them that make them unique and special.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "First, in concept its a great game. Sadly, its ruined by its childlike management. Its over 7 yrs old now, and has more bugs, STILL, than an anthill. Writing this after STILL YET experiencing server crashes for days in a row. Conan is not a game where you need to be logged off unexpectedly, unless you LIKE having to replace all your hard won gear over and over. FFS.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Don't recommend. Interface is terribly confusing. I tried to play this game twice. Tried to unlock and build workbenches but it is a maze to even find them. The building is not intuitive and does not snap well. Vanilla game components are hidden among DLC components so it is hard to even find the basic building pieces or workbenches.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If you want to loose your items 24/7 in this game, than go.\n Me and my friends play in this friendly PVE server and when you log in back, you miss all your items. This happens also when the game crash or the servers go down for some reason. Note that we play in official server. When you push enemy at the walls, the mob clips and get stuck in the wall. Hal of the time it resets at full health. Really often mobs drop under the map when you kill them and you can't loot and ETC. Farm materials for 6 hours so I can build our castle, logout because it was 03:30 night time, login next day to find myself nude at the usual safe place where we logout. Unplayable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the game is wicked fun once you tweak it to your & your friends' play-style & difficulty preference, but it crashes at the drop of a hat and causes its own errors- vanilla or not. i love it; my wife and i are having more fun with this game than with any other of our multitude of survival/crafting games but the bugginess is unbearable. [this is entirely ignoring the annoying pushy dlc screens & absurdly gargantuan download size because someone doesn't know how to downsize for base-game players. why do i have to download every resolution size AND the DLC packs when i cant use them??]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It was a really shitty feeling game all around, you gotta do a choreographed dance to swing most weapons, and enemy pathfinding is terrible. I had frequent graphical errors where sprites would take a while to load, I had an untextured default posing creature floating in the air, and the game dosent look spectacular. Its not horrible, just feels unplaytested and there are better options for this Genre. 3/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cheaters are in single one official server ... glitches etc... waste of time. i play this game 1,6k hours and after that long of time i came to the end of this crap :D devs make dlc and prin money but cant fix simple thing withuo broke the game. Cheaters can go thru walls loot locked boxes etc...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[PVP Review only] Hackers rein free on official pvp servers. They can do admin stuff which is totally game breaking. Me and my Conan friends where on 5 official pvp servers, all of them got vacuumed (all loot gone). Funcom is incompetent with hackers in their game and there seems no fix now or future for Conan Exiles, true shame. So I can not recommend this game to other pvp players!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is unplayable, \"D3D device is lost\" error pop up every time i click launch. I've tried to follow instructions from other people but to no avails.\nI later discovered that there are also others that faced this same problem from 3-4 years ago. Some managed to fix the issue but many others did not. Download this game at your own risk",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is not bad per se, it starts out nice and has a good lore. What bugs me the most is the \"incentive\" to buy DLC. Even on a sale all of the DLC costs 85 Euros and I don't think it is worth it. \nCrafting gets a huge dent because of this, seeing how \"nice\" those things could be. \n\nThe gameplay itself is nice eventhough a bit dated as well. \nOverall, 4/10.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible choppy gameplay, npc;s did not move and hit detection was null, it was a multiplayer server, only one now as of Nov 11 2025 that has 60 out of 70 players, all the rest are empty, sorry but the game has over many problems i could not play it. the game kept moving me back several yards after traversing as if major lag. i have a 5090 and a 9050x3D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely riddled with game breaking glitches, couldn't even get armor to stay equipped. For reference, both ARKs (SE and SA) are much more stable and polished games. Not worth the $8 I paid, which I'll be getting back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Funcom quietly ended all support for this game as soon as their new project \"Dune\" launched. \"Official\" servers are full of cheaters, bug exploiters, toxicity and lag while Funcom doesn't answer tickets, reports, e-mails or even forum posts at all. Don't buy this game or anything developed/published by them.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is good and I enjoy playing, but the support is very bad: I started playing in the only server in my region that had a decent ping (90) and after having gathered some resources the server disappeared\r\nThen I started again on a new server with more ping (110), not ideal but it was still possible to play.\r\nAgain, gathered some resources and leveled up (a week playing), never seen other players nor even other players buildings though, but still it was interesting. But then suddenly I was banned.\r\nI tried to contact the developers as suggested by google but the support page in the game's site was 404.\r\nThen after reading more I found a forum, I tried to ask why I was banned and I was sent to a form where I  had to fill in many things like my email, my steam id, my name, my everything but I got no answer,. just an automated email asking again for the same data.\r\nThen I tried a third server with even more lag, again, gathered some resources and leveled up to start the fun part (3 or 4 days of playing), and again, the server is down every other day and I can't play anymore.\r\nLooks like it is quite abandoned also, I have only seen another player in 2 weeks and the server list always shows like 3 or 4 people spread among the first 20 servers, many servers with 0 players.\r\nWhen I can play, it is fun, and the game is good, really, but it is worthless when no server is available and restarting from scratch every 3 or 4 days becomes boring.\r\nI would recommend to check service availability in your region before purchasing if you wish to give it a try.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great game, the company running it however is the worst company ever , do not buy their dlc and do not buy their bazaar items, the official servers are full of hackers and cheaters often with admin panel level cheats that shift delete bases or even your playable characters. DO NOT BUY THE GAME DO NOT GIVE FUNCOM ANY MONEY.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pros: Sandbox map done correctly, impressive places to explore, satisfying building mechanics, freedom of character creation and customization, roleplay potential, great modding community.\r\n\r\nCons: Physics more broken than a Bethesda title, fighting mechanics are frustratingly awful.\r\n\r\nI can't decide if I like the game or not, the only 2 cons overshadow the pros this game has. Your character will be stunlocked with every bit of damage it takes, which isn't that bad in a 1v1 but the game often throws hordes at you. If you are facing more than 3 enemies at once there's no skill involved, you are facing with a win and lose condition. If the enemy strikes you once, even if you take just a tiny bit of damage, the other enemies will attack right after, getting you stunned again. You will wait hopelessly as you watch your health drain with no way out of the situation. If you aren't the one to strike first you DIE. \r\nYou can forget about dodging, both enemies and companions will block any way you have of getting out of a sticky situation. At worst you will get stuck in the physics, defenseless, with the enemy stabbing at you. You will die to the buggy environtment more often than not.\r\nThe fighting mechanics as they are heavily incentivises using a one heanded melee with a shield, so you can forget about freedom of customization or roleplaying if you wanna get somewhere.\r\nBecause of this, exploration is more frustrating than fun. There are no stealth mechanics, nor AOE options that won't hurt you as well, meaning your only choices are between melee fights or fleeing .\r\n\r\nTLDR: as much as I like it, I honestly can't recommend it. If you want the experience this game has to offer I'd suggest Palworld, same pros without the cons, +guns, +better follower AI.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can not recommend this game.\n\nAfter 5+ years of ownership and a sparse 500+ hours, the game has not gotten any better and only slightly more stable. (Still Fatal Error crashes randomly with a full clean, vanilla install.)\n\nThe main reason as to why, is the game is designed very poorly on a fundamental working level.  Conan Exiles requires some degree of modding to have ANY amount of replay/play value.  The single greatest detriment to replay & play value is the single solo/co-op save. Due wholly to their attempt to get players to buy in to their Battle Pass, which would be fine if this game had not been plagued with general performance, stability and play-ability issues.  This game is not worth paying for.\n\nIf you do not plan to spend 10+ minute load time on a dedicated server you have applied and joined to or potentially plan to pay for and run yourself with massive overhaul mods, don't bother.  Regional locks and restrictions have only gotten worse with the global social recession stemmed from child neglect. (Seriously parents, stop with the neglect of your children and blaming society for your own mistakes, failures and inadequacies as a parent and human.)  Further on this topic is a can of worms I rather not open further.\n\nIts not worth it to Funcom to fix or address any of their fundamental issues, only put out more poorly implemented updates.  This game is not F2P, yet it plays and operates as such.  Their official public servers have the same issues any other survival builder has always had and contineus to has.\n\nLets look at why you as a player REALLY wants to give the game a try.  You saw a video or clip or w/e of some streamer playing it and having a perceived good time with others. (undoubtedly with a fully overhauled mod set on a private server that is either not still up, closed or exclusively monetized to join)  Just not and if you do, only on the steepest of seasonal sales.  It will make your buyers remorse less, when you blow away your return policy limitations just trying to get the mod-set configuration and joining of servers down.\n\nFull Disclosure:\nMy first 10 hours were spent just trying to play the game, for any length of time without a Fatal Error, to make any progress.\nMy next 400 Hours were spent on a private server that was HEAVILY modded and took over 10 minutes to load and connect.  It was enjoyable outside persistent performance issues.  The last straw was returning player drama from the 'founding' group, i wasn't interested and just left.\nMy next 100 or so hours were spent checking back after major updates, trying to see what mods I could manage to play with solo.\nAny time I spend in the game now is with specific mods to scratch the horny itch of building and having me/my character DP'd by a couple of thralls with plenty of other action going on around. A Conan 'Bacchanalia' of sorts with Admin on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too much jank/bugs to be fully enjoyable. \nYou need multiple wiki pages open to know what to do/what to look for.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The american servers are experiencing outages daily, certain servers are down for multiple days at a time, trying to get in contact with anyone at funcom is worse than with Blizzard. Do not buy this game right now, I have poured so many hours into this, its one of my favourite survival games on the market. But in its current state it is a buggy laggy mess",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "abandonware game, not worth the eight bucks it was on sale for.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "more bugs than under a junkies skin its actually insane for such an old game how rubbish it is everytime u start to get ahead the game cuts u down with bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix coop for the love of god tether sucks and I get sent through three loading screens every time I die.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shit game.\r\n\r\n\r\n \r\nYou explore\r\nHyenas kill you\r\nYou go to get your shit back\r\nThey kill you again\r\nYou get to your body and cant do the moronic key binds quick enough and so you die again\r\nAnd again\r\nAnd again\r\nFucking 10/10 :D",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Multiple people had told me this game was fun. That was like okay fine I'll give it a go. I played it for roughly 1 hour of it. I did not like the start of it. Basically you start off on a cross and you're literally told what your religion is. The reason that you're on the cross is because you basically did not convert to the religion they wanted you to convert to. I've played better games than this. Also you get started off in a desert. if you play it by yourself you get killed every 5 minutes. This is more of a multiplayer game.  It is boring, that's my opinion. The menu is confusing. That's what I was spending most of my hour doing trying to figure out how the menu worked. But I couldn't figure out how the menu worked because I was being killed every 5 minutes. You can pick up items from your own corpse literally. If you're a fan of that.one time I didn't even do anything and I just got killed by some random monster. I wouldn't recommend anyone to play this game and spend your $8 on a different game. There's a lot of multiplayer games that are that price and are way better than this. I'm not a religious person so I guess the game is not for me and I can respect that. There should be more options at the start and not to force a religion on people. But no, I will never be playing this game again. Choose your options wisely people. 0 out of 10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "buns straight buns save ur money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mouse to pointer is off in game control panel.  I can hardly use the setup screen.  The mouse works fine in the everywhere else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it baffles me to see that you add shit but dont fix bugs. \n\nif the december update fixes the outstanding bugs, i will recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "funcom sucks, the monetization sucks, ai sucks, the changes suck, gamebreaking bugs, coop tethering... sad... I love the conan universe (read tons of the books, comics etc) but cant get behind it. gameplay is jank as all hell. OVERPRICED as fuck, and then look at the dlc? yeah fucking right. suck my flacid pee pee.\n\nsandbox survivals are my favorite. this isnt it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One day battle eye just decided to stop working and took the game with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game, definitely. The only thing I don't like about this game, is the game developer themself, Funcom. So, while I like this game itself, it's Funcom I give the negative review about due to Funcom's actions to players just trying to play and have fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gotta love a game where the game itself is only 40$ but all the dlc stuff is almost 120$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Couldn't honestly recommend when there's so many better games in this genre, especially with such a high price. The only problem really is that it's a bug ridden mess. You 100% will encounter some kind of game breaking shenanigans.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great fun game with so much potential but just ruined by all the bugs. Constant crashing my whole computer, bugging out in bosses and resetting, followers just glitching out, never to be seen again, ect ect ect. \r\nAfter being out this long and for the high price i could not recommend a game with this many game ruining bugs. Such a shame as has huge potential.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game crashes no mods, tried uninstalled and reinstalled 7 or 8 time. will not play a funcom game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "https://youtu.be/4BwTbPl2knI\n\nDefinitely a complete feeling 'one of these' survival crafting game that can be rewarding after investing large amounts of playtime, but without that are generally thin otherwise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Impossible to play Co-Op.  Friend can never join the server.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A trash game just . Your dont like your mony go buying ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game helped cure me of my crippling arachnophobia.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i was on my way to build a base and then fucking cthulhu appeared and killed me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Toxic players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Power hungry server owners",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "buggy and never any fixes",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}