{
  "positive": [
    {
      "review": "This game has so much potential lore wise, gameplay wise, character wise and many more. I would recommend but its a shame that they left this game to rot.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "It will forever remain Overwatch's best competitor in my eyes. Sucks that Hi-Rez has to kill all of their good games in favor of mid titles. Paladins has a great world with just as much story potential as Overwatch but it will never be acted on because of corporate greed.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Only thing paladins needs is \r\n1:people\r\n2:Someone who updates the game \r\n3:good og game which should make paladins 2",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I have been playing this game since late 2018 on my switch and it has been a constant in the back of my mind. I love this game, bugs and all- and Overwatch barely fulfils that Paladins shaped hole in my heart. There may be similarities between the two games, but Paladins was a different game entirely to me between maps, designs, and the way the characters were. It had its faults, most certainly, but I still hold this game highly in most regards. \n\nBasically I love Paladins and the devs changing focus to their other game sucks because its not even fun.\n\nAlso I miss Maeve.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i have way more than 36 hours from me playing on xbox. I used to play this game every single day with my best friend and my partner. it was SO fun. Just revisited and played a couple of matches today and it is still super fun <3 shame the game is no longer being supported for future updates and stuff but it still works and us fans are still coming back for the vibes and absolute nostalgia T^T <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Well , me personal i have fun playng this game . and i Think this is important haveing fun while playng games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I remember first playing this game back in 2018 at it's core this game had/has a lot of potential i personally had more fun playing Paladins then i had with Overwatch when it was good and. That card system was the best part, makes me think that I'm really starting to get tired of the whole LIVE SERVICE concept. If anything i personally believe it to be holding a lot of these games back especially games that have player versus player aspects like Paladins, Overwatch, Apex Legends, and such.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game  crashes on me. it gets into match loading screen then kicks me back to champion selection. Other than that i love paladins soo much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A colorful and strategic hero shooter often compared to Overwatch, but Paladins has its own unique charm and much deeper customization. The core of the game is the \"Cards\" system, which lets you tailor each champion's abilities to your playstyle, making every match feel different.\n\nThe champions are diverse, vibrant, and full of personality. Game modes are fun, and the core objective-based gameplay is solid. The game can be a bit buggy at times, and the balance isn't always perfect. However, it's a free-to-play title with a surprisingly fair model.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Paladins is like a magic show gone off the rails: Everyone’s firing sparkly nonsense, the payload barely moves, and your healer is suddenly a damage dealer “for experimental reasons.”\nMatches swing from heroic to hopeless in Sekundenbruchteilen – and somehow it’s hilarious every single time.\nPaladins is chaotic, colorful, and gloriously unbalanced… and that’s exactly why it’s impossible to quit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game fun to play but a lot of tryhards and cheaters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good just too much no lifers and unbalanced decks and combos you can't possibly deal with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much more than an overwatch clone. Please hi rez bring it back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After sinking over 450 hours into Paladins, I can confidently say this is one of the most enjoyable hero shooters you can get—especially for free.\n\nIs Paladins perfect? No. The matchmaking can be hit-or-miss, and balance patches sometimes feel like they were decided by throwing darts at a board. But when the gameplay clicks it’s genuinely some of the most fun I’ve had in a shooter.\n\nFor anyone wondering if Paladins is worth trying or returning to:\nYes. Absolutely.\n\nIt’s chaotic, stylish, surprisingly strategic, and still manages to be addictive after hundreds of hours. If you’re willing to embrace its quirks, you’ll find a game with a ton of depth and replayability.\n\n450 hours later, and I’m still not done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, used to play it as a kid on ps4 and now am beating kids up on it as an adult, good times.\n\nEdit: ok it is kinda dead though & is very hit and miss with if you can find a game match or not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended\r\n\r\nThe game is a lot of fun and they leave room for you to react and to outplay your opponent.  It has not created a game where characters pop in an instant and you had no idea what happened or no answer for what happened to you.  This has been my only live service game for quite some time and will likely continue to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Paladins was one of the first video games I've ever played, and it makes me so sad to see the state it is in right now. I hope one day someone sees the potential of the game and does something with it!!:)\r\nEven if they don't, it'll always be nostalgic to open it for a few rounds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you guys can revive this game I really think you should. It still has a pretty good player base, and a lot of people love it. Even though its good now, I (and many other, probably) am willing to support it. This game is a lot more popular than it was 9 months ago. This is also due to OW2's severe flop. Y'all can rlly get back in the mix",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been years since I last played. Apparently it's now winding down in activity. Seems like I never made a review for this. Better late than never.\n\nAll in all, I liked the gameplay. But disliked the \"free-to-play\" monetization. Every new character (non-free) they introduced was always OP, until they introduced a new character (again OP) and \"re-balanced\" the earlier one. You could usually pay for them with an exorbitant amount of in-game currency, or a fairly small sum of real-life money. So \"free-to-play\" became \"pay-to-win\".\n\nI especially liked the character skill/attribute customization options, where you could build your character to your own play-style. There might not be overly many players online, anymore, but I would recommend trying this.\n\nSkye FTW!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to a game that ive played when it was in its closed beta days till they axed the development of the game it pains me that this wonderful hero shooter has a slow painful death as it is currently suffering but i shall cherish the memories i got playing you while ill never get the money i used to acquire the plethora of skins and emotes i do not regret it rest well old friend may you find either a fitting rest or people that care enough to return you to your former glory",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game has its own nice unique vibe making it different from other hero shooters. Such a shame they stopped updating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Paladins is worth playing if you like hero-shooters and want a free-to-play option with a lot of customisation and fun. However — it is not flawless, and some of the longer-term support and ecosystem might feel weaker compared to more dominant titles in the genre.\r\n\r\nFinal call:\r\nIf you’re playing casually or with friends, you’ll likely enjoy it. If you want “the best” in 2025 for competitive hero-shooters, you might want to compare other options first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best hero shooter to ever come out but its sad to see that the game got dropped and ruined. in its peak it was better than prime ow and prime marvel rivals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun first person shooter. Sad that the developers stopped most updates. Still very fun to play with my friends. Playing full healing support is unbalanced due to high anti heal ratios. Still fun to play though i would recommend it. Even just to play alone it can be fun. 7.5/10, Some things could be better balanced, but as stated before they did stop with most updates and re-balances. Again though. I would recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hasn't updated in almost a year, too bad lots of us old beta players still  around! They offered a Founders Pack back then for $20, it gave you all new characters for FREE for life....love it :) COME OUT WITH NEW MAPS PLEASE!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a free game it is what it is, I've dove in and out of the gameplay for this for years now and always come back to it for some chill gameplay. I don't play it to be competitive but the characters and the cosmetics are really good. If you like other games like this i.e fortnite, apex etc then give it a shot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an amazing game i truly enjoyed. It has such a wide variety of champions and maps, even the many champions have 3 different talents and even further loadouts which makes the personalisation of gameplay absolutely amazing. I think everybody can enjoy this game since its impossible not to find something that you personally enjoy. Its been a long time that this game is dead and i have moved on but it makes me unbelievably sad that the team could allow this to happen, they had such an amazing game in their hands and beacuse of terrible marketing and greed they managed to let this game slip out of their hands. I have nothing but the best to say about Paladins but the development team let themselves ruin something truly great. I still hope a day when epic games or some such company would buy Paladins seeing its colossal potential would come but as time passes that seems more and more unlikely to happen and it makes me so sad that a game that i have so much memories of and basically grew up with will die just like that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun character skill customizations. Allows for different and fun play styles for each character. Dynamic and not boring respawn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From TF2 Rip-off and Overwatch fake, too literally being better than Overwatch (2). Might not have the hours on this game to prove it, but in most circles back then this was just seen as a game that was trying to profit off of the success of Blizzard's shooter and Valve's golden boy. Only thing I hate is the battle pass, but at the end of the day, greed's the only incentive, no? Love the Engineer skin for playing on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. couldve been designed better but it has really cool things in it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game but devs abandoned it and no one plays it anymore :(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Man i love this game on pc and nintendo switch,\nThe good old days.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Boot up Paladins\nAnti-cheat needs access to your social security number, mother's maiden name, street you grew up on.\nTakes 3-5 minutes to load\nUnable to join/invite to friends' lobby -> leave your empty solo lobby, join/invite successfully, queue up\n3-5 minutes later\nFirst match: Serpent's Beach, throw average numbers, 10/3/10 - zero chats from randoms whole game, team wishes death upon you.\nSecond match:  Throw low stats (healer/point tank), 3/9/10 - insults to bloodline, profile pic, enemy and team wishes death upon you.\nThird match: Play your good character, 30/5/10 - you must be hacking, enemy team is hiring Hi-Rez CEO to nuke your house.\nRinse and repeat.\nSimple as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buggadins. good game but very buggy. we love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a huge potential. Paladins deserves a better publisher",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine Overwatch but just better in every way except the player count.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game beats overwatch though needs to be updated seldomly to keep it alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is fun, especially customs, good thing they are keeping servers alive at least for now, i hope this game will come back one day but i doubt it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\r\n- You can play it on Linux (anti cheat linux support was enabled only recently)\r\n- Good art style (Personally I like it so much)\r\n- Runs on potato GPUs\r\n- Fun\r\n- Matches aren't very long (looking at you Dota)\r\n\r\nCons:\r\n- Sluts (trust me not good for your mental health)\r\n- when you die a RIP image shows up and some of them are DISGUSTING\r\n- UI not consistent and not responsive\r\n- bugs (it happens often that I respawn with no mount. I've heard it doesn't happen if you have very good ping)\r\n- and probably more :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun please bring it back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ppl need to give it a try and see what true hero shooter is honestly <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goat game people should play it more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game so much, i would never recommend this. 5/5 would eat here again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Verry good and fun game! ENJOY!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good my papa likes it i watch him play now i big boy boy (i dont wear night time diapers anymore) and i like gayme",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overwatch meets dungeons and dragons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, better than ow! hot laides #wlw",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My go to overwatch instead of OW 2, too bad its dead now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The unsung hero of a boring genre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game worst company",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I sure hope Paladins get more updates again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite fps games, I miss when it was poppin :((",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game taught me everything I know.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "orgasmic plays only in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game,. please revive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best hero shooter I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Community needs paladins 2 ASAP!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its good. underrated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh my god, Blizzard has done it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Come back, daddy misses you :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kill Dry water ts (this sh|t) is terrible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but dead game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VICTOR 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always was better than Overwatch",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "most toxic game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best hero shooter.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "We lowk deserve a Paladins 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wait are they remove paladins for mac?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best hero shooter ever tbh",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "jogo bom!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has big buff men",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play the game again :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "po dobra ot overwatch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hard game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than rivals",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "cool benas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goated FR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play fun with member",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than goonwatch",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "they never should have stopped development :((((",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love paladins!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Need some Updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goodbye my friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "noice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super Solid FPS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pip is cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I MISS THIS GAME",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "its a dead game development and updates were halted",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a hard one i loved this game ive had countless hours of fun with friends the game felt balanced then all of the sudden they change item shop? the way 90% of heroes work? on siege the first round 15 second respawn timers? wth is that also whats the point of even being a support anymore? as the game goes on you get %AntiHeal it gets to a point were its 90% quickly what are you supposed to do with that? I know theres items you can buy that give % more healing output but Why should i need that JUST to combat a game mechanic that was added for what Reason? ive spent Hundreds of Dollars in this game and im sad that the first time in 5 Years i have to Write a bad review and reccomend untill they revert changes (which probably will never happen) i CANNOT Reccomend this game anymore...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I believe this game was very good in its prime however some things are better left dead 6 feet underground and ummmmm with alot of dead people in it thanks for nothing Overwatch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is unplayable with a controller. It says controller supported but in some matches, you cannot move.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game gets worse and worse as you go. Completely unbalanced. Everything earnable requires insane grinding or vague dailies that are also grindy if not outright impossible. Glitches that cause immobility, laggy loading times. I can wait forever for the next \"hero\" to be released, since each new one breaks the game a little bit more. Balance the stuff you already have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A 5v5 team-based shooter like Paladins looked very promising on paper. It had a good variety of maps, a large roster of unique champions with different abilities, and even a shop system where you could buy extra perks to improve your stats. The gameplay felt fast and dynamic - fights were happening all the time, yet it never felt overwhelming or chaotic.\n\nThe balance and anti-cheat existed, though not always in their best shape. Still, for a while, the game managed to stay alive, build its own community, and even have an esports scene. But as time went on, it stopped evolving. Players began complaining that the only updates were new skins, while major improvements were nowhere to be seen. The game had squeezed out everything it could from its audience - and decline followed.\n\nIt's not a bad game by any means, but today it's simply not worth your attention anymore.\n\n★ ★ ★ ★ ★ ☆ ☆ ☆ ☆ ☆ (5/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost my entire account just randomly disconnested from my steam n theres nothing i can do old asf game and cant even link my orther account to my steam so i can still play games now unplayable for me 0 outta ten this games shit now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this alot like 7 years ago. I came back after a year or two of not playing and was genuinely shocked at how bad everything has become. \r\nYou no longer have drawn portraits of the characters/character skins when loading into a match (I don't know why it was removed??) the UI is now utter garbage to the point I can't tell what is what, they have some weird \"tower defense\" style mode in the works that you can't even play test despite it being on the menu.  And the game just overall. With the bugs, lack of updates, ect, just feels so much less fun than it used to. \r\n\r\nI want to hope Hi-Rez gets Paladins back on track but I doubt it. The game has been going downhill for like 5 years minimum due to their priority on battlepasses/skins over fixing any bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has been abandoned by the devs and the playerbase is dead, last update was 9 months ago since me writing this review. Don't waste your time with his, heck, don't waste your time with any game from this publisher, all of their games have been abandoned and are dead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just tried to launch this fucking turd 5 times.  4 attempts crashed and the 1 \"successful\" attempt only loaded 1/4 of the screen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Que bueno que se murio y porfavor que siga bien muerto juego de remierda lo odio",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It might have been fun, once upon a time..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is unbalenced dead and all around bad money grab also",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even remember playing this, so it wasn't good or noteworthy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Annoying if you play it alone. Boring if in company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "przez serwery jest obecnie nie grywalna (grane po powrocie: 18.11.2025)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game fucking sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game như cặc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dead game?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi-Rez has failed everyone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i like it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "overwatch better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DEAD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ";adfgnhz;ifSeoithRUHhg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where to start ...\n\nPaladins isn't like any other game. People claim it's a hero shooter clone, that it doesn't deserve players since it's a \"copy.\" I used to think that was furthest from the truth. \n\nThis game has the best mechanics and (dare I say) hero design out of any team shooter. Had the devs had a fraction of the budget that the OW (1) devs spent on wh*res and SAing their employees, this game would have had its spot on the top of the mountain.\n\nThen, Marvel Rivals came along. When you got two big dogs duking it out, it's hard to claim a spot at the table. Paladins got squeezed out by competition with deeper pockets, but not competition with deeper hearts. Had the community picked it up, had streamers not sh*t on it live, maybe it would have had a chance. In another universe, I like to think that this game had its time to shine. But the truth is, now, it is unplayable. Be it hackers, long queue times, bugs, or whatever else, every single fan is being slowly kicked out of the game.\n\nI used to play Paladins on Xbox for hours everyday. Well over 200 hours on record. Sometimes I think a portion of my life has been wasted, but then I think back to all the fun times I had.\n\nHi-Rez, if you're out there, make Paladins 2 a thing. It might be a lot of work, but there is a dedicated fanbase here that is ready and willing to kick their OW and Marvel Rivals overlords to the curb.\n\nThis is MilkJar69, signing off for the last time. Goodbye, Paladins.",
      "voted_up": false,
      "votes_helpful": 121
    },
    {
      "review": "It's a real shame that this game won't receive any major update anymore. \nI used to play it on console and I loved it and actually preferred it to Overwatch, Marvel Rivals and Valorant. This game had an enormous potential, but devs just gave up on it.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "From someone that has played this game a ton over the year I unfortunately cannot recommend this game. I am finally uninstalling after years of frustration. The game itself it wonderful and enjoyable if you can get into a match with 9 other actual players. more than 50% of the games result in someone leaving after dying 1 time and with a hero fighter like this that means the match is already over. You can not win a 4vs5 match in this game and reporting people does absolutely nothing. So you will basically have fun maybe 25% of the time because either your team leaves or the other team leaves and you are just playing against bots. You either steam roll them or get killed because of the bots on your team. If this game was actually popular and the developers took it seriously it would be one of my favorite games. After about 9 years of playing I am finally giving up on this game having any hope.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Loved the game when it first came out, still a really good game. It sucks what blizzard did to ruin the launch of this game.\n\nunfortunately the community and lack of support from Hi-Rez the game is unbearable to play, between hackers and people who just go afk to farm levels, you rarely have a match that doesn't have one or the other in it. \n\nI personally don't understand how these people enjoy just killing a game, why grind levels on a game you're killing? Nobody wants to stick around for one or two people to sit in the spawn two out of three matches.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a hard one i loved this game ive had countless hours of fun with friends the game felt balanced then all of the sudden they change item shop? the way 90% of heroes work? on siege the first round 15 second respawn timers? wth is that also whats the point of even being a support anymore? as the game goes on you get %AntiHeal it gets to a point were its 90% quickly what are you supposed to do with that? I know theres items you can buy that give % more healing output but Why should i need that JUST to combat a game mechanic that was added for what Reason? ive spent Hundreds of Dollars in this game and im sad that the first time in 5 Years i have to Write a bad review and reccomend untill they revert changes (which probably will never happen) i CANNOT Reccomend this game anymore...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a dead game development and updates were halted",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a mess. The characters are ridiculously overpowered, and getting one-shot over and over isn’t fun — it’s frustrating. Balance feels nonexistent, and the overall experience just isn’t enjoyable. I can’t recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I believe this game was very good in its prime however some things are better left dead 6 feet underground and ummmmm with alot of dead people in it thanks for nothing Overwatch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is unplayable with a controller. It says controller supported but in some matches, you cannot move.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game gets worse and worse as you go. Completely unbalanced. Everything earnable requires insane grinding or vague dailies that are also grindy if not outright impossible. Glitches that cause immobility, laggy loading times. I can wait forever for the next \"hero\" to be released, since each new one breaks the game a little bit more. Balance the stuff you already have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A 5v5 team-based shooter like Paladins looked very promising on paper. It had a good variety of maps, a large roster of unique champions with different abilities, and even a shop system where you could buy extra perks to improve your stats. The gameplay felt fast and dynamic - fights were happening all the time, yet it never felt overwhelming or chaotic.\n\nThe balance and anti-cheat existed, though not always in their best shape. Still, for a while, the game managed to stay alive, build its own community, and even have an esports scene. But as time went on, it stopped evolving. Players began complaining that the only updates were new skins, while major improvements were nowhere to be seen. The game had squeezed out everything it could from its audience - and decline followed.\n\nIt's not a bad game by any means, but today it's simply not worth your attention anymore.\n\n★ ★ ★ ★ ★ ☆ ☆ ☆ ☆ ☆ (5/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost my entire account just randomly disconnested from my steam n theres nothing i can do old asf game and cant even link my orther account to my steam so i can still play games now unplayable for me 0 outta ten this games shit now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this alot like 7 years ago. I came back after a year or two of not playing and was genuinely shocked at how bad everything has become. \r\nYou no longer have drawn portraits of the characters/character skins when loading into a match (I don't know why it was removed??) the UI is now utter garbage to the point I can't tell what is what, they have some weird \"tower defense\" style mode in the works that you can't even play test despite it being on the menu.  And the game just overall. With the bugs, lack of updates, ect, just feels so much less fun than it used to. \r\n\r\nI want to hope Hi-Rez gets Paladins back on track but I doubt it. The game has been going downhill for like 5 years minimum due to their priority on battlepasses/skins over fixing any bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Big F \npaladins may have not been the most balanced\nor the most deep\nor the most polished \nor the most updated \nor the most well thought out\nor the most fun \nit was really never the most anything but hey it sure was there and now its gone and thats sad\nmaintenance mode is a fate i would not wish on any game or community, ive been through it but i will say one thing\natleast TF2 still updates its localization files\nCmon high rez",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi-rez refuses to support this game, they just let it sit there and die. Instead of pulling back on releasing new heroes and balancing the old ones they just refused to work on the game all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i give it a chance in 2025 ... my first game was full of cheater , and very bad matchmaking going against high level players with cheat from first game \n\ngame is cool and fun , but deserve to die with this amount of cheaters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It used to be one of my favorite games, but I don't think is worth spending the time anymore",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I understand why this game died. Only people still playing are the size of Henry the 8th, and haven't gotten off since 2015. The elements that could be fun are better in other games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "played til i was level 14 and was flamed last 10 games for who i picked and not doing good enough... community is more toxic than league of legends so much so i can't even stay long enough to properly learn the game... even in the \"rookie\" mode for newcomers i couldnt find a match without waiting 5-10 minutes a match....in game it felt bad dying and not rewarding killing. The item \"auto buy\" felt sloppy cause i couldnt set it how i wanted it to auto buy, or if you can- its not streamlined enough to be obvious in game.\r\n\r\n The \"frontline\" champs were the only people i could play without getting murdered and i really didnt find any champ that felt \"good\" to play. the \"good\" champs are 30k each, and after saving 20+ games winnings i finally bought the guy i was looking at. turns out, he sucks! so now, after that, i gotta do it again..save another 30k. why are the champs costing coins? feels just.. so bad for a new player.. no single player mode to even test a champ out before you buy it?? last 5 champs i bought i research, watch, fought against, then when i went to buy them i realized just how bad they are in an actual game. game felt stale in about 3 days. frustrating, toxic, and stale. i'll be finding something else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Matchmaking  puts you up against the unemployed who got to level 2 million on a single character in a game that has not been supported in years.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dead game with tons of cheaters and afks nowdays, don't waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has been abandoned by the devs and the playerbase is dead, last update was 9 months ago since me writing this review. Don't waste your time with his, heck, don't waste your time with any game from this publisher, all of their games have been abandoned and are dead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just tried to launch this fucking turd 5 times.  4 attempts crashed and the 1 \"successful\" attempt only loaded 1/4 of the screen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It might have been fun, once upon a time..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is unbalenced dead and all around bad money grab also",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even remember playing this, so it wasn't good or noteworthy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Annoying if you play it alone. Boring if in company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "przez serwery jest obecnie nie grywalna (grane po powrocie: 18.11.2025)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game fucking sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game như cặc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dead game?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi-Rez has failed everyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "overwatch better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DEAD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ";adfgnhz;ifSeoithRUHhg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where to start ...\n\nPaladins isn't like any other game. People claim it's a hero shooter clone, that it doesn't deserve players since it's a \"copy.\" I used to think that was furthest from the truth. \n\nThis game has the best mechanics and (dare I say) hero design out of any team shooter. Had the devs had a fraction of the budget that the OW (1) devs spent on wh*res and SAing their employees, this game would have had its spot on the top of the mountain.\n\nThen, Marvel Rivals came along. When you got two big dogs duking it out, it's hard to claim a spot at the table. Paladins got squeezed out by competition with deeper pockets, but not competition with deeper hearts. Had the community picked it up, had streamers not sh*t on it live, maybe it would have had a chance. In another universe, I like to think that this game had its time to shine. But the truth is, now, it is unplayable. Be it hackers, long queue times, bugs, or whatever else, every single fan is being slowly kicked out of the game.\n\nI used to play Paladins on Xbox for hours everyday. Well over 200 hours on record. Sometimes I think a portion of my life has been wasted, but then I think back to all the fun times I had.\n\nHi-Rez, if you're out there, make Paladins 2 a thing. It might be a lot of work, but there is a dedicated fanbase here that is ready and willing to kick their OW and Marvel Rivals overlords to the curb.\n\nThis is MilkJar69, signing off for the last time. Goodbye, Paladins.",
      "voted_up": false,
      "votes_helpful": 121
    },
    {
      "review": "It's a real shame that this game won't receive any major update anymore. \nI used to play it on console and I loved it and actually preferred it to Overwatch, Marvel Rivals and Valorant. This game had an enormous potential, but devs just gave up on it.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "From someone that has played this game a ton over the year I unfortunately cannot recommend this game. I am finally uninstalling after years of frustration. The game itself it wonderful and enjoyable if you can get into a match with 9 other actual players. more than 50% of the games result in someone leaving after dying 1 time and with a hero fighter like this that means the match is already over. You can not win a 4vs5 match in this game and reporting people does absolutely nothing. So you will basically have fun maybe 25% of the time because either your team leaves or the other team leaves and you are just playing against bots. You either steam roll them or get killed because of the bots on your team. If this game was actually popular and the developers took it seriously it would be one of my favorite games. After about 9 years of playing I am finally giving up on this game having any hope.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "its a dead game development and updates were halted",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is a hard one i loved this game ive had countless hours of fun with friends the game felt balanced then all of the sudden they change item shop? the way 90% of heroes work? on siege the first round 15 second respawn timers? wth is that also whats the point of even being a support anymore? as the game goes on you get %AntiHeal it gets to a point were its 90% quickly what are you supposed to do with that? I know theres items you can buy that give % more healing output but Why should i need that JUST to combat a game mechanic that was added for what Reason? ive spent Hundreds of Dollars in this game and im sad that the first time in 5 Years i have to Write a bad review and reccomend untill they revert changes (which probably will never happen) i CANNOT Reccomend this game anymore...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is a mess. The characters are ridiculously overpowered, and getting one-shot over and over isn’t fun — it’s frustrating. Balance feels nonexistent, and the overall experience just isn’t enjoyable. I can’t recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "quiet game, waiting for the game too long even to the point of not getting it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to much bots. i get it keeps games going but the overall experience is highly diminished now. id say 9/10 games are with 2-3 bots on your team.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I believe this game was very good in its prime however some things are better left dead 6 feet underground and ummmmm with alot of dead people in it thanks for nothing Overwatch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game gets worse and worse as you go. Completely unbalanced. Everything earnable requires insane grinding or vague dailies that are also grindy if not outright impossible. Glitches that cause immobility, laggy loading times. I can wait forever for the next \"hero\" to be released, since each new one breaks the game a little bit more. Balance the stuff you already have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A 5v5 team-based shooter like Paladins looked very promising on paper. It had a good variety of maps, a large roster of unique champions with different abilities, and even a shop system where you could buy extra perks to improve your stats. The gameplay felt fast and dynamic - fights were happening all the time, yet it never felt overwhelming or chaotic.\n\nThe balance and anti-cheat existed, though not always in their best shape. Still, for a while, the game managed to stay alive, build its own community, and even have an esports scene. But as time went on, it stopped evolving. Players began complaining that the only updates were new skins, while major improvements were nowhere to be seen. The game had squeezed out everything it could from its audience - and decline followed.\n\nIt's not a bad game by any means, but today it's simply not worth your attention anymore.\n\n★ ★ ★ ★ ★ ☆ ☆ ☆ ☆ ☆ (5/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost my entire account just randomly disconnested from my steam n theres nothing i can do old asf game and cant even link my orther account to my steam so i can still play games now unplayable for me 0 outta ten this games shit now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this alot like 7 years ago. I came back after a year or two of not playing and was genuinely shocked at how bad everything has become. \r\nYou no longer have drawn portraits of the characters/character skins when loading into a match (I don't know why it was removed??) the UI is now utter garbage to the point I can't tell what is what, they have some weird \"tower defense\" style mode in the works that you can't even play test despite it being on the menu.  And the game just overall. With the bugs, lack of updates, ect, just feels so much less fun than it used to. \r\n\r\nI want to hope Hi-Rez gets Paladins back on track but I doubt it. The game has been going downhill for like 5 years minimum due to their priority on battlepasses/skins over fixing any bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Big F \npaladins may have not been the most balanced\nor the most deep\nor the most polished \nor the most updated \nor the most well thought out\nor the most fun \nit was really never the most anything but hey it sure was there and now its gone and thats sad\nmaintenance mode is a fate i would not wish on any game or community, ive been through it but i will say one thing\natleast TF2 still updates its localization files\nCmon high rez",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi-rez refuses to support this game, they just let it sit there and die. Instead of pulling back on releasing new heroes and balancing the old ones they just refused to work on the game all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i give it a chance in 2025 ... my first game was full of cheater , and very bad matchmaking going against high level players with cheat from first game \n\ngame is cool and fun , but deserve to die with this amount of cheaters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It used to be one of my favorite games, but I don't think is worth spending the time anymore",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I understand why this game died. Only people still playing are the size of Henry the 8th, and haven't gotten off since 2015. The elements that could be fun are better in other games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "played til i was level 14 and was flamed last 10 games for who i picked and not doing good enough... community is more toxic than league of legends so much so i can't even stay long enough to properly learn the game... even in the \"rookie\" mode for newcomers i couldnt find a match without waiting 5-10 minutes a match....in game it felt bad dying and not rewarding killing. The item \"auto buy\" felt sloppy cause i couldnt set it how i wanted it to auto buy, or if you can- its not streamlined enough to be obvious in game.\r\n\r\n The \"frontline\" champs were the only people i could play without getting murdered and i really didnt find any champ that felt \"good\" to play. the \"good\" champs are 30k each, and after saving 20+ games winnings i finally bought the guy i was looking at. turns out, he sucks! so now, after that, i gotta do it again..save another 30k. why are the champs costing coins? feels just.. so bad for a new player.. no single player mode to even test a champ out before you buy it?? last 5 champs i bought i research, watch, fought against, then when i went to buy them i realized just how bad they are in an actual game. game felt stale in about 3 days. frustrating, toxic, and stale. i'll be finding something else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is unplayable with a controller. It says controller supported but in some matches, you cannot move.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has been abandoned by the devs and the playerbase is dead, last update was 9 months ago since me writing this review. Don't waste your time with his, heck, don't waste your time with any game from this publisher, all of their games have been abandoned and are dead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just tried to launch this fucking turd 5 times.  4 attempts crashed and the 1 \"successful\" attempt only loaded 1/4 of the screen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Que bueno que se murio y porfavor que siga bien muerto juego de remierda lo odio",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It might have been fun, once upon a time..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't even remember playing this, so it wasn't good or noteworthy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Annoying if you play it alone. Boring if in company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "przez serwery jest obecnie nie grywalna (grane po powrocie: 18.11.2025)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game fucking sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game như cặc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dead game?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hi-Rez has failed everyone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i like it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "overwatch better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DEAD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ";adfgnhz;ifSeoithRUHhg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where to start ...\n\nPaladins isn't like any other game. People claim it's a hero shooter clone, that it doesn't deserve players since it's a \"copy.\" I used to think that was furthest from the truth. \n\nThis game has the best mechanics and (dare I say) hero design out of any team shooter. Had the devs had a fraction of the budget that the OW (1) devs spent on wh*res and SAing their employees, this game would have had its spot on the top of the mountain.\n\nThen, Marvel Rivals came along. When you got two big dogs duking it out, it's hard to claim a spot at the table. Paladins got squeezed out by competition with deeper pockets, but not competition with deeper hearts. Had the community picked it up, had streamers not sh*t on it live, maybe it would have had a chance. In another universe, I like to think that this game had its time to shine. But the truth is, now, it is unplayable. Be it hackers, long queue times, bugs, or whatever else, every single fan is being slowly kicked out of the game.\n\nI used to play Paladins on Xbox for hours everyday. Well over 200 hours on record. Sometimes I think a portion of my life has been wasted, but then I think back to all the fun times I had.\n\nHi-Rez, if you're out there, make Paladins 2 a thing. It might be a lot of work, but there is a dedicated fanbase here that is ready and willing to kick their OW and Marvel Rivals overlords to the curb.\n\nThis is MilkJar69, signing off for the last time. Goodbye, Paladins.",
      "voted_up": false,
      "votes_helpful": 121
    },
    {
      "review": "It's a real shame that this game won't receive any major update anymore. \nI used to play it on console and I loved it and actually preferred it to Overwatch, Marvel Rivals and Valorant. This game had an enormous potential, but devs just gave up on it.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "From someone that has played this game a ton over the year I unfortunately cannot recommend this game. I am finally uninstalling after years of frustration. The game itself it wonderful and enjoyable if you can get into a match with 9 other actual players. more than 50% of the games result in someone leaving after dying 1 time and with a hero fighter like this that means the match is already over. You can not win a 4vs5 match in this game and reporting people does absolutely nothing. So you will basically have fun maybe 25% of the time because either your team leaves or the other team leaves and you are just playing against bots. You either steam roll them or get killed because of the bots on your team. If this game was actually popular and the developers took it seriously it would be one of my favorite games. After about 9 years of playing I am finally giving up on this game having any hope.",
      "voted_up": false,
      "votes_helpful": 13
    }
  ]
}