{
  "positive": [
    {
      "review": "The vanilla base game is okay. The shipbuilding is great, and being able to import assets from other games, voxelize them, and drop them right in is genuinely cool. The game sells itself as a sandbox space-combat/light-economy sort of deal—basically an “X4 lite.” But where X4 has a deep, living economy and a world that actually reacts to things (even if it limits your creativity), Avorion is the opposite. You get tons of freedom to build whatever you want, but the world underneath feels pretty shallow. After a few hours you’ve basically seen every sector layout, quests start repeating, combat feels kind of average, and factions mostly just… exist in the background without doing much.\n\nSo why a positive review? Simple: the Xavorion mod. Somehow a modder managed to bring out the potential the base game only hints at. The mod adds a real supply-and-demand economy, AI factions that actually compete with you, sectors that finally feel different, and much better faction interaction instead of everyone just sitting there pretending to be alive. It even improves the combat enough to make fights feel more engaging instead of “point, shoot, repeat.”\n\nIt’s still not X4-level deep, but it’s a huge step closer—and honestly, this mod basically saved the game for me. Vanilla is just painfully average on its own.\n\nSometimes developers build the canvas, but modders end up painting the masterpiece.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "One of the best space games ever made.\n\nStart small, design and build your own ship, hire crew and add weapons, miners, salvagers. Hell you can even appoint a captain and let him go off and do everything for you.\n\nNot enough?\nStart your own empire, build your own stations and mining outposts, send traders off to trade.\n\nIts a giant sandbox of creativity and if you like, all out war.\nOne of the best purchases i ever made and that was years ago, the DLC is hit or miss depending on what you like, but other than that the game is brilliant.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Steam told me to review a game for a badge and I like this game and you should play it because it is fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The single best casual, multiplayer space game I've ever played. I haven't tried public servers, but it's really fun with friends. Highly recommend the ExAvorion mod pack.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As you can see, I’ve definitely spent enough time with the game to give it a proper recommendation. \nI had a lot of fun with Avorion, both in co-op and solo.\nThe graphics are quite simple - don’t expect a visually stunning game, and it’s best to grab it on sale.\nIt’s very grindy, but I actually enjoyed that aspect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't get into it unfortunately , I prefer a more realistic approach to space games. This game does have a lot of underlying mechanics though, its just the gameplay loop combined with the voxel visuals that don't seem to hook me. Thumbs up because in its core it is a solid game for those into this niche",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite addicting, good singleplayer and multiplayer, little lag despite the innumerable projectiles, and overall fun mechanics. Not for everyone, but certainly for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Хорошая игра чтобы ускорить течение времени, особенно во время строительства корабля",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable, fairly easy to understand tutorial.  Wish you could save at any time in the tutorial without loosing progress and having to start over .   However this helps learning the interface.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing open world that I keep coming back to over and over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game; exactly the sort of game I would make if I could.\r\nOn the Mac it is in severe need of more optimization - it can take up to 7 minutes to change sectors. On the PC (with a better graphics card) it performs much better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah i think this game is good\r\n(genuine suggestion, in the photo mode make using the scoll wheel change the fov)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but I lost my 99 hour save because there is apparently no cloud save, RIP. 9/10 would still recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Early and Mid Game is fun endgame is lacking and Rift DLC is very buggy but all in all a nice game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless expansion and creativity, great combat and spacecraft building fun. Overall a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game which allows you to build spaceships, and sometimes you don't even realize how big your ships are and when you think you built something the size of a football field, it really is closer to being the size of a football stadium. Also for newcomers who want to build a massive ship, i recommend building more medium range ships from the 800-1200 yard range before going bigger, as it may just begin to look bad and suck with inexperienced builders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vastly populated with tons of treasures, pirates, and adventure. Plus a lot more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Avorion is an absolute gem for anyone who loves space exploration and creative building—especially in multiplayer! It's become my new addiction: endlessly building massive fleets of specialized ships for every role imaginable!\r\nStart with nimble mining frigates stripping asteroids bare, or building a salvage fleet to clean up the wreckage. Play trucking sim with your cargo fleets going to and from stations making millions through cargo hauling. But don't stop there—craft support carriers packed with repair drones and fighter squadrons that keep your armada battle-ready mid-fight. The ship-building system is incredibly deep, letting you design functional behemoths with turrets, factories, hangars, and crew quarters that feel alive.\r\nThe procedurally generated universe is your playground: take over entire AI empires by infiltrating their stations, crippling their fleets, and claiming their sectors as your own—or forge shaky alliances with rival factions for mutual defense and nothing beats the rush of murdering alien scum in epic PvE boss swarms or pirate armadas, lasers blazing as your fleet unleashes hell!\r\nMultiplayer elevates it to god-tier: Team up to orchestrate fleet ops, raid together, or clash in PvP wars. Host dedicated servers for 10-64 players, mod with Steam Workshop for custom chaos, and watch your empire persist across sessions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game you can spend a lot of time playing without getting bored.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best space civ sim game ever. i love this game. i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite fleet building games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun different take on the playstyle of X4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool and good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can play it like an idle game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very addictive game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the creative freedom it give you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ship big, weapon big. Explosion",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "is the Rift DLC still broken?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its alrite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its lovely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EVE: Offline",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you like space.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GudGud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spaceeeeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The vanilla base game is okay. The shipbuilding is great, and being able to import assets from other games, voxelize them, and drop them right in is genuinely cool. The game sells itself as a sandbox space-combat/light-economy sort of deal—basically an “X4 lite.” But where X4 has a deep, living economy and a world that actually reacts to things (even if it limits your creativity), Avorion is the opposite. You get tons of freedom to build whatever you want, but the world underneath feels pretty shallow. After a few hours you’ve basically seen every sector layout, quests start repeating, combat feels kind of average, and factions mostly just… exist in the background without doing much.\n\nSo why a positive review? Simple: the Xavorion mod. Somehow a modder managed to bring out the potential the base game only hints at. The mod adds a real supply-and-demand economy, AI factions that actually compete with you, sectors that finally feel different, and much better faction interaction instead of everyone just sitting there pretending to be alive. It even improves the combat enough to make fights feel more engaging instead of “point, shoot, repeat.”\n\nIt’s still not X4-level deep, but it’s a huge step closer—and honestly, this mod basically saved the game for me. Vanilla is just painfully average on its own.\n\nSometimes developers build the canvas, but modders end up painting the masterpiece.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Avorion is the game I wished No Man's Sky to be. \n\nI am a big fan of sandbox games, automation games, survival, crafting, and continuous progression games. Avorion offers you the perfect mix of all these types of games. It is a large sandbox with great systems working on top of it. I like the story mode (skipable) of working your way up from nothing. The various difficulties offer the right degree of challenge for everyone. In a way, it is comparable with Mount & Blade. The journey from nobody to fleet commander is the enjoyable and replayable part of this game. \nHave I mentioned the complete freedom you are given in the ship editor? Mining resources to build your perfect spaceship feels so rewarding - and every battle feels engaging as you might lose all the precious goods you just acquired. No save game reload (apart from copying the whole galaxy folder) is possible. \n\nI have played for about 100 hours now and I have engaged with many of the systems but I have yet to reach the endgame.\n\nI have not touched on the major addition to that: Multiplayer & Workshop\nThis will certainly increase the replayability by a ton.\n\nWhat needs to be improved?\nSometimes travel feels slow (due to loading between each tile on the map). But you can work your way around that with a larger ship, system slots or hyperspace cores.\nThe game could also benefit from some quest variety - even if they are generic. The simple fetch quests for example could certainly benefit to make the early game more engaging.\n\nThe price point of this game is fair. You can argue about the DLCs but I think the complete package is worth the money.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "It's a well made game.  No bugs or crashes after 90 hours of play.  I enjoyed the early game, mining, designing and building ships, progressing on my journey towards the centre of the galaxy.  But then I discovered (without giving too much away) that I couldn't progress any further without completing some missions that involve heavy combat.  The game doesn't explain this to you.  I had to research it online. And I wanted to play a peaceful game where combat was limited to a defensive role.  I guess I could do that if I stayed in the outer reaches of the galaxy, but there wouldn't be any progression apart from increasing my stock of ore and funds in my account.  So be warned - you are forced to complete certain combat orientated missions to complete the game.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Shockingly good open world sandbox. If you like Bannerlord/Warband, SPAZ or even EVE Online, this should scratch a similar itch,\r\n\r\nI'm late to the party but hoping they are still making more DLC so I can throw some more money at them.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "With the right mods, this game definitely scratches the \"From The Depths In Space\" itch.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the best space games ever made.\n\nStart small, design and build your own ship, hire crew and add weapons, miners, salvagers. Hell you can even appoint a captain and let him go off and do everything for you.\n\nNot enough?\nStart your own empire, build your own stations and mining outposts, send traders off to trade.\n\nIts a giant sandbox of creativity and if you like, all out war.\nOne of the best purchases i ever made and that was years ago, the DLC is hit or miss depending on what you like, but other than that the game is brilliant.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Have you ever been playing Space Engineers and thought to yourself \"man, I wish this looked more like Minecraft and felt like Eve Online\"? Good news, go buy this.\n\nThis is a really cool game. It takes the trading/fighting/exploration of a game like Elite: Dangerous or the X games, adds in the building of Minecraft (or From the Depths. It's an easier to deal with version of From the Depths, set in space and with an economic system, if that means anything to you), and then out of nowhere, tacks on the ability to turn the whole thing into an RTS that you play entirely from a map.\n\nBesides the building, it doesn't do any of these things *quite* as well as other games, likely in no small part because it's still in Beta. Automated combat doesn't work super super well, but it's passable. It doesn't look as good as non-voxel games, but it still looks nice. But it does everything well enough that you still enjoy playing it, and you're pretty free to entirely ignore portions of the game if you'd like. It's easier to set up bases and mining fleets and whatever, but I'm absolutely sure a person could play through the game as a single ship too.\n\nI haven't played around with mods yet, but it's easy to tell that this game takes well to them, and there's already a few popular ones out there.\n\nThe story is... i actually have no idea. Probably badly written and translated from another language, as is usually the case with these games. I *genuinely* have no idea though - I play games like Disco Elysium to pay attention to a story. I play 4x/open world/freeform RPG type games to play the game. It's something about aliens at the center of the galaxy doing badguy stuff, or something, I think. The first thing I did was skip the tutorial/story intro and fly off into a rock.\n\nBeyond that, you get a pile of procgen factions with various traits to make your own stories up with, be it because you're a nice guy who has helped them out and founded alliances, or because you've turned them into historical footnotes by killing them all and subsuming their empires. Or, you can just completely ignore them and fly around a fight pirates, or be a pirate, on your own. It's not really a game that gives you much for specific goals beyond \"go here, find this, kill that, get to the center of the galaxy\", which you will either love, or completely bounce off of.\n\nCoolest part: Just the fact that I can build my own ship of whatever designed I want to put the time into, arm it with weapons I design the appearance of, and then direct it to rendevous with a dozen ships like it in a sector containing asteroid mines and a huge variety of factory space stations, all of which I can also design if I want. Then I can send them off to fight someone on the other side of the map while I do something else, but still hop into one of them when they get there and kick some ass myself. Or I can hop into a fighter launched by one of them (which I've also designed) and be actually a little blown away by the scale of everything while I make an attack run on an enemy ship I've just realized is almost the size of the valley I live in in real life.\n\nLeast cool part: I have to manually load out every single ship I build, the AI that operates my ships isn't very good (enemies are fine), and in general, the RTS elements are quite there yet. They are better than in From the Depths or any other game like this I can think of, but there's still a little ways to go before your faction's AI-controlled ships perform like the AI ships. Or at least that's what it feels like. \n\nBut as an example, if you set your flagship to have autoturrets on it (so you don't have to aim and fire them and can focus on big guns or flying), they will only fire if they are all on roughly the same plane and have the same arcs/lines of fire within their fire control group. This is fine on AI designs, where they are all mounted this way, but *you* probably won't want to mount them that way. This means a ship that you, as the player, can absolutely crush stuff in will usually be firing only a fraction of it's guns when the AI uses it, as the same AI that runs the autofire system appears to run the overall combat system.\n\nIt's not a game breaker, but it does sort of pull you out of the immersion and is just... dissapointing, I guess, relative to how well everything else seems to work in the game. This is compounded by the fact that the game is in a schroedinger box - when you don't observe the action (i.e. watch a fight, idle in the same sector as your mines, etc.), a lot of stuff behaves differently than if you do - it appears to be abstracted at that point. Which isn't at all unusual for a game, but feels like it stands out a bit specifically when it comes to the combat here. The economy works similarly but feels more \"normal\".",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome concept, but it runs into issues as you get into the mid-game. If you can get it on sale, do it. I got $15-20 worth of entertainment out of this *for sure*. first 30 hours or so were a blast. \n\nas a platform for just exercising creativity and building ships, it's AWESOME. I really liked the editor and the simplicity/flexibility of construction. a lot of games where you design ships/vehicles with blocks end up being a little overwhelming for me and I struggle to make things look cool, and struggle with level of detail. the art style of this game was really enjoyable once I started to get a better feel for the tools available to me. making different assemblies to then use as modular components for building larger ships was super fun- I got to sort of see my own design language span my small fleet of different ships for different purposes, but sharing a common vibe. \n\nHOWEVER- gameplay runs into a lot of issues that other comments discuss. once you get far enough along that you really start to feel like you could benefit from automating stuff, you realize you can't really. It seems like the devs WANTED you to be able to... but you can't really. \n\ncombat balance gets a little wonky later on too. everything just keeps scaling up and up and more guns/more shield/more health and eventually you find yourself just building bigger and bigger blocks of turrets around a stale meta basically. the combat isn't sophisticated or micro enough to be that interesting as a single hero ship game like Elite Dangerous, and it's not really complex enough in multi-ship fights to reward you much in an RTS style combat like something like Homeworld. \n\nI find myself wanting to boot it back up just to build fun little ships to use as inspiration/reference for digital painting and stuff more than actually continue playing the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As you can see, I’ve definitely spent enough time with the game to give it a proper recommendation. \nI had a lot of fun with Avorion, both in co-op and solo.\nThe graphics are quite simple - don’t expect a visually stunning game, and it’s best to grab it on sale.\nIt’s very grindy, but I actually enjoyed that aspect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm ashamed of myself for not giving Avorion a positive review yet.\r\n\r\nThis game is great!  It's a micro-management fishbowl with spaceship-sim and so many in-game variables that there is no right or wrong way to do what you have fun with.\r\n\r\nI've never had any melodrama on the Steam Community (Forums) for this game, either.  \r\n\r\nAvorion is just a great game from some people who took game design seriously and nailed it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is an amazing game. Definitely worth getting.\r\nWould love to have a RTS style MOD or something where you can design and have ships auto build almost like Sins of a Solar empire, then take over the universe.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Steam told me to review a game for a badge and I like this game and you should play it because it is fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "very unique game\nhighly recommended\n\nNEW:\nRandom  crashing NOW win i click on a tab",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The single best casual, multiplayer space game I've ever played. I haven't tried public servers, but it's really fun with friends. Highly recommend the ExAvorion mod pack.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bought this game awhile back and decided to try it a couple months ago...been hooked on it...love the building and with the right mod set the game as a whole..worth every penny even at full price!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Unique experience - start from the bottom and make your way through the procedural galaxy.\r\nThe building system is not limiting you to create a spaceship of your dreams (or station).\r\nProgression feels meaningful and well done.\r\nYou can play the game the way you want, being a nasty pirate or lucrative trader, even build your own faction and make it a prosperous empire later. The decision of how you want to play and enjoy is yours.\r\n\r\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Avorion is the unholy offspring of Space Engineers, Space Pirates and Zombies, and Star Control. It is glorious and addictive. Be warned. Be ready. Watch your ship mass closely.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you want a loading sim this is the game for you\r\n(but for real is good game, loading times do kinda suck tho)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still haven't 100% this game and I'll probably spend another 1000 hours or so in this game, so yeah would highly recommend. I refuse to play the tutorial, my incompetence in unmatched in the galaxy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very daunting at first, and you'll spend 3 lifetimes in the ship builder. Damn good fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite Idle Action game.  Enough AI to do all the grinding leaving you free to Play in a sandbox of space ships and stations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most unique experiences without mods, and still being updated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredible replay ability, customizability, craft and shape your ships, build one mega ships, build a fleet of small ships, command other captains, everything, just wish it was longer, i have played through multiple times, and it has huge modding community that will add and change the game so you can play it again for the first time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't get into it unfortunately , I prefer a more realistic approach to space games. This game does have a lot of underlying mechanics though, its just the gameplay loop combined with the voxel visuals that don't seem to hook me. Thumbs up because in its core it is a solid game for those into this niche",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite addicting, good singleplayer and multiplayer, little lag despite the innumerable projectiles, and overall fun mechanics. Not for everyone, but certainly for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Хорошая игра чтобы ускорить течение времени, особенно во время строительства корабля",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable, fairly easy to understand tutorial.  Wish you could save at any time in the tutorial without loosing progress and having to start over .   However this helps learning the interface.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing open world that I keep coming back to over and over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game; exactly the sort of game I would make if I could.\r\nOn the Mac it is in severe need of more optimization - it can take up to 7 minutes to change sectors. On the PC (with a better graphics card) it performs much better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah i think this game is good\r\n(genuine suggestion, in the photo mode make using the scoll wheel change the fov)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but I lost my 99 hour save because there is apparently no cloud save, RIP. 9/10 would still recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Early and Mid Game is fun endgame is lacking and Rift DLC is very buggy but all in all a nice game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's vast and fun with a good economy simulator. Missing a bit in the diplomacy department but otherwise I absolutely love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favourite space games, and thats a hard list to top being a grew up with some of the greats.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Might be the best space game I've played, It's what I wanted/thought elite would be to an extent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mixed feelings about this game and a very hesitant recommendation.\nIt's decent for a surface-level space sandbox and you can easily sink dozens of hours into it.\nProvided that you can glance over its many flaws of course.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really fun game. But you need to understand resource management and risk vs rewards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's certainly a pretty unique game. Once you get used to the mechanics and knowledge requirements, the game opens up to allow a whole lot of different stories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Absolute gold. It's minimalist graphics should not hinder your creativity at all. Many fights, trading, looting, building, diplomacy and mining. And these are only the things I have found YET! As you progress inward to the galaxy center, you will find resources and and new friends. (or foes!) Choose a side in conflict. Fight for your morals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak space sandbox, amazing sense of scale. Start in a 5 meter dingy ship, end up piloting a 5km dreadnought that can take on dozens of enemies on its own. Establish a commercial empire with factory space stations, fleets of mining craft and fleets of traders. \n\nJust wish there were more people playing and that the developers would actively invest in it. Didn't encounter bugs, but it could benefit from additional features or performance improvements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the flight controls are very intuitive and fun, and the hardest part of ship building is making a design that isnt the ugliest thing this side of the galaxy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy flight.  Easy ship build mechanisms.  Good feedback when you aren't doing something right.  Lots of room to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game. The writing is ATROCIOUS though. Very hard to immerse into any semblance of seriousness when everything readable reads like a reddit post.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a very arcade style experince but has so much to explore, discover and fight. it's one of my favorit sandbox style games. i enjoy everything from the building mechanics, to the combat, to the micromanaging ship systems. highly recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I loved first 80 hours. Workshop ships made the boxy aestetics much better. I really like the fact that every ship handles like capital ship. I really like the 3rd person mining mechanics.\r\n\r\nBut once the game transitions from 3rd person space faring game to kind of space empire simulator, it starts being little tedious and boring due to lack of gameplay tools and features for such playstyle.\r\n\r\nBut I could still make it work for myself, if the internal server did not crash every 30-120 minutes. \r\n\r\nAs a software engineer myself, I investigated it extensively for 2 weeks, I reported the issue to the devs and searched all depths of the internet. I've found that the same error has been already reported 4 years ago, but could not find the root cause. There were descriptions of server stability issues and hints, so I used them at least.\r\n\r\nSo the rest of my playthough from midgame to the fall of the Guardian was just me doing:\r\n1) start the server, \r\n2) do few actions\r\n3) /pause, /save, /unpause\r\n4) do few more actions or wait for server to crash\r\n5) repeat\r\n\r\nI finished the game just for the sake of these first 80 enjoyable hours.\r\n\r\nNot the best gaming experience I must say.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After played 90 hrs I found this game grindy and highly repetitive gameplay.\n\n1. When mining new ore you need to use high tech lv weapons, that means you gonna send explorer-ish ship near late game zone and spend money at random NPC's equipments dock to increase reputation then spend a lot again to buy specific r-mining weapon while S/L (back to menu then reload save to refresh shop's goods).\n\n2. You need a lot of money, but every task or attacking pirates make little. Only factories can generate substantial income, but the initial investment requires an enormous amount of money. Mining can make profit but However, late-game mining demands top-tier frigates, advanced systems, powerful weaponry, ships crafted from the highest-tier minerals, and expensive carrier aircraft (a single unit can cost you 20,000 minerals). As enemies grow stronger alongside your progression, this starkly contrasts with early-game mining. Late-game mining becomes a tedious grind.\n\n3. You always busy at buying pilots esp those spanner guys to increase ship speed, captains, rebuild ships, rename new stuffs, click \"refine\" again and again after your miner's storage reached limit(Idk why dev don't make them auto go refine), finding weapon's parts, spend a lot of money or ore just to replicate some weapons, upgrade factories but it might take dozens of hours to break even.\n\n4.Some of the game's settings are utterly baffling. For instance, carrier mining ships operate at extremely low efficiency unless equipped with R-MINING, yet R-MINING in carrier requires both installing the system and having unlocked Xanion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played a bit, probably a good game, I can't tell yet.\n\nDedicated server is awesome. Runs smoothly without errors.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand a majority of the negative reviews for this game. It does take some time to learn all the controls and how the building mechanics work which can be a little overwhelming on first startup. after that though, this game becomes one of the most peak casual grindathon games i have ever played. The sheer amount of map space and places to discover, mine, destroy, and rescue is almost insurmountable, i love it. There is 100's of hours of new missions and sectors to venture in and take over and the strategy of building ships for battle is very fun especially with the percentage upgrades to shields. \r\n\r\nIn conclusion, this game is amazing 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this game is a bit of a maybe for me.\n\nOn one hand, the editor is quite potent. It is a bit of a learning curve to figure out the editor, the UI is not at all intuitive. But, once you do figure out the editor, it is very functional. You can design ships. You can design stations. And with the shapes and scaling tools available the only real limitation here is your imagination and patience. Check out the workshop if you're curious about that. People have made some truly gorgeous ships in this game.\n\nOn the other hand, the game play itself is fairly basic. Making a strong ship mostly boils down to more guns, more shields, enough thrust and maneuverability to move well, and a big enough reactor to make that all work smoothly. With enough firepower and shields, most things stop being a threat quite quickly. Ship design itself, from a functional standpoint, is quite basic. Everything is a scaleable solid. Engines, reactors, engines, armor, it's all just boxes of various shapes you can snap together. \n\nYou can have a fleet. Mostly this just means sending ships out to do something for some amount of time and return with the profits. You can assign a ship to be your wingman if you wish too. You can design stations. Stations are expensive, but they provide steady passive income and other handy features once you get that set up. \n\nAnd there a galaxy to explore, but it's procedural and mostly feels the same. Closer to the center things do get harder. There's a progression of 7 different materials. Iron and Titanium to start at the fringe where you start. Ending in the titular metal Avorion as you reach the center of the galaxy. Mostly, this just means you build stuff in the highest material you've got to make everything stronger.\n\nSo in the end, I think this game boils down to a simple question. Do you want to design pretty ships? Or do you just want to  play a game and explore? If you are a designer, this game is a solid choice for it. If you aren't . . . maybe give this one a pass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun 4X, Sandbox, Action RTS game. The only problem is the AI of this game but everything else is nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was looking for a space game where i can build my own spaceship. Then i found about this game, bought this and played almost two weeks just this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, enjoyed making fleets and growing my economy through piracy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A surprisingly fantastic space game, watch tutorial's from Ic0n Gaming on Youtube - this will help you get into the game and start to enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.\nI'm just not very good at building ships, I need a large selection of pre-made ships for a relaxed game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless expansion and creativity, great combat and spacecraft building fun. Overall a great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game which allows you to build spaceships, and sometimes you don't even realize how big your ships are and when you think you built something the size of a football field, it really is closer to being the size of a football stadium. Also for newcomers who want to build a massive ship, i recommend building more medium range ships from the 800-1200 yard range before going bigger, as it may just begin to look bad and suck with inexperienced builders.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a sleeper game! way better than it looks. a space game that does not feel empty",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Outstanding project! Amazing smooth gameplay. Cute atmosphere! Made with love! Absolutely love this game! Many thanks, appreciated!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vastly populated with tons of treasures, pirates, and adventure. Plus a lot more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Avorion is an absolute gem for anyone who loves space exploration and creative building—especially in multiplayer! It's become my new addiction: endlessly building massive fleets of specialized ships for every role imaginable!\r\nStart with nimble mining frigates stripping asteroids bare, or building a salvage fleet to clean up the wreckage. Play trucking sim with your cargo fleets going to and from stations making millions through cargo hauling. But don't stop there—craft support carriers packed with repair drones and fighter squadrons that keep your armada battle-ready mid-fight. The ship-building system is incredibly deep, letting you design functional behemoths with turrets, factories, hangars, and crew quarters that feel alive.\r\nThe procedurally generated universe is your playground: take over entire AI empires by infiltrating their stations, crippling their fleets, and claiming their sectors as your own—or forge shaky alliances with rival factions for mutual defense and nothing beats the rush of murdering alien scum in epic PvE boss swarms or pirate armadas, lasers blazing as your fleet unleashes hell!\r\nMultiplayer elevates it to god-tier: Team up to orchestrate fleet ops, raid together, or clash in PvP wars. Host dedicated servers for 10-64 players, mod with Steam Workshop for custom chaos, and watch your empire persist across sessions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never was really into the space engineer type of genre, but this kinda floated my boat. \nI liked the endless ship building and customizations. \n\nGoing into rifts were scary, one wrong move and everyone's outline goes red, scariest thing ever. \nWill do it again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice space sandbox with the main feature being you build your own ship. However building from scratch is optional as ingame ai offers some procedural generation designs and there is the workshop full of designs to either use outright or as basis for your own customization.\r\nWhile there are several activity systems and customization approaches some feel less fleshed out than they could be.\r\nCreation of station complexes / supply chains is somewhat limiting.\r\nWhile combat can be high action activity most other activties are in much slower pace.\r\n\r\nTechnical stuff\r\nOverall performance is fine but there are a lot of of cases of microstuters depending on situation and performance is rarely smooth in busy sectors.\r\nUI can be really laggy in some situations.\r\nIn single player mode it seems like game is not caching a lot of resources that it could to provide better overall expirience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game! Great Spaceship builder!! Command your own empire whilst exploring the galaxy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game you can spend a lot of time playing without getting bored.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its fun at first, but don't expect ANY endgame they just pad out the same thing over and over. Fights are guaranteed to take at least 30 minutes of wailing against a bullet sponge of ships because they contsantly trickle spawn more enemies once you kill the first wave, over and over and over. They lock the game behind a tiered exploration system so ur locked into playing exactly the same way and exactly how they want you to play each time, so zero replayability or variance between runs if you were looking for that aspect. \r\n\r\nTLDR: Its not worth your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game.  The freedom of design for the ships is a big draw, the tons of bullets from a bunch of turrets is great.  It has everything going for it.\n\nExcept the devs have no idea what game they want to make.  Also there are really bad bugs that have existed for years at this point that they've just admitted that they're not going to even bother trying to fix.\n\nWhen you play this game, it's clear that they're going for the X4 style of spaceship empire automation gameplay.  But they constantly make decisions that punish you for trying to automate anything.  Your ships will not defend themselves when attacked, unless you set their mission to be to attack enemies.  But that's the *only* thing they can do then.  Production automation barely exists.  You have no control over inputs in factories, so your stations will just get choked full of one input.  Do you want to remotely load up a freighter with materials and sell it manually to clear space so you can produce goods?  Can't do that either because of the docking bugs.  \n\nI gave it the best shot I could, there's a lot of this game that really has going for it.  I just think they need to decide if they're making a single hero ship game or a space empire game and commit.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Avorion - An Overhyped Space Mess with Missed Potential\n\nI really wanted to like Avorion. The premise sounded amazing: an expansive, dynamic space sandbox where I could design my own ships, blast through enemies with tons of turrets, and maybe even build a vast space empire. The freedom of ship design is a huge hook, and the chaos of firing a thousand bullets at once is undeniably satisfying. But after putting in far too many hours, it's clear: Avorion is a game that has no idea what it wants to be, and it's maddening to watch it squander its potential.\n\nLet's talk about the major issue here: the developers. They clearly have no direction. The game constantly feels like it's in an identity crisis. Are they making an open-world, action-oriented single-ship space game? Or are they aiming for a more complex, X4 style space empire simulator? The answer is neither, and unfortunately, the game is trying to do both while failing at both.\n\nAutomation—one of the key aspects I was really excited for is frustratingly broken. Your ships will not defend themselves unless you set them to a specific combat mission. That's the only way they'll engage enemies. Which, by the way, means they can’t do anything else if they're in “attack mode.” So much for having automated fleets of ships helping you out while you focus on other things. If you're thinking that maybe you can automate some production or factory work to make your empire run smoothly, think again. The game doesn't even let you control factory inputs, meaning your stations will get choked up with a single resource and grind to a halt. Want to send a freighter off to sell some materials manually and clear up space for production? Too bad. Docking bugs make that impossible.\n\nIt’s just downright broken. I had issues that had been reported for years, and when I looked into it, the devs have essentially shrugged and admitted they're not fixing them. It’s like they’ve given up on ironing out the kinks while they’ve been focusing on adding more features that don’t really solve anything.\n\nI gave Avorion the best shot I could. There’s so much here that could be great if only the devs would pick a direction and stick with it. Right now, it feels like you’re playing a half-baked idea that can’t make up its mind between a solo action experience or an empire-building simulation. Until they decide, this is a game that will remain a frustrating, buggy mess.\n\nAvorion isn't bad because it’s unfinished; it’s bad because the developers are trying to do too much at once and not succeeding in any meaningful way. Until they fix the broken systems and actually commit to one vision, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Deeply unbaked. Just play X4. One of those games where I spent more time yelling at my monitor and searching discord than actually playing the game. Cool idea, hard pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What a great game ..... until its not.\n\nStory is pretty sparse and stale.\n\nGalaxy has little or no interaction between factions.\n\nPretty linear progression, which is boring.\n\nShip builder is awesome.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- missing content\r\n- everything generic\r\n- quests only few types (generic)\r\n- pregression is okay but way that things are locked is stupid\r\n- UI is very confusing, multiple menus and keys for multiple things",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing more of this game, I unfortunately cannot recommend it for a simple reason - the game does not respect your time.\n\nEverything important is on some sort of timer. It takes a few hours to rebuild your fighter wings, and it takes a few hours to mine the resources to even do that. These things can be automated, but [i]only while the server is running[/i]. If you don't leave the game running when you're not playing, you're not getting the resources or money you need to play the game properly.\n\nThe game seems to play best when the server is running 24/7, and while that's fine if you're lucky enough to find a multiplayer server to play on, that's not great for when you play single player. Unfortunately, this game never really caught on and while I've heard that there were official dedicated servers in the past, now there's just a handful of community-run servers, most of which are modded in some way.\n\nIf you have a reason to leave the game running 24/7, go for it. If not, I would advise playing something that respects your time a little better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept, poor execution. Playing in normal single player mode, you run into all sorts of pirate or enemy factions that have a magical \"block\" that stops you from being able to warp away when in serious danger. Lazy development. Also, progression to higher tiers is blocked by stupid missions or random encounters. Final boss is boring and anti-climactic. The game has a really good core behind it but the issues i mentioned drag it down too far to be considered a great game. The grind is also way too tedious. Unfortunately there is no real skill, it's all about having a bigger ship than your enemies based on how much your grind for it. I'd rather eat horse meat medium rare.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Back on the shelf where it belongs. Controls are horrible to the point of putting it away for good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The tutorial was a bit over-bearing for me. Rapidly throwing your brand new player through non-stop menus & constantly reading for the first 30 minutes, except for a couple minutes spent mining and then in combat (at least that's how long I spent before I Alt+F4'd, idk how long it truly is) it just doesn't allow enough time to actually LEARN the systems. Might try it again in the future, probably not. Space things out, devs. Allow some time to play. Slowly introduce more systems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Kind of a tedious system. It feels like more time needed to be spent polishing the mechanics to get them to work smoothly.\r\n\r\nFor example, trying to build a ship in my experience so far is a bit of a pain. The parts clip weirdly to different sections, and how parts correlate to effect seems nonintuitive. I add one block of housing space and it gives enough room for 5 crew members. I add another block of the same size and I now have enough room for 6 crew members. A third, equally sized block and there is enough room for... 6 crew members.\r\n\r\nDon't hate it, and I am sure that if I spent enough time fiddling I could get it to work, but if you are hoping for Galaxy on Fire this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its fun at first, but don't expect ANY endgame they just pad out the same thing over and over. Fights are guaranteed to take at least 30 minutes of wailing against a bullet sponge of ships because they contsantly trickle spawn more enemies once you kill the first wave, over and over and over. They lock the game behind a tiered exploration system so ur locked into playing exactly the same way and exactly how they want you to play each time, so zero replayability or variance between runs if you were looking for that aspect. \r\n\r\nTLDR: Its not worth your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't start a single player game, it says it can't connect to the server (yes, in single player). From looking for help, a lot of people have experienced this issue for a lot of years. And there's no help for it, everyone asks and no one ever answers. In particular the developer(s) have never addressed or fixed the problem.\n\nWish I'd tried this game when it was within the refund window, instead my money went for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for quite a few hours years ago. But it won't ever load anymore. It just crashes to desktop. I install t again every few months to see if it has been fixed, but it just crashes. If they ever fix it I would love to play again!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game.  The freedom of design for the ships is a big draw, the tons of bullets from a bunch of turrets is great.  It has everything going for it.\n\nExcept the devs have no idea what game they want to make.  Also there are really bad bugs that have existed for years at this point that they've just admitted that they're not going to even bother trying to fix.\n\nWhen you play this game, it's clear that they're going for the X4 style of spaceship empire automation gameplay.  But they constantly make decisions that punish you for trying to automate anything.  Your ships will not defend themselves when attacked, unless you set their mission to be to attack enemies.  But that's the *only* thing they can do then.  Production automation barely exists.  You have no control over inputs in factories, so your stations will just get choked full of one input.  Do you want to remotely load up a freighter with materials and sell it manually to clear space so you can produce goods?  Can't do that either because of the docking bugs.  \n\nI gave it the best shot I could, there's a lot of this game that really has going for it.  I just think they need to decide if they're making a single hero ship game or a space empire game and commit.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Avorion - An Overhyped Space Mess with Missed Potential\n\nI really wanted to like Avorion. The premise sounded amazing: an expansive, dynamic space sandbox where I could design my own ships, blast through enemies with tons of turrets, and maybe even build a vast space empire. The freedom of ship design is a huge hook, and the chaos of firing a thousand bullets at once is undeniably satisfying. But after putting in far too many hours, it's clear: Avorion is a game that has no idea what it wants to be, and it's maddening to watch it squander its potential.\n\nLet's talk about the major issue here: the developers. They clearly have no direction. The game constantly feels like it's in an identity crisis. Are they making an open-world, action-oriented single-ship space game? Or are they aiming for a more complex, X4 style space empire simulator? The answer is neither, and unfortunately, the game is trying to do both while failing at both.\n\nAutomation—one of the key aspects I was really excited for is frustratingly broken. Your ships will not defend themselves unless you set them to a specific combat mission. That's the only way they'll engage enemies. Which, by the way, means they can’t do anything else if they're in “attack mode.” So much for having automated fleets of ships helping you out while you focus on other things. If you're thinking that maybe you can automate some production or factory work to make your empire run smoothly, think again. The game doesn't even let you control factory inputs, meaning your stations will get choked up with a single resource and grind to a halt. Want to send a freighter off to sell some materials manually and clear up space for production? Too bad. Docking bugs make that impossible.\n\nIt’s just downright broken. I had issues that had been reported for years, and when I looked into it, the devs have essentially shrugged and admitted they're not fixing them. It’s like they’ve given up on ironing out the kinks while they’ve been focusing on adding more features that don’t really solve anything.\n\nI gave Avorion the best shot I could. There’s so much here that could be great if only the devs would pick a direction and stick with it. Right now, it feels like you’re playing a half-baked idea that can’t make up its mind between a solo action experience or an empire-building simulation. Until they decide, this is a game that will remain a frustrating, buggy mess.\n\nAvorion isn't bad because it’s unfinished; it’s bad because the developers are trying to do too much at once and not succeeding in any meaningful way. Until they fix the broken systems and actually commit to one vision, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Deeply unbaked. Just play X4. One of those games where I spent more time yelling at my monitor and searching discord than actually playing the game. Cool idea, hard pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What a great game ..... until its not.\n\nStory is pretty sparse and stale.\n\nGalaxy has little or no interaction between factions.\n\nPretty linear progression, which is boring.\n\nShip builder is awesome.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- missing content\r\n- everything generic\r\n- quests only few types (generic)\r\n- pregression is okay but way that things are locked is stupid\r\n- UI is very confusing, multiple menus and keys for multiple things",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing more of this game, I unfortunately cannot recommend it for a simple reason - the game does not respect your time.\n\nEverything important is on some sort of timer. It takes a few hours to rebuild your fighter wings, and it takes a few hours to mine the resources to even do that. These things can be automated, but [i]only while the server is running[/i]. If you don't leave the game running when you're not playing, you're not getting the resources or money you need to play the game properly.\n\nThe game seems to play best when the server is running 24/7, and while that's fine if you're lucky enough to find a multiplayer server to play on, that's not great for when you play single player. Unfortunately, this game never really caught on and while I've heard that there were official dedicated servers in the past, now there's just a handful of community-run servers, most of which are modded in some way.\n\nIf you have a reason to leave the game running 24/7, go for it. If not, I would advise playing something that respects your time a little better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept, poor execution. Playing in normal single player mode, you run into all sorts of pirate or enemy factions that have a magical \"block\" that stops you from being able to warp away when in serious danger. Lazy development. Also, progression to higher tiers is blocked by stupid missions or random encounters. Final boss is boring and anti-climactic. The game has a really good core behind it but the issues i mentioned drag it down too far to be considered a great game. The grind is also way too tedious. Unfortunately there is no real skill, it's all about having a bigger ship than your enemies based on how much your grind for it. I'd rather eat horse meat medium rare.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Back on the shelf where it belongs. Controls are horrible to the point of putting it away for good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The tutorial was a bit over-bearing for me. Rapidly throwing your brand new player through non-stop menus & constantly reading for the first 30 minutes, except for a couple minutes spent mining and then in combat (at least that's how long I spent before I Alt+F4'd, idk how long it truly is) it just doesn't allow enough time to actually LEARN the systems. Might try it again in the future, probably not. Space things out, devs. Allow some time to play. Slowly introduce more systems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Kind of a tedious system. It feels like more time needed to be spent polishing the mechanics to get them to work smoothly.\r\n\r\nFor example, trying to build a ship in my experience so far is a bit of a pain. The parts clip weirdly to different sections, and how parts correlate to effect seems nonintuitive. I add one block of housing space and it gives enough room for 5 crew members. I add another block of the same size and I now have enough room for 6 crew members. A third, equally sized block and there is enough room for... 6 crew members.\r\n\r\nDon't hate it, and I am sure that if I spent enough time fiddling I could get it to work, but if you are hoping for Galaxy on Fire this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its fun at first, but don't expect ANY endgame they just pad out the same thing over and over. Fights are guaranteed to take at least 30 minutes of wailing against a bullet sponge of ships because they contsantly trickle spawn more enemies once you kill the first wave, over and over and over. They lock the game behind a tiered exploration system so ur locked into playing exactly the same way and exactly how they want you to play each time, so zero replayability or variance between runs if you were looking for that aspect. \r\n\r\nTLDR: Its not worth your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't start a single player game, it says it can't connect to the server (yes, in single player). From looking for help, a lot of people have experienced this issue for a lot of years. And there's no help for it, everyone asks and no one ever answers. In particular the developer(s) have never addressed or fixed the problem.\n\nWish I'd tried this game when it was within the refund window, instead my money went for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for quite a few hours years ago. But it won't ever load anymore. It just crashes to desktop. I install t again every few months to see if it has been fixed, but it just crashes. If they ever fix it I would love to play again!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game.  The freedom of design for the ships is a big draw, the tons of bullets from a bunch of turrets is great.  It has everything going for it.\n\nExcept the devs have no idea what game they want to make.  Also there are really bad bugs that have existed for years at this point that they've just admitted that they're not going to even bother trying to fix.\n\nWhen you play this game, it's clear that they're going for the X4 style of spaceship empire automation gameplay.  But they constantly make decisions that punish you for trying to automate anything.  Your ships will not defend themselves when attacked, unless you set their mission to be to attack enemies.  But that's the *only* thing they can do then.  Production automation barely exists.  You have no control over inputs in factories, so your stations will just get choked full of one input.  Do you want to remotely load up a freighter with materials and sell it manually to clear space so you can produce goods?  Can't do that either because of the docking bugs.  \n\nI gave it the best shot I could, there's a lot of this game that really has going for it.  I just think they need to decide if they're making a single hero ship game or a space empire game and commit.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Avorion - An Overhyped Space Mess with Missed Potential\n\nI really wanted to like Avorion. The premise sounded amazing: an expansive, dynamic space sandbox where I could design my own ships, blast through enemies with tons of turrets, and maybe even build a vast space empire. The freedom of ship design is a huge hook, and the chaos of firing a thousand bullets at once is undeniably satisfying. But after putting in far too many hours, it's clear: Avorion is a game that has no idea what it wants to be, and it's maddening to watch it squander its potential.\n\nLet's talk about the major issue here: the developers. They clearly have no direction. The game constantly feels like it's in an identity crisis. Are they making an open-world, action-oriented single-ship space game? Or are they aiming for a more complex, X4 style space empire simulator? The answer is neither, and unfortunately, the game is trying to do both while failing at both.\n\nAutomation—one of the key aspects I was really excited for is frustratingly broken. Your ships will not defend themselves unless you set them to a specific combat mission. That's the only way they'll engage enemies. Which, by the way, means they can’t do anything else if they're in “attack mode.” So much for having automated fleets of ships helping you out while you focus on other things. If you're thinking that maybe you can automate some production or factory work to make your empire run smoothly, think again. The game doesn't even let you control factory inputs, meaning your stations will get choked up with a single resource and grind to a halt. Want to send a freighter off to sell some materials manually and clear up space for production? Too bad. Docking bugs make that impossible.\n\nIt’s just downright broken. I had issues that had been reported for years, and when I looked into it, the devs have essentially shrugged and admitted they're not fixing them. It’s like they’ve given up on ironing out the kinks while they’ve been focusing on adding more features that don’t really solve anything.\n\nI gave Avorion the best shot I could. There’s so much here that could be great if only the devs would pick a direction and stick with it. Right now, it feels like you’re playing a half-baked idea that can’t make up its mind between a solo action experience or an empire-building simulation. Until they decide, this is a game that will remain a frustrating, buggy mess.\n\nAvorion isn't bad because it’s unfinished; it’s bad because the developers are trying to do too much at once and not succeeding in any meaningful way. Until they fix the broken systems and actually commit to one vision, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Deeply unbaked. Just play X4. One of those games where I spent more time yelling at my monitor and searching discord than actually playing the game. Cool idea, hard pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What a great game ..... until its not.\n\nStory is pretty sparse and stale.\n\nGalaxy has little or no interaction between factions.\n\nPretty linear progression, which is boring.\n\nShip builder is awesome.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- missing content\r\n- everything generic\r\n- quests only few types (generic)\r\n- pregression is okay but way that things are locked is stupid\r\n- UI is very confusing, multiple menus and keys for multiple things",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing more of this game, I unfortunately cannot recommend it for a simple reason - the game does not respect your time.\n\nEverything important is on some sort of timer. It takes a few hours to rebuild your fighter wings, and it takes a few hours to mine the resources to even do that. These things can be automated, but [i]only while the server is running[/i]. If you don't leave the game running when you're not playing, you're not getting the resources or money you need to play the game properly.\n\nThe game seems to play best when the server is running 24/7, and while that's fine if you're lucky enough to find a multiplayer server to play on, that's not great for when you play single player. Unfortunately, this game never really caught on and while I've heard that there were official dedicated servers in the past, now there's just a handful of community-run servers, most of which are modded in some way.\n\nIf you have a reason to leave the game running 24/7, go for it. If not, I would advise playing something that respects your time a little better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept, poor execution. Playing in normal single player mode, you run into all sorts of pirate or enemy factions that have a magical \"block\" that stops you from being able to warp away when in serious danger. Lazy development. Also, progression to higher tiers is blocked by stupid missions or random encounters. Final boss is boring and anti-climactic. The game has a really good core behind it but the issues i mentioned drag it down too far to be considered a great game. The grind is also way too tedious. Unfortunately there is no real skill, it's all about having a bigger ship than your enemies based on how much your grind for it. I'd rather eat horse meat medium rare.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Back on the shelf where it belongs. Controls are horrible to the point of putting it away for good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The tutorial was a bit over-bearing for me. Rapidly throwing your brand new player through non-stop menus & constantly reading for the first 30 minutes, except for a couple minutes spent mining and then in combat (at least that's how long I spent before I Alt+F4'd, idk how long it truly is) it just doesn't allow enough time to actually LEARN the systems. Might try it again in the future, probably not. Space things out, devs. Allow some time to play. Slowly introduce more systems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Kind of a tedious system. It feels like more time needed to be spent polishing the mechanics to get them to work smoothly.\r\n\r\nFor example, trying to build a ship in my experience so far is a bit of a pain. The parts clip weirdly to different sections, and how parts correlate to effect seems nonintuitive. I add one block of housing space and it gives enough room for 5 crew members. I add another block of the same size and I now have enough room for 6 crew members. A third, equally sized block and there is enough room for... 6 crew members.\r\n\r\nDon't hate it, and I am sure that if I spent enough time fiddling I could get it to work, but if you are hoping for Galaxy on Fire this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its fun at first, but don't expect ANY endgame they just pad out the same thing over and over. Fights are guaranteed to take at least 30 minutes of wailing against a bullet sponge of ships because they contsantly trickle spawn more enemies once you kill the first wave, over and over and over. They lock the game behind a tiered exploration system so ur locked into playing exactly the same way and exactly how they want you to play each time, so zero replayability or variance between runs if you were looking for that aspect. \r\n\r\nTLDR: Its not worth your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't start a single player game, it says it can't connect to the server (yes, in single player). From looking for help, a lot of people have experienced this issue for a lot of years. And there's no help for it, everyone asks and no one ever answers. In particular the developer(s) have never addressed or fixed the problem.\n\nWish I'd tried this game when it was within the refund window, instead my money went for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for quite a few hours years ago. But it won't ever load anymore. It just crashes to desktop. I install t again every few months to see if it has been fixed, but it just crashes. If they ever fix it I would love to play again!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game.  The freedom of design for the ships is a big draw, the tons of bullets from a bunch of turrets is great.  It has everything going for it.\n\nExcept the devs have no idea what game they want to make.  Also there are really bad bugs that have existed for years at this point that they've just admitted that they're not going to even bother trying to fix.\n\nWhen you play this game, it's clear that they're going for the X4 style of spaceship empire automation gameplay.  But they constantly make decisions that punish you for trying to automate anything.  Your ships will not defend themselves when attacked, unless you set their mission to be to attack enemies.  But that's the *only* thing they can do then.  Production automation barely exists.  You have no control over inputs in factories, so your stations will just get choked full of one input.  Do you want to remotely load up a freighter with materials and sell it manually to clear space so you can produce goods?  Can't do that either because of the docking bugs.  \n\nI gave it the best shot I could, there's a lot of this game that really has going for it.  I just think they need to decide if they're making a single hero ship game or a space empire game and commit.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Avorion - An Overhyped Space Mess with Missed Potential\n\nI really wanted to like Avorion. The premise sounded amazing: an expansive, dynamic space sandbox where I could design my own ships, blast through enemies with tons of turrets, and maybe even build a vast space empire. The freedom of ship design is a huge hook, and the chaos of firing a thousand bullets at once is undeniably satisfying. But after putting in far too many hours, it's clear: Avorion is a game that has no idea what it wants to be, and it's maddening to watch it squander its potential.\n\nLet's talk about the major issue here: the developers. They clearly have no direction. The game constantly feels like it's in an identity crisis. Are they making an open-world, action-oriented single-ship space game? Or are they aiming for a more complex, X4 style space empire simulator? The answer is neither, and unfortunately, the game is trying to do both while failing at both.\n\nAutomation—one of the key aspects I was really excited for is frustratingly broken. Your ships will not defend themselves unless you set them to a specific combat mission. That's the only way they'll engage enemies. Which, by the way, means they can’t do anything else if they're in “attack mode.” So much for having automated fleets of ships helping you out while you focus on other things. If you're thinking that maybe you can automate some production or factory work to make your empire run smoothly, think again. The game doesn't even let you control factory inputs, meaning your stations will get choked up with a single resource and grind to a halt. Want to send a freighter off to sell some materials manually and clear up space for production? Too bad. Docking bugs make that impossible.\n\nIt’s just downright broken. I had issues that had been reported for years, and when I looked into it, the devs have essentially shrugged and admitted they're not fixing them. It’s like they’ve given up on ironing out the kinks while they’ve been focusing on adding more features that don’t really solve anything.\n\nI gave Avorion the best shot I could. There’s so much here that could be great if only the devs would pick a direction and stick with it. Right now, it feels like you’re playing a half-baked idea that can’t make up its mind between a solo action experience or an empire-building simulation. Until they decide, this is a game that will remain a frustrating, buggy mess.\n\nAvorion isn't bad because it’s unfinished; it’s bad because the developers are trying to do too much at once and not succeeding in any meaningful way. Until they fix the broken systems and actually commit to one vision, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Deeply unbaked. Just play X4. One of those games where I spent more time yelling at my monitor and searching discord than actually playing the game. Cool idea, hard pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What a great game ..... until its not.\n\nStory is pretty sparse and stale.\n\nGalaxy has little or no interaction between factions.\n\nPretty linear progression, which is boring.\n\nShip builder is awesome.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- missing content\r\n- everything generic\r\n- quests only few types (generic)\r\n- pregression is okay but way that things are locked is stupid\r\n- UI is very confusing, multiple menus and keys for multiple things",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing more of this game, I unfortunately cannot recommend it for a simple reason - the game does not respect your time.\n\nEverything important is on some sort of timer. It takes a few hours to rebuild your fighter wings, and it takes a few hours to mine the resources to even do that. These things can be automated, but [i]only while the server is running[/i]. If you don't leave the game running when you're not playing, you're not getting the resources or money you need to play the game properly.\n\nThe game seems to play best when the server is running 24/7, and while that's fine if you're lucky enough to find a multiplayer server to play on, that's not great for when you play single player. Unfortunately, this game never really caught on and while I've heard that there were official dedicated servers in the past, now there's just a handful of community-run servers, most of which are modded in some way.\n\nIf you have a reason to leave the game running 24/7, go for it. If not, I would advise playing something that respects your time a little better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept, poor execution. Playing in normal single player mode, you run into all sorts of pirate or enemy factions that have a magical \"block\" that stops you from being able to warp away when in serious danger. Lazy development. Also, progression to higher tiers is blocked by stupid missions or random encounters. Final boss is boring and anti-climactic. The game has a really good core behind it but the issues i mentioned drag it down too far to be considered a great game. The grind is also way too tedious. Unfortunately there is no real skill, it's all about having a bigger ship than your enemies based on how much your grind for it. I'd rather eat horse meat medium rare.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Back on the shelf where it belongs. Controls are horrible to the point of putting it away for good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The tutorial was a bit over-bearing for me. Rapidly throwing your brand new player through non-stop menus & constantly reading for the first 30 minutes, except for a couple minutes spent mining and then in combat (at least that's how long I spent before I Alt+F4'd, idk how long it truly is) it just doesn't allow enough time to actually LEARN the systems. Might try it again in the future, probably not. Space things out, devs. Allow some time to play. Slowly introduce more systems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Kind of a tedious system. It feels like more time needed to be spent polishing the mechanics to get them to work smoothly.\r\n\r\nFor example, trying to build a ship in my experience so far is a bit of a pain. The parts clip weirdly to different sections, and how parts correlate to effect seems nonintuitive. I add one block of housing space and it gives enough room for 5 crew members. I add another block of the same size and I now have enough room for 6 crew members. A third, equally sized block and there is enough room for... 6 crew members.\r\n\r\nDon't hate it, and I am sure that if I spent enough time fiddling I could get it to work, but if you are hoping for Galaxy on Fire this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its fun at first, but don't expect ANY endgame they just pad out the same thing over and over. Fights are guaranteed to take at least 30 minutes of wailing against a bullet sponge of ships because they contsantly trickle spawn more enemies once you kill the first wave, over and over and over. They lock the game behind a tiered exploration system so ur locked into playing exactly the same way and exactly how they want you to play each time, so zero replayability or variance between runs if you were looking for that aspect. \r\n\r\nTLDR: Its not worth your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't start a single player game, it says it can't connect to the server (yes, in single player). From looking for help, a lot of people have experienced this issue for a lot of years. And there's no help for it, everyone asks and no one ever answers. In particular the developer(s) have never addressed or fixed the problem.\n\nWish I'd tried this game when it was within the refund window, instead my money went for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for quite a few hours years ago. But it won't ever load anymore. It just crashes to desktop. I install t again every few months to see if it has been fixed, but it just crashes. If they ever fix it I would love to play again!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game.  The freedom of design for the ships is a big draw, the tons of bullets from a bunch of turrets is great.  It has everything going for it.\n\nExcept the devs have no idea what game they want to make.  Also there are really bad bugs that have existed for years at this point that they've just admitted that they're not going to even bother trying to fix.\n\nWhen you play this game, it's clear that they're going for the X4 style of spaceship empire automation gameplay.  But they constantly make decisions that punish you for trying to automate anything.  Your ships will not defend themselves when attacked, unless you set their mission to be to attack enemies.  But that's the *only* thing they can do then.  Production automation barely exists.  You have no control over inputs in factories, so your stations will just get choked full of one input.  Do you want to remotely load up a freighter with materials and sell it manually to clear space so you can produce goods?  Can't do that either because of the docking bugs.  \n\nI gave it the best shot I could, there's a lot of this game that really has going for it.  I just think they need to decide if they're making a single hero ship game or a space empire game and commit.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Avorion - An Overhyped Space Mess with Missed Potential\n\nI really wanted to like Avorion. The premise sounded amazing: an expansive, dynamic space sandbox where I could design my own ships, blast through enemies with tons of turrets, and maybe even build a vast space empire. The freedom of ship design is a huge hook, and the chaos of firing a thousand bullets at once is undeniably satisfying. But after putting in far too many hours, it's clear: Avorion is a game that has no idea what it wants to be, and it's maddening to watch it squander its potential.\n\nLet's talk about the major issue here: the developers. They clearly have no direction. The game constantly feels like it's in an identity crisis. Are they making an open-world, action-oriented single-ship space game? Or are they aiming for a more complex, X4 style space empire simulator? The answer is neither, and unfortunately, the game is trying to do both while failing at both.\n\nAutomation—one of the key aspects I was really excited for is frustratingly broken. Your ships will not defend themselves unless you set them to a specific combat mission. That's the only way they'll engage enemies. Which, by the way, means they can’t do anything else if they're in “attack mode.” So much for having automated fleets of ships helping you out while you focus on other things. If you're thinking that maybe you can automate some production or factory work to make your empire run smoothly, think again. The game doesn't even let you control factory inputs, meaning your stations will get choked up with a single resource and grind to a halt. Want to send a freighter off to sell some materials manually and clear up space for production? Too bad. Docking bugs make that impossible.\n\nIt’s just downright broken. I had issues that had been reported for years, and when I looked into it, the devs have essentially shrugged and admitted they're not fixing them. It’s like they’ve given up on ironing out the kinks while they’ve been focusing on adding more features that don’t really solve anything.\n\nI gave Avorion the best shot I could. There’s so much here that could be great if only the devs would pick a direction and stick with it. Right now, it feels like you’re playing a half-baked idea that can’t make up its mind between a solo action experience or an empire-building simulation. Until they decide, this is a game that will remain a frustrating, buggy mess.\n\nAvorion isn't bad because it’s unfinished; it’s bad because the developers are trying to do too much at once and not succeeding in any meaningful way. Until they fix the broken systems and actually commit to one vision, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Deeply unbaked. Just play X4. One of those games where I spent more time yelling at my monitor and searching discord than actually playing the game. Cool idea, hard pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What a great game ..... until its not.\n\nStory is pretty sparse and stale.\n\nGalaxy has little or no interaction between factions.\n\nPretty linear progression, which is boring.\n\nShip builder is awesome.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- missing content\r\n- everything generic\r\n- quests only few types (generic)\r\n- pregression is okay but way that things are locked is stupid\r\n- UI is very confusing, multiple menus and keys for multiple things",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing more of this game, I unfortunately cannot recommend it for a simple reason - the game does not respect your time.\n\nEverything important is on some sort of timer. It takes a few hours to rebuild your fighter wings, and it takes a few hours to mine the resources to even do that. These things can be automated, but [i]only while the server is running[/i]. If you don't leave the game running when you're not playing, you're not getting the resources or money you need to play the game properly.\n\nThe game seems to play best when the server is running 24/7, and while that's fine if you're lucky enough to find a multiplayer server to play on, that's not great for when you play single player. Unfortunately, this game never really caught on and while I've heard that there were official dedicated servers in the past, now there's just a handful of community-run servers, most of which are modded in some way.\n\nIf you have a reason to leave the game running 24/7, go for it. If not, I would advise playing something that respects your time a little better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept, poor execution. Playing in normal single player mode, you run into all sorts of pirate or enemy factions that have a magical \"block\" that stops you from being able to warp away when in serious danger. Lazy development. Also, progression to higher tiers is blocked by stupid missions or random encounters. Final boss is boring and anti-climactic. The game has a really good core behind it but the issues i mentioned drag it down too far to be considered a great game. The grind is also way too tedious. Unfortunately there is no real skill, it's all about having a bigger ship than your enemies based on how much your grind for it. I'd rather eat horse meat medium rare.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Back on the shelf where it belongs. Controls are horrible to the point of putting it away for good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The tutorial was a bit over-bearing for me. Rapidly throwing your brand new player through non-stop menus & constantly reading for the first 30 minutes, except for a couple minutes spent mining and then in combat (at least that's how long I spent before I Alt+F4'd, idk how long it truly is) it just doesn't allow enough time to actually LEARN the systems. Might try it again in the future, probably not. Space things out, devs. Allow some time to play. Slowly introduce more systems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Kind of a tedious system. It feels like more time needed to be spent polishing the mechanics to get them to work smoothly.\r\n\r\nFor example, trying to build a ship in my experience so far is a bit of a pain. The parts clip weirdly to different sections, and how parts correlate to effect seems nonintuitive. I add one block of housing space and it gives enough room for 5 crew members. I add another block of the same size and I now have enough room for 6 crew members. A third, equally sized block and there is enough room for... 6 crew members.\r\n\r\nDon't hate it, and I am sure that if I spent enough time fiddling I could get it to work, but if you are hoping for Galaxy on Fire this isn't it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its fun at first, but don't expect ANY endgame they just pad out the same thing over and over. Fights are guaranteed to take at least 30 minutes of wailing against a bullet sponge of ships because they contsantly trickle spawn more enemies once you kill the first wave, over and over and over. They lock the game behind a tiered exploration system so ur locked into playing exactly the same way and exactly how they want you to play each time, so zero replayability or variance between runs if you were looking for that aspect. \r\n\r\nTLDR: Its not worth your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't start a single player game, it says it can't connect to the server (yes, in single player). From looking for help, a lot of people have experienced this issue for a lot of years. And there's no help for it, everyone asks and no one ever answers. In particular the developer(s) have never addressed or fixed the problem.\n\nWish I'd tried this game when it was within the refund window, instead my money went for nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this for quite a few hours years ago. But it won't ever load anymore. It just crashes to desktop. I install t again every few months to see if it has been fixed, but it just crashes. If they ever fix it I would love to play again!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't get it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like this game.  The freedom of design for the ships is a big draw, the tons of bullets from a bunch of turrets is great.  It has everything going for it.\n\nExcept the devs have no idea what game they want to make.  Also there are really bad bugs that have existed for years at this point that they've just admitted that they're not going to even bother trying to fix.\n\nWhen you play this game, it's clear that they're going for the X4 style of spaceship empire automation gameplay.  But they constantly make decisions that punish you for trying to automate anything.  Your ships will not defend themselves when attacked, unless you set their mission to be to attack enemies.  But that's the *only* thing they can do then.  Production automation barely exists.  You have no control over inputs in factories, so your stations will just get choked full of one input.  Do you want to remotely load up a freighter with materials and sell it manually to clear space so you can produce goods?  Can't do that either because of the docking bugs.  \n\nI gave it the best shot I could, there's a lot of this game that really has going for it.  I just think they need to decide if they're making a single hero ship game or a space empire game and commit.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Avorion - An Overhyped Space Mess with Missed Potential\n\nI really wanted to like Avorion. The premise sounded amazing: an expansive, dynamic space sandbox where I could design my own ships, blast through enemies with tons of turrets, and maybe even build a vast space empire. The freedom of ship design is a huge hook, and the chaos of firing a thousand bullets at once is undeniably satisfying. But after putting in far too many hours, it's clear: Avorion is a game that has no idea what it wants to be, and it's maddening to watch it squander its potential.\n\nLet's talk about the major issue here: the developers. They clearly have no direction. The game constantly feels like it's in an identity crisis. Are they making an open-world, action-oriented single-ship space game? Or are they aiming for a more complex, X4 style space empire simulator? The answer is neither, and unfortunately, the game is trying to do both while failing at both.\n\nAutomation—one of the key aspects I was really excited for is frustratingly broken. Your ships will not defend themselves unless you set them to a specific combat mission. That's the only way they'll engage enemies. Which, by the way, means they can’t do anything else if they're in “attack mode.” So much for having automated fleets of ships helping you out while you focus on other things. If you're thinking that maybe you can automate some production or factory work to make your empire run smoothly, think again. The game doesn't even let you control factory inputs, meaning your stations will get choked up with a single resource and grind to a halt. Want to send a freighter off to sell some materials manually and clear up space for production? Too bad. Docking bugs make that impossible.\n\nIt’s just downright broken. I had issues that had been reported for years, and when I looked into it, the devs have essentially shrugged and admitted they're not fixing them. It’s like they’ve given up on ironing out the kinks while they’ve been focusing on adding more features that don’t really solve anything.\n\nI gave Avorion the best shot I could. There’s so much here that could be great if only the devs would pick a direction and stick with it. Right now, it feels like you’re playing a half-baked idea that can’t make up its mind between a solo action experience or an empire-building simulation. Until they decide, this is a game that will remain a frustrating, buggy mess.\n\nAvorion isn't bad because it’s unfinished; it’s bad because the developers are trying to do too much at once and not succeeding in any meaningful way. Until they fix the broken systems and actually commit to one vision, I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game has some great ideas. Its a shame they aren't implemented well at all. \r\n\r\nFor some reason if you want to play the game at all, even single player the game must create a server on your computer that you have to connect to. I don't know how they've managed to create a game with connection issues to a server running on my local machine but they've done it, so thats interesting.\r\n\r\nThe game is just a buggy mess all around though. Like workshop items don't appear in the correct folder if at all. The devs, when asked about this issue were like \"idk lmao\" and have never fixed this all these years later.\r\n\r\nThe ship building in this game is so obtuse it borders on esoteric. Voxels behave seemingly at random, where two shapes that fit together at a certain scale will not when scaled up. I've been told that the game tracks the sizes to the 0.01th degree which, thats cool and all but am I playing a game or am I doing geometry homework? The snapping that the game uses also just sometimes doesn't work.\r\n\r\nI really want to like this game but its just kinda ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Deeply unbaked. Just play X4. One of those games where I spent more time yelling at my monitor and searching discord than actually playing the game. Cool idea, hard pass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What a great game ..... until its not.\n\nStory is pretty sparse and stale.\n\nGalaxy has little or no interaction between factions.\n\nPretty linear progression, which is boring.\n\nShip builder is awesome.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "- missing content\r\n- everything generic\r\n- quests only few types (generic)\r\n- pregression is okay but way that things are locked is stupid\r\n- UI is very confusing, multiple menus and keys for multiple things",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing more of this game, I unfortunately cannot recommend it for a simple reason - the game does not respect your time.\n\nEverything important is on some sort of timer. It takes a few hours to rebuild your fighter wings, and it takes a few hours to mine the resources to even do that. These things can be automated, but [i]only while the server is running[/i]. If you don't leave the game running when you're not playing, you're not getting the resources or money you need to play the game properly.\n\nThe game seems to play best when the server is running 24/7, and while that's fine if you're lucky enough to find a multiplayer server to play on, that's not great for when you play single player. Unfortunately, this game never really caught on and while I've heard that there were official dedicated servers in the past, now there's just a handful of community-run servers, most of which are modded in some way.\n\nIf you have a reason to leave the game running 24/7, go for it. If not, I would advise playing something that respects your time a little better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game does not work with AMD GPU neither on windows nor on Bazzite. Steam probably should start filtering games which cant run on common GPUs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Avorion is a game I'd recommend if you REALLY like building, or if you have a lot of patience. Or if, like me, you like doing something else, but having a game you can check on every half hour or so that mainly just plays itself after a bit of setup.\n\nDoes that sound boring? Yeah, it kind of is. Singleplayer and multiplayer want the same thing to finish the game; a decent sized fleet of ships. And yes, more people can gather more, but it also means more ships in general, so the waiting ends up being about the same. And the numbers of resources you need just goes up more and more the further you get in, and the bigger your ships get, so eventually you're spending HOURS waiting for enough of one type to upgrade ONE ship, and then upgrade the next one, to slowly push forward, so you can do it again.\n\nYes, you could keep yourself occupied fighting pirates and doing missions and whatnot, but it's not as fast as mining, so it still boils down to a crapload of time to get the stuff needed to progress.\n\nWhich is fine... up to a point where you just kind of find the whole thing tedious, and just kind of... stop playing.\n\nI've done at least three different multiplayer games of this, and three different singleplayer ones, and the multiplayer ones have all fizzled out for the same reason: people got bored of the same grind.\n\nI've only gotten to the inner ring ONCE, and it's... just not super interesting.\n\nNow, certain mechanics are fun, and there IS some enjoyment to be had. I'll probably start up another singleplayer campaign eventually, and play it in the background a bit, and then get bored and stop for a few months, then repeat. Which I'm okay with. I'm not upset at the money or time spent. \n\nBut if you want a different experience, maybe try a different game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great concept, poor execution. Playing in normal single player mode, you run into all sorts of pirate or enemy factions that have a magical \"block\" that stops you from being able to warp away when in serious danger. Lazy development. Also, progression to higher tiers is blocked by stupid missions or random encounters. Final boss is boring and anti-climactic. The game has a really good core behind it but the issues i mentioned drag it down too far to be considered a great game. The grind is also way too tedious. Unfortunately there is no real skill, it's all about having a bigger ship than your enemies based on how much your grind for it. I'd rather eat horse meat medium rare.",
      "voted_up": false,
      "votes_helpful": 8
    }
  ]
}