{
  "positive": [
    {
      "review": "Watch dogs 2 is one of the best games I’ve ever played, and definitely a game I will never forget.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "The game was definitely good. The gunplay is the same as the first game, mostly, and you'll always be using only a couple guns throughout the game, just because you buy the best ones pretty fast. Silenced guns are superior again. The hacking is, as was the case with the first game, not remotely realistic.\r\n\r\nThe game also felt a lot shorter than the first one. Maybe that's because I did a lot less of the side content, but the main story felt shorter too. My only complaint about the story is that when [spoiler]Horatio gets killed by the Tezcas, it feels weird. The Tezcas aren't important. After you revenge-kill the leaders, that's it from them. There's no prior story interaction either. If it had been Blume or a different story-relevant antagonist, that would've been felt much better, in my opinion.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "It totally fits that vibe — open world, hacking, stealth, exploration, and that “tech rebel” energy. The way you can manipulate traffic lights, cameras, and drones is just chef’s kiss for anyone who’s into cybersecurity or coding.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I think this is the best Watch_Dogs game currently. The map is absolute beautiful and fun. The amount of stuff you can do and details this game has, is incredible! Main character tho? Its not.... that good. But its fine, the gameplay itself and world makes this game amazing!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Just as good maybe even better that the first, again can't really find a fault, found some insane random events though; witnessed a random woman get shot at by a gang then drive off // or people randomly beating each other up over a petit comment. Some funny random dialogue so the NPCs actually feel real. \n\nThough... [Spoiler] They really did my boy Horatio dirty [/Spoiler]",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Watch Dogs 2 is the best Watch Dogs u can experience \nstory is really good \nthe characters are amazing\ngameplay is really fun and really smooth\nits indeed a phenomenal game",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "When i started to play this game, literally the first time happened with me a fact which is: the game didnt get me. But! I restart the game probably for the 4th time and i focus on the story more. While i keep going, the game get me finally.\n\nMy favorit in the game and the only well actually 2 of them is Wrench and Josh. Sad Josh didnt get more credit especially in the final mission, but i get it why.\nThe only thing even makes sense i didnt get it why Horatio needed to end like that. Also dont really get it if DedSec dosent have rules technically, why Marcus is sort of a leader who telling what to do? I get it why in a way for sure.\n\nIn my opinion Watch Dogs 1 controls and optimalization is better, but the 2th looks better, more option, better parkour in a way.\n\nWhen i write my opinion about Watch Dogs 1 i had a hope about the 2 character which is Aiden and Jordi. I did get it what i wanted, but also not. Still wish Jordi get more story. He didnt really get a credit that much like who he is really, where he went after Aiden, ect, but it was good to see him again even just for 1 mission. \n\nAt the end i like the game so much especially the tiny thing at the end to control Sintara and Wrench a bit. Probably i liked more the side operations especially the dlc ones. Also nice the Knightrider reference main story at the begining. In story the game first part better, but the 2th part still good one. Hope Legion going to be good for me tho.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game it a compilation of 10’s. Great game with great vibe of internet life.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is good but I don't really like this much because sometimes it has bugs and not very optimize for Low end PC like mine , I have a GTX 1060 and my CPU is Intel core i7 6700HQ",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game to be honest. decent story (comedic , goofy). gameplay was 10/10 i really liked it. so much to do besides the main missions, i never got bored while playing it. if someone likes gta type games with some hacking twist, they should definitely try this game. you can hack almost everything + decent map.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is like playing WD1 but with a better sense of everything, devs surely gave the glimpse o actual funny autistic humor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun, action-packed, mind-bending game that I really enjoyed. It's much better than the first one. I especially liked that the character doesn't get tired from running, so I could get everywhere faster. I loved controlling the spider robot while doing missions, and the fast travel feature is great—you can get anywhere without wasting time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. \nGreat story. \nNice missions. \nAmazing city. \nTerrible driving. \n\nRecommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game of that time and now also, its way better than GTA5. Try it, and... also, it need to be the 1st game award this year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watch Dogs 2 is super fun to play. This story ain’t bad but nothing special and the best part is that you can hack almost everything and that makes the game really satisfying. Grinding isn’t annoying at all it is actually pretty chill and running around San Francisco driving exploring and using all the hacking stuff just feels awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is such a awsome game the story is kinda bad but its awsome for openworld sandbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay story with great gameplay and it is multiplayer if that's your thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] FRESH, VIVID, FUN & NAIVE [/h1]\n[h2] –PREFACE– [/h2]\nThe game of my childhood which i was able to play only much later. Upon replaying it fully i analyzed each aspect and details of it, afterwards applying proper criticizm. You have to know that the game is not serious, realistic or superbly detailed, thats for do not expect much besides main gameplay content & visuals. People would not have idea how much this game influenced on me at those early days of release, but thats another talk, anyway here are my upsides and drawbacks for this vibrant hacking adventure:\n[h3] - - - Drawbacks [/h3]\n[olist] \n[*] Graphics would flicker on certain assumably modern gpu setups. I didn't find \"natural\" fix, yet i know that mods can make it. Flickering is quite annoying if the one paying attention to backgrounds, windows and some reflections. I was able to ingore it somehow though.\n[*] Vehicle physics and overall driving. It might be better than in the first game, but not really enjoyable or impactful. (Not mentioning lack of garages and aircrafts)\n[*] Skill system. I did not find much of a skills mandatory or really useful, but i guess it depends on a playstyle.\n[*] Short length. Game includes about fifteen main missions. For me, it seemed quite quick to walkthrough in three days or so, especially if rushing. (That is what i did on a few)\n[*] Story, characters and ending. Story is not bad, rather not serious and non intricate, though turn with horatios death gave me a hope for a better consequences. All characters for the exceptions of maybe marcus, wrench and couple more just mediocre, you wouldn't find anything special or connective about them, and ending just killed me, i did not feel any fulfillment when i saw last sequence..\n[*] Naive. Again, you should not expect any realism or serious approach, thats for hacking, stealth, 3d printer, equipment carry, new dawn artifacts crackle, cyberdriver teaser and return of a car in perfect condition after bunch of crashes, aiden pierce appereance, and even the fact that there are only dogs from animals are all and more naive.\n[*] Gameplay limit. For such a huge open world you won't do anything but exploring the world (through scoutX spots, driverSF taxi missions, collecting key data or simply steering around), missions, and maybe at the very least races n multiplayer because in-game money has no value, enough amount of skill points gained while playing main operations, non practical rare vehicles, most venues to visit only once, and poor customization (not including clothing assortment).\n[/olist]\n[h3] + + + Upsides [/h3]\n[olist]\n[*] Open world. Fresh setting of san francisco filled with alive npcs, nice views, detailed enough enviroment and humor. (Separate credit goes to yards, narrow passages and rooftops in certain locations)\n[*] General and level design. It looks modern, stylish, minimal, and effective. Those dedsec ads clips, calls, news popup, map, followers, wrench etc. As of level design i really liked some building interiors and ideas like sutro tower heights, smart house, nudles area with portal alike sewer escape, satellites, blume servers, spiderbot action episode, posh penthouse etc.\n[*] Private areas to infiltrate, stealth for better way of completion, intel to know what to do, RC bot and drone, essential wanted mechanic for involving escapes, best hacking in series and lastly sometimes annoying plumer puzzles. These are main gameplay aspects and they are being pleasant or signature in one way or another.\n[*] Progression freedom. Though it won't give you much you can prep yourself for more pleasant further completion. \n[*] Additionally i will credit nice russian localization, references to different real life titles, factions, fast travel option, judas priest n ccr songs on a missions and pretty original side operations in face of 911, bottom dollar, pain job, ghost signals, always on and more.\n[/olist]\n[h2] –VERDICT– [/h2]\nWell, all in all there are quite a lot of things to breakdown and tell out after beating the entire game. It is big enough, nice looking, funny, done with solid design and some entertaining gameplay elements. Despite naivety, non serious narrative, most characters, void ending, short longevity and some non so significant gameplay limits dragged the game few stages back, my rank for [b] WATCH DOGS 2 [/b] would be solid:\n[h1] GOOD [/h1]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Considering the narratives around government data collection, that alone makes this a title worth playing. Plus it's just fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like gta bro and fun missions!\r\n\r\nvery.. fun to mod too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, truly an underrated masterpiece, also runs smoothly on the Deck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has best multiplayer and fun activitys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game when i was in a elementary school (like 8 or 7 years old). This game still sick as i remember it, recommended for those who want to be (like) a hacker and who want feel the nostalgia when play it on the PS3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has always been the best open world experience must better than the entire Watch dogs franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Simple mechanics, difficult gameplay\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game but i still have flickering issues ..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "some of the best music ive heard in a game and man is the story fire with some edgy ass gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice graphics and story but have some irritating flickering issues",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly Love this game I’ve beaten it but I don’t know why I didn’t get any achievements. I played watch dogs 1 on my console and I loved both. But I feel like I can relate more with Aiden I love the way he cares for his family and honestly I would’ve done the same. Marcus is also a pretty good mc towards the end I’m pretty sure he’s on par with Aiden or even better than him at hacking. I think we all know who they were referencing when they introduced Blume",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game World ,okay for roaming the  open world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly find this game better than GTA 5, it does have a small map but it has realism to it, depth, and also variety things to do. I rate this game 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game, awesome graphics, awesome missions, worth the money, but ill recommend buying it when its on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is one of the most feel alive game can you also make watch dogs hongkong or singapore version open world game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely bright in my mind. I love it. Its theme is so different from its brother's. The map has been extended, and more side missions have been added",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best open-world video game I ever played, I played it a lot through my brother's Ubisoft+ some years ago and I loved it, I only refunded it because it didn't run on my own personal computer at the time and I look forward to buying it again in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the last good Ubisoft games, was fun from beginning to end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beating Watch Dogs 2 on Xbox One was an absolute ride. The story is engaging, full of humor, and gives you that perfect mix of tech-savvy heist vibes with a lively San Francisco backdrop. The gameplay feels fluid, letting you hack, explore, and experiment in creative ways.\n\nWhere the game really shines for me is the multiplayer. Jumping into co-op missions and messing around with friends added hours of pure fun. The freedom to approach objectives however you like, combined with unpredictable player interactions, makes the online experience as thrilling as the single-player story.\n\nIf you enjoy open-world games with smart, flexible gameplay and a multiplayer component that actually enhances the experience, Watch Dogs 2 is a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rating: ★★★★★★★☆☆☆ (7/10)\n\nWatch Dogs 2 is a bold shift in tone for the franchise trading the dark, serious atmosphere of the first game for a colorful, rebellious, and youthful energy. After finishing the story and unlocking every achievement, I can say it’s a fun, creative, and much smoother experience overall, but one that sacrifices emotional depth for a lighter, more playful tone.\n\nStory Mode\n\nYou play as Marcus Holloway, a young hacker framed by ctOS who joins DedSec to expose corruption and fight back against corporate control. The story deals with interesting modern topics like privacy, data manipulation, and social media influence.\nMarcus is likeable and energetic, but both he and the DedSec crew often act too childish, cracking jokes even in serious moments. It fits the youthful vibe but takes away from the weight the story could have had.\nStill, the character dynamics are great, and some missions manage to balance humor and drama nicely though I personally prefer the darker tone and maturity of Aiden Pearce’s story in the first game.\n\nOpen World\n\nSan Francisco looks amazing. It’s bright, colorful, and full of personality from the steep streets and beaches to Silicon Valley’s high tech offices and Oakland’s gritty corners. The city feels alive and distinct, and a different style unlike Chicago’s moody realism.\nAnd unlike the first game, side missions are far less repetitive here. There’s a great variety of hacking operations, infiltration contracts, and exploration based tasks that actually feel meaningful and fun.\nOne of the best examples is the mission where you have to free Aiden Pearce from the Bratva (Russian Mafia) a fantastic crossover that connects both games and shows respect for the original protagonist. It’s one of the best and most memorable side missions in the game, offering a cool callback to where it all began.\n\nGameplay\n\nThe gameplay is the sequel’s biggest strength. Watch Dogs 2 introduces new mechanics and expanded hacking systems that make missions more dynamic. The RC Jumper and Drone completely change how you can approach objectives, and the game constantly rewards creativity.\nYou can complete missions entirely through stealth, or go loud with gadgets and weapons. Hacking is faster and more versatile, and the mission design encourages experimenting with multiple solutions.\nDriving feels better than in the first game, with smoother controls and a more responsive feel. The game world gives you more freedom, and everything is just more fluid and fun to play.\n\nSoundtrack & Atmosphere\n\nThe soundtrack captures the tone perfectly energetic hip hop, electronic beats, and ambient tracks that complement the colorful world. The sound design is excellent too, with city chatter, radios, and DedSec dialogue adding life to every street corner.\n\nDLCs & Extra Content\n\nThe DLCs continue to add fun and creative content, expanding on DedSec’s missions and world. They don’t go as deep narratively, but they’re entertaining and show a little bit more of the story.\n\nAchievements 100%\n\nCompared to the first Watch Dogs, completing 100% of the game is much easier and more enjoyable. Collectibles are straightforward to find, the mission list feels well balanced, and the overall grind is reduced.\nIt’s one of those games where going for full completion feels natural rather than exhausting especially with how much variety the side missions offer this time around.\n\nConclusion\n\nWatch Dogs 2 is a fun, stylish, and technically improved sequel that refines the gameplay, expands hacking mechanics, and finally makes side content worth doing. Its lighter tone, fun characters, and open world freedom make it easy to enjoy but it does lose some of the emotional depth and seriousness that defined the first game.\nMarcus and the DedSec crew are entertaining, but sometimes they feel too much like kids playing rebels. For me, the first Watch Dogs still remains the best more mature, grounded, and emotionally engaging but Watch Dogs 2 deserves credit for improving the formula and making the gameplay more fluid and creative.\nIt’s not perfect, I also had some bugs with the shadows flickering too often and it was frustrating sometimes, but it’s definitely a good time.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "bruh it did nolt work/ all my other games worked. ubisoft fr tweaking. like bro/ i migjht as waell play legiion or some tyopa dog.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this shit is a fucking masterpiece. Changed my perspective on current world views. Big brother is always watching",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Am Amazing At Stealth.\r\nI Just Blow Everyone Up So There's No One To Detect Me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watch Dogs 2 is a fun, stylish hack-fest in a gorgeous San Francisco. The DedSec crew's vibe, the creative hacks, and the freedom to mess with the city make it a joy to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun open world and decent story with good humour",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watch Dogs 2 explores the consequences of living in a hyperconnected world shaped by technology. The story unfolds through mission-based segments, each tackling themes such as social manipulation, privacy invasion, and data collection, all tied to the powerful ctOS network. The narrative doesn’t focus on a single storyline or a specific protagonist but rather on exposing the darker sides of technology while taking down the Blume Corporation.\n\nGameplay takes a clear step forward compared to the first title in the series. The focus now lies on personal gadgets like the Quadcopter and RC Jumper, as well as on more dynamic vehicle interaction. Cars can be hacked remotely, utility vehicles can help reach high places or transport objects, and the classic hacking abilities such as communication disruption, data theft, and citywide blackouts remain satisfying to use.\n\nThe main characters are part of the hacker collective DedSec, fighting against Blume’s technological dominance. Players control Marcus, a charismatic and skilled hacker who works alongside memorable allies like Sitara, the group’s visual designer, and Wrench, the comic relief and chaotic soul of the team, defined by his unique LED mask.\n\nIn a world where technology makes life easier, Watch Dogs 2 challenges players to question the real cost of digital convenience and the hidden motives behind constant connectivity. It serves as a reminder that technology should be a tool we control, not a system that controls us.\n\nWatch Dogs 2 is both a reflection on our digital reality and a reminder of personal responsibility in the age of information.\n“This is the truth. Do what you will.” – DedSec\n\n[h1]Officially Finished.[/h1]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Китайцы взломали сервер Пентагона, вот как это было:\n1. Каждый китаец попробовал один пароль.\n2. Каждый второй пароль был \"Мао Цзедун\"\n3. На 74357181-й попытке каждого второго — сервер согласился, что у него пароль \"Мао Цзедун\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Watch Dogs 2 Review[/h1]\n\n[hr]\n[h1]Overview[/h1]\nIf you bounced off Watch Dogs 2 because it ditched the grim tone of the first game, you are missing one of the freshest open worlds around. This is bright, stylish, and wildly playful without losing the thrill of clever hacking. This game and 1 certainly both shine in different ares but neither one falls short and offers different incredible experiences. The world sings, the tools are deeper, and the missions push you to experiment. Clear thumbs up.\n\n[hr]\n[h1]Story Overview[/h1]\nYou play as Marcus Holloway, a sharp Bay Area hacker flagged by ctOS 2.0 as a future criminal. After getting burned by an algorithm, he joins DedSec to expose how companies and corrupt players abuse data at scale. The crew sets out to win followers, pull off slick ops across the Bay, and humiliate powerful targets while digging into who is really pulling strings. \n\n[hr]\n[h1]World and Atmosphere[/h1]\nSan Francisco and the wider Bay Area are gorgeous, dense, and alive. Color, crowds, street art, hilltop views, beaches, campuses, and tech campuses all feel hand placed. It is one of the most inviting city sandboxes I have played. Just roaming around is fun.\n\n[hr]\n[h1]Traversal[/h1]\nDriving is much improved over 1. It feels responsive instead of floaty, and bikes rip through traffic nicely. Marcus also has smooth parkour, so climbing rooftops and sneaking through construction yards is clean. The RC Jumper and quadcopter change how you move, letting you scout and slip into places without even stepping inside.\n\n[hr]\n[h1]Combat[/h1]\nShooting is tighter than 1 and stealth is a blast. You can go non lethal with the stun gun and melee or bring printed weapons if you want heat. The real star is hacking during combat. Overload a fuse box, distract a guard, flip a car, lock doors, and turn defenses against enemies. Missions invite creativity instead of forcing a single route.\n\n[hr]\n[h1]Systems and Progression[/h1]\nYou earn followers by doing missions and side activities, which unlocks research for new hacks and gadget upgrades. 3D printers in the hackerspace let you craft weapons and tools. Builds lean toward playstyle rather than rigid classes. You can invest in drone and jumper upgrades for stealthy heists or beef up combat hacks for chaos.\n\n[hr]\n[h1]Exploration and Collectibles[/h1]\nLots to do and most of it is fun. ScoutX selfies, Key Data for research, cash stashes, paint jobs, side ops, and unique vehicles. NetHack vision makes hunting items feel purposeful instead of busywork. The city rewards curiosity with small stories tucked into alleys and offices.\n\n[hr]\n[h1]Achievements and Completion[/h1]\nI 100 percented it. The list is friendly and mostly tied to exploration, missions, and trying systems. Nothing felt like grind wall material. If you already enjoy poking at the map and mixing stealth with gadgets, you will chip away at the list naturally.\n\n[hr]\n[h1]Performance and Stability[/h1]\nOverall solid, but note this. On some 30 and 40 series GPUs I hit flickering shadow issues. It took trial and error and some forum hunting to squash. Keep an eye out for that. Otherwise the PC version has lots of settings, looks great in motion, and ran smoothly once dialed in. The game also goes on deep sale often, so if you are cautious, snag it discounted.\n\n[hr]\n[h1]What Works[/h1]\n[list]\n[*] Stunning, lively Bay Area that begs you to explore\n[*] Hacking tools that encourage creativity in every mission\n[*] Likeable crew and upbeat tone that fits the sandbox\n[*] Better driving, cleaner shooting, and smooth stealth\n[*] RC Jumper and drone open up new approaches\n[/list]\n\n[hr]\n[h1]What Falls Short[/h1]\n[list]\n[*] Occasional PC quirks like shadow flicker on some 30/40 series GPUs\n[*] A few missions feel less open than they look at first\n[*] Tone shift may not land for players who want the grit of 1\n[/list]\n\n[hr]\n[h1]Verdict[/h1]\nBig thumbs up. If you liked the hacking in Watch Dogs 1, this is the richer, more playful version with a top tier open world and better moment to moment gameplay. Play it now if you want a creative stealth sandbox with personality. If you are on the fence, wait for a sale and dive in.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "gausa ragu gausa bimbang, ni game 8,5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak game but too short for me I want more watchdogs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too addicting it's like my version of cigarettes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time. It's sad to see the franchise get destroyed by Watch Dogs Legion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're not embracing the cringe you are not playing correctly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was worth those 6 bucks I spend on this beautiful game also hacking is k00L",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice story, fun to play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun but watch dogs 1 is better in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best entry in the series by FAR. Play it, then don't touch the other two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best open world games ever made I'm having more fun in this game than gta 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a bit diferente from previous game, but very nicely done!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played, no complaints there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a whole different game with mods!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun loke gta but with hacks\r\nks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game and the best what i play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ubisoft goes steamworks bye bye, always on DRM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best watch dogs ever played i like it very much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah ts lwk fun asl better with friends tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one who studies computer science must become homeless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever my life changed after this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, imo better then gta v",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Peak game.\r\n\r\nWay ahead of its time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the game is very fun to play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS BEST AND I LOVE IT.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Watch_Dogs videogame to date",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like a better gta ngl in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "сан франциска там типа мост прикольный",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best story game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's the best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games i have ever playes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very gud game :))))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can actually watch dogs in this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Норм,мне понравилось",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been playing it since 2018",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so chill game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is nice dont miss this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GOOD GAME YOU MUST TRY RIGHT NOW!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it does be good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's the best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The flickering are kiling me.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "currently unplayable on RTX cards because of the lighting glitch tanking performance and making shadows flicker\nconsidering the issue has been in the game for at least 2 years at this point, the shitheads at ubisoft probably just given up on it altogether",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "For all its faults, Watch Dogs 1 had nuance, and took itself seriously.  It was about a damaged man who made mistakes and had blood on his hands and conscience.  This game is a domestic terrorist simulator with whiny college frat kids who have never been told no before, does not take itself serious in not a good way, has no coherent story, and makes me ask, \"WHY?\" or \"How??\" more often than anything else. The gameplay is pretty fun, coop is its saving grace if it has one, but the characters with maybe 2 exceptions are ALL so incredibly vapid and obnoxious it is a real chore to play the game.\r\n\r\nThis game is a cringefest with a Swiss-cheese storyline and half-decent gameplay.  Even if you like playing a psychopath this game still would leave you feeling empty.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "Don't buy this game, it's just one big scam.\nThe game is fine, indeed...\nEasy Anti Cheat will crash your system again and again, and if you want to play the game, you must disable Easy Anti Cheat, which removes multiplayer!\nJust download it on torrent, DO NOT buy it. Ubisoft doesn't deserve it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To be brutally honest this game is rubbish. I loved Watchdogs 1....but this time around they've lost all the unique qualities 1 captured. The map is small, the plots are stupid and we can pretend all we want but this version is poor. Nothing is more irritating than escaping only to be shot down by enemies that aren't even in the frame. Definitely NOT worth buying. After playing RDR2 moving to this game is like trading in a Rolls Royce in for a Beetle.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's so bad. Instead of waiting for a sale, just pirate it.\r\n\r\nHaving a retrospective of the series, I remember the first game being launched at the same time with GTA V. My parents bought Watch Dogs, after it was mentioned in a news channel. The first game was an absolute novel, the emotional story up to personal reaching to the player, his or her responsibility to maintain a prefferable level on the reputation bar, the consequences of joggling with the hacking space, trying finite, but unique number of ways to approach a mission after which you'll never get truly bored of.\r\n\r\nAll of that being thrown out the window with the sequel. The story is awful, up to cringe. Poorly written, no continuity with the first game, only grazing the mention of the characters in some missions, which would be good, if the rest of the mission would be great (even the DLC's are bad), even the main characters are poorly played and chosen in order to appeal what was trendy at the time, the idea of reputation is gone, in favour of a more GTA V'y approach, without borders and lack of important decisions (on a limited map), the missions no longer require stealth, an U100 is the jack of all trades for every mission, and the map itself is absolutely boring without visual mods, I'm glad that at every checkpoint for a mission, there is a fast travel location (I believe they thought about that and made this shunt a feature). The only simmilar thing with the first game might be the bad maneuverability of the vehicles.\r\n\r\nFor eight euros at a sale, you'll be happier if you get a sandwich or whatever. And do not even touch Watch Dogs: Legion.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don't waste your money if you think you are gonna get a smooth experience as the pc port for this game is laughably bad, barely getting above 60fps on a 6700 XT what a joke.\n\nBase Game: 8/10\nPC Port: 5/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "looks visually awful, by the looks of it something broke at some point and the AAA studio cant be bothered to fix it and im not messing with files or downloading third party software to fix it, WD 1 looks so much better, crazy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This was a fun game on console. Now it's 2025 on Steam and I need to launch this game through UbiSh*t Connect with a 2-factor authentication code sent to my email every time I want to play. I don't want to play THAT bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly this game age not very well on pc. It have light flickering without any fix for it and its getting VERY annoying and hurt the eyes. I will just rebuy the game on my console.. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is made by ubisoft, do i really have to explain myself? just buy if it on a good price...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Such a bad experience, I try loading the game 5 times cause the it was bugging between both my monitors, then Then the game takes me to some kinda of broken ubisoft website so i ignored it. I then start playing and I notice that everything that is physics based is bugged, such as the enemy ragdolls and the rope weopon, they both just spasm around including the enemies flying away. \n\nI'm a bit dissapointed as heard this game was good but it had more bugs in like 5 minutes than ive every experienced in cyberpunks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dont get me wrong i love this game with my whole heart, but oh my god the quality drop on pc is hellish, i have like 400 hours on PS4 and expected the graphics to be better on pc, but no, the skybox is glitching out no metter the time of day, enemy bodies are ragdolling everywhere including into the sky, i hit a curb going like five miles an hour and me and my bike got launched out of the map. do better Ubisoft, your turning into what this games storyline is based on destroying, do not buy this game at full price\nEdit:omg its not just the skybox its EVERY FUCKING THING, WHOLE SCREEN ALMOST TURNED INTO A SEIZURE INDUCING DRUGTRIP",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hello, I heard that the game has been updated, so I repurchased it to give it a try, but it simply won't launch. I searched online for various mods and methods to make the game playable, but nothing worked. I have no other choice but to request a refund. Steam shows 20 minutes of playtime, but I couldn't even get into the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game compared to the first Watch Dog's, this was cringe and empty and i hate the entire new cast of characters in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wow there's... nothing to do besides sandbox mayhem. I knew this game lacked the digital trips of the first, but didn't realize that extended to being a game almost utterly devoid of minigames or just... side content in general. Not even chess. Also there's almost nothing good to wear. Or characters to like. Oy vavoy...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring story and confusing missions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was nothing like Watch_Dogs 1. It was boring, there where a lot of bugs and i will say it straight that this game was poorly done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game has bugs on bugs. loks like trash and feels soulless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im glad they finally released multiplayer achievements for a dead game and company.\nvery carefully thought out and planned achievements. \nhow dumb do u think i am.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Invasions still suck, and honestly it is a fun game, but i just dont like ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What doktor synšluchis said: \"currently unplayable on RTX cards because of the lighting glitch tanking performance and making shadows flicker\nconsidering the issue has been in the game for at least 2 years at this point, the idiots at ubisoft probably just given up on it altogether\" Its true dont buy if you have a RTX card! Save yourself the headache!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a AAA company making this is honestly a joke. compared to watchdogs 1 the story is worse, the gamplay is too, and the graphics are not good either. Not even mentioning the obsurd amount of bugs in the game. honestly if I were to choose from playing this or re-playing the masterpiece that was watchdogs 1 i think you know the answer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful flickering of shadows that makes the game hard to look at.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is truly unbelievable just how cringy and unlikeable the story characters are",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AVG UBISHIT NVDIA RELEASES A NEW DRIVER THEN UBISHIT PROCEEDS TO SHIT ITSELF TO ANYONE FROM UBISOFT READING THIS I HOPE UBISOFT GOES BANKRUPT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "M***ns at UBISOFT locked language settings with Russian and Chinese only, so I had to dance around my way to be able to set it to English (TY for those guides online). \nFinally launched, started playing, however, after the first mission and let to open world, I noticed that all textures were constantly flickering. It was impossible to ignore and started to feel throwing up withing few minutes of this flickering. Again spent few hours researching online, found out that this issue related to RTX 4000 and 5000s and been around for at least 2 years now. Still, none of the fixes have worked for me. \n\nGiven the fact that this is not a new game, nor in EA, it basically means that same m***ns have given up on this game, and there is no point of waiting for a fix. Refund requested.\n\nAt least learned how to use GitHub trying to fix this piece of \"art\"\n\nP.S. Why does it always with UBISOFT?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is cringe, can't even force myself to play for more than 20 minutes in one sitting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love the game played it years ago no problems, decided to play it again but basically unplayable because of flickering while playing the game super annoying when trying to enjoy a game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good but thanks to ubisoft connect i want to kms rn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no \"attended furries convention.\" horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Flickering bug sooo not worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keeps crashing when going on, and i cant log in, fuck me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BROKEN ON 5070TI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crazy flickering on a 5090. Game's cooked :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "hot garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I already have Steam, I don't need Ubishit Connect.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "За бесплатно бы взял",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "currently unplayable on RTX cards because of the lighting glitch tanking performance and making shadows flicker\nconsidering the issue has been in the game for at least 2 years at this point, the shitheads at ubisoft probably just given up on it altogether",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "From PCGamingWiki:\r\n\r\n\"With the RTX series 3000 and 4000, the game has an ongoing long-standing issue with flickering of in-game world elements. Changing the graphics settings, limiting the game's FPS or reverting to an older driver version doesn't fix or alleviate the problem at all. [b]Nvidia have reached an impasse with Ubisoft not supplying a drm free build for debugging have all but declared the issue to be in the game itself.[/b]\"\r\n\r\nBoth of the fixes on there half-worked but still left some flickering in, which makes the game extremely unpleasant to play. So... no point buying it if you have an Nvidia GPU from those lines. 5000 is also screwed, from what I hear. Thank you, Ubisoft. Very cool.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Just so you all know, if a game on steam that normally sells for $50 goes on sale for $5 it is because IT DOES NOT WORK! Ubisoft in typical Ubisoft fashion has never fixed the graphical errors for modern graphics cards. As a result there is screen flickering that is impossible to resolve. I have tried fixing the issue using tutorials online but they always want you to download files that don't exist. Unless you can tolerate the constant screen flickering, DON\"T BUY THE GAME FOR ANY PRICE! YOU HAVE BEEN WARNED.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "For all its faults, Watch Dogs 1 had nuance, and took itself seriously.  It was about a damaged man who made mistakes and had blood on his hands and conscience.  This game is a domestic terrorist simulator with whiny college frat kids who have never been told no before, does not take itself serious in not a good way, has no coherent story, and makes me ask, \"WHY?\" or \"How??\" more often than anything else. The gameplay is pretty fun, coop is its saving grace if it has one, but the characters with maybe 2 exceptions are ALL so incredibly vapid and obnoxious it is a real chore to play the game.\r\n\r\nThis game is a cringefest with a Swiss-cheese storyline and half-decent gameplay.  Even if you like playing a psychopath this game still would leave you feeling empty.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "DON'T BUY! This game is unplayable, the entire open world is flickering non stop on newer graphic cards and ubisoft doesnt care. I have tried to fix it downloading files to replace and changing settings and nothing helps",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Constant flickering in 30/40/50 series. the reason its only 5 dollars is that textures and lighting are broken. dont recommend.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "First Ubisoft deletes my account for inactivity, now I create a new one losing the games that I bought on their platform. I created a new account with the same email, played a little bit and now it says \"can't activate the product\". The game is not launching. WHY UBISOFT??? YOU'RE TRASH",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "To be brutally honest this game is rubbish. I loved Watchdogs 1....but this time around they've lost all the unique qualities 1 captured. The map is small, the plots are stupid and we can pretend all we want but this version is poor. Nothing is more irritating than escaping only to be shot down by enemies that aren't even in the frame. Definitely NOT worth buying. After playing RDR2 moving to this game is like trading in a Rolls Royce in for a Beetle.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to enjoy this game on Steam, but unfortunately I ran into a serious issue that completely ruined the experience. From the very beginning, the screen constantly flickers — almost like flashing lights — making it nearly unplayable.\r\n\r\nI tried every common fix I could find: enabling/disabling V-Sync, switching between fullscreen and borderless windowed, adjusting graphics settings, disabling overlays, reinstalling drivers, verifying game files, and even tweaking launch options. Nothing worked. The problem persists all the time, not just during lighting changes.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ubisoft as usual ruined this game, cant even launch it cuz their \"ubisoft connect\" doesnt work",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s a decent game. I played it a lot on PS4. But I do not recommend you buy this version. There is constant flickering. Everything flickers, the entire sky flickers continuously, and apparently, Ubisoft aren’t going to do anything about it either. The only way to play the game without constant flickering is to disable anti-cheat/multiplayer and add some files from a GitHub page that make the game stutter constantly instead. Yay",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "> Buy a game\n> Pay a great price\n> Forced to relogin and download **NEW** launcher\n> Gets frequent crashes and errors\n> Get a corrupt file after a few days worth of ownership\n> Reset progress\n> To top it all off the launcher is broken and cannot be reinstalled\n\nIt's best to get yourself a copy of this anywhere but Steam and Ubisoft, everything is broken and Ubisoft couldn't care less to update it unless it somehow had a Siege crossover\n\n(Multiplayer is broken by the way)\n\nBravo!!!!!!!!!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Watch out for Time played as you will need a refund., you don't know it through the tutorial. However once you hit the real world.\n\nThe sky box/shadow flickering is game breaking, found out if you have a 30-40s card its universal.\n\nUbisoft is no longer updating the game and Nvidia can't do anything on their end.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's so bad. Instead of waiting for a sale, just pirate it.\r\n\r\nHaving a retrospective of the series, I remember the first game being launched at the same time with GTA V. My parents bought Watch Dogs, after it was mentioned in a news channel. The first game was an absolute novel, the emotional story up to personal reaching to the player, his or her responsibility to maintain a prefferable level on the reputation bar, the consequences of joggling with the hacking space, trying finite, but unique number of ways to approach a mission after which you'll never get truly bored of.\r\n\r\nAll of that being thrown out the window with the sequel. The story is awful, up to cringe. Poorly written, no continuity with the first game, only grazing the mention of the characters in some missions, which would be good, if the rest of the mission would be great (even the DLC's are bad), even the main characters are poorly played and chosen in order to appeal what was trendy at the time, the idea of reputation is gone, in favour of a more GTA V'y approach, without borders and lack of important decisions (on a limited map), the missions no longer require stealth, an U100 is the jack of all trades for every mission, and the map itself is absolutely boring without visual mods, I'm glad that at every checkpoint for a mission, there is a fast travel location (I believe they thought about that and made this shunt a feature). The only simmilar thing with the first game might be the bad maneuverability of the vehicles.\r\n\r\nFor eight euros at a sale, you'll be happier if you get a sandwich or whatever. And do not even touch Watch Dogs: Legion.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I was pumped to finally try Watch Dogs 2, being a big fan of the first game. It looked like the perfect sequel. What a massive letdown. The now infamous flickering issue wrecked everything from the first minute: shadows twitching like crazy, skybox glitching out on my RTX setup. Unplayable trash, total waste of time.\n\nAlso, before anyone says \"oh but here's a file work around you can do to get it to work better\", no let me stop you right there. This is a so called \"fully release ready\" game. I bought it with my own hard-earned money and the company that released it should have made sure it works before putting it on the market. If they broke it, it is not my responsibility to fix it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "constant severe flickering, always launches on the wrong monitor and shows multiple popups on launch",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "RATING: 5/10\nAfter replaying Watch Dogs 1 several times, I decided to give its sequel a try. Unfortunately, it didn’t live up to my expectations.\n\nTo its credit, Watch Dogs 2 improves on hacking mechanics, offers a wider range of equipment, and brings more variety in side missions and online features. However, where it fell short for me was the main story. The first game delivered a gripping narrative and a VERY memorable protagonist, side cast, and antagonists. Watch Dogs 2 on the other hand had a central story that was very very difficult to follow and become attached to. It felt that I was just playing missions for the sake of finishing the game. The main cast didn’t stand out either. I never formed the kind of connection you’d normally expect with a protagonist. Aside from Wrench and the familiar returning face, the characters felt rather unremarkable. Furthermore, the \"antagonist\", if that is what you would like to call him, is also very dull and boring. \n\nThe whole Watch Dogs 2 experience felt fairly forgettable. Personally, I do not see myself coming back to play this game at all. The fact that I replay Watch Dogs 1 every year definitely speaks volumes between the two games. I’d still recommend giving it a try, perhaps you would find it far more enjoyable than I did but I personally do not think you’d be missing out on anything particularly special. That said, this is just my personal take.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't waste your money if you think you are gonna get a smooth experience as the pc port for this game is laughably bad, barely getting above 60fps on a 6700 XT what a joke.\n\nBase Game: 8/10\nPC Port: 5/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't buy this game, it's just one big scam.\nThe game is fine, indeed...\nEasy Anti Cheat will crash your system again and again, and if you want to play the game, you must disable Easy Anti Cheat, which removes multiplayer!\nDO NOT buy it. Ubisoft doesn't deserve it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "looks visually awful, by the looks of it something broke at some point and the AAA studio cant be bothered to fix it and im not messing with files or downloading third party software to fix it, WD 1 looks so much better, crazy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "actually atrocious that someone who has a huge fanbase for this game is so unwilling to fix a game but would rather release a new one instead of fixing what is wrong. Shameful, and greedy. Hoping that ubisoft just dies out and becomes a thing of the past or we actually get gaming companies to listen to the players. Without us yall got nothing. It's sad to see b.c Watch_Dogs 1 was so fun and interesting. Also...ubiplay or whatever their launcher is also is something recommended to stay far away from.. for your own sanity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This was a fun game on console. Now it's 2025 on Steam and I need to launch this game through UbiSh*t Connect with a 2-factor authentication code sent to my email every time I want to play. I don't want to play THAT bad.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sadly this game age not very well on pc. It have light flickering without any fix for it and its getting VERY annoying and hurt the eyes. I will just rebuy the game on my console.. :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is made by ubisoft, do i really have to explain myself? just buy if it on a good price...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game kontol pacthed lah qmack maen di laptop RTX flickering maen di laptop GTX aman",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I couldn't stand the constant flickering of the image due to graphical errors. According to what everyone is writing, this is a problem with modern RTX cards and has no solution. So I can't recommend the game even at a significant discount.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun, but a horrible stutter on lighting. Waste of six dollars.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sigma rule 5: NEVER patch your game to fix compatibility on modern graphics cards. ALWAYS keep your games broken on new hardware. (check pcgamingwiki for an easy fix, it's a couple lines in nvidia inspector lol)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Such a bad experience, I try loading the game 5 times cause the it was bugging between both my monitors, then Then the game takes me to some kinda of broken ubisoft website so i ignored it. I then start playing and I notice that everything that is physics based is bugged, such as the enemy ragdolls and the rope weopon, they both just spasm around including the enemies flying away. \n\nI'm a bit dissapointed as heard this game was good but it had more bugs in like 5 minutes than ive every experienced in cyberpunks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, the game in itself is actually great. Once started playing it, it crashes non stop on an hourly basis, i have a really decent pc and tried everything yet it still crashes\n\nGreat job ubisoft\n\nEdit: finshed the game, the crashes have gone even more fcking horrible now",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashes too many times, some NPCs suddenly one shot you, laggy online, Typical UBISOFT... the only good franchise it has is Far Cry.... Don't waste your time on ubisoft guys... there are much better companies out there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the laggiest game of all time! i have been trying to launch the game for 5 days and i have 2 hours of total playtime already, just for trying to launch it! besides in some regions it doesnt come with english language pack and you have to be irl hacker to change it to english! do not recommend!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has a really good style, one that I actually love, and the graphics are really good even in 2025. But the amount of bugs present in just the tutorial is insufferable. for example, almost every single ragdoll whether it is an npc or you, starts flying around sometimes. Animations for the player running do not have any smooth transition animation for strafing at all and looks extremely weird, enough to make you not want to run. Also there are some things from ubisoft that is bs, like when you boot up the game for the first time (idk if it happens more than once, I haven't booted it up since) it gives you a ton of advertisements from ubisoft. Also there are just some weird design flaws too that kinda ruin the experience, for example, when npcs die, their body will have a glow around them, as if you need to do something with it, but you actually can't. You can learn different info about npcs, that even in real life you wouldn't figure out about a person, and it doesn't seem to have any purpose in the game, so it is just there to be filler, which could confuse someone. If this game wasn't made by ubisoft and didn't have horrible bugs and design flaws like these, I would probably love this game, but it just makes it unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tries way too hard to be edgy and hip, even for 2016. marcus is boring, kitara or whatever is boring, josh is ok and wrench is just kinda annoying but i get why people like him. i love the message and what dedsec does, but it's so cringey and annoying with how they go about things. they also changed the controls way too much for this game and it hurt them so bad because it plays nothing like watch dogs 1. idk so far it's like a 4/10 for me almost 20 hours in, when at this same point in watch dogs 1, i was solidly thinking it was about a 6/10-7/10. wouldnt recommend this to anyone unless you're stuck in 2016 or like cringey dialog and poor voice acting performances.\nEdit: Just beat the game and it was probably one of the worst and most unsatisfying endings to a game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's unplayable with the new RTX 5070 ti. I diddn't finished the tutorial because many display Issues and the NPCs that fly away like rage dolls if you knock them out.\n\nI played the first game my first time two months ago. Very good game. But this Game is very buggy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]DONT BUY THIS GAME[/h1]this fucking shit unbisoft game, dont ever buy games from ubisoft from anything other than ubisoft, that is if the games were good😂i cant play this shit game, including ghost recon, steep and farcry because ubi wants even mored money to put a authentication cd key into ubisoft. whener i open the game it asks for it, i tried every thing on all games and nothing works.\nlet me say it again..\n[h1]DONT BUY UBISOFT GAMES[/h1]\njust let them go bankrupt",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dont get me wrong i love this game with my whole heart, but oh my god the quality drop on pc is hellish, i have like 400 hours on PS4 and expected the graphics to be better on pc, but no, the skybox is glitching out no metter the time of day, enemy bodies are ragdolling everywhere including into the sky, i hit a curb going like five miles an hour and me and my bike got launched out of the map. do better Ubisoft, your turning into what this games storyline is based on destroying, do not buy this game at full price\nEdit:omg its not just the skybox its EVERY FUCKING THING, WHOLE SCREEN ALMOST TURNED INTO A SEIZURE INDUCING DRUGTRIP",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Has an NVIDIA Splash screen yet has numerous graphical issues that cannot be resolved on RTX 3000+ graphics cards. There is a Profile Inspector \"fix\" but it doesn't seem to be consistent, shadows still flicker all over the place. Online achievements force you to play through numerous types of garbage content that's either dead or prone to freezing. Speaking of freezing - this game is full of it, cannot complete 1 mission without having the game inexplicably freeze up requiring a task manager process kill and having to re-do whatever mission again. The performance for a game this old running on hardware that can run Cyberpunk 2077 just fine is awful, to say the least. I mean seriously, if you have textures on high the game consistently stutters both from transversal stutter and just plain loading in textures??? What is this, UE5???\n\nIn other news, the gameplay is ok (however for some reason the jumper is a downgrade from Ray's in the WD1 DLC... where did the taser go???), the story's pacing is awful and it feels like you're going all over the place doing all these various \"operations\", then suddenly you get cutscenes that actually advance the main plot - there's no real consistency unlike in the first game. Characters are fine but beyond the actual DedSec crew and various NPCs allied to DedSec you find in missions, everyone else is insufferable and there's no redeeming quality to any of them... Like Lenni, who you later work with and honestly she doesn't deserve that treatment. Even the \"villains\" who are all these various big corpo figures, just too cliche and there's never any point where it's shown you're not exactly the Second Coming of Christ (DedSec were very much neutral/antagonistic in WD1 and it shows that even despite their noble goals, they can still be harmful).\n\nGame's fine if you want to burn away some free time but the 1st game is a superior experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS IS A GREAT GAME. i've played it for about a thousand hours and have it 100%ed on both playstation and xbox. i decided to try it on my PC and it flickers so much on my 4070ti. if you have an xbox or a playstation and want to play this game, PLEASE buy it there, it's a great game and i love it, it's a shame that ubisoft nowadays are profit motivated though so itll probably never be fixed without steam intervention :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hello, I heard that the game has been updated, so I repurchased it to give it a try, but it simply won't launch. I searched online for various mods and methods to make the game playable, but nothing worked. I have no other choice but to request a refund. Steam shows 20 minutes of playtime, but I couldn't even get into the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was amazing when it released for consoles, but on a modern PC it’s horrible. The worst of it is an outdoor texture/lighting flicker that is constant and unbearable, mainly on 3000/4000 series NVIDIA cards. Daytime is practically unplayable in game as its basically a strobe effect over the whole image. \n\nThere are workarounds for RTX 4000 cards, but they change game files and can break multiplayer and online features.\n\nIf you get it on sale and run it on hardware from 2016, fine. Otherwise, don’t bother. Ubisoft selling this at full price is wild energy. Don't hope on a fix further down the line, they’ve dropped all post-launch support (if they ever even bothered in the first place).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cash grab sequel. ubisoft slop. 1st game was actually good, so of course we gotta milk a successful title as much as we can.. just an hour in i could already tell no effort no soul went into this game. there are better games out there to dump 20 hours into. skip this one.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Horrible company, they can't verify my ownership of this game and Steep. I've submitted proof of purchase but they refuse to do anything about it, just terrible. Never again!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "here i though i could go back to a san francisco that isn't covered in human faeces.\r\nfuck ubisoft.\r\ngame no longer runs at all.\r\nthere are various fixes posted on reddit and such, but fuck that. i did not pay for a game that i then have to do extra crap just to get it running. not good enough.\r\nlike buying a car then having to download an operating sysetem, delete this, install that and wriggle something else just to start it.\r\nnever will i ever buy another ubi soft dick product ever again.\r\nEVER.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate this game compared to the first Watch Dog's, this was cringe and empty and i hate the entire new cast of characters in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there are so many bugs and glitches here and there and every time the game crashes if we do any intense mission repair this game guys its a fabulous game just requires some minor fixes i hope u guys do it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game will always be a hit, [b] the story is a 10/10 [/b] and the graphics held up for the most part for being a game from 2016\n\n[h1] The only problem is how buggy the game is now. [/h1]\nCalling gang members or even police on any sort of Blume employee will result in the game being stuck in a crash cycle, I had to use task manager just to close it because I couldn't close it at all using Steam or the Ubisoft menu.\n\nDuring the \"Motherload\" story mission: My game began to flicker, thought it was a problem on my end only to find out its an on going issue for the last 2 years. I am photo sensitive so having constant flashing lights on screen caused a huge headache on my end.\n\nIf you can handle some minor graphical glitching and the Gangs only working some times, than i strong recommend the game [b] but If you are sensitive to constant flashing lights past the \"motherload\" mission then I say to avoid it until there is a mod or some sort of fix. [/b]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crazy graphical issue hope they fix it soon game looked like it would have been fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really want to leave a positive review here because I love the game, however it has had a bug that causes incredibly obvious lighting flickering on newer Nvidia GPUs for YEARS, and ubisoft has done nothing to fix it. Updating to add achievements while the game is broken on a large number of systems is a slap in the face.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UI Hell. even before you get in game you need a ubisoft connect account and your pass must be between 8-16 characters..... 2 factor authentication mentions using an app but instead it just asks for your phone # for sms 2fa.... in the event you attempt to recover an account that you lost authenticator access for it makes you go though 5 or so captchas then lets you change your password but dosnt let you proceed without a backup code that was emailed to you when you enabled 2fa, unless you contact support..... \r\nNo support for passkeys.\r\n\r\ngame cant decide if its realistic or arcade physics you can plow through a phone pole a powerpole and road signage fences etc but trees even lil twig ones stop you ded.. you can blast people with a air gun that uncons them and send them flying materialize a drone or quadcopter from alternate dimensions in your pocket and all 3 has infinite ammo. apparently they drew the line at foliage. \r\n\r\nun-neccessary and obtrusive to gameplay cutscenes and non-cancelable animations. \r\nex1: you go to a location for a brief custscene that tells you to go to another location. \r\nThis could literally be an email type deal. \r\nex2 you try to pickup something and accidentally car jack someone.\r\n\r\nif you play with a controller there is no way to pause directly you have to hit escape on the keyboard or open your ingame phone and navigate to the game settings app and open it.....\r\nbut if a character is talking to the player escape cancels the audio so you have to hit it again and if it was mission audio you now get to restart the mission to hear that audio because you wanted to pause at the wrong time.\r\n\r\nif you bought DLC you get the \"sip from your trusty vault 13 canteen\" treatment.\r\ngood luck trying to read the descriptions for settings if you just started the game for the first time.\r\n\r\nif you play on linux it annoys you about out of date drivers in the top right of your screen.\r\ndespite easy anti cheat runtime being installed game does not detect EAC and multiplayer is disable However you can still play the game. \r\n\r\nits only crashed once So Far.\r\n\r\ndont recommend it but id like to at least finish the main story so i have no reason to come back to this game in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring story and confusing missions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow there's... nothing to do besides sandbox mayhem. I knew this game lacked the digital trips of the first, but didn't realize that extended to being a game almost utterly devoid of minigames or just... side content in general. Not even chess. Also there's almost nothing good to wear. Or characters to like. Oy vavoy...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game has bugs on bugs. loks like trash and feels soulless",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was nothing like Watch_Dogs 1. It was boring, there where a lot of bugs and i will say it straight that this game was poorly done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "im glad they finally released multiplayer achievements for a dead game and company.\nvery carefully thought out and planned achievements. \nhow dumb do u think i am.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Invasions still suck, and honestly it is a fun game, but i just dont like ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was super hyped to finally play Watch Dogs 2. Downloaded it here on the Ukrainian Steam region and jumped right in... only to find the entire menu and all subtitles are locked to Ukrainian and Chinese. Seriously?\nI couldn't find English or any other major language options, because the files simply aren't in this regional version.\nThis is a ridiculous, anti-consumer rule by Ubisoft. It's totally illogical. Imagine being an English speaker who legally moved to a country like Ukraine/Russia. You buy the game, change your region, and then you're stuck with a version you can't understand!\nThe language lock ruins the purchase. Until they fix this outdated garbage, save your money. I'm now forced to refund a game I was dying to play. Unacceptable!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dump company make easier thing be hard i just wanna play my legal game but you suck software making me can't play it good game but trash company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What doktor synšluchis said: \"currently unplayable on RTX cards because of the lighting glitch tanking performance and making shadows flicker\nconsidering the issue has been in the game for at least 2 years at this point, the idiots at ubisoft probably just given up on it altogether\" Its true dont buy if you have a RTX card! Save yourself the headache!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a AAA company making this is honestly a joke. compared to watchdogs 1 the story is worse, the gamplay is too, and the graphics are not good either. Not even mentioning the obsurd amount of bugs in the game. honestly if I were to choose from playing this or re-playing the masterpiece that was watchdogs 1 i think you know the answer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful flickering of shadows that makes the game hard to look at.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It is truly unbelievable just how cringy and unlikeable the story characters are",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "AVG UBISHIT NVDIA RELEASES A NEW DRIVER THEN UBISHIT PROCEEDS TO SHIT ITSELF TO ANYONE FROM UBISOFT READING THIS I HOPE UBISOFT GOES BANKRUPT",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}