{
  "positive": [
    {
      "review": "you wanna waist your time. ok play Crush Crush. i dunno why i still play this game. now my hobbies and jobs need 3 month time to lvl up wtfffff. it's so much time. but you know, i like it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very cute girls :3\nI don't play for the \"gooner\" aspect of the game or anything, as those types of things don't interest me too much, but I really like the cutesy style of the characters and the game as a whole :3 \nMy favorite characters have to be Blanche (Who gives real advice that's actually helpful) from the texting aspect of the game, and Mallory, especially in her cutesy bunny outfit. The story was really fun to play through and I look forward to earning (and buying) more game content in the future!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its like, okay. Mainly an AFK simulator. After you beat the initial plot for weekly and seasonal events it anticipates you either waste money as with most idle games, or just not complete them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game so much! All the girls are so pretty and he art style is so goooood!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute characters, funny humor, and addictive leveling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's another idle/clicker game with way too slow of a progression curve and a predatory economy. They're some quirky and fun elements to it. I personally love you can date a literal bear. I wish the developers would make the progression a little easier and not try to lock everything behind a huge paywall. Although I am not holding my breath when it comes to these types of games. I also wish when fulfilling requests they would let you select the exact amount. While I did select this game as a thumbs up just be aware it is a tacit thumbs up. \r\n\r\nP.S. I hope you have an auto-clicker.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice idle clicker id say, keeps you coming back, overall its cute and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's simple, silly, and cute. Pretty basic idle game. \r\n\r\nThe smutty parts are fine, but not particularly over the top. I reckon most people could take 'em or leave 'em.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Requires A LOT of grinding for currency, but it is fun and a very quick log on and progress for the day before work or school.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flat queens need more representation :(\n\n(gooner ahh game, but its fun)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GET The 18+ DLC before you make any decisions about in-game purchases, my friends.\r\n\r\nOtherwise yes, delightful little idler with some NSFW content that you actually have to work for, 9/10, would get chased up a tree again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its alright, overated in my opinion, but its alright.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i selfship with 3 characters because of this game lol. this writing is kinda cringe tho....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was first introduced to the [b] mobile version [/b] of this game and had been playing it for a few months before finding out about the Steam version. Honestly, I was quite [b]elated[/b] to learn about the Steam version and proceeded to download and play it immediately.\n\nTo borrow part of my review of the mobile version, I feel like this game is very [b] ingenious [/b] and [b] original [/b]. I love the creative liberties taken in this game and I love how diverse the dialogues and girls are. I also really like all the [b] Easter Eggs [/b] quite prevalent in the game even if I don't know all of them because they're quite easy to pick up on. The [b] reset mechanic [/b] is also the first of its kind in any game I've ever played, and it really is a nifty one, giving us the chance to re-experience budding romances with our favourite and memorable girls.\n\nThe UI (User Interface) is also quite superb. Everything is easy to access and navigate to, and I especially like how big everything is because I am visually impaired. Therefore, my UX (User Experience) is also very positive overall. This game does possess some nostalgia as it takes me back to the click games I used to play as a child (obviously not like this game, but children's games. Lol!). Even though all you do is click, I find myself playing this game for quite a length of time. I also like how a lot can be left up to the imagination of the player. I like imagining the settings I'd be in when interacting with the girls. I really like the supersize and wider aspect ratio of some of the photos in the album compared to the mobile view.\n\n[spoiler]I also love how the voices are automatically included in this version, whereas in the mobile version they have to be purchased with diamonds, and while not as comprehensive as in the main game, I especially love that there are even voices in the parallel world events, whereas in the mobile version there's just silence[/spoiler].\n\nConsidering that this version was released [b] 3 years prior to the mobile version [/b], I won't critique it for what it lacks. All in all, I have the same wonderful experience playing this version as I do the mobile one, even if it relies more on making purchases to acquire additional girls. It's a small price to pay anyway. I'll afford them all one day. But, all in all, a really great game. I even re-downloaded it after deleting it from mobile a couple of times because there was initially very little appeal, but now I'm here to stay. Maybe this version is even better because of its UI on larger screens. But, both have unique advantages to them, and I'll keep playing both for as long as the games run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cookie clicker but free and better with girls instead. 9/10, a must get for anyone who likes this kinda stuff and has an auto clicker installed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first downloaded it as a joke and slight curiosity but now... I think I like it. Also to be honest I do use an auto clicker some times when it just takes long (but not too long).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game! the animations are cute and the monster girls are my fave ;3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is jst cookie clicker with extra steps. and boobs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "||GAME OF THE WEEK 5 ❤️🔥 | Crush Crush Moist & Uncensored | ❤️🔥 | Categories | <:Amazing:1342097062249889832>**Gameplay** | 2/10 <:Good:1342097104071426121>**Design** | 8/10 <:Bad:1342097144936398899>**Creativity** | 2/5 |<:Bad:1342097144936398899>Rating<:Bad:1342097144936398899>| **12/25** |Personal Note| **This game is NSFW and was chosen by a poll.**  Crush Crush is a free idle clicker game, we are truly off to a great start, not to mention that the main feature of this game is a paid DLC. You can play the uncensored version for free in your browser on Nutaku if you so desire. You play as Marshmallow after he crashes his bike into Cassie. You slowly build up a relationship with Cassie by working to earn money to spend on gifts and dates, along with doing activities that build up your attributes like skydiving gives badass. As you can hopefully guess all of this requires you to wait. As your attributes and money go up so do the amount dateable girls. This game is only popular because of the attractive girls. The best part of the game (other than the nude women) is the phone flings. They are conversations you get to have with girls, sometimes the girls from the clicker side and sometimes original characters. I am grateful to have these snippets of story in an otherwise boring game. Although it doesn't feel human it is a much needed break from the grind, even when there is a wait between each message ranging from mere seconds to 4 days. There is a way to speed up the grind but it takes resetting your progress to the start and gaining reset boost. It feels like a Roblox cash grab at times. The gameplay leaves so much to be desired and the game isn't creative whatsoever. It's just gooner bait after all. The design may be great, or that could be biased but I wouldn't recommend playing this \"game\" let alone spending any money on it. Just search up the images online bro.   P.S (DLC CHARACTERS AREN'T WORTH IT)||",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played for 69 hours as of writing. Its a fun experience, but I definitely put too much time into it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played the web browser version of the game for a while.  I was happy to find this version on Steam and really enjoy it.  Fun characters, nice animations and funny dialog.  Yes, there's (animated/cartoon) nudity, but that can be switched off without detracting from the game play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You know what, i didnt expect this game to be that good. i thought it was gonna be ahh but im lowkey obsessed. infact, i thought i would hate cassie. she was kinda rude, i know i broke her ribs but she didnt have to be that rude. she should know when u lose sum ribs your waist gets slimmer, she should've thanked me. Honestly, I started ignoring her the whole game. Found her MAD annoying, i thought Quill was better cus she was a catgirl. But honestly... while I was waiting for more money, I started focusing on Cassie. I had nothing else to do. But then... I realized shes lowkey kinda peak. she lowkey my bih, i want her on my dih. BARS. I started flirting with her, her little tsundere attitude pulled me in, and when she started being nice i realized she HIGHkey a good gf. i love CASSIEEE!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Carpal Tunnel has never been so fun 10/10 no regrets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game Quill is bad asf would crack",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "so much clicking but it all worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can literally become lovers with a bear??\r\nVoice acting is pretty good too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved playing this game with my great grandpa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is straight gas.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Could be better, overall a 12/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a top 6 or 7 game on the steam market",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ABSOLUETLY AWESOME LOVED EVERY SECOND!!!!<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game with the boys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am very normal about this game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "not ashamed and never will be\n\n6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty okay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im single and i love this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "VERY good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is tuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is mid lwk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "niche bro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SO MANY MINORS (:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate the black ones",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "anime tiddies",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awsome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey laydeez",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Womrn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Moist.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not my proudest fap",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Woahhh so tuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yummy Bonnibel",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "spoczko",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My gambling addict friend said if I post a review and it gets 150 likes and 50 Awards that he will buy me a case of beer, some vodka and 1 kg of lemon So im just gonna leave this here.\n\nМой друг-игроман сказал, что если я опубликую отзыв и он наберет 150 лайков и 50 наград, он купит мне ящик пива, немного водки и 1 кг лимона, так что я просто оставлю это здесь.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't know how to explain to people that this is my second most played game on steam AND the only game where i got all achievements, but i give 10/10 because it's the best free clicker game, the texting part is my favorite thing about this game, even if it takes 7 days for the girls to reply, at least they reply unlike my ex who's been ghosting me for the past 3 years. Not very Crush Crush of her.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "I love the concept, and I had fun with everything that's free, but it makes you want to buy the other girls and that's just not for me. Still a fun game, but I would rather pay for the full game with all the girls unlocked than what has happened here.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "CRUSHED!!!\n\nFor an idle game, its good. I kinda don't play for a few days at a time, then spend all the money i've accumulated, but don't stress too much you'll complete it eventually.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I'm not a big waifu game fan, but I'm even less of a fan of companies telling me what I can and can't spend my money on. Hit max bonus and paid for the bonus booster to max it out. MasterCard can eat one, along with the other companies trying to deter us from gaming the way we want.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Fun game. Picks up. The reset ability to boost your rates is a plus, lots of idle games neglect this aspect. The NSFW DLC is nice. Main girls haven't shown their boobs yet (edit 11-13-25: final lover stage unlock will reveal NSFW scene), but the event baddies have been all NSFW. Can honestly AFK this whole game and still make progress. Comments about \"Don't play this game, chase real chicks\" are kinda odd to read. Not that hard in 2025 to fool around. The majority of people regret their life choices though and try to drag you down with them. What's hard is finding the right one to who deserves your time and love. Didn't mean for this review to become a life lesson, but it went there.  get a ton of chicks lol, and can get a ton more but I would need a forklift for the majority of them. I have standards and men should have higher standards. Look at the people from before 2000. They look like the girls in this game! So if you're a historian, I guess you should also try this game so you can be nostalgic of when humans used to have personality and standards for themselves.\n\nUpdate review 11-13-25: \nBeen \"playing\" for roughly 15.8 hours. 273/458 unlocks. Some unlocks are hidden behind paying diamonds or money to unlock specific characters. The price is not a rip-off. The characters with VCs are fairly priced IMO. The game is not P2W. Not really a leaderboard but all the events you are able to do without putting in money. I however spent money to unlock the NSFW pack (it's good for the price, but not mind-blowing like an H-game). Lots of the events will feature NSFW scenes as well if you reach specific stages (usually the last stage). It's hit or miss if you like it or not. The writing for the scenes is short but good. \n\nGame is however, pay to go quicker. But it is not pay to complete. Everything can be done by the diamonds you get and the dev gives you \"daily check-ins\" that unlock a diamond and gives you a boost, usually 1-8 hour job boost or hobby boost, which helps (hint: boost wisely). However, having spent only $7 + money to unlock another girl, most of my advancements have all come from using my diamonds wisely. So, manage your diamonds and you will go far. I've gotten 11/25 achievements so far.\n\nCan teach men how to flirt over the phone better with girls 5/5: \nBy the way, most people don't realize this, but if you study how the character texts the girls in the phone-flings, it's actually a good way to talk to girls over the phone. Trust me. I majored in English and Biology, and girls love it when you talk to them like this. Some of the options are crude, whereas others are most and reciprocal, it doesn't affect how the girl views you (in the game), but the creator/dev of the game put a lot of thought into phone-flings. Most likely to help fellow males pick up girls and to gain emotional intelligence.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "you wanna waist your time. ok play Crush Crush. i dunno why i still play this game. now my hobbies and jobs need 3 month time to lvl up wtfffff. it's so much time. but you know, i like it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very cute girls :3\nI don't play for the \"gooner\" aspect of the game or anything, as those types of things don't interest me too much, but I really like the cutesy style of the characters and the game as a whole :3 \nMy favorite characters have to be Blanche (Who gives real advice that's actually helpful) from the texting aspect of the game, and Mallory, especially in her cutesy bunny outfit. The story was really fun to play through and I look forward to earning (and buying) more game content in the future!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its like, okay. Mainly an AFK simulator. After you beat the initial plot for weekly and seasonal events it anticipates you either waste money as with most idle games, or just not complete them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Игра \"Crush Crush\" — увлекательный гибрид головоломки и симулятора отношений. Простой, но захватывающий геймплей: нужно сжимать элементы, чтобы создавать комбинации, прокачивая персонажа. Графика яркая, анимация плавная. Звуковое сопровождение приятное, но не запоминающееся. Сюжет минимальный, акцент на механике. Плюсы: доступность, разнообразие уровней, аддиктивность. Минусы: ограниченный выбор персонажей, частые рекламные вставки. Подойдет для любителей лёгких задачек. В целом — весело и времяпрепровождение на высоте.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "im absolutely hooked to this game (most of the girls being my waifus at this point :3) it kinda sucks when you do the reset that you have to start all over with each girl, but if youre dedicated then this game is perfect for you. i love how they continue to update this game and create new events where you can unlock new outfits for your characters and unlock a newly added character as well (which even if you miss the event, theyre usually added to the shop at some point) i love this game so much and i would highly recommend it to anyone who wants to try a new free game : D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So first played this over a decade ago on an ecchii website called Nutaku (or something). Only for a bit, never got too far with it. Then the Nintendo Switch release came out, and I loaded it up on my Switch out of pure curiousity\r\n\r\nDecided to grab it, again, here because I remember finding it fairly amusing. With me giggling a fair amount when going through the Switch version\r\n\r\n.... aaaaaaaaannnnndddd....\r\n\r\nWell, heads up, the games dialogue is a bit dated. Not in any way that it makes sense for the cancel police to go after it (well, there are lesbians in the game, so the ACTUAL Cancel Culture will not like this game)\r\n\r\nMore... uh... think about Disco Stu for a bit. How the whole point of that character is to be a bit of dated pastiche of sorts. Like a character who dresses like it is Victorian Times or the Renessance Faire (Steam Punk too, I guess?)--except we view Disco Stu as a bit less classy than those two other examples. The writing in this game is like a 2010s version of Disco Stu\r\n\r\nNow, if you are given a heads up going on in, the jokes have a bunch more leeway--and the game is surprisingly enjoyable still\r\n\r\nI'm playing it more as a bit of a naughty comedy where I'm going at it for more some of the jokes (most of them silly and innoculous--nothing socialological in nature). I don't know how people going in wanting to play a game with a single hand would handle it. I cannot see myself doing that too much--but that is more a personal thing\r\n\r\nFun little bit of a time waster, that I likely will be throwing more money at--because it generates various of the Happy Brain Chemicals(TM) and I need more of those. Even if it means reading stuff that has the dialogue that is like the 2010s version of Disco Stu\r\n\r\nNot really a game you put any real effort into--I would say Hush Hush is more of the game by this studio that involves any form of thought required on the players part\r\n\r\nOh gosh, right--one of the weird 2010s-ism is the notion that people generally don't think of Red Pandas when thinking about Pandas, and instead think of those liar Bears that are not actually Pandas.Panda Bears aren't actual Pandas--they just look like Pandas. Think like how Panda Whales got called \"Whale Killers\" and then \"Killer Whales\"--even though Panda Whales is the more accurate, albeit more antiquated, term for them. It is just stuff like that, which reminds you this game was made back in precedented times. Nothing upsetting--just \"oh right yeah, that was a thing people use to say\"\r\n\r\nI look forward to putting some bees towards this game. Bees are what we called Nickels way back when we tied an onion onto our belt--as was the fashion. On account of the nickels having a picture of a bee on them",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "god its so fucking addicting. all my friends hate me and i hate myself for playing so much of it but its just so fun. nsfw is mid ngl and you have to play so much for it but the actual grinding aspect of the game has fucking consumed my soul. its bringing me back to the good old days with adventure capitalist except i also get to see suggestive photos sometimes. 6/7 would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I played it on another site for at least a few hundred hours, completing everyone I had unlocked/bought excluding Brie.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game so much! All the girls are so pretty and he art style is so goooood!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute characters, funny humor, and addictive leveling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's another idle/clicker game with way too slow of a progression curve and a predatory economy. They're some quirky and fun elements to it. I personally love you can date a literal bear. I wish the developers would make the progression a little easier and not try to lock everything behind a huge paywall. Although I am not holding my breath when it comes to these types of games. I also wish when fulfilling requests they would let you select the exact amount. While I did select this game as a thumbs up just be aware it is a tacit thumbs up. \r\n\r\nP.S. I hope you have an auto-clicker.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice idle clicker id say, keeps you coming back, overall its cute and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's simple, silly, and cute. Pretty basic idle game. \r\n\r\nThe smutty parts are fine, but not particularly over the top. I reckon most people could take 'em or leave 'em.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Requires A LOT of grinding for currency, but it is fun and a very quick log on and progress for the day before work or school.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flat queens need more representation :(\n\n(gooner ahh game, but its fun)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GET The 18+ DLC before you make any decisions about in-game purchases, my friends.\r\n\r\nOtherwise yes, delightful little idler with some NSFW content that you actually have to work for, 9/10, would get chased up a tree again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a really fun game. its gooner-ish but the comedy in this and the mobile app are great for unwinding after a long day if your just done with people, plus the events are always fun even if you dont get the special girls or outfits,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't like the messages thing, super annoying, I don't read it, I skip everything, super boring and annoying to do. The game is kinda addictive, feels great after getting some achievements, because you took time to actually achieve them. I treat this game as a cool clicker :p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game to have running in the background if you're doing something. It's cute, sexy, and cozy and, if your a nerd, you'll love the amount references this game makes. This is the game to play if you don'y actually want to play something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, cute women, i dont like the bear mf, and some of the voice acting is wack, but some of the characters r cute, good 4 a clicker game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this before on my switch and only replayed it for achievements but its kinda cute :b still I'm embarrassed that I've played this don't bully me.. it's a silly game for grinding ig <3 (and a bit freaky cuz its low-key a harem- ??)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, its cute and the gacha is reasonable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game! it takes a bit to get to where you can romance all the ladies butttt it's worth it as like a backroom sometimes play game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "and i thought \"my neighbor's sister is a futanari\" was good!\nnot the most realistic game i've played, but those females are stunning! i never thought i could get so emotionally connected with 2d cartoons, but this game opened up so many doors for me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. At first it's a bit slow, but you'll eventually max out everything. Frequent events let you unlock new free dateable characters, and there are regular discounts on bundles and in-game currency. The base game is free, but I chose to support the devs by buying the 18+ DLC and a few characters - no regrets. The DLC makes the game spicier and more rewarding. The phone flings are especially hilarious: if you said those things to someone in real life they might call the police, but in this game they just laugh and say, \"Ha-ha! You're so funny! Now… take off your pants!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very cute game where you can date one girl, or all of them at once.  The phone flings are fun and the women are adorable and sweet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful idle game, especially if you have some time to kill during your lunch break at work, you'll know if you like it after a few resets, so rather quickly, and if you do you'll likely get hooked.\n\nMain difference the Steam version has is voice acting which is great, the web version does feature the NSFW stuff for free, and having collected every girl in that version I played since 2017 I was curious about how fast you could get to the credits roll on a fresh playthrough, it took a casually played run (not resetting at the points I should have and missing a few days every now and then) slightly over 6 months, all doable with the ton of diamonds you get from the girls, the daily ones and events.\n\nNew girls are added constantly (majority of which are available for free or through completing events) and the art style is amazing, if you enjoyed it as much as I and many others did, do support the team behind the game if you can,\nthey absolutely deserve it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a stupid game. I also cannot stop playing it.\nDespite the simple premise, this game is so well made. I don't play a lot of idle games, but it has to ton of mechanics I wouldn't even think of. The reset boosts can be annoying but it makes the game so much more fun, and it doesn't really take that long to get back to where you were.\nAlso, there's lore. So now I HAVE to finish the game. Y'know, for the plot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i just leave it on overnight its great! the time travel event is EXCRUCIATING but its the main gameplay we all know and love, despite feeling like I've been reset. I love this game and if I could get bearverly to just be a bear forever I would because it's literally my favorite LOL! I'm kinda sad its not showing my true playtime, because I've played around 400 hours at this point, but I can't get it to update so I suppose I'll just live with this odd glitch for now. (weird that I want to know exactly how ruined I am but whatever lol) I love it and I would only ask one thing: please give me 1000 diamonds bc I deserve it and I love this game? LMAO anyways love this game and it's gonna be my 100% hell but no regrets from me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like to say sorry all the time to win her heart but it's a very addictice fun game I can say",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I mean its alright, overated in my opinion, but its alright.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Believe it or not, this is the start of a dive into the underlying understanding of further implicit knowledge digested by myself truly an avid professional in a field most are unfamiliar in human relations psychology limited in a bachelor's hand, which could be expanded upon by better hands but involuntarily feed to your visual senses through an enlarged state due to abnormal substances that increase mental exercises in creativity that boost that iq, and an overall iq due to it's quadrant outshining, but expanding the overall self, so my credentials are accepted by the populous rounding around 80 million. Overall, this game highlights the pinnacle of how charming in perfection women can be for the men that require that type of support only in reality given by women dipped into, and brain wires intermingling and dissolving most of their personality into a real of unrealistic beauty which is brought some reality with the spectacle of love these girls bring to the alpha males in the tier of beta males, that become an alpha in their estate reality that many don't get because of realty, a mix of deep suffering and mental bliss concoction. In all, this game depresses those that had or had no had this experience and is ever lost in possibility or reawakening",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crush Crush is a humorous and flirty idle dating simulator where you aim to win the hearts of over 70 quirky and charming characters. Build your stats, unlock jobs, go on dates, send gifts, and progress relationships from Frenemy to Lover. Enjoy fully voiced dialogue, collectible pinups, phone flings, themed events, and hundreds of hours of casual gameplay. The game can progress even while idle, making it perfect for checking in occasionally or letting it play itself. Optional purchases can speed up progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trying to be as innocent as Ari and Ali on a cup of cocoa in Los Angeles a little jumbling can't hide that it is a pimp of the reverse. There is so little text that reviews of the game overwhelm the content in the actual game. The amount of lipwig it tries to throw itself is jellybananas and the self-parody is more properly called shadecest as there is no already existing loopy enough word for it. The dark psychology patterns of obscuring how much true involvement there is means you should not give it a moment as you will be ruined forever to be degenerate matter rotting away in some STEM career with no humanities left in you to cash out more money for non-existent diamonds for your-non-existent wifus because you have no spine to resist. Elsewhere people wonder what a magical world it could be if you got a private serenade of ballad of serenity but here they answer the question about \"can you cast duplicity?\" by having modular casts of molten platinum alloys. Paying 20 diamonds for 1 day of earlynaut access (to prove no FOMO) of having an inconsistent ensemble of a character that both just is getting to know me and is an old friend with me is clearly overprising.\n\nThis is a sneaky attempt to affect the minds of the masses to collapse to a single psychotrope. The abominations that are beyond labeling will still bear some small recognizable bit of measurable comprehensibility. Via this process the victims can divide the target to me-parts and other-parts. Depending how it moves them more parts become identifiable. Before many iterations it is as if the deviancy was always part of the natural biological processes of the observer. Many do not even know they are playing these kinds of projector games and the electro-magnetic-pathology or empaths for short should be identified wherever possible so that one does not fall for their tricks.\n\nStay away with your impure intentions. The idiocrasy is arriving momentarily and we need you to be the breeders to keep the flames going until then. Stay content with the cover dance genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i selfship with 3 characters because of this game lol. this writing is kinda cringe tho....",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Honestly, a shame. There's some really good stuff in here but it's just... not fun. Not as a dating sim, not as an idle game, I guess the poarn element is kind of nice because of the buildups. And it looks great! The girls are pretty. And are all of age, which is... ugh. Why do I have to write this.\r\n\r\nAnyway. What I particularly liked is that while they're still pretty shallow stereotypes that do not map very well on actual women, at least they aren't Japanese copypastes of poarnish archetypes. And some of them are really, really weird. You can date a bear. An actual female bear, not even made animu cute. A realistic, female bear. Yes, you can have sex with her, too.\r\n\r\nSo instead of having a tsundere, loli, oneesan, etc etc you have such classics as \"basic beach beetch\", gamer girl, cat girl, sporty girl...  except the way they're written, I kinda want to say that the writer never talked to a woman before. The gamer girl's entire personality is the fact that she's a gamer (an early 2010s gamer to be exact), there's a hot teacher who behaves pretty much like a roleplay persona, there's an actual incarnation of a fapgame site, and the sporty girl is literally Rainbow Dash from my My Little Pony. You can really tell when this game was made, and by who. I won't say it doesn't have a certain charm to it, though.\r\n\r\nWhat's kinda vexing about writing is that there are also \"phone flings\" (think texting simulator, with waiting and saucy pics), and some of these actually read like real flirting? Some. They're actually my favourite part of the game; you can think of them as mini visual novels. And hoo boy, there are so many. Same with the girls, to be honest. So many. I can't imagine what sort of poly saturation point you'd need to be able keep up with this many partners! Or maybe if your day consisted of 96 hours...?\r\n\r\nTbh, that might be what's going on. Since this is an idle game, you're constantly given more \"time blocks\" which define how much stuff you can do at once. Before you know it, you'll work 5 jobs, do 6 hobbies and go on dates all at once. This kinda breaks the flow of how usual dating sims work, where you slowly turn from a bottom-feeding loser to Her-Acles, the slayer of Lernean Puss. Here you just kind of... get everything, and eventually need to get even more everything because it's an idle game.\r\n\r\nBut it's not a particularly good idle game. It lacks this... hook. This thing that makes you want to make the number go up. Sure, wanting to see some titties might be a motivator, but I feel like it doesn't mix well with the idle gameplay. And since you'll also have to prestige to get anywhere, you'll have absolutely nothing for a significant amount of time, and then you'll unleash the boobonic plague. Although that's kinda how it is in life for some reason, so... points for, uh, realism?...\r\n\r\nStill. It's free, and while there technically are microtransactions, the game's relatively generous with freebies and there's no gacha mechanics whatsoever. To have the fun fun version you need to pay - I had a pass from when I tried to play Cabin Fever (which I also didn't like), so I figured, hey, why not this one a go. Mixed feelings.\r\n\r\n[url=https://store.steampowered.com/curator/42922988/]Curator page[/url]",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "The fact that the rebirth is capped at a certain point makes this game instantly lose positivty from me, which is a shame because I remember enjoying it at first. It becomes such a chore to keep going. As far as idle games go, the way this one is scaled and essentially forces you to spend paid currency near the end (Though I'd be amiss to say you can't get diamonds without paying) is inherently designed to pull you in until you're just finished, whereit hard caps you and presents you with characters who could take you days (if not [b]actual months[/b]) to properly grind out as a f2p. It's no surprise seeing this game was present on Nutaku, which has many games with similar mechanics.\n\nThe girls are cute though. But don't come into this looking to play a decent idle game. It is one, for a while, before some of the more shoddy design decisions become apparent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I started this game back when Markiplier had played Blush Blush because I thought it was a really interesting take on a clicker game, so I wanted to try both Blush Blush and Crush Crush out. I felt more ease getting into this one strangely enough. At first progression felt a bit hard, but then as I was getting a bit higher on the bonuses from resetting it had felt \"easier\". It slowly took a divebomb into being the most frustrating and tedious task, just getting all the girls you can up and then just losing EVERYTHING to only get an extremely small bonus the next time. Not including me buying the DLC on sale, I had spent about $30 just getting two x64 boosts and one x2 boost. I would've bought them sooner or just quit the game entirely if I had realized before spending 80 hours on the game that I was getting absolutely nowhere. After buying the two 64x and one 2x boosts I only had to play for a few weeks before FINALLY AFTER YEARS PLAYING THIS GAME ON MULTIPLE PLATFORMS AND DESPERATELY WANTING TO FINISH IT that I was able to get all my hobbies to max and finish the game. It will be frustrating if you try to finish this game without paying especially if you're like me who can't open the game everyday for the daily bonuses. This game is a waiting game and has you restarting over for what feels like a million times will probably make you want to crash out. I can't really say it was worth it aside from the characters looking cute. It's free though, so don't let me stop you from hitting the \"Add to Library\" button or \"Play Game\" button.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The devs have decided to start putting out AI slop instead of their already mediocre art. Buyers Beware, jerk and spend elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you cant even progress with out spending like 50+ real dollars oml its bad XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hundreds years to complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk why I played this, but I 100% it so...yeah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring as hell. I just wasted my time with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hell, actual Hell.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For male players, do, not play. This game will only leave you in deeper despair and inevitable sorrow. Save your time and dignity, when real women await you.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "Honestly, a shame. There's some really good stuff in here but it's just... not fun. Not as a dating sim, not as an idle game, I guess the poarn element is kind of nice because of the buildups. And it looks great! The girls are pretty. And are all of age, which is... ugh. Why do I have to write this.\r\n\r\nAnyway. What I particularly liked is that while they're still pretty shallow stereotypes that do not map very well on actual women, at least they aren't Japanese copypastes of poarnish archetypes. And some of them are really, really weird. You can date a bear. An actual female bear, not even made animu cute. A realistic, female bear. Yes, you can have sex with her, too.\r\n\r\nSo instead of having a tsundere, loli, oneesan, etc etc you have such classics as \"basic beach beetch\", gamer girl, cat girl, sporty girl...  except the way they're written, I kinda want to say that the writer never talked to a woman before. The gamer girl's entire personality is the fact that she's a gamer (an early 2010s gamer to be exact), there's a hot teacher who behaves pretty much like a roleplay persona, there's an actual incarnation of a fapgame site, and the sporty girl is literally Rainbow Dash from my My Little Pony. You can really tell when this game was made, and by who. I won't say it doesn't have a certain charm to it, though.\r\n\r\nWhat's kinda vexing about writing is that there are also \"phone flings\" (think texting simulator, with waiting and saucy pics), and some of these actually read like real flirting? Some. They're actually my favourite part of the game; you can think of them as mini visual novels. And hoo boy, there are so many. Same with the girls, to be honest. So many. I can't imagine what sort of poly saturation point you'd need to be able keep up with this many partners! Or maybe if your day consisted of 96 hours...?\r\n\r\nTbh, that might be what's going on. Since this is an idle game, you're constantly given more \"time blocks\" which define how much stuff you can do at once. Before you know it, you'll work 5 jobs, do 6 hobbies and go on dates all at once. This kinda breaks the flow of how usual dating sims work, where you slowly turn from a bottom-feeding loser to Her-Acles, the slayer of Lernean Puss. Here you just kind of... get everything, and eventually need to get even more everything because it's an idle game.\r\n\r\nBut it's not a particularly good idle game. It lacks this... hook. This thing that makes you want to make the number go up. Sure, wanting to see some titties might be a motivator, but I feel like it doesn't mix well with the idle gameplay. And since you'll also have to prestige to get anywhere, you'll have absolutely nothing for a significant amount of time, and then you'll unleash the boobonic plague. Although that's kinda how it is in life for some reason, so... points for, uh, realism?...\r\n\r\nStill. It's free, and while there technically are microtransactions, the game's relatively generous with freebies and there's no gacha mechanics whatsoever. To have the fun fun version you need to pay - I had a pass from when I tried to play Cabin Fever (which I also didn't like), so I figured, hey, why not this one a go. Mixed feelings.\r\n\r\n[url=https://store.steampowered.com/curator/42922988/]Curator page[/url]",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "took me six years to finish this game, which is about a one hundred thousandth of the time you'd actually play without spending real money it seems\n\nif you want to put time into an anime dating sim with cute girls, okay writing, the option to full NSFW with juicy art and actual GAMEPLAY, go play huniepop 1 and 2 (skip cam studio)\n\ni am willing to try hush hush though, so good job to sad panda for moving on from this genre\n\n(and really funny that this came out the same day as DOOM)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The fact that the rebirth is capped at a certain point makes this game instantly lose positivty from me, which is a shame because I remember enjoying it at first. It becomes such a chore to keep going. As far as idle games go, the way this one is scaled and essentially forces you to spend paid currency near the end (Though I'd be amiss to say you can't get diamonds without paying) is inherently designed to pull you in until you're just finished, whereit hard caps you and presents you with characters who could take you days (if not [b]actual months[/b]) to properly grind out as a f2p. It's no surprise seeing this game was present on Nutaku, which has many games with similar mechanics.\n\nThe girls are cute though. But don't come into this looking to play a decent idle game. It is one, for a while, before some of the more shoddy design decisions become apparent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I started this game back when Markiplier had played Blush Blush because I thought it was a really interesting take on a clicker game, so I wanted to try both Blush Blush and Crush Crush out. I felt more ease getting into this one strangely enough. At first progression felt a bit hard, but then as I was getting a bit higher on the bonuses from resetting it had felt \"easier\". It slowly took a divebomb into being the most frustrating and tedious task, just getting all the girls you can up and then just losing EVERYTHING to only get an extremely small bonus the next time. Not including me buying the DLC on sale, I had spent about $30 just getting two x64 boosts and one x2 boost. I would've bought them sooner or just quit the game entirely if I had realized before spending 80 hours on the game that I was getting absolutely nowhere. After buying the two 64x and one 2x boosts I only had to play for a few weeks before FINALLY AFTER YEARS PLAYING THIS GAME ON MULTIPLE PLATFORMS AND DESPERATELY WANTING TO FINISH IT that I was able to get all my hobbies to max and finish the game. It will be frustrating if you try to finish this game without paying especially if you're like me who can't open the game everyday for the daily bonuses. This game is a waiting game and has you restarting over for what feels like a million times will probably make you want to crash out. I can't really say it was worth it aside from the characters looking cute. It's free though, so don't let me stop you from hitting the \"Add to Library\" button or \"Play Game\" button.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FREE TO PLAY PLAYERS BEWARE ! ! You are eventually going to hit a hard wall because this game has a finite amount of the currency needed to progress.\n\nI have over 390 hours in this game, so I think I’ve seen pretty much everything it has to offer for free. Crush Crush starts off fun: the characters are nice, the writing is cute and campy, and the idle mechanics are satisfying at first. But after a while, the game play eventually boils down to endless repetition and paywalls. Progression reaches a snails pace not long into the game as you're obligated to wait several hours in between milestones - which would be okay if you eventually GOT to the milestones, but much of the time your wait period is something like 15 years because you need to use time boosts which - you guessed it - cost money. The free premium currency is extremely limited, so eventually you just hit a wall and cant go any further if you don't pay for more diamonds to boost your stats. It's quite discouraging to get almost 400 hours into a game and be told there's no way for you to progress without money.\n\nI won't lie to you though - this game is doing well. But despite nearly a decade of success, the developers refused to update the game’s dated and sometimes low quality visuals. Instead of hiring new artists or refreshing the look, they just keep recycling old assets, drawing over top of them, and expecting people to pay for it.\n\nMeanwhile, they invest tons of money on other project's artwork (for example: hiring Nanoless, a very talented and expensive artist) while Crush Crush stays the exact same. The event girls feel very half-baked and are usually just re-colors of old art with a few things drawn over top of them. Further, if you miss a single event day, you can’t get the final reward unless you pay for diamonds. You're literally one and done. To me, it just feels like the devs care more about milking the game than improving it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free game and easy to play, a never ending clicker game, but I don't have the patience anymore. It's the worst time consuming game I've ever seen. And at the end, it's not even worth it. I've played soooo muuch just to get 0.1% progress. \r\nI'm not a fan of the art, so getting a \"pic\" of the girls in bikini, idc. \r\nMe, who like to tryhard nsfw games for the steam achievements, I'm not gonna spend a second on this cookie clicker anymore. Launching this game (with blush blush) was a mistake. \r\nBecause playing a game to grind it, to this point, when there is no fun left, for what ? Even if there is a some kind of end game, I would skip it. \r\n\r\nPlus, the \"gameplay\", if you can call it that. Per example, you'll need to give 314 roses to a girl, but oooh sadness when you see you cannot choose how much gifts you can give because it is a set value. \r\nGive her more you tell me ? Mmmh, not when the gift cost you 95 trillions and you gain 13 trillions over 7 days. \r\n\r\nTo play this, you need to skip real time by changing the time of your computer (or other technique) because who the hell wants to wait 56 days for an upgrade ? And an auto-clicker of course, or else gl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is such a painful cash grab that the events are annoyingly impossible without the use of gems, there are characters you cant unlock without 200 gems, that is about $20. they want 20 bucks for one character and a few outfits each. it is insane case there are about 25 characters you'd have to buy. i only play this game to waste time but it pisses me off to no end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recommend it because lately, I could reset it to get the boost because each time it takes away some of my progress and item I had unlock and even rolling back Doesn't bring them back. So, I am through with this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have mixed feelings on this game. \nthe good :\n- the characters are super cute and charming !\n- the dialogue can be pretty funny\n- fun if you like to manage things\n- bearverly\n\nthe bad :\n- takes extremely long if you don't want to spend money\n- paywalls !!1! too many of em 1!!!!1!11!!\n- gets boring at some point \n- nutaku\n\ni have been playing this game for about 2 years, i have not finished it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The devs have decided to start putting out AI slop instead of their already mediocre art. Buyers Beware, jerk and spend elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could not figure out what I'm supposed to do in this game. It looks like everything is behind some paywall. Or I just have to sit and wait. I aint gonna do neither.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Addictive at first. The new time sensitive events are very scummy and basically impossible to beat without paying. The new pinups clearly use AI art which is not disclosed in any way but clearly just another cost-cutting measure. Recommended for a bit, but not long-term.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Believe it or not, I was going to give it a positive review, but, but, but who the hell hides saving the game behind a paywall???",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "you cant even progress with out spending like 50+ real dollars oml its bad XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for your own sake, stay away! I've been sucked into this game for FAR too many hours, and i don't even really like it. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nah bruh, too much clicking and bitchin",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hundreds years to complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What the heck is that. Omg.... don't even try. Pay to win boring game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "played for 2 hours just to realize you have to pay to see naked woman, unapproved",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idk why I played this, but I 100% it so...yeah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring as hell. I just wasted my time with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hell, actual Hell.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For male players, do, not play. This game will only leave you in deeper despair and inevitable sorrow. Save your time and dignity, when real women await you.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "Honestly, a shame. There's some really good stuff in here but it's just... not fun. Not as a dating sim, not as an idle game, I guess the poarn element is kind of nice because of the buildups. And it looks great! The girls are pretty. And are all of age, which is... ugh. Why do I have to write this.\r\n\r\nAnyway. What I particularly liked is that while they're still pretty shallow stereotypes that do not map very well on actual women, at least they aren't Japanese copypastes of poarnish archetypes. And some of them are really, really weird. You can date a bear. An actual female bear, not even made animu cute. A realistic, female bear. Yes, you can have sex with her, too.\r\n\r\nSo instead of having a tsundere, loli, oneesan, etc etc you have such classics as \"basic beach beetch\", gamer girl, cat girl, sporty girl...  except the way they're written, I kinda want to say that the writer never talked to a woman before. The gamer girl's entire personality is the fact that she's a gamer (an early 2010s gamer to be exact), there's a hot teacher who behaves pretty much like a roleplay persona, there's an actual incarnation of a fapgame site, and the sporty girl is literally Rainbow Dash from my My Little Pony. You can really tell when this game was made, and by who. I won't say it doesn't have a certain charm to it, though.\r\n\r\nWhat's kinda vexing about writing is that there are also \"phone flings\" (think texting simulator, with waiting and saucy pics), and some of these actually read like real flirting? Some. They're actually my favourite part of the game; you can think of them as mini visual novels. And hoo boy, there are so many. Same with the girls, to be honest. So many. I can't imagine what sort of poly saturation point you'd need to be able keep up with this many partners! Or maybe if your day consisted of 96 hours...?\r\n\r\nTbh, that might be what's going on. Since this is an idle game, you're constantly given more \"time blocks\" which define how much stuff you can do at once. Before you know it, you'll work 5 jobs, do 6 hobbies and go on dates all at once. This kinda breaks the flow of how usual dating sims work, where you slowly turn from a bottom-feeding loser to Her-Acles, the slayer of Lernean Puss. Here you just kind of... get everything, and eventually need to get even more everything because it's an idle game.\r\n\r\nBut it's not a particularly good idle game. It lacks this... hook. This thing that makes you want to make the number go up. Sure, wanting to see some titties might be a motivator, but I feel like it doesn't mix well with the idle gameplay. And since you'll also have to prestige to get anywhere, you'll have absolutely nothing for a significant amount of time, and then you'll unleash the boobonic plague. Although that's kinda how it is in life for some reason, so... points for, uh, realism?...\r\n\r\nStill. It's free, and while there technically are microtransactions, the game's relatively generous with freebies and there's no gacha mechanics whatsoever. To have the fun fun version you need to pay - I had a pass from when I tried to play Cabin Fever (which I also didn't like), so I figured, hey, why not this one a go. Mixed feelings.\r\n\r\n[url=https://store.steampowered.com/curator/42922988/]Curator page[/url]",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "took me six years to finish this game, which is about a one hundred thousandth of the time you'd actually play without spending real money it seems\n\nif you want to put time into an anime dating sim with cute girls, okay writing, the option to full NSFW with juicy art and actual GAMEPLAY, go play huniepop 1 and 2 (skip cam studio)\n\ni am willing to try hush hush though, so good job to sad panda for moving on from this genre\n\n(and really funny that this came out the same day as DOOM)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The fact that the rebirth is capped at a certain point makes this game instantly lose positivty from me, which is a shame because I remember enjoying it at first. It becomes such a chore to keep going. As far as idle games go, the way this one is scaled and essentially forces you to spend paid currency near the end (Though I'd be amiss to say you can't get diamonds without paying) is inherently designed to pull you in until you're just finished, whereit hard caps you and presents you with characters who could take you days (if not [b]actual months[/b]) to properly grind out as a f2p. It's no surprise seeing this game was present on Nutaku, which has many games with similar mechanics.\n\nThe girls are cute though. But don't come into this looking to play a decent idle game. It is one, for a while, before some of the more shoddy design decisions become apparent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I started this game back when Markiplier had played Blush Blush because I thought it was a really interesting take on a clicker game, so I wanted to try both Blush Blush and Crush Crush out. I felt more ease getting into this one strangely enough. At first progression felt a bit hard, but then as I was getting a bit higher on the bonuses from resetting it had felt \"easier\". It slowly took a divebomb into being the most frustrating and tedious task, just getting all the girls you can up and then just losing EVERYTHING to only get an extremely small bonus the next time. Not including me buying the DLC on sale, I had spent about $30 just getting two x64 boosts and one x2 boost. I would've bought them sooner or just quit the game entirely if I had realized before spending 80 hours on the game that I was getting absolutely nowhere. After buying the two 64x and one 2x boosts I only had to play for a few weeks before FINALLY AFTER YEARS PLAYING THIS GAME ON MULTIPLE PLATFORMS AND DESPERATELY WANTING TO FINISH IT that I was able to get all my hobbies to max and finish the game. It will be frustrating if you try to finish this game without paying especially if you're like me who can't open the game everyday for the daily bonuses. This game is a waiting game and has you restarting over for what feels like a million times will probably make you want to crash out. I can't really say it was worth it aside from the characters looking cute. It's free though, so don't let me stop you from hitting the \"Add to Library\" button or \"Play Game\" button.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FREE TO PLAY PLAYERS BEWARE ! ! You are eventually going to hit a hard wall because this game has a finite amount of the currency needed to progress.\n\nI have over 390 hours in this game, so I think I’ve seen pretty much everything it has to offer for free. Crush Crush starts off fun: the characters are nice, the writing is cute and campy, and the idle mechanics are satisfying at first. But after a while, the game play eventually boils down to endless repetition and paywalls. Progression reaches a snails pace not long into the game as you're obligated to wait several hours in between milestones - which would be okay if you eventually GOT to the milestones, but much of the time your wait period is something like 15 years because you need to use time boosts which - you guessed it - cost money. The free premium currency is extremely limited, so eventually you just hit a wall and cant go any further if you don't pay for more diamonds to boost your stats. It's quite discouraging to get almost 400 hours into a game and be told there's no way for you to progress without money.\n\nI won't lie to you though - this game is doing well. But despite nearly a decade of success, the developers refused to update the game’s dated and sometimes low quality visuals. Instead of hiring new artists or refreshing the look, they just keep recycling old assets, drawing over top of them, and expecting people to pay for it.\n\nMeanwhile, they invest tons of money on other project's artwork (for example: hiring Nanoless, a very talented and expensive artist) while Crush Crush stays the exact same. The event girls feel very half-baked and are usually just re-colors of old art with a few things drawn over top of them. Further, if you miss a single event day, you can’t get the final reward unless you pay for diamonds. You're literally one and done. To me, it just feels like the devs care more about milking the game than improving it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free game and easy to play, a never ending clicker game, but I don't have the patience anymore. It's the worst time consuming game I've ever seen. And at the end, it's not even worth it. I've played soooo muuch just to get 0.1% progress. \r\nI'm not a fan of the art, so getting a \"pic\" of the girls in bikini, idc. \r\nMe, who like to tryhard nsfw games for the steam achievements, I'm not gonna spend a second on this cookie clicker anymore. Launching this game (with blush blush) was a mistake. \r\nBecause playing a game to grind it, to this point, when there is no fun left, for what ? Even if there is a some kind of end game, I would skip it. \r\n\r\nPlus, the \"gameplay\", if you can call it that. Per example, you'll need to give 314 roses to a girl, but oooh sadness when you see you cannot choose how much gifts you can give because it is a set value. \r\nGive her more you tell me ? Mmmh, not when the gift cost you 95 trillions and you gain 13 trillions over 7 days. \r\n\r\nTo play this, you need to skip real time by changing the time of your computer (or other technique) because who the hell wants to wait 56 days for an upgrade ? And an auto-clicker of course, or else gl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is such a painful cash grab that the events are annoyingly impossible without the use of gems, there are characters you cant unlock without 200 gems, that is about $20. they want 20 bucks for one character and a few outfits each. it is insane case there are about 25 characters you'd have to buy. i only play this game to waste time but it pisses me off to no end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recommend it because lately, I could reset it to get the boost because each time it takes away some of my progress and item I had unlock and even rolling back Doesn't bring them back. So, I am through with this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have mixed feelings on this game. \nthe good :\n- the characters are super cute and charming !\n- the dialogue can be pretty funny\n- fun if you like to manage things\n- bearverly\n\nthe bad :\n- takes extremely long if you don't want to spend money\n- paywalls !!1! too many of em 1!!!!1!11!!\n- gets boring at some point \n- nutaku\n\ni have been playing this game for about 2 years, i have not finished it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The devs have decided to start putting out AI slop instead of their already mediocre art. Buyers Beware, jerk and spend elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could not figure out what I'm supposed to do in this game. It looks like everything is behind some paywall. Or I just have to sit and wait. I aint gonna do neither.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Addictive at first. The new time sensitive events are very scummy and basically impossible to beat without paying. The new pinups clearly use AI art which is not disclosed in any way but clearly just another cost-cutting measure. Recommended for a bit, but not long-term.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Believe it or not, I was going to give it a positive review, but, but, but who the hell hides saving the game behind a paywall???",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "you cant even progress with out spending like 50+ real dollars oml its bad XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for your own sake, stay away! I've been sucked into this game for FAR too many hours, and i don't even really like it. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nah bruh, too much clicking and bitchin",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hundreds years to complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What the heck is that. Omg.... don't even try. Pay to win boring game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "played for 2 hours just to realize you have to pay to see naked woman, unapproved",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idk why I played this, but I 100% it so...yeah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring as hell. I just wasted my time with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hell, actual Hell.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For male players, do, not play. This game will only leave you in deeper despair and inevitable sorrow. Save your time and dignity, when real women await you.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "Honestly, a shame. There's some really good stuff in here but it's just... not fun. Not as a dating sim, not as an idle game, I guess the poarn element is kind of nice because of the buildups. And it looks great! The girls are pretty. And are all of age, which is... ugh. Why do I have to write this.\r\n\r\nAnyway. What I particularly liked is that while they're still pretty shallow stereotypes that do not map very well on actual women, at least they aren't Japanese copypastes of poarnish archetypes. And some of them are really, really weird. You can date a bear. An actual female bear, not even made animu cute. A realistic, female bear. Yes, you can have sex with her, too.\r\n\r\nSo instead of having a tsundere, loli, oneesan, etc etc you have such classics as \"basic beach beetch\", gamer girl, cat girl, sporty girl...  except the way they're written, I kinda want to say that the writer never talked to a woman before. The gamer girl's entire personality is the fact that she's a gamer (an early 2010s gamer to be exact), there's a hot teacher who behaves pretty much like a roleplay persona, there's an actual incarnation of a fapgame site, and the sporty girl is literally Rainbow Dash from my My Little Pony. You can really tell when this game was made, and by who. I won't say it doesn't have a certain charm to it, though.\r\n\r\nWhat's kinda vexing about writing is that there are also \"phone flings\" (think texting simulator, with waiting and saucy pics), and some of these actually read like real flirting? Some. They're actually my favourite part of the game; you can think of them as mini visual novels. And hoo boy, there are so many. Same with the girls, to be honest. So many. I can't imagine what sort of poly saturation point you'd need to be able keep up with this many partners! Or maybe if your day consisted of 96 hours...?\r\n\r\nTbh, that might be what's going on. Since this is an idle game, you're constantly given more \"time blocks\" which define how much stuff you can do at once. Before you know it, you'll work 5 jobs, do 6 hobbies and go on dates all at once. This kinda breaks the flow of how usual dating sims work, where you slowly turn from a bottom-feeding loser to Her-Acles, the slayer of Lernean Puss. Here you just kind of... get everything, and eventually need to get even more everything because it's an idle game.\r\n\r\nBut it's not a particularly good idle game. It lacks this... hook. This thing that makes you want to make the number go up. Sure, wanting to see some titties might be a motivator, but I feel like it doesn't mix well with the idle gameplay. And since you'll also have to prestige to get anywhere, you'll have absolutely nothing for a significant amount of time, and then you'll unleash the boobonic plague. Although that's kinda how it is in life for some reason, so... points for, uh, realism?...\r\n\r\nStill. It's free, and while there technically are microtransactions, the game's relatively generous with freebies and there's no gacha mechanics whatsoever. To have the fun fun version you need to pay - I had a pass from when I tried to play Cabin Fever (which I also didn't like), so I figured, hey, why not this one a go. Mixed feelings.\r\n\r\n[url=https://store.steampowered.com/curator/42922988/]Curator page[/url]",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "took me six years to finish this game, which is about a one hundred thousandth of the time you'd actually play without spending real money it seems\n\nif you want to put time into an anime dating sim with cute girls, okay writing, the option to full NSFW with juicy art and actual GAMEPLAY, go play huniepop 1 and 2 (skip cam studio)\n\ni am willing to try hush hush though, so good job to sad panda for moving on from this genre\n\n(and really funny that this came out the same day as DOOM)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The fact that the rebirth is capped at a certain point makes this game instantly lose positivty from me, which is a shame because I remember enjoying it at first. It becomes such a chore to keep going. As far as idle games go, the way this one is scaled and essentially forces you to spend paid currency near the end (Though I'd be amiss to say you can't get diamonds without paying) is inherently designed to pull you in until you're just finished, whereit hard caps you and presents you with characters who could take you days (if not [b]actual months[/b]) to properly grind out as a f2p. It's no surprise seeing this game was present on Nutaku, which has many games with similar mechanics.\n\nThe girls are cute though. But don't come into this looking to play a decent idle game. It is one, for a while, before some of the more shoddy design decisions become apparent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I started this game back when Markiplier had played Blush Blush because I thought it was a really interesting take on a clicker game, so I wanted to try both Blush Blush and Crush Crush out. I felt more ease getting into this one strangely enough. At first progression felt a bit hard, but then as I was getting a bit higher on the bonuses from resetting it had felt \"easier\". It slowly took a divebomb into being the most frustrating and tedious task, just getting all the girls you can up and then just losing EVERYTHING to only get an extremely small bonus the next time. Not including me buying the DLC on sale, I had spent about $30 just getting two x64 boosts and one x2 boost. I would've bought them sooner or just quit the game entirely if I had realized before spending 80 hours on the game that I was getting absolutely nowhere. After buying the two 64x and one 2x boosts I only had to play for a few weeks before FINALLY AFTER YEARS PLAYING THIS GAME ON MULTIPLE PLATFORMS AND DESPERATELY WANTING TO FINISH IT that I was able to get all my hobbies to max and finish the game. It will be frustrating if you try to finish this game without paying especially if you're like me who can't open the game everyday for the daily bonuses. This game is a waiting game and has you restarting over for what feels like a million times will probably make you want to crash out. I can't really say it was worth it aside from the characters looking cute. It's free though, so don't let me stop you from hitting the \"Add to Library\" button or \"Play Game\" button.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FREE TO PLAY PLAYERS BEWARE ! ! You are eventually going to hit a hard wall because this game has a finite amount of the currency needed to progress.\n\nI have over 390 hours in this game, so I think I’ve seen pretty much everything it has to offer for free. Crush Crush starts off fun: the characters are nice, the writing is cute and campy, and the idle mechanics are satisfying at first. But after a while, the game play eventually boils down to endless repetition and paywalls. Progression reaches a snails pace not long into the game as you're obligated to wait several hours in between milestones - which would be okay if you eventually GOT to the milestones, but much of the time your wait period is something like 15 years because you need to use time boosts which - you guessed it - cost money. The free premium currency is extremely limited, so eventually you just hit a wall and cant go any further if you don't pay for more diamonds to boost your stats. It's quite discouraging to get almost 400 hours into a game and be told there's no way for you to progress without money.\n\nI won't lie to you though - this game is doing well. But despite nearly a decade of success, the developers refused to update the game’s dated and sometimes low quality visuals. Instead of hiring new artists or refreshing the look, they just keep recycling old assets, drawing over top of them, and expecting people to pay for it.\n\nMeanwhile, they invest tons of money on other project's artwork (for example: hiring Nanoless, a very talented and expensive artist) while Crush Crush stays the exact same. The event girls feel very half-baked and are usually just re-colors of old art with a few things drawn over top of them. Further, if you miss a single event day, you can’t get the final reward unless you pay for diamonds. You're literally one and done. To me, it just feels like the devs care more about milking the game than improving it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free game and easy to play, a never ending clicker game, but I don't have the patience anymore. It's the worst time consuming game I've ever seen. And at the end, it's not even worth it. I've played soooo muuch just to get 0.1% progress. \r\nI'm not a fan of the art, so getting a \"pic\" of the girls in bikini, idc. \r\nMe, who like to tryhard nsfw games for the steam achievements, I'm not gonna spend a second on this cookie clicker anymore. Launching this game (with blush blush) was a mistake. \r\nBecause playing a game to grind it, to this point, when there is no fun left, for what ? Even if there is a some kind of end game, I would skip it. \r\n\r\nPlus, the \"gameplay\", if you can call it that. Per example, you'll need to give 314 roses to a girl, but oooh sadness when you see you cannot choose how much gifts you can give because it is a set value. \r\nGive her more you tell me ? Mmmh, not when the gift cost you 95 trillions and you gain 13 trillions over 7 days. \r\n\r\nTo play this, you need to skip real time by changing the time of your computer (or other technique) because who the hell wants to wait 56 days for an upgrade ? And an auto-clicker of course, or else gl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is such a painful cash grab that the events are annoyingly impossible without the use of gems, there are characters you cant unlock without 200 gems, that is about $20. they want 20 bucks for one character and a few outfits each. it is insane case there are about 25 characters you'd have to buy. i only play this game to waste time but it pisses me off to no end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recommend it because lately, I could reset it to get the boost because each time it takes away some of my progress and item I had unlock and even rolling back Doesn't bring them back. So, I am through with this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have mixed feelings on this game. \nthe good :\n- the characters are super cute and charming !\n- the dialogue can be pretty funny\n- fun if you like to manage things\n- bearverly\n\nthe bad :\n- takes extremely long if you don't want to spend money\n- paywalls !!1! too many of em 1!!!!1!11!!\n- gets boring at some point \n- nutaku\n\ni have been playing this game for about 2 years, i have not finished it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The devs have decided to start putting out AI slop instead of their already mediocre art. Buyers Beware, jerk and spend elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could not figure out what I'm supposed to do in this game. It looks like everything is behind some paywall. Or I just have to sit and wait. I aint gonna do neither.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Addictive at first. The new time sensitive events are very scummy and basically impossible to beat without paying. The new pinups clearly use AI art which is not disclosed in any way but clearly just another cost-cutting measure. Recommended for a bit, but not long-term.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Believe it or not, I was going to give it a positive review, but, but, but who the hell hides saving the game behind a paywall???",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "you cant even progress with out spending like 50+ real dollars oml its bad XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for your own sake, stay away! I've been sucked into this game for FAR too many hours, and i don't even really like it. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nah bruh, too much clicking and bitchin",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hundreds years to complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What the heck is that. Omg.... don't even try. Pay to win boring game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "played for 2 hours just to realize you have to pay to see naked woman, unapproved",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idk why I played this, but I 100% it so...yeah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is boring as hell. I just wasted my time with this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hell, actual Hell.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For male players, do, not play. This game will only leave you in deeper despair and inevitable sorrow. Save your time and dignity, when real women await you.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "Honestly, a shame. There's some really good stuff in here but it's just... not fun. Not as a dating sim, not as an idle game, I guess the poarn element is kind of nice because of the buildups. And it looks great! The girls are pretty. And are all of age, which is... ugh. Why do I have to write this.\r\n\r\nAnyway. What I particularly liked is that while they're still pretty shallow stereotypes that do not map very well on actual women, at least they aren't Japanese copypastes of poarnish archetypes. And some of them are really, really weird. You can date a bear. An actual female bear, not even made animu cute. A realistic, female bear. Yes, you can have sex with her, too.\r\n\r\nSo instead of having a tsundere, loli, oneesan, etc etc you have such classics as \"basic beach beetch\", gamer girl, cat girl, sporty girl...  except the way they're written, I kinda want to say that the writer never talked to a woman before. The gamer girl's entire personality is the fact that she's a gamer (an early 2010s gamer to be exact), there's a hot teacher who behaves pretty much like a roleplay persona, there's an actual incarnation of a fapgame site, and the sporty girl is literally Rainbow Dash from my My Little Pony. You can really tell when this game was made, and by who. I won't say it doesn't have a certain charm to it, though.\r\n\r\nWhat's kinda vexing about writing is that there are also \"phone flings\" (think texting simulator, with waiting and saucy pics), and some of these actually read like real flirting? Some. They're actually my favourite part of the game; you can think of them as mini visual novels. And hoo boy, there are so many. Same with the girls, to be honest. So many. I can't imagine what sort of poly saturation point you'd need to be able keep up with this many partners! Or maybe if your day consisted of 96 hours...?\r\n\r\nTbh, that might be what's going on. Since this is an idle game, you're constantly given more \"time blocks\" which define how much stuff you can do at once. Before you know it, you'll work 5 jobs, do 6 hobbies and go on dates all at once. This kinda breaks the flow of how usual dating sims work, where you slowly turn from a bottom-feeding loser to Her-Acles, the slayer of Lernean Puss. Here you just kind of... get everything, and eventually need to get even more everything because it's an idle game.\r\n\r\nBut it's not a particularly good idle game. It lacks this... hook. This thing that makes you want to make the number go up. Sure, wanting to see some titties might be a motivator, but I feel like it doesn't mix well with the idle gameplay. And since you'll also have to prestige to get anywhere, you'll have absolutely nothing for a significant amount of time, and then you'll unleash the boobonic plague. Although that's kinda how it is in life for some reason, so... points for, uh, realism?...\r\n\r\nStill. It's free, and while there technically are microtransactions, the game's relatively generous with freebies and there's no gacha mechanics whatsoever. To have the fun fun version you need to pay - I had a pass from when I tried to play Cabin Fever (which I also didn't like), so I figured, hey, why not this one a go. Mixed feelings.\r\n\r\n[url=https://store.steampowered.com/curator/42922988/]Curator page[/url]",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "took me six years to finish this game, which is about a one hundred thousandth of the time you'd actually play without spending real money it seems\n\nif you want to put time into an anime dating sim with cute girls, okay writing, the option to full NSFW with juicy art and actual GAMEPLAY, go play huniepop 1 and 2 (skip cam studio)\n\ni am willing to try hush hush though, so good job to sad panda for moving on from this genre\n\n(and really funny that this came out the same day as DOOM)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The fact that the rebirth is capped at a certain point makes this game instantly lose positivty from me, which is a shame because I remember enjoying it at first. It becomes such a chore to keep going. As far as idle games go, the way this one is scaled and essentially forces you to spend paid currency near the end (Though I'd be amiss to say you can't get diamonds without paying) is inherently designed to pull you in until you're just finished, whereit hard caps you and presents you with characters who could take you days (if not [b]actual months[/b]) to properly grind out as a f2p. It's no surprise seeing this game was present on Nutaku, which has many games with similar mechanics.\n\nThe girls are cute though. But don't come into this looking to play a decent idle game. It is one, for a while, before some of the more shoddy design decisions become apparent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I started this game back when Markiplier had played Blush Blush because I thought it was a really interesting take on a clicker game, so I wanted to try both Blush Blush and Crush Crush out. I felt more ease getting into this one strangely enough. At first progression felt a bit hard, but then as I was getting a bit higher on the bonuses from resetting it had felt \"easier\". It slowly took a divebomb into being the most frustrating and tedious task, just getting all the girls you can up and then just losing EVERYTHING to only get an extremely small bonus the next time. Not including me buying the DLC on sale, I had spent about $30 just getting two x64 boosts and one x2 boost. I would've bought them sooner or just quit the game entirely if I had realized before spending 80 hours on the game that I was getting absolutely nowhere. After buying the two 64x and one 2x boosts I only had to play for a few weeks before FINALLY AFTER YEARS PLAYING THIS GAME ON MULTIPLE PLATFORMS AND DESPERATELY WANTING TO FINISH IT that I was able to get all my hobbies to max and finish the game. It will be frustrating if you try to finish this game without paying especially if you're like me who can't open the game everyday for the daily bonuses. This game is a waiting game and has you restarting over for what feels like a million times will probably make you want to crash out. I can't really say it was worth it aside from the characters looking cute. It's free though, so don't let me stop you from hitting the \"Add to Library\" button or \"Play Game\" button.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FREE TO PLAY PLAYERS BEWARE ! ! You are eventually going to hit a hard wall because this game has a finite amount of the currency needed to progress.\n\nI have over 390 hours in this game, so I think I’ve seen pretty much everything it has to offer for free. Crush Crush starts off fun: the characters are nice, the writing is cute and campy, and the idle mechanics are satisfying at first. But after a while, the game play eventually boils down to endless repetition and paywalls. Progression reaches a snails pace not long into the game as you're obligated to wait several hours in between milestones - which would be okay if you eventually GOT to the milestones, but much of the time your wait period is something like 15 years because you need to use time boosts which - you guessed it - cost money. The free premium currency is extremely limited, so eventually you just hit a wall and cant go any further if you don't pay for more diamonds to boost your stats. It's quite discouraging to get almost 400 hours into a game and be told there's no way for you to progress without money.\n\nI won't lie to you though - this game is doing well. But despite nearly a decade of success, the developers refused to update the game’s dated and sometimes low quality visuals. Instead of hiring new artists or refreshing the look, they just keep recycling old assets, drawing over top of them, and expecting people to pay for it.\n\nMeanwhile, they invest tons of money on other project's artwork (for example: hiring Nanoless, a very talented and expensive artist) while Crush Crush stays the exact same. The event girls feel very half-baked and are usually just re-colors of old art with a few things drawn over top of them. Further, if you miss a single event day, you can’t get the final reward unless you pay for diamonds. You're literally one and done. To me, it just feels like the devs care more about milking the game than improving it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free game and easy to play, a never ending clicker game, but I don't have the patience anymore. It's the worst time consuming game I've ever seen. And at the end, it's not even worth it. I've played soooo muuch just to get 0.1% progress. \r\nI'm not a fan of the art, so getting a \"pic\" of the girls in bikini, idc. \r\nMe, who like to tryhard nsfw games for the steam achievements, I'm not gonna spend a second on this cookie clicker anymore. Launching this game (with blush blush) was a mistake. \r\nBecause playing a game to grind it, to this point, when there is no fun left, for what ? Even if there is a some kind of end game, I would skip it. \r\n\r\nPlus, the \"gameplay\", if you can call it that. Per example, you'll need to give 314 roses to a girl, but oooh sadness when you see you cannot choose how much gifts you can give because it is a set value. \r\nGive her more you tell me ? Mmmh, not when the gift cost you 95 trillions and you gain 13 trillions over 7 days. \r\n\r\nTo play this, you need to skip real time by changing the time of your computer (or other technique) because who the hell wants to wait 56 days for an upgrade ? And an auto-clicker of course, or else gl.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is such a painful cash grab that the events are annoyingly impossible without the use of gems, there are characters you cant unlock without 200 gems, that is about $20. they want 20 bucks for one character and a few outfits each. it is insane case there are about 25 characters you'd have to buy. i only play this game to waste time but it pisses me off to no end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't recommend it because lately, I could reset it to get the boost because each time it takes away some of my progress and item I had unlock and even rolling back Doesn't bring them back. So, I am through with this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i have mixed feelings on this game. \nthe good :\n- the characters are super cute and charming !\n- the dialogue can be pretty funny\n- fun if you like to manage things\n- bearverly\n\nthe bad :\n- takes extremely long if you don't want to spend money\n- paywalls !!1! too many of em 1!!!!1!11!!\n- gets boring at some point \n- nutaku\n\ni have been playing this game for about 2 years, i have not finished it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The devs have decided to start putting out AI slop instead of their already mediocre art. Buyers Beware, jerk and spend elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could not figure out what I'm supposed to do in this game. It looks like everything is behind some paywall. Or I just have to sit and wait. I aint gonna do neither.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Addictive at first. The new time sensitive events are very scummy and basically impossible to beat without paying. The new pinups clearly use AI art which is not disclosed in any way but clearly just another cost-cutting measure. Recommended for a bit, but not long-term.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Believe it or not, I was going to give it a positive review, but, but, but who the hell hides saving the game behind a paywall???",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "you cant even progress with out spending like 50+ real dollars oml its bad XD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for your own sake, stay away! I've been sucked into this game for FAR too many hours, and i don't even really like it. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nah bruh, too much clicking and bitchin",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hundreds years to complete",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}