{
  "positive": [
    {
      "review": "The game itself was fun, but expecting us to pay another $40 for the same game with patches is crazy.\n\n\"Relaunched\" = give us money you stupid consumers.",
      "voted_up": true,
      "votes_helpful": 61
    },
    {
      "review": "Surviving Mars: Relaunch: re-purchase the same game again.  PASS.  Spend US$40 for an updated game from Paradox?  PASS.  I can't seem to create a review on the relaunched store page because I don't own it.  I don't own it because I won't pay for it.  This original \"is no longer available on the Steam store\" - PARADOX, why must you be the worst?\n\nI'll keep my buggy (?) one (honestly, i don't think I witnessed any bugs, it is a sim that you need to keep massive numbers of colonists busy and happy, I see no problems).\n\nIt doesn't really matter recommended yes or no; the original this review is being left under is a YES (that cannot be purchased any more), the relaunched is a hard NO.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Anything between fun and relaxing to challenging. Very nice game with fun mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the city building and resource management mechanics all comes together to make for a fun experience. with the expansions they have added since release have brought a lot to further the experience. the music is also nice to listen too. overall, this game gives you constant challenges to overcome while giving you the satisfaction of progression the whole way. if your into this kind of game I would absolutely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have hundreds of hours playing here and more on console. This game and fantastic with a ton of great mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Leaving my review now for having played this obsessively 4 years ago.\nWonderful complexity in building colonies, lots of problems to solve, from your own incompetence as a resource distributor to actual planetary phenomenon.\nOnce you figure out how to reliably build and expand it can become a bit routine, but thats what the extra difficulties are for.\nBugs and annoying behaviours are very rare and not that severe at all, but can be a pain when they happen at the wrong time, but are mostly a symptom of trying to do too much with not enough people/transporters/resources",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I am looking forward to the remaster. This game is a great combination of city builder, sci-fi, and exploration.  This game allows you to make it as hard or easy as you like. You can settle any part of the planet and the random events are plentiful enough that no two games feel the same. I haven't played in a bit due to other games, however with the remaster I cant wait. This is one of the best in this genre.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "After almost 400 hours, I 100% recommend this game. \n\nMost of the recent negative reviews are people upset that Surviving Mars Relaunched isn't a simple patch to this game. Relaunched is receiving updates every few days to address issues with that game. Yes, there are issues with new content released while Abstract was in charge. However, mods have fixed that vast majority of things people are upset with. Most of those people refuse to use mods to solve problems. They'd rather just complain a review bomb instead. \n\nIf you are looking at this game as a new player....there are issues with Below and Beyond DLC. That is the only DLC that I do NOT see as fixed. To me, it honestly adds the least amount of new content anyways. But don't be afraid to find a mod that fixes something you don't like. I've played with over 40 mods at a time with zero issues. Don't let the salty people ruin this for everyone else.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Relaunched is a buggy mess that really was not ready for release.\n\nOG Surviving Mars is still the superior product as of today. Can't believe people are giving the original a negative review just because they are mad about the reboot. (Or having to pay for the same product again)",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "ignore the dimwits review bombing this game because they cant read what the relaunched version actually is. Its a total ground up remake in a newer engine. Not just a simple set of bugfixes. \n\nThis game is great for what it is and I had a ton of fun with it. There were two very badly implemented DLC but beyond those OPTIONAL purchases this game was a great deal of fun for me as evidenced by my 145hrs in it",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of my all time favorite games, and since I've been playing video games since Pong in the mid 1970s that's saying something. \n\nCurrently this version of the game is now de-listed on Steam in favor of the newer relaunched version of the game. People seem to have a lot of feels about that and are stupidly review bombing this version of the game instead of that one. Me, I'm just glad to see the game go back into active development with new expansions and fixes, and that's worth the few bucks they're asking as far I'm concerned. \n\nBut regardless, that's neither here nor there. No matter how you feel about Surviving Mars Relaunched, the original Surviving Mars is a great game that deserves to keep it's very positive review score.\n\n[Edit to add: Some poor soul just jestered this review. It took a special kind of stupid to prove my point that way, so thanks for being such a great example of why I felt the need to write it.]",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Paradox gives the original game away for free in 2021. Didn't buy any of the DLCs. Decide its time to play the game finally. Learn about a \"remaster\" with all DLC included. Get the game for 50 percent off with all DLC. Seems like I won.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "These Review Bombs are just stupid! This game is like a decade old and it is still one of the best city builders out there. Do you actually think the publisher can afford to just fix an old game. They have to pay their people so stop being entitled little a** holes. Play the game and give it a real review and be happy that they are adding additional elements to the game for more fun. The cost of this game will probably finance a Surviving Mars 2.\n\nIf you are new to the game, this is an awesome deal. You get all the DLCs and a new political layer. Furthermore you will be playing an improved movement system for your citizens that will solve issues from the past and help minimize micromanagement. This is one of the best colonizing games out there. I'd argue that it is the best considering stupid games like planet base. Go. Enjoy. Colonize. Terraform.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone complaining about Surviving Mars needing to be free: are you not reading that there is going to be future DLCs as well or are just reading what you want to read? Makes no sense why you would want everything for free. All games have flaws, big deal! You should be grateful Paradox is putting new clothes on an already great game and appreciate that they're also promising future content as well. Plus 20 bucks for everyone who previously owned it? Thats a steal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game and the relauch has more stuff and every dlc. and if you own the 2018 version you get 50% off this stuff cost money so poeple need to stop complanin its not free.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SimCity benzeri şehir kurma simulasyonu ancak ortam çok fantastik. Plan, program, strateji ve sabır.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Screw all the people review bombing that want stuff for free, they remade the game from the ground up in an entirely different game engine and people want it for free? Great logic there, there's a difference between wanting bug fixes and wanting a remastered version in a new engine with new models completely for free. You're not entitled to a free game just because it's a remaster, because they remade everything, remaster, not a re-release.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Don't blame the developers, blame the publisher, I fucking hate Paradox.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For sure a amazing mars survival management game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very fun game in desperate need of more love from Paradox.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyable world-builder with different stages.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "OG game is wonderful, Fuck paradox for rebooting a shitware as a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend surviving mars. However it is currently a bit of a mess with who does what and the new games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved this game i bought it when it came out and have over 600 hours in it. But they are not showing me the discount to upgrade please fix this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only have the base version of the game and seeing as the relaunched version will come out with all the DLC's included which is around 100 USD at the time of me writing this, I look forward to the relaunch and I say good on them for allowing me to get all of that for only 20 extra bucks with the discount I will be getting for already having the old version. I can see the argument that other people have about being mad about having to essentially pay for bug fixes but if you only have the base version of the old game or a few of the many DLC's, it seems like the relaunch will be a great deal. I remember liking the game and wasn't aware of the extensive amount of content they have released for it, so in a couple of days when they allow for buying the new version I will definitely be getting it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking forward to the relaunch on November 10. This is a fun game and I suggest you give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a blast... I struggled and failed the first couple runs which made it that much more satisfying when I finally beat the game!! Very fun overcoming challenges and mastering resource management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic little colony sim. Full of character and whimsy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game,  Spent many hours playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a great survival/strategy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game 888 hours played nuff said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is a  good game .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very, very addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very impressive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow more than catches eye at first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, back to Mars, baby!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "GREEN MARS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ta dificil",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yep",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ",",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself was fun, but expecting us to pay another $40 for the same game with patches is crazy.\n\n\"Relaunched\" = give us money you stupid consumers.",
      "voted_up": true,
      "votes_helpful": 70
    },
    {
      "review": "Surviving Mars: Relaunch: re-purchase the same game again.  PASS.  Spend US$40 for an updated game from Paradox?  PASS.  I can't seem to create a review on the relaunched store page because I don't own it.  I don't own it because I won't pay for it.  This original \"is no longer available on the Steam store\" - PARADOX, why must you be the worst?\n\nI'll keep my buggy (?) one (honestly, i don't think I witnessed any bugs, it is a sim that you need to keep massive numbers of colonists busy and happy, I see no problems).\n\nIt doesn't really matter recommended yes or no; the original this review is being left under is a YES (that cannot be purchased any more), the relaunched is a hard NO.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ Replayability }---\n☐ One and done\n☐ Maybe after a year\n☑ Worth a second run\n☐ Played it 20 times and still not bored\n\n---{ Microtransactions }---\n☑ None\n☐ Only cosmetics\n☐ Slightly pay-to-progress\n☐ Pay-to-win\n☐ More shops than gameplay\n☐ Casino Simulator\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Landed on Mars full of ambition and caffeine. Built my first dome, forgot oxygen. They all suffocated with positive morale. Immersive.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Anything between fun and relaxing to challenging. Very nice game with fun mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the city building and resource management mechanics all comes together to make for a fun experience. with the expansions they have added since release have brought a lot to further the experience. the music is also nice to listen too. overall, this game gives you constant challenges to overcome while giving you the satisfaction of progression the whole way. if your into this kind of game I would absolutely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have hundreds of hours playing here and more on console. This game and fantastic with a ton of great mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Leaving my review now for having played this obsessively 4 years ago.\nWonderful complexity in building colonies, lots of problems to solve, from your own incompetence as a resource distributor to actual planetary phenomenon.\nOnce you figure out how to reliably build and expand it can become a bit routine, but thats what the extra difficulties are for.\nBugs and annoying behaviours are very rare and not that severe at all, but can be a pain when they happen at the wrong time, but are mostly a symptom of trying to do too much with not enough people/transporters/resources",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I am looking forward to the remaster. This game is a great combination of city builder, sci-fi, and exploration.  This game allows you to make it as hard or easy as you like. You can settle any part of the planet and the random events are plentiful enough that no two games feel the same. I haven't played in a bit due to other games, however with the remaster I cant wait. This is one of the best in this genre.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "After almost 400 hours, I 100% recommend this game. \n\nMost of the recent negative reviews are people upset that Surviving Mars Relaunched isn't a simple patch to this game. Relaunched is receiving updates every few days to address issues with that game. Yes, there are issues with new content released while Abstract was in charge. However, mods have fixed that vast majority of things people are upset with. Most of those people refuse to use mods to solve problems. They'd rather just complain a review bomb instead. \n\nIf you are looking at this game as a new player....there are issues with Below and Beyond DLC. That is the only DLC that I do NOT see as fixed. To me, it honestly adds the least amount of new content anyways. But don't be afraid to find a mod that fixes something you don't like. I've played with over 40 mods at a time with zero issues. Don't let the salty people ruin this for everyone else.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Relaunched is a buggy mess that really was not ready for release.\n\nOG Surviving Mars is still the superior product as of today. Can't believe people are giving the original a negative review just because they are mad about the reboot. (Or having to pay for the same product again)",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "ignore the dimwits review bombing this game because they cant read what the relaunched version actually is. Its a total ground up remake in a newer engine. Not just a simple set of bugfixes. \n\nThis game is great for what it is and I had a ton of fun with it. There were two very badly implemented DLC but beyond those OPTIONAL purchases this game was a great deal of fun for me as evidenced by my 145hrs in it",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of my all time favorite games, and since I've been playing video games since Pong in the mid 1970s that's saying something. \n\nCurrently this version of the game is now de-listed on Steam in favor of the newer relaunched version of the game. People seem to have a lot of feels about that and are stupidly review bombing this version of the game instead of that one. Me, I'm just glad to see the game go back into active development with new expansions and fixes, and that's worth the few bucks they're asking as far I'm concerned. \n\nBut regardless, that's neither here nor there. No matter how you feel about Surviving Mars Relaunched, the original Surviving Mars is a great game that deserves to keep it's very positive review score.\n\n[Edit to add: Some poor soul just jestered this review. It took a special kind of stupid to prove my point that way, so thanks for being such a great example of why I felt the need to write it.]",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Paradox gives the original game away for free in 2021. Didn't buy any of the DLCs. Decide its time to play the game finally. Learn about a \"remaster\" with all DLC included. Get the game for 50 percent off with all DLC. Seems like I won.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "These Review Bombs are just stupid! This game is like a decade old and it is still one of the best city builders out there. Do you actually think the publisher can afford to just fix an old game. They have to pay their people so stop being entitled little a** holes. Play the game and give it a real review and be happy that they are adding additional elements to the game for more fun. The cost of this game will probably finance a Surviving Mars 2.\n\nIf you are new to the game, this is an awesome deal. You get all the DLCs and a new political layer. Furthermore you will be playing an improved movement system for your citizens that will solve issues from the past and help minimize micromanagement. This is one of the best colonizing games out there. I'd argue that it is the best considering stupid games like planet base. Go. Enjoy. Colonize. Terraform.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone complaining about Surviving Mars needing to be free: are you not reading that there is going to be future DLCs as well or are just reading what you want to read? Makes no sense why you would want everything for free. All games have flaws, big deal! You should be grateful Paradox is putting new clothes on an already great game and appreciate that they're also promising future content as well. Plus 20 bucks for everyone who previously owned it? Thats a steal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game and the relauch has more stuff and every dlc. and if you own the 2018 version you get 50% off this stuff cost money so poeple need to stop complanin its not free.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SimCity benzeri şehir kurma simulasyonu ancak ortam çok fantastik. Plan, program, strateji ve sabır.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Screw all the people review bombing that want stuff for free, they remade the game from the ground up in an entirely different game engine and people want it for free? Great logic there, there's a difference between wanting bug fixes and wanting a remastered version in a new engine with new models completely for free. You're not entitled to a free game just because it's a remaster, because they remade everything, remaster, not a re-release.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Don't blame the developers, blame the publisher, I fucking hate Paradox.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For sure a amazing mars survival management game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very fun game in desperate need of more love from Paradox.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyable world-builder with different stages.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "OG game is wonderful, Fuck paradox for rebooting a shitware as a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend surviving mars. However it is currently a bit of a mess with who does what and the new games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved this game i bought it when it came out and have over 600 hours in it. But they are not showing me the discount to upgrade please fix this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only have the base version of the game and seeing as the relaunched version will come out with all the DLC's included which is around 100 USD at the time of me writing this, I look forward to the relaunch and I say good on them for allowing me to get all of that for only 20 extra bucks with the discount I will be getting for already having the old version. I can see the argument that other people have about being mad about having to essentially pay for bug fixes but if you only have the base version of the old game or a few of the many DLC's, it seems like the relaunch will be a great deal. I remember liking the game and wasn't aware of the extensive amount of content they have released for it, so in a couple of days when they allow for buying the new version I will definitely be getting it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking forward to the relaunch on November 10. This is a fun game and I suggest you give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a blast... I struggled and failed the first couple runs which made it that much more satisfying when I finally beat the game!! Very fun overcoming challenges and mastering resource management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic little colony sim. Full of character and whimsy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game,  Spent many hours playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a great survival/strategy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game 888 hours played nuff said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is a  good game .",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very, very addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very impressive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow more than catches eye at first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, back to Mars, baby!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "GREEN MARS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ta dificil",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its great!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I re-installed this game when I saw that they were FINALLY fixing the bugs, just to learn that I would have to buy the game again?!?! What a crock.",
      "voted_up": false,
      "votes_helpful": 237
    },
    {
      "review": "Why fix a broken game when you can abandon it and charge people all over again for a shitty \"remaster\"?\n\nTop tier capitalism.\n\nAnd now that this version's been pulled from sale, it's not like our negative reviews even matter.\n\nWell, here I am, screaming into the void anyway.\n\nImpressive how Paradox just seems to get worse and worse as a company.\n\nShameful and disappointing, but unfortunately not surprising.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Why is Gabe allowing publishers to remove an old game I've paid money just to force me to buy the same game again by calling it \"relaunched\"?\n\nThey haven't even fixed the old bugs!",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Does Paradox want to pionneer being utterly banned by the player community?\nNo names change will save them... Since Kerbal Space II i have already banned them fully, now i will pay even more attention to it, because it is not acceptable to make a \"buy the game again\" when you are just fixing some bugs... Proper care & products will never deceive you, Fooling your customers is only fooling yourselves...",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "They added the fixes as a new version you have to buy all over again, and then they delisted THIS version and all DLCs. This just makes me determined to not buy the new game due to this act of pure greed.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "You really just relaunched the game I payed a full price for a couple of years ago?? This type of stuff is supposed to happen 10 or 15 years after release, not 6 or 7 years after release and not improving the base game!! \nSad to see your company go this way...",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I loved this game, unfortunately the devs have decided to repackage this game and charge everyone more for it with the relaunch. cannot in good faith recommend giving this company money",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I loved this game. The soundtrack I still listen to, to this day. \nI didn't even hear about Surviving Mars: Relaunched and then I see all this crap. It just puts such a horrible and bad taste in my mouth for the original I just don't even know what to say and do anymore. Genuinely I was like I wish they re did this game...and now I see this I kinda regret it. \nSo disappointing but didn't expect anything better from Paradox. They are well known for ruining anything the second time...Cities Skylines II, Blood Masquerade - Bloodlines 2...do I dare mention Cities in Motion 2? \nVery sad day indeed.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "game is abandoned for 3+ years and now they bundle the whole thing with some makeup, and charge $40 for it instead of patching the current game! \n\ngreat job devs.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Bought the original game and now I have repurchase it just get access to a future DLC. Screw me once shame on me. Screw me twice shame on YOU! Screw your existing customers SHAMELESS!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fix your shitty game before releasing the same game again. Copy and pasted bugs.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Have to buy the game again for bug fixes? Is this an attempt by Paradox to create a new form of DLC?",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Thanks for the opportunity to rebuy the same game with all the DLCs I already bought and new promises that may never happen. I really appreciate this move and will never buy anything else from devs. Here's an idea for the next \"community meeting\": sell every patch as a new game, like `Surviving-Mars-dev-build-schem-casino-final-ultimate-release-42`",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love this game, don't buy it. \nParadox is a very parasidic company that hides key gameplay updates behind DLC.\nI had accepted that, after all dispite the gross DLC practices CK3 was still getting decent updates.\nThen I found out that this game I love -Surviving Mars- wouldn't be getting updates. \nNo. Instead, I'd need to buy the game again for updates, bug/performance fixes and even then there'd still be more DLC down the pipeline!\nThe fact the Paradox thinks we'll keep buying this is a joke.\nGuess I'm the real clown then, because I know I will...\nIf you value your time, sanity, and money don't play any of Paradox games. \nIt's too late for me I'm afraid.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Its fun game. But to pay again for the update??? Nope. And now i was looking for DLC for the 2018 game. None. So if i want DLC on my version of game. I need to buy again the whole game. Why???? That doesnt make sense. 50% off for owners of the older game? That is what?? One thing to make it better. Turn it to the old game. AND PUT THAT DLCs AT BUNDLE. Nooooooo. We got for you the same game but better. Only need to buy. Its good game. I enjoy it. But thats not how you sell your product. Its only for money? And the happiness from the customer? I hope the developer will get to his sense. Until then. I will play that 2018 edition what they call it now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not recommended. I’ve spent 364 hours in this version of Surviving Mars, much of it using mods to work around long-standing bugs, only to see Paradox abandon it, repackage the bug fixes and QoL improvements as “Surviving Mars: Relaunched,” and charge again for what is essentially a paid patch. This original version is now frozen and delisted with its DLC no longer sold, so existing owners are stuck with a broken game unless we rebuy it. As someone who owns 15+ Paradox games and DLC, this feels like a catastrophic breach of trust; at the very least, existing players should receive a free upgrade or deep discount instead of being told to purchase the same game again just to finish the content and get fixes. The colony sim underneath is good, but I cannot recommend a product tied to a business model that asks you to pay twice for the same game and treats long-time customers as expendable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Abandoned to release and \"Relaunched edition\" forcing players to buy the game again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "should have given everyone a free copy or massive discount maybe even a update for everyone that has this game but no gotta make me pay for the game a second time",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Sad to see they pulled an ark survival evolved and After initially being excited that there was bug fixes coming, that was CRUSHED by learning id be buying the same game again instead of receiving it as an upgrade. Could have been fun, would have put more time in. But I am  not buying bug fixes. Also heard alot of bugs are popping up in the new version as well",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I own this game and bought all the DLC for it when they released. Now they have taken them away, and are trying to force me to buy their \"relaunch\" for 40 Euro.\n\nAbsolutely not. I suggest the developers go for a stroll on the surface of mars. With no helmet.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I have 300h in this game and own all DLC besides B&B. Which was bugged beyond bearable so I refund it.\nThe original game launched in 2018 was promising but abandoned for the past several years. And I stopped playing it as nobody in Paradox cared about it anymore. Now Paradox wants our money again, for the same game and apparently - if you read the recent reviews - the same bugs. They have the audacity to remove the original game from Steam and present it like brand new, remastered game. Don't believe it.\n\nI advise you not to trust them with the DLC they are promising for this one. Look what happened with Cities II Ultimate version.\nMany were falling for Paradox promises and trusted them with their wallet but no more. \nPS. most of the positive reviews you will see are written for the 2018 game. Not for this so-called ''remastered'' recycled game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "abandoning a game and then charging full release price for bugfixes is an unacceptable business practice",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "De-listing a game from 2018 to force everyone to buy a new version to gain access to the DLC and content we previously had.\n\nDO NOT SUPPORT PUBLISHERS THAT REMOVE WHAT YOU PREVIOUSLY OWNED!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It was a good game and I enjoyed it. But re-releasing it is just a spit in the face of your customers. I'm not asking for free content. Make an expansion, make a successor or make DLC. But don't just remove my game from the store and ask me to re-buy it so I get newer content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Loved playing the game, wanted to buy expansions, now I can't because remaster is out and by the looks of it, it is even worse than the original.\n\nWhoever planned this, congratulations, you pissed a lot of people.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I loved this game, it was a great game, and I say that in spite of the *massive* problems it had and the desperate need for re-tuning and bug fixing.  If you think I am going to re-buy the same game for full price to get the fixes that you should have provided for your players to make the game that we bought and paid you for function properly you are out of your mind.  I've uninstalled Surviving Mars and kissed paradox goodbye- I am starting to vote with my wallet more and more.  I already cut out EA and now your'e joining them Paradox.  It's time for the gaming community to insist that game companies provide quality products for the outlandish prices they are charging us and to put and end to the constant nickle and diming us to death tactics.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They broke the game and now they expect us to re-buy the game in order to get the fix. ya, no.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't get DLC for the original game? I wanted to add Martian express but it takes me to the buy relaunch page. Absolutely love the game but you sh!t the bed on this occasion.\n\nUPDATE: For about the price of the DLC I can get the whole game again (due to half price sale), so I did. Still not changing my thumb direction as it's still a d!ck move",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love the game but this recent move is such a slap in the face to all their customers. Now, instead of even having the option to buy the one expansion pack I don't already own, I only have the option to completely rebuy the entire game. This is such a disgustingly greedy move and I HIGHLY recommend not to give them a PENNY unless they reverse this course of action and provide the new version for free to the people who already purchased their game or at very least, a cheap upgrade cost. Being forced to rebuy the game is NOT ACCEPTABLE! I have already requested a refund for the original game, not because I expect them to grant it, but in the hopes that Steam Support being swarmed by refund requests push them to take action against Paradox.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Instead of updating the base game I've already spent over $100.00 on in total, they relaunched a new game that has to be purchased again. How scummy can you be?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Only reason i'm leaving this review is to let Paradox know they need to treat their fanbase better.\n\nRe-releasing the same exact game only a few years later but now with the added bugfixes that they should have implemented in some of their DLC's that they completely abandoned just a few years ago screams unprofessionalism .",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Was looking for games to replay and thought about this - Have read now they have re-released it as a new version and now I cant buy the DLC without rebuying the game again? Yeah no thanks, Money grubbing company just wants to get people to rebuy it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Imagine the Developer patch the game and re-bundle it and ask you to re-buy the game again",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "So you want me to pay $20 to fix the bugs you introduced? Every time I thought paradox couldn't go any lower, I get surprised. It's honestly incredible how scummy Paradox is. I was really happy to hear the game was getting an update (I've played mostly on another platform), but as it turns out, paradox are \"relaunching\" the game as a separate game and giving us a 50% discount on the \"new\" game which is just this game but with an update to fix the crippling issues in the later stages of the game.\n\nAlso mind you this game costs $30 (USD), but you're only going to give me $20 off? Here's an idea at the very least give me the full $30 off. It's not like you scumbags aren't going to pump the game full of awful DLC anyways to milk money out of people. \n\nIs there no one at Paradox HQ asking the important question of \"Yeah, I know we could, but should we?.\" Sure you've burnt all the bridges at Cities Skylines, Prison Architect (Shout out PA 2, what a piece of garbage), HOI, Victoria, Crusader Kings, but hey screw it burn these people too. It's honestly incredible how incompetent you morons are.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Valve need to start tightening the screws on publishers like this. Paradox make EA blush with this ‘no longer available’, buy it again strategy.\n\nDon’t encourage it. The game was never *that* good to begin with and now it’s gotten a paid ‘re-launch’ or as anyone in the know calls it; a paid bug patch, introducing its own set of all new and exciting bugs.\n\nIf they could figure out any dark patterns, you best believe these surpine  wannabe corporate vampires would be at you with them.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I loved this game dearly but paradox is one of the greediest, scummiest companies in the gaming industry. they abandon the game for years and out of nowhere instead of simply fixing their bugs and mistakes they re-release the SAME EXACT GAME and charge people for it. paradox you are utterly despicable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Paradox is insulting us by releasing a bug fixed version as a separate game for an exorbitant price\n\nFix the version we bought.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I saw that Surviving Mars received a major update and was excited to give it another try, hopefully with fewer bugs than the last time I played. Instead, I was shocked to discover that Paradox is relaunching it as a new game. Rather than improving the existing version and fixing long-standing issues, they’re effectively trying to make existing players pay for the game again.\n\nShame on Paradox for this unethical decision, and shame on Steam for allowing it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "An otherwise great game ruined by a blatant cash grab and terrible anti-consumer business practices on the part of Paradox Interactive and Haemimont Games.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "cant wait for this silly company to realise the massive fuck up of not freely upgrading for people who already own the game. true modern bullshit i really hope this \"relaunch\" flops",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I forgot to review this when I played it months ago, so I won't be able to go into details. Nice idea, but in essence Surviving Mars is just too wobbly and buggy. \nThe tech and economy pacing is bad, things like connecting domes to each other is insanely frustrating, colonist AI is horrible, and the mysteries are mostly a big chore. \nI think I had around 25 mods just to make things more tolerable. The overall experience was iffy enough that I don't plan to go anywhere near the glorified patch they released (regardless of its current shortcomings anyway).",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game was just OK. I'd give it a 6/10. But now it's being relaunched with some kind of update... It might even hit 7. But wait, what's this? I have to pay for it again? No, thanks. That's not going to make customers happy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Now you have to buy the \"relaunch\" edition, which is the same game but with bug fixes, total scam.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Scummy practices from Paradox.   Charging people for a game they already own...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Scam. This dev's games are all kinda mid, and this one is being resold for full price with some minor fixes instead of just updating the game.\n\nDid they think people wouldn't notice? What the hell is wrong with them??",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Resell the game to fix your bugs....  I already paid for these bugs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hej Paradox - FU. I will not buy anything from you for discounted/regular price. Instead of fixing games, you release a new product for full price. Great move - join the other crap company like Ubi$hit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "wow did not know it was going be  \"no longer available on the Steam store\"  can't even pick up the dlcs now as they are no longer sold and not even being offered to upgrade to the \"new\" game, this is just a shocking bad way to do this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I'm gonna be honest, I'm a bit sick of companies releasing the same game with more bugs than the original for money. It seems a lot of them have taken lessons from Bethesda on reselling their games. I'm leaving this review here because I think it's important that consumers voice our discontent and refrain from purchasing these shameless cash grabs, even if the original is no longer for sale.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game itself was fun, but expecting us to pay another $40 for the same game with patches is crazy.\n\n\"Relaunched\" = give us money you stupid consumers.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They're remastering this game apparently. Wild, becuase it was never mastered originally.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "How to make money:\n\nRelease a game.\nLet the community fix it.\nRalaunch the same game, and hope for the best",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Shameful. No real fix for the original and the 're-release' is just as bad or even worse in some areas. \n\n2025 gaming is just drop the slop and see if people will buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Maybe next time they could update the game instead of making me buy it a second time; would be much appreciated.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Instead of fixing this game and updating this game, they moved on to, get this;\nRelaunch this game as a 'remaster'.\n\nAnd get this;\nThey are not giving it to those who own the original, even Skyrim SE was a free update for LE and the same for AE.\n\nActual clownshop.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hay there bud, Did you not buy the DLC when you had the chance? Well here at Paradox Interactive we like to Interactively fuck you.\n\nEven if you \"Own\" the game you can no longer buy any of the DLC. So if you never got any of them, then that sucks... For you! Not us. We just want you to Buy it all over again. Just think about it, double the charge double the money!\n\nWe already tried City Sky Lines 2 and it turned out players didn't take to the idea of a unnecessary sequel.\nSo this time we thought we'd try a unnecessary remake. We learned our lesson, and we thought it best that players can no longer Buy the original to compare against. Best of all any new players would be forced towards the \"Better\", totally done, not at all copy paste remake.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never let a good opportunity to scam your customers go to waste. Perfectly on brand for the notoriously money-grubbing paradox. Instead of releasing bug fixes and modest new content as a reasonably priced dlc, paradox has decided to re-release the same game for 40 dollars. Since I can't review that game, as I refuse to buy it, the hit goes to Surviving Mars.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fun game. Instead of fixing the remaining bugs in the original, they fixed them on their new remastered version and expect us to buy it again. Do not support this practice.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Selling the same game twice — now that’s an unbelievable new level of game dev greed. Bravo, truly innovative in all the wrong ways. All the way since the announcement, I hoped Paradox would change their mind and offer an upgrade for existing owners. Instead, they decided to screw us over. Never again will I pay a single cent to paradox",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hey uh... Just came back to play this again and saw an announcement for a \"relaunch\", with the listed price only being 20USD for a good chunk of DLC (assuming you own the original), and specifically advertised bugfixes and improvements. Now, I'd be up for an ultimate edition that featured a graphics update, DLC, and maybe some new whackier ideas, but paying for bugfixes in the digital age on an online storefront feels scummy. In my head, the best course of action is a bugfix update for the original game that also adds in advertisement for the relaunch, avoiding alienating old players, earning goodwill to buy the new relaunch as this would demonstrate support for the IP overall, and avoid the accusation of bad business practice Paradox all-to-often receives. Paradox's reputation is bad for a reason, and its because of stuff like this, I just wish they could see the cost of goodwill and community support really isn't as steep as they seem to think.\n\nAs for the game, was a simple and somewhat bland colony builder with a focus on making new runs after completing a predetermined crisis. Did enjoy events that fundamentally changed my circumstances, requiring me to adapt quickly to maximize rewards and minimize problems. Felt from the get-go that this game over-advertises itself as this life changing experience at times that's far more nuanced than it really is. For some similar games you may also like that I've played, check out Against The Storm for that \"re-run\" style colony sim, Dotage for dramatic world events forcing you to adapt rapidly, and maybe Plan-B Terraform if terrain manipulation is why your here (Though thats moreso an automation game). Thanks for reading.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Scam re-releasing the game and making me pay again. No I won't play ever again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy as hell, and instead of patching the bugs out they just released them again in a paid relaunch. I haven't seen this tactic since Bethesda. Disgusting company, just as bad as EA when it comes to greed, no love or respect for their users. Avoid anything with Paradox.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Pay for updates and buy the new game, hopefully they continue to patch it and not ask you for money again for an update fixing the game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "DUDE WTF I cant buy the DLCs I havent gotten yet... I have been playing the DLC one by one. No honestly FUCK YOU. \n\nDont waste your money on the new one either. DO NOT SUPPORT THESE PPL ANYMORE!!!!",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Do not buy this game. It is out of date, and the fixes and QoL are NOT updated in this version. Instead you need to by the \"Relaunched\" version.\n\nMost companies would think that if you release a buggy game with poor QoL you should provide free updates for those, you know fixing the problems the game released with.\n\nParadox however think it's entirely normal to release a \"brand new version\", at full price, just for bug fixes and QoL. You'd expect that at a minimum Paradox would provide those updates for people who bought the original vanilla base game? No, you get nothing. No update, no discount. \n\nLet me be entirely clear, if you have bought this game and want bug fixes then you MUST buy the DLC. Just let that sink in. Paradox thinks bug fixing is something YOU should PAY for.\n\nI've always found Paradox's business model to be pretty scammy, but in this instance they really have outshone themselves.\n\nIn short, don't buy the game, don't trust Paradox and make sure everyone knows how poor the company treats it's customers. I will never buy another Paradox game again, you can't trust them.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I heard they were binging support back for this game and was happy as I loved this game. then found out they were gatekeeping the new content behind buying a paywall for the same game I own. \nWTF paradox",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Being forced to buy a \"Remaster\" of a 7-year-old game just to get critical bug fixes? Jesus Christ. Go fuck yourselves.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Loved the game when it was launched. But now, instead of an improvement, them started selling the same game seperately. What a shitty move. So Paradox.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is real scumbag behaviour for a game that's not even 10 years old, taking this down and re-releasing the same game with the exact same issues. I was excited to jump back into this but oh well",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i havent touched this game in quite a while neither have played it much but hearing recent news even without playing much i must leave a negative review just to spread awareness of how scummy the devs are acting",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "No fixes, no opportunity to buy DLC for the base game, I can no longer get all achievements. Not getting the stupid remaster. I would have been absolutely fine with this if they didn't delist the original game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Never buying a paradox game again. This re launch is just disgusting greed as useless from this crowd. Why should i have to buy a game i already own? Why can't i buy the original dlcs anymore? You're forcing me to rebuy a product i already just to buy the 1 dlc i didn't have. I'm done with paradox, i highly recommend others vote this bs practice out of existence with their wallets and avoid them too.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "You can't buy this game any more because they rereleased the game as a new title.  This first run wasn't really engaging when compared to similar titles.\n\nIt definitely isn't worth raising the price and selling it again.  This isn't Stellaris we're talking about here.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "What can I say? $20 for a patch? Hopefully people thinking of buying the relaunch come here and see how they treated existing customers.\n\nFor context, they have yanked this from the store, and put the \"relaunched\" version on the store in its place. As owners of the original we only get 50% off. That effectively means they are asking $20 for a patch. $5 I could support, $20 is insane.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Paradox made the decision to completely remove Surviving Mars and ALL its DLCs just to force us to buy the NEW version. NEVER.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "boy i sure love rebuying the exact same game again with like barely a new coat of paint. Makes me think the publishers had a drinking relapse. I don't think I'm even going to bother with a refund... I'll just refuse to repurchase this lazy cashgrab, retire my OG colony to rot in peace, and rejoice while Paradox reaps what they sowed with their $20 \"\"\"upgrade\"\"\" regrift.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Wow. I was excited to come back and play this after I'd heard about the update that's incoming, but to learn I'd have to pay for it? I know Paradox is super scummy when it comes to this sort of thing, but I thought they wouldn't sink this low. Boy was I wrong. I won't be paying for the same game twice Paradox.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The publisher changed what I purchased into something defective, then removed it from the store at the same time as they published a version of the game in which they claim the bugs are fixed.\nThis is a textbook example of an unfair or deceptive business practice.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Paradox seems to publish very basic games, sometimes borderline demos, so you should buy tons of DLCs to actually have some content. I never did that - if base game is not good enough, I'm not buying DLCs. \n\nNow they found new practise - re-release same game so they can resell everything once again. \n\nIf they expected that I would have to buy it again - no, I'm not buying it. In fact I'm not buying anything from Paradox anymore - added to ingored publishers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "scam, broken game, and instead of fixing, paradox has decided they'll 'reimagine' bugfixes, and charge for them going forward.  \n\nDont worry, I've learned my lesson, when that publisher is listed, i'll skip it, just like many others. Momma aint raise no fool.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was planning on buying Green Planet DLC one day, but now I find that I can't buy Green planet unless I went and bought the game again. Yeah f that, these game devs are scumbags.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I got this game and all the expansions, but did not play it a lot due to the bugs. Now Paradox and the devs have made the old game unavailable on the Steam Store and released a version of the game with all DLCs, and basically force me to buy the new one, because they wont fix their old game.\n\nWhat a way to run a company and to make old customers pay again for content they already paid for once.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Relaunching a game and selling it again is pure biblical greed. At least make it free for the people who already bought it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Sad that greed got to them. Delist a game that was awesome, only to put up a \"remastered\" version... Just make it an update. Dlc at most. But a WHOLE new game?! And I can't even buy dlc for this one now? Bullshit.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The relaunch game should've given free for the one who owns the original game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "They literally relisted this game as a new game. Neither of them are worth your time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Astonishingly greedy move making people pay for a game update like this. I loved this game but i will NOT be buying it again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wtf is that \"relaunched\" nonsense. Feeling left alone, like the other reviewers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Re-released the game but removed original from the store, that means you have no confidence in your new product, don't support anti-consumer practices.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Preface this. I bought Relaunched. This game is very good. I own many many many of Paradox Interactives titles. This does not excuse the fact that this version should have been updated with big fixes. Left in a better state than it currently is. And then Surviving Mars Relaunched should have been released as a second version of the game much like Cities Skylines 2. The company had a model to follow that they themselves created and didn't.\n\nRelaunched is different enough that with a few extra additions (say a couple extra sponsors and mysteries) they could have made enough reason for a 2nd edition.\n\nTLDR: Paradox get your act together.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do not buy this game its buggy and they gave up, made a \"Remastered\" of it, by that just fixed all the issues. very scummy of the devs for sure",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Disgusting to unlist this version and replace it with an ugly buggy mess, do better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Was a fun game, liked it for a bit, but no way in hell I'm paying another $40 for some fucking bug fixes that should've been a free update",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "wow this escalated quickly...\n\nInitially it was a decent colony sim. Nothing groundbreaking but still quite a solid and enjoyable game. And now, after 7 years from release, we've got the \"relaunch\" which is basically the attempt to sell the same game with some \"improvements\" and new bugs. It feels like a lazy cash grab attempt almost on the edge of a scam. I can understand if devs would release the sequel and most likely would give it a try but this... into the ignore list it goes. Such behaviour should not be fostered.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've already bought the game, but I need to purchase it again to get the bug fixes????? Shameful!!!! Also, shame on Steam for letting this happen!!!! Pure Greed!!!  Steam, how about you refund me for the bug filled game and  I'll  purchased the relaunched game. Seems fair to everyone??? We in the steam community don't need 2 of the same game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was recommended this game by a friend about two years ago and i enjoyed it at first, but the bugs and unbalanced aspects of the game made me get tired of it pretty quick. and then i heard that everything was getting reworked, just to find out that i would have to repurchase an entirely new game. Absolute Scam.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is just wrong. Relaunch the game without a care for people who bought the original is not cool",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I do not agree and hate how they decided to make a patch update and charge people for it. that they should have fixed in the original game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Relaunching a game to address bugs. Absolute madness.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game was fun, but now they require you to rebuy the game to recieve updates.\nDon't support them",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}