{
  "positive": [
    {
      "review": "[if u from wc3 u will love it]\nIn 2009, during my last semester of high school, I created the original Legion TD map on Warcraft 3. I made it just for fun, to play with friends from school.\n\nAs much as I loved Dota, Footies, Wintermaul, and every other TD out there, nothing ever felt like the game for me. I wanted gameplay that was:\na) team vs. team, so I could queue with my bros.\nb) high skill cap, since I'm a tryhard.\nc) strategic, without all the micro, since I have terrible aim.\nand I couldn't find anything else that checked all those boxes.\n\n...7 years of work and 283,246 lines of code later...\n\nI am deeply tired, but proud of the game Legion TD 2 has become. Chill, like a TD, yet deeply strategic. After thousands of hours, there's more to discover.\n\nI can honestly say that after a long day of working on Legion TD 2, I still like to relax and unwind by playing...Legion TD 2.\n\nGetting to enjoy Legion TD without touching a blizzard game. Win/win\nWARCRAFT 3 MODS MADE PC GAMING.\nGetting to enjoy Legion TD without touching a blizzard game. It's a win win situation.\n\nSee you on the ladder!",
      "voted_up": true,
      "votes_helpful": 109
    },
    {
      "review": "Originally from Warcraft III Legion TD, this standalone official game gives more balancing, more options and some more in-game statistics and info to help you along. Easy to learn, hard to master. Lots of fun games!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "More people need to get this game. hours and hours of fun with an changing meta to keep you going and learning",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "💬The game is still very much alive and is not going to die anytime soon. The number of online players is small but constant, approximately the same as 1 year ago. New players and long-time players share the game, and it usually takes a couple of minutes to find a match. The game receives updates very frequently. Fixes for bugs are provided, but also the creation of new bugs is part of the process. The balance is adjusted so that players do not get stuck using the same strategies, and there are occasions when new cosmetics are introduced.\n\n🎮Although there are no in-game advantages provided by the game, it still allows for donations towards cosmetics (skins, backgrounds, etc.) and nickname changes. The good news is that if you belong to a guild, you will be able to get these perks for free. With the guild's progress, all members receive premium currency in their accounts for free. Many aspects of the game are very much connected to guilds.\n\nIt is a team sport, and that is it. Do you want to be victorious more often? Then, play as a team. A well-organized group of medium-skilled players can easily defeat the top-level players if, the latter, do not coordinate their actions and rather play as they want. Does this imply that, for those who do not want to join a guild and have no friends, there is no activity available in the game? No, it doesn't. The game provides a great and simple to use ping system. Just with a quick movement of your mouse, you can show what you want to do to your team mates. Would you like to attack on the next wave? Alert them that you are afraid of an attack and require support? Let them know that you have no idea what to do next? All this can be done without the need of chat, and your team mates will receive the information in the language of their client.\n\nMatchmaking in ranked mode (2 on 2) it is good; in classic mode (4 against 4) it is often random. A player-matching system is in place for classic mode. You will get bonuses throughout the match if your team is made up of weaker players than your opponent. But honestly, it doesn't make much of a difference. When your teammate is oblivious to the abilities of a certain unit, no amount of bonuses will help him/ her. Winning over them is also not so much enjoyable. If beginners were kept to play only with beginners, it would be a better situation. But evidently, there is not enough online playing, and at times, they are sometimes used to dilute groups of more experienced players.\n\n👍Positive.\n- Game support\n- Constant balance changes\n- Various modes\n- Huge build variety\n- Good optimization.\n\n👎Negative.\n- Takes Time to Get Rewarding\n- Steep Learning Curve\n- Matchmaking Issues\n- Graphics are not for everyone.\n\n🧾Summary.\nThe production quality is undoubtedly the work of professionals, and, most significantly, true enthusiasts of Warcraft and the primal Legion TD are behind it. The user interface always displays everything necessary for the game.\n\nThe game is a paradox: it is extremely easy to play but at the same time very difficult. After playing the tutorial (which is strongly suggested), you can straightway enter the game and even find yourself relatively at ease. And only a few players would be able to memorize the precise stats of each unit from the local encyclopedia, learn about the changes through reading patch notes, and spend hundreds of hours in the sandbox just to acquire mastery of their own that would be very hard to pass on to others. What has been effective in this update may stop being so in the next one, and you'll have to come up with new builds and formations. This can be done consciously, through trial and error, or by watching other players.\n🎯8/10\n💬Legion is suitable for both professional play and casual play, but if you are a fan of the game, it will require a long-term commitment.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "🧠The game is really a time-consuming deal quite literally. It is perfectly balanced, having characters that are neither intrinsically good nor bad, unlike in the case of Warcraft 3. (There is a bear that can single-handedly kill all the enemies in a wave, or a mass build that can just spoil the game, auras covering the entire battlefield, and if you're not lucky to get one, your gaming experience will definitely be bad. And so on.)\n\nAn enjoyable and captivating tower defense game, the best I’ve ever played in this genre. Excellent graphics, novel mechanics, ranking, and a variety of modes. \nIt’s a great thrill to play with friends, devise new tactics and combinations, engage in different modes, and mess up each other because someone made a mistake: couldn't guard a wave, deployed troops on an unspecified wave, one hit the enemy while the other didn't, and so on. A game on a 4/4 map usually lasts 40-60 minutes on average, no more. But it can be quicker on a 2/2 map.\n\nMost importantly, the art style is amazing and at the same time, the statistics of each battle are shown on the screen! Damage done, taken, and so forth, and even the old Warcraft 3 scoreboard is shown: incoming and outgoing damage by armor type and unit attack.\n\nFor me, the only drawback is that the community is quite small. It seems that some games are quickly matched but in one of the games, I thought of checking the players' statistics. One player had a 20% win rate and the graph looked like an ECG. Their ratings were always above a certain point. So I would say those were bots; the graphs of real players look quite different. Still human players are often caught. Bots are compensating for the long waiting time until someone completes the game. Out of 450 people, the waiting time is around 5 minutes for a match. Always the same players. It would be awesome to meet new ones but sadly, for some reason, very few people seem to be interested in this exceptional tower defense game!\n\n✅The Good.\n- Variety of Units and Towers\n- Beautiful Visuals and Polished Design\n- Strategic Depth\n- Unique Multiplayer Gameplay\n\n❌The Bad.\n- Limited Solo Play\n- Pay-to-Win Concerns\n- Dependency on Teamwork\n- Matches Can Be Long\n\n🧾In Conclusion.\nIn order to grasp the game completely, I advise playing with bots for a while. The developers are constantly very passionate (in my opinion) about their creation, always releasing new patches, coming up with new game modes, and introducing new defenders for the King.\nThis game is worth my suggestion. It is a fantastic multiplayer game where you can win without even having to talk to your teammates. It can be a good time-wasting activity, and for some people, it might even be a great way to socialize.\nI suggest trying it out; it can definitely turn out to be thrilling.\n7.5/10🔚",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "In general, the game is similar to legion td maps from warcraft 3. There are some interesting mechanics and different types of mini-games. Playing ranked or 1v1 is more difficult than classic 4v4. I would say that changes in monthly patches affect the game styles, and sometimes you have to adjust your strategies to match the patches. But when you've figured out the basic strategies after a few months, you'll continue to play them, sometimes finding new ideas for the gameplay, especially in 4v4 with different types of mini-games that change every few hours. After two years of playing, I've managed to reach the top 100 in the classic legend rank, and I'm close to achieving this in ranked 2v2. The game is interesting, but there's not much variety after a few months or years of playing due to the nature of the game itself. So for me, it's more of a game I play occasionally to relax and check out new masterminds, gameplays, and strategies, rather than something competitive that I spend hours grinding. I would recommend playing this game if you enjoy autochess and Warcraft 3 mini-games tho.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "GIGA GAME!\n\nFun, addicting, and relatively simple, yet with surprisingly high skill ceiling.\n\nOn top of that, it even includes my country’s language (although it’s not listed on the Steam page, it’s actually in the game).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid strategy game. Kinda like Starcraft or LoL but you don't have to click as fast.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you are looking for strategic, smart but still chilly game - Legion TD 2 is really for you. Replayable game with regular updates and balance changes, which always brings new experience. Also DEVs constantly add new content, masterminds, spells - but balance remains decent. Highly recommend for TD and strategies funs!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game has been refined quite a bit since launching and for the better.  Has the feel of the original Legion TD while remaining modern, and I really enjoy balancing income/defense in this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely loving Legion TD2! The strategy depth and team synergy make every match feel unique and rewarding. Developers are super responsive and always pushing great updates. Highly recommend for anyone looking for an addictive team-based strategy game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A gem to say the least. I exclusively play Casual 4v4 and absolutely love this game. Deep strategy while simultaneously quite laid back. Morning queues are always great. Dev team is very transparent with balance philosophy and adding new units. \n\nHas the occasional snore meta's like Kingpin spam, Lioness shamans. But they quickly are addressed. I can't speak for the ranked experience, but the casual experience is quite enjoyable!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Came from Mechabellum - this is pretty fun. Dont let the 2v2 format scare you off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been lovign Legion TD since it was a Warcraft 3 Map. When you are into auto battlers or tower defense games it might be the perfect match for you!\n\nI enjoy the competitive take on this genre. There's a huge number of possible builds and a lot to learn, so it does not get boring quickly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have many more hours on Epic. This game has one of the best learning curves I've seen in a game with a competitive scene. The tutorial prepared me for the campaign, and beating that thoroughly prepared me to ascend to a respectable rank in competitive. The game has all the information you could want IN THE GAME instead of relying on external sources like a wiki to carry the burden, and if you actually pay attention to the helper bot and the analytics after a match it gives you all the information that you personally need to improve. I rarely feel after a loss that there wasn't a reason for my loss in my own gameplay, even in a 2v2 situation, as there are many ways you can compensate for a weak teammate as long as you keep a cool head.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty interesting game. but tbh i dont have the money or time to learn it rn.\r\n\r\ndef one of those games that i will just admire from far away",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game but multiplayer is very RNG based on what deck you get, some characters are way stronger than others",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for something to make your mind tingle, give yourself a challenge and also develop some critical thinking skills. This is the game for you as whatever decisions you make, it will have an effect during the game itself. Its a Tower Defense game like no other that has been existing for almost 20 years all the way back in Warcraft III: Frozen Throne. Its super casual and not really demanding, and queues are quite short and sometimes instant depending on the timing you're playing at but mostly its less than 2-3 mins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 10 hours of Mama Mayra (Hard), I’ve come to understand two things: suffering is infinite and the devs have no god\n\nYou know it's bad when you start blaming your own units for existing. Thanks, devs, now i hate pixels.some levels test your strategy. This one tests your will to live.\n\nSomeone on the dev team definitely grew up burning ants with a magnifying glass. This level is their origin story.\n\nHard Mama Mayra was a silent cry for help from a designer who clearly wasn’t hugged enough as a child",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Legion TD 2 – Multiplayer Tower Defense – A strategic blend of tower defense and auto-battler gameplay where you build armies, balance economies, and battle waves of enemies alongside or against other players. With deep unit synergies, competitive ranked play, and constant updates, it’s a dream for tacticians who love to optimize every move.\n⭐ Rating: 8.5/10 – Deep, addictive, and endlessly replayable — one of the most polished and strategic multiplayer tower defense experiences ever made.\n- Video Gameplay - https://youtu.be/lAhld2H6dxg\n- Follow my curator page - https://store.steampowered.com/curator/45547027/",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "brilliant, joined on the free weekend and looks like I'll be purchasing and sticking around for more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, I watched them on their stream for about 1 eight of the time they were on. I was impressed with the game enough to buy it. I already have bought TD5 and 6 several times so I purchased the complete edition. I am satisfied.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good recommendation to relive the old WC3 Classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome! and need esports scene.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Asked my friend years ago to get this game since me and a few others got it too, and they have a 4v4 casual mode. My friend replied back saying \"he'll wait a bit to see if we still play the game and if we still play it after a month or so, he'd get it.\" \n\nWell here were are several years later and he and I have been playing and putting hours into the game, and for the past 3 or so years, told him we'd hit the next rank up by the end of the year, and every year we hit that goal. 11/10  \n\nDefinitely worth the buy and the hours we've spent playing the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is very replayable. simple, games are a good length of time to not lose interest - but not too long, so that it feels like a drag.\r\n\r\nthe only thing stopping it from being a big hit is the graphics - obviously they aren't on par with some of the games that are easier on the eyes. but, the game play here is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Fun, Strategic Twist on Tower Defense!\r\n\r\nI've been playing tower defense games for a long time, and Legion TD 2 is definitely one of the most unique and fun ones out there. It mixes the traditional tower defense gameplay with team-based strategy, and I’ve found that every match feels different depending on how you work with your team and adapt to the enemy waves.\r\n\r\nWhat sets this game apart is how you build and manage units rather than just setting up towers. The strategy here goes beyond simple placement. there’s a lot of thinking about unit synergies, how to work with teammates, and managing resources effectively.\r\n\r\nIt’s easy to pick up but still offers plenty of challenge, and I love that the game continues to get updates with new content and balance tweaks. The community is active too, so finding a game is never a problem.\r\n\r\nIf you like strategy games or tower defense, Legion TD 2 is definitely worth checking out. It’s a blast, and there’s always something new to try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, gives the nostalgia hit of the OG WC3 mod, with many improvements. Definitely try it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game so addictive imagine you can playbtower deffense but competitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game. I especially love how there can be over 4 players in a party (even if some end up on the other team). Being able to play with anywhere across the world is also a neat feature. The campaigns are slept on, I enjoy them more than the regular game. The dedication to this game is inspiring and has earned my Labor of Love vote!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite addictive defense game. It has single player and multiplayer modes. Single player is quite challenging to complete fully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated game, endless hours of content, needs more players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun competetive game with mostly non toxic community and frequent updates. Recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game in the TD Genre, gets a bit repetitive for me after a while but its a good game and definitely worth a purchase when its on discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Community has been friendly from what I've seen, there's a lot to the game and I love that it's a competitive game where I don't need to use 100% of my attention through the whole game to perform well, you strategize, but you don't need lightning reflexes, insane aim, or elaborate strategies coordinated between 5 or 6 teammates involving decent communication skills, you just gotta know the rules, and you can kinda play it however you want. Scratches the competitive itch without making me wanna toaster bath, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dynamic and never the same twice, with a multitude of difficulty levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had no idea about anything to do with these types of games but A++++. Really enjoying learning something new for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game for weirdos, in the best way.\r\n\r\nIt's exactly how I remember it from the WC3 arcade but with a bunch of positive changes.  Shockingly well balanced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing every custom TD map in Warcraft 3 for 20 years, my best friend and I needed something fresh, and here we are. Of course, it doesn’t bring back the old memories of walking home from school to log into Battle.net, playing Dota and TD, and chatting on Teamspeak until mom scolded us—but we still loved it.\n\nWhat I want to say is: if you’re missing playing TD in Warcraft 3, I strongly recommend that you go ahead and buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good game, a tad different from its WC3 conterpart but nonetheless a good game for those like myself who enjoy the mod WC3 this is a must have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "at first i was very sceptical..but the 3 star campaign missions and a few rounds unranked and i am a bit hooked. it is a good strategy game for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game, might seem hard to start as there is a lot of knowledge to acquire but PvP is very honest regardless and the tutorial does cover all the basics.\nI was afraid at the start to start playing it but once I completed few solo missions I was fine jumping into PvP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game I have ever played, one of the only games I have not stopped playing for who knows how long, since it was a WC3 custom map",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This seems the kind of game that is easy to learn, hard to master. I am only just starting but so far this is a great game, that I know I will spend many hours in, mainly thanks to multiplayer. \r\n\r\nWhen I bought the game I imagined myself focussing on the campagne. Mainly because pictured myself being totally destroyed online, but the ranked multiplayer matches you against opponents of your level.\r\n\r\nDid some games vs AI, did some of the campaign, did some MP... the game is running smooth both on windows and on my laptop with Linux/proton.\r\n\r\nI bought the game on discount for like 10 euros with the 2 DLC's included. Definitely a steal, I am delighted with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very addictive, Add more workers and you'll see another day! 10/10 from Ign!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game during the free weekend and realized after around 5 hours that I'd need to buy the game once the free license expired. Still having a blast with it and really enjoying how it feels like a more refined version of the Warcraft 3 map with more quality of life features, customization, and community options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game off and on for years, still great!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun to play with a lot that can be learnt. love the skill ceiling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Tower Defense Game!  I saw someone playing it randomly recently and thought I would give it a try.  Now i'm hooked, and play with my friend.  I highly suggest getting all the DL content.  Love that they keep updating this game with patches and content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The nostalgia is real: the same addictive loop, the same rush of outsmarting your opponent, but now beautifully redone for today’s audience. Whether you’re a veteran of the Warcraft III modding scene or a newcomer curious about one of the most beloved tower defense/auto-battler hybrids ever made, Legion TD 2 is absolutely worth purchasing.\r\n\r\nHighly recommended for anyone who wants to relive the magic—this is the definitive way to experience Legion TD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brings back the nostalgia from the original but with more depth and strategy, love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ballin' little dudes march up the Ballin' field and BALL HARD! Ballin' strategy, ballin' opponents, BALLIN' TD!\r\n\r\n6.1/6 BALLS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a simple and great Tower Defence game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely well balanced and deep strategy game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game, played Legion TD 1 from the OG Dota and Garena days.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Deep strategy and tower defense game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty good, bounced off it a few years ago but came back to find it's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legion TD but witha 2 and better design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple game, was and still am a Legion TD Wc3 Fan been playing since I was a kid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The perfect balance between complexity and enjoyment",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun to play , difficult to master",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pick it up if you like pvp TD that feels still like pve (~outsmarting the AI)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems to me it IS the best TD right now",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is better than jorking my peanits",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Underrated game, great fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a well made tower defense/offense team game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game just like old times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mind blowing strategy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cant beat the hard campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best TD ever",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like old TD games, buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, why not give it a try if you have some free time?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "real fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is slept on 100%",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good td",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good with friends! (well i made this for the steam mission..)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Staple game in my rotation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "True to the spirit of the OG Legion TD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good gimma",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good TD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kind of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best TD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always come back to play this TD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I appreciate the developers giving us a chance to try this game in its entirety. Here's what I can tell you from my short time with the game.\n1. It seems to have a focus on PVP\n2. It has a decent tutorial that gets you up and running quickly\n3. It feels pretty easy to learn and get into\n4. The problems you'll have to solve while playing have mostly to do with determining what to build and when, whether you want to add another tower and which ones, or add to your economy. This balance between power and economy becomes the central problem you'll have to solve. There are tool tips that tell you how much power you should try to have at certain times in the game relieving some of the burden on the player. \n\nFor me as someone who prefers to play TD as a single player game, I found myself feeling like I didn't have enough choices to make the game interesting. I also wish there could have been a micromanagement mechanic like buying and selling towers at the right times to maximize revenue through interest or maybe even a guy I could control to fight enemies with. I noticed that at certain levels you do get spells, but i don't know how interesting that made the game since I didn't really make it that far before giving up on the game. \n\nTLDR: I appreciate the chance to try,  but it's not for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is fun but requires to be online for singleplayer and against bots.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mandatory twitch stream icon that is IN-GAME, major fail\nhilariously one of the tutorial missions are bugged and doesn't work, you have to close the entire game test to exit the bugged out tutorial mission, \n\ngame forces you to look a twitch icons and notifications with NO option to remove = major mistake\n\ngame has stuttering and frame rate drops on LOADING screens\n\n-might be the best tower defense game out there if they would just take themselves seriously and fix there game, i've set the music to 0% 10 times and its still on full blast\n\nthe pause button is 1 milimeter wide.....\n\nthere is no way to skip to the next round.... \n\n+excellent voices for the units, the voicing is easily 90% they are that good\n\n-the in game ***premium*** currency is a major mistake, you are NOT blizzard\n\nThe different factions are awesome!! It's really just the mandatory twitch involvement that ruins the game, otherwise it really does have a chance at being quite amazing because of the awesome faction variety",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just... boring and outdated. Very few units per faction, poorly explained unit tooltips and ability tool tips.\r\n\r\nThe target audience is likely the people who played it back in WC3 (me included) but that are fine with stagnant design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got banned at my first game because i was too slow and didnt send troops, what a fail....he didnt come back .lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is worse than the original custom game from Warcraft 3 in every way possible, that's definitely an achievement!\n1. The gameplay is the same, but simpler, no base upgrades or worker upgrades, you can just buy more workers to increase your lumber income (that's all). \n2. The upgrades for the king cost exactly the same as the mercenaries and provide the same income bonuses permanently (with no cost scaling), again idk why\n3. The interface is f*ed up for some reason, the text is either very small, or with increased interface scale just not aligned properly\n4. The graphics are not better, or arguably even worse than in original wc3 custom game\n5. The performance..what can i say...sometimes it freezes for a second...on modern core i7 and rtx 5070ti\n\n20 Years of game development in vain, this is worse than original warcraft 3 custom game mode in every way, sad :(\n\nRefunded",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fix your broken matchmaking and even more broken timeout distribution system and what's the problem with leaving a lost game without wasting extra 15-20 minutes pointlessly playing? Yes, there's a surrender option in the menu, but if your teammate is a loser, which is true 99% of the time because they don't want to surrender, then what other solution, dear developers? Why should I have to sit through every game like a bot? I think you're just stupid if you can't admit the obvious. Oh yeah, they also created a ban system for leaving games.\nSo, if the random player gives you useless units, stay in the game until the end. If you have another loser on your team, stay in until the end anyway.\nBasically, make a proper 1v1 mode or cancel your nonsense with a timeout for leaving matches. So far, the game developers are stupid and can't accept the reality that they don't pay me to play their game, and therefore it's not up to them to decide whether I should sit out a pointless game until the end or not.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not recommended - we-know-better-than-the-user designs detected.\n\nThe game could be much better optimized. The menu already takes up 3.0 gigabytes of RAM. You know, in a Tower Defense game - one of the simplest there is. To make matters worse, the developers decided to make the default detail levels 'Ultra' and 'High.' Did I mention this game is not well optimized.\n\nThe tutorial does not work in some places and makes no sense in others. Case to point, what does \"you must send +6 Snail before the combat ends.\" The reason it fails you is that sending mercenaries earns you PERMANENT income even if they all die. That makes zero sense.\n\nWas this game beta tested at all? How do you fail at making a tutorial? You are supposed to understand the game as a developer. Even if you know that this Snail is a weak mercenary i.e. an offensive troop, it is pointless because Snails are so weak they are practically useless at dealing damage.\n\nLong loading times for a game of a couple gigabytes in size.\n\nObvious AI voices. It is disturbingly cheap stuff. They picked one with a robotic BBC accent. It feels to calculated because it conforms the weird stereotype of Americans liking that accent for more or less perverse reasons.\n\nIf you try to use DX 9 renders, the 'Continue' buttons stop working. Great held-together-by-a-tape programming right there.\n\nEven after you realize you know what you are supposed to do, the boredom gets even worse because it is a vapid horde mode of diminishing some enemy units HP to zero. It is trite even by Tower Defense standards.\n\nThis game is extremely overt about it being about spamming units in the most automated and routine way possible. That does not inspire having fun. Instead it is about inserting the players into the arbitrary rails set by the developers. The whole concept is flawed. It makes Defence of the Ancients (DOTA) seem like the best thing ever in comparison (it is the same repetitive slop though at least you have the freedom of movement in DOTA).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "playing story mode and on the section island - level 5 is nearly impossible to beat - game not balanced - tried it over 15 times - the rest were relatively easy.\r\n\r\nIf you're looking at just playing PVP, then get this, if not, don't bother purchasing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's just okay. If it had a healthy player base and ranked solo queue wasn't filled with players who have no idea how to play the game then it might be more enjoyable. If you're like me and enjoy the ladder and want to learn the meta/progress- you're going to get the worst teammates imaginable who just open fort when you play Fiesta etc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's just not fun. There's a lot to learn, and then the time investment in doing so just doesn't pay off. I thought it was a tower defense game, but it's really just a basic auto battler",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most un-fun tower defense games I've ever played. Centered around PVP and full of cringe-worthy crap, such as \"NOT EVEN CLOSE\" if your base gets low HP. Even the bots, if you choose to fight them, spam emojis at you. It crosses the \"references\" line into unoriginality with how many units are copies from other games, down to what they say. Campaign on 2 star is so baby-shit easy it's boring, but on 3 star it's impossible. I would refund this, if I could.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It was fun trying out the 8 different factions.  Then I realized it was just the same game over and over and it's all about memorizing build orders and what units are best.  It's hilarious that the description for this game is \"infinitely replayable\" because this might be one of the least replayable games I've ever seen.  Also the \"recommended\" tips and fight value are horrendous.  Fighter value means nothing.  I can win with a value deficit or lose with hundreds extra.  It doesn't matter.  Since it doesn't matter the game will tell you to build workers when you need army or build army when you need workers.  The only way to know is to memorize what actually works and at that point there's no game left.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It didn't really suit my style. I like defensive games, but this one didn't appeal to me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "the basic game is good but the multiplayer is unbalanced and thats a major thing in the game, after some point im paired with a lot of bad players even and thats ruin the expirience, please take care of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The slightly cartoony graphics reminded me of old Warcraft and the tower defense setup seemed like a casual way to spend fifteen minutes here and there, but the leaderboards, seasons and loss tracking tell me it's just another magnet for toxicly competitive tryhards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring and monotonous. EVERY match is the same",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is BS. If you do not know a developer, you wont win.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just make sure you save at wave 17+ or prepare to be berated. This what i have learned so far in 60 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Opens the browser without warning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0/10 ı m not accept contract",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ita shiti an poopa but art looki okaia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Warcraft 3 does it better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A TERRIBLE GAME FOR SOLO PLAYERS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bruh where are the tiddiz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matchmaking is horribly unbalanced, roughly 90% of the players in queue are literal actual nonhuman bots, targeting RNG is an enormous part of the game, (just try running some weekly challenge winners in sandbox), and the lead dev thinks it is ideal that you can tell who will win most games from the draft luck they get.  The economics are horrible right now and the first 11 waves make literally no difference to the end result of a game.  Virtually no send diversity since the pack leader and safety mole changes.  I would go as far as saying ranked mode is completely unplayable when solo queuing.\n\nThe dev response is lying, compare steam charts to the claimed playercount in game or on drachbot.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Limited game with a poor AI balance making the single player very boring.  A game only about patterns, almost zero skill or different approaches to win.  You're locked into certain placements and cadences to win.  It's a game of memorizing and for autists and people that hyper-fixate",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "no longer very fun. you cant play long games everybody just hard sends constantly. no fun to test unit comps or anything like that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was having fun with this game. After a handful of levels I found out I had to buy DLC to play next part of the solo campaign. It felt like I was just getting started in the game and I had to pay to keep playing. That will be a pass from me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you look at the Kickstarter, if you look at the initial launch, none of the promises came to fruition. 4v4 was the intent, now it's an afterthought. Mod support was promised, still no mod support, but boy do they like to add skins for purchase! They've teased a mazing option in the past, that never happened. These devs over promised, under delivered, and continue to fail. Previous patch is an absolute hot mess. And that's before you consider everything piggybacks off other services. This is a Unity game and everything ties into something external. I cannot, not recommend this enough to people. Stay far, far away unless it's bought by competent developers or they actually offer a fraction of the stuff they promised. It's an absolute shame that they got Kickstarter money and brought this out of Early Access without offering any of the features they promised. Borderline thieves.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I appreciate the developers giving us a chance to try this game in its entirety. Here's what I can tell you from my short time with the game.\n1. It seems to have a focus on PVP\n2. It has a decent tutorial that gets you up and running quickly\n3. It feels pretty easy to learn and get into\n4. The problems you'll have to solve while playing have mostly to do with determining what to build and when, whether you want to add another tower and which ones, or add to your economy. This balance between power and economy becomes the central problem you'll have to solve. There are tool tips that tell you how much power you should try to have at certain times in the game relieving some of the burden on the player. \n\nFor me as someone who prefers to play TD as a single player game, I found myself feeling like I didn't have enough choices to make the game interesting. I also wish there could have been a micromanagement mechanic like buying and selling towers at the right times to maximize revenue through interest or maybe even a guy I could control to fight enemies with. I noticed that at certain levels you do get spells, but i don't know how interesting that made the game since I didn't really make it that far before giving up on the game. \n\nTLDR: I appreciate the chance to try,  but it's not for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This \"game\" is only for those who want to learn  and re-learn everything every month. constant nerfs to everything that works and minor buffs to some things that dont work. its an additional job to keep up with everything that changes each month. no thank you. after 300+ hours its already annoying.\n\nbattle pass? really? nothing to make the game enjoyable to broader audience, yet a gacha or FOMO mechanic, easy? just wow\n\nno offline mode. at all. want to play with AI? nope. you wouldnt even enter the game without internet. if you didnt read carefully the description to find the small sidenote about that in the middle, not even highlighted or anything (like, who the hell reads the whole description about a game based on a wc3 map?), you're straight out of luck",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Game is fun but requires to be online for singleplayer and against bots.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mandatory twitch stream icon that is IN-GAME, major fail\nhilariously one of the tutorial missions are bugged and doesn't work, you have to close the entire game test to exit the bugged out tutorial mission, \n\ngame forces you to look a twitch icons and notifications with NO option to remove = major mistake\n\ngame has stuttering and frame rate drops on LOADING screens\n\n-might be the best tower defense game out there if they would just take themselves seriously and fix there game, i've set the music to 0% 10 times and its still on full blast\n\nthe pause button is 1 milimeter wide.....\n\nthere is no way to skip to the next round.... \n\n+excellent voices for the units, the voicing is easily 90% they are that good\n\n-the in game ***premium*** currency is a major mistake, you are NOT blizzard\n\nThe different factions are awesome!! It's really just the mandatory twitch involvement that ruins the game, otherwise it really does have a chance at being quite amazing because of the awesome faction variety",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just... boring and outdated. Very few units per faction, poorly explained unit tooltips and ability tool tips.\r\n\r\nThe target audience is likely the people who played it back in WC3 (me included) but that are fine with stagnant design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got banned at my first game because i was too slow and didnt send troops, what a fail....he didnt come back .lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love the game, the game is really fun however the ranking system needs to be changed, you can win 24 games in a row and still be silver. It takes so stupidly long to rank up. its not about how good you are its just how many games you play. \n\nstarting from bronze 4 (the bottom) 25 games with a 90% win rate just gets you to silver 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I played this game for many, many hours. First coming from WC like many others, this game felt like a dream come true. The ways to play were numerous, enjoyable and allowed a lot of experimentation. Over the years this has... changed. Mostly, this is due to repeated nerfs that have reduced the usefulness of troops to a near zero. \n\nAs an example, the eco playstyle. If one player in the team chose to focus on sending, while the other builds, it created a new dynamic. However, this game over time has implemented many hidden systems. This results in significantly reduced income, materials and other nerfs that are not visible, mentioned or evident. It translates to not being able to pinpoint why your strategy that was very successful in the past is now completely unviable. \n\nIf you do not continually review the patch notes, experiment and develop your playstyle, you will lose. If you try to play the game casually, a few rounds a week, you will lose. If you have a preferred playstyle, eventually you will lose. \n\nThe game is great, however the continual forced nerfs in order to push players to play certain ways are very much killing the game. It feels as though the dev watches the matches like TV and just tries to control what shows are on.\n\nAs an example, double lock in was a mastermind shortly... Emphasis on shortly.\n\nIf you want a fresh new experience daily, this game is perfect. You'll never know what to expect. If you want a familiar favourite, this may not be the one anymore; sadly.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everyone just cries when you play to win instead of just playing for as long possible",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is worse than the original custom game from Warcraft 3 in every way possible, that's definitely an achievement!\n1. The gameplay is the same, but simpler, no base upgrades or worker upgrades, you can just buy more workers to increase your lumber income (that's all). \n2. The upgrades for the king cost exactly the same as the mercenaries and provide the same income bonuses permanently (with no cost scaling), again idk why\n3. The interface is f*ed up for some reason, the text is either very small, or with increased interface scale just not aligned properly\n4. The graphics are not better, or arguably even worse than in original wc3 custom game\n5. The performance..what can i say...sometimes it freezes for a second...on modern core i7 and rtx 5070ti\n\n20 Years of game development in vain, this is worse than original warcraft 3 custom game mode in every way, sad :(\n\nRefunded",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"one star = trivial, two star = trivial, three star = only feasible for players with hundreds of hours who have memorized the entire unit roster\" isn't a fun campaign progression.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix your broken matchmaking and even more broken timeout distribution system and what's the problem with leaving a lost game without wasting extra 15-20 minutes pointlessly playing? Yes, there's a surrender option in the menu, but if your teammate is a loser, which is true 99% of the time because they don't want to surrender, then what other solution, dear developers? Why should I have to sit through every game like a bot? I think you're just stupid if you can't admit the obvious. Oh yeah, they also created a ban system for leaving games.\nSo, if the random player gives you useless units, stay in the game until the end. If you have another loser on your team, stay in until the end anyway.\nBasically, make a proper 1v1 mode or cancel your nonsense with a timeout for leaving matches. So far, the game developers are stupid and can't accept the reality that they don't pay me to play their game, and therefore it's not up to them to decide whether I should sit out a pointless game until the end or not.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i have been playing the game since pre-relese. every time there is a fun combo or strong pair instead of building a counter they nerf everything into the ground. recently they hot fixed special modes to make mercs less powerful, even though players were having fun.... stop being lazy if the players were having fun build in a counter or let them have their fun...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended - we-know-better-than-the-user designs detected.\n\nThe game could be much better optimized. The menu already takes up 3.0 gigabytes of RAM. You know, in a Tower Defense game - one of the simplest there is. To make matters worse, the developers decided to make the default detail levels 'Ultra' and 'High.' Did I mention this game is not well optimized.\n\nThe tutorial does not work in some places and makes no sense in others. Case to point, what does \"you must send +6 Snail before the combat ends.\" The reason it fails you is that sending mercenaries earns you PERMANENT income even if they all die. That makes zero sense.\n\nWas this game beta tested at all? How do you fail at making a tutorial? You are supposed to understand the game as a developer. Even if you know that this Snail is a weak mercenary i.e. an offensive troop, it is pointless because Snails are so weak they are practically useless at dealing damage.\n\nLong loading times for a game of a couple gigabytes in size.\n\nObvious AI voices. It is disturbingly cheap stuff. They picked one with a robotic BBC accent. It feels to calculated because it conforms the weird stereotype of Americans liking that accent for more or less perverse reasons.\n\nIf you try to use DX 9 renders, the 'Continue' buttons stop working. Great held-together-by-a-tape programming right there.\n\nEven after you realize you know what you are supposed to do, the boredom gets even worse because it is a vapid horde mode of diminishing some enemy units HP to zero. It is trite even by Tower Defense standards.\n\nThis game is extremely overt about it being about spamming units in the most automated and routine way possible. That does not inspire having fun. Instead it is about inserting the players into the arbitrary rails set by the developers. The whole concept is flawed. It makes Defence of the Ancients (DOTA) seem like the best thing ever in comparison (it is the same repetitive slop though at least you have the freedom of movement in DOTA).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just go on WC3 Reforge, this is just trash compared to multiple original versions of Legion TD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "playing story mode and on the section island - level 5 is nearly impossible to beat - game not balanced - tried it over 15 times - the rest were relatively easy.\r\n\r\nIf you're looking at just playing PVP, then get this, if not, don't bother purchasing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's just okay. If it had a healthy player base and ranked solo queue wasn't filled with players who have no idea how to play the game then it might be more enjoyable. If you're like me and enjoy the ladder and want to learn the meta/progress- you're going to get the worst teammates imaginable who just open fort when you play Fiesta etc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a decent game but you have teammates from all over the world and for years now these guys havent done anything about it. If i worked hard to get to expert and then have a GERMAN teammate that doesnt speak english. Then COMPLAINS and files on me because hes doing whatever he wants even if i attempt to speak while trying to stay alive. There is a big problem here. These people add new skins add a few units here and there tweak existing ones yup thats fine and dandy but IF I CANNOT communicate with a teammate on a ranked game ffs fuck off",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just not fun. There's a lot to learn, and then the time investment in doing so just doesn't pay off. I thought it was a tower defense game, but it's really just a basic auto battler",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most un-fun tower defense games I've ever played. Centered around PVP and full of cringe-worthy crap, such as \"NOT EVEN CLOSE\" if your base gets low HP. Even the bots, if you choose to fight them, spam emojis at you. It crosses the \"references\" line into unoriginality with how many units are copies from other games, down to what they say. Campaign on 2 star is so baby-shit easy it's boring, but on 3 star it's impossible. I would refund this, if I could.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "There is no power progression at all. Gameplay is fun, but unless you like games that have no progression systems, I would pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun trying out the 8 different factions.  Then I realized it was just the same game over and over and it's all about memorizing build orders and what units are best.  It's hilarious that the description for this game is \"infinitely replayable\" because this might be one of the least replayable games I've ever seen.  Also the \"recommended\" tips and fight value are horrendous.  Fighter value means nothing.  I can win with a value deficit or lose with hundreds extra.  It doesn't matter.  Since it doesn't matter the game will tell you to build workers when you need army or build army when you need workers.  The only way to know is to memorize what actually works and at that point there's no game left.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Each round feels very samey, not much variation. There's missions where it's not clear at all what I'm supposed to be doing differently, and too many windows to monitor to keep track of everything easily. All of the unlockable skins are super ugly, no interest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trashy matchmaking, smurfs and nothing more",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It didn't really suit my style. I like defensive games, but this one didn't appeal to me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "the basic game is good but the multiplayer is unbalanced and thats a major thing in the game, after some point im paired with a lot of bad players even and thats ruin the expirience, please take care of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The slightly cartoony graphics reminded me of old Warcraft and the tower defense setup seemed like a casual way to spend fifteen minutes here and there, but the leaderboards, seasons and loss tracking tell me it's just another magnet for toxicly competitive tryhards.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring and monotonous. EVERY match is the same",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is BS. If you do not know a developer, you wont win.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just make sure you save at wave 17+ or prepare to be berated. This what i have learned so far in 60 hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "0/10 ı m not accept contract",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "ita shiti an poopa but art looki okaia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Warcraft 3 does it better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A TERRIBLE GAME FOR SOLO PLAYERS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bruh where are the tiddiz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matchmaking is horribly unbalanced, roughly 90% of the players in queue are literal actual nonhuman bots, targeting RNG is an enormous part of the game, (just try running some weekly challenge winners in sandbox), and the lead dev thinks it is ideal that you can tell who will win most games from the draft luck they get.  The economics are horrible right now and the first 11 waves make literally no difference to the end result of a game.  Virtually no send diversity since the pack leader and safety mole changes.  I would go as far as saying ranked mode is completely unplayable when solo queuing.\n\nThe dev response is lying, compare steam charts to the claimed playercount in game or on drachbot.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Limited game with a poor AI balance making the single player very boring.  A game only about patterns, almost zero skill or different approaches to win.  You're locked into certain placements and cadences to win.  It's a game of memorizing and for autists and people that hyper-fixate",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "no longer very fun. you cant play long games everybody just hard sends constantly. no fun to test unit comps or anything like that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was having fun with this game. After a handful of levels I found out I had to buy DLC to play next part of the solo campaign. It felt like I was just getting started in the game and I had to pay to keep playing. That will be a pass from me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you look at the Kickstarter, if you look at the initial launch, none of the promises came to fruition. 4v4 was the intent, now it's an afterthought. Mod support was promised, still no mod support, but boy do they like to add skins for purchase! They've teased a mazing option in the past, that never happened. These devs over promised, under delivered, and continue to fail. Previous patch is an absolute hot mess. And that's before you consider everything piggybacks off other services. This is a Unity game and everything ties into something external. I cannot, not recommend this enough to people. Stay far, far away unless it's bought by competent developers or they actually offer a fraction of the stuff they promised. It's an absolute shame that they got Kickstarter money and brought this out of Early Access without offering any of the features they promised. Borderline thieves.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I appreciate the developers giving us a chance to try this game in its entirety. Here's what I can tell you from my short time with the game.\n1. It seems to have a focus on PVP\n2. It has a decent tutorial that gets you up and running quickly\n3. It feels pretty easy to learn and get into\n4. The problems you'll have to solve while playing have mostly to do with determining what to build and when, whether you want to add another tower and which ones, or add to your economy. This balance between power and economy becomes the central problem you'll have to solve. There are tool tips that tell you how much power you should try to have at certain times in the game relieving some of the burden on the player. \n\nFor me as someone who prefers to play TD as a single player game, I found myself feeling like I didn't have enough choices to make the game interesting. I also wish there could have been a micromanagement mechanic like buying and selling towers at the right times to maximize revenue through interest or maybe even a guy I could control to fight enemies with. I noticed that at certain levels you do get spells, but i don't know how interesting that made the game since I didn't really make it that far before giving up on the game. \n\nTLDR: I appreciate the chance to try,  but it's not for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This \"game\" is only for those who want to learn  and re-learn everything every month. constant nerfs to everything that works and minor buffs to some things that dont work. its an additional job to keep up with everything that changes each month. no thank you. after 300+ hours its already annoying.\n\nbattle pass? really? nothing to make the game enjoyable to broader audience, yet a gacha or FOMO mechanic, easy? just wow\n\nno offline mode. at all. want to play with AI? nope. you wouldnt even enter the game without internet. if you didnt read carefully the description to find the small sidenote about that in the middle, not even highlighted or anything (like, who the hell reads the whole description about a game based on a wc3 map?), you're straight out of luck",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Game is fun but requires to be online for singleplayer and against bots.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mandatory twitch stream icon that is IN-GAME, major fail\nhilariously one of the tutorial missions are bugged and doesn't work, you have to close the entire game test to exit the bugged out tutorial mission, \n\ngame forces you to look a twitch icons and notifications with NO option to remove = major mistake\n\ngame has stuttering and frame rate drops on LOADING screens\n\n-might be the best tower defense game out there if they would just take themselves seriously and fix there game, i've set the music to 0% 10 times and its still on full blast\n\nthe pause button is 1 milimeter wide.....\n\nthere is no way to skip to the next round.... \n\n+excellent voices for the units, the voicing is easily 90% they are that good\n\n-the in game ***premium*** currency is a major mistake, you are NOT blizzard\n\nThe different factions are awesome!! It's really just the mandatory twitch involvement that ruins the game, otherwise it really does have a chance at being quite amazing because of the awesome faction variety",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just... boring and outdated. Very few units per faction, poorly explained unit tooltips and ability tool tips.\r\n\r\nThe target audience is likely the people who played it back in WC3 (me included) but that are fine with stagnant design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got banned at my first game because i was too slow and didnt send troops, what a fail....he didnt come back .lol",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love the game, the game is really fun however the ranking system needs to be changed, you can win 24 games in a row and still be silver. It takes so stupidly long to rank up. its not about how good you are its just how many games you play. \n\nstarting from bronze 4 (the bottom) 25 games with a 90% win rate just gets you to silver 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I played this game for many, many hours. First coming from WC like many others, this game felt like a dream come true. The ways to play were numerous, enjoyable and allowed a lot of experimentation. Over the years this has... changed. Mostly, this is due to repeated nerfs that have reduced the usefulness of troops to a near zero. \n\nAs an example, the eco playstyle. If one player in the team chose to focus on sending, while the other builds, it created a new dynamic. However, this game over time has implemented many hidden systems. This results in significantly reduced income, materials and other nerfs that are not visible, mentioned or evident. It translates to not being able to pinpoint why your strategy that was very successful in the past is now completely unviable. \n\nIf you do not continually review the patch notes, experiment and develop your playstyle, you will lose. If you try to play the game casually, a few rounds a week, you will lose. If you have a preferred playstyle, eventually you will lose. \n\nThe game is great, however the continual forced nerfs in order to push players to play certain ways are very much killing the game. It feels as though the dev watches the matches like TV and just tries to control what shows are on.\n\nAs an example, double lock in was a mastermind shortly... Emphasis on shortly.\n\nIf you want a fresh new experience daily, this game is perfect. You'll never know what to expect. If you want a familiar favourite, this may not be the one anymore; sadly.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everyone just cries when you play to win instead of just playing for as long possible",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is worse than the original custom game from Warcraft 3 in every way possible, that's definitely an achievement!\n1. The gameplay is the same, but simpler, no base upgrades or worker upgrades, you can just buy more workers to increase your lumber income (that's all). \n2. The upgrades for the king cost exactly the same as the mercenaries and provide the same income bonuses permanently (with no cost scaling), again idk why\n3. The interface is f*ed up for some reason, the text is either very small, or with increased interface scale just not aligned properly\n4. The graphics are not better, or arguably even worse than in original wc3 custom game\n5. The performance..what can i say...sometimes it freezes for a second...on modern core i7 and rtx 5070ti\n\n20 Years of game development in vain, this is worse than original warcraft 3 custom game mode in every way, sad :(\n\nRefunded",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"one star = trivial, two star = trivial, three star = only feasible for players with hundreds of hours who have memorized the entire unit roster\" isn't a fun campaign progression.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix your broken matchmaking and even more broken timeout distribution system and what's the problem with leaving a lost game without wasting extra 15-20 minutes pointlessly playing? Yes, there's a surrender option in the menu, but if your teammate is a loser, which is true 99% of the time because they don't want to surrender, then what other solution, dear developers? Why should I have to sit through every game like a bot? I think you're just stupid if you can't admit the obvious. Oh yeah, they also created a ban system for leaving games.\nSo, if the random player gives you useless units, stay in the game until the end. If you have another loser on your team, stay in until the end anyway.\nBasically, make a proper 1v1 mode or cancel your nonsense with a timeout for leaving matches. So far, the game developers are stupid and can't accept the reality that they don't pay me to play their game, and therefore it's not up to them to decide whether I should sit out a pointless game until the end or not.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i have been playing the game since pre-relese. every time there is a fun combo or strong pair instead of building a counter they nerf everything into the ground. recently they hot fixed special modes to make mercs less powerful, even though players were having fun.... stop being lazy if the players were having fun build in a counter or let them have their fun...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not recommended - we-know-better-than-the-user designs detected.\n\nThe game could be much better optimized. The menu already takes up 3.0 gigabytes of RAM. You know, in a Tower Defense game - one of the simplest there is. To make matters worse, the developers decided to make the default detail levels 'Ultra' and 'High.' Did I mention this game is not well optimized.\n\nThe tutorial does not work in some places and makes no sense in others. Case to point, what does \"you must send +6 Snail before the combat ends.\" The reason it fails you is that sending mercenaries earns you PERMANENT income even if they all die. That makes zero sense.\n\nWas this game beta tested at all? How do you fail at making a tutorial? You are supposed to understand the game as a developer. Even if you know that this Snail is a weak mercenary i.e. an offensive troop, it is pointless because Snails are so weak they are practically useless at dealing damage.\n\nLong loading times for a game of a couple gigabytes in size.\n\nObvious AI voices. It is disturbingly cheap stuff. They picked one with a robotic BBC accent. It feels to calculated because it conforms the weird stereotype of Americans liking that accent for more or less perverse reasons.\n\nIf you try to use DX 9 renders, the 'Continue' buttons stop working. Great held-together-by-a-tape programming right there.\n\nEven after you realize you know what you are supposed to do, the boredom gets even worse because it is a vapid horde mode of diminishing some enemy units HP to zero. It is trite even by Tower Defense standards.\n\nThis game is extremely overt about it being about spamming units in the most automated and routine way possible. That does not inspire having fun. Instead it is about inserting the players into the arbitrary rails set by the developers. The whole concept is flawed. It makes Defence of the Ancients (DOTA) seem like the best thing ever in comparison (it is the same repetitive slop though at least you have the freedom of movement in DOTA).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just go on WC3 Reforge, this is just trash compared to multiple original versions of Legion TD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "playing story mode and on the section island - level 5 is nearly impossible to beat - game not balanced - tried it over 15 times - the rest were relatively easy.\r\n\r\nIf you're looking at just playing PVP, then get this, if not, don't bother purchasing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's just okay. If it had a healthy player base and ranked solo queue wasn't filled with players who have no idea how to play the game then it might be more enjoyable. If you're like me and enjoy the ladder and want to learn the meta/progress- you're going to get the worst teammates imaginable who just open fort when you play Fiesta etc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its a decent game but you have teammates from all over the world and for years now these guys havent done anything about it. If i worked hard to get to expert and then have a GERMAN teammate that doesnt speak english. Then COMPLAINS and files on me because hes doing whatever he wants even if i attempt to speak while trying to stay alive. There is a big problem here. These people add new skins add a few units here and there tweak existing ones yup thats fine and dandy but IF I CANNOT communicate with a teammate on a ranked game ffs fuck off",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just not fun. There's a lot to learn, and then the time investment in doing so just doesn't pay off. I thought it was a tower defense game, but it's really just a basic auto battler",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the most un-fun tower defense games I've ever played. Centered around PVP and full of cringe-worthy crap, such as \"NOT EVEN CLOSE\" if your base gets low HP. Even the bots, if you choose to fight them, spam emojis at you. It crosses the \"references\" line into unoriginality with how many units are copies from other games, down to what they say. Campaign on 2 star is so baby-shit easy it's boring, but on 3 star it's impossible. I would refund this, if I could.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "There is no power progression at all. Gameplay is fun, but unless you like games that have no progression systems, I would pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun trying out the 8 different factions.  Then I realized it was just the same game over and over and it's all about memorizing build orders and what units are best.  It's hilarious that the description for this game is \"infinitely replayable\" because this might be one of the least replayable games I've ever seen.  Also the \"recommended\" tips and fight value are horrendous.  Fighter value means nothing.  I can win with a value deficit or lose with hundreds extra.  It doesn't matter.  Since it doesn't matter the game will tell you to build workers when you need army or build army when you need workers.  The only way to know is to memorize what actually works and at that point there's no game left.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Each round feels very samey, not much variation. There's missions where it's not clear at all what I'm supposed to be doing differently, and too many windows to monitor to keep track of everything easily. All of the unlockable skins are super ugly, no interest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trashy matchmaking, smurfs and nothing more",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It didn't really suit my style. I like defensive games, but this one didn't appeal to me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "the basic game is good but the multiplayer is unbalanced and thats a major thing in the game, after some point im paired with a lot of bad players even and thats ruin the expirience, please take care of it.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}