{
  "positive": [
    {
      "review": "its just so fun playing with other people and talkeing and makeing new friends!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game for all ages. Also very great to be able to play on any platform with friends :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great community better than Roblox's community, lots of little kids are not on Junior accounts though, the games inside of rec room aren't the highest quality but are still great, has good moderation, is very slowly starting to die. 9/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have no idea what's up with all of the bad reviews. I've been playing this game since 2021 and even though the creators have made some stupid decisions, it's a pretty good damn game. You can make your own games, earn real money, kinda like roblox. It has an awesome community and you can find awesome people.\r\n\r\nI really recommend you play this game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a good voice chat game with online good game but just the loading it sayed rec room exe is not responding 12 times in 10 minutes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been play this game since 2017 from my PlayStation VR, it is amazing so much more better than VRChat, so much more to do rather than just sitting there and chatting and being bored, Rec Room at least has quest and stuff to do on there, VRchat bores me 🥱",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's really fun.. depending on who you are playing with, and what you are playing...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This can be the best VR game that you will ever play if you have a couple of friends to play with. getting 40 hits in paintball will never be unfun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Have Been Playing Since 2022 i must say this game has changed ALOT but it is still good fun with friends. or solo. So get it its FREE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I love this game. \nI have met so many close friends there, I have discovered myself and honed my skills. Most of my childhood was this\nThe games are fun, the people are nice and its a better alternative to a lot of online games I see out there\nGet this, and I hope you create as many fond memories of it as I have.\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is honestly amazing and i love to see new players join the creative world of rec room",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun but better in vr for a better and nicer experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i used to play this game when i was little there was many times i got jr account and i used to be sad but when i got older the game started to turn bad by its self its like the more they update the game the more poop it got this really feels weird from once playing a game i loved to now joining the rec center and seeing brain rot i think this game was the best when it was in its prime but know its just trash i dont think the game is ever going to be the same but im glad as a kid i played this game in its prime witch was 2017/2022",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty much the Roblox of Steam but better. Interacting with people is actually fun most of the time. Playing with a group of friends is very fun. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great for talking and making friends on.I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game. However the old Rec Room was better. I just hope the devs can work on bringing back that spark that Rec Room once had",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really fun, a great alternative to Roblox.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun multiplayer hangout game where you can go to diffrent rooms that people make and you can also make your own rooms somehow (i frogot how to make a room mabe) and you can go whith your friends. make friends. have partys. take pictures, all of the fun stuff :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing its so cool and fun to play this with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun, great with friends and really makes me happy! try it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like playing this game, and being kicked in the balls but all that is irrelevant",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked this game because you can get the chance to connect and party up with your friends and has endless games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good. im kinda a veteran but seriously whats up with the creators just making sloppy quick crash grab games... its honestly annoying. but i have one thing to say. it would be pretty cool to add more vehicles or create your own ones with an actual good speed car and sound system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an insanly good game but it is sadly dead so most likely bring friends unless you want to be sweared at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love it, but are you sure youre adding custom avatars or smth? because yeah you know. also its hard to draw i mean yeah just, yeah. positive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i first played this game on 24th june 2018, back then this game was great and i would play this all the time with my friends during lockdown. was by far the greatest vr game out when it launched, still decent by todays standards but full of tiny kids shouting all the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love Rec Room it is a great game I will just warn you about the updates that they are adding the",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing you should check it out.I would check out paintball first BUT if you have anger issues it will not end out well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like the game because it receives very frequent upodates and they are starting to actually listen to the community again, unlike how they didn't use to and added whatever the heck they wanted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good platform if you're bored but the items are a bit expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SUCH a good game i DEFINITELY RECOMMEND THIS GAME TO PPL THIS GAME IS SUCH A W, WS IN THE CHATTTTTTT download this game RNNNNNNNNNNNNN btw rr plus is worth ur money u get a bunch of stuff and 6500 TOKENS EACH MONTH!!!!!!!!!!!!!!!!! DOWNLOAD NOWWWWWWWWWWWWWWWWWWW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh my lord! this literally defines the number one game. I recently got a 3 day ban on Roblox for what the moderators claim \"Harassing\" When I literally just greeted somebody, After suffering two days without entertainment, I tried checking on steam to see if there are any other entertaining games and then I stumble upon rec room. This platform's Moderation is dozens of times better than Roblox's Moderation. The lowest ban time from Roblox used to be 1 hour, but now, Roblox changed it to a day, Meanwhile Rec Room's lowest ban time is only a few minutes and it is rare to get a suspension over a few days. I don't think I'm gonna leave this game, even if I get unbanned from Roblox.\r\n\r\nMoral of this comment: Screw you Roblox, Hello Rec Room!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun movement is great on pc its not that awkward and is easy to get the hang of would definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this game for about 3 days and I could never stop playing! it is really good in terms of hangout, doing quests, and ai that you can talk to! I highly recommend this game to new players and it is free!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game was really fun and has lost of fun games with good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really good game to play even with friends, so get ur butt up and start playing rec room- ari<3333",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game and all i'll give it that but the problem is is that when i join the game for about 2-3 minutes it then freezes before it kicks me out and i don't know why...all that i ask for in return for this minor problem is 1,000 currency and energy for my robot companion please and thanks :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got called a hard r within 2 seconds of loading into a basketball server, never had such a realistic experience.\r\n\r\n11/10 I met Caillou and then used his head as a basketball.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better in vr. Not a roblox knockoff. Very nice community and awesome creative tools.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its funny to play do not let kids 1-7 play please they will learn too use bad words my child has learned them but he is 17 now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rec Room is a very fun game, that I would recommend to almost anybody.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is grate i love this game a and i hope the same if meet the right people its the one for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got called the n-word 24 times.\nGot called fat 11 times.\nKilled myself three times.\n\nGood game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you get to make money from kids by making rooms, basically you can be evil robin hood (and make one MILLION dollars...)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty Fun and Goffy with Friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great!!! there is plenty of places to hangout and talk with others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good games, Good community, Good everything!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game awsome on pc but i wish it was more optimized for the NVIDIA GeForce GTX 1050",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got bullied by 13 years all girl and got shot by nerf gun for 69420 times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "budget roblox but premium curency is not pay-walled and is VR friendly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bleeeeh :p. . . yabba yabba gib me tokens guys. . . mwah <3. there's an alarming amount of kids on vr and not on junior accounts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only fun past midnight when all your freinsd are asleep",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SEE I WOULD RECCOMEND THIS GAME MORE IF YOU JUST BRUING BACK CLASSIC BEEEEEAAAAAANNN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game use to be such a good game but got destroyed by thhe own dev's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah like roblox and vr chat but only the good parts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games ive ever played is at my finger tips RRR-rec room RULES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a game thats have many games like roblox but Rec Room is not bloxy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get the game...It shows its the best game from the start.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, the horror games are so fun to play with your friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly best game of 2020. It was during covid when Roblox eventually got boring and so i found rec room for me and my friends to play. it was SO FUN. it lowkey saved my life i ascended into heaven, i cured boredom, and made world peace. 5 stars",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it was a good game in my old play station 4 when I was a little kid good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and stimulating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun but look out for tocix people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY GOOD! although my mic wont switch how do you switch mics?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really fun hangout with your friends give it your Rec Room best [:)]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice and fun with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game. Fun. And Many Creation Styles, You Can Pick From.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its a good game but i miss old rec room",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game can make And for vr its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it but it's sort of a meh because some of the games won't work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love its like the more family freindly roblox!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like roblox, but with better moderation LOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like roblox without the pedophiles, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like that i can play with friends and its very fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to many toxic people. private servs are better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bring back bean settings please\nit sucks w out it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER a kid friendly version of vr chat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Great game, And its free thats crazy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't play this on SteamVR. Unless your not epeletic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad game, but i still play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good place to get called slures by a 10 year old kid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very funskx, i plei as vi ar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uhhhhh game good people bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice block and curved hands",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GUYS RETREAT, THERE ARE KIDS EVERYWHERE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has made me the man who I am today",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS A FUNNY GAME AND YOU CAN MAKE MORE FRIENDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT IS VERY GOOD GAME ALTOUGH IT IS KIND OFF LIKE ROLBOX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Roblox sux Play This Game its better !!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "love this game and the community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cant stop playing.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i miss the days when we all got on this after school\r\n6/7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fantastic\nand if your queer it has queer things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Met so many good friends, tho i do miss some of them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun asf back in like 2022 but its dead now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE THIS GAME IVE BEEN PLAYING THIS FOR 3 YEARS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can waste ur free times playing this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun with freinds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game would play again",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "As a veteran player of 2018 (13th of December i signed up)\n\nI think this game had everything and lost it all.\n\n\"Golden era\" 2018-2022 (As a lot of veteran player's describe it including myself)\nThe golden era of rec room was the era where rec room was constantly improving and had a non to minimum toxic community, the games were good, the lobby's were social, it was ORIGINAL. That is what made rec room stand out, it's originality and community, Game's were super creative, costumes were easy to play for, not grind.\nOverall what rec room put on paper, seemed to be true. it was great.\n\n\"Fall of rec room\" 2022-2025\nIn late 2022 rec room prices for tokens became higher and higher, it was dealable with for sure but was disappointing, then moderation got seemly worse and worse, more toxic player's would join lobby's to purposely ruin them, only vote-kicking was our saviour.\n\nAs the year's continued prices became incredibly high, AI slop took over artist's work. Player base continued to become toxic and younger, moderation became horrible, Toddler's would scream down the microphone in lobby's, people would be harassed for being \"broke\" to being a different skin colour.\n\nThe game obviously started to fall apart entirely. As the game got worse and worse, the originality that once was housed in rec room, dispersed into nothingness. The developer's would try to impress investor's rather than listen and support the community they built.\n\nEventually rec room's idea's got too big for it's head and they ended up firing a lot of their staff. The company who made rec room, (Against Gravity Corp) would hit US $3.5 billion.\n\nThey made the mark on their economy at the expense of their player base. It no longer has the spark it once promised to hold for the community.\n\nI do not recommend this game to anyone.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "the game use to be great, but started falling off in 2023, here are the following ways the game can be improved\n\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nAnd also be cheaper with your items (optional)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "there is nobody playing this game with vr headsets. it used to be rare to see someone without a headset now its rare to SEE someone having vr! where did they all go? plus the people playing this game just stare at themselves for hours in the mirror. i wish it can come back like the old days.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not a good game, i keep getting banned for no reason, just joined a lobby and said wassup wit you and got banned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pack it up at this point this game fell off HARD\nit was the best game i ever played when i was younger spending most of my free time playing this game but now it just has just rotted away, now a husk of its prime self.\ni wish they just put it down soon and put this desecrated game to rest at last.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game was the best game, i'd stay up on my quest 2 on winter nights till 3 am, and sometimes usually even pull all-nighters, i'd run from school to my quest 2 just to play rec room, the friends i met, and the fun game selection. the game had good games, but after 2023 the game jsut started getting worse, they started adding stuff the community never wants, the game has just became more soulless and soulless, i've met most of my best online friends on this game, and watching the game i adored, loved, and would ruin my sleep schedule for has slowly became the most boring game ever, they prioritize community creations and UGC instead of actual gameplay features. Most games you see are just ignited games, random bad AI slop games, and have a more toxic community, they made a AI companion which is useless, and the last time i played was a few months ago, i messed aroudn with the makerpen and played games, the games have become more boring and rec room has nothing new, every major updates comes with alot of issues that they take a long time to fix (usually) and the most useless stuff, the only good update was the new paintball update, which i haven't even tried yet. but its probably a bad map, its really upsetting me to watch one the best games in the universe to slowly transform into this soulless, UGC. AI filled game with only the intent to gain money off of it. the developers just dont care about their community anymore. they only work on the game for the money, the only time rec room had a good update which i think the last one was the infinite ink for rooms 1 and not making rooms 2 the default was the last one, but the developers only added that just because they realized their player base was losing popularity, and everything is overpriced in-game, so many stuff are overpriced, if i go onto the game and see the newest cosmetics they'd cost more than 2k, i've stopped playing this game because all of this nonsense. and the unoptimized UI and everything. im not even going to bother playing the game because i know it'll be filled with a racist, toxic community. and slop games. they prioritize making their UGC and features that are dependent on the player base itself. they dont even care about the average players experience in the game anymore, just for the money, don't play this game unless you want a knock-off roblox game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would not recommend playing recreational enclosed space, as it got my son arrested by a corrupt cop selling fentanyl through public lobbies",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game basically went to shit due to the devs being greedy by doubling the prices of all cosmetics and bullshit subscriptions, letting go half of their team this year, and turning everything into ai investmentslop. this game had a good run during the quest standalone era, but now the player count has dropped tenfold since last year. i still play this game only cuz me and my old buddies sometimes hang out and exploit in lobbies since this game has one of the bottom five most shittiest anti-cheats known to man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Joined in december 2019, this game was a truly good experience back in the day up until around 2022, this game is just a husk of what it once was and feels more like a roblox competitor for its own sake then anything else. Please do not play I cannot recommend it unless you have been playing for a while and still have freinds on there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even fucking join the game anymore. Who the hell out of you, fucking morons put logout&exit code right after fucking loading into the fucking game. Stupid piece of garbage! Never waste your time here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has fallen apart. its just sad to see really i remember playing with my friends in 2020 going in to fnaf games and shit but now its filled with p3dos and kids its really sad to see it die like this {rec room shuts down in 2026 i think} dont play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing rec room for the past 3 years ago and nothing has ever changed for the game. And its community ha been toxic alot of times. Yet we live in a society to where all the people don't trust each other because they either have a low social ethnic, or just taunting people for no reason of it. I mean, I loved Rec Room in my entire life until this went to downhill that Rec Room decided to start laying off the staff and does not do anything for its own community. \n\nThe community does often express its concerns about the endangerment of children on this platform. If you are a parent and you have a child that is playing rec room, I would put up a junior account or remove its privileges from playing it. I do express my concerns about rec room and hope that they can either listen to the community or not. But if company games can do something better for their own communitys, then so can rec room can. \n\nI wouldn't recommend playing this game since this have begun to fall short from pure joy to hateful arguments. Even if the environment of rec room begins to soften up slowly, there still toxicity in Rec Room. Pretty sure that the game in the future is going to get shut down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for around 5 years with 2.5k hours on playstation, quest and steam. And I have never saw a game that has been ruined so much by greed. Only reason to play it now is for the very very small portion of mature players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game died around 3-5 years ago, boring and filled with toddlers, better than vr chat tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this Game use to be so good now it sucks the devs and people behind this game don't care for it and only trying to get a quick buck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ive deleted the game many times just because of the voice moderation system and im deleting again now ty recroom for not allowing me to talk to my friends for 24 hours for saying nothing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I started playing this game months ago it was nice at first but i came back and omg what it this so now i'm getting attacked because of my skin colour???! a grown ''MAN'' was calling me the n word and a bunch of other slurs while i was just standing there minding my business talking about some ''well well well'' this is horrible to be this old and miserable at the same time this game is filled with a bunch of racist homophobic people and all type of odd shxt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started playing October 2020 On my quest 1, This \"Game\" is genuinely one of the worst user experiences I've ever had.  Random crashes and updates that do nothing but break or ruin things that worked perfectly fine.  That being said, rec room has the best creator tools (when they're not broken) of any game I've played in the last five years, and I'll probably be playing it for five more.\r\n\r\nOnly download this game if you are fine with going insane, or already are.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is easily the worst put together game I've seen. If my 5 year old daughter didnt want to play it to fit in with her friends we would never touch it. She is constantly frustrated trying to play it since nothing works right and everything cost money. And controller support randomly stops working. Free is too expensive.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Damn downloaded as i had not played in 900 days, but damn holy shit the memories with bro on this is insane.\n\nthese new gens with their damn legs though SCHOOL WAS UP HILL BOTH WAYS.\n\nthis game however has just fallen so bad from what i remember\n\n4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ripoff vrchat with rip off games with bull shit prices, toxic people and pointless outfit with pointless events that just make no fucking sense anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so ass not cant say or do nothing without a ban whats the worth of mics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NO I WOULD NOT. VR ROBLOX WHICH CAN BE PLAYED NOT IN VR. SO JUST BASICALLY VRCHAT BUT WITH CHILDREN INSTEAD OF FAT INCELS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only good if you play paintball like once every 4 months\r\n not worth spending money on. if ur gonna spend money on a game like this play roblox instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty boring and dull unless you are about 6 years old",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is just VR compatible Roblox. Even worse probably.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was good, but went mainstream/un-original",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uh, i mean i got groomed twice back in 2021 - 2022 so i dont really recommend it 💔\n\ni have met some cool people though\nand the rooms are cool ig\nstill wouldn’t recommend it however!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it will not opren when i tried playin it get better steam\r\nit was a good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gAME CRASHES AS SOON AS I LOG IN  i cannot play the game at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why did i ever even download this on computer this game is straight bunda",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a shame to say this Game use to be so good now it sucks the devs and people behind this game don't care for it and only trying to get a quick buck. they fired almost all there team and result to using Ai this game is trash now and its sad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crapy game always ceashes not reccemended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yes i would say to get this but be ware there are now a ton of hackers in most lobbies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game, don’t even waste your time on it. They ruined it right after 2023",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After playing Rec Room for quite a few years now, (On VR, and before RR moved to steam only)\r\nUsed to have a fun aspect, but now just seems like it is turning into a massive cash grab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable past 3 minutes without vr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "peak was in 2020-2023, it fell off then had a redem arc a year later",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if we can't truly play dnd in this game, then it is worthless",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I CANT PLAY THIS GAME AND I CANT PLAY IT ON MACBOOK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the fucking tab button will not open the watch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible, do not play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game doesnt work anymore :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got called AT LEAST 2000 slurs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes on linux. anybody else? any fixes?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please dont play this game, they killed it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game crashes too much",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just not fun anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its great              updates are stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fell off tremendously",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Man I miss this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "anti cheat wont let me play even though i dont cheat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "filled with children",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring rlly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you enjoy this get help",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SHI GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To many kids + racist people",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanna KMS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "VR Roblox",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "roblox copy but vr and its garbage idk how i was so brain dead and played this for 150 hrs🤣🫱",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ba",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tuff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ",",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As a veteran player of 2018 (13th of December i signed up)\n\nI think this game had everything and lost it all.\n\n\"Golden era\" 2018-2022 (As a lot of veteran player's describe it including myself)\nThe golden era of rec room was the era where rec room was constantly improving and had a non to minimum toxic community, the games were good, the lobby's were social, it was ORIGINAL. That is what made rec room stand out, it's originality and community, Game's were super creative, costumes were easy to play for, not grind.\nOverall what rec room put on paper, seemed to be true. it was great.\n\n\"Fall of rec room\" 2022-2025\nIn late 2022 rec room prices for tokens became higher and higher, it was dealable with for sure but was disappointing, then moderation got seemly worse and worse, more toxic player's would join lobby's to purposely ruin them, only vote-kicking was our saviour.\n\nAs the year's continued prices became incredibly high, AI slop took over artist's work. Player base continued to become toxic and younger, moderation became horrible, Toddler's would scream down the microphone in lobby's, people would be harassed for being \"broke\" to being a different skin colour.\n\nThe game obviously started to fall apart entirely. As the game got worse and worse, the originality that once was housed in rec room, dispersed into nothingness. The developer's would try to impress investor's rather than listen and support the community they built.\n\nEventually rec room's idea's got too big for it's head and they ended up firing a lot of their staff. The company who made rec room, (Against Gravity Corp) would hit US $3.5 billion.\n\nThey made the mark on their economy at the expense of their player base. It no longer has the spark it once promised to hold for the community.\n\nI do not recommend this game to anyone.",
      "voted_up": false,
      "votes_helpful": 84
    },
    {
      "review": "This game has destroyed its reputation.\n\n-Over the top moderation\n-Voice moderation AI which is very strict and suppressive when it comes to socialising in public areas\n-Mass amounts of micro transactions that pop up like Youtube Ads\n-A community full of children that will call you slurs of all sorts\n-For every 1 good decision a million bad decisions follow\n-Taking away many avenues for creators to make money\n-Making respected and talented creators walk away from the game after slop games are more promoted \n-Allowing slop creators to published copyrighted rooms with zero talent or creative aspects\n-Following the Roblox formula and not branching into their own game\n-Valuing investors more than the player-base\n-Only care for players when they lose money\n-Firing developers who were passionate and involved within the community\n-Allegedly treating employees poorly (Dev source)\n-Awful contests that have been lead with awful decisions and results recently\n-Pushing AI tools over creativity\n\nThis game is free, but at what cost? The only fun to be had is trolling, but even that is a task because of the stupid moderation AI.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "As someone who played this game to death for a while (mostly on other platforms) only to see the state of this game and everything surrounding it now, I only have one thing to say:\n\noof...",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "The game used to be so good. I'm going to keep it simple by saying that the devs have not been focusing on the more important problems. Please make your game great again.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "was fun while it lasted i have over 3k hours of recroom on my ps4 and i used to love it i used to stay up until 3am in the 2020-2019 days but now i feel like this game is ruined",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "the game use to be great, but started falling off in 2023, here are the following ways the game can be improved\n\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nBetter optimization\nAnd also be cheaper with your items (optional)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game was the best game, i'd stay up on my quest 2 on winter nights till 3 am, and sometimes usually even pull all-nighters, i'd run from school to my quest 2 just to play rec room, the friends i met, and the fun game selection. the game had good games, but after 2023 the game jsut started getting worse, they started adding stuff the community never wants, the game has just became more soulless and soulless, i've met most of my best online friends on this game, and watching the game i adored, loved, and would ruin my sleep schedule for has slowly became the most boring game ever, they prioritize community creations and UGC instead of actual gameplay features. Most games you see are just ignited games, random bad AI slop games, and have a more toxic community, they made a AI companion which is useless, and the last time i played was a few months ago, i messed aroudn with the makerpen and played games, the games have become more boring and rec room has nothing new, every major updates comes with alot of issues that they take a long time to fix (usually) and the most useless stuff, the only good update was the new paintball update, which i haven't even tried yet. but its probably a bad map, its really upsetting me to watch one the best games in the universe to slowly transform into this soulless, UGC. AI filled game with only the intent to gain money off of it. the developers just dont care about their community anymore. they only work on the game for the money, the only time rec room had a good update which i think the last one was the infinite ink for rooms 1 and not making rooms 2 the default was the last one, but the developers only added that just because they realized their player base was losing popularity, and everything is overpriced in-game, so many stuff are overpriced, if i go onto the game and see the newest cosmetics they'd cost more than 2k, i've stopped playing this game because all of this nonsense. and the unoptimized UI and everything. im not even going to bother playing the game because i know it'll be filled with a racist, toxic community. and slop games. they prioritize making their UGC and features that are dependent on the player base itself. they dont even care about the average players experience in the game anymore, just for the money, don't play this game unless you want a knock-off roblox game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is completely and utterly horrible dont play this time waster",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "was groomed on this game once by someone popular and couldnt ever bring the situation to light... #OK",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "until the two rec room originals that were promised in one year were orientation and rec rally the game was great. but ever since then they kept prioritising money, and changed the entire UI without allowing the simple option of changing it to an older version. Rec room plus has been pushed more than anything else in this game and collabs are a bigger priority then to create original fun content.\r\nthe last good rec room original was stunt runner, that the last thing they created that was well polished at the start, then even that got brokken and thousends of people lost their best times because of the amount of best time resets because of glitches.\r\ni dont recommend this game anymore and that is the saddest of it all",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The most poorly moderated and horribly designed game on VR period. This game used to be good.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "full of AI slop, the game is essentially a husk of what it was back before 2020-2021. I miss it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is nobody playing this game with vr headsets. it used to be rare to see someone without a headset now its rare to SEE someone having vr! where did they all go? plus the people playing this game just stare at themselves for hours in the mirror. i wish it can come back like the old days.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not a good game, i keep getting banned for no reason, just joined a lobby and said wassup wit you and got banned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pack it up at this point this game fell off HARD\nit was the best game i ever played when i was younger spending most of my free time playing this game but now it just has just rotted away, now a husk of its prime self.\ni wish they just put it down soon and put this desecrated game to rest at last.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing this game for 6 years. Over the years i played alot of Rec Room and i have been seeing rec room becoming money hungry, the games now all glitchy, and rec room laid off half of their employees. It is now unplayable and i can't do shit in this game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I WOULD have recommended this back in 2019-2023 but this game is just slop now and it breaks my heart to see such a nostalgic game in this state now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is very poorly moderated, and is full of all sorts of bad types. Its sad to see that kids are allowed on here, because the absurdity of this game is FAR more obvious and constant than the stuff that happens on Roblox.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "imagine being stabbed 400 times and brutally dismantled, thats about the pain you get from the loading screen of this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be one of the greatest games oat, but has turned into a game full of Ai slop and trash. The game lost its artstyle and community that made it great. Dont play this ahh game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is full of cringe and toxic kids. I only downloaded it to get the free Discord decoration.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would not recommend playing recreational enclosed space, as it got my son arrested by a corrupt cop selling fentanyl through public lobbies",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2018 was probably the best time to play this game- every year after kept adding new content that would gloss over one another until essentially making the game a mess of old bugs unresolved, lag, crashing, getting kicked from a room for no reason, and other fun stuff... Normally I'd play this game to work on building projects or play the \"rec original paintball,\" but after time passed any actual game is just super buggy and or prone to crash. I've had multiple times when I was building in a room- until I was suddenly kicked-instantly loosing all my progress because the \"auto save feature\" is a myth. \r\n          To be fair I use a standalone= (a device that isn't connected to a computer to run) device such as the Quest 2 -wait no the Oculus 2, and so optimization isn't a thing really.. Only on RR :)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is sooo trash, everyone just wants to have ESEX and sit in the rec center",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game basically went to shit due to the devs being greedy by doubling the prices of all cosmetics and bullshit subscriptions, letting go half of their team this year, and turning everything into ai investmentslop. this game had a good run during the quest standalone era, but now the player count has dropped tenfold since last year. i still play this game only cuz me and my old buddies sometimes hang out and exploit in lobbies since this game has one of the bottom five most shittiest anti-cheats known to man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Joined in december 2019, this game was a truly good experience back in the day up until around 2022, this game is just a husk of what it once was and feels more like a roblox competitor for its own sake then anything else. Please do not play I cannot recommend it unless you have been playing for a while and still have freinds on there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even fucking join the game anymore. Who the hell out of you, fucking morons put logout&exit code right after fucking loading into the fucking game. Stupid piece of garbage! Never waste your time here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has fallen apart. its just sad to see really i remember playing with my friends in 2020 going in to fnaf games and shit but now its filled with p3dos and kids its really sad to see it die like this {rec room shuts down in 2026 i think} dont play this game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}