{
  "positive": [
    {
      "review": "[h3]Titan Quest: Divine Fights, Mortal Grind[/h3]\n[hr][/hr]\nHad fun while it lasted - about 80+ hours of it, solo run. Can’t speak for co-op or DLCs, but the base game of this Anniversary Edition is a polished resurrection of an early-2000s ARPG relic. A typical Good-vs-Evil tale wrapped in Greek Gods, Myths, and ancient sightseeing across Greece, Egypt, and Asia. \n\nBoss fights? Glorious. \nLoot? Tried its best to keep me breathing. \nThe rest? Two-thirds of relentless mob traffic that made sprinting feel like a divine blessing. \n\nStill, a Resurrected Classic worth a try.\n\n⭐️⭐️⭐️½☆ - Half Myth, Half Marathon.\n[hr][/hr]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Good grinding grief\nFor the sake of your sanity play with 2x exp otherwise it felt a bit of a slog\nGreat game though loved the setting, maps, skills and sweet mindless clicking",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overall, I’d call it a solid mid-tier ARPG experience. Not bad, not amazing; somewhere in middle.\n\nThe combat system feels decent at first, but you soon realize the targeting and hit registration are super clunky, especially in melee. Enemies only show their health bars when you hover over them, which gets irritating fast; there really should be an option to keep them permanently visible. I can’t even imagine playing this as a ranged character with how easily the cursor loses focus in chaotic fights.\n\nThe difficulty curve is all over the place: one minute you’re mowing through enemies, the next you’re getting demolished. By Act III and IV, it feels like the game flips a switch and suddenly expects you to have near-perfect resistances and defensive layering to survive. My Conqueror build (Warfare & Defense) went from unstoppable to squishy with the snap of a finger, until I adjusted with a shield and better resist gear. Once I did, it became somewhat satisfying again; but the spikes are insane.\n\nThe story is pretty typical for the genre, ancient evils, world-ending calamity, and you the hero rising to stop the chaos. Nothing groundbreaking, but the mythological settings across Greece, Egypt, Asia, and the Underworld are still fun (although the transition to Asia in this was super weird). The music and atmosphere are solid, and the fact that the game supports co-op multiplayer adds a nice replayability factor if you want to run it with friends or try different mastery combos.\n\nAll that said, it still has that old-school charm. Building your character, watching your skills evolve, and mowing through hordes of monsters with loot raining everywhere, that loop still works. Titan Quest 1 is a classic ARPG that shows its age in controls and pacing but remains enjoyable if you like deep character builds and mythological settings. Catch it on sale.\n\nScore: 6.5/10 - Good, but dated. Worth playing, especially for fans of classic ARPGs like Diablo II.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "hack & slash - nice old school graphic reminds me of old Diablo before that candy dandy nonsense style game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun, great game. thanks for the hours of fun, to the makers....cant wait for many more hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed playing a game as a adult that I played when I was much younger. It has been enjoyable plus I love the Mods!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ancient mythology + endless loot = Antique Gambler Simulator. I swear this game is 10% story, 90% pure grinding addiction. ‘Just one more satyr,’ I say, six hours later and still picking up blues like a true loot goblin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First playthrough review time.\r\n\r\nI got this game for free and decided to try it. Titan Quest is a classic action RPG set in Ancient Greece and nearby regions. The Anniversary Edition and the new expansion make the game more complete, and it still plays well today. The game is focused on exploring, fighting creatures, and progressing through levels, with a system that allows combining different skills for variety.\r\n\r\nThe story is minimal and mainly supports the gameplay. You move through different areas, complete tasks, and face waves of enemies. Combat is steady, and progression is gradual. The world design is varied, with different landscapes such as forests, mountains, deserts, and ancient cities. This variety keeps the experience engaging over many hours.\r\n\r\nGraphically, the game is still clear and works well for its age. The soundtrack matches the environments and changes with each area. There are some limitations, like slower combat, limited inventory space, and movement that is less smooth than newer games. Despite this, Titan Quest remains a solid and structured action RPG and could be a game for those who like this style of gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a huge and dedicated fanbase among gamers, and it's clear why. It is just a great game. Yes, not exactly new and up to today's standard of polishing, but everything works as it should, it's very charming and endearing, and it's a whole lot of FUN. You even learn a lot about Greek mythology along the way, and in a very fun way. Especially the atmosphere of the various biomes and the wonderful voice-overs stoof out to me.\r\n\r\nLike many others around now, late 2025, I picked this up to prepare myself for TQ2, which will come out in the near future. I can think of a lot worse ways to bide the time. Definitely a huge recommendation from me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decided to play earth mastery but wondering for second mastery, want mastery who support earth mastery. \nAny advice?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game in the style of Diablo and Sacred but ancient Greece themed. my only complain is that id like to have more skills and maybe more complex textures but overall is a really pretty and unique game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "looooong, huuuuuuge game of old.  expansion is huuuuge too.  its built in.  when i played it it was over LAN.  played it before it was anniversary edition. its 2025, and i still give it a 7 or 8 out of 10.  I'm currently playing titan quest 2 beta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes me back to the original games that got me interested in gaming, it's just fun, not too complicated or too hard to figure out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great Single Player hack'n'slash with interesting mythological elements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spend so many times on Holiday for this game \nWorth It ! Hope TQ2 will bring co-op back like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best hack 'n' slash (period).\r\nDeep and unique mastery system\r\nImpressive graphics and physics* (by the time of release that is)\r\nImmersive OST (the main theme is trully memorable)\r\nGood dubbing in many language (that was pretty commonplace at the time of release)\r\nLong story\r\nBased on actual mythology\r\nStill updated decades later\r\nAbout to receive a sequel this year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game you can lose yourself in. Masterpiece!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game hours of fun, and replay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, mega hack and slash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best arpgs ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spreadable cheese + lays limon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best oldschool ARPGs out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good, solid game. Still playing in 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, you have to try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only ARPG I've enjoyed as much, if not more, than D2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its awsome, not like pulling teeth at all :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "500 hours in, this is good stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tackle those darn titans!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tis fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mostly Positive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOADS OF FUN",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "is gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h3]Titan Quest: Divine Fights, Mortal Grind[/h3]\n[hr][/hr]\nHad fun while it lasted - about 80+ hours of it, solo run. Can’t speak for co-op or DLCs, but the base game of this Anniversary Edition is a polished resurrection of an early-2000s ARPG relic. A typical Good-vs-Evil tale wrapped in Greek Gods, Myths, and ancient sightseeing across Greece, Egypt, and Asia. \n\nBoss fights? Glorious. \nLoot? Tried its best to keep me breathing. \nThe rest? Two-thirds of relentless mob traffic that made sprinting feel like a divine blessing. \n\nStill, a Resurrected Classic worth a try.\n\n⭐️⭐️⭐️½☆ - Half Myth, Half Marathon.\n[hr][/hr]",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "While being an older game. It is still great to play with an easy learning curve. I have put in 90 hours and have enjoyed it so far. Wanted to play the original before purchasing Titan Quest 2.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "You don't go into Titan Quest thinking all that much about it, but a few hours in, and you're hooked. For a game that came out as long ago as it did, a lot of what it tried to do was very ahead of its time. If you're looking for an ARPG to sink your teeth and time into, you'll not find much better on the market than this beautiful mess.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I consider this to be one of the great ARPGs! Extremely fun and rewarding.  It's slower paced and more chill than the high speed, intensity of POE or Diablo IV, but that's the intention.\nThis is also fun for a co-op with your partner or friends.  I've put even more hours into this game on other platforms and highly recommend it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Good grinding grief\nFor the sake of your sanity play with 2x exp otherwise it felt a bit of a slog\nGreat game though loved the setting, maps, skills and sweet mindless clicking",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I played this game to get acquainted with the arpg genre. After finishing the game I can say that this game is a great entry point. Skills are easy to understand. Combat is simple. Since first acts of game take place in Greece and Egypt natural scenery feels nice to look at. In some areas game shows its age. There is a serious issue of clarity. Enemies sometimes blend with the environment to much to the point you can't see them. All the maps look different but are designed same. I know I said combat being easy as a pro but it is also a con. All the enemy encounters have the same movement and attack pattern. 5-7 enemies chase you, one of them has a immobilisation skill or multiple ranged enemies just shoot stuff with occasional immobilisation skills. Story progression feels like Mario games. You keep chasing the evil till you catch them. Things they do in the mean time have no effect.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I really liked Titan Quest Anniversary, though I ran into quite a few bugs, for example sometimes items can’t be picked up from chests. But just like in 2007 when I first played it, it kept me hooked even in 2025, making me stay up late at night. A nice ARPG to relax with, doesn’t strain you or your system like Diablo, and visually it’s not gloomy, so it doesn’t feel heavy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Surprisingly good and fun game even in today's standard. I like the class system that allows you to build and play the game as you want. I think I'm going to continue to play this game every now and then between other APRG leagues/seasons.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hadn't played this game in years, but bought the Anniversary Edition when it came on sale. This is still a great game, with a lot of class variety, and some great boss fights.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Late to the party I am. However, I picked this game up via Steam based on what I had seen of Titan Quest II. \r\nI've played a lot of games similar to this one (Last Epoch, DIablo 2 and 3 and so on) - I've been enjoying exploring the new worlds presented in this game - it's as fast paced as you could want - lots of loot to be enjoyed, cool classes and masteries to try. Would recommend to anyone who enjoys these sorts of games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game of my childhood, love it a lot! But definitely super complicated on modern PCs, like VERY complicated.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loving this game. An ARPG that is reminiscent of Diablo but with its own completely unique storyline and characters. Love the references to Greek and Roman mythology",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "error crash who now fix his game? it's bad\n\ncan't play game, but I'm open game, I can but not playing after loading gaming intro gameplay guys i need something help?\n\nwho now fix gaming after intro gameplay and nothing doing crash game\n\nThe game has been running for a long year and was working, and now it crashes in this year and time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "oldie but goodie, slash and loot",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is pretty straightforward and fun. Your items are essentially what give you higher stats. The loot drops are random, but sometimes you can get an epic item on a low-level, which I suggest squirreling away for later. \n\nSometimes there are delays in the game, but other than that, the sound and graphics are pretty decent for this style game. \n\nDefinitely try it if mythology and RPG is your thing. Really interesting and entertaining all things considered.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When the modern day tech industry let's you down, just play the good old (remastered) classics and forget about all the drama.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels a little unbalanced at times but fun and engaging game. Look up some builds before you play to make sure you don't lock yourself in a weak build!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a lot of fun. This one goes way back but I had missed it, and I enjoyed the extra narrative meat it had to it compared to say a Diablo III in the ARPG space. Lots of fun builds, lots of fun items, just generally a good ARPG time. Some kludgy stuff, but always is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hack & slash - nice old school graphic reminds me of old Diablo before that candy dandy nonsense style game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun, great game. thanks for the hours of fun, to the makers....cant wait for many more hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed playing a game as a adult that I played when I was much younger. It has been enjoyable plus I love the Mods!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ancient mythology + endless loot = Antique Gambler Simulator. I swear this game is 10% story, 90% pure grinding addiction. ‘Just one more satyr,’ I say, six hours later and still picking up blues like a true loot goblin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First playthrough review time.\r\n\r\nI got this game for free and decided to try it. Titan Quest is a classic action RPG set in Ancient Greece and nearby regions. The Anniversary Edition and the new expansion make the game more complete, and it still plays well today. The game is focused on exploring, fighting creatures, and progressing through levels, with a system that allows combining different skills for variety.\r\n\r\nThe story is minimal and mainly supports the gameplay. You move through different areas, complete tasks, and face waves of enemies. Combat is steady, and progression is gradual. The world design is varied, with different landscapes such as forests, mountains, deserts, and ancient cities. This variety keeps the experience engaging over many hours.\r\n\r\nGraphically, the game is still clear and works well for its age. The soundtrack matches the environments and changes with each area. There are some limitations, like slower combat, limited inventory space, and movement that is less smooth than newer games. Despite this, Titan Quest remains a solid and structured action RPG and could be a game for those who like this style of gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a huge and dedicated fanbase among gamers, and it's clear why. It is just a great game. Yes, not exactly new and up to today's standard of polishing, but everything works as it should, it's very charming and endearing, and it's a whole lot of FUN. You even learn a lot about Greek mythology along the way, and in a very fun way. Especially the atmosphere of the various biomes and the wonderful voice-overs stoof out to me.\r\n\r\nLike many others around now, late 2025, I picked this up to prepare myself for TQ2, which will come out in the near future. I can think of a lot worse ways to bide the time. Definitely a huge recommendation from me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decided to play earth mastery but wondering for second mastery, want mastery who support earth mastery. \nAny advice?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game in the style of Diablo and Sacred but ancient Greece themed. my only complain is that id like to have more skills and maybe more complex textures but overall is a really pretty and unique game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "looooong, huuuuuuge game of old.  expansion is huuuuge too.  its built in.  when i played it it was over LAN.  played it before it was anniversary edition. its 2025, and i still give it a 7 or 8 out of 10.  I'm currently playing titan quest 2 beta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes me back to the original games that got me interested in gaming, it's just fun, not too complicated or too hard to figure out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, I’d call it a solid mid-tier ARPG experience. Not bad, not amazing; somewhere in middle.\n\nThe combat system feels decent at first, but you soon realize the targeting and hit registration are super clunky, especially in melee. Enemies only show their health bars when you hover over them, which gets irritating fast; there really should be an option to keep them permanently visible. I can’t even imagine playing this as a ranged character with how easily the cursor loses focus in chaotic fights.\n\nThe difficulty curve is all over the place: one minute you’re mowing through enemies, the next you’re getting demolished. By Act III and IV, it feels like the game flips a switch and suddenly expects you to have near-perfect resistances and defensive layering to survive. My Conqueror build (Warfare & Defense) went from unstoppable to squishy with the snap of a finger, until I adjusted with a shield and better resist gear. Once I did, it became somewhat satisfying again; but the spikes are insane.\n\nThe story is pretty typical for the genre, ancient evils, world-ending calamity, and you the hero rising to stop the chaos. Nothing groundbreaking, but the mythological settings across Greece, Egypt, Asia, and the Underworld are still fun (although the transition to Asia in this was super weird). The music and atmosphere are solid, and the fact that the game supports co-op multiplayer adds a nice replayability factor if you want to run it with friends or try different mastery combos.\n\nAll that said, it still has that old-school charm. Building your character, watching your skills evolve, and mowing through hordes of monsters with loot raining everywhere, that loop still works. Titan Quest 1 is a classic ARPG that shows its age in controls and pacing but remains enjoyable if you like deep character builds and mythological settings. Catch it on sale.\n\nScore: 6.5/10 - Good, but dated. Worth playing, especially for fans of classic ARPGs like Diablo II.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "(Update) I have managed to resolve the character creation problem so have now changed my review to that of a positive one.\n\n\n(Original Post) From what I played of this game back when it was on sales afew months ago I thought it was ok, however have re-installed it again today to give it another go and well it seems the game is now totally broken, game boots up, I go to create a new character and nothing happens so I can't play it at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was part of the inspiration for Path of Exile and is a distant older cousin to Grim Dawn. It is fun to play, immersive, and on top of that it is a hallmark entry in the ARPG history books. I highly recommend this game if you enjoy classic ARPG games like Diablo 2 and Grim Dawn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun but theres a glitch that kicks you out odf the game for no reason",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish i discovered this game way before fun with an amazing skill personnification, and not playing diablo 2 to never drop a zod rune in my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old fashioned ARGP with a nice story, playing it with a mate, there are lag issues and game is not super fluid but experience is still pretty good. Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, easy to play. The only issue I have is that builds don't really exist and therefore a bit of the typical ARPG piece is missing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best ARPG I've played. Love the class combinations - adds so much replayability. Plus, great modding community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome - Diablo 2 - like alternative game. And its nice that town portal is free to use vs at a cost",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics are pretty 90's, early 2000's regardless this game is a lot of fun. Replay is high because you complete at Epic and Legendary status which means some new quests, monsters and items. I would give this game solid B.\r\n\r\nGraphics - C\r\nFun Factor - A\r\nReplay - A\r\nSound - C\r\n\r\nOverall - B",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is and always been (and at this point, always will be) the best hack & slash in existence.\n\nThe map is the best of all of them, as soon as things get samey it switches to new landscape.\n\nThe combat is solid, the builds are actually good and always unique with good synergy (something no h&s ever reproduced).\n\nAll in all, a great game.\n\n\nAs a PSA for those playing multiplayer, multiplayer has 2 major-ish bugs: \n\n1- the game networking of the person joining will lose its mind if one of the player runs the game at more than 60 FPS (it loses its mind more for the joiner if it's the host that's using more than 60), things will desync, monster will teleport, and hit registration will be delayed. Solution: all players should lock their framerate to 60.\n\n2- after a while the healthbar of some (not all) enemy types will start to not render correctly, it will just display 1 pixel of it no matter what. This has been a bug since the original, it's not Anniversary Edition specific. No real fix.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An Oldie but a goodie been enjoying it a lot, actually for a ARPG it plays a lot like a RPG, have just gotten the DLCs and looking forward to more adventures",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b]Tentative Recommendation[/b]\n\nBeen playing a lot of Diablo 2 lately, so I decided to pull this game forward to keep the ARPG kick going.\n \nYou can absolutely see the DNA that was passed onto Grim Dawn when playing Titan Quest, but its successor is an improvement in virtually every fashion. The combat, classes and world design are unfortunately all kinda dull here -- though Ragnarok at least offers a significant improvement in terms of the latter (and excellent music to boot!)\n\nOverall, an interesting relic, and maybe worth a look for ARPGs fans curious about the genre's roots, modern ARPGs do just about everything so much better that it's difficult to recommend this one unless you've played just about everything else and can pick this one up for cheap.\n\n6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nice game with good story line to it. Graphics are also good for a game of its time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and relaxing to play and despite being from 2006, it feels like one of the more classic PC games from the 90's, and that's a compliment.  I can see myself pouring dozens of hours into this to try all the different builds available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting setting, and still plays great. Can be tough at times, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing  yet underrated game! Its design SCREAMS how much love and effort was put into it. I bought it with all DLCs immediately (which I do rarely) and I have no regrets since. 11/10 will buy next game asap. Best of luck to devs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game that you can spend countless hours just traveling and leveling up your character in this mythological world, my most played game and for good reason. The customization is endless and the music and scenery just overtakes your mind when playing and makes you not wanna stop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with fun mods and a large campaign. Would recommend to friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's basically a Diablo II clone, but it's Greek mythology.  They changed so much, that I don't think it would classify as a clone.  For example, you don't pick a character class, but rather you pick a class of skills when your reach level 2 and 8 making for combination classes.  Like an archer barbarian mix.  You get lots of drops and you have to manage what you keep, and you sell it in town.  unlimited teleport back to town.  Death is a small dip in experience, but large enough to make you not want to die.  addictive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even if this is an old game, you'll be suprised by how deep it is, graphics may aged badly, gameplay might look cluncky and slow by today standers, but it is still a fun game, give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Maybe the best ARPG since DIablo 2, if you're vulnerable to these types of games be careful it may end your life and take 1000+ hours from you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best ARPGs ever made with awesome devs who really put the time in.  I have over 1k hours in the original before this Anniv edition and I'm still playing this in 2025, still holds up!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It says I got this game for free but the reality is I got the base game for free and after playing a handful of hours I bought everything made by these devs. It's that good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great Single Player hack'n'slash with interesting mythological elements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spend so many times on Holiday for this game \nWorth It ! Hope TQ2 will bring co-op back like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best hack 'n' slash (period).\r\nDeep and unique mastery system\r\nImpressive graphics and physics* (by the time of release that is)\r\nImmersive OST (the main theme is trully memorable)\r\nGood dubbing in many language (that was pretty commonplace at the time of release)\r\nLong story\r\nBased on actual mythology\r\nStill updated decades later\r\nAbout to receive a sequel this year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An oldey but a goody, not much I can say that others haven't already. But if you want to play the game engine that Grim Dawn was built from, this is it. I could say that if modern ARPG systems are too much for you, this is a simplified version of the genre that's pretty phenomenal no less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not Diablo. similar but different in many ways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game you can lose yourself in. Masterpiece!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games there is.Will always come back to this when I got the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most underrated RPGs ever",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can no longer play game with friends due to constant network crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn’t hold up with today’s standards esp QoL, controller layout, technical issues like coop experience. I know it’s an old game and the dev will never try to fix known issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is poor",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "happy birthday",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The good:\r\n-Somewhat interesting setting. The game takes place in the antiquity/ancient world.\r\n-Can be played co-op with friends.\r\n-Skill trees are not as complex as path of exile.\r\n\r\nThe bad:\r\n- Slow combat (compared to, for instance, grim dawn, path of exile).\r\n- Constant damage spikes and inconsistent difficulty.\r\n\r\nThe ugly:\r\n- Graphics, while serviceable, are on the older side.\r\n- Some armour/gear pieces are funny/ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Titan Quest is a classic of its time, but as a new player, the gameplay felt incredibly restrictive—like playing with handcuffs on. The graphics still hold up surprisingly well, and the mythological setting is enjoyable, but I just couldn’t bring myself to get into it. If you’re looking for more action and less mindless clicking, I wouldn’t recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to many game crashes more in muti-player than single player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good for single player,\nBut the dev team just never care about LAN/Network players, errors after errors",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can no longer play game with friends due to constant network crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest — A Mythic Journey That Demands Patience and Precision\n\nI was never really a fan of the Titan Quest series — I always preferred the dark, gothic atmosphere of Diablo II. Though, to be fair, I never managed to actually finish Diablo II — not as a kid, and not even now. It’s just that hard.\n\nBut Titan Quest? It’s tough in its own way. The game may look bright and mythological compared to Diablo’s hellish tone, but don’t be fooled — it can be just as punishing. One mistake in your build, and your entire playthrough can fall apart. There’s no mercy if you misplace your skill points or pick the wrong class combo.\n\nBack in the day, that challenge felt exciting — like a puzzle to solve. But now, when you’re an adult with less free time, endless farming and trial-and-error builds just don’t hit the same way.\n\nIt’s still a great game, rich with mythological charm and classic ARPG vibes — but these days, it’s much easier to relax with something lighter, like Diablo III.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Attention! [/h2] Game doesn't work online co-op\\LAN you can only play single player (offline) if game allows you to create character or start a new game, buttons unresponsive \nPersistent \"Network problem detected\" message (I've tried whole gamut of trouble shooting techniques)\nGame hasn't received updates since 2022\nIf you need to farm gear or items reseting level crashes game after 7 or 9 resets \nIn conclusion Titan Quest needs some help and support from devs, the game's been neglected for too long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was fine for being such a old game but when i started one of the expansions (think it was ragnarok) the game broke and started stutter super hard for whatever reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR; I dont want to recommend it anymore, because this version (at least), is far worse than I recall TQ/IT being to play..there are FAR too many issues to call it a good game anymore.. maybe I 'put up with the issues' in my past life.. but this game is unacceptable in 'this day and age'. so I dont want to recommend, which could 'inspire' the devs to create TQ2 the same! the single biggest failing of this game is the inability to RELIABLY target the enemy as a ranged class. at times you'll find it wont attack without shift (just moves closer! even though it shows an attack icon) and with shift will NOT attack where you target!\n\nafter playing so many bad games lately its refreshing to come back to a game that is actually somewhat fun to play! the story isnt that great, with some of the quests/plot devices being pretty stupid, but its an old game that I've spent way too many hours in (several characters thru legendary, but not in steam).. however, it's not without its issues! TQ is an 'itemisation' game.. you collect a LOT of stuff for multiple characters (because 'RNG' seems to favour dropping loot for every class but the one you're playing!!) but they give you VERY little storage.. but the annoying part is that bosses constantly drop 'white' loot.. if they are a 'boss' (not a 'hero') then they should at least have something 'special' (green at least!) on them! there are also still PLENTY of 'game play' issues (e.g. something as SIMPLE as splitting a stack!! when using static ranged firing, it all too often wont fire where you aim! or... you will cancel an attack animation if you move.. but wont cancel an attack animation when you NEED to move, Automated Idiotic pets.. pathetic pathing.. enemies that can attack you from off screen, cheap shots, etc etc!!) and I'm a little surprised that there are still quite a few bugs (like getting stuck in the landscape * causing you to die!, items 'falling' thru the landscape, the attack icon is shown but you're not attacking, NOT moving when you tell it too (even when not in combat!!), crashing to desktop all too often! etc etc), still present after so many years/DLCs/updates!!  and at least with AE, there are also additional issues with activating skills!  I've been playing 4 different classes 'side by side' thru the chapters.. and some classes are having issues activating their skills (especially after CD, first activation seems fine). I dont recall this being an issue in TQ/IT. even 'auto collect loot' sometimes doesnt work! but I can pick the loot up manually.. there is also WAY more stuttering on this version.. I used to play this on a PC from the early 2000s.. and it was fine! now.. the PC is way better.. and I get stuttering.. so I can no longer recommend this game with this many issues.. what is wrong with devs these days?! they're getting worse... but I'm almost positive they (the devs) have designed this game to make sure you die (regardless of res/DA/etc)! some of the random encounters are just so bogus.. and of course they dont provide a combat log to tell you why you died! because they just want you dead.. did I die due to reflect? random activated reflect?!? etc etc.. I only have one zero death character and I want to keep it that way, but thats difficult without more info!\n\nregardless it is at times a somewhat relaxing fun way to spend many hours (at least until you start finding the issues! then it becomes rather frustrating)..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought for coop, can't play coop, since servers are awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn’t hold up with today’s standards esp QoL, controller layout, technical issues like coop experience. I know it’s an old game and the dev will never try to fix known issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like Diablo 2 but it's not 2000's anymore.... weak story, cute graphics, too much grind. It wastes too much time. Only worth it if anti grind mods are enabled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Autentist, one of your moderators PM with racial slurs. I've never been in a discord server before with horrible moderators like this. Unistalled game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Anniversary edition SUCKS...won't let me create a new toon to start at the beginning again...been 4 years since i last played TItan Quest and I want to start at the beggining....DO NOT BUY the anniversary dition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "way too grindy, cant advance any main quests without grinding for at least an hour",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "happy birthday",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The good:\r\n-Somewhat interesting setting. The game takes place in the antiquity/ancient world.\r\n-Can be played co-op with friends.\r\n-Skill trees are not as complex as path of exile.\r\n\r\nThe bad:\r\n- Slow combat (compared to, for instance, grim dawn, path of exile).\r\n- Constant damage spikes and inconsistent difficulty.\r\n\r\nThe ugly:\r\n- Graphics, while serviceable, are on the older side.\r\n- Some armour/gear pieces are funny/ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Titan Quest is a classic of its time, but as a new player, the gameplay felt incredibly restrictive—like playing with handcuffs on. The graphics still hold up surprisingly well, and the mythological setting is enjoyable, but I just couldn’t bring myself to get into it. If you’re looking for more action and less mindless clicking, I wouldn’t recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to many game crashes more in muti-player than single player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good for single player,\nBut the dev team just never care about LAN/Network players, errors after errors",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can no longer play game with friends due to constant network crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest — A Mythic Journey That Demands Patience and Precision\n\nI was never really a fan of the Titan Quest series — I always preferred the dark, gothic atmosphere of Diablo II. Though, to be fair, I never managed to actually finish Diablo II — not as a kid, and not even now. It’s just that hard.\n\nBut Titan Quest? It’s tough in its own way. The game may look bright and mythological compared to Diablo’s hellish tone, but don’t be fooled — it can be just as punishing. One mistake in your build, and your entire playthrough can fall apart. There’s no mercy if you misplace your skill points or pick the wrong class combo.\n\nBack in the day, that challenge felt exciting — like a puzzle to solve. But now, when you’re an adult with less free time, endless farming and trial-and-error builds just don’t hit the same way.\n\nIt’s still a great game, rich with mythological charm and classic ARPG vibes — but these days, it’s much easier to relax with something lighter, like Diablo III.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Attention! [/h2] Game doesn't work online co-op\\LAN you can only play single player (offline) if game allows you to create character or start a new game, buttons unresponsive \nPersistent \"Network problem detected\" message (I've tried whole gamut of trouble shooting techniques)\nGame hasn't received updates since 2022\nIf you need to farm gear or items reseting level crashes game after 7 or 9 resets \nIn conclusion Titan Quest needs some help and support from devs, the game's been neglected for too long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was fine for being such a old game but when i started one of the expansions (think it was ragnarok) the game broke and started stutter super hard for whatever reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR; I dont want to recommend it anymore, because this version (at least), is far worse than I recall TQ/IT being to play..there are FAR too many issues to call it a good game anymore.. maybe I 'put up with the issues' in my past life.. but this game is unacceptable in 'this day and age'. so I dont want to recommend, which could 'inspire' the devs to create TQ2 the same! the single biggest failing of this game is the inability to RELIABLY target the enemy as a ranged class. at times you'll find it wont attack without shift (just moves closer! even though it shows an attack icon) and with shift will NOT attack where you target!\n\nafter playing so many bad games lately its refreshing to come back to a game that is actually somewhat fun to play! the story isnt that great, with some of the quests/plot devices being pretty stupid, but its an old game that I've spent way too many hours in (several characters thru legendary, but not in steam).. however, it's not without its issues! TQ is an 'itemisation' game.. you collect a LOT of stuff for multiple characters (because 'RNG' seems to favour dropping loot for every class but the one you're playing!!) but they give you VERY little storage.. but the annoying part is that bosses constantly drop 'white' loot.. if they are a 'boss' (not a 'hero') then they should at least have something 'special' (green at least!) on them! there are also still PLENTY of 'game play' issues (e.g. something as SIMPLE as splitting a stack!! when using static ranged firing, it all too often wont fire where you aim! or... you will cancel an attack animation if you move.. but wont cancel an attack animation when you NEED to move, Automated Idiotic pets.. pathetic pathing.. enemies that can attack you from off screen, cheap shots, etc etc!!) and I'm a little surprised that there are still quite a few bugs (like getting stuck in the landscape * causing you to die!, items 'falling' thru the landscape, the attack icon is shown but you're not attacking, NOT moving when you tell it too (even when not in combat!!), crashing to desktop all too often! etc etc), still present after so many years/DLCs/updates!!  and at least with AE, there are also additional issues with activating skills!  I've been playing 4 different classes 'side by side' thru the chapters.. and some classes are having issues activating their skills (especially after CD, first activation seems fine). I dont recall this being an issue in TQ/IT. even 'auto collect loot' sometimes doesnt work! but I can pick the loot up manually.. there is also WAY more stuttering on this version.. I used to play this on a PC from the early 2000s.. and it was fine! now.. the PC is way better.. and I get stuttering.. so I can no longer recommend this game with this many issues.. what is wrong with devs these days?! they're getting worse... but I'm almost positive they (the devs) have designed this game to make sure you die (regardless of res/DA/etc)! some of the random encounters are just so bogus.. and of course they dont provide a combat log to tell you why you died! because they just want you dead.. did I die due to reflect? random activated reflect?!? etc etc.. I only have one zero death character and I want to keep it that way, but thats difficult without more info!\n\nregardless it is at times a somewhat relaxing fun way to spend many hours (at least until you start finding the issues! then it becomes rather frustrating)..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought for coop, can't play coop, since servers are awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn’t hold up with today’s standards esp QoL, controller layout, technical issues like coop experience. I know it’s an old game and the dev will never try to fix known issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like Diablo 2 but it's not 2000's anymore.... weak story, cute graphics, too much grind. It wastes too much time. Only worth it if anti grind mods are enabled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Autentist, one of your moderators PM with racial slurs. I've never been in a discord server before with horrible moderators like this. Unistalled game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Anniversary edition SUCKS...won't let me create a new toon to start at the beginning again...been 4 years since i last played TItan Quest and I want to start at the beggining....DO NOT BUY the anniversary dition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "way too grindy, cant advance any main quests without grinding for at least an hour",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "happy birthday",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The good:\r\n-Somewhat interesting setting. The game takes place in the antiquity/ancient world.\r\n-Can be played co-op with friends.\r\n-Skill trees are not as complex as path of exile.\r\n\r\nThe bad:\r\n- Slow combat (compared to, for instance, grim dawn, path of exile).\r\n- Constant damage spikes and inconsistent difficulty.\r\n\r\nThe ugly:\r\n- Graphics, while serviceable, are on the older side.\r\n- Some armour/gear pieces are funny/ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Titan Quest is a classic of its time, but as a new player, the gameplay felt incredibly restrictive—like playing with handcuffs on. The graphics still hold up surprisingly well, and the mythological setting is enjoyable, but I just couldn’t bring myself to get into it. If you’re looking for more action and less mindless clicking, I wouldn’t recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to many game crashes more in muti-player than single player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good for single player,\nBut the dev team just never care about LAN/Network players, errors after errors",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can no longer play game with friends due to constant network crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest — A Mythic Journey That Demands Patience and Precision\n\nI was never really a fan of the Titan Quest series — I always preferred the dark, gothic atmosphere of Diablo II. Though, to be fair, I never managed to actually finish Diablo II — not as a kid, and not even now. It’s just that hard.\n\nBut Titan Quest? It’s tough in its own way. The game may look bright and mythological compared to Diablo’s hellish tone, but don’t be fooled — it can be just as punishing. One mistake in your build, and your entire playthrough can fall apart. There’s no mercy if you misplace your skill points or pick the wrong class combo.\n\nBack in the day, that challenge felt exciting — like a puzzle to solve. But now, when you’re an adult with less free time, endless farming and trial-and-error builds just don’t hit the same way.\n\nIt’s still a great game, rich with mythological charm and classic ARPG vibes — but these days, it’s much easier to relax with something lighter, like Diablo III.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Attention! [/h2] Game doesn't work online co-op\\LAN you can only play single player (offline) if game allows you to create character or start a new game, buttons unresponsive \nPersistent \"Network problem detected\" message (I've tried whole gamut of trouble shooting techniques)\nGame hasn't received updates since 2022\nIf you need to farm gear or items reseting level crashes game after 7 or 9 resets \nIn conclusion Titan Quest needs some help and support from devs, the game's been neglected for too long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was fine for being such a old game but when i started one of the expansions (think it was ragnarok) the game broke and started stutter super hard for whatever reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR; I dont want to recommend it anymore, because this version (at least), is far worse than I recall TQ/IT being to play..there are FAR too many issues to call it a good game anymore.. maybe I 'put up with the issues' in my past life.. but this game is unacceptable in 'this day and age'. so I dont want to recommend, which could 'inspire' the devs to create TQ2 the same! the single biggest failing of this game is the inability to RELIABLY target the enemy as a ranged class. at times you'll find it wont attack without shift (just moves closer! even though it shows an attack icon) and with shift will NOT attack where you target!\n\nafter playing so many bad games lately its refreshing to come back to a game that is actually somewhat fun to play! the story isnt that great, with some of the quests/plot devices being pretty stupid, but its an old game that I've spent way too many hours in (several characters thru legendary, but not in steam).. however, it's not without its issues! TQ is an 'itemisation' game.. you collect a LOT of stuff for multiple characters (because 'RNG' seems to favour dropping loot for every class but the one you're playing!!) but they give you VERY little storage.. but the annoying part is that bosses constantly drop 'white' loot.. if they are a 'boss' (not a 'hero') then they should at least have something 'special' (green at least!) on them! there are also still PLENTY of 'game play' issues (e.g. something as SIMPLE as splitting a stack!! when using static ranged firing, it all too often wont fire where you aim! or... you will cancel an attack animation if you move.. but wont cancel an attack animation when you NEED to move, Automated Idiotic pets.. pathetic pathing.. enemies that can attack you from off screen, cheap shots, etc etc!!) and I'm a little surprised that there are still quite a few bugs (like getting stuck in the landscape * causing you to die!, items 'falling' thru the landscape, the attack icon is shown but you're not attacking, NOT moving when you tell it too (even when not in combat!!), crashing to desktop all too often! etc etc), still present after so many years/DLCs/updates!!  and at least with AE, there are also additional issues with activating skills!  I've been playing 4 different classes 'side by side' thru the chapters.. and some classes are having issues activating their skills (especially after CD, first activation seems fine). I dont recall this being an issue in TQ/IT. even 'auto collect loot' sometimes doesnt work! but I can pick the loot up manually.. there is also WAY more stuttering on this version.. I used to play this on a PC from the early 2000s.. and it was fine! now.. the PC is way better.. and I get stuttering.. so I can no longer recommend this game with this many issues.. what is wrong with devs these days?! they're getting worse... but I'm almost positive they (the devs) have designed this game to make sure you die (regardless of res/DA/etc)! some of the random encounters are just so bogus.. and of course they dont provide a combat log to tell you why you died! because they just want you dead.. did I die due to reflect? random activated reflect?!? etc etc.. I only have one zero death character and I want to keep it that way, but thats difficult without more info!\n\nregardless it is at times a somewhat relaxing fun way to spend many hours (at least until you start finding the issues! then it becomes rather frustrating)..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought for coop, can't play coop, since servers are awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn’t hold up with today’s standards esp QoL, controller layout, technical issues like coop experience. I know it’s an old game and the dev will never try to fix known issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like Diablo 2 but it's not 2000's anymore.... weak story, cute graphics, too much grind. It wastes too much time. Only worth it if anti grind mods are enabled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Autentist, one of your moderators PM with racial slurs. I've never been in a discord server before with horrible moderators like this. Unistalled game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Anniversary edition SUCKS...won't let me create a new toon to start at the beginning again...been 4 years since i last played TItan Quest and I want to start at the beggining....DO NOT BUY the anniversary dition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "way too grindy, cant advance any main quests without grinding for at least an hour",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "happy birthday",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The good:\r\n-Somewhat interesting setting. The game takes place in the antiquity/ancient world.\r\n-Can be played co-op with friends.\r\n-Skill trees are not as complex as path of exile.\r\n\r\nThe bad:\r\n- Slow combat (compared to, for instance, grim dawn, path of exile).\r\n- Constant damage spikes and inconsistent difficulty.\r\n\r\nThe ugly:\r\n- Graphics, while serviceable, are on the older side.\r\n- Some armour/gear pieces are funny/ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Titan Quest is a classic of its time, but as a new player, the gameplay felt incredibly restrictive—like playing with handcuffs on. The graphics still hold up surprisingly well, and the mythological setting is enjoyable, but I just couldn’t bring myself to get into it. If you’re looking for more action and less mindless clicking, I wouldn’t recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to many game crashes more in muti-player than single player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good for single player,\nBut the dev team just never care about LAN/Network players, errors after errors",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can no longer play game with friends due to constant network crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest — A Mythic Journey That Demands Patience and Precision\n\nI was never really a fan of the Titan Quest series — I always preferred the dark, gothic atmosphere of Diablo II. Though, to be fair, I never managed to actually finish Diablo II — not as a kid, and not even now. It’s just that hard.\n\nBut Titan Quest? It’s tough in its own way. The game may look bright and mythological compared to Diablo’s hellish tone, but don’t be fooled — it can be just as punishing. One mistake in your build, and your entire playthrough can fall apart. There’s no mercy if you misplace your skill points or pick the wrong class combo.\n\nBack in the day, that challenge felt exciting — like a puzzle to solve. But now, when you’re an adult with less free time, endless farming and trial-and-error builds just don’t hit the same way.\n\nIt’s still a great game, rich with mythological charm and classic ARPG vibes — but these days, it’s much easier to relax with something lighter, like Diablo III.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Attention! [/h2] Game doesn't work online co-op\\LAN you can only play single player (offline) if game allows you to create character or start a new game, buttons unresponsive \nPersistent \"Network problem detected\" message (I've tried whole gamut of trouble shooting techniques)\nGame hasn't received updates since 2022\nIf you need to farm gear or items reseting level crashes game after 7 or 9 resets \nIn conclusion Titan Quest needs some help and support from devs, the game's been neglected for too long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was fine for being such a old game but when i started one of the expansions (think it was ragnarok) the game broke and started stutter super hard for whatever reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR; I dont want to recommend it anymore, because this version (at least), is far worse than I recall TQ/IT being to play..there are FAR too many issues to call it a good game anymore.. maybe I 'put up with the issues' in my past life.. but this game is unacceptable in 'this day and age'. so I dont want to recommend, which could 'inspire' the devs to create TQ2 the same! the single biggest failing of this game is the inability to RELIABLY target the enemy as a ranged class. at times you'll find it wont attack without shift (just moves closer! even though it shows an attack icon) and with shift will NOT attack where you target!\n\nafter playing so many bad games lately its refreshing to come back to a game that is actually somewhat fun to play! the story isnt that great, with some of the quests/plot devices being pretty stupid, but its an old game that I've spent way too many hours in (several characters thru legendary, but not in steam).. however, it's not without its issues! TQ is an 'itemisation' game.. you collect a LOT of stuff for multiple characters (because 'RNG' seems to favour dropping loot for every class but the one you're playing!!) but they give you VERY little storage.. but the annoying part is that bosses constantly drop 'white' loot.. if they are a 'boss' (not a 'hero') then they should at least have something 'special' (green at least!) on them! there are also still PLENTY of 'game play' issues (e.g. something as SIMPLE as splitting a stack!! when using static ranged firing, it all too often wont fire where you aim! or... you will cancel an attack animation if you move.. but wont cancel an attack animation when you NEED to move, Automated Idiotic pets.. pathetic pathing.. enemies that can attack you from off screen, cheap shots, etc etc!!) and I'm a little surprised that there are still quite a few bugs (like getting stuck in the landscape * causing you to die!, items 'falling' thru the landscape, the attack icon is shown but you're not attacking, NOT moving when you tell it too (even when not in combat!!), crashing to desktop all too often! etc etc), still present after so many years/DLCs/updates!!  and at least with AE, there are also additional issues with activating skills!  I've been playing 4 different classes 'side by side' thru the chapters.. and some classes are having issues activating their skills (especially after CD, first activation seems fine). I dont recall this being an issue in TQ/IT. even 'auto collect loot' sometimes doesnt work! but I can pick the loot up manually.. there is also WAY more stuttering on this version.. I used to play this on a PC from the early 2000s.. and it was fine! now.. the PC is way better.. and I get stuttering.. so I can no longer recommend this game with this many issues.. what is wrong with devs these days?! they're getting worse... but I'm almost positive they (the devs) have designed this game to make sure you die (regardless of res/DA/etc)! some of the random encounters are just so bogus.. and of course they dont provide a combat log to tell you why you died! because they just want you dead.. did I die due to reflect? random activated reflect?!? etc etc.. I only have one zero death character and I want to keep it that way, but thats difficult without more info!\n\nregardless it is at times a somewhat relaxing fun way to spend many hours (at least until you start finding the issues! then it becomes rather frustrating)..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought for coop, can't play coop, since servers are awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn’t hold up with today’s standards esp QoL, controller layout, technical issues like coop experience. I know it’s an old game and the dev will never try to fix known issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like Diablo 2 but it's not 2000's anymore.... weak story, cute graphics, too much grind. It wastes too much time. Only worth it if anti grind mods are enabled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Autentist, one of your moderators PM with racial slurs. I've never been in a discord server before with horrible moderators like this. Unistalled game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Anniversary edition SUCKS...won't let me create a new toon to start at the beginning again...been 4 years since i last played TItan Quest and I want to start at the beggining....DO NOT BUY the anniversary dition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "way too grindy, cant advance any main quests without grinding for at least an hour",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "happy birthday",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The good:\r\n-Somewhat interesting setting. The game takes place in the antiquity/ancient world.\r\n-Can be played co-op with friends.\r\n-Skill trees are not as complex as path of exile.\r\n\r\nThe bad:\r\n- Slow combat (compared to, for instance, grim dawn, path of exile).\r\n- Constant damage spikes and inconsistent difficulty.\r\n\r\nThe ugly:\r\n- Graphics, while serviceable, are on the older side.\r\n- Some armour/gear pieces are funny/ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Titan Quest is a classic of its time, but as a new player, the gameplay felt incredibly restrictive—like playing with handcuffs on. The graphics still hold up surprisingly well, and the mythological setting is enjoyable, but I just couldn’t bring myself to get into it. If you’re looking for more action and less mindless clicking, I wouldn’t recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "to many game crashes more in muti-player than single player",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good for single player,\nBut the dev team just never care about LAN/Network players, errors after errors",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can no longer play game with friends due to constant network crashes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Titan Quest — A Mythic Journey That Demands Patience and Precision\n\nI was never really a fan of the Titan Quest series — I always preferred the dark, gothic atmosphere of Diablo II. Though, to be fair, I never managed to actually finish Diablo II — not as a kid, and not even now. It’s just that hard.\n\nBut Titan Quest? It’s tough in its own way. The game may look bright and mythological compared to Diablo’s hellish tone, but don’t be fooled — it can be just as punishing. One mistake in your build, and your entire playthrough can fall apart. There’s no mercy if you misplace your skill points or pick the wrong class combo.\n\nBack in the day, that challenge felt exciting — like a puzzle to solve. But now, when you’re an adult with less free time, endless farming and trial-and-error builds just don’t hit the same way.\n\nIt’s still a great game, rich with mythological charm and classic ARPG vibes — but these days, it’s much easier to relax with something lighter, like Diablo III.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h2] Attention! [/h2] Game doesn't work online co-op\\LAN you can only play single player (offline) if game allows you to create character or start a new game, buttons unresponsive \nPersistent \"Network problem detected\" message (I've tried whole gamut of trouble shooting techniques)\nGame hasn't received updates since 2022\nIf you need to farm gear or items reseting level crashes game after 7 or 9 resets \nIn conclusion Titan Quest needs some help and support from devs, the game's been neglected for too long",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was fine for being such a old game but when i started one of the expansions (think it was ragnarok) the game broke and started stutter super hard for whatever reason",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR; I dont want to recommend it anymore, because this version (at least), is far worse than I recall TQ/IT being to play..there are FAR too many issues to call it a good game anymore.. maybe I 'put up with the issues' in my past life.. but this game is unacceptable in 'this day and age'. so I dont want to recommend, which could 'inspire' the devs to create TQ2 the same! the single biggest failing of this game is the inability to RELIABLY target the enemy as a ranged class. at times you'll find it wont attack without shift (just moves closer! even though it shows an attack icon) and with shift will NOT attack where you target!\n\nafter playing so many bad games lately its refreshing to come back to a game that is actually somewhat fun to play! the story isnt that great, with some of the quests/plot devices being pretty stupid, but its an old game that I've spent way too many hours in (several characters thru legendary, but not in steam).. however, it's not without its issues! TQ is an 'itemisation' game.. you collect a LOT of stuff for multiple characters (because 'RNG' seems to favour dropping loot for every class but the one you're playing!!) but they give you VERY little storage.. but the annoying part is that bosses constantly drop 'white' loot.. if they are a 'boss' (not a 'hero') then they should at least have something 'special' (green at least!) on them! there are also still PLENTY of 'game play' issues (e.g. something as SIMPLE as splitting a stack!! when using static ranged firing, it all too often wont fire where you aim! or... you will cancel an attack animation if you move.. but wont cancel an attack animation when you NEED to move, Automated Idiotic pets.. pathetic pathing.. enemies that can attack you from off screen, cheap shots, etc etc!!) and I'm a little surprised that there are still quite a few bugs (like getting stuck in the landscape * causing you to die!, items 'falling' thru the landscape, the attack icon is shown but you're not attacking, NOT moving when you tell it too (even when not in combat!!), crashing to desktop all too often! etc etc), still present after so many years/DLCs/updates!!  and at least with AE, there are also additional issues with activating skills!  I've been playing 4 different classes 'side by side' thru the chapters.. and some classes are having issues activating their skills (especially after CD, first activation seems fine). I dont recall this being an issue in TQ/IT. even 'auto collect loot' sometimes doesnt work! but I can pick the loot up manually.. there is also WAY more stuttering on this version.. I used to play this on a PC from the early 2000s.. and it was fine! now.. the PC is way better.. and I get stuttering.. so I can no longer recommend this game with this many issues.. what is wrong with devs these days?! they're getting worse... but I'm almost positive they (the devs) have designed this game to make sure you die (regardless of res/DA/etc)! some of the random encounters are just so bogus.. and of course they dont provide a combat log to tell you why you died! because they just want you dead.. did I die due to reflect? random activated reflect?!? etc etc.. I only have one zero death character and I want to keep it that way, but thats difficult without more info!\n\nregardless it is at times a somewhat relaxing fun way to spend many hours (at least until you start finding the issues! then it becomes rather frustrating)..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought for coop, can't play coop, since servers are awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game doesn’t hold up with today’s standards esp QoL, controller layout, technical issues like coop experience. I know it’s an old game and the dev will never try to fix known issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Like Diablo 2 but it's not 2000's anymore.... weak story, cute graphics, too much grind. It wastes too much time. Only worth it if anti grind mods are enabled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Autentist, one of your moderators PM with racial slurs. I've never been in a discord server before with horrible moderators like this. Unistalled game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Anniversary edition SUCKS...won't let me create a new toon to start at the beginning again...been 4 years since i last played TItan Quest and I want to start at the beggining....DO NOT BUY the anniversary dition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "way too grindy, cant advance any main quests without grinding for at least an hour",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "happy birthday",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The good:\r\n-Somewhat interesting setting. The game takes place in the antiquity/ancient world.\r\n-Can be played co-op with friends.\r\n-Skill trees are not as complex as path of exile.\r\n\r\nThe bad:\r\n- Slow combat (compared to, for instance, grim dawn, path of exile).\r\n- Constant damage spikes and inconsistent difficulty.\r\n\r\nThe ugly:\r\n- Graphics, while serviceable, are on the older side.\r\n- Some armour/gear pieces are funny/ugly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Titan Quest is a classic of its time, but as a new player, the gameplay felt incredibly restrictive—like playing with handcuffs on. The graphics still hold up surprisingly well, and the mythological setting is enjoyable, but I just couldn’t bring myself to get into it. If you’re looking for more action and less mindless clicking, I wouldn’t recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Two disclaimers before I start my rant: If giving mixed score was possible in Steam reviews I would rather choose that instead. Also, my 'review' is based on melee character (conqueror) gameplay.\n\nOne of my biggest gripes with this otherwise pretty decent game is that it sometimes feels incredibly clunky. What I mean is you are forced to use 'Stationary Attack' button if you want to relatively reliably target and hit enemies that are either small or very mobile (and sometimes also large ones due to much smaller hitbox than what you would expect). Another clunkiness example would be that character stops attacking (while holding LMB) after using War Horn skill - you can see where I'm going - you need to retarget enemies which can be a hassle (and you waste all the precious time during which enemies are stunned). I've also had an impression that it's way harder to target enemies when entering Colossus Form.\nThere is also a bunch of other minor, but nonetheless annoying issues: sometimes (give or take once every few minutes, sometimes way more often) the game freezes in an annoying way, in that when it starts running again, everything is being fast forwarded, which can be fatal while fighting strong enemies (especially for squishier character builds - I was lucky enough to survive few sketchy situations this has caused with my rather tanky character). I've noticed this problem occuring starting from Ragnarök.\nThe character gets stuck from time to time, which is also pretty annoying (f.ex. teleporting back from town directly on an opened chest or randomly getting stuck during Tiamat fight in Atlantis).\nIt is very difficult to click on some of the portals (f.ex. in Outer Atlantis).\nAnother annoyance is that Windows button becomes disabled after alt-tabbing (and the game running in background).\nThere is also a somewhat rare sound glitch where more and more sound effects begin to gradually  disappear. To solve this you need to restart the game.\n\nTo be fair there is also a lot to like about the game, one of the obvious things being the whole mythological setting. The itemisation is also very nice (I especially love 'Monster Infrequents', which are item drops exclusive to specific enemy types and what is cool about them is that when a given monster can drop it, you might be able to see said item being worn/carried by the enemy!). Also this game has ultrawide support (32:9) and works great in this aspect ratio apart from minor animation glitches outside of standard 16:9 view (frozen monster animations, t-posing NPCs, which honestly gives me a chuckle, so no biggie here).\n\nSo yeah, to sum up, it's one of these reviews where \"I'd love to give this game a positive score but I simply can't\"...\n\nPS: Also, whoever came up with the idea of adding trapped Majestic Chests with little to no loot (found in Ragnarök and onwards) is an evil person...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great until you get to Typhon\nLet me explain: back when the game first came out the base campaign had a final boss that worked just fine, except a few people used to brag about how easily they could defeat him, so the developers, who just couldn't let this fly, had the brilliant idea to remove entirely the mechanic that allowed you to beat him (the breakable statues), so that now you HAVE to tank him, which is impossible unless you happen to have extraordinary gear or you're willing to commit to an absurd amount of grinding and possibly changing your entire build and playstile\nAs far as i'm concerned they ruined the game, and if i had known that i was in for hours of a playthrough only to be halted by an absolutely unreasonable slog of an ending i would not have bought it, so i can't in good conscience recommend it to others\nIf you can find a retail copy of the game from before they introduced this STUPID change then by all means have fun with it, but this version isn't worth your time",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}