{
  "positive": [
    {
      "review": "this game is really funny and enjoyable when the fucking uplay launcher gives me permission to play it",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Ultimately, I do think The Stick of Truth is better, but this game is still absolutely on brand and they tried to do something new and distinct from the last game. More companies should do this.\n\nIf you like South Park, you're going to like this. If you don't like South Park, why are you here?",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "If the battle/turn locks up during play, Alt-Tab out of the game and back. Seems to be a prevalent issue, but it should fix it.\n\nThe game is good, though I think Obsidian Entertainment did it better with the Stick of Truth. Still, it's worth a playthrough for some of the ludicrous situations the characters end up in, and the over the top dialogue. The DLCs are fine, but can be skipped.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "~ DIFFICULTY ~\r\n🔲 My 90 year old grandma could play it\r\n✅ Easy\r\n🔲 Normal\r\n🔲 Hard\r\n🔲 Dark Souls\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n🔲 Meh\r\n🔲 Graphics dont matter in this game\r\n✅ Good\r\n🔲 Beautiful\r\n\r\n~ MUSIC ~\r\n🔲 Bad\r\n🔲 Not special\r\n🔲 Good\r\n✅ Eargasm\r\n\r\n~ STORY ~\r\n🔲 This game has no story\r\n🔲 Like playing Temple Runners for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n✅ Epic story\r\n\r\n~ PRICE ~\r\n🔲 Free\r\n🔲 Underpriced\r\n✅ Perfect Price\r\n🔲 Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n✅ Average\r\n🔲 High end\r\n🔲 NASA computer\r\n\r\n~ LENGTH ~\r\n🔲 Very Short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n✅ Average (15-50 hours)\r\n🔲 Long (50-90 hours)\r\n🔲 Extremely long (90-110 hours)\r\n🔲 No ending\r\n\r\n~ FUN ~\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n🔲 Repetitive\r\n🔲 Actually pretty amusing\r\n✅ Ride of your life\r\n\r\n~ REPLAYABILITY~\r\n🔲 It's a one-time experience\r\n🔲 Only for achievements\r\n🔲 If you wait a few months/years\r\n🔲 Definitely\r\n✅ Infinitely replayable\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n🔲 Wait for sale\r\n✅ Yes\r\n\r\n----------------\r\n\r\nSouth Park The Fractured But Whole delivers a sharp and witty experience that embraces the series trademark irreverent humour while expanding its world in engaging ways. The game creates a sense of constant surprise through its bold approach to satire and character interactions. Its pacing remains brisk, ensuring the adventure never loses momentum.\r\nThe story follows the children of South Park as they form rival superhero factions, leading to a chaotic conflict filled with sharp parody and memorable twists. Every major character contributes something humorous or unexpected to the unfolding narrative. The script captures the tone of the show with impressive accuracy, resulting in consistently entertaining moments.\r\nGameplay centres on a tactical turn based combat system that balances accessibility with strategic depth. Players can explore South Park freely, uncovering secrets, side quests and character interactions that add depth to the experience. Combat abilities are diverse and encourage experimentation, making battles consistently enjoyable.\r\nThe visuals recreate the look of the television series with remarkable precision. Animations are clean and expressive, ensuring that every joke lands exactly as intended. The vibrant environments and detailed character designs bring the town of South Park to life in a charming and authentic manner.\r\nOverall, South Park The Fractured But Whole succeeds as a humorous and engaging adventure that respects its source material while offering refined gameplay and polished presentation. The narrative remains entertaining throughout, supported by clever writing and memorable moments. With its faithful visuals and enjoyable combat, it stands as a strong entry in the genre.\r\nSouth Park The Fractured But Whole gets an 8/10.\r\n\r\nFor more reviews check my Steam profile\r\nHope you enjoyed my review, god bless you",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game's fun don't get me wrong but can we please get a bug patch. Its broken AF and I just hope this game isn't completely abandoned.\r\n\r\nStill love this game just wish it worked.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "omg this game is soo good its pretty good yk but the fucking police thing is ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gran RPG con mecánicas sencillas pero cumplidoras. A nivel técnico está excelentemente pulido, contiene las referencias que se ven en la TV y lo mejor de todo: el cast del doblaje latino es el original, por lo que toda la aventura (incluidos los DLCs) se escuchan las voces que se escuchan en la serie. Una gozada si eres fan del humor pesado y grosero. \r\n\r\nNota: Vale mucho la pena la versión Gold ya que 2 de los DLC son diferentes historias bastante entretenidas, el otro solo son peleas con bastante reto pero no contienen historia nueva.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the best games i've ever played, definetly the best of the south park colection as south park the stick of truth is a bit too rude and south park snow day is mostly just fighting, but this one is the best mix of pretty rude jokes and problem solving that are very simple",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best 6 euro spent on a game, hope everyone had as much fun as i did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "didnt really like butters shoving a hampster up my ass or giving me backshots in public but i got to kill a bunch of raisins girls so whatever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game truly lives up to the expectations stick of truth gave us. It isn't as good as stick of truth and its kinda annoying there's dlc for parts of the game that I think should be apart of the regular game It is still a really cool game with a great story, smooth gameplay, and very funny characters. One of my favorite parts of this game are the side quests. They are some of the funniest parts of the game and gives very helpful loot to progress. To sum it up, This is a great game and sequel to stick of truth. I recommend buying this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very alright. Combat doesn't start to get better until a quarter of the way through I would say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game with bunch of easter eggs i like the fighting compared to stick of the truth  if u are looking at this game and thinking should i buy this just do its so worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I’d only recommend picking this game up if you’re into turn-based combat. The story is really good tho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hesitated before purchasing this game but I was pleasantly surprised by how good it actually is.  It is a well written and hilarious romp through South Park craziness.  It was well worth playing even though a repetitive critical bug prevented me from finishing the game (with no solution working ... alt-tab, resolution, etc.).   Because of the bug I can only recommend picking this game up when it is on a significantly reduced price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good sequel that doesn't try to compete with it's better prequel, writing and story it's not as good as in The Stick of Truth, some quests are bugged, but hey, it does have a lot of content at least",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a fun time playing South Park - The Fractured But Whole. Just as in Stick of Truth, the South Park style and humour are captured perfectly and it does really feel like playing through an episode of South Park. The customization in the game is amazing with tons of cosmetics and different playstyles available with tons of references to boot. The combat was honestly what really intrigued me. I loved the tile based combat and playing around with the different attacks to find the play style and team members that suited my playstyle. That being said the game was quite easy even on the most difficult settings. No battle took me more than a single attempt. Not even the final bosses and the secret fight against Morgan Freeman. I understand that the DLC is where you can find more difficulty, but I haven’t played it yet and if playing on the most difficult setting was trivial I can’t imagine what normal difficulty plays like. For $40 you get a decent ~20 - 25 hour experience, which to me isn’t too bad. I think it should be said though that I encountered a lot of glitches that did bring down the experience. There were many times where NPC would get stuck in place, though none were mission critical. As well, I encountered a couple crashes, crashing 2 times before the police station selecting my third class. My biggest complaint doesn’t even have to do with the game itself, but the fact that it requires you to have an Ubisoft account to run its own separate launcher. It’s stupid, unnecessary, and should be removed. Fuck Ubisoft.\r\n\r\nThe game is fun to play and funny, but does have quite a few glitches that take away from the experience. I recommend playing if it’s something you are already interested in. 7/10 for gameplay brought down to 6.5 due to the bugs and needing an Ubisoft account.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing i love to play it when i can most of the game play is really funny and stupid. i like to replay the game and select new classes to see what can go together. 8/10 the game is much like the show and some points can be really dumb but all in all i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly an amazing game and truly one of the best games if you're a Southpark fan, finally played the dlc and this game still holds up and probably will for many more years to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another fantastic game. The story is really funny, just like the first game. The combat is very similar to the first game too. If you like the first game (The Stick of Truth) then you'll like this game too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like South Park. I've watched almost all the seasons, which is why I've played SoT and TFBW. I think TFBW is dry and unfunny, and the humor is misplaced. It's a decent RPG with cool progression systems, an interesting storyline, and quests—but nothing more. It could have been much better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10\nGame is pretty funny at moments, and kinda swallows you with all the collectibles, fights and etc.\nCharacters are really good as well, if you are a fan or just watched South park, youll notice references to show's episodes everywhere, starting from simply items names ending with quests and locations.\nA lot of unique voicelines, interactions between characters as well, mostly in fights.\nAchievement-wise game is pretty friendly and is not so hard to 100%.\nBut theres also a lot of big minuses\nToo long animations in battle, especially when enemy has 500000000 status effects, and animation afterwards of idling(0,5s), and you will have a lot of fights, so sum it all and in the end youll spend hour or two just staring at characters.....idling and doing unnecessery animations that could be either be in background or be faster.....its if your game wont bug and make enemies run in one place and each time someones turn begings, you would have to wait 30 seconds or so.\nDLCs\nThe mexican-vampire-goth dlc: somewhat short DLC with A LOT OF unnecessery fights(they are really repetative and non interesting. New companion is interesting but not too much, just a bit, new class is interesting but not so strong, only one ability is really good. Plot is okayish.\nScary haunted camp: Plot is super meh, new class is kinda OP and good, fights ARE REALLY BAD, as usual a lot of enemies. New companion is meh, not really worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑  Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Ascended\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy the South Park show and you’ve played the first game I recommend giving this game a play through!\n\n Solid mechanics, fun puzzles, good characters and map, however it felt like the game can get repetitive. Some glitches in areas like the lab and Freeman Tacos where my game doesn’t let the next character have combat turn, which makes me have to go back to the last checkpoint. 3.5/5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most offensive, racist, questionable, yet also the funniest game I have ever played. Go on down to South Park and become a superhero, facing strippers, Morgan Freeman, shitty ninjas, and even yourself, on a quest to save a cat to earn a 100 dollar reward to make sure your franchise is better than the Freedom Pals. \r\n\r\nI don't think I've ever laughed so hard playing a game before, nor did I think I'd ever become this invested in a SOUTH PARK game no less. Either way, nearly ten years later this game still holds up and is tremendously fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A funny insertion into the South Park universe... story line is good, and the game itself is very viable in terms of depth and development. That being said... WHY do I still need to have UBISOFT launcher installed for this. \r\nWhy... I don't need another launcher I have Steam, I bought it, on STEAM, I really hope Steam does away with this nonsense of enforcing us to install another launcher for every single game studio or publisher.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of the humor is based around farts. Sometimes, i couldn't muster up the courage to start the game because of it. But look sideways and you'll encounter LOTS of political satire mixed with a cute little southpark-esque story and some simple turn-based-combat. Now add in a couple of minigames and a map to scour through and you've got yourself SP: TFBW.\n\nIt really feels like playing a long south park episode. Keep that in mind before you buy the game. I bought it for like 3 euros so it was insanely worth for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. amazingly funny mat and trey are true artists and ubisoft rly  came through for this one. snow day i feel is worst then this game even tho it has multiplayer aspect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I couldn’t put it down once I started. Definitely worth playing.  Played it all on my steam deck, which the Ubisoft connect is annoying because it really wants internet, but otherwise was fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i was watching random southpark episodes during the several first seasons, and although those were aired many year ago i still remembered enough references to thoroughly enjoy this game and the characters that make it what it is - a hilarious, absurd and fun light rpg.\r\n\r\ni played on mastermind and finished all side quests aside from one, and most of the achievement without spending any extra time grinding especially for them and it took me around 20 hours; you could probably rush the game and finish it in few hours less if you wish so.\r\n\r\nif you like even only some of the humor of the TV series, you'll probably enjoy the game imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its ok. \r\nFirst one was better story wise, combat is better in this one.\r\nLots of references, if you dont watch the show or are up to date with its plot, you are kinda lost.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its predecessor \"South Park:The Stick Of Truth\" was a little more fun in my opinion (game-wise, everything South Park related is fun), but it is still an extremely fun game witch i will 100% play again sometime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game's tight, not as tight as the first one, out of 10, give it a 6, or a 7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed this game. The story is absurd just like the series but really intriguing for me to keep playing. If you're fans of the series, you should be able to enjoy the humor too. Graphic is quite good, gameplay is great. The only problem for me is sometimes the minigame is too hard (e.g. poop in toilet). Too bad the story is quite short, i completed this game in 25 hours, of course not 100% but I had enough with the minigames that i haven't complete it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Compared to Stick of Truth, I feel that this game has a lot of substance. Whether it's the story or the skillsets you can choose, this game has many qualities that are better than Stick of Truth. On the other hand, there are some things that I feel have had a downgrade compared to the other game. Say what you will about the combat, I'm just not a fan of it compared to the Stick of Truth style. Along with that, I feel that this game has a lot more filler content than the Stick of Truth by a long shot. However looking objectively speaking, it is a better game than Stick of Truth as it includes more character dynamics, references, and people as compared to before. So even some of the grievances I have with this game, the benefits push it just above Stick of Truth by a bit. But still, both of the games are really good overall for what South Park offers, funniness.\r\n\r\n4/5, Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s dumb, offensive, and funny. Feels just like playing a special episode. I enjoyed all the references, and the turn based combat is surprisingly well designed for both casual and experienced players. Totally recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game so much it's even better than stick of truth but the 100% is SO grueling took me like a month lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked Stick of Truth, this is more of everything — funnier, bigger, and the superhero parody stuff is spot on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great RPG and a hilarious story. Just as good as the Stick of Truth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disgusting, vile, sophomoric... I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3]A good and fun game, no worse than the first part.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Few highlight comments so far:\n-Can't wait to play with Call Girl!!\n-Gameplay kinda bit harder than Stick of Truth\n-I absolutely ABHOR COUSIN KYLE\n-I'm finally a girl now",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "IT's a funny game if you love watching south park you'll love being a part of it to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Improved upon perfection!\n\nStill, I wish there was an option to save outfits.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty cool ummmmmm they say the f word",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny as hell and so many small details added to make this game geniunely enjoyable to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, good storyline, Lots of Mitch Conner",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a huge guy for story games and i am extremely picky. For people like me searching for that game to play that hits and smth that u will enjoy to the maximum just go for this game. It’s different from the games dropping this era and that’s whats good about it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "toned down version of Stick Of Truth but still funny that they got away with the name of the game and the combat is improved in my opinion you can do more stuff instead of just using the mouse",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started to watch South Park during the pandemic, and loved it, this games has everything the show has, with the addition of your character in the game. It's fun to play and entertaining. I do recommend it for people who either know about the show or who like its dark humour.\n\nFor anyone that needs to know: this game requires the Ubisoft launcher, in case your laptop/pc can't run it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall fun gameplay revolving South Park. Commentary and story is very on brand and love the combat system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked South Park: The Stick of Truth, then you'll probably like this one too, as it's more of the same, with a superhero theme (to parody Marvel, I suppose) and some added depth to the combat. I enjoyed it until I got to certain boss fights, which I probably should have just tried on story/easy mode, because they were far more difficult than what I was looking for. I think the game is longer than it needs to be, so for me it became tedious. I haven't yet finished it; probably never will.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is def really good so far (i stopped watching a playthrough and got the game myself to see it) and im playing without DLCs and ill say just play this game w/o them at all, its completely enjoyable (especially for a first time experience)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny and RPG combined is the best game possible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to play, nice humor and most importantly- fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was a pretty good game. I loved the story, and thew combat mechanics were very well made. Props to the creators.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is okay, I much preferred Stick of Truth over this game. Definitely not worth at full price, wait for a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, come back to play again every now and then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best south park game I've ever played. If you haven't played it and you like south park, just play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game i recommend this game to everyone it runs really well on my cheap-o laptop :)))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, i learnt how to bend time by farting 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Humorous and great fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nvm nek superheroj si pa morš neko mačko rešit al neki",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "grate game matt and tray are geniusis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like southpark this game is for you,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fart so hard, your past comes to haunt you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i havent played enough but its good so far. i will put another review when i get to 200 hours...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good game true to southpark",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my names scott malkinson and i have diabetes",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "And what you saw, when you opened that door changed your life forever,\r\nAnd it led you to fight crime...\r\nYou saw your dad... f*ck your mom...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good show, good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good old fun with the boy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, fuck Cousin Kyle tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my brain is rotting i need to fracture, but whole",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now go tell everyone you cut yourself manscaping",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "All that happened just because your dad fucked your mom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worth it to buy the dlcs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good frickin game fs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bruh the spontaneous bootay Theme is a BANGER BRUH 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kyle's mom is still a bitch in this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "as good as the first one(which was very good).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bão demais da conta, sô!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like South Park you will like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "butthole c-u-m",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game made of condom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "JelteJente approves",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game:D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "like playing an episode!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hawk tuah Fart a space rift on that thang",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "greatest turned based game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a good game.  Fun to play, true to source material, all that.  My would not recommend is because you are required to use Ubisoft's stupid launcher, and it sucks.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Uses Ubisoft's bullshit 3rdparty app; literally prevented me from playing the first day because of an error on their side. After an hour of frustration. Remember when you bought a game and could just play it? Fuck this. 0/5 \n\nUpdate: Now on hour 4 of trying to get a ubisoft account to work for this single player game, because you can't play it offline or anything decent and good like that, no only horrors and rude email-support.\n\nUpdate: hour 5 and I now am being asked to create a new e-mail so they can transfer my account to it, because the email I use for everything is \"glitched in their system\" and the only way to fix it is to transfer it to another email. Wow. ok, made a new email just for this silly southpark game I got on sale(thank goddess, I would hate myself if I bought for anything close to full price). waiting for email to see if I can play the game at all.\n\n\nSo far this gaming experience is the worst, literally. Company so bad it ruins games it touches, as a rule. Heed my warning, stay away from Ubisoft STAY AWAY! If you need an alternative, pirate, cause fuck 'em!  (note: for legal reasons I mean cosplaying a pirate with an eye patch)\n\n(edit after 12ish hours; the game is great, which kinda makes the bad company handling it even more frustrating)\n\n(edit: over 40hrs beat game and all dlc; very fun, if the game freezes mid-fight press alt-esc, then click the games icon from the icon bar; apparently that bugs known, but they wont update it. Again would be a 10/10 game, but the corpos taint ever part of the experience. )",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is good. Unfortunately you need ubisoft launcher to play and when ubisoft launcher doesnt work, then you are not playing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game's okay.\nUbisoft launcher and saves are total trash with absolutely no support or fixes.\nSave your money.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "ubisoft connect is trash i'm on steam for a reason fuckin weirdos\nsaving STILL doesn't work, it just makes a copy of your last checkpoint, why even have a save function that doesn't do anything",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stop forcing peope ro use your buggy  ubisoft launcher. We've already logged in into steam, we don't want to log in anymore. Also the launcher fails to launch 4/5 times saying that the game couldn't be activated. I literally just bought this from steam, what the hell?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fantastic game, thumbs down for ubisoft connect",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The launcher keeps locking accounts, went so far as to create a new account and it locked that immediatly. Ubisoft can't even figure out how to make their old games work what a worthless company never buying one of their games again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't waste your money. I was unable to even play the game due to registering the game with Ubisoft. I could not recover my account due lost passwords ect. Also tech support will litterally blame you for account issues and will not help you recover. Unable to get a refund. \n\nI was able to play the other southpark games in the bundle. And to be honest they really are bad. I like the TV show, but with it being a game I think they wanted to push it to extremes. Be ready to learn words and things you never wanted to know about. Then toss your cookies after being exposed to some disgusting humor. The type that only a member of a group of folks that enjoy the company of the SAME type of awoken persons company... I got nothing against other peoples life choices. But don't shove yours down my throat and call it humor. Pun intended!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the South Park content is nice and sometimes funny, there was not really an improvement to the 1st game. It gets rather repeatable and some bugged fights and achievements really hurt the experience. It doesnt help that you need this stupid \"Ubisoft Connect App\" which is just annoying. It seems they coldnt go the extra mile to make this a truly good game (probaly bc of Ubisofts greed).\r\n4/10 , just watch 1-2 episodes od South Park and you will have more fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loppua kohden combatti niin rikki, että pelaaminen ei vaan onnistu.\r\n\r\nHarmi, muuten ihan hauska.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice nostalgia trip to about 15 years ago.\n\nAlas, this game did not age well, there is too much walking and walking around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Breaks my fucking pc. moves desktop icons, changes pc settings, freezes my pc, I think ubisoft or someone on the south park team loaded a fucking virus onto it. Plus my internet speeds have slowed down a bit since install its like a virus. DO NOT BUY OR INSTALL. (might just be a me issue but still)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is fun and enjoyable but the pc version sucks cuz it won't let me play it even with a ubisoft account where as on xbox it never asked me for a ubisoft account and the console versions don't have this problem\n\n0 out of 10 for pc version\n7 out of 10 on Xbox and Playstation\n\nI don't recommend the pc version but I do recommend either the Xbox or Playstation versions",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lacks substance a bit (has it just barely enough to keep forward), gets stuck on loading so game has to be restarted, rather boring movement mechanics, too much time is spent on elemental effects being applied, or the battle movements in general, or the appliance of buddys' special actions; \nOn top of that i got the final hit that got Mitch Connor life to zero, but actually it didn't it just ricocheted (second move in a row, killing my hero after like 20min of consistently dropping his health), killing my last hero, no way im gonna repeat that fight and try to finish it lol.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fighting in this game sucks ass. you cant ever target a square right next to you.\nBeen waling about trying to activate night mode, cant sleep in my bed, cant get the 3rd cat a whole lot of cants. Turns out teh games moved too far foreward",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i WISH i could play this very good game that i recommend like the stick of truth but THIS ONE has a fucking gay and retarded ubisoft connect bullshit login and if you dont create an account, you cant play. Now, ive tried creating an account trough the game launcher for THIRTY MINUTES and nothing. not even an error message, i was just spamming create account after having followed all the rules for creating an account, nothing. Cant even play offline, ok. I try making an account in the ubisoft connect app (WHY DO I HAVE TO DO THAT BTW ITS AN OFFLINE GAME) and guess what? \"too many requests, try again later\". Ive wasted an hour of my life trying to play this game, im going to go pirate it. Everyone with a brain hates you ubisoft, this is why your sales are dropping.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Это недоделанный кусок говна а не игра! За 4 часа словил багов больше чем  когда либо. Повторение одних и тех же шуток раздражает, они еще и не смешные, паразитирование на некоторых моментах прошлой части и т.д. Меня впервые так быстро выбесила игра. Юбисофт как всегда насрали.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dog shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jewbisoft will ruin anything",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Screw ubisoft. This game itself is really good but it's almost impossible to even launch the game because Ubisoft's program is terrible.",
      "voted_up": false,
      "votes_helpful": 327
    },
    {
      "review": "I can't recommend this game because of Ubisoft. I played and beat the game on console no issue but i wont stand for the Ubisoft bullshit. Can't even create an account because any date i put in for the BIRTHDAY says its invalid. What a Joke. I can't even touch this game now....spent money I can't use. Steam your a joke for allowing this shit and South Park, wow....way to loose control of your own product like this. Was able to play Stick of Truth on steam no issue. DO NOT BUY THIS GAME, DO NOT SUPPORT UBISOFT.",
      "voted_up": false,
      "votes_helpful": 254
    },
    {
      "review": "I'm a simple man. If I see a steam game I bought connecting to another launcher I give a negative review. If I wanted this on Ubisoft's crap launcher I would have bought it there. Stop putting games on steam with different launchers.",
      "voted_up": false,
      "votes_helpful": 103
    },
    {
      "review": "It's a good game.  Fun to play, true to source material, all that.  My would not recommend is because you are required to use Ubisoft's stupid launcher, and it sucks.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "I'm yet another user who loved both South Park games, but I had to get this refunded in the past because of Ubisoft. Honestly, why are they allowed on Steam? Even at 90% off, I'd be getting a three second experience after downloading it just to be told my game access is denied. Ubisoft will need to pay me to even think about it, and would need to offer me a version they cannot control and that doesn't require me to interact with their absolute waste-of-space service.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Uses Ubisoft's bullshit 3rdparty app; literally prevented me from playing the first day because of an error on their side. After an hour of frustration. Remember when you bought a game and could just play it? Fuck this. 0/5 \n\nUpdate: Now on hour 4 of trying to get a ubisoft account to work for this single player game, because you can't play it offline or anything decent and good like that, no only horrors and rude email-support.\n\nUpdate: hour 5 and I now am being asked to create a new e-mail so they can transfer my account to it, because the email I use for everything is \"glitched in their system\" and the only way to fix it is to transfer it to another email. Wow. ok, made a new email just for this silly southpark game I got on sale(thank goddess, I would hate myself if I bought for anything close to full price). waiting for email to see if I can play the game at all.\n\n\nSo far this gaming experience is the worst, literally. Company so bad it ruins games it touches, as a rule. Heed my warning, stay away from Ubisoft STAY AWAY! If you need an alternative, pirate, cause fuck 'em!  (note: for legal reasons I mean cosplaying a pirate with an eye patch)\n\n(edit after 12ish hours; the game is great, which kinda makes the bad company handling it even more frustrating)\n\n(edit: over 40hrs beat game and all dlc; very fun, if the game freezes mid-fight press alt-esc, then click the games icon from the icon bar; apparently that bugs known, but they wont update it. Again would be a 10/10 game, but the corpos taint ever part of the experience. )",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "cant even start the game with this launcher not supported in my country bro",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Ubisoft makes it too hard to play this game. I don't want to install 6 things and login to Ubisoft to play. This game is a lot of fun but I will avoid Ubisoft games going forward.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "You have to install ubisoft connect to play a single player game... not worth it.\nThat and the game isn't very good. It has some funny moments, but there is too much filler and bad game play.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "not a fan of forcibly having third party launchers installed and denuvo.\r\n\r\ncongrats on being better than EA though.  Not sure how many journalists ubisoft has dismembered, but it's less than EA.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i literally was able to play the game for 10 minutes before the game crashed and i never could play it again,the rest of my playtime was literally just me on the loading screen,such a shame,it's a good game,but Ubisoft is so absolutely CHEEKS.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is unplayable for me (Steam version on a PC). During the Combat Tutorial I am prompted to do something in a menu. Then a window appears making it imposiible to continue in any way - ALT+F4 it is. I haven't found any working fix so far. It is a pity, since I've loved The Stick of Truth, but this is plainly unplayable. Will reconsider if a fix comes up.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Game is good. Unfortunately you need ubisoft launcher to play and when ubisoft launcher doesnt work, then you are not playing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game's okay.\nUbisoft launcher and saves are total trash with absolutely no support or fixes.\nSave your money.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Ubisoft make playable games without a stupid fucking launcher challenge (impossible)",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "ubisoft connect is trash i'm on steam for a reason fuckin weirdos\nsaving STILL doesn't work, it just makes a copy of your last checkpoint, why even have a save function that doesn't do anything",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The launcher keeps locking accounts, went so far as to create a new account and it locked that immediatly. Ubisoft can't even figure out how to make their old games work what a worthless company never buying one of their games again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoyed The Stick of Truth more than this one, but The Fractured But Whole was still a fun ride in its own way. The big difference for me is replayability — I went through Stick of Truth multiple times, but once I finished this game, I just didn’t feel the urge to start over again.\r\n\r\nThe combat system felt a bit off. I really preferred Stick of Truth’s weapon-based combat compared to the artifact system here — it just felt more satisfying and straightforward.\r\n\r\nStory-wise, it has its moments, but I found Mitch Conner’s constant appearances kind of annoying and confusing. Then again, that’s probably part of his charm, right?\r\n\r\nAs for the ending… it was a bit underwhelming. It felt like everything built up just to fizzle out with a pretty generic conclusion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "por conta do launcher PORCO da ubisoft, eu não consegui jogar o jogo, parabéns para essa empresa por arruinar a experiência de muitos por um erro que já devia ser resolvido a anos...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stop forcing peope ro use your buggy  ubisoft launcher. We've already logged in into steam, we don't want to log in anymore. Also the launcher fails to launch 4/5 times saying that the game couldn't be activated. I literally just bought this from steam, what the hell?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game good, this game not so good, feels like a mobile game ported to steam... Very clunky controls, random ubisoft bull***t covering half your screen like it is a Free to Play MMO.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fix the launch issues and allow it to be played off ubisoft connect and il change the review. spend an hour downloading the game just for it to be stuck in a launching loop where the game never launches.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "this game runs like ass on any hardware for no good reason. it is paper cutouts in a 2d space.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "story was ok, definitely not as funny as the first. gameplay is an absolute chore",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bought it, paid for it, Ubisoft forced me to create an account and download an app that refuses to login. Go to the website login look for help. None. Alright then. Thanks for wasting my time and attempting to steal my money for a game that’s impossible to open even though I bought it. Ubisoft should be shut down for this shit. Had to refund before I could figure it out because every time I tried to open the game it added more time and I wasn’t risking getting told I’d spent too much time in a game that never opened to get the refund. Borderline scam definitely seems fraudulent. Don’t recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fantastic game, thumbs down for ubisoft connect",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "South park stick of truth better + fuck ubisoft i lost my account and they don't want to help me so i cant play game that i bought",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too expensive, I wouldn't pay 30€ for that.\nIt was for 3€ on autumn sale, fair price so I bought it because I liked the stick of truth.\n\nFirst, sadly its published by Ubisoft, so it comes with Ubishit viruses, that's a big thumb down from me.\n\"Connect to the club to get special in game rewards\", yes, install that spyware to play the game you just bought...\nFuck Ubisoft. :(\nAlso comes with DLCs, of course. Meh.\nThen this shares the same engine as the stick of truth. About the same map, same houses, most mechanics are unchanged.\nThe main change is the combat system, which is good by the way.\nThe story isn't anything special either. Really most of the fun relies in the fights tactical challenge.\n\nAn average game overall, decently playable, just definitely not worth its price tag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As with most Ubisoft titles, throwing a mountain of money and man-power at a concept does not make a good game. Decent, sure, but overall this is a step down from Stick of Truth. You can flood the narrative with as many callbacks to the series as possible but that doesn't create a interesting story or experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I lost 7 hours of my save file on my steam deck. That's after I had a complete headache trying to boot up the game after the Ubisoft launcher froze and crashed multiple times. \n\nThis was a good game, not great, a solid 6/10 for the hours I played. Just barely good enough to be entertaining but downright terrible enough to be monotonous and tedious. The combat system is funny but once the flavor wears off you're left with a cold boring feeling after playing.\n\nNow I thought to myself, \"Okay, I'm going to finish the rest of this game since i beat stick of truth.\" It was no Yakuza Like a Dragon and the combat definitely felt more boring than Digimon Survive which is impressive, but i did wanna be able to say, \"Hey, i beat the fractured but whole.\" \n\nWell, to my not so much surprise my save is gone. My entire 7 hours lost. And you wanna know what's funny? Ubisoft did this shit before to me on my PC. It also locked me out of my Assassins creed 2 game so I can't play it. Icing on the cake is that this isn't the only time Ubisoft has ruined my purchase, save, game, or experience in some way. \n\nSo I am going to take a deep breathe here, I'm going to tell all of you NOT to buy ANY Ubisoft slop, and this game was the last Ubisoft game I was willing to buy. I'm officially done with their bullshit, I haven't played a single Ubisoft game where i actually enjoyed myself since Division 2 and that's the only game i legitimately enjoyed.\n\nI'm so fucking done with their company that they cannot go broke fast enough. I've been saying they were going to go Bankrupt for over a decade, A DECADE. Since I was a kid and saw people pirated Assassins creed because of its copy paste slop. Nobody wants to actually buy their products, it's all copy paste. \n\nI hope every single person in Ubisoft goes bankrupt too, fuck em. Absolute garbage people and garbage company. Give me my Assassins creed 2 back, give me my save here back, give me my save on Division 1 back, let me actually open assassins creed black flag, for fucks sakes, stop letting your Ubisoft launcher crash and freeze on my steam deck. I fucking hate your company with every fiber of my wallet and even on sale your games aren't worth it Ubisoft. FUCK YOU.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If the Stick of Truth was a +8/10 experience, this game is barely a 6/10. The systems get boring faster than than what the story can offer, so the last few hours feel very dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "É divertido e engraçado, mas o primeiro jogo é bem melhor em ambos quesitos. O gameplay fica repetitivo bem rápido e muitas lutas são só vários inimigos iguais um atrás do outro. \r\nA customização diminuiu bastante do primeiro jogo: se desbloqueia poderes muito mais fortes que os outros no decorrer do jogo, então depois de um tempo a única customização perde o propósito.\r\nA história começa legal mas parece que o roteirista só cansou de escrever depois de um tempo.\r\n\r\nTerminei porque o roteiro é engraçadinho, já tinha investido algumas horas e porque gostei bastante do primeiro e imaginava que iria melhorar mais pra frente.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate that there was so much unlocks and power ups for shit I didn't even buy.\nI just bought the game.\n\nI never played it again due to that stupid ass launcher.\n\ngreat game.\nbad publisher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, but not as fun as Stick of Truth. Also, been running into issues with soft locks. If you win a fight the wrong way, buttons stop working, essentially soft-locking you. I cannot proceed through the game (3rd character) because of persistent screens that won't progress. Example: Victory Screen - You defeated the enemies, press SPACE (or A on xbox controller) to continue........neither of them work, I can't progress past the victory screen. This means I have to alt-f4 the game and start a NEW GAME FROM START any time I run into this issue. Fuck this game, fuck Ubisoft. FarCry 5 was the only good game they've released in years.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3rd party launcher is intrusive and unnecessary. \r\nGood game other than that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game.  It is so disappointing compared to \"The Stick of Truth.\"  I laughed my butt off and genuinely enjoyed that game.  This thing has very bland, predictable, and flat delivered humor.  The overall genre of a tactical RPG is a neat idea and probably would work but it is all of the surrounding elements that are just not good.  \n\nThe Ubisoft stuff simply doesnt help.\n\nThere is no way I would every recommend purchasing this game.  MAYBE if it was on sale but it is definitely not fun or entertaining.\n\nUpdate: I completed this game in 21 hours.  After completing it, I would say that the end game is far better than the beginning mainly because it is less humor and more combat.  This lends itself to a better experience because I think the humor is very flat and delivered poorly, throughout the game.  The end of the game is fight after fight and it is challenging; the variations of superpowers do lend itself with different tactics that is somewhat enjoyable to figure out a synergy.  That said, this is a sad game compared to it's predecessor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your money. I was unable to even play the game due to registering the game with Ubisoft. I could not recover my account due lost passwords ect. Also tech support will litterally blame you for account issues and will not help you recover. Unable to get a refund. \n\nI was able to play the other southpark games in the bundle. And to be honest they really are bad. I like the TV show, but with it being a game I think they wanted to push it to extremes. Be ready to learn words and things you never wanted to know about. Then toss your cookies after being exposed to some disgusting humor. The type that only a member of a group of folks that enjoy the company of the SAME type of awoken persons company... I got nothing against other peoples life choices. But don't shove yours down my throat and call it humor. Pun intended!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While the South Park content is nice and sometimes funny, there was not really an improvement to the 1st game. It gets rather repeatable and some bugged fights and achievements really hurt the experience. It doesnt help that you need this stupid \"Ubisoft Connect App\" which is just annoying. It seems they coldnt go the extra mile to make this a truly good game (probaly bc of Ubisofts greed).\r\n4/10 , just watch 1-2 episodes od South Park and you will have more fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loppua kohden combatti niin rikki, että pelaaminen ei vaan onnistu.\r\n\r\nHarmi, muuten ihan hauska.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nice nostalgia trip to about 15 years ago.\n\nAlas, this game did not age well, there is too much walking and walking around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Breaks my fucking pc. moves desktop icons, changes pc settings, freezes my pc, I think ubisoft or someone on the south park team loaded a fucking virus onto it. Plus my internet speeds have slowed down a bit since install its like a virus. DO NOT BUY OR INSTALL. (might just be a me issue but still)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is fun and enjoyable but the pc version sucks cuz it won't let me play it even with a ubisoft account where as on xbox it never asked me for a ubisoft account and the console versions don't have this problem\n\n0 out of 10 for pc version\n7 out of 10 on Xbox and Playstation\n\nI don't recommend the pc version but I do recommend either the Xbox or Playstation versions",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lacks substance a bit (has it just barely enough to keep forward), gets stuck on loading so game has to be restarted, rather boring movement mechanics, too much time is spent on elemental effects being applied, or the battle movements in general, or the appliance of buddys' special actions; \nOn top of that i got the final hit that got Mitch Connor life to zero, but actually it didn't it just ricocheted (second move in a row, killing my hero after like 20min of consistently dropping his health), killing my last hero, no way im gonna repeat that fight and try to finish it lol.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fighting in this game sucks ass. you cant ever target a square right next to you.\nBeen waling about trying to activate night mode, cant sleep in my bed, cant get the 3rd cat a whole lot of cants. Turns out teh games moved too far foreward",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Это недоделанный кусок говна а не игра! За 4 часа словил багов больше чем  когда либо. Повторение одних и тех же шуток раздражает, они еще и не смешные, паразитирование на некоторых моментах прошлой части и т.д. Меня впервые так быстро выбесила игра. Юбисофт как всегда насрали.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Waw ubisoft is retarded.... i cannot even create an account and login",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dog shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jewbisoft will ruin anything",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Screw ubisoft. This game itself is really good but it's almost impossible to even launch the game because Ubisoft's program is terrible.",
      "voted_up": false,
      "votes_helpful": 327
    },
    {
      "review": "I can't recommend this game because of Ubisoft. I played and beat the game on console no issue but i wont stand for the Ubisoft bullshit. Can't even create an account because any date i put in for the BIRTHDAY says its invalid. What a Joke. I can't even touch this game now....spent money I can't use. Steam your a joke for allowing this shit and South Park, wow....way to loose control of your own product like this. Was able to play Stick of Truth on steam no issue. DO NOT BUY THIS GAME, DO NOT SUPPORT UBISOFT.",
      "voted_up": false,
      "votes_helpful": 254
    },
    {
      "review": "I'm a simple man. If I see a steam game I bought connecting to another launcher I give a negative review. If I wanted this on Ubisoft's crap launcher I would have bought it there. Stop putting games on steam with different launchers.",
      "voted_up": false,
      "votes_helpful": 103
    },
    {
      "review": "It's a good game.  Fun to play, true to source material, all that.  My would not recommend is because you are required to use Ubisoft's stupid launcher, and it sucks.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "I'm yet another user who loved both South Park games, but I had to get this refunded in the past because of Ubisoft. Honestly, why are they allowed on Steam? Even at 90% off, I'd be getting a three second experience after downloading it just to be told my game access is denied. Ubisoft will need to pay me to even think about it, and would need to offer me a version they cannot control and that doesn't require me to interact with their absolute waste-of-space service.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Uses Ubisoft's bullshit 3rdparty app; literally prevented me from playing the first day because of an error on their side. After an hour of frustration. Remember when you bought a game and could just play it? Fuck this. 0/5 \n\nUpdate: Now on hour 4 of trying to get a ubisoft account to work for this single player game, because you can't play it offline or anything decent and good like that, no only horrors and rude email-support.\n\nUpdate: hour 5 and I now am being asked to create a new e-mail so they can transfer my account to it, because the email I use for everything is \"glitched in their system\" and the only way to fix it is to transfer it to another email. Wow. ok, made a new email just for this silly southpark game I got on sale(thank goddess, I would hate myself if I bought for anything close to full price). waiting for email to see if I can play the game at all.\n\n\nSo far this gaming experience is the worst, literally. Company so bad it ruins games it touches, as a rule. Heed my warning, stay away from Ubisoft STAY AWAY! If you need an alternative, pirate, cause fuck 'em!  (note: for legal reasons I mean cosplaying a pirate with an eye patch)\n\n(edit after 12ish hours; the game is great, which kinda makes the bad company handling it even more frustrating)\n\n(edit: over 40hrs beat game and all dlc; very fun, if the game freezes mid-fight press alt-esc, then click the games icon from the icon bar; apparently that bugs known, but they wont update it. Again would be a 10/10 game, but the corpos taint ever part of the experience. )",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "cant even start the game with this launcher not supported in my country bro",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Ubisoft makes it too hard to play this game. I don't want to install 6 things and login to Ubisoft to play. This game is a lot of fun but I will avoid Ubisoft games going forward.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "You have to install ubisoft connect to play a single player game... not worth it.\nThat and the game isn't very good. It has some funny moments, but there is too much filler and bad game play.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "not a fan of forcibly having third party launchers installed and denuvo.\r\n\r\ncongrats on being better than EA though.  Not sure how many journalists ubisoft has dismembered, but it's less than EA.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i literally was able to play the game for 10 minutes before the game crashed and i never could play it again,the rest of my playtime was literally just me on the loading screen,such a shame,it's a good game,but Ubisoft is so absolutely CHEEKS.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is unplayable for me (Steam version on a PC). During the Combat Tutorial I am prompted to do something in a menu. Then a window appears making it imposiible to continue in any way - ALT+F4 it is. I haven't found any working fix so far. It is a pity, since I've loved The Stick of Truth, but this is plainly unplayable. Will reconsider if a fix comes up.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Game is good. Unfortunately you need ubisoft launcher to play and when ubisoft launcher doesnt work, then you are not playing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game's okay.\nUbisoft launcher and saves are total trash with absolutely no support or fixes.\nSave your money.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Ubisoft make playable games without a stupid fucking launcher challenge (impossible)",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "ubisoft connect is trash i'm on steam for a reason fuckin weirdos\nsaving STILL doesn't work, it just makes a copy of your last checkpoint, why even have a save function that doesn't do anything",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The launcher keeps locking accounts, went so far as to create a new account and it locked that immediatly. Ubisoft can't even figure out how to make their old games work what a worthless company never buying one of their games again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoyed The Stick of Truth more than this one, but The Fractured But Whole was still a fun ride in its own way. The big difference for me is replayability — I went through Stick of Truth multiple times, but once I finished this game, I just didn’t feel the urge to start over again.\r\n\r\nThe combat system felt a bit off. I really preferred Stick of Truth’s weapon-based combat compared to the artifact system here — it just felt more satisfying and straightforward.\r\n\r\nStory-wise, it has its moments, but I found Mitch Conner’s constant appearances kind of annoying and confusing. Then again, that’s probably part of his charm, right?\r\n\r\nAs for the ending… it was a bit underwhelming. It felt like everything built up just to fizzle out with a pretty generic conclusion.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "por conta do launcher PORCO da ubisoft, eu não consegui jogar o jogo, parabéns para essa empresa por arruinar a experiência de muitos por um erro que já devia ser resolvido a anos...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stop forcing peope ro use your buggy  ubisoft launcher. We've already logged in into steam, we don't want to log in anymore. Also the launcher fails to launch 4/5 times saying that the game couldn't be activated. I literally just bought this from steam, what the hell?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First game good, this game not so good, feels like a mobile game ported to steam... Very clunky controls, random ubisoft bull***t covering half your screen like it is a Free to Play MMO.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fix the launch issues and allow it to be played off ubisoft connect and il change the review. spend an hour downloading the game just for it to be stuck in a launching loop where the game never launches.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "this game runs like ass on any hardware for no good reason. it is paper cutouts in a 2d space.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "story was ok, definitely not as funny as the first. gameplay is an absolute chore",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bought it, paid for it, Ubisoft forced me to create an account and download an app that refuses to login. Go to the website login look for help. None. Alright then. Thanks for wasting my time and attempting to steal my money for a game that’s impossible to open even though I bought it. Ubisoft should be shut down for this shit. Had to refund before I could figure it out because every time I tried to open the game it added more time and I wasn’t risking getting told I’d spent too much time in a game that never opened to get the refund. Borderline scam definitely seems fraudulent. Don’t recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fantastic game, thumbs down for ubisoft connect",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "South park stick of truth better + fuck ubisoft i lost my account and they don't want to help me so i cant play game that i bought",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too expensive, I wouldn't pay 30€ for that.\nIt was for 3€ on autumn sale, fair price so I bought it because I liked the stick of truth.\n\nFirst, sadly its published by Ubisoft, so it comes with Ubishit viruses, that's a big thumb down from me.\n\"Connect to the club to get special in game rewards\", yes, install that spyware to play the game you just bought...\nFuck Ubisoft. :(\nAlso comes with DLCs, of course. Meh.\nThen this shares the same engine as the stick of truth. About the same map, same houses, most mechanics are unchanged.\nThe main change is the combat system, which is good by the way.\nThe story isn't anything special either. Really most of the fun relies in the fights tactical challenge.\n\nAn average game overall, decently playable, just definitely not worth its price tag.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As with most Ubisoft titles, throwing a mountain of money and man-power at a concept does not make a good game. Decent, sure, but overall this is a step down from Stick of Truth. You can flood the narrative with as many callbacks to the series as possible but that doesn't create a interesting story or experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I lost 7 hours of my save file on my steam deck. That's after I had a complete headache trying to boot up the game after the Ubisoft launcher froze and crashed multiple times. \n\nThis was a good game, not great, a solid 6/10 for the hours I played. Just barely good enough to be entertaining but downright terrible enough to be monotonous and tedious. The combat system is funny but once the flavor wears off you're left with a cold boring feeling after playing.\n\nNow I thought to myself, \"Okay, I'm going to finish the rest of this game since i beat stick of truth.\" It was no Yakuza Like a Dragon and the combat definitely felt more boring than Digimon Survive which is impressive, but i did wanna be able to say, \"Hey, i beat the fractured but whole.\" \n\nWell, to my not so much surprise my save is gone. My entire 7 hours lost. And you wanna know what's funny? Ubisoft did this shit before to me on my PC. It also locked me out of my Assassins creed 2 game so I can't play it. Icing on the cake is that this isn't the only time Ubisoft has ruined my purchase, save, game, or experience in some way. \n\nSo I am going to take a deep breathe here, I'm going to tell all of you NOT to buy ANY Ubisoft slop, and this game was the last Ubisoft game I was willing to buy. I'm officially done with their bullshit, I haven't played a single Ubisoft game where i actually enjoyed myself since Division 2 and that's the only game i legitimately enjoyed.\n\nI'm so fucking done with their company that they cannot go broke fast enough. I've been saying they were going to go Bankrupt for over a decade, A DECADE. Since I was a kid and saw people pirated Assassins creed because of its copy paste slop. Nobody wants to actually buy their products, it's all copy paste. \n\nI hope every single person in Ubisoft goes bankrupt too, fuck em. Absolute garbage people and garbage company. Give me my Assassins creed 2 back, give me my save here back, give me my save on Division 1 back, let me actually open assassins creed black flag, for fucks sakes, stop letting your Ubisoft launcher crash and freeze on my steam deck. I fucking hate your company with every fiber of my wallet and even on sale your games aren't worth it Ubisoft. FUCK YOU.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If the Stick of Truth was a +8/10 experience, this game is barely a 6/10. The systems get boring faster than than what the story can offer, so the last few hours feel very dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "É divertido e engraçado, mas o primeiro jogo é bem melhor em ambos quesitos. O gameplay fica repetitivo bem rápido e muitas lutas são só vários inimigos iguais um atrás do outro. \r\nA customização diminuiu bastante do primeiro jogo: se desbloqueia poderes muito mais fortes que os outros no decorrer do jogo, então depois de um tempo a única customização perde o propósito.\r\nA história começa legal mas parece que o roteirista só cansou de escrever depois de um tempo.\r\n\r\nTerminei porque o roteiro é engraçadinho, já tinha investido algumas horas e porque gostei bastante do primeiro e imaginava que iria melhorar mais pra frente.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}