{
  "positive": [
    {
      "review": "Offers deep strategic gameplay with a variety of factions to choose from. Each faction feels unique, and the tactical options keep each match fresh and engaging.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Save for the atrocious DLC policy that requires you to wait for sales if you want to play with more factions and units, it's a genuinely good and fun 40K game, though I haven't played any other 4X game prior to this so I might be easily entertained.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "While the game can be challenging for newcomers, the tutorials provide a solid introduction to mechanics. With practice, players will quickly learn to navigate the complexities of combat and strategy.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "There’s a wide array of units available, each with distinct abilities and roles. This diversity encourages experimentation and strategic planning.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "For fans of the Warhammer 40K universe, the game is a treasure trove of lore. It successfully integrates the rich backstory of the factions into the gameplay, making every victory feel meaningful.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "extremely fun, tactical turn based clicky game. I love it immensely",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A solid 4X title that nails the grimdark tone. Each faction feels unique, and the constant warfare keeps things intense.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good 4x like many faction warhammer. all feel different and like making big unit. sometimes small unit feel bad and only make big unit later, but want small unit too. also no like quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Warhammer 40,000: Gladius – Relics of War proves once and for all that in the grim darkness of the far future there is only war… and apparently that’s still not enough to satisfy a proper 4X strategy fan. But Gladius gives it a solid try.\n\nWith only four factions, you might think the galaxy feels a bit empty, but each faction is crafted with such care and personality that you’ll forget you ever wanted more. Every playthrough feels distinct whether you’re fielding Space Marines with the subtlety of a meteor strike or shambling across the map as Necrons who treat diplomacy the same way they treat the living: with deep, unwavering contempt.\n\nHonestly, what were people expecting? Diplomacy? Trade deals? Peace treaties? Did anyone truly imagine sitting across the negotiation table from Necrons? Negotiating? With them? Fools. There is no peace here only beautifully structured, endlessly entertaining, turn-based annihilation.\n\nIn short: a great addition to the 4X lineup, provided you like your strategy games like your grimdark futures loud, violent, and absolutely allergic to diplomacy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "eh its ok, wouldnt pay money for it but i got it for free and its just mediocre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is Gladius perfect?\r\nNo.\r\n\r\nIs Gladius Great?\r\nErm... Also no.\r\n\r\nBut is Gladius good *enough*?\r\nYup.\r\n\r\nGrab it on sale, and you'll have a good time.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Fun with friends or by yourself. Hundreds of hours’ worth of play. Great fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Unlike games like Civilization, this one doesn't have any diplomacy and has simplified economy and research. Most of the game is just combat - both tactical (as in positioning your units and picking the best targets) and strategic (to secure resources to produce more troops).\n\nIt seems like a very simple approach, but the implementation is great. There are many factions, each has enough distinct features. The game also has a very good and fitting soundtrack.\n\nThat all would be true even without Warhammer 40k setting. If you are a fan of it - that is a bonus on top of an already great strategy game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent game, each faction feels unique and has pros and cons to them. good options to tweak to make a match each custom.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My first 4x strategy game, learned fast and addicted myself to this game. Overall great game and i would recommend it even to people getting into 4x games or if you're looking for something new",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good strategy game to play that lets you try out a lot of different units and races in the Warhammer 40K universe. Highly recommended to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best turn-based strategy game in the Warhammer 40k universe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite only playing this game for an hour and a half, this is a good game but I don't plan on playing this game again. nothing is wrong with it, its a fantastic game but be warned for people like me who are not very familiar with Warhammer as a series, its very complex. I thought it would be similar to the Age of Empires series of games with just a different theme but it is far from it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's got a ridiculous amount of DLC (like every GW game), but it's solid fun and even more with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you’re a Warhammer 40K fan or you enjoy 4X strategy games with a strong focus on warfare, Gladius is absolutely worth your time. Unlike many other 4X titles that try to balance diplomacy, culture, and science, Gladius fully commits to what the 40K universe is all about: brutal, relentless conflict—and it does it extremely well.\n\nEach faction feels unique, from their mechanics to their playstyles, and learning how to master them is a big part of the fun. The moment-to-moment gameplay is tense and rewarding, especially when you finally unlock powerful units and watch them turn the tide of battle. The map generation, quests, and neutral creatures also add a good amount of variety to each playthrough.\n\nThe game is easy to get into but has enough depth to keep you engaged for dozens of hours. It’s especially fun in multiplayer with friends—matches can get intense quickly, and every decision matters.\n\nIf you want a pure, combat-heavy 4X experience set in the grimdark future of Warhammer 40,000, Gladius is one of the best out there. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Want to play a game that combines both Warhammer 40k and civil games together, then this game is for you.  I first heard of this game about a month ago, and I've never had thought about playing a civil-type of game until trying this version.\r\nThis game is like any other civilization games, except it's in the Warhammer 40k universe.  You get to choose any of the factions within that universe, ranging from Space Marines towards the Necrons, and build your civilization upon a planet kown as Galdius Prime.\r\nI think that this game is great, especially I am not much into civil games.  But I guest that Warhammer 40k is what it made this game so appealing towards me.  The AI opponents that you will be facing can be challenging, but this game can make you want to come back for some more.  I like that it is a turn-base type of game, which allows you time to think about your next move.  The graphics are also great as well and I like how detail it is as you zoom up closer towards one of your colonies as well.\r\nI would recommend this game for anyone who are into both Warhammer 40k and Civilization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not really a fan of strategy games and mostly played this because it was temporarily free and I like Warhammer. It's quite a good game if strategy games similar to Civilization VI are your jam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS FUN, BUT A LOT OF THE RULES/MECHANICS MAKE IT FEEL LIKE IT WAS PORTED OVER FROM A BOARD GAME. THERES KNOWN BUGS THATD TAKE A SECOND TO FIX BUT HAVENT BEEN FOR YEARS. THE DLCS ARE EXORBITANTLY PRICED, EVEN WHEN THEYRE ON SALE. \n\nTHE BASE RACES ARE POORLY BALANCED, BUT THATS OK, CUZ THEY RATED THEM DIFFERENT DIFFICULTIES. WHY BALANCE A THING WHEN YOU CAN JUST LABEL 1 BAD (LOOKIN AT U IMPERIAL GUARD).\n\nALL THAT SAID, I THINK ITS FUN AF. I WON IT IN A RAFFLE AND STILL SUNK 200 HOURS INTO IT, AND ID DO MORE IF I COULD GET MY FRIEND TO PLAY IT MORE OFTEN (HE LIKES IMP GUARD, WHICH IS HIS OWN DANG FAULT)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have written this review for the steam awards trophy... nevertheless, 10/10 T'au supremacy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game! It's like a perfect fusion of COE5 CIV5 and warhammer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great 4x game. Great multiplayer fun as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun however i keep getting jumped by guardsmen\r\n]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and addicting. Civ without the diplomacy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun and addicting. Co-op works very well",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very well executed take on 4X style of gameplay, that's adapted well to the 40K universe.\n\nThe inclusion of unit sizes adds a level of depth to combat that makes it much more enjoyable than in other games of its genre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simple to learn, W40K:G-RoW is an easy-going 4X game, reminiscent of the Sid Meier's Civ games except the only path to victory is conquest.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun and challenging!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is a fun turn based its best with friends and allows you to do all sort of dumb and funny stuff",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good, straight-forward fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game but gets boring after some time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts beans, dont play it unless you want to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fairly manageable learning curve. A fun holdover until we get Total War 40K.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AFTER 34.1 HOURS, I FINALLY UNDERSTAND THIS GAME ENOUGH TO HAVE MY FIRST VICTORY AS A SPACE MARINE!!! IT WILL NOT BE MY LAST! THIS IS NOT AGE OF EMPIRES, THIS IS NOT CIV 7, THIS IS WARHAMMER THOUGH AND THOUGH. ITS SUPPOSED TO BE A CHALLENGE, AND IT IS JUST THAT. FOR THE EMPEROR!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "civ but good and cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game bad DLC policy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Leagues of Votann could be a nice new faction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Warhammer whats there not to like lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "REQUISITION FOR THE REQUISITION GOD!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It has too many DLCs. Expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warhammer series all nice",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For Emperor!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems good fun with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good 40k",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like crack.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "FOR THE GOLDEN THRONE!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "She war on my hammer till I",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice but not for me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GREAT GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun innit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "норм",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Одлична",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hehe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It isn't a bad strategy game, but it isn't excellent. It has a foundation, the core mechanics of the game are fun but a lot of the factions are locked behind 16 euros paywalls each.\r\n  The normal factions are fun, the Space Marines and the necrons are very powerful with the necrons being able to build other cities while the SMa can't.  The played content isn't that fantastic , the Chaos SMs have a MISERABLE early game. \r\n  I got this when it was free so I don't have to think about the 40 euros that is spend on a digital game that I can't thouch and therefore I am at the mercy of Gabe .\r\n  If you really want this game I think that you should by it and test it for 2 hours.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Offers deep strategic gameplay with a variety of factions to choose from. Each faction feels unique, and the tactical options keep each match fresh and engaging.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Save for the atrocious DLC policy that requires you to wait for sales if you want to play with more factions and units, it's a genuinely good and fun 40K game, though I haven't played any other 4X game prior to this so I might be easily entertained.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Oh My Emperor! What an amazing game this is!\n\n4X turn-based strategy game\n\nIgnore any review that mentions diplomacy. It's of the same worth as a complaint about a lack of diplomacy in Tetris: it belies a fundamental misconception. It's Warhammer, not Friendhammer. \"There is only war\" is a fundamental aspect of the IP, and Gladius is wholly, beautifully in line with it.\n\nIncredibly in-depth 4X turn-based strategy game, with thoughtfully crafted graphics that transport you into a world of futuristic warfare.\n\nDifferent factions have their own special abilities and tactical options that you can use to your advantage. Different types of terrain, such as forests and mountains add to the challenge and make it much more tactical and interesting.\nThe UI is simple and easy to understand, easing new players into the game. You can also customize your units with different weapons and even upgrade them as you progress through the game. I was particularly pleased with the extensive research system which gives you access to powerful tech as you progress.\n\nOverall, a great game that 4X turn-based strategy fans should definitely check out. All in all, I highly recommend Warhammer 40K Gladius for strategy gamers.\n\n(A note about DLC: this game was made by 2 coders and a writer a few years ago. Every six months, there is a DLC, either a unit pack or a new faction. They include DLC units on the tech tree for some reason, and this makes people angry, thinking there's a paywall for units that weren't in the game until 2 years after release. Don't be fooled, it's a good and fair support cycle).",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "While the game can be challenging for newcomers, the tutorials provide a solid introduction to mechanics. With practice, players will quickly learn to navigate the complexities of combat and strategy.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "There’s a wide array of units available, each with distinct abilities and roles. This diversity encourages experimentation and strategic planning.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "For fans of the Warhammer 40K universe, the game is a treasure trove of lore. It successfully integrates the rich backstory of the factions into the gameplay, making every victory feel meaningful.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "What a great game - I really started with ZEPHON then I thought that this may be good and guess what - its perfect.  Its like Heroes mixed with Civilization - but in Warhammer universe. The replayeability is insane due to the procedurally generated content - especially map with settings. Also there is a variety of factions and every faction offers different playstyle... Totally recommended!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "really great game, like how you have to stratgize but i dont like how the DLCs cost entire games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game only issue i have is that other factions are locked behind a pay wall",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Civilization is one of my most played games, going way back to childhood. Warhammer 40k + Civilization is a big win for me (I used to play 40k tabletop a bit). Not sure how much replay value it has, but on the current big discount hard to go wrong with this. They really make no attempt to hide that they've ripped off Civilization, but they gave it a unique spin that makes it feel like you're in a unique Civilization game similar to Beyond Earth. If you look at the price of the new Civilization right now this is a massive bargain on discount. £3.51 right now, you have to get it NOW on 90% discount. This game might even do a lot of things better than classic Civilization, depending on your taste. I played an arcade basketball throwing game that cost me £1 for like 20 seconds of game play the other day (omg!). By comparison this is entertainment value at its peak. A hidden gem for Civ fans at this price if you've got a weekend or two to spare. There are differences with Civ, such as a drastically simplified tech tree, but it still has an interesting tech tree. In fact it is more similar than it seems because the branches are hidden.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "extremely fun, tactical turn based clicky game. I love it immensely",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A solid 4X title that nails the grimdark tone. Each faction feels unique, and the constant warfare keeps things intense.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good 4x like many faction warhammer. all feel different and like making big unit. sometimes small unit feel bad and only make big unit later, but want small unit too. also no like quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good. Some factions are weaker than others. All of them are fun in their own way. Mods are plentiful, and if you want to adjust mods slightly or make changes, it is really simple. I find it fun and a easy game to run in the background and waste time when I want to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "alot of dlc's that should be with the game, just lacking factions and units becasue of it. would only buy on sales",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, slow, and hard to learn, but so rewarding, once you learn, and also get to play with a group of friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Warhammer 40,000: Gladius is a slightly clunky CIV game that focuses solely on city building and growing your war machine.  This works perfectly for a Warhammer 40k setting: In the grim darkness of the far future there is only war, so what else would you expect?  What it lacks in varying victory conditions it makes up for in focused strategic gameplay. The scale of the battles, especially mid-late game are magnificent and very fun.  It is both addicting (just one more turn) and faster paced than other 4x games.  I tend not to finish too many CIV games because I find the late game grind less fun.  But I have the opposite feeling with Gladius, I find the late game more fun and rewarding and action oriented, so I've tended to finish a good number of games I've started.  There is a lot of lore to read (which I like) and a ton of units and deep tech trees.  Each faction feels very unique and many play very differently from each other.  It takes more than one game for me to \"get\" a faction.  Another positive is there is solid mod support in the workshop, which brings more flavor to the game.  It's a very fun game, and the more I play the more I like it.\r\n\r\nSome negatives, as I said at the start, the GUI and presentation are a little clunky. Many things aren't explained well and the in game dictionary is a pain to use with no search function.  But luckily there are websites to help. The main negative is one others have mentioned.  If you want to buy this game with all of the DLC's (there's so many) it will cost you about the same as buying a real plastic army from Games Workshop..  Meaning it's expensive, way too expensive for a PC game.  But it does go on sale a lot, and you can pick and choose the DLC you are interested in. Still that business model isn't my cup of tea.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Warhammer 40,000: Gladius – Relics of War proves once and for all that in the grim darkness of the far future there is only war… and apparently that’s still not enough to satisfy a proper 4X strategy fan. But Gladius gives it a solid try.\n\nWith only four factions, you might think the galaxy feels a bit empty, but each faction is crafted with such care and personality that you’ll forget you ever wanted more. Every playthrough feels distinct whether you’re fielding Space Marines with the subtlety of a meteor strike or shambling across the map as Necrons who treat diplomacy the same way they treat the living: with deep, unwavering contempt.\n\nHonestly, what were people expecting? Diplomacy? Trade deals? Peace treaties? Did anyone truly imagine sitting across the negotiation table from Necrons? Negotiating? With them? Fools. There is no peace here only beautifully structured, endlessly entertaining, turn-based annihilation.\n\nIn short: a great addition to the 4X lineup, provided you like your strategy games like your grimdark futures loud, violent, and absolutely allergic to diplomacy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "eh its ok, wouldnt pay money for it but i got it for free and its just mediocre",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is Gladius perfect?\r\nNo.\r\n\r\nIs Gladius Great?\r\nErm... Also no.\r\n\r\nBut is Gladius good *enough*?\r\nYup.\r\n\r\nGrab it on sale, and you'll have a good time.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Fun with friends or by yourself. Hundreds of hours’ worth of play. Great fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Unlike games like Civilization, this one doesn't have any diplomacy and has simplified economy and research. Most of the game is just combat - both tactical (as in positioning your units and picking the best targets) and strategic (to secure resources to produce more troops).\n\nIt seems like a very simple approach, but the implementation is great. There are many factions, each has enough distinct features. The game also has a very good and fitting soundtrack.\n\nThat all would be true even without Warhammer 40k setting. If you are a fan of it - that is a bonus on top of an already great strategy game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent game, each faction feels unique and has pros and cons to them. good options to tweak to make a match each custom.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My first 4x strategy game, learned fast and addicted myself to this game. Overall great game and i would recommend it even to people getting into 4x games or if you're looking for something new",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good strategy game to play that lets you try out a lot of different units and races in the Warhammer 40K universe. Highly recommended to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best turn-based strategy game in the Warhammer 40k universe.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite only playing this game for an hour and a half, this is a good game but I don't plan on playing this game again. nothing is wrong with it, its a fantastic game but be warned for people like me who are not very familiar with Warhammer as a series, its very complex. I thought it would be similar to the Age of Empires series of games with just a different theme but it is far from it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's got a ridiculous amount of DLC (like every GW game), but it's solid fun and even more with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you’re a Warhammer 40K fan or you enjoy 4X strategy games with a strong focus on warfare, Gladius is absolutely worth your time. Unlike many other 4X titles that try to balance diplomacy, culture, and science, Gladius fully commits to what the 40K universe is all about: brutal, relentless conflict—and it does it extremely well.\n\nEach faction feels unique, from their mechanics to their playstyles, and learning how to master them is a big part of the fun. The moment-to-moment gameplay is tense and rewarding, especially when you finally unlock powerful units and watch them turn the tide of battle. The map generation, quests, and neutral creatures also add a good amount of variety to each playthrough.\n\nThe game is easy to get into but has enough depth to keep you engaged for dozens of hours. It’s especially fun in multiplayer with friends—matches can get intense quickly, and every decision matters.\n\nIf you want a pure, combat-heavy 4X experience set in the grimdark future of Warhammer 40,000, Gladius is one of the best out there. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Want to play a game that combines both Warhammer 40k and civil games together, then this game is for you.  I first heard of this game about a month ago, and I've never had thought about playing a civil-type of game until trying this version.\r\nThis game is like any other civilization games, except it's in the Warhammer 40k universe.  You get to choose any of the factions within that universe, ranging from Space Marines towards the Necrons, and build your civilization upon a planet kown as Galdius Prime.\r\nI think that this game is great, especially I am not much into civil games.  But I guest that Warhammer 40k is what it made this game so appealing towards me.  The AI opponents that you will be facing can be challenging, but this game can make you want to come back for some more.  I like that it is a turn-base type of game, which allows you time to think about your next move.  The graphics are also great as well and I like how detail it is as you zoom up closer towards one of your colonies as well.\r\nI would recommend this game for anyone who are into both Warhammer 40k and Civilization.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good 4x, probably the hardest I've played gives you a good challenge, dont bother with the quests though, its better to turn them off as the ai tends to win i.e Aldari",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game. It can be a very challenging game, which is good. You really need to use great strategy to win these games. There is a great starting selection of factions and good DLC to make it even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In the grim darkness of the 41st millennium, there is only war ... as a victory type in this civ-like game. \n\nIt's fun enough in small doses but I have found that extended sessions just become a bit boring. It's not a bad game at all, it even has some interesting idea's such as it's quest system. But it's just not as good as Civ and I honestly think that's down to the fact conquest alone is not interesting enough to hold your attention. \n \nNether the less, it looks fine (for 40k), runs smoothly, AI turns are fast, audio is serviceable. My 3 biggest complaints are that the UI is uninspired, the music is just present and the base game only gives you 4 factions to play with ... but I picked this game up in a steam giveaway so I don't think it's fair for me to complain about that, if I bought the game and only got 4 factions i'd be pretty unimpressed.\n\nIt's a solid 6~7 outta 10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The base game free, a tempting sight,\nYet hollow worlds with little fight.\nDLC's are key, or else you’ll find,\nA barren land, a waste of time.\n\nSave your gold, don’t waste your days,\nFor endless wars that go sideways.\nLearn from me, and heed the sign,\nDon’t let this fate become yours with mine.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR edition, it's a good game but hampered by it's DLC policy and pricing, and it makes me angry.\n\nI've seen people recommend this game while mentioning the same arguments as I have, and frankly I've enjoyed my time with the game. That’s why I'm on the fence not recommending it. If you're prepared to pay for it, or of there's a good discount, you can get it and have fun with it, the game itself is good.\n\nI've completed 1.5 playthroughs as of now, without any DLCs. I'm not very proficient in 4x games, but I do love them, ever since Civ 1. Gameplay-wise it's basically Civ 5-6 but with WH40K, no diplomacy and more fighting instead. Reminds me of Civ 5 scenario \"Empires of the Smoky Skies\" since the game is set in one technological era. And I like that kind of gameplay. I like that the planet feels grim-dark, the landscape is oppressive, hard to traverse and has hazards that damage your troops, and has much more of wild life barbarian enemies who feel threatening.\n\nThat said, the base game is incredibly barren, 4 factions with half a roster each. I can't really complain since I've got the game for free couple of years back... No wait, this is internet, I can complain however I want! \nSo yeah, even though there are eleven factions, you can only play as four. not only that, your enemies are also limited to the same 4. So its just orks/necron/guards/marines all game every game. and those DLC for factions are there taunting you to buy them. one. faction. at. a. time. and say for example you don't want to play most factions, but if you still want to play against them - you have to buy their DLC. I have to repeat this, You have to by DLC factions you don't want to play. \n\nAnd that's not all, we still have the 9 DLC with units for factions, each having 4-8 units for several factions, spread out like a thin layer of butter over everything, each DLC adding another one. and those aren't some extra, there are core units in there. Want an APC for your guards? Chimera is a DLC unit? Land raider? in another DLC with stuff you might not care about for other races. Immortals? DLC again. so that's like almost half the roster locked behind a wall of DLCs, starting 4 factions are especially gimped. Space marines have it the worst, one DLC has 8 of their units. Yeah you also have to buy them for AI to play too even if you're not interested. That's 16 DLC total, and approaches Paradox levels of nickel-and-diming.\n\nThose are not cheap DLCs either, going for like 16.5 euro for a faction and 6-10 euro for a reinforcement pack. That's almost 200 euro worth of DLCs on top of 40 euro for a base game (released in 2018, 7 years ago). DLCs you won't easily be able to ignore, as I've said. Sales? 40% tops. Season passes or bundles? You get complete edition bundle with like 20% discount for 190 euros for the game + all DLCs and that’s it. Truly a Games Workshop product\n\nNot even that, take something like Total War Warhammer for example. True, there's even more DLCs, over three games, but they are better priced, better discounted, better grouped, and most importantly, available for AI to use. You don't have to pay for a shiny new chaos dwarf DLC if you just want to krump them in your game, they get added in a patch with other quality of life upgrades. You can stick to your starting roster if you like and have lot's of variety in your enemies. If you feel so inclined, you can pick up another faction DLC and have a comprehensive playthrough without being hamstrung by the fact you don't own every other DLC first. And DLCs are crossgame, you buy Norsca in TW:W1, you can play them in TW:W13 if you want. Even stupid blood god dlc you only have to buy once and it's very cheap.\n\nSee, that's what I expected going into Gladius. TW:W1 also predates Gladius by 2 years, so the precedent was there. Another good option would be to have cheaper bundles or maybe season passes. Currently I just think that Gladius has a petty policy and is way too expensive for what it is. From what I gather, the developer's next game, ZEPHON, is much better in this regard. True, it lacks wh40k IP, but I think I'd rather play ZEPHON than Gladius.\n\nOh, and soundtrack is kinda meh.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its fun as long as you're willing to fork out your life savings to actually play the full game. the base game includes FOUR factions, you've got to buy the others. but don't think you're done by just buying new factions, oh no, then you have to buy all the expansions to unlock the rest of the faction you just bought. it's fucking ridiculous, and ruins what would be an incredible game. thank god i got this through the skulls event for free, because otherwise you're just buying the ability to spend more money. reprehensible practises.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This really is just a cash grab. I guess the game is not bad per se since it has the usual 4x mechanics minus diplomacy and trade. But the base game really doesn't offer much. Four factions that's it. If the DLCs were cheap I would reconsider but some of them stand at 15 Euros. I played for a little bit but it feels kinda dull. There is a lot of stuff on the map and you really don't know what to do with it. Play something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "$150 of DLC plus $40 makes for nearly $200. Is it worth that? Absolutely not, and I do not support triple AAA studios using this form of aggressive and crappy approach to games... is the game fun?...it's Warhammer 40k and Civ love child, of course it's fun. Just not $200 fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was really gripped by the into and voice acting but the experience quickly went very wrong leaving me to wonder:\n\nAre these developers absolutely cracked in the head?!?\n\nI played the TUTORIAL mission which was apparently supposed to be \"EASY to learn the game\", explored and conquered 75% of the map with no issue, then all of sudden infinite Necrons started appearing..HOW THE HELL is this supposed to be fun when on the damn tutorial mission suddenly you're outnumbered by 8 enemy units to every one of yours, they sprint for 5+ tiles, shoot 2 tiles away, your mid-levelled up units do 1.2-2.0pts of damage to them, EACH of their units does 5-8+ to yours, they heal 6.0pts each turn and will kite you by sprinting a partially damaged unit into the FOW to sprint 7 other units in.\nTanks barely scowl at them, anti-personel nor krak grenades do shit all, devastators can take down a unit or two before getting gangbanged by their 7 friends...\n\nI honestly took so many screenshots I couldnt believe this \"experience\", maybe i'd understand if i'd been playing on some insane difficulty...but the damn tutorial?!?!\n\nMind blown. Give me my money back i've been assaulted",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Got a key for cheap.\n\nIf you buy this full price for £170 you are retarded.\nThe game is shit. The \"wild\" AI spawns at max level and will steamroll you on turn 2 if it pathfinds to you at random.\n\nIf you want one unit extra, you have to buy a DLC. I'm surprised you don't have to buy a DLC to play multiplayer, open the settings, or do anything at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolut Wertloser Müll der schlappe 197,30 Euro + 40,86 Hauptspiel Kostet. Avoid at all cost",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's like civ but shallow, and you just fight overtuned barbarians for 80-90% of every game\n\nGot this for free and it's fun with friend(s), but not at all worth the base price nor the DLC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You don't play you vs. other factions.  It's you vs overpowered wildlife and eventually you might see someone else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gets repetitive quickly and 100$ dlc",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "James and his workshop at it again with the dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pest extermination simulator 2k18",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IT FEELS WAY LESS POLISHED THAN THE PRICE TAG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overpriced DLCs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In order to have a full game, even if you only plan to play as one faction, you have to buy several add ons. the demolition pack, the escalation pack, the firepower pack etc.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "DLC money farm. the base game is just buying the demo and you have to buy everything else individually. over 200 dollars for a game is a crime. (Edit: No where near as bad as paradox games though)",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "The game is...not that fun. Each faction can be reduced to 2-3 units that you spam constantly to win. It probably is more interesting with some of the stuff that is locked behind DLC, but good god it's $95 if you want the bundle! And this is at sale price.  It's a scam, unless you got money to burn (I have kids, so that's a no from me dawg) or you feel you haven't been bled enough by Paradox games and their endless DLC, then go ahead! It's basically Panzer Corps re-done as Warhammer 40k, but with worse balance.The models look good, which is nice, but that's about it.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "The base game free, a tempting sight,\nYet hollow worlds with little fight.\nDLC's are key, or else you’ll find,\nA barren land, a waste of time.\n\nSave your gold, don’t waste your days,\nFor endless wars that go sideways.\nLearn from me, and heed the sign,\nDon’t let this fate become yours with mine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not for me. The city 'building' is flimsy, and there seem to be nothing to the game other than pumping out military units to grind your way to victory. Got bored very quickly with the repetitive nature of the game. Seems very 'thin' too - not many units and the upgrades/research all a bit samey.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR edition, it's a good game but hampered by it's DLC policy and pricing, and it makes me angry.\n\nI've seen people recommend this game while mentioning the same arguments as I have, and frankly I've enjoyed my time with the game. That’s why I'm on the fence not recommending it. If you're prepared to pay for it, or of there's a good discount, you can get it and have fun with it, the game itself is good.\n\nI've completed 1.5 playthroughs as of now, without any DLCs. I'm not very proficient in 4x games, but I do love them, ever since Civ 1. Gameplay-wise it's basically Civ 5-6 but with WH40K, no diplomacy and more fighting instead. Reminds me of Civ 5 scenario \"Empires of the Smoky Skies\" since the game is set in one technological era. And I like that kind of gameplay. I like that the planet feels grim-dark, the landscape is oppressive, hard to traverse and has hazards that damage your troops, and has much more of wild life barbarian enemies who feel threatening.\n\nThat said, the base game is incredibly barren, 4 factions with half a roster each. I can't really complain since I've got the game for free couple of years back... No wait, this is internet, I can complain however I want! \nSo yeah, even though there are eleven factions, you can only play as four. not only that, your enemies are also limited to the same 4. So its just orks/necron/guards/marines all game every game. and those DLC for factions are there taunting you to buy them. one. faction. at. a. time. and say for example you don't want to play most factions, but if you still want to play against them - you have to buy their DLC. I have to repeat this, You have to by DLC factions you don't want to play. \n\nAnd that's not all, we still have the 9 DLC with units for factions, each having 4-8 units for several factions, spread out like a thin layer of butter over everything, each DLC adding another one. and those aren't some extra, there are core units in there. Want an APC for your guards? Chimera is a DLC unit? Land raider? in another DLC with stuff you might not care about for other races. Immortals? DLC again. so that's like almost half the roster locked behind a wall of DLCs, starting 4 factions are especially gimped. Space marines have it the worst, one DLC has 8 of their units. Yeah you also have to buy them for AI to play too even if you're not interested. That's 16 DLC total, and approaches Paradox levels of nickel-and-diming.\n\nThose are not cheap DLCs either, going for like 16.5 euro for a faction and 6-10 euro for a reinforcement pack. That's almost 200 euro worth of DLCs on top of 40 euro for a base game (released in 2018, 7 years ago). DLCs you won't easily be able to ignore, as I've said. Sales? 40% tops. Season passes or bundles? You get complete edition bundle with like 20% discount for 190 euros for the game + all DLCs and that’s it. Truly a Games Workshop product\n\nNot even that, take something like Total War Warhammer for example. True, there's even more DLCs, over three games, but they are better priced, better discounted, better grouped, and most importantly, available for AI to use. You don't have to pay for a shiny new chaos dwarf DLC if you just want to krump them in your game, they get added in a patch with other quality of life upgrades. You can stick to your starting roster if you like and have lot's of variety in your enemies. If you feel so inclined, you can pick up another faction DLC and have a comprehensive playthrough without being hamstrung by the fact you don't own every other DLC first. And DLCs are crossgame, you buy Norsca in TW:W1, you can play them in TW:W13 if you want. Even stupid blood god dlc you only have to buy once and it's very cheap.\n\nSee, that's what I expected going into Gladius. TW:W1 also predates Gladius by 2 years, so the precedent was there. Another good option would be to have cheaper bundles or maybe season passes. Currently I just think that Gladius has a petty policy and is way too expensive for what it is. From what I gather, the developer's next game, ZEPHON, is much better in this regard. True, it lacks wh40k IP, but I think I'd rather play ZEPHON than Gladius.\n\nOh, and soundtrack is kinda meh.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hundreds of dollars in DLC and yet they claim voice acting is too expensive.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "i love 4x and love wh40k so in theory i should love this game, but i don't\r\n\r\nI find Gladius incredibly grindy - the initial and mid game are fun ( generally until you destroy a couple of ennemy cities), but the end game is a slog, especially if you do the racial quests, which can spawn a lot of new ennemies\r\n\r\nThis grind has less straegy, it's a lot of attrition warfare",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While I think this is a really well made and very fun RTS, I absolutely hate the locking of major factions behind the DLC paywall, especially at the price of $15 per additional faction and you only start with four factions. Chaos and Eldar are some of the original factions of the entire 40k franchise, but locked behind paying more. The \"full game\" should not be $130.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having legally accumulated a dozen Warhammer titles across various game launchers, I find myself in a peculiar situation. These games have all made their way into my library through the allure of free giveaways, raising questions about the underlying strategy behind this generosity.\n\nUpon closer inspection, the mystery begins to unravel, as it becomes evident that the majority of these games feature expensive DLC. This seemingly altruistic approach, offering the core experience at no cost, appears to be a calculated tactic designed to entice players into investing in additional content down the line.\n\nWhile it's true that nobody forced my hand in accepting these free-to-claim Warhammer games, the eye-watering £136 price tag for DLC content in this seven year old title leaves me questioning the true value of such offerings.\n\nThis substantial cost seems almost comical in the context of an ostensibly free game, raising concerns about the genuine accessibility of these titles for players who cannot or choose not to invest in additional content. As the gaming industry continues to blur the lines between free and paid experiences, it is vital for gamers to weigh the long-term financial implications of entering a world where the full enjoyment of a title hinges on substantial further investment.\n\nAs we traverse this increasingly convoluted landscape of free games and costly DLC, it is important to approach such offerings with a discerning eye, recognizing that true value often extends beyond the initial price tag – or lack thereof.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "its fun as long as you're willing to fork out your life savings to actually play the full game. the base game includes FOUR factions, you've got to buy the others. but don't think you're done by just buying new factions, oh no, then you have to buy all the expansions to unlock the rest of the faction you just bought. it's fucking ridiculous, and ruins what would be an incredible game. thank god i got this through the skulls event for free, because otherwise you're just buying the ability to spend more money. reprehensible practises.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just a 40k skin on a cheap 4x game engine. Nothing like wild dogs killing off space marines to kill the 40k vibe. I also hate their business model. The DLC exceeds the total cost of the game and all they do is give you a handful of new units. I hate to admit it but I got roped into this game because I'm a 40k nerd and this game just doesn't satisfy. The AI also leaves much to be desired. I like a challenge but not if that means the game gets to cheat. Fog of war abuse and spawning enemies without resources to produce them is this game's idea of challenge. You feel more like the punchline to a bad joke than a Space Marine chapter...\r\n\r\nEven the graphics are dated for their time. This game has nothing going for it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This really is just a cash grab. I guess the game is not bad per se since it has the usual 4x mechanics minus diplomacy and trade. But the base game really doesn't offer much. Four factions that's it. If the DLCs were cheap I would reconsider but some of them stand at 15 Euros. I played for a little bit but it feels kinda dull. There is a lot of stuff on the map and you really don't know what to do with it. Play something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "$150 of DLC plus $40 makes for nearly $200. Is it worth that? Absolutely not, and I do not support triple AAA studios using this form of aggressive and crappy approach to games... is the game fun?...it's Warhammer 40k and Civ love child, of course it's fun. Just not $200 fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game hasn't had any meaningful updates for a while, which isn't even explained by their other game, ZEPHON, as that one also been seemingly abandoned. tech support for the game is non-existent as well, with the devs being radio silent even on their forums. the issues with servers are present at random and can persist through months, miraculously being fixed on its own.\n\nanother WH40K game that was great at the start, but failing in continuing its existence. fucking cashgrabs in 2025 are a blight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was really gripped by the into and voice acting but the experience quickly went very wrong leaving me to wonder:\n\nAre these developers absolutely cracked in the head?!?\n\nI played the TUTORIAL mission which was apparently supposed to be \"EASY to learn the game\", explored and conquered 75% of the map with no issue, then all of sudden infinite Necrons started appearing..HOW THE HELL is this supposed to be fun when on the damn tutorial mission suddenly you're outnumbered by 8 enemy units to every one of yours, they sprint for 5+ tiles, shoot 2 tiles away, your mid-levelled up units do 1.2-2.0pts of damage to them, EACH of their units does 5-8+ to yours, they heal 6.0pts each turn and will kite you by sprinting a partially damaged unit into the FOW to sprint 7 other units in.\nTanks barely scowl at them, anti-personel nor krak grenades do shit all, devastators can take down a unit or two before getting gangbanged by their 7 friends...\n\nI honestly took so many screenshots I couldnt believe this \"experience\", maybe i'd understand if i'd been playing on some insane difficulty...but the damn tutorial?!?!\n\nMind blown. Give me my money back i've been assaulted",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Got a key for cheap.\n\nIf you buy this full price for £170 you are retarded.\nThe game is shit. The \"wild\" AI spawns at max level and will steamroll you on turn 2 if it pathfinds to you at random.\n\nIf you want one unit extra, you have to buy a DLC. I'm surprised you don't have to buy a DLC to play multiplayer, open the settings, or do anything at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolut Wertloser Müll der schlappe 197,30 Euro + 40,86 Hauptspiel Kostet. Avoid at all cost",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring civ clone. Too easy and too boring to play. Literally nothing happens in game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk why i cant skip unit animations anymore but i wont be playing. I end up spending most of my time in the game just waiting for all the enemies to move and i am just unwilling to wait the 3-5 seconds for each one. What happened to the option to skip?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun RTS with a lot of potential ruined by poor AI.\nBasically a Civ game with more focus on combat.\n\nProblem with AI (in2025) is AI doesn't prioritize capturing resource points leading to them never getting stronger as the game goes on. You eventually just steamroll the AI since you out produce them.  At higher difficulties the AI is given more loyalty to build more cities, but they don't produce enough resources to sustain them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game really irritates me the fact that the stupid machine faction keeps getting health back each round and literally restores their full hp makes no sense, why are the space marines so weak in this game??? and why does it take forever to get guys who can actually heal your units? The logic in this game baffles me, worst table top ever with such a scummy price for DLC ah yes buy more so you can win with a faction that is actually OP in this game... terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you dont already know how to play dont bother trying to get into it. Easy introduction mode will have 7-8 units all superior in power in your base within 30 turns while you're still producing your 4th unit and setting up your resources. Just dont bother. You can't explore, you can't defend. If it's that close ended just tell me exactly what you want, as a matter of fact why dont you just make it an animated movie if my input and participation matters this little.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After the company Games Workshop openly supported and advocated for the murder and assassination of Charlie Kirk I will never give this company another cent. from video games to tabletop I am done with them. i may update this review dependent upon a company statement.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Paying 131,05€ for all DLC (with the discount) to have a full experience? Thanks, but no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "screw this shit, got this shit for free, spent minutes playing this shit, didnt understand shit, tutorial wasnt helping cuz it was shit so i asked steam support to take this shit back, dont ever make shit like this free again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As much as I love 40K, I don't support GW celebrating unjustifiable threats & violence. I'm sorry to Proxy Studios & Slitherine that you got caught in the crossfire, I'd suggest you go to GW & tell them to put an end to their madness.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Confusing UI, DLC nightmare. More work than fun. Boring.  Not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't run. Text does not appear on any menu or interface.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like civ but shallow, and you just fight overtuned barbarians for 80-90% of every game\n\nGot this for free and it's fun with friend(s), but not at all worth the base price nor the DLC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You don't play you vs. other factions.  It's you vs overpowered wildlife and eventually you might see someone else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gets repetitive quickly and 100$ dlc",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "James and his workshop at it again with the dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pest extermination simulator 2k18",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IT FEELS WAY LESS POLISHED THAN THE PRICE TAG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Overpriced DLCs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In order to have a full game, even if you only plan to play as one faction, you have to buy several add ons. the demolition pack, the escalation pack, the firepower pack etc.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "DLC money farm. the base game is just buying the demo and you have to buy everything else individually. over 200 dollars for a game is a crime. (Edit: No where near as bad as paradox games though)",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "The base game free, a tempting sight,\nYet hollow worlds with little fight.\nDLC's are key, or else you’ll find,\nA barren land, a waste of time.\n\nSave your gold, don’t waste your days,\nFor endless wars that go sideways.\nLearn from me, and heed the sign,\nDon’t let this fate become yours with mine.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game is...not that fun. Each faction can be reduced to 2-3 units that you spam constantly to win. It probably is more interesting with some of the stuff that is locked behind DLC, but good god it's $95 if you want the bundle! And this is at sale price.  It's a scam, unless you got money to burn (I have kids, so that's a no from me dawg) or you feel you haven't been bled enough by Paradox games and their endless DLC, then go ahead! It's basically Panzer Corps re-done as Warhammer 40k, but with worse balance.The models look good, which is nice, but that's about it.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Not for me. The city 'building' is flimsy, and there seem to be nothing to the game other than pumping out military units to grind your way to victory. Got bored very quickly with the repetitive nature of the game. Seems very 'thin' too - not many units and the upgrades/research all a bit samey.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hundreds of dollars in DLC and yet they claim voice acting is too expensive.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "TL;DR edition, it's a good game but hampered by it's DLC policy and pricing, and it makes me angry.\n\nI've seen people recommend this game while mentioning the same arguments as I have, and frankly I've enjoyed my time with the game. That’s why I'm on the fence not recommending it. If you're prepared to pay for it, or of there's a good discount, you can get it and have fun with it, the game itself is good.\n\nI've completed 1.5 playthroughs as of now, without any DLCs. I'm not very proficient in 4x games, but I do love them, ever since Civ 1. Gameplay-wise it's basically Civ 5-6 but with WH40K, no diplomacy and more fighting instead. Reminds me of Civ 5 scenario \"Empires of the Smoky Skies\" since the game is set in one technological era. And I like that kind of gameplay. I like that the planet feels grim-dark, the landscape is oppressive, hard to traverse and has hazards that damage your troops, and has much more of wild life barbarian enemies who feel threatening.\n\nThat said, the base game is incredibly barren, 4 factions with half a roster each. I can't really complain since I've got the game for free couple of years back... No wait, this is internet, I can complain however I want! \nSo yeah, even though there are eleven factions, you can only play as four. not only that, your enemies are also limited to the same 4. So its just orks/necron/guards/marines all game every game. and those DLC for factions are there taunting you to buy them. one. faction. at. a. time. and say for example you don't want to play most factions, but if you still want to play against them - you have to buy their DLC. I have to repeat this, You have to by DLC factions you don't want to play. \n\nAnd that's not all, we still have the 9 DLC with units for factions, each having 4-8 units for several factions, spread out like a thin layer of butter over everything, each DLC adding another one. and those aren't some extra, there are core units in there. Want an APC for your guards? Chimera is a DLC unit? Land raider? in another DLC with stuff you might not care about for other races. Immortals? DLC again. so that's like almost half the roster locked behind a wall of DLCs, starting 4 factions are especially gimped. Space marines have it the worst, one DLC has 8 of their units. Yeah you also have to buy them for AI to play too even if you're not interested. That's 16 DLC total, and approaches Paradox levels of nickel-and-diming.\n\nThose are not cheap DLCs either, going for like 16.5 euro for a faction and 6-10 euro for a reinforcement pack. That's almost 200 euro worth of DLCs on top of 40 euro for a base game (released in 2018, 7 years ago). DLCs you won't easily be able to ignore, as I've said. Sales? 40% tops. Season passes or bundles? You get complete edition bundle with like 20% discount for 190 euros for the game + all DLCs and that’s it. Truly a Games Workshop product\n\nNot even that, take something like Total War Warhammer for example. True, there's even more DLCs, over three games, but they are better priced, better discounted, better grouped, and most importantly, available for AI to use. You don't have to pay for a shiny new chaos dwarf DLC if you just want to krump them in your game, they get added in a patch with other quality of life upgrades. You can stick to your starting roster if you like and have lot's of variety in your enemies. If you feel so inclined, you can pick up another faction DLC and have a comprehensive playthrough without being hamstrung by the fact you don't own every other DLC first. And DLCs are crossgame, you buy Norsca in TW:W1, you can play them in TW:W13 if you want. Even stupid blood god dlc you only have to buy once and it's very cheap.\n\nSee, that's what I expected going into Gladius. TW:W1 also predates Gladius by 2 years, so the precedent was there. Another good option would be to have cheaper bundles or maybe season passes. Currently I just think that Gladius has a petty policy and is way too expensive for what it is. From what I gather, the developer's next game, ZEPHON, is much better in this regard. True, it lacks wh40k IP, but I think I'd rather play ZEPHON than Gladius.\n\nOh, and soundtrack is kinda meh.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i love 4x and love wh40k so in theory i should love this game, but i don't\r\n\r\nI find Gladius incredibly grindy - the initial and mid game are fun ( generally until you destroy a couple of ennemy cities), but the end game is a slog, especially if you do the racial quests, which can spawn a lot of new ennemies\r\n\r\nThis grind has less straegy, it's a lot of attrition warfare",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having legally accumulated a dozen Warhammer titles across various game launchers, I find myself in a peculiar situation. These games have all made their way into my library through the allure of free giveaways, raising questions about the underlying strategy behind this generosity.\n\nUpon closer inspection, the mystery begins to unravel, as it becomes evident that the majority of these games feature expensive DLC. This seemingly altruistic approach, offering the core experience at no cost, appears to be a calculated tactic designed to entice players into investing in additional content down the line.\n\nWhile it's true that nobody forced my hand in accepting these free-to-claim Warhammer games, the eye-watering £136 price tag for DLC content in this seven year old title leaves me questioning the true value of such offerings.\n\nThis substantial cost seems almost comical in the context of an ostensibly free game, raising concerns about the genuine accessibility of these titles for players who cannot or choose not to invest in additional content. As the gaming industry continues to blur the lines between free and paid experiences, it is vital for gamers to weigh the long-term financial implications of entering a world where the full enjoyment of a title hinges on substantial further investment.\n\nAs we traverse this increasingly convoluted landscape of free games and costly DLC, it is important to approach such offerings with a discerning eye, recognizing that true value often extends beyond the initial price tag – or lack thereof.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "its fun as long as you're willing to fork out your life savings to actually play the full game. the base game includes FOUR factions, you've got to buy the others. but don't think you're done by just buying new factions, oh no, then you have to buy all the expansions to unlock the rest of the faction you just bought. it's fucking ridiculous, and ruins what would be an incredible game. thank god i got this through the skulls event for free, because otherwise you're just buying the ability to spend more money. reprehensible practises.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just a 40k skin on a cheap 4x game engine. Nothing like wild dogs killing off space marines to kill the 40k vibe. I also hate their business model. The DLC exceeds the total cost of the game and all they do is give you a handful of new units. I hate to admit it but I got roped into this game because I'm a 40k nerd and this game just doesn't satisfy. The AI also leaves much to be desired. I like a challenge but not if that means the game gets to cheat. Fog of war abuse and spawning enemies without resources to produce them is this game's idea of challenge. You feel more like the punchline to a bad joke than a Space Marine chapter...\r\n\r\nEven the graphics are dated for their time. This game has nothing going for it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This really is just a cash grab. I guess the game is not bad per se since it has the usual 4x mechanics minus diplomacy and trade. But the base game really doesn't offer much. Four factions that's it. If the DLCs were cheap I would reconsider but some of them stand at 15 Euros. I played for a little bit but it feels kinda dull. There is a lot of stuff on the map and you really don't know what to do with it. Play something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "$150 of DLC plus $40 makes for nearly $200. Is it worth that? Absolutely not, and I do not support triple AAA studios using this form of aggressive and crappy approach to games... is the game fun?...it's Warhammer 40k and Civ love child, of course it's fun. Just not $200 fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game hasn't had any meaningful updates for a while, which isn't even explained by their other game, ZEPHON, as that one also been seemingly abandoned. tech support for the game is non-existent as well, with the devs being radio silent even on their forums. the issues with servers are present at random and can persist through months, miraculously being fixed on its own.\n\nanother WH40K game that was great at the start, but failing in continuing its existence. fucking cashgrabs in 2025 are a blight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was really gripped by the into and voice acting but the experience quickly went very wrong leaving me to wonder:\n\nAre these developers absolutely cracked in the head?!?\n\nI played the TUTORIAL mission which was apparently supposed to be \"EASY to learn the game\", explored and conquered 75% of the map with no issue, then all of sudden infinite Necrons started appearing..HOW THE HELL is this supposed to be fun when on the damn tutorial mission suddenly you're outnumbered by 8 enemy units to every one of yours, they sprint for 5+ tiles, shoot 2 tiles away, your mid-levelled up units do 1.2-2.0pts of damage to them, EACH of their units does 5-8+ to yours, they heal 6.0pts each turn and will kite you by sprinting a partially damaged unit into the FOW to sprint 7 other units in.\nTanks barely scowl at them, anti-personel nor krak grenades do shit all, devastators can take down a unit or two before getting gangbanged by their 7 friends...\n\nI honestly took so many screenshots I couldnt believe this \"experience\", maybe i'd understand if i'd been playing on some insane difficulty...but the damn tutorial?!?!\n\nMind blown. Give me my money back i've been assaulted",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Got a key for cheap.\n\nIf you buy this full price for £170 you are retarded.\nThe game is shit. The \"wild\" AI spawns at max level and will steamroll you on turn 2 if it pathfinds to you at random.\n\nIf you want one unit extra, you have to buy a DLC. I'm surprised you don't have to buy a DLC to play multiplayer, open the settings, or do anything at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolut Wertloser Müll der schlappe 197,30 Euro + 40,86 Hauptspiel Kostet. Avoid at all cost",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring civ clone. Too easy and too boring to play. Literally nothing happens in game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk why i cant skip unit animations anymore but i wont be playing. I end up spending most of my time in the game just waiting for all the enemies to move and i am just unwilling to wait the 3-5 seconds for each one. What happened to the option to skip?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun RTS with a lot of potential ruined by poor AI.\nBasically a Civ game with more focus on combat.\n\nProblem with AI (in2025) is AI doesn't prioritize capturing resource points leading to them never getting stronger as the game goes on. You eventually just steamroll the AI since you out produce them.  At higher difficulties the AI is given more loyalty to build more cities, but they don't produce enough resources to sustain them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game really irritates me the fact that the stupid machine faction keeps getting health back each round and literally restores their full hp makes no sense, why are the space marines so weak in this game??? and why does it take forever to get guys who can actually heal your units? The logic in this game baffles me, worst table top ever with such a scummy price for DLC ah yes buy more so you can win with a faction that is actually OP in this game... terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Artificial impossible difficulty gating achievements.\r\n\r\nWhy? What is the point?\r\n\r\nGlad I bought for peanuts from reseller. Will not buy Slitherine games in future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you dont already know how to play dont bother trying to get into it. Easy introduction mode will have 7-8 units all superior in power in your base within 30 turns while you're still producing your 4th unit and setting up your resources. Just dont bother. You can't explore, you can't defend. If it's that close ended just tell me exactly what you want, as a matter of fact why dont you just make it an animated movie if my input and participation matters this little.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After the company Games Workshop openly supported and advocated for the murder and assassination of Charlie Kirk I will never give this company another cent. from video games to tabletop I am done with them. i may update this review dependent upon a company statement.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Paying 131,05€ for all DLC (with the discount) to have a full experience? Thanks, but no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "screw this shit, got this shit for free, spent minutes playing this shit, didnt understand shit, tutorial wasnt helping cuz it was shit so i asked steam support to take this shit back, dont ever make shit like this free again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As much as I love 40K, I don't support GW celebrating unjustifiable threats & violence. I'm sorry to Proxy Studios & Slitherine that you got caught in the crossfire, I'd suggest you go to GW & tell them to put an end to their madness.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't run. Text does not appear on any menu or interface.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately, this game has to be classified as uninspired, linear, and a cash grab. Even the DLC, which delivers new units in stingy tiny portions, does not change the fact that this game simply has no replay value. Zephon looks exact identical so Proxy may have questionable motives.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's like civ but shallow, and you just fight overtuned barbarians for 80-90% of every game\n\nGot this for free and it's fun with friend(s), but not at all worth the base price nor the DLC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You don't play you vs. other factions.  It's you vs overpowered wildlife and eventually you might see someone else",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gets repetitive quickly and 100$ dlc",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "James and his workshop at it again with the dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pest extermination simulator 2k18",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IT FEELS WAY LESS POLISHED THAN THE PRICE TAG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In order to have a full game, even if you only plan to play as one faction, you have to buy several add ons. the demolition pack, the escalation pack, the firepower pack etc.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "DLC money farm. the base game is just buying the demo and you have to buy everything else individually. over 200 dollars for a game is a crime. (Edit: No where near as bad as paradox games though)",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "The base game free, a tempting sight,\nYet hollow worlds with little fight.\nDLC's are key, or else you’ll find,\nA barren land, a waste of time.\n\nSave your gold, don’t waste your days,\nFor endless wars that go sideways.\nLearn from me, and heed the sign,\nDon’t let this fate become yours with mine.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game is...not that fun. Each faction can be reduced to 2-3 units that you spam constantly to win. It probably is more interesting with some of the stuff that is locked behind DLC, but good god it's $95 if you want the bundle! And this is at sale price.  It's a scam, unless you got money to burn (I have kids, so that's a no from me dawg) or you feel you haven't been bled enough by Paradox games and their endless DLC, then go ahead! It's basically Panzer Corps re-done as Warhammer 40k, but with worse balance.The models look good, which is nice, but that's about it.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Not for me. The city 'building' is flimsy, and there seem to be nothing to the game other than pumping out military units to grind your way to victory. Got bored very quickly with the repetitive nature of the game. Seems very 'thin' too - not many units and the upgrades/research all a bit samey.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hundreds of dollars in DLC and yet they claim voice acting is too expensive.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "TL;DR edition, it's a good game but hampered by it's DLC policy and pricing, and it makes me angry.\n\nI've seen people recommend this game while mentioning the same arguments as I have, and frankly I've enjoyed my time with the game. That’s why I'm on the fence not recommending it. If you're prepared to pay for it, or of there's a good discount, you can get it and have fun with it, the game itself is good.\n\nI've completed 1.5 playthroughs as of now, without any DLCs. I'm not very proficient in 4x games, but I do love them, ever since Civ 1. Gameplay-wise it's basically Civ 5-6 but with WH40K, no diplomacy and more fighting instead. Reminds me of Civ 5 scenario \"Empires of the Smoky Skies\" since the game is set in one technological era. And I like that kind of gameplay. I like that the planet feels grim-dark, the landscape is oppressive, hard to traverse and has hazards that damage your troops, and has much more of wild life barbarian enemies who feel threatening.\n\nThat said, the base game is incredibly barren, 4 factions with half a roster each. I can't really complain since I've got the game for free couple of years back... No wait, this is internet, I can complain however I want! \nSo yeah, even though there are eleven factions, you can only play as four. not only that, your enemies are also limited to the same 4. So its just orks/necron/guards/marines all game every game. and those DLC for factions are there taunting you to buy them. one. faction. at. a. time. and say for example you don't want to play most factions, but if you still want to play against them - you have to buy their DLC. I have to repeat this, You have to by DLC factions you don't want to play. \n\nAnd that's not all, we still have the 9 DLC with units for factions, each having 4-8 units for several factions, spread out like a thin layer of butter over everything, each DLC adding another one. and those aren't some extra, there are core units in there. Want an APC for your guards? Chimera is a DLC unit? Land raider? in another DLC with stuff you might not care about for other races. Immortals? DLC again. so that's like almost half the roster locked behind a wall of DLCs, starting 4 factions are especially gimped. Space marines have it the worst, one DLC has 8 of their units. Yeah you also have to buy them for AI to play too even if you're not interested. That's 16 DLC total, and approaches Paradox levels of nickel-and-diming.\n\nThose are not cheap DLCs either, going for like 16.5 euro for a faction and 6-10 euro for a reinforcement pack. That's almost 200 euro worth of DLCs on top of 40 euro for a base game (released in 2018, 7 years ago). DLCs you won't easily be able to ignore, as I've said. Sales? 40% tops. Season passes or bundles? You get complete edition bundle with like 20% discount for 190 euros for the game + all DLCs and that’s it. Truly a Games Workshop product\n\nNot even that, take something like Total War Warhammer for example. True, there's even more DLCs, over three games, but they are better priced, better discounted, better grouped, and most importantly, available for AI to use. You don't have to pay for a shiny new chaos dwarf DLC if you just want to krump them in your game, they get added in a patch with other quality of life upgrades. You can stick to your starting roster if you like and have lot's of variety in your enemies. If you feel so inclined, you can pick up another faction DLC and have a comprehensive playthrough without being hamstrung by the fact you don't own every other DLC first. And DLCs are crossgame, you buy Norsca in TW:W1, you can play them in TW:W13 if you want. Even stupid blood god dlc you only have to buy once and it's very cheap.\n\nSee, that's what I expected going into Gladius. TW:W1 also predates Gladius by 2 years, so the precedent was there. Another good option would be to have cheaper bundles or maybe season passes. Currently I just think that Gladius has a petty policy and is way too expensive for what it is. From what I gather, the developer's next game, ZEPHON, is much better in this regard. True, it lacks wh40k IP, but I think I'd rather play ZEPHON than Gladius.\n\nOh, and soundtrack is kinda meh.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i love 4x and love wh40k so in theory i should love this game, but i don't\r\n\r\nI find Gladius incredibly grindy - the initial and mid game are fun ( generally until you destroy a couple of ennemy cities), but the end game is a slog, especially if you do the racial quests, which can spawn a lot of new ennemies\r\n\r\nThis grind has less straegy, it's a lot of attrition warfare",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having legally accumulated a dozen Warhammer titles across various game launchers, I find myself in a peculiar situation. These games have all made their way into my library through the allure of free giveaways, raising questions about the underlying strategy behind this generosity.\n\nUpon closer inspection, the mystery begins to unravel, as it becomes evident that the majority of these games feature expensive DLC. This seemingly altruistic approach, offering the core experience at no cost, appears to be a calculated tactic designed to entice players into investing in additional content down the line.\n\nWhile it's true that nobody forced my hand in accepting these free-to-claim Warhammer games, the eye-watering £136 price tag for DLC content in this seven year old title leaves me questioning the true value of such offerings.\n\nThis substantial cost seems almost comical in the context of an ostensibly free game, raising concerns about the genuine accessibility of these titles for players who cannot or choose not to invest in additional content. As the gaming industry continues to blur the lines between free and paid experiences, it is vital for gamers to weigh the long-term financial implications of entering a world where the full enjoyment of a title hinges on substantial further investment.\n\nAs we traverse this increasingly convoluted landscape of free games and costly DLC, it is important to approach such offerings with a discerning eye, recognizing that true value often extends beyond the initial price tag – or lack thereof.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "its fun as long as you're willing to fork out your life savings to actually play the full game. the base game includes FOUR factions, you've got to buy the others. but don't think you're done by just buying new factions, oh no, then you have to buy all the expansions to unlock the rest of the faction you just bought. it's fucking ridiculous, and ruins what would be an incredible game. thank god i got this through the skulls event for free, because otherwise you're just buying the ability to spend more money. reprehensible practises.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just a 40k skin on a cheap 4x game engine. Nothing like wild dogs killing off space marines to kill the 40k vibe. I also hate their business model. The DLC exceeds the total cost of the game and all they do is give you a handful of new units. I hate to admit it but I got roped into this game because I'm a 40k nerd and this game just doesn't satisfy. The AI also leaves much to be desired. I like a challenge but not if that means the game gets to cheat. Fog of war abuse and spawning enemies without resources to produce them is this game's idea of challenge. You feel more like the punchline to a bad joke than a Space Marine chapter...\r\n\r\nEven the graphics are dated for their time. This game has nothing going for it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This really is just a cash grab. I guess the game is not bad per se since it has the usual 4x mechanics minus diplomacy and trade. But the base game really doesn't offer much. Four factions that's it. If the DLCs were cheap I would reconsider but some of them stand at 15 Euros. I played for a little bit but it feels kinda dull. There is a lot of stuff on the map and you really don't know what to do with it. Play something else I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "$150 of DLC plus $40 makes for nearly $200. Is it worth that? Absolutely not, and I do not support triple AAA studios using this form of aggressive and crappy approach to games... is the game fun?...it's Warhammer 40k and Civ love child, of course it's fun. Just not $200 fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game hasn't had any meaningful updates for a while, which isn't even explained by their other game, ZEPHON, as that one also been seemingly abandoned. tech support for the game is non-existent as well, with the devs being radio silent even on their forums. the issues with servers are present at random and can persist through months, miraculously being fixed on its own.\n\nanother WH40K game that was great at the start, but failing in continuing its existence. fucking cashgrabs in 2025 are a blight.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}