{
  "positive": [
    {
      "review": "[h1] BUY ONLY ON SALE[/h1]\r\nGame feels similar to older iterations just touched up if u have older versions, not missin much different besides different representatives and maybe a building or two.Late game can be a bog since it highlights parts of the game that need optimization beyond your control, traffic will freeze up for in game YEARS if you have a large population which would seems reflective of real life...if it wasnt bugged at intersections and the measurement of time wasnt drastic.BUT the scenarios are fun and comical with charm to them, good achievements to get which is the saving grace, scenarios with dlcs on feels better than without but thats preference.\r\n[h2] If you were to buy the game BUY DLCS ON SALE TOO[/h2]\r\n[u]DLCS THAT ADD USEFUL/FUN ELEMENTS[/u]\r\nTropican shores(personal fav makes me upset its not base game)\r\nNew Frontiers(optimial building)\r\nReturn to Nature\r\nCarribbean Skies (can solve some logistics/traffic jams with drones)\r\nFestivals\r\n[b] The rest will add game elements that can hinder gameplay,but can offer really strong bonuses(going viral), lack content  AND or just plain buggy like spitter celebs [/b]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "El Presidente builds cities much more interesting than his rival Paradox. The only way to vote is for the Kalypso and their faithful sidekick Penultimo!\n\nI've been wanting to try Tropico for a long time and I finally picked it up recently. Definitely worth a play if you like city builders/logistics type games. It's not quite as intense as Anno, but more interesting than Cities Skylines.\n\nThe game isn't perfect by any means. The animations with some of the characters walking around are a little janky at times, but at least they exist and make your island feel alive. This is a big pain point for Skylines 2 right now. You're not going to manage traffic or anything like that in Tropico, though there are vehicles driving and goods moving around in trucks. It's more about providing resources and buildings to allow your population to flourish or live in squalor.\n\nI'm playing through the story missions and so far they are interesting enough to feel rewarding. By the time I finish the missions, I'm ready to move on and start a new island, but you have the option to continue building afterwards which is nice. I have yet to see the cold war era or modern era so there is still a lot more to explore. If you're on the fence, it's worth checking out when it's on sale.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I’ve played Tropico 4, 5, and 6. I think Tropico 6 is the best. I enjoyed managing multiple islands. Nature and buildings look great. Gameplay is the same. I can either be a nice president or a dictator by declaring martial law and killing rebels and their families. I miss dynasty from Tropico 5.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing City builder game\n\nYou get to Make your own Tiny island country\n\nPick a side during a couple Eras\n\nTheres a mod store built in For Extra content\n\nPretty good Replayability\n\ndont play too much for too long to avoid getting extremly burnt out as it is one of those games in a way",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love it. There's no other game out there that scratchs this particular itch.\r\n\r\nIt's a country management simulator and a city builder all at once\r\n\r\nI hope the Devs add more transport management options in the next game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very gut game, fun, little difficult at beginning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A banana republic simulator that despite its tongue in cheek nature is actually a great country simulator game. A lot of depth, and let's you be as benevolent or oppressive a presidente as you want to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El Presidente told me to write a little review here so that they would release my family back to me.\n\nIt is, of course, a solid development on the previous titles in the series!\n\nYou can run your island republic in any way you see fit and have fun managing all the dynamics of the island and the shifting economics and technologies of the times. I've played this solo and with friends over many years, its a great game you can pick up and have a laugh with anytime!\n\nNo. 6 made strides in the multiplayer experience and managed to retain much of the storyline style from the last one.\nMost importantly it kept up its hilariously cheeky dialogue!\n\nAlways remember in the early game to make sure you fulfill those export trade routes with the crown or you can start a new life in manual labour.......cream tea? ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good if you want to build a nation in any way whether it be a capitalist dream or a communist haven, this game has it all.\r\n\r\nAlthough it is lacking in transportation options, this game could really be absolute peak if it had trains and high speed rail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game for those who likes to be a dictator or authoritarian leader of a regime, but it can also works if u wants to be a great leader within democracy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I come to this game a few times a year and have a great time experimenting and roleplaying. Well worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid city builder. I haven't bought the DLC, however I am extremely happy with the base game. plenty of builds, relatively stable and functions on both my mac and pc. Among one of my favorites. My complaints are all minor, but over-lookable. Things like, I wish there were more options to get money into your swiss bank account, or, i wish there was more control over military units. Definitely excited for 7 having played this for 300 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tropico 6 embraces everything that made the series iconic: witty political satire, charismatic dictatorship, and the satisfying chaos of running a Caribbean island nation. As El Presidente, you juggle city-building, economics, diplomacy, and the occasional… creative interpretation of democracy.\n\nThe game shines through its sense of humor and personality. The radio banter, absurd political demands, and over-the-top edicts keep the experience lively. Visually, the archipelago system is a major upgrade - building across multiple islands adds strategy and encourages complex layouts instead of just one giant megacity.\n\nMechanically, it offers a solid mix of depth and accessibility. Managing factions, trade routes, and citizen happiness feels engaging without overwhelming newcomers. Long-time fans will appreciate quality-of-life improvements, smoother interfaces, and more flexible transportation systems.\n\nIt’s not without flaws. The campaign writing can feel repetitive, and the pacing occasionally slows down in the late game when waiting for money or resources to roll in. Some buildings still behave unpredictably, and pathfinding occasionally acts like citizens are on vacation more than at work. But none of these issues break the experience.\n\nOverall, Tropico 6 is one of the strongest entries in the franchise - colorful, clever, and packed with charm. Whether you enjoy micromanaging a banana republic or unleashing your inner benevolent tyrant, it’s a fun, laid-back city builder that never takes itself too seriously. Perfect if you want strategy without stress and a good laugh along the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, addictive and challenging enough to make you want to keep playing on!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is highly engaging, it transports me to an island in the Caribbean with the soundtrack and the beautiful greenery. Makes me feel that I'm the president of a banana republic.\n\nTrying to be a democrat and win the elections cleanly makes the game much more challenging. Viva El Presidente!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an interesting and clever concept for a game. I am a huge fan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another Tropico another get it on sale advice, especially the DLC they are way too expensive on their regular price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a nice upgrade from Tropico 6.  My favourite part is now managing a collection of islands",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a game. perhaps the best city builder of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, but this soundtrack can be used for torture in hell))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game taught my smooth brain self how politics and other groups functioned, and how they collaborate with buildings and people. I spent WAY too much time on this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still love the series. It is funny, challenging, and intelligent. If you liked previous Tropico games you will like it too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Tropico since the very first title and it has only got better. If you like city builders, management, politics and  humor then this is \"The\" game. Whatever you are in to Tropico never disappoints. No Matter how old the game may be it always draws you back and keeps you thinking about it whenever you are away from it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid entry into the beloved Tropico franchise. A return to form in the way of having more dictatorial powers. The series' humor shines through in this one, and there can be a lot of funny moments/playstyles you can experience. Some features lack depth, especially on the city builder side, but it is still a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't let the light nature of the game fool you, making sure you are monitoring all the different mechanics can quickly become overwhelming. But after failing the second mission a few times I realized I had to be more focus on what the mission wants me to do. Its still challenging but I'm really enjoying it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got the very first Tropico from the local library a long time ago, and have played every version since. Whereas 4 and 5 didn't speak to me that much, 6 has a nice variation of missions and buildings. Recommended for those who like city builders without too much micromanegement!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is a lot of things to do build, manage and keep your people happy, there is also plenty of missions to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game. The island randomness means sometimes you go Democratic Paradise, sometimes military dictatorship. While the DLC are hit and miss, they are definitely worth it if on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really addictive city builder, i have played all missions several times (including all the DLC) and liked it everytime. Only actually bad thing i can think of is that the start of each mission is exactly the same, you need your economy to get started (mines, Logging Camp, Coconut Harvester and some simple industry like lumber mill) and then just hope for good trade routes to get money.\n\nway to get more population (Pirate Cove \"rescue\", Penal Colony edict) so you can actually use your buildings without having to hire workers.\n\nOne small negative i also have is that some edicts feel really strong and some useless, it always feels mandatory to have Penal Colony at the beginning, Employee of the Month and Advanced Boat Service for entire game each mission.\n\nIn world Wars instantly enabling Agricultural Subsidies is a no brainer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and sort of educational. Ripe social commentary. Great nation building game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing tropico since Tropico 3. I like the series very much and i think 6 is a good entry to it. There's nothing revolutionary about it but it does its job right.\n\nThe base game alone has a lot of content. I didn't play all the DLC yet, but so far i think they are passable. There's some interesting mechanics but nothing that changes the game considerably.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played a city builder so the fact that a fricking love this game is epic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mas Tropico! This is a little less clunky than 5. I think I have most of the series now from bundles, and this is the easiest to understand for the amount of complexity presented so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played 100's hours on this game. I love Tropico because its funny as well. light hearted fun. Guaranteed to keep you amused for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply one of the best city builder, resource manager, political sims of all time.  And funny too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Less funny and beautiful then previous versions, but more manageable. Once you are on to it, can go back to previous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stupidly addictive and incredibly rewarding, with a soundtrack that makes you truly unleash your Caribbean Autocratic groove. Simple mechanics and easy to learn, this game can quickly makes you spend hours making your island into a industrial powerhouse, with citizen management that could do with a bit more polishing. \n\nThe graphics add a great charm, stylized to really make Tropico look beautiful and pleasing ways to add to the beauty. \n\nThe game could be challenging with a few difficulty changes, but usually you'll find a \"set\" way of playing the game quickly and become stupidly rich, but Missions provide a great way of breaking the tedium, with charming voice actors. Different faction are a fun way to steer your country's ideology, but their demands tend to be dull or require the same building to be built in tedium, so it could do with some work. \n\nIf you're looking for a relaxing resource management with city building aspects,the base game of Tropico 6 is worth the purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love keeping the population poor whilst living in a golden palace. 10/10 would extort again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "La administración de recursos más divertida de la historia, el PRESIDENTE lo puede todo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Corruption isn't bad, corruption is only bad if I'm not involved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't quite make enough jobs for your Tropicans? They will turn to criminals or rebels.\r\nIf they turn criminal, arrest them for free labor and profit. Now they ARE employed!\r\nIf they turn Rebel, let the army kill them and then you don't need to employ them.\r\nA self-solving problem!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I won't waste your time with a lengthy review, it's not like you're some kid playing in a big sandbox. El Presidente approved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play for the music and Penultimo's shenanigans, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it took 50 years of bullying but i finally got the christians to overthrow the government. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The 2nd best tropico game (after 4)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had 20% of my loving people in prisons giving me heaps of money to spoil the rest of my people with offices and tons of restaurants and modern apartments. I had drones shoot annihalate anyone who didnt like me and made a aircraft carrier soo rebels wouldn't be a problem. A virus broke out that made my people hate me, and when i cured them they loved me. Soo I let the disease take everyone, only then did I, the handsome Presidente, cure them all. Now they love me.\r\n\r\nI stole the Lady of Liberty and the White House from my ally the USA. I have no idea why the US president is ok with that, maybe im just that charismatic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another great Tropico game - hours of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a real challenge.  You never seem to have enoughtmoney or building space!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice.\r\nRum export simulator. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NEW TO GAMING, BUT LIKE THIS ONE AS AN INTRO TO GAMING.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We all vote for El Presidente! A vote for Tropico is a Vote for me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the launcher is beautiful!!! very cute!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its actually a unique economy gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love getting money for imprisoning my own citizens.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun city building game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I vote for El Presidente!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More fun to play than Anno 1800.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gr8 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bootiful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "works well on M1 Macbook",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El Presidente choice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tons of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone loves el presidente",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For Tropico!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mucho Tropico !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jogaço",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "لعبة جميلة",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TOP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jailed all the religious leaders, killed the capitalists, declared martial law, banned religion, got re-elected 20 times. highly recommend.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "great game...but let's please ditch the archipelago view and just have a smooth zoom all the way from lowest to highest\n\nIN THE NAME OF EL PRESIDENTE, DEATH TO ARCHIPELAGO VIEW!! VIVA LA SMOOTH ZOOM!!!",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I've always been a big fan of the Tropico series because my happy place that I go to when times are tough is daydreaming about owning an island and being it's father-knows-best dictator. Every entry into the series seems to get closer and closer to being the perfect simulator for that happy place of mine. \r\n\r\nMy only criticism is that it can get a bit too....goofy. Some people like that though, everyone has different tastes.\r\n\r\nI also wish they would bring back more military themed decorations. How on earth is a dictator expected to keep his island safe without sandbags and concrete barriers?",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Crazy addictive, if the City Building was more indepth it'd be perfect.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "[h1] BUY ONLY ON SALE[/h1]\r\nGame feels similar to older iterations just touched up if u have older versions, not missin much different besides different representatives and maybe a building or two.Late game can be a bog since it highlights parts of the game that need optimization beyond your control, traffic will freeze up for in game YEARS if you have a large population which would seems reflective of real life...if it wasnt bugged at intersections and the measurement of time wasnt drastic.BUT the scenarios are fun and comical with charm to them, good achievements to get which is the saving grace, scenarios with dlcs on feels better than without but thats preference.\r\n[h2] If you were to buy the game BUY DLCS ON SALE TOO[/h2]\r\n[u]DLCS THAT ADD USEFUL/FUN ELEMENTS[/u]\r\nTropican shores(personal fav makes me upset its not base game)\r\nNew Frontiers(optimial building)\r\nReturn to Nature\r\nCarribbean Skies (can solve some logistics/traffic jams with drones)\r\nFestivals\r\n[b] The rest will add game elements that can hinder gameplay,but can offer really strong bonuses(going viral), lack content  AND or just plain buggy like spitter celebs [/b]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This is my first entry to both Tropico and city building games, and I absolutely love it! A nice mix between city building, industry management and, the thing that apparently sets Tropico apart from all its competitors, politics. Trying to keep all the different factions within and outside your borders happy makes sure you'll never run out of things to do and the factions also affect how you run your republic. The game isn't difficult to learn at all. The in-game tutorial does a very good job explaining all the basics and I had no problem jumping into sandbox mode. Of course the tutorial can't explain absolutely everything, but luckily the game is 6 years old, so all your basic questions have been asked before and can be easily found with a quick Google search. \n\nThe game is ridiculously addicting, though! One Saturday I made myself some morning coffee and, having finished the tutorial the night before, I decided to try the sandbox mode. I am not exaggerating at all when I say that I did not take even a quick bathroom break for the next 5,5 hours. I had to practically force myself to quit the game and get something to eat. The next day I decided to play the game again with my morning coffee and promised to only play 2 hours max so the entire day isn't wasted. Four hours later I once again found myself having to literally force myself to quit the game. I can't remember the last time this happaned. Maybe in early 2010s with Skyrim or late 2000s with WoW. There's just something unbelievably addicting about the gameplay loop.\n\nThe game doesn't have a proper campaign but isolated missions instead. They're basically the same as the sandbox but with extra goals, challenges and features (like in first mission, where you send coconuts to your gold mines to create gold-filled coconuts, which you can tell sell to smugglers to fund your independence). I've only played the first one but I'll definitely be trying the rest too.\n\nI think I got this game, the DLCs from 2019 and 2020 and the previous Tropico games from some bundle ages ago since I have no memory of actually buying this game, but had I picked the game up for the current 13,99€ sale price I'd definitely be happy with my purchase. [b]Although I would recommend picking the Starter Bundle instead, since you'll get the Llama DLC and have to pay only 0,06€ more.[/b] I'm not sure if the other DLCs are mandatory but I personally don't have the latest 4 due to the price and am doing perfectly fine without them.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "A fun, meditative city-building simulator. It's convenient that in sandbox mode, the developers have included options to play with unlimited money or resources. No need to use cheats. There are a lot of paid DLCs, half of which should be included in the main game, or at least made cheaper. Some DLCs cost almost as much as the game itself and offer very little content in relation to their price — the developers are very greedy.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "El Presidente builds cities much more interesting than his rival Paradox. The only way to vote is for the Kalypso and their faithful sidekick Penultimo!\n\nI've been wanting to try Tropico for a long time and I finally picked it up recently. Definitely worth a play if you like city builders/logistics type games. It's not quite as intense as Anno, but more interesting than Cities Skylines.\n\nThe game isn't perfect by any means. The animations with some of the characters walking around are a little janky at times, but at least they exist and make your island feel alive. This is a big pain point for Skylines 2 right now. You're not going to manage traffic or anything like that in Tropico, though there are vehicles driving and goods moving around in trucks. It's more about providing resources and buildings to allow your population to flourish or live in squalor.\n\nI'm playing through the story missions and so far they are interesting enough to feel rewarding. By the time I finish the missions, I'm ready to move on and start a new island, but you have the option to continue building afterwards which is nice. I have yet to see the cold war era or modern era so there is still a lot more to explore. If you're on the fence, it's worth checking out when it's on sale.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fantastic addition to the series. The only gripe I have is the cost of the DLC, try to get them on sale if you want them. The updates on the DLC releases generally give the base game some free items as well, but they don't seem to add too terribly much per DLC. Last time I booted it up I was actually surprised at how much was added to the base game as free updates.  \r\nI mean there's not much better tongue in cheek dictator city management games",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game has a great balance between being intuitive, and challenging.  Between the missions and being able to adjust the difficulty level of each, I can see myself playing this for many, many hours.  \nSo far I only have the base game- and I am happy.  Would recommend.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played Tropico 4, 5, and 6. I think Tropico 6 is the best. I enjoyed managing multiple islands. Nature and buildings look great. Gameplay is the same. I can either be a nice president or a dictator by declaring martial law and killing rebels and their families. I miss dynasty from Tropico 5.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing City builder game\n\nYou get to Make your own Tiny island country\n\nPick a side during a couple Eras\n\nTheres a mod store built in For Extra content\n\nPretty good Replayability\n\ndont play too much for too long to avoid getting extremly burnt out as it is one of those games in a way",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love it. There's no other game out there that scratchs this particular itch.\r\n\r\nIt's a country management simulator and a city builder all at once\r\n\r\nI hope the Devs add more transport management options in the next game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's ok, not outstanding...The original Tropico is still by far better. The music, the humour ....the concept all falls a bit flat. Penultimo is a seriously annoying concept making you feel that you are not really in control but merely fulfilling task after specific task, being led by the nose through the story till you stumble to completion. Although have not played a sandbox game yet! Graphics are fine but the constant interruption by various puerile voices (Penultimo being the worst) just breaks up the subtle enjoyment that the original game supplied.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great strategy and city buildier!  Love all the decisions having consequesnces.  Fun game that can get very addicting!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What I like:\r\n-Looong game time\r\n-Nice campaign (sorry for mein bad englich)\r\n-Nice city building and political game\r\n\r\n-Annoying military stuff\r\n-Annoying factions\r\n-The general's voice actor is like a shy and quiet volume, while the religious nun's voice actor [b] DID YOU HEARD ABOUT THE- [/b]\r\n-Multiplayer is dead\r\n-Can't turn off the sickness, only harmless cough (why)\r\n-Not so much changing option about El Pres compared to other Tropico games (why, I don't want to have only 1 personality)\r\n\r\nNote:\r\nBleeds from many wounds, BUUUT still a good game worth playing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very gut game, fun, little difficult at beginning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A banana republic simulator that despite its tongue in cheek nature is actually a great country simulator game. A lot of depth, and let's you be as benevolent or oppressive a presidente as you want to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El Presidente told me to write a little review here so that they would release my family back to me.\n\nIt is, of course, a solid development on the previous titles in the series!\n\nYou can run your island republic in any way you see fit and have fun managing all the dynamics of the island and the shifting economics and technologies of the times. I've played this solo and with friends over many years, its a great game you can pick up and have a laugh with anytime!\n\nNo. 6 made strides in the multiplayer experience and managed to retain much of the storyline style from the last one.\nMost importantly it kept up its hilariously cheeky dialogue!\n\nAlways remember in the early game to make sure you fulfill those export trade routes with the crown or you can start a new life in manual labour.......cream tea? ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good if you want to build a nation in any way whether it be a capitalist dream or a communist haven, this game has it all.\r\n\r\nAlthough it is lacking in transportation options, this game could really be absolute peak if it had trains and high speed rail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game for those who likes to be a dictator or authoritarian leader of a regime, but it can also works if u wants to be a great leader within democracy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I come to this game a few times a year and have a great time experimenting and roleplaying. Well worth it",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "A lot to like, a lot more buildings and complexity, but the late game management in modern era just falls apart over time. Guerilla fighters become more and more prelevant (even at 100% approval) to the point where it's literal swarms at all times, and for whatever reason your military guys don't live at their military base so they have to drive over every single time, which lets the fighters move in and light 8 buildings on fire before your military even 'spawns' \r\n\r\nUltimatums from super powers can flat end your game. Especially if a superpower decides to just simply issue 2 at once, you auto game over. No chance to fight them off on the 'invasion' you just lose automatically. Disease sucks and makes the game unplayable. For all the good it has with building beauty and graphics and more buildings in general, 6 fails to play as well as 4 or 5.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One small nitpick[/h1]\n\n[b][u][i]Please[/i][/u][/b] add a bind to arrest the selected citizen. My wrist hurts from arresting over >40 criminals, because in colonial era arresting is a manual task, which if not done can cost over $3000 a month.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disappointing. I played Tropico 3 and liked it very much, especially the satirical humour based on playing a ruthless dictator who skillfully pulls money from the great world powers' pockets while basically oppressing their own people and using military force if the osterity measures went a bit too far.\r\nHere, this feeling is gone. It feels more like a regular city building simulator.\r\n- There are demands that you have to meet or you will not be reelected / your citizens riot. You feel much more like their servant than their ruler.\r\n- There are several interest groups with significant power. If you do not fulfil their demands, they can impose significant penalties. You can't weaken their influence or get rid of them, even if their presence on your island simply makes no sense. There will always be environmentalists, capitalists or democracy advocates. Even the relationship to the world powers feels more like groweling before their feet and accepting close monitoring and supervision instead of playing them like a fiddle.\r\n- Additionally, there are some strange things with the economy which I needed to figure out. In a playthrough that gave me several gold deposits, I was constantly broke. The numbers just didn't match, even after establishing factories to produce jewellery from that gold. Mostly, it was the agriculture that kept me afloat. It felt strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lots of things to be desired in this game (like a return to Tropico 5 paid dollar amounts rather than \"class categories\") but other things are interesting (such as spread islands, bridge, and tunnel buildings). The only reason I mark is as Not Recommended is because you *need* some of the DLC to make it more sensible to play (why spread the islands and then give very little stuff to build on all this open water? Oh to sell DLC that gives you that stuff to build)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "*insert Jeff Goldbloom looking at big pile of dinosaur poo*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not free from some bugs and such, but nothing gamebreaking. The problem is in the publishers greed. How come the DLCs, that only add minimalistic functions and gameplay, cost more than the game itself?? Check the game on discount and check a DLC on discount... F you if you live in Latin America, right?\n\nTL:DR\nGame good. Price not worth even with discount.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Game plays fine until everybody has cars. Sounds great, doesn't work.  Traffic jams just happen out of nowhere when one citizen decides they aren't going to drive ever again until they starve in their car on the road. It grinds your entire economy to a halt. Teamsters, firefighters, and workers in general just quietly stop working, nothing gets to your docks for export, and your very profitable set-up goes to (schist). Game does not rock.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I just can't find myself enjoying this game. I try, but it just isn't that much fun. I love the new infrastructure and I am glad they got rid of the Dynasty aspect of the 5th game, but it just takes most of what I didn't like about the 5th game and expands on it, making a lot of things that should be simple either very complicated or time consuming. \nThe missions also aren't exactly great. Not terrible by any means, but their piecemeal nature detaches you from it and instead of a coherent narrative, you get what can barely be called an \"episodic\" experience. \n\nTo put it bluntly, if you think Tropico 4 is better than Tropico 5, then this game will be a big disappointment to you. \nIf you instead prefer all the changes brought with the 5th installment, then you will probably like this. \n\nIt is no way near as smooth or funny to play as the 4th game and I do not think the added complexity, real and forced simply because the gameplay mechanics have been worsened, is a welcome addition to the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Initially, I was happy to find Tropico 6 way more challenging than the previous entries (I'm a Tropico fan, but tbh these games are just too easy).\n\nIn a several hours long session, I decided to save, exit and relaunch my save as performances were seriously tanking for some reason (went under 55FPS, and came back to +125FPS after reloading; I guess it's because of Unreal Engine).\n\nThen after reloading, I realized the game wasn't harder at all, but just buggier. All the stats I was laboriously trying to up were badly calculated (happiness, approval and so on).\n\nI will keep playing it because I like the gameplay and wanna finish the campaign, but I can't recommend it. At least I've not (yet) encountered any game breaking bugs, like in Tropico 5.\nOut of the last 3, I can only really recommend Tropico 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No recommendation.\n\nOn standard difficulty the economy is extremely tight.  Most crops barely pull in enough money to paying your farmers.  Manufactured goods are better - but come with additional costs.  Also the happiness gauge seems ridiculously low.  With factions and personal happiness running 40% to 70% my personal rating was  23%.  A game that should have been about choices in building for long times involved waiting for my economy to strengthen so I could do anything.  I've finished both Tropico 4 and Tropico 5 so stow that \"Git gud\".  In earlier games a couple of industries with the right edicts could ensure your prosperity, here I can have eight to ten upgraded industries and still be struggling to make ends meet.  A lot of options  and upgrades have more negatives than they are worth.\n\nAccess to buildings is covered by wealth so the poor have no way to have their happiness reach the higher levels.\n\n There are irritants.  Crop harvesting doesn't feel real, and nor does any other production building.    I couldn't see Tropicans developing skills.  It takes ages to open up edicts that you'd never voluntarily pass.  One scenario required you to choose certain options for a newspaper without ever having a way to unlock them.\n\n  Tropicos 4 and 5 are significantly better than this one and there's too little in what's new here that increases the fun.\n\nS.x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I loved tropico 4 and 5. They were different, but you could still have fun with both. Here it seems they forgot to add the fun. Being constanly attacked by pirates is so fun, none of the starting buildings being profitable is also so fun. Hard pass.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A lot to like, a lot more buildings and complexity, but the late game management in modern era just falls apart over time. Guerilla fighters become more and more prelevant (even at 100% approval) to the point where it's literal swarms at all times, and for whatever reason your military guys don't live at their military base so they have to drive over every single time, which lets the fighters move in and light 8 buildings on fire before your military even 'spawns' \r\n\r\nUltimatums from super powers can flat end your game. Especially if a superpower decides to just simply issue 2 at once, you auto game over. No chance to fight them off on the 'invasion' you just lose automatically. Disease sucks and makes the game unplayable. For all the good it has with building beauty and graphics and more buildings in general, 6 fails to play as well as 4 or 5.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One small nitpick[/h1]\n\n[b][u][i]Please[/i][/u][/b] add a bind to arrest the selected citizen. My wrist hurts from arresting over >40 criminals, because in colonial era arresting is a manual task, which if not done can cost over $3000 a month.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not as good as 4. Its also buggier than 4 and is a lot more difficult than 4.\nThe map size is too small honestly and when you change to different time periods your economy always collapses the game doesn't give you enough time to prepare for the shift you have to pre-emptively prepare for it by not taking the quest - tropico 5 has a similar problem. This one just isn't as fun to play as the others.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has crashed 4 times since I started playing it, in less than 2 hours. Couldn't even make it through the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get that the humour is the selling point for Tropico now, but I liked it better when it was just sprinkled on top rather than injected throughout. I'll probably still play it, it's still fills a unique niche in the city-building genre, but I wouldn't dedicate several weekends just to build the city of my dreams like I might do with a Sim City, Anno or Caesar game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the few new building in the a game as well as the multi island concept. Personally I enjoyed Tropica 5 in more ways then this newer rendition. This game has a weird learning curve as well as more pressure on politics compared to the fun and easy game play of 5. Honestly I play five more then this game and not get as frustrated with the campaigns which is odd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is going in the wrong direction.  This version I just can't bring myself to play.  The islands aren't fun, the missions are preset, and there isn't anything new.  I prefer to play missions my own way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of the Tropico series, but I really struggled with this one. The distance citizens needs to travel is key to an effective economy, workers will happily commute across the entire map wasting much time, but there seems to be little you can do to stop this. The game doesn't alert you to this issue, nor does it offer any kind of useful information to help you pinpoint the issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand the economy and hidden logistics of this game. My treasury always goes into minus and then never bounces back, no matter what I do and how careful I am. Some trade routes are stuck in 0 despite all other aspects being in place. People will remain broke even with plenty of jobs and home happinness never goes above 40% even when there is plenty of housing and free housing edict. I do get it's a complex game but come on, it's just not fun when you fail 5 times for the same reasons!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. I played Tropico 3 and liked it very much, especially the satirical humour based on playing a ruthless dictator who skillfully pulls money from the great world powers' pockets while basically oppressing their own people and using military force if the osterity measures went a bit too far.\r\nHere, this feeling is gone. It feels more like a regular city building simulator.\r\n- There are demands that you have to meet or you will not be reelected / your citizens riot. You feel much more like their servant than their ruler.\r\n- There are several interest groups with significant power. If you do not fulfil their demands, they can impose significant penalties. You can't weaken their influence or get rid of them, even if their presence on your island simply makes no sense. There will always be environmentalists, capitalists or democracy advocates. Even the relationship to the world powers feels more like groweling before their feet and accepting close monitoring and supervision instead of playing them like a fiddle.\r\n- Additionally, there are some strange things with the economy which I needed to figure out. In a playthrough that gave me several gold deposits, I was constantly broke. The numbers just didn't match, even after establishing factories to produce jewellery from that gold. Mostly, it was the agriculture that kept me afloat. It felt strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me, the specificity of the missions takes the fun out of the Tropico concept. I'm unable to even finish several of the first maps because I run into either an irrecoverable deficit in spite of putting up plantations etc. in order to export, or I lose the election for reasons I don't understand. Having to select specific trade deals annoys me, and those Pirate Cove missions are basically random and silly, and the limitation to certain historic periods constrains the possibilities too much. Several of the scenarios start with a given set of superfluous, costly buildings, or in a weird geographical setting, which seems to be intended to contribute to the difficulty of winning, which I find arbitrary and frustrating. I like to build and expand, and for a game to allow some freedom in how to win, but this game to me seems to allow only for certain, fairly narrow paths of success that I'm unable to find. Sorry for not being able to be more specific. I'm quite certain that lack of intelligence on my part isn't the problem here. I loved Tropico 3, 4 and 5. But somehow Tropico 6 - which I've tried repeatedly over the years - just doesn't do it for me. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to be desired in this game (like a return to Tropico 5 paid dollar amounts rather than \"class categories\") but other things are interesting (such as spread islands, bridge, and tunnel buildings). The only reason I mark is as Not Recommended is because you *need* some of the DLC to make it more sensible to play (why spread the islands and then give very little stuff to build on all this open water? Oh to sell DLC that gives you that stuff to build)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "*insert Jeff Goldbloom looking at big pile of dinosaur poo*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not free from some bugs and such, but nothing gamebreaking. The problem is in the publishers greed. How come the DLCs, that only add minimalistic functions and gameplay, cost more than the game itself?? Check the game on discount and check a DLC on discount... F you if you live in Latin America, right?\n\nTL:DR\nGame good. Price not worth even with discount.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Game plays fine until everybody has cars. Sounds great, doesn't work.  Traffic jams just happen out of nowhere when one citizen decides they aren't going to drive ever again until they starve in their car on the road. It grinds your entire economy to a halt. Teamsters, firefighters, and workers in general just quietly stop working, nothing gets to your docks for export, and your very profitable set-up goes to (schist). Game does not rock.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I just can't find myself enjoying this game. I try, but it just isn't that much fun. I love the new infrastructure and I am glad they got rid of the Dynasty aspect of the 5th game, but it just takes most of what I didn't like about the 5th game and expands on it, making a lot of things that should be simple either very complicated or time consuming. \nThe missions also aren't exactly great. Not terrible by any means, but their piecemeal nature detaches you from it and instead of a coherent narrative, you get what can barely be called an \"episodic\" experience. \n\nTo put it bluntly, if you think Tropico 4 is better than Tropico 5, then this game will be a big disappointment to you. \nIf you instead prefer all the changes brought with the 5th installment, then you will probably like this. \n\nIt is no way near as smooth or funny to play as the 4th game and I do not think the added complexity, real and forced simply because the gameplay mechanics have been worsened, is a welcome addition to the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Initially, I was happy to find Tropico 6 way more challenging than the previous entries (I'm a Tropico fan, but tbh these games are just too easy).\n\nIn a several hours long session, I decided to save, exit and relaunch my save as performances were seriously tanking for some reason (went under 55FPS, and came back to +125FPS after reloading; I guess it's because of Unreal Engine).\n\nThen after reloading, I realized the game wasn't harder at all, but just buggier. All the stats I was laboriously trying to up were badly calculated (happiness, approval and so on).\n\nI will keep playing it because I like the gameplay and wanna finish the campaign, but I can't recommend it. At least I've not (yet) encountered any game breaking bugs, like in Tropico 5.\nOut of the last 3, I can only really recommend Tropico 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No recommendation.\n\nOn standard difficulty the economy is extremely tight.  Most crops barely pull in enough money to paying your farmers.  Manufactured goods are better - but come with additional costs.  Also the happiness gauge seems ridiculously low.  With factions and personal happiness running 40% to 70% my personal rating was  23%.  A game that should have been about choices in building for long times involved waiting for my economy to strengthen so I could do anything.  I've finished both Tropico 4 and Tropico 5 so stow that \"Git gud\".  In earlier games a couple of industries with the right edicts could ensure your prosperity, here I can have eight to ten upgraded industries and still be struggling to make ends meet.  A lot of options  and upgrades have more negatives than they are worth.\n\nAccess to buildings is covered by wealth so the poor have no way to have their happiness reach the higher levels.\n\n There are irritants.  Crop harvesting doesn't feel real, and nor does any other production building.    I couldn't see Tropicans developing skills.  It takes ages to open up edicts that you'd never voluntarily pass.  One scenario required you to choose certain options for a newspaper without ever having a way to unlock them.\n\n  Tropicos 4 and 5 are significantly better than this one and there's too little in what's new here that increases the fun.\n\nS.x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I loved tropico 4 and 5. They were different, but you could still have fun with both. Here it seems they forgot to add the fun. Being constanly attacked by pirates is so fun, none of the starting buildings being profitable is also so fun. Hard pass.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A lot to like, a lot more buildings and complexity, but the late game management in modern era just falls apart over time. Guerilla fighters become more and more prelevant (even at 100% approval) to the point where it's literal swarms at all times, and for whatever reason your military guys don't live at their military base so they have to drive over every single time, which lets the fighters move in and light 8 buildings on fire before your military even 'spawns' \r\n\r\nUltimatums from super powers can flat end your game. Especially if a superpower decides to just simply issue 2 at once, you auto game over. No chance to fight them off on the 'invasion' you just lose automatically. Disease sucks and makes the game unplayable. For all the good it has with building beauty and graphics and more buildings in general, 6 fails to play as well as 4 or 5.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One small nitpick[/h1]\n\n[b][u][i]Please[/i][/u][/b] add a bind to arrest the selected citizen. My wrist hurts from arresting over >40 criminals, because in colonial era arresting is a manual task, which if not done can cost over $3000 a month.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not as good as 4. Its also buggier than 4 and is a lot more difficult than 4.\nThe map size is too small honestly and when you change to different time periods your economy always collapses the game doesn't give you enough time to prepare for the shift you have to pre-emptively prepare for it by not taking the quest - tropico 5 has a similar problem. This one just isn't as fun to play as the others.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has crashed 4 times since I started playing it, in less than 2 hours. Couldn't even make it through the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get that the humour is the selling point for Tropico now, but I liked it better when it was just sprinkled on top rather than injected throughout. I'll probably still play it, it's still fills a unique niche in the city-building genre, but I wouldn't dedicate several weekends just to build the city of my dreams like I might do with a Sim City, Anno or Caesar game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the few new building in the a game as well as the multi island concept. Personally I enjoyed Tropica 5 in more ways then this newer rendition. This game has a weird learning curve as well as more pressure on politics compared to the fun and easy game play of 5. Honestly I play five more then this game and not get as frustrated with the campaigns which is odd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is going in the wrong direction.  This version I just can't bring myself to play.  The islands aren't fun, the missions are preset, and there isn't anything new.  I prefer to play missions my own way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of the Tropico series, but I really struggled with this one. The distance citizens needs to travel is key to an effective economy, workers will happily commute across the entire map wasting much time, but there seems to be little you can do to stop this. The game doesn't alert you to this issue, nor does it offer any kind of useful information to help you pinpoint the issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand the economy and hidden logistics of this game. My treasury always goes into minus and then never bounces back, no matter what I do and how careful I am. Some trade routes are stuck in 0 despite all other aspects being in place. People will remain broke even with plenty of jobs and home happinness never goes above 40% even when there is plenty of housing and free housing edict. I do get it's a complex game but come on, it's just not fun when you fail 5 times for the same reasons!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. I played Tropico 3 and liked it very much, especially the satirical humour based on playing a ruthless dictator who skillfully pulls money from the great world powers' pockets while basically oppressing their own people and using military force if the osterity measures went a bit too far.\r\nHere, this feeling is gone. It feels more like a regular city building simulator.\r\n- There are demands that you have to meet or you will not be reelected / your citizens riot. You feel much more like their servant than their ruler.\r\n- There are several interest groups with significant power. If you do not fulfil their demands, they can impose significant penalties. You can't weaken their influence or get rid of them, even if their presence on your island simply makes no sense. There will always be environmentalists, capitalists or democracy advocates. Even the relationship to the world powers feels more like groweling before their feet and accepting close monitoring and supervision instead of playing them like a fiddle.\r\n- Additionally, there are some strange things with the economy which I needed to figure out. In a playthrough that gave me several gold deposits, I was constantly broke. The numbers just didn't match, even after establishing factories to produce jewellery from that gold. Mostly, it was the agriculture that kept me afloat. It felt strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me, the specificity of the missions takes the fun out of the Tropico concept. I'm unable to even finish several of the first maps because I run into either an irrecoverable deficit in spite of putting up plantations etc. in order to export, or I lose the election for reasons I don't understand. Having to select specific trade deals annoys me, and those Pirate Cove missions are basically random and silly, and the limitation to certain historic periods constrains the possibilities too much. Several of the scenarios start with a given set of superfluous, costly buildings, or in a weird geographical setting, which seems to be intended to contribute to the difficulty of winning, which I find arbitrary and frustrating. I like to build and expand, and for a game to allow some freedom in how to win, but this game to me seems to allow only for certain, fairly narrow paths of success that I'm unable to find. Sorry for not being able to be more specific. I'm quite certain that lack of intelligence on my part isn't the problem here. I loved Tropico 3, 4 and 5. But somehow Tropico 6 - which I've tried repeatedly over the years - just doesn't do it for me. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to be desired in this game (like a return to Tropico 5 paid dollar amounts rather than \"class categories\") but other things are interesting (such as spread islands, bridge, and tunnel buildings). The only reason I mark is as Not Recommended is because you *need* some of the DLC to make it more sensible to play (why spread the islands and then give very little stuff to build on all this open water? Oh to sell DLC that gives you that stuff to build)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "*insert Jeff Goldbloom looking at big pile of dinosaur poo*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not free from some bugs and such, but nothing gamebreaking. The problem is in the publishers greed. How come the DLCs, that only add minimalistic functions and gameplay, cost more than the game itself?? Check the game on discount and check a DLC on discount... F you if you live in Latin America, right?\n\nTL:DR\nGame good. Price not worth even with discount.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Game plays fine until everybody has cars. Sounds great, doesn't work.  Traffic jams just happen out of nowhere when one citizen decides they aren't going to drive ever again until they starve in their car on the road. It grinds your entire economy to a halt. Teamsters, firefighters, and workers in general just quietly stop working, nothing gets to your docks for export, and your very profitable set-up goes to (schist). Game does not rock.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I just can't find myself enjoying this game. I try, but it just isn't that much fun. I love the new infrastructure and I am glad they got rid of the Dynasty aspect of the 5th game, but it just takes most of what I didn't like about the 5th game and expands on it, making a lot of things that should be simple either very complicated or time consuming. \nThe missions also aren't exactly great. Not terrible by any means, but their piecemeal nature detaches you from it and instead of a coherent narrative, you get what can barely be called an \"episodic\" experience. \n\nTo put it bluntly, if you think Tropico 4 is better than Tropico 5, then this game will be a big disappointment to you. \nIf you instead prefer all the changes brought with the 5th installment, then you will probably like this. \n\nIt is no way near as smooth or funny to play as the 4th game and I do not think the added complexity, real and forced simply because the gameplay mechanics have been worsened, is a welcome addition to the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Initially, I was happy to find Tropico 6 way more challenging than the previous entries (I'm a Tropico fan, but tbh these games are just too easy).\n\nIn a several hours long session, I decided to save, exit and relaunch my save as performances were seriously tanking for some reason (went under 55FPS, and came back to +125FPS after reloading; I guess it's because of Unreal Engine).\n\nThen after reloading, I realized the game wasn't harder at all, but just buggier. All the stats I was laboriously trying to up were badly calculated (happiness, approval and so on).\n\nI will keep playing it because I like the gameplay and wanna finish the campaign, but I can't recommend it. At least I've not (yet) encountered any game breaking bugs, like in Tropico 5.\nOut of the last 3, I can only really recommend Tropico 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No recommendation.\n\nOn standard difficulty the economy is extremely tight.  Most crops barely pull in enough money to paying your farmers.  Manufactured goods are better - but come with additional costs.  Also the happiness gauge seems ridiculously low.  With factions and personal happiness running 40% to 70% my personal rating was  23%.  A game that should have been about choices in building for long times involved waiting for my economy to strengthen so I could do anything.  I've finished both Tropico 4 and Tropico 5 so stow that \"Git gud\".  In earlier games a couple of industries with the right edicts could ensure your prosperity, here I can have eight to ten upgraded industries and still be struggling to make ends meet.  A lot of options  and upgrades have more negatives than they are worth.\n\nAccess to buildings is covered by wealth so the poor have no way to have their happiness reach the higher levels.\n\n There are irritants.  Crop harvesting doesn't feel real, and nor does any other production building.    I couldn't see Tropicans developing skills.  It takes ages to open up edicts that you'd never voluntarily pass.  One scenario required you to choose certain options for a newspaper without ever having a way to unlock them.\n\n  Tropicos 4 and 5 are significantly better than this one and there's too little in what's new here that increases the fun.\n\nS.x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I loved tropico 4 and 5. They were different, but you could still have fun with both. Here it seems they forgot to add the fun. Being constanly attacked by pirates is so fun, none of the starting buildings being profitable is also so fun. Hard pass.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A lot to like, a lot more buildings and complexity, but the late game management in modern era just falls apart over time. Guerilla fighters become more and more prelevant (even at 100% approval) to the point where it's literal swarms at all times, and for whatever reason your military guys don't live at their military base so they have to drive over every single time, which lets the fighters move in and light 8 buildings on fire before your military even 'spawns' \r\n\r\nUltimatums from super powers can flat end your game. Especially if a superpower decides to just simply issue 2 at once, you auto game over. No chance to fight them off on the 'invasion' you just lose automatically. Disease sucks and makes the game unplayable. For all the good it has with building beauty and graphics and more buildings in general, 6 fails to play as well as 4 or 5.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One small nitpick[/h1]\n\n[b][u][i]Please[/i][/u][/b] add a bind to arrest the selected citizen. My wrist hurts from arresting over >40 criminals, because in colonial era arresting is a manual task, which if not done can cost over $3000 a month.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not as good as 4. Its also buggier than 4 and is a lot more difficult than 4.\nThe map size is too small honestly and when you change to different time periods your economy always collapses the game doesn't give you enough time to prepare for the shift you have to pre-emptively prepare for it by not taking the quest - tropico 5 has a similar problem. This one just isn't as fun to play as the others.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has crashed 4 times since I started playing it, in less than 2 hours. Couldn't even make it through the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get that the humour is the selling point for Tropico now, but I liked it better when it was just sprinkled on top rather than injected throughout. I'll probably still play it, it's still fills a unique niche in the city-building genre, but I wouldn't dedicate several weekends just to build the city of my dreams like I might do with a Sim City, Anno or Caesar game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the few new building in the a game as well as the multi island concept. Personally I enjoyed Tropica 5 in more ways then this newer rendition. This game has a weird learning curve as well as more pressure on politics compared to the fun and easy game play of 5. Honestly I play five more then this game and not get as frustrated with the campaigns which is odd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is going in the wrong direction.  This version I just can't bring myself to play.  The islands aren't fun, the missions are preset, and there isn't anything new.  I prefer to play missions my own way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of the Tropico series, but I really struggled with this one. The distance citizens needs to travel is key to an effective economy, workers will happily commute across the entire map wasting much time, but there seems to be little you can do to stop this. The game doesn't alert you to this issue, nor does it offer any kind of useful information to help you pinpoint the issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand the economy and hidden logistics of this game. My treasury always goes into minus and then never bounces back, no matter what I do and how careful I am. Some trade routes are stuck in 0 despite all other aspects being in place. People will remain broke even with plenty of jobs and home happinness never goes above 40% even when there is plenty of housing and free housing edict. I do get it's a complex game but come on, it's just not fun when you fail 5 times for the same reasons!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. I played Tropico 3 and liked it very much, especially the satirical humour based on playing a ruthless dictator who skillfully pulls money from the great world powers' pockets while basically oppressing their own people and using military force if the osterity measures went a bit too far.\r\nHere, this feeling is gone. It feels more like a regular city building simulator.\r\n- There are demands that you have to meet or you will not be reelected / your citizens riot. You feel much more like their servant than their ruler.\r\n- There are several interest groups with significant power. If you do not fulfil their demands, they can impose significant penalties. You can't weaken their influence or get rid of them, even if their presence on your island simply makes no sense. There will always be environmentalists, capitalists or democracy advocates. Even the relationship to the world powers feels more like groweling before their feet and accepting close monitoring and supervision instead of playing them like a fiddle.\r\n- Additionally, there are some strange things with the economy which I needed to figure out. In a playthrough that gave me several gold deposits, I was constantly broke. The numbers just didn't match, even after establishing factories to produce jewellery from that gold. Mostly, it was the agriculture that kept me afloat. It felt strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me, the specificity of the missions takes the fun out of the Tropico concept. I'm unable to even finish several of the first maps because I run into either an irrecoverable deficit in spite of putting up plantations etc. in order to export, or I lose the election for reasons I don't understand. Having to select specific trade deals annoys me, and those Pirate Cove missions are basically random and silly, and the limitation to certain historic periods constrains the possibilities too much. Several of the scenarios start with a given set of superfluous, costly buildings, or in a weird geographical setting, which seems to be intended to contribute to the difficulty of winning, which I find arbitrary and frustrating. I like to build and expand, and for a game to allow some freedom in how to win, but this game to me seems to allow only for certain, fairly narrow paths of success that I'm unable to find. Sorry for not being able to be more specific. I'm quite certain that lack of intelligence on my part isn't the problem here. I loved Tropico 3, 4 and 5. But somehow Tropico 6 - which I've tried repeatedly over the years - just doesn't do it for me. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to be desired in this game (like a return to Tropico 5 paid dollar amounts rather than \"class categories\") but other things are interesting (such as spread islands, bridge, and tunnel buildings). The only reason I mark is as Not Recommended is because you *need* some of the DLC to make it more sensible to play (why spread the islands and then give very little stuff to build on all this open water? Oh to sell DLC that gives you that stuff to build)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "*insert Jeff Goldbloom looking at big pile of dinosaur poo*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not free from some bugs and such, but nothing gamebreaking. The problem is in the publishers greed. How come the DLCs, that only add minimalistic functions and gameplay, cost more than the game itself?? Check the game on discount and check a DLC on discount... F you if you live in Latin America, right?\n\nTL:DR\nGame good. Price not worth even with discount.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Game plays fine until everybody has cars. Sounds great, doesn't work.  Traffic jams just happen out of nowhere when one citizen decides they aren't going to drive ever again until they starve in their car on the road. It grinds your entire economy to a halt. Teamsters, firefighters, and workers in general just quietly stop working, nothing gets to your docks for export, and your very profitable set-up goes to (schist). Game does not rock.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I just can't find myself enjoying this game. I try, but it just isn't that much fun. I love the new infrastructure and I am glad they got rid of the Dynasty aspect of the 5th game, but it just takes most of what I didn't like about the 5th game and expands on it, making a lot of things that should be simple either very complicated or time consuming. \nThe missions also aren't exactly great. Not terrible by any means, but their piecemeal nature detaches you from it and instead of a coherent narrative, you get what can barely be called an \"episodic\" experience. \n\nTo put it bluntly, if you think Tropico 4 is better than Tropico 5, then this game will be a big disappointment to you. \nIf you instead prefer all the changes brought with the 5th installment, then you will probably like this. \n\nIt is no way near as smooth or funny to play as the 4th game and I do not think the added complexity, real and forced simply because the gameplay mechanics have been worsened, is a welcome addition to the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Initially, I was happy to find Tropico 6 way more challenging than the previous entries (I'm a Tropico fan, but tbh these games are just too easy).\n\nIn a several hours long session, I decided to save, exit and relaunch my save as performances were seriously tanking for some reason (went under 55FPS, and came back to +125FPS after reloading; I guess it's because of Unreal Engine).\n\nThen after reloading, I realized the game wasn't harder at all, but just buggier. All the stats I was laboriously trying to up were badly calculated (happiness, approval and so on).\n\nI will keep playing it because I like the gameplay and wanna finish the campaign, but I can't recommend it. At least I've not (yet) encountered any game breaking bugs, like in Tropico 5.\nOut of the last 3, I can only really recommend Tropico 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No recommendation.\n\nOn standard difficulty the economy is extremely tight.  Most crops barely pull in enough money to paying your farmers.  Manufactured goods are better - but come with additional costs.  Also the happiness gauge seems ridiculously low.  With factions and personal happiness running 40% to 70% my personal rating was  23%.  A game that should have been about choices in building for long times involved waiting for my economy to strengthen so I could do anything.  I've finished both Tropico 4 and Tropico 5 so stow that \"Git gud\".  In earlier games a couple of industries with the right edicts could ensure your prosperity, here I can have eight to ten upgraded industries and still be struggling to make ends meet.  A lot of options  and upgrades have more negatives than they are worth.\n\nAccess to buildings is covered by wealth so the poor have no way to have their happiness reach the higher levels.\n\n There are irritants.  Crop harvesting doesn't feel real, and nor does any other production building.    I couldn't see Tropicans developing skills.  It takes ages to open up edicts that you'd never voluntarily pass.  One scenario required you to choose certain options for a newspaper without ever having a way to unlock them.\n\n  Tropicos 4 and 5 are significantly better than this one and there's too little in what's new here that increases the fun.\n\nS.x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I loved tropico 4 and 5. They were different, but you could still have fun with both. Here it seems they forgot to add the fun. Being constanly attacked by pirates is so fun, none of the starting buildings being profitable is also so fun. Hard pass.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A lot to like, a lot more buildings and complexity, but the late game management in modern era just falls apart over time. Guerilla fighters become more and more prelevant (even at 100% approval) to the point where it's literal swarms at all times, and for whatever reason your military guys don't live at their military base so they have to drive over every single time, which lets the fighters move in and light 8 buildings on fire before your military even 'spawns' \r\n\r\nUltimatums from super powers can flat end your game. Especially if a superpower decides to just simply issue 2 at once, you auto game over. No chance to fight them off on the 'invasion' you just lose automatically. Disease sucks and makes the game unplayable. For all the good it has with building beauty and graphics and more buildings in general, 6 fails to play as well as 4 or 5.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One small nitpick[/h1]\n\n[b][u][i]Please[/i][/u][/b] add a bind to arrest the selected citizen. My wrist hurts from arresting over >40 criminals, because in colonial era arresting is a manual task, which if not done can cost over $3000 a month.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not as good as 4. Its also buggier than 4 and is a lot more difficult than 4.\nThe map size is too small honestly and when you change to different time periods your economy always collapses the game doesn't give you enough time to prepare for the shift you have to pre-emptively prepare for it by not taking the quest - tropico 5 has a similar problem. This one just isn't as fun to play as the others.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has crashed 4 times since I started playing it, in less than 2 hours. Couldn't even make it through the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get that the humour is the selling point for Tropico now, but I liked it better when it was just sprinkled on top rather than injected throughout. I'll probably still play it, it's still fills a unique niche in the city-building genre, but I wouldn't dedicate several weekends just to build the city of my dreams like I might do with a Sim City, Anno or Caesar game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the few new building in the a game as well as the multi island concept. Personally I enjoyed Tropica 5 in more ways then this newer rendition. This game has a weird learning curve as well as more pressure on politics compared to the fun and easy game play of 5. Honestly I play five more then this game and not get as frustrated with the campaigns which is odd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is going in the wrong direction.  This version I just can't bring myself to play.  The islands aren't fun, the missions are preset, and there isn't anything new.  I prefer to play missions my own way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of the Tropico series, but I really struggled with this one. The distance citizens needs to travel is key to an effective economy, workers will happily commute across the entire map wasting much time, but there seems to be little you can do to stop this. The game doesn't alert you to this issue, nor does it offer any kind of useful information to help you pinpoint the issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand the economy and hidden logistics of this game. My treasury always goes into minus and then never bounces back, no matter what I do and how careful I am. Some trade routes are stuck in 0 despite all other aspects being in place. People will remain broke even with plenty of jobs and home happinness never goes above 40% even when there is plenty of housing and free housing edict. I do get it's a complex game but come on, it's just not fun when you fail 5 times for the same reasons!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. I played Tropico 3 and liked it very much, especially the satirical humour based on playing a ruthless dictator who skillfully pulls money from the great world powers' pockets while basically oppressing their own people and using military force if the osterity measures went a bit too far.\r\nHere, this feeling is gone. It feels more like a regular city building simulator.\r\n- There are demands that you have to meet or you will not be reelected / your citizens riot. You feel much more like their servant than their ruler.\r\n- There are several interest groups with significant power. If you do not fulfil their demands, they can impose significant penalties. You can't weaken their influence or get rid of them, even if their presence on your island simply makes no sense. There will always be environmentalists, capitalists or democracy advocates. Even the relationship to the world powers feels more like groweling before their feet and accepting close monitoring and supervision instead of playing them like a fiddle.\r\n- Additionally, there are some strange things with the economy which I needed to figure out. In a playthrough that gave me several gold deposits, I was constantly broke. The numbers just didn't match, even after establishing factories to produce jewellery from that gold. Mostly, it was the agriculture that kept me afloat. It felt strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me, the specificity of the missions takes the fun out of the Tropico concept. I'm unable to even finish several of the first maps because I run into either an irrecoverable deficit in spite of putting up plantations etc. in order to export, or I lose the election for reasons I don't understand. Having to select specific trade deals annoys me, and those Pirate Cove missions are basically random and silly, and the limitation to certain historic periods constrains the possibilities too much. Several of the scenarios start with a given set of superfluous, costly buildings, or in a weird geographical setting, which seems to be intended to contribute to the difficulty of winning, which I find arbitrary and frustrating. I like to build and expand, and for a game to allow some freedom in how to win, but this game to me seems to allow only for certain, fairly narrow paths of success that I'm unable to find. Sorry for not being able to be more specific. I'm quite certain that lack of intelligence on my part isn't the problem here. I loved Tropico 3, 4 and 5. But somehow Tropico 6 - which I've tried repeatedly over the years - just doesn't do it for me. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to be desired in this game (like a return to Tropico 5 paid dollar amounts rather than \"class categories\") but other things are interesting (such as spread islands, bridge, and tunnel buildings). The only reason I mark is as Not Recommended is because you *need* some of the DLC to make it more sensible to play (why spread the islands and then give very little stuff to build on all this open water? Oh to sell DLC that gives you that stuff to build)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "*insert Jeff Goldbloom looking at big pile of dinosaur poo*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not free from some bugs and such, but nothing gamebreaking. The problem is in the publishers greed. How come the DLCs, that only add minimalistic functions and gameplay, cost more than the game itself?? Check the game on discount and check a DLC on discount... F you if you live in Latin America, right?\n\nTL:DR\nGame good. Price not worth even with discount.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Game plays fine until everybody has cars. Sounds great, doesn't work.  Traffic jams just happen out of nowhere when one citizen decides they aren't going to drive ever again until they starve in their car on the road. It grinds your entire economy to a halt. Teamsters, firefighters, and workers in general just quietly stop working, nothing gets to your docks for export, and your very profitable set-up goes to (schist). Game does not rock.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I just can't find myself enjoying this game. I try, but it just isn't that much fun. I love the new infrastructure and I am glad they got rid of the Dynasty aspect of the 5th game, but it just takes most of what I didn't like about the 5th game and expands on it, making a lot of things that should be simple either very complicated or time consuming. \nThe missions also aren't exactly great. Not terrible by any means, but their piecemeal nature detaches you from it and instead of a coherent narrative, you get what can barely be called an \"episodic\" experience. \n\nTo put it bluntly, if you think Tropico 4 is better than Tropico 5, then this game will be a big disappointment to you. \nIf you instead prefer all the changes brought with the 5th installment, then you will probably like this. \n\nIt is no way near as smooth or funny to play as the 4th game and I do not think the added complexity, real and forced simply because the gameplay mechanics have been worsened, is a welcome addition to the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Initially, I was happy to find Tropico 6 way more challenging than the previous entries (I'm a Tropico fan, but tbh these games are just too easy).\n\nIn a several hours long session, I decided to save, exit and relaunch my save as performances were seriously tanking for some reason (went under 55FPS, and came back to +125FPS after reloading; I guess it's because of Unreal Engine).\n\nThen after reloading, I realized the game wasn't harder at all, but just buggier. All the stats I was laboriously trying to up were badly calculated (happiness, approval and so on).\n\nI will keep playing it because I like the gameplay and wanna finish the campaign, but I can't recommend it. At least I've not (yet) encountered any game breaking bugs, like in Tropico 5.\nOut of the last 3, I can only really recommend Tropico 4.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No recommendation.\n\nOn standard difficulty the economy is extremely tight.  Most crops barely pull in enough money to paying your farmers.  Manufactured goods are better - but come with additional costs.  Also the happiness gauge seems ridiculously low.  With factions and personal happiness running 40% to 70% my personal rating was  23%.  A game that should have been about choices in building for long times involved waiting for my economy to strengthen so I could do anything.  I've finished both Tropico 4 and Tropico 5 so stow that \"Git gud\".  In earlier games a couple of industries with the right edicts could ensure your prosperity, here I can have eight to ten upgraded industries and still be struggling to make ends meet.  A lot of options  and upgrades have more negatives than they are worth.\n\nAccess to buildings is covered by wealth so the poor have no way to have their happiness reach the higher levels.\n\n There are irritants.  Crop harvesting doesn't feel real, and nor does any other production building.    I couldn't see Tropicans developing skills.  It takes ages to open up edicts that you'd never voluntarily pass.  One scenario required you to choose certain options for a newspaper without ever having a way to unlock them.\n\n  Tropicos 4 and 5 are significantly better than this one and there's too little in what's new here that increases the fun.\n\nS.x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I loved tropico 4 and 5. They were different, but you could still have fun with both. Here it seems they forgot to add the fun. Being constanly attacked by pirates is so fun, none of the starting buildings being profitable is also so fun. Hard pass.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A lot to like, a lot more buildings and complexity, but the late game management in modern era just falls apart over time. Guerilla fighters become more and more prelevant (even at 100% approval) to the point where it's literal swarms at all times, and for whatever reason your military guys don't live at their military base so they have to drive over every single time, which lets the fighters move in and light 8 buildings on fire before your military even 'spawns' \r\n\r\nUltimatums from super powers can flat end your game. Especially if a superpower decides to just simply issue 2 at once, you auto game over. No chance to fight them off on the 'invasion' you just lose automatically. Disease sucks and makes the game unplayable. For all the good it has with building beauty and graphics and more buildings in general, 6 fails to play as well as 4 or 5.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One small nitpick[/h1]\n\n[b][u][i]Please[/i][/u][/b] add a bind to arrest the selected citizen. My wrist hurts from arresting over >40 criminals, because in colonial era arresting is a manual task, which if not done can cost over $3000 a month.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not as good as 4. Its also buggier than 4 and is a lot more difficult than 4.\nThe map size is too small honestly and when you change to different time periods your economy always collapses the game doesn't give you enough time to prepare for the shift you have to pre-emptively prepare for it by not taking the quest - tropico 5 has a similar problem. This one just isn't as fun to play as the others.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has crashed 4 times since I started playing it, in less than 2 hours. Couldn't even make it through the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get that the humour is the selling point for Tropico now, but I liked it better when it was just sprinkled on top rather than injected throughout. I'll probably still play it, it's still fills a unique niche in the city-building genre, but I wouldn't dedicate several weekends just to build the city of my dreams like I might do with a Sim City, Anno or Caesar game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the few new building in the a game as well as the multi island concept. Personally I enjoyed Tropica 5 in more ways then this newer rendition. This game has a weird learning curve as well as more pressure on politics compared to the fun and easy game play of 5. Honestly I play five more then this game and not get as frustrated with the campaigns which is odd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is going in the wrong direction.  This version I just can't bring myself to play.  The islands aren't fun, the missions are preset, and there isn't anything new.  I prefer to play missions my own way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played a lot of the Tropico series, but I really struggled with this one. The distance citizens needs to travel is key to an effective economy, workers will happily commute across the entire map wasting much time, but there seems to be little you can do to stop this. The game doesn't alert you to this issue, nor does it offer any kind of useful information to help you pinpoint the issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not understand the economy and hidden logistics of this game. My treasury always goes into minus and then never bounces back, no matter what I do and how careful I am. Some trade routes are stuck in 0 despite all other aspects being in place. People will remain broke even with plenty of jobs and home happinness never goes above 40% even when there is plenty of housing and free housing edict. I do get it's a complex game but come on, it's just not fun when you fail 5 times for the same reasons!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing. I played Tropico 3 and liked it very much, especially the satirical humour based on playing a ruthless dictator who skillfully pulls money from the great world powers' pockets while basically oppressing their own people and using military force if the osterity measures went a bit too far.\r\nHere, this feeling is gone. It feels more like a regular city building simulator.\r\n- There are demands that you have to meet or you will not be reelected / your citizens riot. You feel much more like their servant than their ruler.\r\n- There are several interest groups with significant power. If you do not fulfil their demands, they can impose significant penalties. You can't weaken their influence or get rid of them, even if their presence on your island simply makes no sense. There will always be environmentalists, capitalists or democracy advocates. Even the relationship to the world powers feels more like groweling before their feet and accepting close monitoring and supervision instead of playing them like a fiddle.\r\n- Additionally, there are some strange things with the economy which I needed to figure out. In a playthrough that gave me several gold deposits, I was constantly broke. The numbers just didn't match, even after establishing factories to produce jewellery from that gold. Mostly, it was the agriculture that kept me afloat. It felt strange.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To me, the specificity of the missions takes the fun out of the Tropico concept. I'm unable to even finish several of the first maps because I run into either an irrecoverable deficit in spite of putting up plantations etc. in order to export, or I lose the election for reasons I don't understand. Having to select specific trade deals annoys me, and those Pirate Cove missions are basically random and silly, and the limitation to certain historic periods constrains the possibilities too much. Several of the scenarios start with a given set of superfluous, costly buildings, or in a weird geographical setting, which seems to be intended to contribute to the difficulty of winning, which I find arbitrary and frustrating. I like to build and expand, and for a game to allow some freedom in how to win, but this game to me seems to allow only for certain, fairly narrow paths of success that I'm unable to find. Sorry for not being able to be more specific. I'm quite certain that lack of intelligence on my part isn't the problem here. I loved Tropico 3, 4 and 5. But somehow Tropico 6 - which I've tried repeatedly over the years - just doesn't do it for me. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to be desired in this game (like a return to Tropico 5 paid dollar amounts rather than \"class categories\") but other things are interesting (such as spread islands, bridge, and tunnel buildings). The only reason I mark is as Not Recommended is because you *need* some of the DLC to make it more sensible to play (why spread the islands and then give very little stuff to build on all this open water? Oh to sell DLC that gives you that stuff to build)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "*insert Jeff Goldbloom looking at big pile of dinosaur poo*",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}