{
  "positive": [
    {
      "review": "Planet Coaster is everything I could want in a simulation game of this type. Good management tools, good building tools, and most of all, it is extremely fun to play. It's the best amusement park simulation we've seen yet, and any complaints that you might have with the variety of rides that it offers are mitigated brilliantly by the use of Steam Workshop to allow the community to broaden the experience. In this way Planet Coaster feels both nostalgic and yet eminently modern.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "It took me a little while to get used to the controls, but once I did, Planet Coaster completely won me over. As someone who loved the original Roller Coaster Tycoon, this game goes far beyond what I expected. The graphics are stunning, and even with just the base game you get an impressive amount of detail, customization, and creative freedom. It truly feels like you’re managing a living, breathing theme park, from designing coasters to watching guests react to every decision you make. If you enjoy park builders or creative sandbox games, this is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "very good game and people make good recreations of Cedar Point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yall, this game is W!!!! But if you disagree with me, that's fine, we all have different opinions. Anyway, this game is such an amazing work of art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game where creativity and imagination reign king but as most games in this style can get boring quickly if you lack the creativity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, lots of good DLC and workshop items. My only gripe is that when you have a large park it gets rather demanding on the system, and you may have to restart just based off of how many rides you have and guests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game more than I'd like to admit.\nThis game is really good at being a fun simulator that any enthusiast can enjoy and has it all. Including many different types of rides and coasters, an abundant amount of food and drink stands for even the chunkiest guest you'll find, and dlc for days. Buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing! Easy coaster builder, good scenery, and good everything! You should really buy this and planet coaster 2!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, fun in sandbox. I love making parks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "found this game from Lets Game It Out my favourite feature is hitting people with roller coasters in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can have a laugh in this game and make whatever you want with no limits. this game is a great experience for people that love rides and theme parks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster is an amazing theme park sim and I had a great time playing it. The creativity this game allows is incredible—building rides, designing custom scenery, and managing the park all feel smooth and satisfying. The visuals are beautiful, the coaster-building tools are super fun, and there’s always something new to tweak or improve.\r\n\r\nWhether you want deep management or just to build wild coasters, Planet Coaster delivers. I really enjoyed it and highly recommend it to any theme park sim fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a chill ( if u dont play in hard mode) relaxing game , unless u start loosing money (game money)...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful. If you enjoy coaster simulator games, this game is perfect. It does take a lot of patience but it definitely makes you think.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One of the better [i]RollerCoaster Tycoon[/i] alternatives if you want a more modern theme park game.\n\nBeware of the pricey DLC though.\n\n8/10[/h1]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game.  It's lots of fun.  A great spiritual successor to the original Roller Coaster Tycoon series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and food way to relax and pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost 600 hours in and this game hasn't failed to entertain me yet. Solid game and a worthy spiritual successor to the Roller Coaster Tycoon series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok, had this one in my Library for a while. This is a very polished and absorbing construction and management game. Loads of fun. Who was it who said, 'build it and they will come'? Absolutely, brilliant entertainment. More fun than dragging kids around a real park!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! More variation in coasters would be nice but still a wide range of coasters in general.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun indeed but I need more of a tutorial at the start for how connect road to rides.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game runs very well and is very good for the price of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play the RCT series as a kid, and this game is exactly what my inner child needs right now. It's everything I missed about Roller Coaster Tycoon 3 PLUS everything I wished it had. The roller coaster design is just as intuitive but more sophisticated, and the customization for shops and facilities is very robust. I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obviously, you can tell from the number of hours I've played this game that it's pretty good. I'm not a fan of micro transactions, which has kept me from playing newer installments from this franchise, but I digress. This is a pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so good! You dont need to make money if you want you can have unlimted! And this game sparks up your creativey",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play, but the scenarios seem a little buggy. The last one I played I could not figure out why my park was failing, then I noticed a lot of strange issues: customers in the air; \"long lines\" when there is zero people in said line; An identical ride \"failing\" to meet people's needs is raking in dough, while the original is \"doing great\" and is in the red for income, while maintaining  a massive queue. I don't think there is anything I could do, but I had to learn some other stuff so idk. Should't be an issue in sandbox though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is GREAT; it runs amazing on mac and the amount of options is crazy. Would recommend for anyone who is looking for a fun tycoon or roller coaster game. 11/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing and a must by for peapole that love rolercoasters and in my opinion it is the best colercoaster game right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what if the game was called planet toaster and you made toast instead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good music, Good creative licence, Good art style",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the old school Roller Coaster Tycoon games, you'll love this. Controls are simple, customization is amazing, the vibe is perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes build rollercoasters its fun make parks its also fun yayyy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ironically from the Same Devs who made one of my Favorite childhood Games, ironically another Themepark one.\n\nThrillville: Off the Rails\n\nSeriously though I do see some similarities between the two, they aren’t the same thing, Planet coaster is vastly more open world and expansive than Thrillville which seemed a bit more focused on the story and missions in hindsight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. dont realy have anything bad to say about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MURDER PEOPLE or be lame, Great both ways though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game has workshop very addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun if u like rollercoaster let your creativity out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10, would hit people with roller coasters again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game so fun but there is some problem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Don't play the second one its trash.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fire game, it just needs more military props to me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's got a very good sandbox mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kind of like planet zoo but with rollercoasters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this was fun. makes me mellow and calm hours pass when I play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love making roller coasters that defy all laws of physics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very good, i hope more coaster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game if anybody wanna makes a theme park :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you loved RCT 1, 2, and 3, Thrillville, etc. This is the series for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "werry good if u a dad that likes gaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! Very Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is Wonderful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goodd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Veru fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tourturing guests",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its preety peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i made a train toot toot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Simpsons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Themepark Sim",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi guys",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "big",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Weeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, it's very fun to make coasters run over thousands of people",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Planet Coaster is everything I could want in a simulation game of this type. Good management tools, good building tools, and most of all, it is extremely fun to play. It's the best amusement park simulation we've seen yet, and any complaints that you might have with the variety of rides that it offers are mitigated brilliantly by the use of Steam Workshop to allow the community to broaden the experience. In this way Planet Coaster feels both nostalgic and yet eminently modern.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "my roller coaster exploded and all of the guests started crying right after, up to this point ive never resonated with so many NPCs in a video game. this game is a must try",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "so much if you love rollercoasters (or creating a place of torture) would highly recomend",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is the most fun game in the world to play WRONGLY. Shout out to Let's Game it Out for being my devious, maniacal inspiration.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing game if your into roller coasters and theme parks, there's tones of roller coasters and rides to build plus all the scenery pieces are amazing as well, also the DLC packs are great as they add much more onto the game as if the game wasn't already amazing enough, highly recommend trying this game out since it's simply amazing!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lo agarré de rebaja con todos los dlcs, al principio cuesta agarrarle la mano al aspecto económico del juego, quedas en números rojos siempre hasta que aprendes a gestionar las finanzas, pero el juego es bastante entretenido si lo tenes con los dlcs que agregan nuevos escenarios y juegos , etc.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It took me a little while to get used to the controls, but once I did, Planet Coaster completely won me over. As someone who loved the original Roller Coaster Tycoon, this game goes far beyond what I expected. The graphics are stunning, and even with just the base game you get an impressive amount of detail, customization, and creative freedom. It truly feels like you’re managing a living, breathing theme park, from designing coasters to watching guests react to every decision you make. If you enjoy park builders or creative sandbox games, this is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, but quite clunky. This has more options than the sequel, but is harder to use",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Editor has a steeeep learning curve, but otherwise quite complete. Mac runs it well, a decent tycoon game. It's really fun to use the coaster view when testing the mechanics of it all!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a chill ( if u dont play in hard mode) relaxing game , unless u start loosing money (game money)...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful. If you enjoy coaster simulator games, this game is perfect. It does take a lot of patience but it definitely makes you think.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]One of the better [i]RollerCoaster Tycoon[/i] alternatives if you want a more modern theme park game.\n\nBeware of the pricey DLC though.\n\n8/10[/h1]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game.  It's lots of fun.  A great spiritual successor to the original Roller Coaster Tycoon series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and food way to relax and pass time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Almost 600 hours in and this game hasn't failed to entertain me yet. Solid game and a worthy spiritual successor to the Roller Coaster Tycoon series.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So, you buy the game for 45$ thinking there will be enough content to make you want to play this game, WRONG. Be prepared to spend another additional 85$, yes you read that right, EIGHT-FIVE to access all the other content that could allow you to differentiate your park from others. Alternatively you can purchase a SUBSCRIPTION for 5$ to temporarily own content. So if you like owning the stuff you spend money on, you better drop 130ish USD to just be able to customize your park. Honestly im glad Planet Coaster+ PC2 and Frontier fell off. Well deserved you greedy goblins.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very bad game, put challange on very easy and couldnt even play that path wont connect to the entraceses and exits of roller coasters not a clear tutorial and impossible to enjoy when youre new. DONT BUY THIS GAME ITS A WASTE OF MONEY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tried this after Planet Zoo kept freezing - 30 mins into building a park the game crashed.\n\nNothing to do with my PC, it's high end and can run every game no issues, apart from Planet Zoo and Planet Coaster apparently...\n\nFix your games Frontier :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The most irritating building system ive ever used, grid system is so inconsistent and problematic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been trying to play this tycoon game but it's just so boring. I love JWE 1 and 2 but for the life of me I just cannot get into this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The complete lack of an interactive tutorial, whether specifically selected or as a copilot to your first scenarios, is a frankly crazy choice for a game like this. Some games it's excusable to have a more sandbox learn-as-you-go process, but what stopped me from even trying to persevere was the UI scaling. I'm on a 1440p monitor, nothing that crazy. All the thumbnails for items and most UI elements are extremely blurry as if they were upscaled from something as bad as 480p or 720p. Maybe this is less noticeable on a 1080p display? Either way an immediate deal breaker unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty decent theme park simulator that has been ruined by temporary license deals for DLC. These DLC have become widely used on the steam Workshop, and have and will be removed in the future, leaving you unable to use the mods in the workshop without paying for a subscription service.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth your time. Refund immediately. I accidentally left it open on my computer for three years straight and I couldn't turn it off",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no tutorial, the \"tutorial videos\" also points to a deleted playlist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "finicky controls, sub-ideal rendering quality and not much room for freedom.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the character craetor scares me also it crashed on pickinh first aid LOL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid asf and boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage, total garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Queue setup invalid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "K",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is tedious and unintuitive to the extreme. The grid and snapping system to try laying out paths and buildings in an orderly fashion is janky. One second i could lay down a path somewhere, then it would say it was obstructed and I couldn't. The axis system in \"advanced\" settings to maneuver buildings into place still fails to allow certain angles to be achieved, leaving things like the park entrance I tried to neatly build instead at a slightly off-kilter angle to the hole people would come out of. The annoyances in how the UI and placement systems worked steadily build up, and the very simple park layout I was attempting to build steadily proved to be impossible.  \n\nI switched from sandbox to career modes to see if I'd find one of the pre-made scenarios and parks easier to manipulate, and that swiftly led to more frustrations. Got some concession stands placed at the Kraken park with only minor placement annoyances. Added scenery to the queue areas to improve attitudes of customers during their waits. Tossed down a few flat rides in empty spaces to give people more options for entertainment, and even got some scenery triggers added in to the cycles to make them more appealing. But people still wanted the main rollercoaster the most and the lines were getting massive and turning people away very quickly. So then I found myself running into an issue where an attempt to adjust the primary rollercoaster's operations, just adding an extra car to accommodate more patrons and tweaking the timings to keep the cycles along the track running smoothly, led to needing to run a safety test... A test that never ended. Just kept running without giving results. Stopped and started it a couple times, as some forum posts suggested, but the ride refused to finish the test. Removed the car, putting the ride back to its default, and ran the test again to try getting it back up and running at least to its former capacity because it was my major money maker and the park was steadily bleeding funds without it, but the test phase continued to refuse to finish. Leaving me with a dead ride taking up a bunch of space and my reputation and funds steadily dropping as customers left in a huff because they couldn't ride it.\n\nI wasn't about to try dismantling the ride and rebuilding it from scratch, as some forum posts suggested to people for these scenarios, to see if that might get it working again. Not with as many pieces as they were and how miserable the system proved to be in Sandbox.\n\nI turned off the game a few times and watched some videos on youtube, trying to figure out what was being done wrong, trying to find a solution that wasn't going to involve rebuilding the entire coaster- and couldn't find answers to my issues. And the game itself has zero actual tutorials to explain anything about the building or testing or financial mechanics. You're stuck wracking up time in the game while cross checking with third party sources to try figuring out what's malfunctioning. \n\nI passed the two hour mark for refunds, yet barely had a park running for ten minutes before it all went wrong because I tried to increase capacity to keep up with the swiftly growing line demands.\n\nThere's plenty of people who find this game fun to play, and good for them. But for me, this game was downright unintuitive and miserable to try working out anything beyond slapping down the basic blueprints already constructed and then never touching anything about them for fear of breaking one of the many unexplained mechanics. Which isn't the least bit fun to do, nor will it fulfill various demands the game will toss at you to keep patrons happy. \n\nThis feels like such a waste of money and I really wish Steam had a slightly wider window for refunding on games.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "No longer works with Proton on Linux.  Game loads, intro animation plays, music plays, but the menu never shows up.  Have to force quit the game.\r\n\r\nReally too bad, as I was looking forward to some nostalgia playing.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They put *a lot* of work into a lot of details n'stuff but yet this game falls really short on the basics: The controls are terrible, mostly unintuitive, and often not even described. Building anything - even plain simple paths - is just pain and terrible. You don't know what to press - and especially not press - when you build a track. Hotkeys are available but no easy accessible information available, if at all. But even with them it's just bad.\r\nYou then also have to micromanage sh*t like the staffs happiness and where to work. No, I don't want to set salaries, training, payment and working area for every one of them individually so that they just don't quit or leave the store empty.\r\nAnd despite having a lot of details they still fall short on options for coasters like: No, I don't want this ride only in reverse available. Or adding a second train to this specific ride for more throughput? Nope, not here either. (It does work for some but apparently not all coasters.)\r\nOn that topic: Guests enter leave rides stupidly slow and adds additional useless \"pauses\" in between. Just annoying.\r\nWant to build a stupid large park with everything and anything? Nope, not with us! 1x1 km max in size! (And no, I do not want to play tetris with this! As some suggested..)\r\n\r\nAll in all, I was annoyed by so many problems that should never have been one in the first place.\r\nBut the worst of all?\r\nThere are not mods!\r\nMods, like for example in Cities: Skylines (1) could fix nearly all problems with this game. But nope..\r\nThat's so frustrating and sad..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "very bad game, put challange on very easy and couldnt even play that path wont connect to the entraceses and exits of roller coasters not a clear tutorial and impossible to enjoy when youre new. DONT BUY THIS GAME ITS A WASTE OF MONEY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I found this game irritating even though I tried to force myself to like it. It overly complicated everything. Takes way too long to get into and to build anything of depth. The complicated nature of it takes the fun out of building cool coasters. If you have time to sink 48 hours on the design of a single wall panel of one bathroom, then this might be for you. If you want something more accessible and fun with a UI that doesn't make you want to rub sand in your eyes, get Parkitect.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Tried this after Planet Zoo kept freezing - 30 mins into building a park the game crashed.\n\nNothing to do with my PC, it's high end and can run every game no issues, apart from Planet Zoo and Planet Coaster apparently...\n\nFix your games Frontier :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly the game is alright my only issue with it is the game is super boring after a pretty small amount of time because it's annoying to get small things to work like paths so it just ends up being really boring and you end up quitting most of the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth your time. Refund immediately. I accidentally left it open on my computer for three years straight and I couldn't turn it off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been trying to play this tycoon game but it's just so boring. I love JWE 1 and 2 but for the life of me I just cannot get into this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, you buy the game for 45$ thinking there will be enough content to make you want to play this game, WRONG. Be prepared to spend another additional 85$, yes you read that right, EIGHT-FIVE to access all the other content that could allow you to differentiate your park from others. Alternatively you can purchase a SUBSCRIPTION for 5$ to temporarily own content. So if you like owning the stuff you spend money on, you better drop 130ish USD to just be able to customize your park. Honestly im glad Planet Coaster+ PC2 and Frontier fell off. Well deserved you greedy goblins.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The complete lack of an interactive tutorial, whether specifically selected or as a copilot to your first scenarios, is a frankly crazy choice for a game like this. Some games it's excusable to have a more sandbox learn-as-you-go process, but what stopped me from even trying to persevere was the UI scaling. I'm on a 1440p monitor, nothing that crazy. All the thumbnails for items and most UI elements are extremely blurry as if they were upscaled from something as bad as 480p or 720p. Maybe this is less noticeable on a 1080p display? Either way an immediate deal breaker unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O gráfico é bonitinho, mas meua migo, os comandos são uma merda, fazer \"estrada\" ou caminhos é simplesmente terrível, os atalhos são ruins, mover, girar, selecionar as estruturas é horroroso, nenhum jogo tem a qualidade e nem o charme de Roller Coaster Tycoon 1 e 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so terrible, I wish I could get a refund. Even the basic controls are so bad, it turns any new play away. If you look for a good coaster game, get the most famous Roller Coaster Tycoon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like slow build up games, detailed building options and don't mind figuring out building options and controls bit by bit by yourself while the park is constantly running and you have to deal with occuring problems on the side, then this game might be for you. \n\nTo me personally it felt rather tedious. Snapping grids can be janky and tricky to figure out. The constant flood of notifications was a bit annoying and according to those I was only doing it right if everything in my park was free or underpriced. \n\nOne more point which i can't hold against the game because I could have found that out prior to buying it: \nWhile you can build roller coasters however you like, the roller coasters measure things like Nausea and G-Forces and cannot open for visitors if those exceed certain values. So you can build freely but only use the \"more harmless\" ones.\nYet again, this comes with a whole testing map mechanic that shows you which parts of the ride have which problem so you can fix it which is quite neat if you are into that. I personally just expected something with a bit more freedom in terms of making my visitors empty their stomachs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster game made me realise it's more the business management side of things that I enjoy than the intricate designing of rides. This game doesn't really scratch that itch. Don't get me wrong, I enjoy laying out rollercoasters, but when you have to spend ages fiddling with a track until the game deems it safe, the fun kind of evaporates. The rides that you do build require even more time theming them or everything just feels generic. If you have hours to spend designing and theming rides, then you'll probably get a lot out of it, but at a base level I didn't enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No in-game tutorial. You're just thrown in, expecting you do know what to do?\nThere's a tutorial videos option in the menu though... But it opens a youtube playlist that doesn't exist anymore...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls for pc are so bad and its really hard to navigate, get the console version instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too fussy and complicated to be any fun. No real stakes for scenario play. If you have no responsibilities and want to dedicate all the time in your life to making a glorified mediocre model train set, be my guest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't understand anything happening in the game after clicking here and there. \nCities skylines, sim city and many other tycoon game add a very basic tutorial to at least launch your tycoon.\nless than 2 hours of programming with one man alone, would have done the work, but it's not here.\n\nWhatever, I've been refunded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parkitect is way better.\nSure, Parkitect isnt looking as beautiful, but it makes creating your own individual park much easier and faster, while at the same time blowing Planet Coaster (1 or 2) out of the water in terms of management.\n\nIf you liked rollercoaster Tycoon and its management, creating and challenge, Parkitect is what gets closest as a modern day evolution of the formula.\nPlanet Coaster feels like a 3D sculpting tool you need 5 hours for to only get minor things done and once you got the grasp of its tools, you ask where the challenge is because theres not much to do besides creating your park visually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I gave this game a shot many years ago and it just didn't click. I come back year later to give  it another shot, I now know what killed it and it's the system in which you interact with the game.\r\n\r\nMy standard is Roller Coaster Tycoon. What I expected was something like City Skylines kind of interaction and complexity with the game. That is not the case.\r\n\r\nI'm not expecting the world but I'm certainly expecting better. Sure the graphics are better but lots of things are just lacking. \r\n- There are themed buildings (food, restrooms, beverages, kiosk etc) where one or more themes are missing making it difficult to make a coherent themed park.\r\n- Camera system is a struggle an a half. I'm trying to see something but then a building gets in my way obstructing the view.\r\n- Buildings are frustrating. \r\n--They don't pop in at a 90 degree but at a wonky 67 degree or whatever it happens to be.\r\n--They don't pop in level with the floor when the entire surrounding is flat.\r\n--When I have angle activated, it's not actually an angle. Not a 47 to 50 -> 55 -> 60 -> 65, etc. No, it's a +5 in rotation 47 -> 52 ->57 -> 62, etc. This is especially infuriating when you want something flush with the sidewalk.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "didnt really meet my moderate expectations and gets boring extremely quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty decent theme park simulator that has been ruined by temporary license deals for DLC. These DLC have become widely used on the steam Workshop, and have and will be removed in the future, leaving you unable to use the mods in the workshop without paying for a subscription service.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's no tutorial.\nThe camera sucks. You can't see where you're building.\nThe graphics are nice, but better camera and map movement can be found on Parkitect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls are so bad, can't even connect a path to the exit it just snaps to the entrance",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No growth potential without paying to high prices, including new rides.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the character craetor scares me also it crashed on pickinh first aid LOL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid asf and boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage, total garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Queue setup invalid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "K",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is tedious and unintuitive to the extreme. The grid and snapping system to try laying out paths and buildings in an orderly fashion is janky. One second i could lay down a path somewhere, then it would say it was obstructed and I couldn't. The axis system in \"advanced\" settings to maneuver buildings into place still fails to allow certain angles to be achieved, leaving things like the park entrance I tried to neatly build instead at a slightly off-kilter angle to the hole people would come out of. The annoyances in how the UI and placement systems worked steadily build up, and the very simple park layout I was attempting to build steadily proved to be impossible.  \n\nI switched from sandbox to career modes to see if I'd find one of the pre-made scenarios and parks easier to manipulate, and that swiftly led to more frustrations. Got some concession stands placed at the Kraken park with only minor placement annoyances. Added scenery to the queue areas to improve attitudes of customers during their waits. Tossed down a few flat rides in empty spaces to give people more options for entertainment, and even got some scenery triggers added in to the cycles to make them more appealing. But people still wanted the main rollercoaster the most and the lines were getting massive and turning people away very quickly. So then I found myself running into an issue where an attempt to adjust the primary rollercoaster's operations, just adding an extra car to accommodate more patrons and tweaking the timings to keep the cycles along the track running smoothly, led to needing to run a safety test... A test that never ended. Just kept running without giving results. Stopped and started it a couple times, as some forum posts suggested, but the ride refused to finish the test. Removed the car, putting the ride back to its default, and ran the test again to try getting it back up and running at least to its former capacity because it was my major money maker and the park was steadily bleeding funds without it, but the test phase continued to refuse to finish. Leaving me with a dead ride taking up a bunch of space and my reputation and funds steadily dropping as customers left in a huff because they couldn't ride it.\n\nI wasn't about to try dismantling the ride and rebuilding it from scratch, as some forum posts suggested to people for these scenarios, to see if that might get it working again. Not with as many pieces as they were and how miserable the system proved to be in Sandbox.\n\nI turned off the game a few times and watched some videos on youtube, trying to figure out what was being done wrong, trying to find a solution that wasn't going to involve rebuilding the entire coaster- and couldn't find answers to my issues. And the game itself has zero actual tutorials to explain anything about the building or testing or financial mechanics. You're stuck wracking up time in the game while cross checking with third party sources to try figuring out what's malfunctioning. \n\nI passed the two hour mark for refunds, yet barely had a park running for ten minutes before it all went wrong because I tried to increase capacity to keep up with the swiftly growing line demands.\n\nThere's plenty of people who find this game fun to play, and good for them. But for me, this game was downright unintuitive and miserable to try working out anything beyond slapping down the basic blueprints already constructed and then never touching anything about them for fear of breaking one of the many unexplained mechanics. Which isn't the least bit fun to do, nor will it fulfill various demands the game will toss at you to keep patrons happy. \n\nThis feels like such a waste of money and I really wish Steam had a slightly wider window for refunding on games.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "No longer works with Proton on Linux.  Game loads, intro animation plays, music plays, but the menu never shows up.  Have to force quit the game.\r\n\r\nReally too bad, as I was looking forward to some nostalgia playing.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "So, you buy the game for 45$ thinking there will be enough content to make you want to play this game, WRONG. Be prepared to spend another additional 85$, yes you read that right, EIGHT-FIVE to access all the other content that could allow you to differentiate your park from others. Alternatively you can purchase a SUBSCRIPTION for 5$ to temporarily own content. So if you like owning the stuff you spend money on, you better drop 130ish USD to just be able to customize your park. Honestly im glad Planet Coaster+ PC2 and Frontier fell off. Well deserved you greedy goblins.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They put *a lot* of work into a lot of details n'stuff but yet this game falls really short on the basics: The controls are terrible, mostly unintuitive, and often not even described. Building anything - even plain simple paths - is just pain and terrible. You don't know what to press - and especially not press - when you build a track. Hotkeys are available but no easy accessible information available, if at all. But even with them it's just bad.\r\nYou then also have to micromanage sh*t like the staffs happiness and where to work. No, I don't want to set salaries, training, payment and working area for every one of them individually so that they just don't quit or leave the store empty.\r\nAnd despite having a lot of details they still fall short on options for coasters like: No, I don't want this ride only in reverse available. Or adding a second train to this specific ride for more throughput? Nope, not here either. (It does work for some but apparently not all coasters.)\r\nOn that topic: Guests enter leave rides stupidly slow and adds additional useless \"pauses\" in between. Just annoying.\r\nWant to build a stupid large park with everything and anything? Nope, not with us! 1x1 km max in size! (And no, I do not want to play tetris with this! As some suggested..)\r\n\r\nAll in all, I was annoyed by so many problems that should never have been one in the first place.\r\nBut the worst of all?\r\nThere are not mods!\r\nMods, like for example in Cities: Skylines (1) could fix nearly all problems with this game. But nope..\r\nThat's so frustrating and sad..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "very bad game, put challange on very easy and couldnt even play that path wont connect to the entraceses and exits of roller coasters not a clear tutorial and impossible to enjoy when youre new. DONT BUY THIS GAME ITS A WASTE OF MONEY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tried this after Planet Zoo kept freezing - 30 mins into building a park the game crashed.\n\nNothing to do with my PC, it's high end and can run every game no issues, apart from Planet Zoo and Planet Coaster apparently...\n\nFix your games Frontier :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly the game is alright my only issue with it is the game is super boring after a pretty small amount of time because it's annoying to get small things to work like paths so it just ends up being really boring and you end up quitting most of the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately, an instant uninstall. Simply building a path is extremely difficult, and controls to even build a toilet are very jittery and inconsistent. I was able to build one flat ride, but all of this took over 30 minutes. Maybe it's the lifelong RCT player in me (I mean, I'm sure it is) but I just can't tolerate it. Refunded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most unituitive coaster games I have played. It seems very unfriendly to the player. There also seems to be a severe lack of content. I'm assuming its another game that has most of the content locked behind paid DLC's. I'd honestly skip this and play one of the old coaster games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most irritating building system ive ever used, grid system is so inconsistent and problematic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been trying to play this tycoon game but it's just so boring. I love JWE 1 and 2 but for the life of me I just cannot get into this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The complete lack of an interactive tutorial, whether specifically selected or as a copilot to your first scenarios, is a frankly crazy choice for a game like this. Some games it's excusable to have a more sandbox learn-as-you-go process, but what stopped me from even trying to persevere was the UI scaling. I'm on a 1440p monitor, nothing that crazy. All the thumbnails for items and most UI elements are extremely blurry as if they were upscaled from something as bad as 480p or 720p. Maybe this is less noticeable on a 1080p display? Either way an immediate deal breaker unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O gráfico é bonitinho, mas meua migo, os comandos são uma merda, fazer \"estrada\" ou caminhos é simplesmente terrível, os atalhos são ruins, mover, girar, selecionar as estruturas é horroroso, nenhum jogo tem a qualidade e nem o charme de Roller Coaster Tycoon 1 e 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so terrible, I wish I could get a refund. Even the basic controls are so bad, it turns any new play away. If you look for a good coaster game, get the most famous Roller Coaster Tycoon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like slow build up games, detailed building options and don't mind figuring out building options and controls bit by bit by yourself while the park is constantly running and you have to deal with occuring problems on the side, then this game might be for you. \n\nTo me personally it felt rather tedious. Snapping grids can be janky and tricky to figure out. The constant flood of notifications was a bit annoying and according to those I was only doing it right if everything in my park was free or underpriced. \n\nOne more point which i can't hold against the game because I could have found that out prior to buying it: \nWhile you can build roller coasters however you like, the roller coasters measure things like Nausea and G-Forces and cannot open for visitors if those exceed certain values. So you can build freely but only use the \"more harmless\" ones.\nYet again, this comes with a whole testing map mechanic that shows you which parts of the ride have which problem so you can fix it which is quite neat if you are into that. I personally just expected something with a bit more freedom in terms of making my visitors empty their stomachs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster game made me realise it's more the business management side of things that I enjoy than the intricate designing of rides. This game doesn't really scratch that itch. Don't get me wrong, I enjoy laying out rollercoasters, but when you have to spend ages fiddling with a track until the game deems it safe, the fun kind of evaporates. The rides that you do build require even more time theming them or everything just feels generic. If you have hours to spend designing and theming rides, then you'll probably get a lot out of it, but at a base level I didn't enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No in-game tutorial. You're just thrown in, expecting you do know what to do?\nThere's a tutorial videos option in the menu though... But it opens a youtube playlist that doesn't exist anymore...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls for pc are so bad and its really hard to navigate, get the console version instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty decent theme park simulator that has been ruined by temporary license deals for DLC. These DLC have become widely used on the steam Workshop, and have and will be removed in the future, leaving you unable to use the mods in the workshop without paying for a subscription service.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I gave this game a shot many years ago and it just didn't click. I come back year later to give  it another shot, I now know what killed it and it's the system in which you interact with the game.\r\n\r\nMy standard is Roller Coaster Tycoon. What I expected was something like City Skylines kind of interaction and complexity with the game. That is not the case.\r\n\r\nI'm not expecting the world but I'm certainly expecting better. Sure the graphics are better but lots of things are just lacking. \r\n- There are themed buildings (food, restrooms, beverages, kiosk etc) where one or more themes are missing making it difficult to make a coherent themed park.\r\n- Camera system is a struggle an a half. I'm trying to see something but then a building gets in my way obstructing the view.\r\n- Buildings are frustrating. \r\n--They don't pop in at a 90 degree but at a wonky 67 degree or whatever it happens to be.\r\n--They don't pop in level with the floor when the entire surrounding is flat.\r\n--When I have angle activated, it's not actually an angle. Not a 47 to 50 -> 55 -> 60 -> 65, etc. No, it's a +5 in rotation 47 -> 52 ->57 -> 62, etc. This is especially infuriating when you want something flush with the sidewalk.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth your time. Refund immediately. I accidentally left it open on my computer for three years straight and I couldn't turn it off",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "didnt really meet my moderate expectations and gets boring extremely quickly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no tutorial, the \"tutorial videos\" also points to a deleted playlist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's no tutorial.\nThe camera sucks. You can't see where you're building.\nThe graphics are nice, but better camera and map movement can be found on Parkitect.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parkitect is way better.\nSure, Parkitect isnt looking as beautiful, but it makes creating your own individual park much easier and faster, while at the same time blowing Planet Coaster (1 or 2) out of the water in terms of management.\n\nIf you liked rollercoaster Tycoon and its management, creating and challenge, Parkitect is what gets closest as a modern day evolution of the formula.\nPlanet Coaster feels like a 3D sculpting tool you need 5 hours for to only get minor things done and once you got the grasp of its tools, you ask where the challenge is because theres not much to do besides creating your park visually.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are so bad, can't even connect a path to the exit it just snaps to the entrance",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "finicky controls, sub-ideal rendering quality and not much room for freedom.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the character craetor scares me also it crashed on pickinh first aid LOL",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid asf and boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage, total garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Queue setup invalid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "K",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is tedious and unintuitive to the extreme. The grid and snapping system to try laying out paths and buildings in an orderly fashion is janky. One second i could lay down a path somewhere, then it would say it was obstructed and I couldn't. The axis system in \"advanced\" settings to maneuver buildings into place still fails to allow certain angles to be achieved, leaving things like the park entrance I tried to neatly build instead at a slightly off-kilter angle to the hole people would come out of. The annoyances in how the UI and placement systems worked steadily build up, and the very simple park layout I was attempting to build steadily proved to be impossible.  \n\nI switched from sandbox to career modes to see if I'd find one of the pre-made scenarios and parks easier to manipulate, and that swiftly led to more frustrations. Got some concession stands placed at the Kraken park with only minor placement annoyances. Added scenery to the queue areas to improve attitudes of customers during their waits. Tossed down a few flat rides in empty spaces to give people more options for entertainment, and even got some scenery triggers added in to the cycles to make them more appealing. But people still wanted the main rollercoaster the most and the lines were getting massive and turning people away very quickly. So then I found myself running into an issue where an attempt to adjust the primary rollercoaster's operations, just adding an extra car to accommodate more patrons and tweaking the timings to keep the cycles along the track running smoothly, led to needing to run a safety test... A test that never ended. Just kept running without giving results. Stopped and started it a couple times, as some forum posts suggested, but the ride refused to finish the test. Removed the car, putting the ride back to its default, and ran the test again to try getting it back up and running at least to its former capacity because it was my major money maker and the park was steadily bleeding funds without it, but the test phase continued to refuse to finish. Leaving me with a dead ride taking up a bunch of space and my reputation and funds steadily dropping as customers left in a huff because they couldn't ride it.\n\nI wasn't about to try dismantling the ride and rebuilding it from scratch, as some forum posts suggested to people for these scenarios, to see if that might get it working again. Not with as many pieces as they were and how miserable the system proved to be in Sandbox.\n\nI turned off the game a few times and watched some videos on youtube, trying to figure out what was being done wrong, trying to find a solution that wasn't going to involve rebuilding the entire coaster- and couldn't find answers to my issues. And the game itself has zero actual tutorials to explain anything about the building or testing or financial mechanics. You're stuck wracking up time in the game while cross checking with third party sources to try figuring out what's malfunctioning. \n\nI passed the two hour mark for refunds, yet barely had a park running for ten minutes before it all went wrong because I tried to increase capacity to keep up with the swiftly growing line demands.\n\nThere's plenty of people who find this game fun to play, and good for them. But for me, this game was downright unintuitive and miserable to try working out anything beyond slapping down the basic blueprints already constructed and then never touching anything about them for fear of breaking one of the many unexplained mechanics. Which isn't the least bit fun to do, nor will it fulfill various demands the game will toss at you to keep patrons happy. \n\nThis feels like such a waste of money and I really wish Steam had a slightly wider window for refunding on games.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "No longer works with Proton on Linux.  Game loads, intro animation plays, music plays, but the menu never shows up.  Have to force quit the game.\r\n\r\nReally too bad, as I was looking forward to some nostalgia playing.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "So, you buy the game for 45$ thinking there will be enough content to make you want to play this game, WRONG. Be prepared to spend another additional 85$, yes you read that right, EIGHT-FIVE to access all the other content that could allow you to differentiate your park from others. Alternatively you can purchase a SUBSCRIPTION for 5$ to temporarily own content. So if you like owning the stuff you spend money on, you better drop 130ish USD to just be able to customize your park. Honestly im glad Planet Coaster+ PC2 and Frontier fell off. Well deserved you greedy goblins.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They put *a lot* of work into a lot of details n'stuff but yet this game falls really short on the basics: The controls are terrible, mostly unintuitive, and often not even described. Building anything - even plain simple paths - is just pain and terrible. You don't know what to press - and especially not press - when you build a track. Hotkeys are available but no easy accessible information available, if at all. But even with them it's just bad.\r\nYou then also have to micromanage sh*t like the staffs happiness and where to work. No, I don't want to set salaries, training, payment and working area for every one of them individually so that they just don't quit or leave the store empty.\r\nAnd despite having a lot of details they still fall short on options for coasters like: No, I don't want this ride only in reverse available. Or adding a second train to this specific ride for more throughput? Nope, not here either. (It does work for some but apparently not all coasters.)\r\nOn that topic: Guests enter leave rides stupidly slow and adds additional useless \"pauses\" in between. Just annoying.\r\nWant to build a stupid large park with everything and anything? Nope, not with us! 1x1 km max in size! (And no, I do not want to play tetris with this! As some suggested..)\r\n\r\nAll in all, I was annoyed by so many problems that should never have been one in the first place.\r\nBut the worst of all?\r\nThere are not mods!\r\nMods, like for example in Cities: Skylines (1) could fix nearly all problems with this game. But nope..\r\nThat's so frustrating and sad..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "very bad game, put challange on very easy and couldnt even play that path wont connect to the entraceses and exits of roller coasters not a clear tutorial and impossible to enjoy when youre new. DONT BUY THIS GAME ITS A WASTE OF MONEY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tried this after Planet Zoo kept freezing - 30 mins into building a park the game crashed.\n\nNothing to do with my PC, it's high end and can run every game no issues, apart from Planet Zoo and Planet Coaster apparently...\n\nFix your games Frontier :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly the game is alright my only issue with it is the game is super boring after a pretty small amount of time because it's annoying to get small things to work like paths so it just ends up being really boring and you end up quitting most of the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately, an instant uninstall. Simply building a path is extremely difficult, and controls to even build a toilet are very jittery and inconsistent. I was able to build one flat ride, but all of this took over 30 minutes. Maybe it's the lifelong RCT player in me (I mean, I'm sure it is) but I just can't tolerate it. Refunded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the most unituitive coaster games I have played. It seems very unfriendly to the player. There also seems to be a severe lack of content. I'm assuming its another game that has most of the content locked behind paid DLC's. I'd honestly skip this and play one of the old coaster games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most irritating building system ive ever used, grid system is so inconsistent and problematic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been trying to play this tycoon game but it's just so boring. I love JWE 1 and 2 but for the life of me I just cannot get into this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The complete lack of an interactive tutorial, whether specifically selected or as a copilot to your first scenarios, is a frankly crazy choice for a game like this. Some games it's excusable to have a more sandbox learn-as-you-go process, but what stopped me from even trying to persevere was the UI scaling. I'm on a 1440p monitor, nothing that crazy. All the thumbnails for items and most UI elements are extremely blurry as if they were upscaled from something as bad as 480p or 720p. Maybe this is less noticeable on a 1080p display? Either way an immediate deal breaker unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "O gráfico é bonitinho, mas meua migo, os comandos são uma merda, fazer \"estrada\" ou caminhos é simplesmente terrível, os atalhos são ruins, mover, girar, selecionar as estruturas é horroroso, nenhum jogo tem a qualidade e nem o charme de Roller Coaster Tycoon 1 e 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so terrible, I wish I could get a refund. Even the basic controls are so bad, it turns any new play away. If you look for a good coaster game, get the most famous Roller Coaster Tycoon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like slow build up games, detailed building options and don't mind figuring out building options and controls bit by bit by yourself while the park is constantly running and you have to deal with occuring problems on the side, then this game might be for you. \n\nTo me personally it felt rather tedious. Snapping grids can be janky and tricky to figure out. The constant flood of notifications was a bit annoying and according to those I was only doing it right if everything in my park was free or underpriced. \n\nOne more point which i can't hold against the game because I could have found that out prior to buying it: \nWhile you can build roller coasters however you like, the roller coasters measure things like Nausea and G-Forces and cannot open for visitors if those exceed certain values. So you can build freely but only use the \"more harmless\" ones.\nYet again, this comes with a whole testing map mechanic that shows you which parts of the ride have which problem so you can fix it which is quite neat if you are into that. I personally just expected something with a bit more freedom in terms of making my visitors empty their stomachs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Planet Coaster game made me realise it's more the business management side of things that I enjoy than the intricate designing of rides. This game doesn't really scratch that itch. Don't get me wrong, I enjoy laying out rollercoasters, but when you have to spend ages fiddling with a track until the game deems it safe, the fun kind of evaporates. The rides that you do build require even more time theming them or everything just feels generic. If you have hours to spend designing and theming rides, then you'll probably get a lot out of it, but at a base level I didn't enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No in-game tutorial. You're just thrown in, expecting you do know what to do?\nThere's a tutorial videos option in the menu though... But it opens a youtube playlist that doesn't exist anymore...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls for pc are so bad and its really hard to navigate, get the console version instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty decent theme park simulator that has been ruined by temporary license deals for DLC. These DLC have become widely used on the steam Workshop, and have and will be removed in the future, leaving you unable to use the mods in the workshop without paying for a subscription service.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}