{
  "positive": [
    {
      "review": "Borderlands 2 is still phenomenal. The only thing that changed is the number of people pretending they have a law degree. And yes, you can safely ignore the doom-posters yelling “spyware”. Half of them never read a EULA in their life, the other half latched onto a big word and decided they’re federal investigators now. They skimmed one Terms of Service screen, panicked, and started preaching like they uncovered a government op. These are the same people who click “Accept All Cookies” everywhere and then act shocked that companies collect data. The game didn’t turn into a CIA internship. They just learned what a TOS is.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "I wasn't expecting much when I started playing Borderlands 2 after finishing the first game. The first game was a nice first person shooter Diablo 2 style looting and levelling up affair for me and that is fine. More of the same in the sequel would have been completely okay by me, however the sequel improves upon the original in nearly all aspects.\n\nFirst up is the combat, the enemy varietly and AI behaviors have been improved significantly compared to the first game. The weapon animations and feedback and even the weapon models are quite a bit more varied and feel really fun to use. The core shooting part of this first person shoother somehow manages to stay fresh and exciting even a hundred hours into the game.\n\nSecond improvement is the story, now the first game didn't have much of a story to begin with, it mostly had some vibes and quite a lot of desert atmosphere, which I enjoyed, but I wouldn't want to spend a hundred hours in multiple consequtive character playthroughs. The second game actually introduces a crazy cast of villans and heroes, a ton more varied biomes, plus adds personality and story to already existing characters from the first game and actually has a plot and story that has ups and downs and some twists. I mean don't expect Disco Elysium levels of story and writing here no, but for a silly game about shooting a lot of things, this game has no right to have such an interesting story with a cast of characters this engaging.\n\nAnd finally the loot system is completely overhauled. Weapon classes have distinct characteristics and on top of that weapon manufacturers have distinct characteristics in their respective weapon types. Add on top of that the randomly generated weapon parts system, and you have an insane loot table that can generate Epic and Legendary weapons that you actually want to use with the higher difficulties.\n\nHowever not everything about the game is amazing, at launch this game had performance issues (oh look Borderlands 4 also has those) and years down the line more powerful CPUs can indeed brute force through the optimization problems, but can't create miracles. I went back and tested the game with an era appropriate 2014 powerful gaming PC (with a dedicated PhysX card) and I was dropping frames down to 30s with averages around 60. Using my 2023 machine I was dropping frames down to 60s with averages around 150. The fix for the abysmal performance is using a modern translation tool called DXVK that translates the old unoptimized DX9 calls to more modern VULKAN. Using that, my 2014 PC went up to 85 FPS average with 60 minimums, while the 2023 PC went over 200 FPS average with minimums of 120. Oh and the game loves to crash sometimes, if you play for like 3 or 4 hours and load in multiple areas, yeah it will crash randomly, no fix for it exists unfortunately. I say you should restart the game completely every 1.5 hours of game time to avoid the nasty crashing.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Borderlands 2 is a chaotic, loot-heavy FPS with hilarious dialogue, over-the-top characters, and tons of guns to chase. The co-op is fantastic, the skill trees make each class feel unique, and the humor still holds up. Some missions can get a bit grindy, but overall it’s an addictive and super fun shooter-looter.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Superfun game. specially if you play it with friends ,it's highly addictive.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Este juego es un de los mejores juegos lotter shotter q hay incluso 13 años después de su lanzamiento\n100% Recomendado",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Borderlands 2 is a first-person shooter with an amazing world, a huge variety of weapons, and tons of loot, The story hits way harder this time, and Handsome Jack is incredible villain , The game is a big improvement over Borderlands 1.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best free game I have played on steam so far. I have been playing games for several years with a keyboard and mouse, and this was the first game I played with an Xbox 360 controller with my PC.  What a blast, the various weapons, and side quests and game mechanics are great. I am currently at level 12 with the character Zero, such fun!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fantastic looter-shooter with sharp humor, memorable characters, and tons of guns. Co-op is a blast, and the world is full of personality.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fantastic Co-op, Action, Role-Playing, First Person Shooter! Borderlands 2 is a classic that I had the joy to play with various friends years back. As introduced, the game is truly a mix of various genres, a pioneer for its time. The gameplay loop is very sadisfing, with a constant progression that introduces new abilities and many, MANY, different weapons. The story is not half bad, with quests that do not take themselves too seriously. Aesthetically I always appreciated the cel-shaded direction, now iconic of the franchise. Borderlands 2 is a well achieved sequel, to this day enjoyed by fans!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Played it when it first came out on the X360, and enjoyed it.  Completed the game multiple times with each of the characters, and never found any reason to hate the game.  Sure as time went on, I got bored of the game, but that's because of how long I've played the game, and also because I've done everything the game has to offer.  If you decide to get it, it'll be a long while before you did everything there is to do, and get bored of the game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game that still is a drug to me when it comes to RPG Shooters. Borderlands 2 is the most funniest from the series personally even though the Pre Sequel is just as fun just a shorter experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a pretty fun game for its age. Graphical effects are definitely lacking but the animation and textures are fine. Gameplay loop is satisfying under the right conditions.\n\nGameplay is pretty simple at the start, you can run, aim, shoot, melee, plus special ability. Depending on the character you pick you can unlock additional abilities which are pretty fun to play with,\n\nHowever, like most older games, things get repetitive after a while. I found it started being a slog when attempting to farm for weapons, and trying to do all the side missions didn't feel as rewarding as it should, being that I received mostly pistols and shotguns for unique weapons which I didn't need.\n\nOverall it's a great experience for the Borderlands franchise if it's on sale, the main villain Jack made want to punch his oh-so-perfect face so there's that. And nothing beats seeing a legendary pop out of nowhere.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best borderlands game in my eyes, very fun. good comedy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yeah i played borderlands 3 first but i am loving this to friends got me to play it with them... i am glad its a nice game to play like fallout just a lil more crazy lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Couldnt imagine a bettter looter shooter experience. Borderlands at its peak with or without dlc. Wish they could capture some of its essence in further games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS FENOMENAL AHH GAME IS ONE OF THE BEST OUT OF THE FRANCHISE INCLUDING BORDERLANDS 4 WHICH I RECENTLY GOT, BORDERLANDS 2 MAYBE HARD AT SOME TIMES BUT THERE IS ALWAYS ROOM FOR IMPROVEMENT DEFINETLY COP THIS GAME IF YOU CAN IT IS AMAZING, 1,000,000/10 . WELL FLIPPIN DONE 2K YOU GUYS ARE THE BEST, PEACE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game and it has a good amount of content if you can get it at a discount its a great time for the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just started playing the game after hearing about Borderlands and boy, is it worth the hype. I was told to play the second one, because as people say \"It is the best.\" I can safely agree \"it is the best.\" even though I have never played another Borderlands game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "U aint beat this game until u get perfect hide of terramorphous (1th Try) Totally legitly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. \r\nProlly the best Borderlands game in the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game from the Borderlands franchise and the one I've found myself coming back over and over again during the years. If you can get them , also buy the DLCs , as they are some of the best Downloadable Content ever created. Assault on Dragon Keep is the best one IMHO , but the others are really good nontheless :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "most fps games get boring but the game play jokes world and story make a vary fun game also cl4p trap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most unfunny game I've ever played but the gameplay makes up for it. Not a super long game but you'll enjoy it if you find the gameplay loop to be fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played any Borderlands game before other than this one, but wow, this game makes me wanna get into the franchise very soon enough! The GamePlay to the artstyle, all of these look great. Also, one thing, I don't think that you guys should believe in the \"spyware\" crap, because it's not. It's not that hard not to cheat. I'll definitely get into the other games from this franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is JUST OKAY. \n\nDon't get me wrong, the guns are great, weapon diversity is an awesome thing to have, and this game profits off of it. But as far as modern games go, this game only delivers some elements. The cutscenes feel really half-baked and the movement is way too basic. \n\nThe fact that this game has iron sights for EVERY gun is nothing short of amazing. The detail in this game is awesome. I just wish it didn't call itself a \"looter shooter\", because the only \"looting\" you can do in this game is for more guns, ammo, or health, and occasionally some shields or class upgrades, but that's it. There's no crafting system in the game, and the GUI feels really difficult to navigate compared to most games. The enemies do feel like shooter game enemies, but the fact that the bosses respawn is really annoying. I do like the world, and the humor is actually pretty funny. But all in all, for current game standards, this game only comes off as \"just okay\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2012 de çıkmış bir oyuna göre muhteşem haz verdi oynarken. Tek sıkıntı bazen tekrara düşüyor onun haricinde zaman ve manyak gibi öldürmeli muhteşem bir oyun. zamanında az kaçak oynamadım",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it. It is fun and challenging. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With the add ons (especially tiny tina) this is the Fallout New Vegas of borderlands. Everything after this is a downgrade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game with lots of guns and unique guns as well just don't forget \"EXPLOSIONS\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shame they never made another borderlands game ciz this one is a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Borderlands game to date, there's a grind that makes getting the drops mean something. If you like a fun shooter with tons of guns and builds to try this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is filled with different oppertunitys depending on what character you  pick and i think thtnquality is very good and i just love this game been playing it for as long as i can remember on xbox and ps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, plays on linux mint perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is a masterclass in organized nonsense. The story is compelling, the world is vibrant, and every character appears to have consumed at least three cups of chaos before speaking. The loot system ensures that you will constantly be upgrading your arsenal, even if that means replacing your beloved gun with one that fires exploding magical confetti at screaming robot bandits.\n\nHandsome Jack remains one of the most charismatic villains in gaming history, managing to insult you so elegantly that you almost want to thank him. Four vault hunters stand ready to save Pandora, though realistically they spend more time arguing over who stole whose legendary weapon.\n\nExplosions are frequent. Humor is shameless. Skags still bite. And somehow the vending machines are always fully stocked despite the apocalypse. Truly remarkable logistics.\n\nIf you enjoy frantic battles, extremely questionable physics, and laughing at jokes you absolutely should not repeat in public, this game is practically a mandatory purchase. Borderlands 2 does not just entertain—it kidnaps your free time and refuses to apologize.\n\nFive stars, would get yelled at by Tiny Tina again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "with over 3k hours on console, I can definitely say its a game of all time. normal and true vault hunter modes are a blast even with all 6 characters, the game even has a hard mode called ultimate vault hunter mode for the experts and those who know how to use a search engine. past that the gear grind and overpower levels are made for those who hate themselves if you decide on doing any of that legitimately. otherwise staying outside op levels and popping raid bosses in uvhm is where the game shines best. as for loot... what loot? this is a shooter :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even though it is somewhat outdated nowadays, still a peak first person looter shooter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very lovely game. feeling very happy to play this game. classic game forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game that took 165 hours to 100% (i wasn't focused on the achievements most of the time) with a lot to do, the story is long and you won't get bored for sure, funny jokes come up from time to time, finding good loot is satisfying, there's a lot of side quests many could call it a down side, just once the game managed to move me in the positive way in Tiny Tina's assault on dragon keep (best DLC). It was a great experience and the game itself is worth it's price despite the fact that, I have found things that I dislike which are:\r\n-As it often happens, achievements from DLC's aren't separated from the main game meaning, if you don't own the DLC's that are necessary to get a certain achievements you can't do 100% achievements on steam without buying them.\r\n-In some places hitboxes are broken and you will miss your shot because of the wall or any  other obstacle that has It's hitbox extended too far. Elemental bullets are too big making your headshots not count, it was really annoying with elemental snipers, you aim in the middle of the head, shoot, and get a body shoot because the bullet size is too big.\r\n-If you want a certain item from a quest at your current level you have to reset your whole progress on a UVHM just for the reward to be on your level, you can't replay quests any other way expect redoing a whole mode from the start and getting to it again.\r\n-You can't play without internet connection even in single player and if you have a bad connection you can get kicked back to menu mid quest or when you're at the end of killing a hard boss and once you join back you respawn at the start of the area and your whole progress expect items you collected is reversed.\r\n\r\nAnd to anyone who is talking bout bl2 taking and selling data, steam itself is taking the same data and selling it just like every other app or device that exists in this times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't really understand the story, but it's still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played way too much of this game in the last month. It might be a bit of an addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first played this game on xbox 360. since then ive beaten the game on every console, pc is the last one one the list. one of my favorite shooter looters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just legendary. By far the greatest, most iconic Borderlands game ever made.\r\n\r\n Sommin about this game just screams early 2010s. Really is a Xbox 360/PS3 coded game. Iconic villain in Handsome Jack, a character who still echo's in the lore till this day. Every character is good. Not a single dull or uninteresting playable character in this game. looting mechanics is well done too. Game is also Co-op, so you can beat the whole game with your mates if you really wanted. No other game can beat this games art style. It's so distinct and can't really be replicated (imo). Even the NPC's are iconic. The Pyscho's (dude on the cover), the Loader Bots just everything really. \r\n\r\nAnd the game has tiers to it like any good looter shooter should have. Once you beat the game once you unlock an even higher tier of gameplay in the vault hunter new game plus modes. Doing the game a big disservice only playing the base mode and nothing else ngl.\r\n\r\nOverall Rating: 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some parts of the humour might be outdated, and many cultural references are past their prime, but it's incredible how well this game holds up over a decade later.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is one of those rare sequels that doesn’t just improve on the original, it redefines it. The game delivers a perfect mix of chaotic gunplay, hilarious writing, and addictive loot hunting (yes i'm this type of gamer). Every character feels unique, with skill trees that let you tailor your playstyle, whether you prefer sniping from afar or charging headfirst into battle.\r\n\r\nThe world of Pandora is vibrant and bizarre, filled with memorable NPCs and quests that range from epic to downright ridiculous. Handsome Jack stands out as one of the best villains in gaming—charismatic, cruel, and unforgettable.\r\n\r\nOn the technical side, the cel-shaded art style still looks fantastic, and the co-op experience is where the game truly shines. Playing with friends makes every firefight more intense and every joke funnier.\r\nIf you enjoy fast-paced shooters with RPG depth, endless loot, and a wicked sense of humor, Borderlands 2 is a must-play. Even years later, it remains one of the most entertaining and replayable games out there.\r\n\r\nDLC's achievements are a bit boring.\r\n\r\nOverall a chaotic masterpiece that never gets old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]If you guys want to see the full review I made: https://cielsgamereviews.blogspot.com/2025/11/borderlands-2-review.html[/b]. I really appreciate it!\n\nSo, you enjoy a nice story, shooting, looting, and some more shooting? Then you absolutely should give the game a try. Borderlands 2 is an addictive looter-shooter with excellent gunplay, massive weapon variety, and many character builds. And, if you happen not to pay much attention to the story, that's fine. The grind won't do itself, after all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive played this game to max level several times on console and its so worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best games in the series. Claptrap really became annoying here, the cell shaded art really shines through. Leveling up has never been so much fun, and the guns, do nto get me started on the guns. Still play on the reg!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its got UHD support plays great. fun game for people who want a fast paced open world fps that isnt just story driven",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a yes\na great game, awesome story line throughout the vanilla and all DLC, combat is good, more raid boss's and DLC then BL1, and then its killed by the grind.\nway WAY to grindy, trying to get that one last peace for your build is mind numbing and you lose all interest in the game, the role chance needs to be increased and more dedicated loot sources are needed (eg the epic explosive elemental relic) FML gearbox ..... been trying to get one for weeks and still nothing.\nmost of your game is really well thought out, but the grind eclipses all the good. you might have had a better game if you didn't punish everyone by grinding this hard for gear. grinding = not fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in 20H you can finish the game, its very good but the dlcs changes the game with new weapons and more so i recommend you buy the goty edition with all dlcs for best experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is literaly my childhood, i remembre playing it on the ps3 with my cusin. very cool to play it on my pc too once in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "guys guys john carpenrter you know the guy \r\n\r\nhes doing it \r\n\r\nand you should too \r\n\r\nbecause no other game had the budget of two games \r\n\r\nlol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10. Best game i have ever played. I put so many hours of my childhood in this game. Somehow i still enjoy it almost as much as the first time Claptrap called me his minion. To me this really is almost a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is not just a game. It's a cult, it's adrenaline, it's an endless stream of guns, memes and cries of “SUPER-BAMBI!\".\n\nI went through it three times— on normal, on \"Warrior\" and on \"Vault Killer\". And every time, it's like the first time. Because Borderlands 2 is not just a shooter with RPG elements. It's a living universe where every shot is a celebration, every weapon is a character, and every boss is a spectacle.\n\nGameplay: Chaos that works\nI must say right away that Borderlands 2 is not for everyone. If you like quiet tactics, slow decisions and realistic physics, alas, absolute chaos with guns awaits you here. But if you're ready for it, you'll be in heaven.\n\nA weapon is not an inventory. It's a personality.\nThere is no \"regular pistol\" here. There are \"Pistol Song\", \"Blood Rain\", \"Plasma Nail\", \"Dancing Dead Man\" - each weapon has its own style, its own animation, its own effects. And most importantly, each of them is unique in terms of stats. Even two Magnums can be completely different: one with huge damage but slow reloading, the other with fast shooting and recoil that will send you flying.\n\nLife hack: Always check your weapon before buying or picking it up. Sometimes a \"rare\" item turns out to be worse than a \"regular\" one because it has unsuitable modifiers. \n\n🧠 Classes are not just a choice. This is the philosophy of the game\nBorderlands 2 has 4 classes (and 4 DLC classes, but we're still talking about the base):\n\nSoldier (Axel) is a tank, the backbone of the team. Puts up shields, summons mini-tanks, holds the line. Ideal for beginners.\nHunter (Maya) is a magical killer with a \"Phase Capture\". Slows down time, makes enemies vulnerable. A very technical class.\nNinja (Sullivan) is a master of melee combat and explosions. Explosive rage-based abilities. Fast pace, high risk.\nEngineer (Gage) — robots, traps, drones. Controls the battlefield. Requires an understanding of positioning.\n Tip: If you're playing alone, choose a Soldier or an Engineer. They are the most versatile. Maya is for the experienced, Sullivan is for the adrenaline rush. \n\nThe universe: sarcasm, madness and depth\nPandora is not just a planet. It's a mix of post-apocalypse, cowboy western and science fiction with a touch of absurdity. They talk like in comics here, the script is filled with sarcasm, memes and unexpected twists.\n\nThe main antagonist, Hendrix, is the perfect villain: self—confident, charismatic, with a wild way of speaking. His voice is a special pleasure. And his goal? Just to make you all become his slaves... and look cool at the same time.\n\n🤖 Feature: all NPCs are alive. They joke, they argue, they react to your reputation. I especially remember Jack, who always sticks into the ether and mocks you. \n\n📈 Progress: from \"beginner\" to \"vault killer\"\nThe level system is one of the best in the genre. You don't just rock the character — you build it. Each level gives a skill point, which can be invested in one of the three branches.:\n\nBasic ability\nSupport / Survival\nDamage / Control\nThis allows you to create unique builds. For example:\n→ “Dancing Dead” + “Phase capture“ + \"Acceleration” = You turn into a rabid killer clown who dances between enemies and kills them with one shot.\n\nAnd after level 50, the \"Warrior\" Mode begins, where everything becomes more difficult and the enemies become stronger. And then you realize that Borderlands 2 is not the end, but the beginning.\n\n🎮 Co-op: the best multiplayer shooter in history\nThe game was created for co-op. Four players — four classes — four styles of play. Together you can:\n\nKill bosses that are beyond the power of one\nExchanging weapons (and teasing each other)\nSolve puzzles (for example, in the \"Abandoned Mine\")\nJust have fun while someone shouts \"I found a legend!\" and everyone runs to him.\nThe trick: in a co-op, you can use common inventory, and this saves you in critical situations. Especially when one player has a \"Super-Bambi\" and the other has a \"Dancing Dead Man\". \n\n🎨 Graphics and sound: stylization instead of realism\nBorderlands 2 uses stylized comic book-style graphics. This is not a disadvantage — it is a corporate identity. The colors are bright, the textures are simple, but the atmosphere is excellent.\n\nSound is a separate art. The music is a mix of country, rock and electronica. The sounds of weapons are loud, clear, and full of character. And the voices of the characters are legendary. Especially Jack and Tina.\n\n💥 Bosses: not just enemies. It's a show\nEach boss is a different difficulty level and a spectacle. From the \"Bandit Boss\" in the first act to the \"Pandora's Heart\" at the end, everyone demands their own tactics.\n\n, Favorite boss: The \"Blood Dragon\" is a huge mechanical dragon that flies, shoots missiles and screams: \"I AM THE BLOOD DRAGON! I am DEATH!\"\nAnd he falls down and screams, \"NO! I DON'T WANT TO DIE!\" and it's incredibly funny and epic. \n\nThe little things that make the game great\nThe system of \"Contracts\" — complete tasks, get bonuses.\nThe ratings of the \"Vault Killer\" open up new difficulties.\nDLC content is not just add-ons, but full—fledged chapters with new locations, bosses, and plots.\nSuper Bambi is a legendary weapon that shoots teddy bears that explode within a 10-meter radius. Yes, it really works.\n❗ Cons? Of course there is.\nRepetitive locations — especially in the middle of the game.\nBuggy physics — sometimes enemies get stuck, weapons disappear.\nA limited dialog system — there are no options to choose from except \"yes/no\".\nThe end of the game may seem stretched if it is not involved.\nBut these disadvantages do not spoil the impression. They're part of this crazy world.\n\nBottom line: why is Borderlands 2 a masterpiece?\nBecause she's:\n\n Creates a unique atmosphere\n✅ Provides endless possibilities for customization\n✅ Makes every weapon special\n✅ Has a great script and characters\n Works alone and in a cooperative manner\n✅ Does not lose relevance even after 10+ years\n\nWho is this game for?\nFor those who like chaotic shooters\nFor those who want to upgrade their character and try new builds.\nFor those who appreciate humor, sarcasm and memes.\nFor those who want to play with friends and laugh together\n, The last word:\nBorderlands 2 is not just a game. It's an experience. It's a journey through a crazy planet where every day is a new fight, a new weapon, a new meme. It's a game that you can play over and over again — and find something new every time.\n\n\"Super bambi is not just a weapon. It's a way of life.\" \n\n— An anonymous player who has been trying to find the legend in the \"Abandoned Mine\" for 3 hours\n\nIf you haven't played yet, start today. If you played, come back. Because Borderlands 2 is one of the most joyful games in the history of video games. And this is not an exaggeration.\n\nPanda, you're in. 🐻🔫",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this a few months after it came out back in 2012 on PS3, playing this game on pc is like playing a whole different game i never beat it till now amazing visuals Amazing Gunplay and it feels amazing on keybaord and mouse. so much replay ability seriously.. honestly its like playing another destiny lol if you get a good group of people play explore grind levels guns and lots of stuff to do especially if you have the dlc etc.. great game man and fits right in the modern pocket still with its graphics with gun bending gameplay but still with that sense of what gaming use to be and feel like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun, but the level scaling is absolutely horrendous in TVHM and in UVHM. There is no build variety in OP levels as well, the game is very unforgiving if you are a casual gamer. You should not have to grind for hours on end just to get a gun, and to make matters worse you have to worry about getting the right parts on it too. The raid bosses are actually the worst designed bosses i have ever fought in any game, I understand that they are meant to be hard but bosses like Master Gee and Voracidous are ridiculous and most players resort to using a glitch to beat it. I am a firm believer that you should not have to play a game like its a full time job to experience all of the content in a game, and Borderlands 2 certainly misses the mark on that aspect. Even features such as having to go back to the bounty board to claim rewards for a mission or there only being one fast travel station per map just feels very dated and frustrating. This game is good I just dont think its the masterpiece everyone claims it to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People of 2025 (and the future), I'm not sure how much I recommend this. This is one of my played games, and I'd do it again. The writing in this game is phenomenal. If you want to start the Borderlands franchise with an earlier entry now that 4 is out, I do think that this will be a good starting point if you're going for story. The story in this one is the best, according to popular consensus, and Handsome Jack is a delight to listen to throughout the playthrough.\n\nThat said, if you're used to more modern games then I might recommend you start with 3. 3 doesn't have the villain quality that this one has, but still fun. The player-characters in this game are my favorite in the franchise. \n\nGo for it. This game is the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I own this across multiple platforms.\nOne of the greatest peaks to any franchise.\nIt has a villain you love to hate and want to learn more about.\nThere are a lot of funny shenanigans with just about all of the characters while also having heartfelt moments that give meaning to your actions and a story that separates it from many other games.\n\nThe gunplay is just about as smooth gets, looting is always exciting as you chase the next shiny, playable classes give players control on how they play through multiple skill trees and a giant amount of gear you collect throughout the game to further tinker your class into perfection to fit your playstyle.\n Bosses can be challenging and it all gets wrapped up with the biggest bow imaginable with a drama filled climatic boss fight that makes the player feel more triumphant than most games do.\n\nThis game also has a ton of extra side content and replayability. It is wild how much quality content can be stuffed into a single game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, lots of content for being free for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. If you enjoy farcry games then you'll enjoy this too. Alot of chaotic gunplay which i love. One thing that i dont like is that i have to complete the missions in one go. If i quit and come back i have to start all the way from the beginning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Эта часть была для меня точкой входа во вселенную борды, поэтому мое отношение к ней более благосклонно чем к другим частям серии. Данная игра у меня стоит в одной полке с теми играми, к которым я готов всегда вернуться, особенно когда наступают тяжелые времена. Геймплей всем я думаю знаком метко стреляем по врагам, прокачиваем персонажа, собираем пушки, проходим истории. До сих пор динамичный шутер с множеством испытаний, как легких так и серьезных. Хороший сюжет, с харизматичным и лучшим антагонистом в серии (по моему мнению). Как я отмечал в обзоре на 1 часть, эта тоже устаревает (ого вот это новость), некоторые мелочи могут раздражать современного игрока, но основы работают, как по мне, до сих пор отлично и все равно могут подарить много эмоций и заинтересовать игрока. Бесконечная любовь и конечно рекомендация к прохождению.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Dialogue is very good and lots of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, I bought it back in 2012 long before dlcs and didn't play much of it. Fast forward 2025 saw it sitting in my library decided to buy all the DLCs and give it a go. It's one of the best games in a very long time. I'm not keen on story but it doesn't feel like it's forced, slow paced or poorly written. The gun play imo is a bit dated vs BL3 or BL4 BUT the loot system is really solid and gives me the same feeling as playing an ARPG with item hunting for perfect rolls. If you're here from BL4 and haven't played the previous games you're in for a treat with the most memorable moments in the series and characters as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is a fast-paced, loot-driven shooter that nails its blend of chaotic combat, vibrant cel-shaded visuals, sharp and humor. \nThe game’s memorable cast—especially the villain Handsome Jack—keeps the story engaging, while its huge variety of guns and customization skill trees makes every play-through feel refreshing. \nWhether solo or with friends, the game delivers a wildly fun, addictive experience that remains one of the top looter-shooters of its generation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect nostalgia game to replay with siblings and reminisce on being beat as kids\r\n\r\nbuy it on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best game in the franchise. Many years later, still worth a play no matter what game in the series you started with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very fun game I enjoyed since childhood.  I would recommend any new players to grab a friend along to play this with them! the community is rather welcoming too and the storyline is very interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A massive step forward from the first one, but also not really. The game feels much denser, bigger, and flashier than Borderlands 1, but a lot of the content was either ok or just straight up bad.\nAnyway, I don't feel like reviewing this from scratch, so I'll just rate what feels better or worse with + and - respectively (or both if it got better and worse at the same).\n\n- Looting--+ (Getting the best equipment to drop often times requires immense amounts of grind, and some of the best items are locked behind killing the same bosses a billion times, not to mention opening boss chests/defeating certain endgame bosses only to find basic and common weapons is pretty ridiculous, but at least the rarer items feel a lot more powerful and unique)\n\n- Shooting++- (It feels better overall, although it does feel a bit floaty sometimes, plus they nerfed elemental DoT pretty significantly and unfortunately for me that was one of my favorite things about the first game)\n\n- Map design+- (Looks wise the maps are even more gorgeous, and the environments are very diverse, however they're also gigantic and walking everywhere feels like a chore, not to mention the invisible walls, confusing layouts and backtracking are as bad as ever)\n\n- Gun design++\n\n- Character design++ (Everyone is a lot more fleshed out although they doubled down on some the character tropes and it can get annoying)\n\n- Atmosphere+- (This is mostly personal preference, I prefer the grittyness of the first game but it's undeniable it feels very good here)\n\n- OST+\n\n- Bugs=- (It's as buggy, if not buggier than the first game; I swear every other time I fight a group of enemies at least one of them clips through the ground, or the AI just breaks and stops responding, or the navmeshing breaks and the enemies run back and forth, etc. plus general game bugs like not being able to progress through a quest are not uncommon)\n\n- Difficulty- (Braindead up until UVHM, then it's still braindead but also stupid difficult, all thanks to spongy enemies and getting one shotted by basic enemies, not to mention OP levels which are legitimately for masochists)\n\n- Mob design+++\n\n- Boss design++- (I'm biased because I hate fighting bosses and some of them WERE objectively 'lolwut' in terms of difficulty and general design, especially in the DLCs, but overall the bosses are cooler and feel like proper bosses)\n\n- Driving+ (Everything car-related feels significantly better although still steering with the mouse whyyyyy)\n\n- Quests+ (They feel better, less grindy, more diverse)\n\n- Enemy A.I.+ (Feels slightly better)\n\n- Writing+ (The writing feels a lot more robust and Handsome Jack is legitimately really good but it's still Borderlands, if you know what I mean)\n\nAlso, I have to comment on this game's auto-save. It's pretty awful in general, and has a few really annoying issues. For instance, sometimes my game would crash after I beat a quest and was in the process of turning it in, only for it to start the quest all over when I reloaded that save. Like, what the hell's up with that? This also used to happen in the first game, so they never fixed it apparently. Just one of the many things in this game that are very janky and scream 'spaghetti coding'.\n\nAnyway, it's a very flawed 8/10, and I still like the first one better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little bit antiquated, gameplay-wise, in some aspect, but it's a clear upgrade from the first one. What it lost in environmetal cohesion, it gains a tons more in characterization. The Tiny Tina's DLC is probably one of the best DLC that ever exist, not only for the Borderlands franchise, but for the whole gaming industry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w game firehawk mission is cool nice gameplay and fun coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Entertaining, funny, like in the wild wild west of where the heck am I again?! Definitely fun to play, fun storyline, and fun time with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good times in any borderlands game, yet to try Borderlands four.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best looter-shooters ever made. Great humor, endless guns, and still fun even after hundreds of hours on console.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi, I am a controller FPS player. Even on Steam where possible. I like the challenge inherent with using the sticks to aim as well as stepping away from a desk to lounge on a couch to play games. Borderlands 2 is one of, if not the most, refined in controls for that sort of play.\n\nBorderlands 2 is perhaps the most popular looter shooter. While that realistic is just grinding to make numbers get bigger, the way this game play loop works here; it is very satisfying. It is a little slow at the start when the player doesn't have access to any character abilities and sparse choice of weapons. However, once the player finds that one RNG weapon of death, the game really opens up.\n\nFor controller player, the game moves a leisurely pace to track enemies decently well. And the aim assist aiming down sights helps keep track on enemies on the move quite well. And the weapon variety allows for many ways to approach encounters.\n\nI'll admit that video game story writing is mediocre at best, and Borderlands 2 really go beyond that. However, it does have one of the better stories and villains in video games. The humor is certainly marmite. But it does give the game a goofy, adolescent personality that makes it a bit more memorable.\n\nBorderlands is in my personal top 20 video games of all time. And my favorite FPS because it plays so well on a controller. So, I highly recommend it to anyone that wants a sort of action rpg and looter shooter to dump tens of hours into grinding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i still think borderlands 2 i the best game of the franchise. \r\nso if you think the other game are fun you gotta play this,!! hope you will enjoy.:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "borderlands 1 if borderlands 1 was not as good but also its still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's reputation for being one of the best looter shooters is warranted. While the updates from 2K making not great decisions is not a good reputation on the game, I think it's still good to look at the game itself. It is a one-of-a-kind shooter that has such likable characters, fantastic weapons to use and a world that is unlike many others. \n\nWe introduced a friend of mine to this game as their first shooter. It will be really hard finding another game that feels anything like this game or meets the highs that Borderlands 2 does.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recently popped through a playthrough for the third time, this time trying the commando. While the game still holds up fine (snappy and smooth gameplay with unique enough classes and skills) it felt a little flat on the delivery and part of that was maybe the commando class being a little bland. Either way, still a solid 7-8/10 all this time later. \r\n\r\nPS I recommend using an effects processor like reshade to sharpen and color correct a little. The art style 100% held up to 2020s standard in 4k with good sharpening as its otherwise very washed out both details and colors wise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game, good story, epic DLCs, this game is just good overall, cool game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "16 years after release, it never fails to scratch that itch. 3 and 4 may have made a lot of improvements, but I still always come back to this one for the Nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the storyline. I'm not into multiplayer and I don't have quick twitch, so I have to enjoy actually playing the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean.. its borderlands 2.\r\nIts good. especially co-op.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak of the borderlands formula, amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like guns, puns, gore, and unlimited play-styles then any of the borderlands series will scratch that itch, I'm a die hard fan, own it across all platforms, and will always come back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best looter shooter you're going to find and the absolute peak of the Borderlands franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The action is sublime, the boss fights are fun, the weapons are varied and plentiful, the DLC is fun, just buy it and play it if you never have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still haven't finished the game, but the combat mechanics and hit feel are good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super Fun and amazing to play with people, or by yourself. The only complaint is the slow pacing at the start, very annoying to replay that part. But the best game eva",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who the hell is writing a review of Borderlands 2 in 2025? One of the best cooperative shooters of all time, also great single player and its always on sale. Also Handsome Jack or something, whatever. Buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is a high-octane, loot-driven shooter that blends frenetic action with irreverent humor and a distinctive cel-shaded art style. The game shines in its cooperative play, letting you and friends tear through chaotic enemies, complete quirky quests, and hunt for the seemingly endless variety of weapons. Each character class feels unique, and the skill trees allow for meaningful customization, making every playthrough feel slightly different. The story is surprisingly engaging for a loot shooter, packed with memorable characters and over-the-top villains. While the combat can get repetitive at times, the constant stream of loot, explosive combat, and sheer fun factor make it hard to put down. It’s challenging at moments, rewarding in its progression, and still one of the most entertaining shooters of its generation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was fun with friends, might try it again some time, since unlike borderlands 4 this actually runs on my high end pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn enjoy that much bcs I said \"hey I still have to play Borderlands 3 and ppl say thats a better game\" oh boy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i play game\r\ni reach the warrior\r\ni smash head in desk because its annoying not hard\r\ni kill jack\r\nnow i replay game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been with Borderlands since the very beginning, and Borderlands 2 is where the series truly found its soul. The first game laid the groundwork—fun but a bit repetitive, with weapons that didn’t quite live up to the hype. Then came Borderlands 2, and everything changed.\r\n\r\nMy first glimpse of it was Claptrap dancing to dub-step in the launch trailer, and I was instantly hooked. From the moment I booted it up on my humble GTX 550 Ti, I knew this game was something special. It pushed my hardware to the limit, but I didn’t care—my best friend and I grew up on this game. We explored Pandora together, laughed at Handsome Jack’s twisted humor, and got lost in the chaos of loot and mayhem.\r\n\r\nBorderlands 2 has the best story-line in the franchise, hands down. The characters are unforgettable, the pacing is tight, and the emotional beats hit harder than you'd expect from a game drenched in sarcasm and explosions. It’s also the most optimized entry for lower-end systems, which made it accessible to so many players when it launched.\r\n\r\nEven now, years later, I still come back to it. Whether it's chasing legendary drops, replaying the DLCs, or just vibing in Sanctuary, Borderlands 2 remains a cornerstone of my gaming life. It’s more than a game—it’s a memory, a friendship, and a legacy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this in 2025. Gun play is iffy at some points. Still is a very nice coop experience. Still recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play this game for the nostalgic factor and it always makes me feel like that little kid again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great! Played it when it came out back on the Xbox 360 and definitely holds up today. Such an awesome story and fun bosses/loot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BL2 has great action, wonderful mechanics, heart, and a sense of humor. The DLCs are a lot of fun, too. I've been playing this game for years and am still not tired of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is just an awesome game. The story is fun, the characters are crazy and memorable, and the humor still makes me laugh. The gunplay feels great and there’s always something new to try with all the different weapons.\n\nPlaying solo or with friends is a blast, and the world of Pandora never gets boring.\nDefinitely one of the best looter-shooters ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best FPSes of the 7th gen. Gameplay is worse than the newer borderlands games, but this game has perfect writing and some fantastic moments. \n\ngrab a few friends, and get blastin",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I load into this game I have fond memories of playing, get hit with \"accept mandatory arbitration in this thirteen year old game,\" and then was welcomed with a neon red banner advertising Borderlands 4 at the top of the main menu, which when right next to the JACK NEEDS YOU TO SAVE PANDORA VAULT HUNTERS billboard really highlights the hyperbolic corporatism that backdrops this game. Something something \"you cannot make a satirical commentary anymore because there will be someone unironically believing that\" something something. I'm just glad Gearbox had the restraint to not make it a massive pop-up like I saw with Tales of the Borderlands 2 in Borderlands 1.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "cant save guns or items? bug! , not multiplayer fighting just a half bread style AI?  what (Otto Mann) would say misdisplaced information. i want my money or better advertisment!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy the Handsome Edition of this game, the DLCs are not guaranteed to work as intended and you'll be missing out; wasting your time with both Steam Support and 2K support. Instead 2K wants you to buy the Season Pass that includes the same content you just bought. What a disappointing experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't play any of the headhunter dlc, nor have acces to certain cosmetics from Geforce Now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game sucks. stuck in the \"creating online session\" screen. couldn't even play a second. also there is no solution for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't love it, it's just a looter shooter that made the mistake of thinking being load is a personality. The thrill of the quirky weapons wears off. It's really just a sign of what would come in the sequels. Game also looks like mud most of the time. If you want to play a gun based game with quirky weapons you're better off with ratchet and clank.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They turned it into garbage. To finish the rescue mission for Roland, you now have to pay for a DLC. You know.... To play the game you FUCKING BOUGHT years ago....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borderlands 2 is certainly the peak of the Borderlands franchise, however...\n\nTake-Two Terms of Service\nUpdate on February 28, 2025 - Applies to all Borderlands games, yes, even the 13+ year old games that we've all been playing without issue until this point.\n\nUnilaterally adding a new Terms of Service to a 13 year old game that makes the use of mods a bannable offense and makes it so that they can ban you for sharing bugs or exploits. While I doubt they will use this power they bestowed upon themselves against anyone in BL2 it will certainly be in use for BL4. Randy called people who displayed bugs or mods \"Internet Terrorists\" and now that company can ban you from all Borderlands games new and old.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unplayable. Kept freezing at character creation, tried in both online and offline mode. Save your money, Randy does not need it anyways. Especially for this unplayable piece of work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, it WAS a good game, now however Gearbox has been devoured, and Take Two is using the IP to install spyware and engage collection of personal information and online activity data to such a degree that the FBI should be investigating. They even boast about it in their new terms of use. They claim it their right to \"collect data of any account related to the service\" which according to them somehow includes all web browser and mobile phone accounts, I should also point out to Valve's legal dept includes your Steam account. Then they claim right to any info they want, including but not limited to real names, dates of birth, home addresses & contact info, login & passwords, browser history, email and phone contact lists, location data from your phones, online purchase histories, and payment information, which includes your bank account and credit card numbers. Then of course they claim \"it's their right\" when they sell all of it to any who will pay, no questions asked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly im not even sure why I keep playing games in this series.\r\nI think i just feel pressured into playing all of borderlands.\r\n\r\nsee yall on borderlands 3 soon",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't waste your time (or money).\nCompletely dysfunctional on modern hardware / Windows 11 no matter how many Discussion/Forum/Youtube guides you follow to get this corpse running.\n\nSilent crash on 'Play' with no log output whatsoever.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After trying the first game (and dislike it), I hated this one too. Definitely I don't find this kind of game funny. It is very boring to play multiple times the cycle: play repetitive secondary reasons to get a slightly better gun to defeat a very bad balanced boss.\n\nThis franchise is not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is classic for a reason but also dated for a reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is as always great but today its on a 75% discount and what makes it bad is that the DLCs are all still full price. This is very unfair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid game in my humble opinion. the gameplay isn't much and the story along with the characters is just boring. If you aren't a fan of this type of game or 40+ years old to enjoy the ass spammed humour in this game, i do not see a reason to play it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I finally beat this game after neglecting to play it. I always getting side tracked and lost somewhere. So I decided to just run through it, and I dont get it. Everyone says its \"the best borderlands\" and I just think its meh, 3 was better to me, but its the same same crap. slop. honestly this franchise needs to die.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the shift key codes are a dumb mechanic. you don't find gear at all you just get it for free at a slot machine, this is stupid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2k Games are scumbags, don't buy stuff from them. They raise their prices before applying a discount so they appear to be giving you a good deal, but they are just lying to you. Boycott",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "simply too much game... maps are wayyy too big, too many chapters of the story, too many people to keep track of, not a lot of enemy variety... 25h in and feels like a second job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]Borderlands 2[/b] is essentially a loot-ARPG in FPS form, for better and for worse.  Inventory management ends up feeling like just as much of the game as actually shooting things and looting bodies.  You’re constantly picking up weapons, comparing stat blocks, balancing raw DPS with ammo types, elemental effects, rarities, and unique modifiers.  It gets overwhelming fast, but eventually settles into second nature once you understand the item pools and weapon archetypes.  Whether that loop feels satisfying or exhausting depends entirely on what you want out of the game.\n\nThe game is undeniably better with friends, but the level-scaling system actively works against co-op unless everyone stays perfectly in sync.  A friend who’s behind can’t meaningfully contribute, and a friend who’s ahead will vaporize everything before you can even aim.  That creates this weird pressure to only play on the shared save and never outside it - something that’s extremely hard to maintain as adults playing an older game.  Scheduling becomes the actual boss fight.\n\nDifficulty balance is also inconsistent.  Most of the game is a comfortable loop of looting and dungeon-crawling, then out of nowhere you hit sections that spike dramatically harder than anything before or after.  And the raid bosses - both the base-game one and the DLC additions - feel like they belong to a completely different combat system.  Nothing in the main campaign prepares you for how they fight, making them feel out of place rather than a natural extension of the challenge.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst games i ever played, i finished it but i was bored and annoyed the whole time.\r\nStory 2/10\r\nCharacters 1/10\r\nVisuals 4/10\r\nGameplay 3/10\r\nWorld design 2/10\r\n\r\nThis game sucks and i have no idea why the series is so loved.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got this for free so I guess I'm not one of the premium players who deserve this premium game. Also I think EA is spying on me now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Out of the 5 Borderlands  games I've completed for this first time these last 3 months this has to  be the worst. Worst map,  most spungy enemies, terrible writing. Like hoenstly this is  just as bad as 3 gang. \n\n1. Borderlands  1\n2. TIny Tinas Wonder Land\n3. Borderlands 3\n4. Pre Sequel \n5. Borderlands 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "all the fun of grindy lootboxes without any of the microtransactions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing special, to be frank.\r\nVisual style is nice, but it doesn't help as this game has too many problems.\r\nThe only part of the game that I truly enjoyed was DLC with Tiny Tina",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First couple of hours might be interesting, but you will be met with a lot of grinding.\r\n\r\nI tried to fix this with mods, but the 'just one more mod, bro' turned this game into pure boredom:\r\n\r\n* Exp Adjuster: you need to somehow optimize the values so you're progressing at a fair pace. I don't have time nor the willpower to do it.\r\n* Sprint Adjuster: because running is too damn slow, but then it ruins the combat (makes it trivial).\r\n\r\n... and so on.\r\n\r\nI would rather have 60 hours of pure fun on some indie roguelike than +1000 hours on Borderlands 2, TBH. Quality over Quantity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They never bothered to make it possible to adjust your mouse sensitivity below 10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thank You So Much Take Two for taking one of THE games of my childhood, and infesting it with spyware that messes with mods, fixes, trainers, etc.\n\nIN A PVE CO-OP GAME. \nNot a day goes by that I'm not glad I checked out of being a Borderlands fan.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good Game but. DON'T BUY HANDSOME COLLECTION IT'S A SCAM YOU AIN'T GONNA GET ALL THE DLCs ! i have vault hunter pack 1 and 2 but i can't get past 61 some dlcs/files are missing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crash on start new game \nshute game anyway lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am a fat jewish chud and I love this game please updoot me",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i thought it was cool, not sure now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is garbage clowb.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not going into spyware games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a fun gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Randy Pitchford needs to STOP TALKING",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go read this review: https://steamcommunity.com/id/vcxzvxzcvxczadsadsqw/recommended/49520/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The new EULA has retroactively added multiple anti-consumer practices. This is illegal. The EULA is a form of contract, and all signed forms of this contract have to be upheld, you cannot change it later and force me to sign it in order to play this game. \n\nThis is my favorite game of all time, and now I can no longer play it, unless I were to pirate it to circumvent the EULA.\n\nIf buying isn't owning, pirating isn't stealing.",
      "voted_up": false,
      "votes_helpful": 352
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 252
    },
    {
      "review": "I played this game for years and now I won't be able to unless I agree to an EULA that is insane.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "New Eula spy software in the game\nTake-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "This review is not counted in the overall review score because this user activated the product via a Steam key, received it as a gift, or via a temporary free license\nNot Recommended\n12.9 hrs on record\nPOSTED: 12 OCTOBER\nTake-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "Well, ol' Gearbox and 2k decided to rollout a new EULA which takes most of our rights away. They don't want us gamers modding their precious highbrow art and apparently they are going to treat the game install as spyware when it comes to our system info.\n\nShucks. Guess I'll skip the cringe millennial writing of the next installment. Here I was all ready to girl boss it up.\n\nShame too because there's a lot of good things going on with this actual game. I'd love to go into detail but 2k hasn't accepted my review EULA terms yet so that's a no go.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This isn't a bad game, but it's owned by an idiot I don't want to support any further.\r\n\r\nHere are some actual quotes from Randy Pitchford, the co-founder and CEO of Gearbox Software who made this game.\r\n\r\n- “I would not put a Ferrari engine in a monster truck and expect it to drive like a Ferrari.”\r\n- “If you’re not 4K stubborn and just want to have a great, fun time with higher perf, please consider running at 1440p resolution.”\r\n- “With Borderlands 4, every PC gamer has a LOT of tools to balance their preferences between FPS, resolution, and rendering features. If you aren’t happy with the balance between these things you are experiencing, please tune to your preferences using the tools available to you.”\r\n- “Every PC gamer must accept the reality of the relationship between their hardware and what the software they are running is doing.”\r\n- “We just don’t worry about the hate … that’s actually a different form of love. If someone’s commenting, they’re invested, man, they care. They’ve spent their time … So I use that as fuel.”\r\n- “If you’re a real fan, you’ll make it happen.” (on the original $80 price)\r\n- “Borderlands 4 is a premium game made for premium gamers. Just as Borderlands 4 cannot run on a PlayStation 4, it cannot be expected to run on too-old PC hardware … if you’re trying to drive a monster truck with a leaf blower’s motor, you’re going to be disappointed.”\r\n- “Code your own engine and show us how it’s done, please. We will be your customer when you pull it off. The people doing it now are clearly dumb and don’t know what they’re doing and all the support and recommendations and code and architecture from the world’s greatest hardware companies and tech companies working with the world’s greatest real time graphics engine coders don’t know what you seem to know.” (For clarification, Gearbox did not code their own engine, they used Unreal Engine 5. UE5 was coded by Epic Games.)\r\n\r\nAnd finally, a message from Randy that I equally and whole-heartedly support for any game.\r\n\r\n- “Please get a refund from Steam if you aren’t happy with it.”",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Take-Two and 2K games have updated all their games Terms of Service, turning this game as well as all of their other games into literal spyware.\n\nImportant Info in Terms of Service:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration clause and a waiver of class action and jury trial rights for all users residing in the United States and any other territory other than Australia, Switzerland, The United Kingdom, or The Territories of The European Economic Area\n• You can be banned for using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Sadly the new EULA sucks pure acid, ruining a masterpiece of a game.\nThe whole 'you pay money to get the game but don't own it' type of sh*it.\nAllegedly 2k spent too much time with real life Krieg - the conductor of the poop train.\nSo yeah, keep that in mind, when you think about getting any of the Borderlands games.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Borderlands aka Take-two and 2K games have updated their games even their older games. THIS INCLUDES COLLECTS USERNAMES AND PASSWORDS, IP LOCATIONS AND BROWSER HISTORY DATA.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It pains me to negatively review a Tintin game since it is one of my favourite comic series. It's been like thirteen years since we last got the Steven Spielberg directed Tintin movie and the awesome tie-in game so I was eagerly looking forward to this one. But this turned out to be a disappointment. None of the mechanics are smooth, not the running, the driving, the flying, the stealth sections, nothing. The worst part? Tintin isn't even in this one. A big no no for Tintin fans.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Has spyware and bloated crap like advertisements on the main menu downgrade to 1.8.5 or 1.8.4 to remove.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "\"Premium game made for premium gamers\"\n\n- Douche Nozzle https://youtu.be/KifbS7fclGw?si=g3YxUuRJa1nBF0Z3&t=342\n\nOn the Recent accusations from the Gearbox Software CEO, saying people to fix your issues and use DLSS, I'am changing all my Reviews toward Borderlands Games Permanently to not Reccomended.\n\nThese Series is not Worth your Time nor your money even if it's on a 99% off, do not support this group of Developers, they are vampires that do not care about customer service and only blame players for any performance issues or par-experience you have with their games.\n\nSo, as a God Loving Man i shall Not Reccomend this game Now or Ever till the End of Times. Support Gamer Rights, not the Heartless Companies.\n\nInsight: https://www.youtube.com/watch?v=rv3FxbBUcVM",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "624 hours or 13 years of gameplay. they changed the eula to steal your data passwords/search history/location/ EVERYTHING.\r\n\r\nAVOID LIKE THE PLAGUE",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I regret ever giving a dime to this company. Randy Pitchfork and his employees actively hate their own player base. Is the game fun? Sort of. Do I recommend you pay for it? No.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I load into this game I have fond memories of playing, get hit with \"accept mandatory arbitration in this thirteen year old game,\" and then was welcomed with a neon red banner advertising Borderlands 4 at the top of the main menu, which when right next to the JACK NEEDS YOU TO SAVE PANDORA VAULT HUNTERS billboard really highlights the hyperbolic corporatism that backdrops this game. Something something \"you cannot make a satirical commentary anymore because there will be someone unironically believing that\" something something. I'm just glad Gearbox had the restraint to not make it a massive pop-up like I saw with Tales of the Borderlands 2 in Borderlands 1.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I like they style.\r\nBut it's not a Rpg. It's just full on action and very Headache inducing!\r\nLoud and fast ...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every Borderlands games has become a billboard advertisement for the newest game that's released and the new terms sounds like the game is stealing private data too.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Randy Pitchford is a chode and your TOS are some of the most anti-consumer anti-fun garbage I've ever had the displeasure to read. \r\n\r\nI want you to know not a single iota of joy in this game was gained from anything you designed, and purely came from the fact my wife is playing it with me.\r\n\r\nClaptrap and Jack are some of the worst written characters I've ever had the misfortune of experiencing in a video game medium in a very long time. Genuinely I'm shocked you people even still have a job since none of you know how to let a comedic moment breathe long enough to land properly. \r\n\r\nAlso all of these updates and you couldn't make a \"skip the lame tutorial\" QoL option so people don't have to slog through Claptrap's nonsense in the frozen butt wastes of Pandora multiple times? How can you claim to care about us when you can't even respect our time lmao\r\n\r\nAnyway it's basic ass gunplay that is vastly outperformed by anything else that came out after; in fact if you want a BL2 that has better movement and proper melee options go play Shadow Warrior 2.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Its a good game. However updating terms of services after purchase is complete BS. No one who has physical copies of the game should be shut out from playing due to an update.  This scummy behavior and predatory direction is disgusting. Shame on those who do not support consumer rights.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cannot recommend playing this game or any other borderlands title with its current end user licence agreement.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "EULA of pure greed and disappointment on an otherwise great and fun game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is great, love the graphics and the details.\nexcept loading in the online servers are like 8kgs of nightmares souls stuck in those creates.\nForced to use Hamachi to host LAN servers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fake advertising, the lands don't really have a border so immigrants can get in unfortunately.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "downloaded it again to play with friends and its laggy as f**k (open a loot box of ammo and it takes 1-3 sec to show the loot) and the frames drop from 130 to 20 in fights with the settings on medium. i dont know what they did but its not the game i remember.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm not a fan of the level system it's quite boring and the guns are just not it idk why but I personally just can't enjoy this game i try tho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck Randy and Gearbox. Make well optimized games and stop blaming consumers for the flaws of your own products.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the level assistance is so wack and you have to do a lot of side ques to reach a certain level to do the main story y. than when  you do part of the main the story the levels even go higher for the enemy. So guess what that means a lot of  sidequest to reach that level so you dont get down so easily. you really cant enjoy the story foral.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "cant save guns or items? bug! , not multiplayer fighting just a half bread style AI?  what (Otto Mann) would say misdisplaced information. i want my money or better advertisment!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First couple of hours might be interesting, but you will be met with a lot of grinding.\r\n\r\nI tried to fix this with mods, but the 'just one more mod, bro' turned this game into pure boredom:\r\n\r\n* Exp Adjuster: you need to somehow optimize the values so you're progressing at a fair pace. I don't have time nor the willpower to do it.\r\n* Sprint Adjuster: because running is too damn slow, but then it ruins the combat (makes it trivial).\r\n\r\n... and so on.\r\n\r\nI would rather have 60 hours of pure fun on some indie roguelike than +1000 hours on Borderlands 2, TBH. Quality over Quantity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not buy the Handsome Edition of this game, the DLCs are not guaranteed to work as intended and you'll be missing out; wasting your time with both Steam Support and 2K support. Instead 2K wants you to buy the Season Pass that includes the same content you just bought. What a disappointing experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game still has issues with retaining game data kinda cringe they didnt update it one last time to prevent that before stopping support.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't play any of the headhunter dlc, nor have acces to certain cosmetics from Geforce Now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanted to try this game since I got it for free but it struggles to run, can't play 1920x1080 so looks horrible, after the loading screen finished I crashed. Wouldn't recommend buying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game story is good. But the game experience is sooo bad with all the spiky, lagging on my high end PC. It's hilarious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game sucks. stuck in the \"creating online session\" screen. couldn't even play a second. also there is no solution for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't love it, it's just a looter shooter that made the mistake of thinking being load is a personality. The thrill of the quirky weapons wears off. It's really just a sign of what would come in the sequels. Game also looks like mud most of the time. If you want to play a gun based game with quirky weapons you're better off with ratchet and clank.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Borderlands 2 is certainly the peak of the Borderlands franchise, however...\n\nTake-Two Terms of Service\nUpdate on February 28, 2025 - Applies to all Borderlands games, yes, even the 13+ year old games that we've all been playing without issue until this point.\n\nUnilaterally adding a new Terms of Service to a 13 year old game that makes the use of mods a bannable offense and makes it so that they can ban you for sharing bugs or exploits. While I doubt they will use this power they bestowed upon themselves against anyone in BL2 it will certainly be in use for BL4. Randy called people who displayed bugs or mods \"Internet Terrorists\" and now that company can ban you from all Borderlands games new and old.\n\nImportant Info in ToS:\n• Mods are a bannable offense\n• Display of Cheats/Exploits is bannable\n• Forced arbitration so long as it is permitted in your region\n• You can be banned for the using a VPN while connecting to online servers\n• Cannot access game content on a Virtual PC\n• Best last they reserve the right to modify this Agreement, in whole or in part, at any time\n\nA company who's CEO was accused of leaving a USB with illegal material on it as well as sensitive data of Gearbox/2K partners in a medieval themed restaurant wants all your delectable data and will never let anyone gain access to your data intentionally or not. ᴾʳᵒᵐᶦˢᵉ\n\nCollected Data Types:\n• Identifiers / Contact Information: Name, user name, gamertag, postal and email address, phone number, unique IDs, mobile device ID, platform ID, gaming service ID, advertising ID (IDFA, Android ID) and IP address\n• Protected Characteristics: Age and gender\n• Commercial Information: Purchase and usage history and preferences, including gameplay information\n• Billing Information: Payment information (credit / debit card information) and shipping address\n• Internet / Electronic Activity: Web / app browsing and gameplay information related to the Services; information about your online interaction(s) with the Services or our advertising; and details about the games and platforms you use and other information related to installed applications\n• Device and Usage Data: Device type, software and hardware details, language settings, browser type and version, operating system, and information about how users use and interact with the Services (e.g., content viewed, pages visited, clicks, scrolls)\n• Profile Inferences: Inferences made from your information and web activity to help create a personalized profile so we can identify goods and services that may be of interest\n• Audio / Visual Information: Account photos, images, and avatars, audio information via chat features and functionality, and gameplay recordings and video footage (such as when you participate in playtesting)\n• Sensitive Information: Precise location information (if you allow the Services to collect your location), account credentials (user name and password), and contents of communications via chat features and functionality.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This will be both my first and last Borderlands game and I will not be finishing it. I am glad that I had some expertise helping me and didn't fall into the I'm just gonna do the main story quests only but, that still doesn't make things easier. I know people will disagree but a game like this needs difficulty options because I find that most of time I am playing I am stressed and not having fun. Not only do you have to have your character build just right, but the weapons are a problem. You need to have weapons that are at your level or maybe one level below you to be effective but, weapon drops are all RNG on what level they'll be and if they even be better than what you currently have so, sometimes the game just fucks you over which causes you to die a lot because your weapons are basically ineffective. I wanted to like this and complete but, it's too much stress in my life to do so.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I just went through this game again.  Borderlands 2 hasn't significantly changed from Borderlands 1.  It still has major problems with invisible walls and stops your movements for no valid reason when walking / running between elevations.  It still has insufferable delays and bad targeting when picking up items.  It still cuts the timer down every time you lose all your HP, so free-for-alls are death, and sniping is the only legitimate way to pay the game.  It's easier to shoot the helmets off the goliath enemies and let them berserk-attack everything around them than to fight them yourself.  There was one quest I never managed to find the trigger for, since none of the characters in the region had the exclamation point (!) showing where to activate it.  The classes aren't as good as the B1 classes, either.\n\nOne of the worst things is a grinder later in the game - if you accidentally drop one of your good items in the grinder, it's gone forever.  I know, I lost my best SMG by accident because it destroyed it.  No recovery possible, even though it was supposed to only chew up shield items.  You get nothing from grinding anything else.\n\nThis game is basically just like Borderlands 1 with a slightly better storyline (Jack is one of the best-written antagonists ever), but that really isn't enough to justify playing the game.  Also, we know from B1 that Roland used the New-U and Fast Travel systems.  So, when at a certain point, he is *permanently killed*, it makes ZERO sense at all.  Also, if Hyperion runs the New-U system, why doesn't Jack just shut it off for Pandora and solve the problem really quickly?  The story doesn't make any sense.  Like I said for B1, it's Serious Sam but without the seriousness.  Find another FPS, this one gets boring and frustrating very quickly.\n\nSpoiler:  The Pre-Sequel is just as bad, and no, I'm never buying B3 because of the Epic Exclusivity it had (dumping on Steam users), and I'm not buying B4 until Randy Pitchford is fired.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've tried this game more than four times, and I always end up thinking that I've wasted my time. It's the most overrated video game series so far, imo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Well, it WAS a good game, now however Gearbox has been devoured, and Take Two is using the IP to install spyware and engage collection of personal information and online activity data to such a degree that the FBI should be investigating. They even boast about it in their new terms of use. They claim it their right to \"collect data of any account related to the service\" which according to them somehow includes all web browser and mobile phone accounts, I should also point out to Valve's legal dept includes your Steam account. Then they claim right to any info they want, including but not limited to real names, dates of birth, home addresses & contact info, login & passwords, browser history, email and phone contact lists, location data from your phones, online purchase histories, and payment information, which includes your bank account and credit card numbers. Then of course they claim \"it's their right\" when they sell all of it to any who will pay, no questions asked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels very dated even for a game from 2012 (there's countless fps games that are better in every way that came out earlier), ugly post apocalypse wasteland aesthetic, guns are massive slow have horrible recoil and have horrible iron sights, open zones/world design seems completely randomly generated, despite being 13 years old it still has progression breaking bugs that require restarting missions, bosses are giant bullet sponges, I have no idea why people say this has a good story (if you say it only gets good later, then it's not a good story).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brain melting cooperative fun. Story and characters that are only mildly annoying. Can't recommend because I think I've outgrown this type of game. Every time I try to play a borderlands game now I feel my IQ drop which is impressive because it's gotta be pretty close to 0 at this point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't waste your time (or money).\nCompletely dysfunctional on modern hardware / Windows 11 no matter how many Discussion/Forum/Youtube guides you follow to get this corpse running.\n\nSilent crash on 'Play' with no log output whatsoever.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After trying the first game (and dislike it), I hated this one too. Definitely I don't find this kind of game funny. It is very boring to play multiple times the cycle: play repetitive secondary reasons to get a slightly better gun to defeat a very bad balanced boss.\n\nThis franchise is not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is classic for a reason but also dated for a reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is as always great but today its on a 75% discount and what makes it bad is that the DLCs are all still full price. This is very unfair",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely mid game in my humble opinion. the gameplay isn't much and the story along with the characters is just boring. If you aren't a fan of this type of game or 40+ years old to enjoy the ass spammed humour in this game, i do not see a reason to play it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Wildstar FPS complete with repetitive fetch and kills with West Virginia hillbilly voice acting as the only glue desperately trying to hold it all together. \n\nYAWN.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2k Games are scumbags, don't buy stuff from them. They raise their prices before applying a discount so they appear to be giving you a good deal, but they are just lying to you. Boycott",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "simply too much game... maps are wayyy too big, too many chapters of the story, too many people to keep track of, not a lot of enemy variety... 25h in and feels like a second job.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got this for free so I guess I'm not one of the premium players who deserve this premium game. Also I think EA is spying on me now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Out of the 5 Borderlands  games I've completed for this first time these last 3 months this has to  be the worst. Worst map,  most spungy enemies, terrible writing. Like hoenstly this is  just as bad as 3 gang. \n\n1. Borderlands  1\n2. TIny Tinas Wonder Land\n3. Borderlands 3\n4. Pre Sequel \n5. Borderlands 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They never bothered to make it possible to adjust your mouse sensitivity below 10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thank You So Much Take Two for taking one of THE games of my childhood, and infesting it with spyware that messes with mods, fixes, trainers, etc.\n\nIN A PVE CO-OP GAME. \nNot a day goes by that I'm not glad I checked out of being a Borderlands fan.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is awfull not new player friendly. one zone you're on level hardly able to kill enemies next zone you're 3-5 level under the weakest rats on the ground that all the sudden one shot you if you aren't miles away from there hitboxes. and don't even get me started on projectile enemies that you cant even see shooting balistic missiles and nuclear warheads at you while spawning war robot to brain f*ck you because in the games you're health bar never goes up. People say its the shining light of the series, those people are blinded by nostalgia, borderlands 3 main story may not be better but in terms of dlc and bosses, AND ACTUALLY enjoying the game play bl3 is far better than this trash. games total horse d*ck play if like c*ck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you need to play whole mission before quitting. if you save and quit, you restart from the start of the mission. For someone who has an hour or two to play sometimes, this kills the game. If you do not have enough time to finish the mission, you basically have to start it from the beginning every time. Yes, your levels and weapons are saved, but grinding the same mission again and again just because you did not have enough time to play last time starts to really annoy. Otherwise the game is fine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unreal how glitchy this game is after all of these years. All the help forums: yes, it is glitchy. yes, it sucks when you reload you have to redo an hour of backtracking....",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}