{
  "positive": [
    {
      "review": "State of Decay 2 is a game I wouldn't describe as a survival game since things like hunger and thirst are passively controlled. SoD2 is a mix of action, looting, stealth, fetch quests, and trading with some light base building elements. I've already beaten three maps in campaign mode and I want to start another. Highly addicting game play and easily in my top 3 zombie apocalypse games. It also plays great on Steam Deck.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "big boy juggernaut explode and kill me but its okay i forgive him",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Really good base building mix with some decent gameplay",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "one of the best zombie survival games in my book. super immersive when it comes to community building, looting, and slowly taking over the entire map. the game really pushes you to juggle more tasks than usual, so planning ahead is a must\n\non Lethal difficulty, everything becomes a risk - literally everything. it makes the game way more fun, tense, and exciting, because even the smallest, dumbest mistake can get your current survivor killed\n\nit’s not as story-rich as the first game, but it definitely improves in a lot of other areas. a solid experience overall! can’t wait for SOD3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game, really hope the launch with the third one goes well... \nXbox really sucks for what they are doing to the dev team, and by xbox I mean the POS CEO in charge of xbox :<.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "pretty solid game.. just wish i wasnt restricted to a certain amount of outposts and survivors",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Before you buy:\n\n- The game has finished all update support with Update 38\n\n- If you own an Xbox copy and sync your progress, all of your Xbox achievements will immediately pop up here, too\n\nIf you have any questions, ask them below.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game certainly has its pros and cons. It is a decently fun game but not as fun as its original. It is one of those games that kind of lost some of its original fun due to it being a multiplayer experience. Honestly, If I had been able to play it with friends, I probably would have absolutely loved it. As a single player game, its a bit tedious at times. Still fun but the side quests sometimes are annoying as they are time based and pause whatever it was you were doing previously. At least there is a lot of game here with a ton of content. The gameplay is fun enough but the story is quite lacking to benefit the multiplayer game. If you enjoyed the first game and zombie games in general, then this is a nice cheap game to buy on a good sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recruiting survivors to meet the minimum requirement for a base just to send them away with nothing but a screwdriver ( we've all done it )",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've put hundreds if not thousands of hours on my xbox copy of this game. One of the best zombie survival games ever put to screens.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fun to play open mapped base management game  that takes place in the mist of a zombie apocalypse.\r\nBut this time it comes with the option for co-op and follows up the previous story. 😎👍",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game, the dev support have been phenomenal! Can't wait for State Of Decay 3, baby!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's quite the fun and it's not heavy on the PC. Different campaigns and roads to pick and explore throughout the game. A lot of Steam achievements available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "completely done with the game in like 7 hours. I mean it is great, not half baked one but still have so much more to improve, do not know I'm that harsh but I love the building type control npc and make a commuties so I'm going to be a bit harsh on this. Overall experience 7/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As I write this review I see I am nearing 200 hours of playtime in SoD2. I think that speaks for itself, especially as I never afk'd in the game.\r\n\r\nThis is, to me, the ultimate zombie survival game. It has base building, community building, missions, a goal, an end game, vast replayability, and the difficulty scaling is great for being able to find the difficulty that feels best to you. As of now, I'm finally working on getting my nightmare legacies, but even if you just play one or two legacies in one of the medium difficulties, I think the game is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly think that this game is very thrilling and fun. Especially when destroying plague hearts, and I bielieve that state of decay 3 will be even more better with a lot of features. I cannot wait!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This zombie survival simulator is pretty fun, but if you're into rich storylines and good dialogues, you might be disappointed. Side quests have more conversational depth than some of the story missions. \r\n\r\nAlso, being in rural Oregon, why is there a Manhattan-sized population of zombies at every turn? I never get a chance to breathe when driving around. Not a huge problem once you gain enough influence to have outposts, but might feel a bit overwhelming to new players.\r\n\r\n7/10 (-1 point for the Heartland DLC ending being so disappointing)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic z-sim. Best zombie game period, in my book at time of writing. Great community and settlement building mechanics. They've worked on this game for years and years, and just released their final update recently. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one one the best survival game i've ever played😭 but its just complicated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played this for over 5 years on xbox, it is goty. i just got sick of paying for gamepass for a game i originally bought",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's awesome, lots of different difficulty options for any type of player. Game has been updated and supported for a long time. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had this on xbox and when i got the pc this was the first game i bought. SOOO GOODDDD \r\nCant wait for SOD3 lesgoo!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good zombie game with some survival and base building functions. Overall, I think it is really fun and worth getting it on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game ever since i was younger and the first one came out i always played the demo over and over again because i didnt have the money to pay for it but when i finally got it i was hooked and when SOD2 came out i got it as soon as possible I love this game to the bone this is my number one favorite game ever and i cant wait til SOD 3 comes out so i can preorder it ASAP this game can take my money all of it lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed the game.  Very much like entering Walking Dead world but maybe with more guns ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game years ago on Xbox & It's super fun to play through again on PC. Love that if you're bored of doing one thing you have so many other things you can work on and it doesn't feel pointless. You can see the advancement. Super fun & satisfying game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun building a group based on skillsets and personalities, multiplayer option is nice, a good zombie survival game as a whole. Can get a little repetitive, I suppose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Base building is super fun and the upgrades and building isnt super long or locked behind paywalls! The combat feels super good for a zombie game 1 on 1 its easy but a horde can close in on you quick. Super fun to just go randomly scavanging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good zombie game haven't played it for a while was good to play it again nothing on my account saved accept all my achievements which is weird but oh well I was going to do a new save anyway but anyway you should defo play this trust also I got it on a good sale I got the bundle of state of decay 2 and 1 and all the music for only £10:01 got to love black Friday :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A true labor of love. It really captures the gameplay loop that was so addicting in the first game. Only con is that the overall story telling isn't as good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't like that you need to have an Xbox live account just to play this game ON STEAM.\n\nStill, a fun Aoombie base building game with some depth to it. Requests and zombies surrounding your base can feel like a chore at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite zombie Survival games, being able to build Communities with unique Characters that can die, and you lose them forever is impactful.  have a base and a community, and helping out other community survivors is deeply enjoyable, and even has a decent story campaign through heartland then Trumbell Valley map. just a great overall game,  and I cant wait for the 3rd installment which might be happening in 26 sometime. hopefully",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buggy asf and no real story but the gameplay is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "State of Decay is the best zombie game franchise available. The original version was the best but this one is also a lot of fun. Looking forward for part 3. I got a lot more playtime on my Microsoft account.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played 10 hours in 2 days, I think I'm addicted, please send help...\n\nI understand people's criticism, but it just scratches an itch I had for a long time. This game is NOT a sandbox crafting game, you do not build a base like in games like 7 days to die or other crafting games, which is what I was after, so I'm quite pleased with this. I did not want to spend 40 hours building something, I just want a space where I can park my NPCs and they all feel interesting enough that I can see the story happen before me. \n\nThe only thing I'm sad about is that there is no DLC or questlines to add new leader types.\n\nGonna get a buddy to play with me and have some fun in the apocalypse :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 use to play this game on the Xbox back when I had game pass, one of my fav zombie games of all time. Even more fun if you play with friends on a harder setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best zombie survival experiences out there\r\n\r\nI’ve been a fan of State of Decay since the very first game, and State of Decay 2: Juggernaut Edition takes everything I loved and makes it even better. The atmosphere, the base-building, the tension of every supply run — it all hits perfectly.\r\n\r\nThe curveballs (updates) keep the game feeling fresh, challenging and unpredictable in the best way. Every new mechanic or balance tweak just adds more depth, and the devs continuously fixing bugs and improving the game really shows how much love goes into this project.\r\n\r\nThe co-op is fun, the community is great, the maps are awesome, and building a strong survivor squad feels just as addicting as day one. Even after all this time, the game still hooks me.\r\n\r\nIf you enjoy zombie survival, base management, or tense open-world gameplay, this is absolutely worth your time.\r\n\r\nI can’t wait for STATE OF DECAY 3 — day one buy for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gave me goosebumps. The challenging difficulty and intense horror atmosphere are unlike any other zombie survival game. I hope SOD3 will be even more impressive in terms of improved graphics, gameplay, visual effects, animation, etc. Can't wait for SOD3!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A loyal fan, unbeatable among post-apocalyptic survival games of its kind, the early stages are incredibly immersive, but it gets a bit boring later on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so unbeliavle good and unique. I never knew how badly I needed a basebuilding zombie sandbox until I played this game. Its not to the level of complexity of something like project zombiod, but it is the most freedom and strategy Ive seen from a basebuilding game with such fun melee, shooting, and driving. This game rules",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Translate This Indonesia --> eng \r\n\r\nSudah lama ku main game ini dari coba bajakan hingga beli langsung , sangat bagus kurasa ku suka game zombie yang bisa atur base seperti ini , hanya saja banyak sekali tempat di game ini yang berpotensial menjadi bangunan perlindungan , sayang hanya jadi tempat yang dapat di kunjungi tambahakn markas yang dapat di tempati dev!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the perfect zombie apocalypse game.\r\nIt's only weakness is the lack of polish and quality of life improvements.\r\n\r\nLooking forward to State of Decay 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "actions have consequences. characters will be lost.  i wish as you cleared areas they would be clear for a longer amount of time and zombies would have to come from different areas instead of just re-spawning.  other than that, this is a great game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best zombie survival open world out there. for any lover of open world and comunity building games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, first played it on Xbox when it came out back in 2020 in the spring and loved it and couldn't stop playing it since. one the few zombie games that I have enjoyed and every aspect feels so nice and no more micro transactions makes it even better, i would give this game more money if i could/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good fun Building simulation for community and looting/recruiting. Killing and stats also very nice. Wish there was more story, bigger maps and more freedom in building a larger, personalized community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played it like a kid, now i bought it for myself and still like the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an improvement on the first game and the way it adds random quests that affect the map and other people is really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What to say... I've spent many hours on it through game pass and would recommend playing it there as it's almost never on sale over here. Overall this is a great survival experience and one of those games I wanted to have to play a few hours here and there. There are great zombie games out there but still, SoD manages to do it's own thing with its only competitor being Survivalist: Invisible Strain which I personally prefer. \n\nOn the negative it requires logging into xbox and it's not aging as well as I would hope but still manages to scratch that itch, all the while the new entry in the series is right around the corner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game that showed me that maybe zombie games don't just suck. It is the AAA developers and shovel-ware barons that have disgraced the name of the humble zombie. \r\n\r\nA day/night cycle combined with skills that passively build as they're used and eventually provide branching options make for a satisfying game. It's also not afraid to punish the player for being reckless since death means that that survivor is just... gone, no respawn, no resurrection, cloning, etc. they're just another Z for you to shoot or flee from. \r\n\r\nI know the third game is coming out soon, but for now I'll be exploring what works in this game and hopefully be trying out multiplayer soon. Once I complete my stay here, I'll probably be more than happy to try another title in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the first one and now this one. I played the campaign first and realized that heartland was the continuation of the first game's story. I tried playing Daybreak, but the game crashed too consistently. Ultimately, with over 500 hours into the game, I loved the re-playability, different maps, and building bases and characters to survive a zombie apocalypse. I am looking forward and hoping for bigger and better things in SoD 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, with lots of strategy elements next to the survival core. One of the best survival and Zombie games out there. Looking forward to SoD3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. A great follow up to State of Decay 1. The building of a society in a zombie apocalypse is a very fun environment, and State of Decay hits the mark. I am looking forward to State of Decay 3, I hope they stick with the same soul of the game!\n\nAnother note, the way the developers continued providing free updates to this game for years is top tier. It blows my mind all of the major upgrades they made through the years without requiring additional payment. This is a great look for future games from this developer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its  a fun zombie game. It scratches a specific itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all time favorite games.  The different maps, bases, survivors and skillsets make no two playthroughs the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it's a great Post-Apocalyptic zombie game.  I'm having a blast rolling up to buildings in my Ranger SUV and plundering all the loot.  I'd say this game is more heavily melee oriented, but there are bunch of guns that I have found so far and ammo isn't too scare. Weapon attachments too! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't play this game much because one of my friends died of terminal stupidity, but it was fun when I did play. Thumps Up.\n\n-Just keep swimming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always good Never bad. besides the few goofy bugs but even with them its still fun.\r\n\r\ndevs always doing free updates and pushing free content. what more could you ask for ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, redownloading to see how the games held up. hopefully again great. love roleplaying with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's kinda bad, but I am a sucker for zombie survival games and SOD2 scratches that itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this kind of game. Me and my brother always plays this and talking how big our community and compare it to one another",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very beautiful and worth spending hours exploring its world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An overall nice survival game with great features of base building, survivor managment and scav. missions.\r\nIt also has great difficulty customization settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Meh its okay. boring and repetitive. the whole game is buggy and the writing/voice acting is atrociously monotone. butttt if u want an open world zombie game similar to Days Gone or The Walking Dead show then its okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Worth spending hundreds of hours on it falling in love with all your survivors. SOD3 is going to be a dream.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the one zombie game I always find myself coming back to. These days, I don’t game much, and when I do, I usually lose interest after a few minutes and shut the game off. But that isn't the case with State of Decay. The gameplay loop is just incredibly satisfying, at least to me\n\nWhat really sets it apart from other zombie games is the community-driven aspect. Most games in the genre either lean heavily into horror, like Resident Evil 2, or focus on action, like The Last of Us, and while those games are amazing in their own right, State of Decay 2 actually feels like survival. Even after months away from my PC, I can jump back in and still feel completely hooked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game i have played in a long time i love zombie stuff and i have not found a good zombie game until  now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All in all, I enjoyed my experience with this game. I think it's a fresh, not so serious take on the zombie survival genre. I think on easiest difficulty, it isn't the most challenging experience ever, however I like the way you can tailor the difficulty of the game to suit you. Turns out, I like it to be easy.\n\nI like the vast variety of weapons, I like the surroundings and I did enjoy the game as a whole, sneaking around gathering supplies, killing zombies and plague hearts. Building the base is nothing spectacular in my opinion but I didn't mind it. \n\nGood points:\n- Good variety of gameplay that rewards you/ disciplines you for your choices\n- Variety of weapons is insane\n- Maps are vast and varied\n- Gameplay is simple, intuitive but not overlay fussy \n\nNot so good points:\n- The driving characteristics / mechanics are possibly the worst driving I've ever encountered in any game ever\n- The debris on roads is incredibly annoying and unnecessary especially since it's static\n- After clearing 3-4 maps, the game does get a little stale\n- The game for me was a bit too easy on easiest difficulty, but too difficult when I moved it up a notch \n- The characters/ voice acting is soulless, there isn't much in the way of meaningful dialogue/ storytelling\n- There should be perks to wearing certain clothing items (for example Cow boy hat gives you better rifle accuracy) etc.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Phenomenal game with lots of charm fun and content. People are whining about the xbox thing but it takes seconds and while slightly annoying the game is awesome and negative reviewing over something as avoidable as that is laughably stupid.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'd recommend this game for anyone who hasn't played it before. But honestly, after only playing it for 115 hours, I've grown tired of it. It's very repetitive. Having several different maps is cool and all, but it's just the same repetitive motion in a different landscape over and over again. The updates they do aren't really worth your interest either. New clothes, a bug fix. Nothing actually exciting or worth logging on for \r\n\r\nCool game but they let it become stagnant",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this on xbox some time ago, now bought it on sale, it is always nice to come back to the memories you've had while playing the game, last time i was in school in my momma house, rn i got a job, and living on my own.\nAlso the game is super cool, I love the replayability, all those traits in survivors, the skill mastering, the fighting and weapons mechanics, love the game overall.\nA lot of peace of minds to yall in this christmas-ish time haha!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world easy access low difficulty scalable to tryhard lvl\r\nzombie killing fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played State of Decay back on the Xbox 360 with their first entry and have never stopped loving their work since!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its literally the best zombie coop game on the market",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game yang unik karena tidak ada jenis game seperti ini.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Killing Zeds with friends make happy BRAAAAINSS juice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immersive zombie survival horror.  Choose your own difficulty level.  A bit cheesy dialog sometimes but the replayability is amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am brand new to this game, however it has a very unique feel to it with plenty of different playstyles to the game fresh and fun. \r\nWould highly recommend picking this game up if your a fan of zombie survival games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "State of decay 2 is the first ever zombie apocalypse game i ever played with me having to manage my own community finding resources in different region and houses and the fact that you could change into different charachters with their own story line or quest, gamers that enjoys game that manage your own community and zombie this games fits you :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've played this game for more hours than what steam claims since I owned it on Xbox X. Very fun game and addicting if you like these kinds of games. I can't wait for the 3rd installment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes. Best zombie survival game with base management out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For years I wrote this game off as trash - I was wrong.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the best zombie game I've played in a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a great game i love the play style if i was you I'd try the game out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played lethal for like 30 minutes and i lost my whole community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than the 1st Sate of Decay; Can't wait for the 3rd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "state of decay 2 is awesome play horde daybreak is multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "okay game was a bit bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game worth playing over and over",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I want to say thank you to developers for this awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good and immersive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better souls game than lords of the fallen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It awakens my survival instincts to a great extent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "killing zombie co-op play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ONE OF THE BEST ZOMBIE GAMES I HAVE EVER PLAYED!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Zombie Survival game ever. Project zomboid is #2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only thing i don't like is the fiend tether.  take that garbage off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lets hope no 3 learnt from this game and we have the same vibe but better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really good game so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all i got to say is keep playing its fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Post ownership enforcement of third party account. Dirty, dirty practice. Essentially, after having the game for years and a good number of hours into a game I bought, I and other players have been locked out of using the product paid for, unless we want to give in and play in Microsofts little walled garden. \n\nNothing wrong with account based services in general, but to retroactively close people off from their purchased product is disgusting, and surprising that it's not considered legally dubious. I can decide with foresight if a product functions as such originally, if I want to buy or not, but to add it after years of service is just gross and deserves to at least be viable for a refund, but no. I don't want yet, another, account. So I'm effectively unable to access a product I paid for and used within EULA standards.",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "Cant play offline, or without an xbox live account. Absolutely insane.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "You need an Xbox Live acct to play.... so yea, have no idea about the game itself cuz I couldn't get past the log in. Instantly uninstalled.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A real shame... RIP goes another one to the behemoth buffoons in charge of these gaming divisions I guess?\n\nIt was a fun game, but you can't play it now. The windows account requirement won't even make an account in game or on my browser, it refused to accept me as human (a known issue lol)... and there is 0 offline options. Even the gamepass store release a few years ago could run offline mode.... \n\nI guess that explains the constant sales.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Stupid Microsoft forcing you to sign in. It's saying my password is wrong when it isn't... They ruined this game forcing you to sign in to Microsoft for NO REASON",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't know if the game is good or not but Microsoft has already ruined the experience for me. Why can't I just play co-op right away? Why do I need an xbox live account to play this?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "cant even play the game unless you have and login to xbox live acc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "State of Decay 2 has so much potential, but it’s buried under a pile of bugs and frustrating issues. The co-op experience, which should’ve been the game’s highlight, is completely unreliable — my friend kept getting disconnected from my session every 10–15 minutes. It kills any sense of teamwork or progress.\r\n\r\nThe world itself feels empty and lifeless, like there’s nothing meaningful to do after a while. Even when I finished every side quest for a community, the legacy missions took forever to appear. Sometimes I waited ages just for the next mission to trigger, which made the pacing unbearable.\r\n\r\nThe zombie designs are another disappointment. They were supposed to be scary, but most look silly — especially the Juggernaut, which comes off more goofy than intimidating.\r\n\r\nOverall, even playing with a friend couldn’t save the experience. Between the endless bugs, disconnections, and dull world, State of Decay 2 ends up being more frustrating than fun. Bad experience all around.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Played for 15 hours - seemed to die every time I did any optional mission. Clunky 3rd person view & combat, falling from the top of ladders rather than getting on the ladders. Never really had any cool/exciting moments. A shame because it could have been OK. Uninstalled.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game requires a single-use sign-in key from Microsoft every time you boot it up, and I couldn't find a way to get around this or make the sign-in permanent. Really annoying to have to whip out my phone, find an email, then plug in the code every time just to turn the game on.\n\nThe game is actually ok as a game, but every mission has a hidden timer behind it; if you don't pursue quest chains as soon as they're presented to you, you miss them permanently, and this isn't communicated clearly to the player at all.\n\nEdit: I found some mods that fixed my issue with the mission timers, so I wound up playing a bit more. However, the game quickly became repetitive and grindy. With no story to follow, I found myself having no reason to improve my base beyond getting enough materials to unlock the next base, and so on and so on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Requires constant access to MS account without providing amplifying information on what it exactly needs access to and why.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game would be great if multiplayer worked they added microsoft sign in so u cant play anymore without an xbox live account but now it says my account isnt valid :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought it on Steam, but guess what? The game asks for an Xbox account to play.\n\nWhy would I need an Xbox account for a Steam game? What’s next, a PlayStation login?\n\nCouldn’t even start playing — just endless logins and Microsoft nonsense.\n\nZero respect for players, zero sense.\n\n0/10 — I bought a game and got a login simulator instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "stupid piece of shit force logs me out of my microsoft live then refuses to let me use my own password to sign back in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "State of Decay 2 is a bug-filled mess. The game crashes randomly, missions bug out or straight-up don’t appear, and half the time it’s barely playable.\n\nThe story? Terrible. Every mission feels the same, every map has the same objectives, and the open world is just… empty. There’s nothing to do besides grind the same boring stuff.\n\nCo-op is the worst part — constant disconnects, lag, and random kicks from your friend’s world.\n\nEasily one of the worst zombie games I’ve ever played.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Force you to login with xbox account. It used to be fun game but now its unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played the first one in 2013 and really liked it; the only flaw was the lack of co-op. I played this one on Game Pass in 2019 and the co-op worked fine. Today, in 2025, I invited a friend to play and the co-op is inoperative, requiring third-party programs to maybe work. Seriously, what a disappointment! The coolest and most unique part of the game doesn't work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to say that this is not a completely fair review, I don't think this game has no worth and should be completely avoided, I personally have sunk so many hours in both the first and second game on console, so then why don't I recommened it now? Well the game is far too easy on anything other than lethal. So fo anyone who is new or isn't the best at survival or management? This game is worth the price and then some. But lethal? Is just one of the worst more frustrating experiences I have ever had gaming. The issue isn't with the amount of plague hearts or literally anything that lethal adds and changes, the issue? The combat. This game is clunky and unfair. The amount of times i have died or lost everything due to something that I could have done nothing to prevent is staggering, I had to resort to cheesing the game whenever even the slightest thing didn't go my way. So what makes everything so unfair and clunky? Well it's truely just one simple little thing, unavoidable attacks. It happens so often and in more ways than I can count, just playing this game when every scratch can result in either death or a huge cost to resources (at least early game huge) makes it so much more apparent when it does happen. Doing anything just becomes a chore when knowing you can't outplay or plan to avoid a threat that can just cheat you of everything. You can't even rely on stealth completly for so many reasons but mainly when taking out plague hearts because it can literally spawn zombies in, not that in itself is an issue. So if it wasn't for how clunky the game is I would be fine with EVERYTHING else, even the curveballs which can make killing a zombie explode and kill you instsantly. If I could rely on my own ability I wouldn't care at all, there have been many time that my own missteps have cost me greatly and you know what? I was fine with that, I didn't mind it because it was my fault. \r\nTLDR: if you haven't played the game before? Pick it up, it's fun and a cool zombie game take, just don't expect much in the way of a story. But whatever you do, don't play lethal, it's not a test of skill but of patience and luck. Unless I am missing something, maybe I have to cap the fps and everything is fixed, since I have no idea why people play lethal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only word I can say after picking up this game again after years is TERRIBLE.\nYou're forced to use MC as a platform to add and invite friends, but in an extremely complicated way, and that's probably the best part of the game.\nNot recommended, even with friends, this game is repetitive and unappealing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "⭐⭐ Mediocre & probably worse.\n\nState of Decay 2’s multiplayer system feels like an afterthought slapped onto an otherwise decent survival game. Instead of enhancing the experience, co-op ends up restricting it. As a client player, you’re essentially a guest with your hands tied. You can’t meaningfully progress your own community, you can’t build, you can’t manage, and you’re constantly leashed to the host’s map. It’s co-op in name only.\n\nNot to mention the unforgiving restricted access from playing with friends in mulitplayer, requiring both Steam, Xbox AND a Microsoft account just to simply get into a game with a friend. It's impractical and unethical.\n\nThe tethering system is another problem. You’re forced to stay close to the host, killing any sense of freedom or tactical play. Want to split up to scavenge efficiently? Forget it. Step too far, and the game yanks you back like a dog on a chain.\n\nThe worst part? The whole setup feels like wasted potential. A zombie survival sandbox should thrive in multiplayer, but State of Decay 2’s system instead punishes you for wanting to play with friends. Instead of building something together, the host gets all the progress while everyone else just tags along for scraps.\n\nMultiplayer should elevate a survival game, sadly it drags it down.\n\nThe game is great on it's own but honestly feels like a babysitting game, having to manage an entire community on your own along with helping other settlements, i felt like i was playing Fallout 4 again working for Preston.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah dude. I'm sitting here wrestling with the Xbox Live login every time I wanna play the game. Sometimes it recognizes my controller, sometimes it doesn't. Forget this mid game. I have better things to do. Never again with this external login stuff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most retarded co-op imo. if ur looking for a multiplayer game, dont buy the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost my save thanks to cloud and microsoft account sync",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would not suggest or even buy this game if it wasn't on sale, 29,99 is really too much for a game like this. it's not bad but it's not worth the full price with bugs and glitches. If you like zombie games go for it. only on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to give this game another chance but I can't - characters are ugly as f*ck, everybody looks like potato",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i cant login into my microsoft account other than that its a great game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am unable to play it because I get Xbox account error.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Interesting but ultimately shallow experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "garbage got insta killed for no reason lost my best character",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cannot play due to login issue with microsoft account login system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Windows/Xbox account requirements even for offline play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "devs just make game more annoying and make it a tedious",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Waste of money..... xbox login issues",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Needing an xbox account was really fucking annoying",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Need MS account always... no offline SP",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "requires xbox account scam",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "incomplete game 👎",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck your xbox account requirements.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wish I could write a good review, but unfortunately this game is plagued by gay retarded ideology, and I mean that literally. There's no hyperbole. It's sad too, because all they have to do is make a good game, but they insist on letting retards steer the direction of these games to push narratives that don't exist in real life.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SUDU KIBIRAS NX",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "microsoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] I LOVE THIS GAME, AND I HATE MAKING THIS NEGATIVE [/h1]\n\n[i] [b] However, [/b] [/i] the Microsoft aspect of ownership of this IP sucks. I have played this game on and off for 2 years, and as of a day ago, I can no longer access the profile that I've played it on since I bought it. I am [i] [b] FORCED [/b] [/i] to log into my Microsoft account [i] [b] Every. Single. Time. I play it now. [/b] [/i] This was never an issue until now, if I ever did have to log into one before, it was so long ago I don't even remember it even being a thing. Dead Island 2 suffered the same backlash when it launched because of the annoying aspect of having bought a game on one platform, and having to use an account for another just play, even if it's to play it by yourself. But, at least since I've beaten that game on Steam, I've only had to use my PSN account [b] ONCE. [/b] to play Dead Island 2. Not the case with SoD2 it seems. \n\nThat isn't even the icing on my pickle, that is the fact that I'm now forced to use the Microsoft account and cannot switch, even with the [i] \"Change Profile\" [/i] button. All that button does is sign me out and force me to sign back in to the same, not currently used, profile. Which means my save data is not being accessed by the game, and I am completely fresh. If I want my save data back, I now need to [i] [b] MANUALLY [/b] [/i] find the files and move them to their new home and hope that fixes that. I should not need to mess with my game files just to play without mods. \n\nThat is why I am leaving this negative review on an otherwise great game. It saddens me so much.",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "Post ownership enforcement of third party account. Dirty, dirty practice. Essentially, after having the game for years and a good number of hours into a game I bought, I and other players have been locked out of using the product paid for, unless we want to give in and play in Microsofts little walled garden. \n\nNothing wrong with account based services in general, but to retroactively close people off from their purchased product is disgusting, and surprising that it's not considered legally dubious. I can decide with foresight if a product functions as such originally, if I want to buy or not, but to add it after years of service is just gross and deserves to at least be viable for a refund, but no. I don't want yet, another, account. So I'm effectively unable to access a product I paid for and used within EULA standards.",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "used to be a great game came back to replay it after a few  years and now forced to have a xbox live account and must enter user name and password every time you start the game with forced internet connection",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "Awful xbox live nonsense that forces you through circles of hell in order to play.\n\nPlayed 2 hours with a friend, suddenly \"Your xbox account has been locked\" with no reason, nor ability to unblock it.\n\nAvoid that scam of a game at all costs, all these shitty third party secondary accounts should not be on steam.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "The COOP is not what you think it is. You can only be a visitor in your friend's map and vice versa. Being only a \"visitor\" limits you with what you can interact with in the game. Basically you end up being a goon for hire, to kill the zombies and that is it. It gets stale really fast because one person is interacting with all the objectives, managing all the actual stuff, while you only get to walk around and just loot basic things.\r\n\r\nI bought it myself, and for my friend thinking the COOP would be more integrated where we could just build our own community and do our own think together, but it is really half baked and I can't wrap my head around why people don't voice it more.\r\n\r\nOh, and within 1 hour of playing, met with some random guy who had hacked his way through and dropped almost all the possible items in the game from the get go. Kind of him, but sucks because basically there is no incentive to play this game anymore.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Cant play offline, or without an xbox live account. Absolutely insane.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really dont understand the gameplay loop here. You build a community on a small map, clear 10 or so infestation sites, do a few fetch quests, build your base... and after completing 5 or so story missions, the story is over for that map and you go to another map where you REPEAT THE SAME GAMEPLAY LOOP you just finished.\r\n\r\nPlayed on two maps, noticed I literally replayed a game that takes 5 or so hours to complete twice in a row, decided to uninstall and write a negative review.\r\n\r\nIDK what they will do in State of decay 3, but if it is the same RNG thing, wont be buying it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A real shame... RIP goes another one to the behemoth buffoons in charge of these gaming divisions I guess?\n\nIt was a fun game, but you can't play it now. The windows account requirement won't even make an account in game or on my browser, it refused to accept me as human (a known issue lol)... and there is 0 offline options. Even the gamepass store release a few years ago could run offline mode.... \n\nI guess that explains the constant sales.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game is like a cognito hazard to me.\r\n\r\nI reinstall it, play it for 3 hours, get the illusion of having fun, then uninstall after I realize I did not enjoy it\r\n\r\nThen reinstall it 7 months later and do it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Forced login into MS account/XBox Live is pretty lame. I've had this game for a few years and now that I have to login EVERY.SINGLE.TIME is such a buzzkill.\n\nState of Decay 2 support has been non-existent for a year, and you still need to login every time to play the game. Gonna hide this game from my Steam Library and skip State of Decay 3.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Stupid Microsoft forcing you to sign in. It's saying my password is wrong when it isn't... They ruined this game forcing you to sign in to Microsoft for NO REASON",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't know if the game is good or not but Microsoft has already ruined the experience for me. Why can't I just play co-op right away? Why do I need an xbox live account to play this?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "cant even play the game unless you have and login to xbox live acc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "State of Decay 2 has so much potential, but it’s buried under a pile of bugs and frustrating issues. The co-op experience, which should’ve been the game’s highlight, is completely unreliable — my friend kept getting disconnected from my session every 10–15 minutes. It kills any sense of teamwork or progress.\r\n\r\nThe world itself feels empty and lifeless, like there’s nothing meaningful to do after a while. Even when I finished every side quest for a community, the legacy missions took forever to appear. Sometimes I waited ages just for the next mission to trigger, which made the pacing unbearable.\r\n\r\nThe zombie designs are another disappointment. They were supposed to be scary, but most look silly — especially the Juggernaut, which comes off more goofy than intimidating.\r\n\r\nOverall, even playing with a friend couldn’t save the experience. Between the endless bugs, disconnections, and dull world, State of Decay 2 ends up being more frustrating than fun. Bad experience all around.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game was fine 2 years ago but suddenly I cant play with gf because \"There was an error signing into xbox live\" even though both of us have xbox accounts. Why the fuck would i buy a game on steam to make an xbox account.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Microsoft = garbage\nMicrosoft account =  worse garbage\nCan't play offline\n---------\nDidn't get to check the game, didn't want to create a garbage microsoft account.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Need to make a Microsoft account and log into it every single time to play the game despite buying the game on steam and already being logged onto said steam account...\n\nGet refunded!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You need an Xbox Live acct to play.... so yea, have no idea about the game itself cuz I couldn't get past the log in. Instantly uninstalled.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Played for 15 hours - seemed to die every time I did any optional mission. Clunky 3rd person view & combat, falling from the top of ladders rather than getting on the ladders. Never really had any cool/exciting moments. A shame because it could have been OK. Uninstalled.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "How is it that you shoot a hostile survivor in the face 3-4 times, incapacitate them numerous times, and they keep getting up? This isn't \"higher difficulty\", it's lazy, and unfair to the player.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "My god the forced Xbox Loggin in all the time in just painful. Even simple browser games have option - Log in Once, Logi in for ever. And now, even if i send code, write CORRECT password, it tells me that Login Failed. \n\nI really liked this game and it pains me to leave Negative review! But MS - SCREW YOU!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game requires a single-use sign-in key from Microsoft every time you boot it up, and I couldn't find a way to get around this or make the sign-in permanent. Really annoying to have to whip out my phone, find an email, then plug in the code every time just to turn the game on.\n\nThe game is actually ok as a game, but every mission has a hidden timer behind it; if you don't pursue quest chains as soon as they're presented to you, you miss them permanently, and this isn't communicated clearly to the player at all.\n\nEdit: I found some mods that fixed my issue with the mission timers, so I wound up playing a bit more. However, the game quickly became repetitive and grindy. With no story to follow, I found myself having no reason to improve my base beyond getting enough materials to unlock the next base, and so on and so on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bought game, \r\nforced to create a microsoft account,\r\ndid so.\r\nplayed for 5.6 hours clicked on \"multiplayer\" got instantly logged out.\r\nmicrosoft locked my account for \"suspicious behaviour\". \r\n\r\nit's impossible to appeal as nothing works on their website. \"something went wrong\" all over. \"try a different appeal method\" and it proceeds to show me 0 options. \r\n\r\nYou've stolen my money.\r\nIt's a great game, if only you're allowed to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love this game but some of the devs support terrorism.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Requires constant access to MS account without providing amplifying information on what it exactly needs access to and why.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As with most things Microsoft gets its slimy little fingers into, they made it a requirement for you to login to THEIR services to play this game. Tired of their possessive, domineering, ridiculous BS as I am? I have now uninstalled the game, and will not be reinstalling it. Tragic, because I actually like this series.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: play SOD1 or Project zomboid if you want a more well rounded zombie game\nwould recommend as a with the SO or a friend that plays an hour or two after work\n\nUPDATE: why on earth do i now constantly have to log in to my xbox account... ITS THE SAME ACCOUNT I BOUGHT THE GAME ON XBOX AND ITS LINKED TO MY STEAM WHY DO I HAVE TO KEEP LOGGING IN TO PROVE IT, NOTHINGS CHANGED!\n\nAre you a fan of State of Decay 1?\nDo you wish all they did was add multiplayer to it?\nwell congratulations! because thats basically all this is, which wouldn't be inherently bad but you get forced into a open world game.... with tethering to the host..... which is nuts, OPEN WORLD.... can't let go of your friends hand else he will be teleported back to you.\n\nyou and your friends are working towards the same goal of building up your base... except you aren't because you have only certain items in a room you can loot and your friends will have different containers they can only loot... with NO options of turning this off, often leads to the host having alot more containers to open while your friends play hot potato with a zombie or grenade\n\nAI feels useless ive watched a single zombie walk into my base as i was unloading a car and just nom a survivor that was looking at the stars....\nVERY repetitive. probably around 5h of playtime before you get bored of the map your on and move to the next\nSOD2 doesnt have a story, not a indepth one atleast, actions dont affect the world\n\n\"curveballs\" are interesting but are either midly annoying or fuck no, doesnt seem to be any inbetween \n\n.vehicles gets stuck almost on anything. A small rock, a shovel sticking out the ground, etc.\n\n.you'll hear alot of radio talk about how the army is bad and things are going down...... nothing is happening on the map though so god knows where its \"going down\"\n\n.Missions to help other communities to build a facility etc they don't actually build it\n\n.communities are sometimes just three people in a house with 0 facilitys or defences\n\n.chose the wrong leader? well now you have to EXHIL THEM!\n\n.all the leaders do is grant access to a new building type, doesn't unlock any new abilitys or talking options between communitys \n\n>SOD1 still feels more optimised than SOD2 especially in multiplayer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cant play this game anymore, cause i have to log in suddenly after it got released more then 5 years ago.\n\nGreat job microsoft, you just lost a buyer of SoD 3!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Made a Microsoft account just to play this game. Played for almost 2 hrs. Started the game up the next day and Microsoft said my account was found to be in violation. Only way to play was to give them my phone number......... F that. If i could give Microsoft a 1 star review for their business practices I would.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game would be great if multiplayer worked they added microsoft sign in so u cant play anymore without an xbox live account but now it says my account isnt valid :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed this game for a few hours, it gets pretty repetitive after a while. Then I learned that the devs don't mind if people like me die  and support that type of shit, so I'm done supporting these studios",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Either buyer nor vendor read reviews.\n\n- when I minimise the game my GPU starts to overheating like it runs on 99 %. \n- Feature and gameoptions are are not well choosen by the developer.\n- I can not receive 100 %, because no one play this game anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dev team supports murder of an innocent, peaceful man and father of two young kids for daring to be different than them. I was very excited to play the third game, but don't see myself buying State of Decay 3 now.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "Bought it on Steam, but guess what? The game asks for an Xbox account to play.\n\nWhy would I need an Xbox account for a Steam game? What’s next, a PlayStation login?\n\nCouldn’t even start playing — just endless logins and Microsoft nonsense.\n\nZero respect for players, zero sense.\n\n0/10 — I bought a game and got a login simulator instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've got almost 80 hour on the game, loads of fun, love the franchise, came back after some years not playing, they now FORCE you to use an XBOX account. Can't even play offline. Don't buy this unless you want to be forced to use XBOX. I'm certainly not going to buy SoD 3 either when it comes out when they do dumb stuff like this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "stupid piece of shit force logs me out of my microsoft live then refuses to let me use my own password to sign back in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "State of Decay 2 is a bug-filled mess. The game crashes randomly, missions bug out or straight-up don’t appear, and half the time it’s barely playable.\n\nThe story? Terrible. Every mission feels the same, every map has the same objectives, and the open world is just… empty. There’s nothing to do besides grind the same boring stuff.\n\nCo-op is the worst part — constant disconnects, lag, and random kicks from your friend’s world.\n\nEasily one of the worst zombie games I’ve ever played.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Force you to login with xbox account. It used to be fun game but now its unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Could always play single player with no issues. Now i can only play with Xbox sign-in crap.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I want to say that this is not a completely fair review, I don't think this game has no worth and should be completely avoided, I personally have sunk so many hours in both the first and second game on console, so then why don't I recommened it now? Well the game is far too easy on anything other than lethal. So fo anyone who is new or isn't the best at survival or management? This game is worth the price and then some. But lethal? Is just one of the worst more frustrating experiences I have ever had gaming. The issue isn't with the amount of plague hearts or literally anything that lethal adds and changes, the issue? The combat. This game is clunky and unfair. The amount of times i have died or lost everything due to something that I could have done nothing to prevent is staggering, I had to resort to cheesing the game whenever even the slightest thing didn't go my way. So what makes everything so unfair and clunky? Well it's truely just one simple little thing, unavoidable attacks. It happens so often and in more ways than I can count, just playing this game when every scratch can result in either death or a huge cost to resources (at least early game huge) makes it so much more apparent when it does happen. Doing anything just becomes a chore when knowing you can't outplay or plan to avoid a threat that can just cheat you of everything. You can't even rely on stealth completly for so many reasons but mainly when taking out plague hearts because it can literally spawn zombies in, not that in itself is an issue. So if it wasn't for how clunky the game is I would be fine with EVERYTHING else, even the curveballs which can make killing a zombie explode and kill you instsantly. If I could rely on my own ability I wouldn't care at all, there have been many time that my own missteps have cost me greatly and you know what? I was fine with that, I didn't mind it because it was my fault. \r\nTLDR: if you haven't played the game before? Pick it up, it's fun and a cool zombie game take, just don't expect much in the way of a story. But whatever you do, don't play lethal, it's not a test of skill but of patience and luck. Unless I am missing something, maybe I have to cap the fps and everything is fixed, since I have no idea why people play lethal.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only word I can say after picking up this game again after years is TERRIBLE.\nYou're forced to use MC as a platform to add and invite friends, but in an extremely complicated way, and that's probably the best part of the game.\nNot recommended, even with friends, this game is repetitive and unappealing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nah dude. I'm sitting here wrestling with the Xbox Live login every time I wanna play the game. Sometimes it recognizes my controller, sometimes it doesn't. Forget this mid game. I have better things to do. Never again with this external login stuff.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most retarded co-op imo. if ur looking for a multiplayer game, dont buy the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost my save thanks to cloud and microsoft account sync",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would not suggest or even buy this game if it wasn't on sale, 29,99 is really too much for a game like this. it's not bad but it's not worth the full price with bugs and glitches. If you like zombie games go for it. only on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to give this game another chance but I can't - characters are ugly as f*ck, everybody looks like potato",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i cant login into my microsoft account other than that its a great game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am unable to play it because I get Xbox account error.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage got insta killed for no reason lost my best character",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has some good aspects but higher diffuculty just sucks. \r\n\r\nGame also just cheats to add challenge, spawning bloaters under your wheels and spawning ferals/juggernauts 10 metres away from you as a fuck you. \r\n\r\nThe characters also dont S H U T   U P",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cannot play due to login issue with microsoft account login system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Windows/Xbox account requirements even for offline play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Come on, I have to make an account? Seriously. This is why I prefer indie games now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "devs just make game more annoying and make it a tedious",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Waste of money..... xbox login issues",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Needing an xbox account was really fucking annoying",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Repetition killed me faster than zombies.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}