{
  "positive": [
    {
      "review": "Fantastic real-time tactical game.  Wish UG American Revolution were half as good.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Good strategy game.  Makes one think about, ... cannons vs calvery vs infantry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This with J&P mod is one of the greatest games of all time. Really challenging, but so satisfying after you pull it off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great strategy game that has lots of cool things to add or change about your units like the different weapons having drastically different advantages and also the morale system is very nice in how units are both fragile like anyone would be in war but also strong enough that they come back to stay in the fight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent for Civil War buffs, and quite difficult even as a strategy game. The length of time it takes infantry to reload is similar to the way the war was fought.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is the fact of the American Civil War being fought interesting if you're not a US citizen? Absolutely — just like any period of conflict in the 19th–20th centuries, before the advent of aviation and armored vehicles. The development of the narrative (including alternative history) is a strong point of this game. However, questionable controls and an unbalanced difficulty level leave a negative mark. I liked the game as a historical reference, but not as a real‑time strategy (RTS).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a miniature wargamer, this electronic wargame really scratches the itch when I can't play a physical game. It may be ageing but it it is still one of the best RTS wargames around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is impressive in its depiction of Civil War battles using historical references and topography.   A lot of fun for Civil War buffs.  I am still learning the mechanics of the game, but enjoying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game and fun at the tactical level.  You get to control and upgrade your army.  The downside is you just follow the historical battles even in career mode.  You get no say in the course of the war.  A free of the battles are broken down into phases and your progress is not always carried over to the next part of the battle forcing you to fight over ground more than once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best civil war game for recreating battles so far.  Not terribly realistic in a lot of aspects, but still a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game overall. Having played a ton of strategy games, this is a bit unique, which makes it a challenge to the strategy buff who has played a lot.\n\nThe turtorial mission is very hard and a bit light on suggestions. I'd highly recommend watching a play through on youtube in order to get an idea of the mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Civil War miniatures (15mm and 25mm) in the brought the era to life. Great Game, just wish it was multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun, but it can be hard at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent gfx. Does feel like you are doing something. Love the period.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Accurate historic basis game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy, but hard.....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love shootin folk",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "...good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 75+ hours of marching tiny soldiers across massive battlefields, I can confidently say this game has taught me three things:\r\n\r\nFlanking is life.\r\n\r\nArtillery solves everything (including bad decisions).\r\n\r\nMy inner general is apparently part Napoleon, part coffee addict.\r\n\r\nThe battles are intense, strategic, and sometimes hilariously chaotic-like when my cavalry heroically charges… in the wrong direction. But every victory feels earned, and every crushing defeat is a lesson (usually “don’t march into cannons”).\r\n\r\nThe campaign system is addictive, the attention to historical detail is impressive, and the satisfaction of outmaneuvering an army twice your size? Chef’s kiss.\r\n\r\n10/10 – Would once again send men uphill into musket fire because “it felt right at the time.”",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "I have over 1200 hours of the game and have nearly achieved every single medal. It's an understatement to say I love the game and think there is a lot of replayability. I enjoy building your army, upgrading the units inventory, and slowly building brigades that are elite. Each time I play a battle I can try different strategies and approaches. The AI is fun to fight against and I feel its sufficiently balanced. My only recommendation is to launch a live player vs. player on a given map like the U.G. Gettysburg had.  I really love the game and would buy it a second time in a heart beat.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "I recommend the game as it is fun. My main complaint is that the AI will always out number you. It gets weird when the start of a mission mentions that the enemy is outnumbered. You then get into it and you are outnumbered, but the mission is structured like you have the larger force. The mission will have a lower time limit and the enemy will be in very defensible terrain that you have to assault. The AI isn't that great and so to make up for that they just have more forces than you do or can have. The other complaint I have is that what you do in one mission only carries over for you to the next. If you wipe the enemy out and slaughter them that has no bearing on the next mission for them, however you will take all of those casualties making it best to do the minimum needed to get victory and no more. Overall the game is fun but isn't quite what I want for the ultimate game for a campaign of the civil war. I give it 7 out of 10.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Great game\n\n- Really sad this game studio is effectively dead and gone (bought out, laid off) - This is a really unique game and I wish we could have a modern one, but their current game is dead in the early access water.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Fun. Just wish there was a little more reaction to outcomes of battles and alt history",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great game, for quite a while I absolutely fell in love with it. \n\nIt is a shame what happened to the studio behind it, I was hoping for many more games in this series, but civil war still holds a place of love for me.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game all around, puts you in control from raising brigades, upgrading weapons, and hours of real battle game play. Would absolutely recomend to anyone on the fence, you won't regret it!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Controls can be a bit funky, action is pretty simple. But not sure if there are is a better RTS Civil War game on the market at the moment (that isn't 20+ years old).",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A very impressively simple yet satisfying and interesting game. 11/10 I can point to the prequel, ultimate general gettysburg as another interesting title, but cannot in good faith tell you to enjoy anything that comes later.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overall It's a good game, but it's just not for me. I like the idea and concept of it, but I'm not interested in the civil war style gameplay. But i would recommend it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best civil war game ever.  Great choices in how you manage your army and its weapons.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I can grade this game on two scales: As a Civil War game we have, and as the Civil War game you and I probably are looking for. Luckily(?) in both cases it's more or less the same: It's okay. I don't regret the purchase on sale, but it's not that be-all-end-all Holy Grail of Civil War games the weird guys who know way too much about individual units in the 3rd day of Gettysburg and volunteer at the museum dream about. \n\nAs a Civil War game we have, it is not only finished, but it also attempts to have a presentation that is not under the impression that Paradox UI's circa 2004 are God's gift to man. That means I have clear buttons and will not be going through nested buttons and menus just to order a unit or equip them. I can easily read the situation and the battle isn't just an abstraction of chevrons and NATO blocks smashing into each other on a map like a porno for the History Channel. It's not flashy and it sounds kind of weak, but it tries.\n\nAs the Civil War game the aforementioned CSA re-enactors probably want, you'll probably have to keep waiting or look elsewhere. The logistics part of the war is as simple as a market of buy/sell gear and a magic radius of resupply around a Supply Wagon unit in-game. The terrain is very Total War levels of simple, flat modifiers to movement and defense without many opportunities to do much but create chokepoints. Unit formations and frontage are basically absent, bar flanking. Above all though, the inter-mission strategy layer is the biggest and most comically simple offender and even seems to be made to be cheesed by design. It kind of makes the whole thing fall apart. Enemy forces are scaled to yours and there's not a dynamic ability to choose your objectives, you just have phases of one main mission historical setpiece that advances the war and 1 or 2 side missions to get gear and money before the next \"act\". These can weaken or influence the main mission, but the scaler still applies. So if I was to say, send the entire Army of Virginia to attack Uncle Tom's Cabin which is strategically worthless, suddenly there's not just 3000 Union soldiers, it's 30000 awkwardly shuffling in on an already cluttered map. If I slaughter these 30000 Yankees in a victory so total that it makes Bull Run look like foreplay, there's still an endless supply of them grown in vats and waiting to suicidally charge at Vicksburg or Shiloh, and the war doesn't ever change based on how you're doing up until you're apparently at DC despite killing several Gettysburg worth of men  in a side mission. The AI probably makes Lincoln sack another general from beyond the grave. The only progression is that you'll get new gear, some stat bonuses, and historical(and sadly missable) figures. That part really is commendable because some of these guys only show on lists of lists and aren't even really Wikipedia worthy. They can also die in ways remarkably less dramatic than their lives would warrant, as my Nathan Forrest died when I forgot to update his orders and he waltzed into the enemy.\n\ntl;dr it's okay get it on sale if you're starved for Civil War stuff, beggars can't be choosers",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very addicting. Commanding brigades of infantry and artillery just feels great in this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I cannot heap enough praise onto this game. I am a big fan of grand strategy, such as paradox games. I have always wanted A good civil war game that didn't break the bank but was excellent, this is it. The feeling of commanding each division, watching your flanks wipe out the rebels, then pulling the opposite and mangling the invaders. Its just all so amazing, I would buy this full price, hands down.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Where cotton's king and men are chattels,\r\nUnion boys will win the battles!\"",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is awesome but also very frustrating to play. The grand battles take years because it's almost impossible to completely destroy enemy brigades. Unlike in Total War, routing in this game means absolutely nothing. The first time you rout an enemy brigade they fall back, re-group, come at you again and very likely rout you so that you basically just take turns routing each other for two hours. It's actually quite bizarre. To fully destroy a brigade you pretty much need to take it to the corner of the map where they can't flee and only then can you 'fully rout' them. \r\n\r\nIt's unfortunate because I will now almost certainly not finish this game - the battles take way too long and it just gets a bit boring. Still recommending this game because it's objectively still quite fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good strategy game.  Makes one think about, ... cannons vs calvery vs infantry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic real-time tactical game.  Wish UG American Revolution were half as good.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Excellent for Civil War buffs, and quite difficult even as a strategy game. The length of time it takes infantry to reload is similar to the way the war was fought.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is the fact of the American Civil War being fought interesting if you're not a US citizen? Absolutely — just like any period of conflict in the 19th–20th centuries, before the advent of aviation and armored vehicles. The development of the narrative (including alternative history) is a strong point of this game. However, questionable controls and an unbalanced difficulty level leave a negative mark. I liked the game as a historical reference, but not as a real‑time strategy (RTS).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a miniature wargamer, this electronic wargame really scratches the itch when I can't play a physical game. It may be ageing but it it is still one of the best RTS wargames around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is impressive in its depiction of Civil War battles using historical references and topography.   A lot of fun for Civil War buffs.  I am still learning the mechanics of the game, but enjoying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game and fun at the tactical level.  You get to control and upgrade your army.  The downside is you just follow the historical battles even in career mode.  You get no say in the course of the war.  A free of the battles are broken down into phases and your progress is not always carried over to the next part of the battle forcing you to fight over ground more than once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best civil war game for recreating battles so far.  Not terribly realistic in a lot of aspects, but still a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game overall. Having played a ton of strategy games, this is a bit unique, which makes it a challenge to the strategy buff who has played a lot.\n\nThe turtorial mission is very hard and a bit light on suggestions. I'd highly recommend watching a play through on youtube in order to get an idea of the mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to play, no complications, good description of weapons,easy to read and follow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game always coming back to it, went and dled a mod to reblance things and change things up, but its great either way. wish there was more like this dont like the other games they got always feel they miss where this one hit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "civil war battles and tactics .. what isnt not to love?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun. Very challenging even on easy mode. Most fun I ever had getting my butt kicked by AI.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting take on the American Civil War. A lot of fun. Similar to Total War Napoleon and Total War Empires.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game....the current IP owner did not make this game..they bought it... the real dev left... people who complain that some battles are to big ??? i mean... its the civil war.. bit like ww1 and napolonic battles were... \n\ncan customise units and armies, AI is old but good... its a weekend game...ie...play for hours on one battle then maybe have a break... 50 plus battles... i dont get the hate... value for money and great game play...\"its to big to busy to complicated\" ..NO...you just need to remember this was made when people made complete games,,, not base games.\n\ni say again THE CURRENT OWNER NEVER MADE THIS GAME....look it up..its the only truly good game of this sort or that the owner has ( the last titles they made, they tried to copy what they bought.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its mid. I wouldnt praise this game as the best strategy game even though it gets alot right but also alot wrong. The pros: It has some of the longest and largest battles youll ever fight, easy to learn mechanics, fun historical gamemode BUT the issues begin here. The campaign is horrendously unfun with the 1st battle probably being the hardest battle which you HAVE to win or else campaign over, and because of the large scale of the battles it can also get quite tedious and frustrating when managing a whole front that stretches miles. Not only that there are moments where this game can feel very one thing after another without any respite. But since its the only RTS civil war game ill give it a 8/10, otherwise itd be a 5 at best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend this game to those who enjoy Grand Strategy and Tactics, Its very fun to micromanage your armies and equipping them, leveling them up through an interesting campaign.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time. I've beat it several times and still come back for more. The strategy required is engaging and historically very accurate, especially the line of sight for armies in forests, or moving just below the horizon. My only wish is that they would expand it further with more battles and battlefields.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy to play, very rewarding when mastered. Most wargames iike this require working through a steep learning curve, but this game is amazingly easy to play. Click and drag controls your units and with simple control you can command a giant army of 100+ regiment/brigade level units. As you play through the first few battles you will be given more and more units to coordinate and command as you work your way to epic, gigantic battles controlling 5 Corps of units.\r\nEach battle is a representation of battles fought during the civil war, there will be all the historic battles to refight and some flavour battles like a supply raid for example. Between battles you will recruit new units and purchase weaponry to fit them out. Your best infantry brigades you will fit out with the best rifles you can afford, while the newly recruited units you may have to supply with muskets until new weapons are available or captured from the enemy. Leaders and units will both gain experience and get better as they fight, officers gaining ranks and units being able to add perks. Your units will be a mix of Cavalry (melee or ranged), sharpshooters, artillery and infantry brigades. You will raise them, name them, select an officer - or replace dead/wounded ones -and equip them between battles.\r\nSuperb real time (pausable) strategy game, historic and epic scaled battles. MUST PURCHASE for any fan of tactical combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On the outside it may look rather simple but believe me when i say this its in rather in-depth game. I would recommend to anyone who likes line battle and games where you manage resources this is the one for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Fun little Game from the dev behind Darth mod... [/h1]\n\nI really like this game. Its straight forward, and reminds me a lot of the of historical battle games of the 90's. This is a great game to play in between games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun once you learn the game. I love smashing rebel cheeks with a wall of lead.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game.if ur looking for a cool rts realistic game then this is it.theres also different strengths and sizes of battles.awesome game for strategy players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a 25 year veteran of Total War and War of Rights, I am enthralled to report UGCW is a MUST-HAVE for any E:TW or Napoleon fans:\n\n1. Dozens of incredible Quality of Life improvements over TW. Units move/skirmish/fire/retreat/reform much more intuitively. PLUS Detach or Re-Attach skirmishers from large infantry units seamlessly! PLUS Combine weakened units mid-fight!!!\n\n2. Mouth-watering resource management. Manpower and Money, two simple resources. Do I buy horses and carbines for 500 men, or do I buy rusty old smoothbores for 3000 men?\n\n3. Very difficult. Teaches me how to remain steady under fire.\n\n4. Rogue-lite experience. Defeat is still rewarding.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent incorporation of actual Civil War tactics and terrain effects upon battle.  One's acquired skills will be increasingly and smartly challenged at each command level, and there are learning curves to be mastered in all three branches of service.  Moreover, the gamer will be faced with coming to grips with his choices in maintenance of an officer corps and the expenditure of his earned points towards the composition and quality of his army's battle strength.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game can be summed up with a quote from a certain short french man: \"God is on the side with the best artillery.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great game where you get to take out barely literate MAGA on the battlefield",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I played Civil War miniatures (15mm and 25mm) in the brought the era to life. Great Game, just wish it was multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy playing UGCW, I only wish that they were still updating the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Make America Great Again! \n\nAnd I'm proud to be an American\nWhere at least I know I'm free\nAnd I won't forget the men who died\nWho gave that right to me\nAnd I'd gladly stand up next to you\nAnd defend Her still today\n'Cause there ain't no doubt\nI love this land\nGod Bless the U.S.A.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For those of you old enough to remember, imagine Johnny Reb, but written for PC, rather than 8-Bit :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game and you have to be pretty strategic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun, but it can be hard at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Newly downloaded, but so far my opinion is quite high.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing gameplay, almost like total war just less grand strategy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Your army requires planning from the start to get through the later battles. Choose your upgrades wisely",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent gfx. Does feel like you are doing something. Love the period.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game simple but rewarding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very addictive game, great to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Accurate historic basis game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and immersive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its all that and a bag of chips",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to start. Fun for first play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good american civil war game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game, I love how immersive it feels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Historically accurate.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fun game ngl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very, very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wunderbar!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You are all going to die, you just don't know it yet....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its quite the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy, but hard.....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Richmond :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I've wasted ridiculous amounts of time on the campaign only to find that the AI repeatedly does what it wants when it wants regardless of the time and effort I put in playing. For some reason, the AI has teleporters and nuclear weapons in 1862 that break units instantly regardless of combat, leadership, quality, weapons, morale or anything resembling reality. No wonder nobody likes the other games in this series. I've tried my patient best as a wargamer of over forty years to get past one scenario, but when I come up against AI like this, I feel that it's just another game that sucks you into repeat playing until you realise that you can't win, and then they've got your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Looks bad, plays bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI cheats to such an extension that it makes the game-play unplayable. My soldiers get tired VERY easily while the opponents never seem to get tired. They start a march to the battle location and by the time they get there, they are tired.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game had so much potential: cool upgrade system, fun battle system. And then, you realize it has a timing system, and it completely ruins it. \n\nYou don't get to leveling up until the 3rd mission in, and the first two seem more like tutorials, so the time mechanic is not as prevalent and makes sense. \n\nthen you get into the real game. suddenly you can buy weapons and units, and level up, and it's like ok this is awesome-\nbut its a lie. \n\nI restarted the 3rd mission 4 or 5 times, trying to get it right. mind you, there is nothing that says you have a time limit. so when it hits, you're just blindsided. There isn't even a timer, or notification to let you know when the round will end. and when it ends, you can't replay it. which makes no sense, seeing as how you can manually restart whenever you want... until the timer runs out. then you don't get restarts, its just over and you move on with the campaign. \n\nI was so mad. The game already starts you off as an underdog, your forces are much weaker and very outnumbered by the enemy, so getting to where you can win is hard already. I got to a point, where my forces were so weak, i couldn't assault the enemy without losing. but i had taken out their cannon, and I could hold them off while my own cannon softened them up. So, while i was patiently doing that, having a great time, my win impending: boom. Suddenly, the round ends and it says draw. I was like, what the absolute F**k. \n\nthe next round fared similarly, there was no real sign of time, but i'd learned. so i moved quickly, however the enemy is so much stronger than you, you cant really move that quickly. Once again, when i was on the eve of a hard won victory, it ended. this time saying defeat, when i was clearly about to win. \n\nThat was it for me. The devs ruined this game by adding a needless time element, which only makes the game frustrating and pointless. I uninstalled this not feeling like i'd had a satisfying gaming experience, but instead feeling depressed about the wasted time put into the game. I don't usually write reviews, but this upset me enough to do so. \n\nDon't get this game. it will ruin your night.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This one might be for the read gameheads and not the casual player. Can't win 2nd bull run as CSA on normal setting...tried 40 times straight and took all recommendations I read online.  Union troops overwhelm me every time no matter what i do. it is very confusing because i follow all the tactical suggestions. it never goes my way. i quit this game after finishing 2% of it. not willing to spend more time on it and getting annihilated every time",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The in game Logic and AI make no sense, and even on the easiest difficulty i'm having trouble winning a easy battle. your units don't listen to you when you order them to do something and overall it is just not fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game might be great, but UI scaling for 4K is borderline unplayable...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've wasted ridiculous amounts of time on the campaign only to find that the AI repeatedly does what it wants when it wants regardless of the time and effort I put in playing. For some reason, the AI has teleporters and nuclear weapons in 1862 that break units instantly regardless of combat, leadership, quality, weapons, morale or anything resembling reality. No wonder nobody likes the other games in this series. I've tried my patient best as a wargamer of over forty years to get past one scenario, but when I come up against AI like this, I feel that it's just another game that sucks you into repeat playing until you realise that you can't win, and then they've got your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got very boring and out scaled in every battle even on easy.\r\nSome would say keep trying but it gets very Monotonous and makes you brain dead keep restarting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "maybe give the player step by step on how to play the game instead of just dropping you in and saying good luck. also why the time limit on the campaign maybe i want to take my time and keep troops alive instead of rushing and not have them later when you throw an over whelming force at me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "this game sucks bad, dont listen to anyone. you can win every battle and they come back with more men then you. AI with a 500 man army with kill your 2500 like its nothing. Cannons and Calvary are useless. Every troop you have to constantly click for them to move but only a few step before they stop. Sitting While getting attacked. This game will piss you off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I only played the first  hour and I did not like the mechanics. Maybe it was not just, I have played a lot of total war games and this game was nothing like those and I kinda wish it would have been, Maybe I need to spend more time reading and understanding how to use the units but i can say this game sucks with Calvary and relies heavily on infantry . Wish it had better load out with troops. The moving speed was slow with such a big map to cover it was not enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is a glitchy mess,\n\n-draw a battle line your units will move all around the place and take massive casualities and route. \n-your units routing? 2000 size inf unit routes into the enemy and surrenders\n-your units are slightly close to each other? one unit entirely redeploys on its own and takes massive casualties\n-AI is able to have units shot behind other units while you can't, AI could literally just outgun and bumrush you with a horde of infantry no matter what\n-surronded the enemy? somehow its your units that gets the flanked debuff. \n-2500 inf unit getting charged by a unit of 500? every single unit next to the inf unit changes their facing to aim at the small unit of 500. Completely ruins the battle lines.\n-Trying to cross a small stream? good luck your entire army will blob up into one single place and take massive casualties\n\nThere are so many glitches that make this game unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad, routed enemies running into the edge of the map only to come back, cav cant beat running infantry, artillery is useless. troops dont not follow order because they took 2 volleys. 500+ men charge field guns crew of 76, they make it to the pieces and are routed but the crew. Skirmishers just run, sorry cant support that unit being charged the yelling is really scary(no the hold order does not work)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is not bad for 2017. It’s pretty realistic most of the time and the battles are somewhat enjoyable. The campaign is a cool idea, but it doesn’t offer much besides battles, which dont  really feel interactive or feel different from another IMO. The level system is also interesting, but a bit dry.\nThe worst part, in my opinion, is the melee interaction – it’s just horrible. Combined with the artillery, it becomes a joke. Placing artillery close behind line infantry lets them not only shoot through them, but also gives them protection, so they can’t be charged.\nOverall, I’d rate it 6/10. It’s not horrible if you get used to the weird controls, but I wouldn’t recommend it, since games like \"Master of Command\" offer similar experiences, hopefully in a better way.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A garbage Total War knockoff tbh. The game has no tutorial, no explanation of how any of the combat works, nothing. It just throws you in and hopes you figure it out, which is awful if you haven’t played a Total War style game before. I’ve played a decent amount of Total War over the years and can say, the controls in this game just aren’t good. I like the fact you can draw a path that your units will follow, but that’s about where it stops. This game has no way of drawing depth of units, which is essential for a game where line infantry tactics are being used. I don’t want a unit that’s more than 3 rows deep, because it effectively neuters the extra infantry sitting in the back. Napoleon and Shogun 2 are my favorites (especially FotS), and they allow you stack units up in that manner and then spread them out into a thin, two row unit with kneel firing to maximize the amount of shots going out. While in this game, the units at the back still fire, I just find it to be lacking depth that you can’t do that. Beyond that, units do whatever the fuck they feel like at all times pretty much. Oh, you have a key point that expands your view of the battlefield and you’ve sent your cavalry to capture to get an advantage at the outset of the battle? Man it sure would fucking suck if your cavalry just rode their horses in circles and then ran off in a random direction, crippling your reconnaissance. Artillery is borderline useless for you, but has pinpoint accuracy and devastating results for the enemy. You have to shift your battle line slightly in order to avoid a flanking maneuver? Guess what pal, FLANKED! REAR FLANKED! It’s fucking bullshit that you slightly adjust the position of your unit, and the enemy is still in front of your unit, but it counts it as a flank for some fucking reason. I picked this game up on sale and it sucked. I honestly should have been paid $15 to play it. If you want an overall worse experience than what Total War can offer you, buy this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I recommend anyone who attempt the campaign start with CSA route first. For the union side, the game should be called \"Ultimate Blunder: Civil War\". The campaign mode is terrible by the design. \n\nThe impact of each parameter(career points, troop stats, commander impact) is way more complicated than what the description could provide. For example, if a troop has 100 efficiency, what would the player expect it to do on the field? Will it be able to devastate enemies in one single volley? Likely not. Therefore, the lack of calculation and positive feedback indicate that the learning curve basically doesn't exist. As a result, the player could not out grow their enemies power curve and could not effectively test out what went wrong. The dev somehow expect you to pick the few possible combination as if the player is trying to open a lock. This made the campaign start up essentially a puzzle solving game.\n\nEvery combat, there isn't anything more than a bloody slug fest of your enemies constant rout and regroup. Your troops are engaged constantly on all sides by superior numbers of enemies and have no time to rest. Your enemies have 120 cannons and you have 12 6-pounder. Nobody sign up for this. If people say it is historically accurate that CSA has 40k troops in Shihou, then why would union only have 30k? Even all my recruits doesn't add up to 40k! What? you tell me to to max out politic and brings army organization to 4? and I thought choosing army related skills surely would help more than politics!\n\nI heard that people have to use mod so that the hard cracker of the content is more digestable.\n\nMaybe the customized battle would be the way to enjoy the game. The game is at least playable and have much room for imagination or recreation. Still, it is one of the kind for a specific community. Perhaps you would like it after spending 20 hours reading guide and take notes in the community-academy for inexperienced soldiering. Good luck crash and burn. There is no room for any grand strategy.\n\n[quote=Jiang Ziya]For those of you that haven't get the news, the devs that made this game had been shut down by it's parent company, which is stillfront. Expect no update in the future, and maybe avoid buying any more games from this company as the money won't go into Game labs but it will go to stillfront pocket, a mobile free to play company. [/quote]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bare out of alpha. First Map, cavallerie charge over open terrain into some foottroops, outnumbering them 2-1 and your cavallerie loose the melee and flees.... Perfect game and instant refund!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an arcade game, and not a very good one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game ok but company has bad practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Scaling mechanic is so dumb",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks bad, plays bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its just a bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI cheats to such an extension that it makes the game-play unplayable. My soldiers get tired VERY easily while the opponents never seem to get tired. They start a march to the battle location and by the time they get there, they are tired.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game had so much potential: cool upgrade system, fun battle system. And then, you realize it has a timing system, and it completely ruins it. \n\nYou don't get to leveling up until the 3rd mission in, and the first two seem more like tutorials, so the time mechanic is not as prevalent and makes sense. \n\nthen you get into the real game. suddenly you can buy weapons and units, and level up, and it's like ok this is awesome-\nbut its a lie. \n\nI restarted the 3rd mission 4 or 5 times, trying to get it right. mind you, there is nothing that says you have a time limit. so when it hits, you're just blindsided. There isn't even a timer, or notification to let you know when the round will end. and when it ends, you can't replay it. which makes no sense, seeing as how you can manually restart whenever you want... until the timer runs out. then you don't get restarts, its just over and you move on with the campaign. \n\nI was so mad. The game already starts you off as an underdog, your forces are much weaker and very outnumbered by the enemy, so getting to where you can win is hard already. I got to a point, where my forces were so weak, i couldn't assault the enemy without losing. but i had taken out their cannon, and I could hold them off while my own cannon softened them up. So, while i was patiently doing that, having a great time, my win impending: boom. Suddenly, the round ends and it says draw. I was like, what the absolute F**k. \n\nthe next round fared similarly, there was no real sign of time, but i'd learned. so i moved quickly, however the enemy is so much stronger than you, you cant really move that quickly. Once again, when i was on the eve of a hard won victory, it ended. this time saying defeat, when i was clearly about to win. \n\nThat was it for me. The devs ruined this game by adding a needless time element, which only makes the game frustrating and pointless. I uninstalled this not feeling like i'd had a satisfying gaming experience, but instead feeling depressed about the wasted time put into the game. I don't usually write reviews, but this upset me enough to do so. \n\nDon't get this game. it will ruin your night.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The in game Logic and AI make no sense, and even on the easiest difficulty i'm having trouble winning a easy battle. your units don't listen to you when you order them to do something and overall it is just not fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got very boring and out scaled in every battle even on easy.\r\nSome would say keep trying but it gets very Monotonous and makes you brain dead keep restarting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a glitchy mess,\n\n-draw a battle line your units will move all around the place and take massive casualities and route. \n-your units routing? 2000 size inf unit routes into the enemy and surrenders\n-your units are slightly close to each other? one unit entirely redeploys on its own and takes massive casualties\n-AI is able to have units shot behind other units while you can't, AI could literally just outgun and bumrush you with a horde of infantry no matter what\n-surronded the enemy? somehow its your units that gets the flanked debuff. \n-2500 inf unit getting charged by a unit of 500? every single unit next to the inf unit changes their facing to aim at the small unit of 500. Completely ruins the battle lines.\n-Trying to cross a small stream? good luck your entire army will blob up into one single place and take massive casualties\n\nThere are so many glitches that make this game unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad, routed enemies running into the edge of the map only to come back, cav cant beat running infantry, artillery is useless. troops dont not follow order because they took 2 volleys. 500+ men charge field guns crew of 76, they make it to the pieces and are routed but the crew. Skirmishers just run, sorry cant support that unit being charged the yelling is really scary(no the hold order does not work)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks bad, dont listen to anyone. you can win every battle and they come back with more men then you. AI with a 500 man army with kill your 2500 like its nothing. Cannons and Calvary are useless. Every troop you have to constantly click for them to move but only a few step before they stop. Sitting While getting attacked. This game will piss you off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've wasted ridiculous amounts of time on the campaign only to find that the AI repeatedly does what it wants when it wants regardless of the time and effort I put in playing. For some reason, the AI has teleporters and nuclear weapons in 1862 that break units instantly regardless of combat, leadership, quality, weapons, morale or anything resembling reality. No wonder nobody likes the other games in this series. I've tried my patient best as a wargamer of over forty years to get past one scenario, but when I come up against AI like this, I feel that it's just another game that sucks you into repeat playing until you realise that you can't win, and then they've got your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A garbage Total War knockoff tbh. The game has no tutorial, no explanation of how any of the combat works, nothing. It just throws you in and hopes you figure it out, which is awful if you haven’t played a Total War style game before. I’ve played a decent amount of Total War over the years and can say, the controls in this game just aren’t good. I like the fact you can draw a path that your units will follow, but that’s about where it stops. This game has no way of drawing depth of units, which is essential for a game where line infantry tactics are being used. I don’t want a unit that’s more than 3 rows deep, because it effectively neuters the extra infantry sitting in the back. Napoleon and Shogun 2 are my favorites (especially FotS), and they allow you stack units up in that manner and then spread them out into a thin, two row unit with kneel firing to maximize the amount of shots going out. While in this game, the units at the back still fire, I just find it to be lacking depth that you can’t do that. Beyond that, units do whatever the fuck they feel like at all times pretty much. Oh, you have a key point that expands your view of the battlefield and you’ve sent your cavalry to capture to get an advantage at the outset of the battle? Man it sure would fucking suck if your cavalry just rode their horses in circles and then ran off in a random direction, crippling your reconnaissance. Artillery is borderline useless for you, but has pinpoint accuracy and devastating results for the enemy. You have to shift your battle line slightly in order to avoid a flanking maneuver? Guess what pal, FLANKED! REAR FLANKED! It’s fucking bullshit that you slightly adjust the position of your unit, and the enemy is still in front of your unit, but it counts it as a flank for some fucking reason. I picked this game up on sale and it sucked. I honestly should have been paid $15 to play it. If you want an overall worse experience than what Total War can offer you, buy this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I recommend anyone who attempt the campaign start with CSA route first. For the union side, the game should be called \"Ultimate Blunder: Civil War\". The campaign mode is terrible by the design. \n\nThe impact of each parameter(career points, troop stats, commander impact) is way more complicated than what the description could provide. For example, if a troop has 100 efficiency, what would the player expect it to do on the field? Will it be able to devastate enemies in one single volley? Likely not. Therefore, the lack of calculation and positive feedback indicate that the learning curve basically doesn't exist. As a result, the player could not out grow their enemies power curve and could not effectively test out what went wrong. The dev somehow expect you to pick the few possible combination as if the player is trying to open a lock. This made the campaign start up essentially a puzzle solving game.\n\nEvery combat, there isn't anything more than a bloody slug fest of your enemies constant rout and regroup. Your troops are engaged constantly on all sides by superior numbers of enemies and have no time to rest. Your enemies have 120 cannons and you have 12 6-pounder. Nobody sign up for this. If people say it is historically accurate that CSA has 40k troops in Shihou, then why would union only have 30k? Even all my recruits doesn't add up to 40k! What? you tell me to to max out politic and brings army organization to 4? and I thought choosing army related skills surely would help more than politics!\n\nI heard that people have to use mod so that the hard cracker of the content is more digestable.\n\nMaybe the customized battle would be the way to enjoy the game. The game is at least playable and have much room for imagination or recreation. Still, it is one of the kind for a specific community. Perhaps you would like it after spending 20 hours reading guide and take notes in the community-academy for inexperienced soldiering. Good luck crash and burn. There is no room for any grand strategy.\n\n[quote=Jiang Ziya]For those of you that haven't get the news, the devs that made this game had been shut down by it's parent company, which is stillfront. Expect no update in the future, and maybe avoid buying any more games from this company as the money won't go into Game labs but it will go to stillfront pocket, a mobile free to play company. [/quote]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an arcade game, and not a very good one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game ok but company has bad practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks bad, plays bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its just a bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has no tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI cheats to such an extension that it makes the game-play unplayable. My soldiers get tired VERY easily while the opponents never seem to get tired. They start a march to the battle location and by the time they get there, they are tired.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game had so much potential: cool upgrade system, fun battle system. And then, you realize it has a timing system, and it completely ruins it. \n\nYou don't get to leveling up until the 3rd mission in, and the first two seem more like tutorials, so the time mechanic is not as prevalent and makes sense. \n\nthen you get into the real game. suddenly you can buy weapons and units, and level up, and it's like ok this is awesome-\nbut its a lie. \n\nI restarted the 3rd mission 4 or 5 times, trying to get it right. mind you, there is nothing that says you have a time limit. so when it hits, you're just blindsided. There isn't even a timer, or notification to let you know when the round will end. and when it ends, you can't replay it. which makes no sense, seeing as how you can manually restart whenever you want... until the timer runs out. then you don't get restarts, its just over and you move on with the campaign. \n\nI was so mad. The game already starts you off as an underdog, your forces are much weaker and very outnumbered by the enemy, so getting to where you can win is hard already. I got to a point, where my forces were so weak, i couldn't assault the enemy without losing. but i had taken out their cannon, and I could hold them off while my own cannon softened them up. So, while i was patiently doing that, having a great time, my win impending: boom. Suddenly, the round ends and it says draw. I was like, what the absolute F**k. \n\nthe next round fared similarly, there was no real sign of time, but i'd learned. so i moved quickly, however the enemy is so much stronger than you, you cant really move that quickly. Once again, when i was on the eve of a hard won victory, it ended. this time saying defeat, when i was clearly about to win. \n\nThat was it for me. The devs ruined this game by adding a needless time element, which only makes the game frustrating and pointless. I uninstalled this not feeling like i'd had a satisfying gaming experience, but instead feeling depressed about the wasted time put into the game. I don't usually write reviews, but this upset me enough to do so. \n\nDon't get this game. it will ruin your night.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The in game Logic and AI make no sense, and even on the easiest difficulty i'm having trouble winning a easy battle. your units don't listen to you when you order them to do something and overall it is just not fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got very boring and out scaled in every battle even on easy.\r\nSome would say keep trying but it gets very Monotonous and makes you brain dead keep restarting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a glitchy mess,\n\n-draw a battle line your units will move all around the place and take massive casualities and route. \n-your units routing? 2000 size inf unit routes into the enemy and surrenders\n-your units are slightly close to each other? one unit entirely redeploys on its own and takes massive casualties\n-AI is able to have units shot behind other units while you can't, AI could literally just outgun and bumrush you with a horde of infantry no matter what\n-surronded the enemy? somehow its your units that gets the flanked debuff. \n-2500 inf unit getting charged by a unit of 500? every single unit next to the inf unit changes their facing to aim at the small unit of 500. Completely ruins the battle lines.\n-Trying to cross a small stream? good luck your entire army will blob up into one single place and take massive casualties\n\nThere are so many glitches that make this game unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad, routed enemies running into the edge of the map only to come back, cav cant beat running infantry, artillery is useless. troops dont not follow order because they took 2 volleys. 500+ men charge field guns crew of 76, they make it to the pieces and are routed but the crew. Skirmishers just run, sorry cant support that unit being charged the yelling is really scary(no the hold order does not work)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks bad, dont listen to anyone. you can win every battle and they come back with more men then you. AI with a 500 man army with kill your 2500 like its nothing. Cannons and Calvary are useless. Every troop you have to constantly click for them to move but only a few step before they stop. Sitting While getting attacked. This game will piss you off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've wasted ridiculous amounts of time on the campaign only to find that the AI repeatedly does what it wants when it wants regardless of the time and effort I put in playing. For some reason, the AI has teleporters and nuclear weapons in 1862 that break units instantly regardless of combat, leadership, quality, weapons, morale or anything resembling reality. No wonder nobody likes the other games in this series. I've tried my patient best as a wargamer of over forty years to get past one scenario, but when I come up against AI like this, I feel that it's just another game that sucks you into repeat playing until you realise that you can't win, and then they've got your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A garbage Total War knockoff tbh. The game has no tutorial, no explanation of how any of the combat works, nothing. It just throws you in and hopes you figure it out, which is awful if you haven’t played a Total War style game before. I’ve played a decent amount of Total War over the years and can say, the controls in this game just aren’t good. I like the fact you can draw a path that your units will follow, but that’s about where it stops. This game has no way of drawing depth of units, which is essential for a game where line infantry tactics are being used. I don’t want a unit that’s more than 3 rows deep, because it effectively neuters the extra infantry sitting in the back. Napoleon and Shogun 2 are my favorites (especially FotS), and they allow you stack units up in that manner and then spread them out into a thin, two row unit with kneel firing to maximize the amount of shots going out. While in this game, the units at the back still fire, I just find it to be lacking depth that you can’t do that. Beyond that, units do whatever the fuck they feel like at all times pretty much. Oh, you have a key point that expands your view of the battlefield and you’ve sent your cavalry to capture to get an advantage at the outset of the battle? Man it sure would fucking suck if your cavalry just rode their horses in circles and then ran off in a random direction, crippling your reconnaissance. Artillery is borderline useless for you, but has pinpoint accuracy and devastating results for the enemy. You have to shift your battle line slightly in order to avoid a flanking maneuver? Guess what pal, FLANKED! REAR FLANKED! It’s fucking bullshit that you slightly adjust the position of your unit, and the enemy is still in front of your unit, but it counts it as a flank for some fucking reason. I picked this game up on sale and it sucked. I honestly should have been paid $15 to play it. If you want an overall worse experience than what Total War can offer you, buy this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I recommend anyone who attempt the campaign start with CSA route first. For the union side, the game should be called \"Ultimate Blunder: Civil War\". The campaign mode is terrible by the design. \n\nThe impact of each parameter(career points, troop stats, commander impact) is way more complicated than what the description could provide. For example, if a troop has 100 efficiency, what would the player expect it to do on the field? Will it be able to devastate enemies in one single volley? Likely not. Therefore, the lack of calculation and positive feedback indicate that the learning curve basically doesn't exist. As a result, the player could not out grow their enemies power curve and could not effectively test out what went wrong. The dev somehow expect you to pick the few possible combination as if the player is trying to open a lock. This made the campaign start up essentially a puzzle solving game.\n\nEvery combat, there isn't anything more than a bloody slug fest of your enemies constant rout and regroup. Your troops are engaged constantly on all sides by superior numbers of enemies and have no time to rest. Your enemies have 120 cannons and you have 12 6-pounder. Nobody sign up for this. If people say it is historically accurate that CSA has 40k troops in Shihou, then why would union only have 30k? Even all my recruits doesn't add up to 40k! What? you tell me to to max out politic and brings army organization to 4? and I thought choosing army related skills surely would help more than politics!\n\nI heard that people have to use mod so that the hard cracker of the content is more digestable.\n\nMaybe the customized battle would be the way to enjoy the game. The game is at least playable and have much room for imagination or recreation. Still, it is one of the kind for a specific community. Perhaps you would like it after spending 20 hours reading guide and take notes in the community-academy for inexperienced soldiering. Good luck crash and burn. There is no room for any grand strategy.\n\n[quote=Jiang Ziya]For those of you that haven't get the news, the devs that made this game had been shut down by it's parent company, which is stillfront. Expect no update in the future, and maybe avoid buying any more games from this company as the money won't go into Game labs but it will go to stillfront pocket, a mobile free to play company. [/quote]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an arcade game, and not a very good one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game ok but company has bad practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks bad, plays bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its just a bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has no tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI cheats to such an extension that it makes the game-play unplayable. My soldiers get tired VERY easily while the opponents never seem to get tired. They start a march to the battle location and by the time they get there, they are tired.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game had so much potential: cool upgrade system, fun battle system. And then, you realize it has a timing system, and it completely ruins it. \n\nYou don't get to leveling up until the 3rd mission in, and the first two seem more like tutorials, so the time mechanic is not as prevalent and makes sense. \n\nthen you get into the real game. suddenly you can buy weapons and units, and level up, and it's like ok this is awesome-\nbut its a lie. \n\nI restarted the 3rd mission 4 or 5 times, trying to get it right. mind you, there is nothing that says you have a time limit. so when it hits, you're just blindsided. There isn't even a timer, or notification to let you know when the round will end. and when it ends, you can't replay it. which makes no sense, seeing as how you can manually restart whenever you want... until the timer runs out. then you don't get restarts, its just over and you move on with the campaign. \n\nI was so mad. The game already starts you off as an underdog, your forces are much weaker and very outnumbered by the enemy, so getting to where you can win is hard already. I got to a point, where my forces were so weak, i couldn't assault the enemy without losing. but i had taken out their cannon, and I could hold them off while my own cannon softened them up. So, while i was patiently doing that, having a great time, my win impending: boom. Suddenly, the round ends and it says draw. I was like, what the absolute F**k. \n\nthe next round fared similarly, there was no real sign of time, but i'd learned. so i moved quickly, however the enemy is so much stronger than you, you cant really move that quickly. Once again, when i was on the eve of a hard won victory, it ended. this time saying defeat, when i was clearly about to win. \n\nThat was it for me. The devs ruined this game by adding a needless time element, which only makes the game frustrating and pointless. I uninstalled this not feeling like i'd had a satisfying gaming experience, but instead feeling depressed about the wasted time put into the game. I don't usually write reviews, but this upset me enough to do so. \n\nDon't get this game. it will ruin your night.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The in game Logic and AI make no sense, and even on the easiest difficulty i'm having trouble winning a easy battle. your units don't listen to you when you order them to do something and overall it is just not fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got very boring and out scaled in every battle even on easy.\r\nSome would say keep trying but it gets very Monotonous and makes you brain dead keep restarting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a glitchy mess,\n\n-draw a battle line your units will move all around the place and take massive casualities and route. \n-your units routing? 2000 size inf unit routes into the enemy and surrenders\n-your units are slightly close to each other? one unit entirely redeploys on its own and takes massive casualties\n-AI is able to have units shot behind other units while you can't, AI could literally just outgun and bumrush you with a horde of infantry no matter what\n-surronded the enemy? somehow its your units that gets the flanked debuff. \n-2500 inf unit getting charged by a unit of 500? every single unit next to the inf unit changes their facing to aim at the small unit of 500. Completely ruins the battle lines.\n-Trying to cross a small stream? good luck your entire army will blob up into one single place and take massive casualties\n\nThere are so many glitches that make this game unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad, routed enemies running into the edge of the map only to come back, cav cant beat running infantry, artillery is useless. troops dont not follow order because they took 2 volleys. 500+ men charge field guns crew of 76, they make it to the pieces and are routed but the crew. Skirmishers just run, sorry cant support that unit being charged the yelling is really scary(no the hold order does not work)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks bad, dont listen to anyone. you can win every battle and they come back with more men then you. AI with a 500 man army with kill your 2500 like its nothing. Cannons and Calvary are useless. Every troop you have to constantly click for them to move but only a few step before they stop. Sitting While getting attacked. This game will piss you off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've wasted ridiculous amounts of time on the campaign only to find that the AI repeatedly does what it wants when it wants regardless of the time and effort I put in playing. For some reason, the AI has teleporters and nuclear weapons in 1862 that break units instantly regardless of combat, leadership, quality, weapons, morale or anything resembling reality. No wonder nobody likes the other games in this series. I've tried my patient best as a wargamer of over forty years to get past one scenario, but when I come up against AI like this, I feel that it's just another game that sucks you into repeat playing until you realise that you can't win, and then they've got your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A garbage Total War knockoff tbh. The game has no tutorial, no explanation of how any of the combat works, nothing. It just throws you in and hopes you figure it out, which is awful if you haven’t played a Total War style game before. I’ve played a decent amount of Total War over the years and can say, the controls in this game just aren’t good. I like the fact you can draw a path that your units will follow, but that’s about where it stops. This game has no way of drawing depth of units, which is essential for a game where line infantry tactics are being used. I don’t want a unit that’s more than 3 rows deep, because it effectively neuters the extra infantry sitting in the back. Napoleon and Shogun 2 are my favorites (especially FotS), and they allow you stack units up in that manner and then spread them out into a thin, two row unit with kneel firing to maximize the amount of shots going out. While in this game, the units at the back still fire, I just find it to be lacking depth that you can’t do that. Beyond that, units do whatever the fuck they feel like at all times pretty much. Oh, you have a key point that expands your view of the battlefield and you’ve sent your cavalry to capture to get an advantage at the outset of the battle? Man it sure would fucking suck if your cavalry just rode their horses in circles and then ran off in a random direction, crippling your reconnaissance. Artillery is borderline useless for you, but has pinpoint accuracy and devastating results for the enemy. You have to shift your battle line slightly in order to avoid a flanking maneuver? Guess what pal, FLANKED! REAR FLANKED! It’s fucking bullshit that you slightly adjust the position of your unit, and the enemy is still in front of your unit, but it counts it as a flank for some fucking reason. I picked this game up on sale and it sucked. I honestly should have been paid $15 to play it. If you want an overall worse experience than what Total War can offer you, buy this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I recommend anyone who attempt the campaign start with CSA route first. For the union side, the game should be called \"Ultimate Blunder: Civil War\". The campaign mode is terrible by the design. \n\nThe impact of each parameter(career points, troop stats, commander impact) is way more complicated than what the description could provide. For example, if a troop has 100 efficiency, what would the player expect it to do on the field? Will it be able to devastate enemies in one single volley? Likely not. Therefore, the lack of calculation and positive feedback indicate that the learning curve basically doesn't exist. As a result, the player could not out grow their enemies power curve and could not effectively test out what went wrong. The dev somehow expect you to pick the few possible combination as if the player is trying to open a lock. This made the campaign start up essentially a puzzle solving game.\n\nEvery combat, there isn't anything more than a bloody slug fest of your enemies constant rout and regroup. Your troops are engaged constantly on all sides by superior numbers of enemies and have no time to rest. Your enemies have 120 cannons and you have 12 6-pounder. Nobody sign up for this. If people say it is historically accurate that CSA has 40k troops in Shihou, then why would union only have 30k? Even all my recruits doesn't add up to 40k! What? you tell me to to max out politic and brings army organization to 4? and I thought choosing army related skills surely would help more than politics!\n\nI heard that people have to use mod so that the hard cracker of the content is more digestable.\n\nMaybe the customized battle would be the way to enjoy the game. The game is at least playable and have much room for imagination or recreation. Still, it is one of the kind for a specific community. Perhaps you would like it after spending 20 hours reading guide and take notes in the community-academy for inexperienced soldiering. Good luck crash and burn. There is no room for any grand strategy.\n\n[quote=Jiang Ziya]For those of you that haven't get the news, the devs that made this game had been shut down by it's parent company, which is stillfront. Expect no update in the future, and maybe avoid buying any more games from this company as the money won't go into Game labs but it will go to stillfront pocket, a mobile free to play company. [/quote]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an arcade game, and not a very good one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game ok but company has bad practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks bad, plays bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its just a bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has no tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI cheats to such an extension that it makes the game-play unplayable. My soldiers get tired VERY easily while the opponents never seem to get tired. They start a march to the battle location and by the time they get there, they are tired.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game had so much potential: cool upgrade system, fun battle system. And then, you realize it has a timing system, and it completely ruins it. \n\nYou don't get to leveling up until the 3rd mission in, and the first two seem more like tutorials, so the time mechanic is not as prevalent and makes sense. \n\nthen you get into the real game. suddenly you can buy weapons and units, and level up, and it's like ok this is awesome-\nbut its a lie. \n\nI restarted the 3rd mission 4 or 5 times, trying to get it right. mind you, there is nothing that says you have a time limit. so when it hits, you're just blindsided. There isn't even a timer, or notification to let you know when the round will end. and when it ends, you can't replay it. which makes no sense, seeing as how you can manually restart whenever you want... until the timer runs out. then you don't get restarts, its just over and you move on with the campaign. \n\nI was so mad. The game already starts you off as an underdog, your forces are much weaker and very outnumbered by the enemy, so getting to where you can win is hard already. I got to a point, where my forces were so weak, i couldn't assault the enemy without losing. but i had taken out their cannon, and I could hold them off while my own cannon softened them up. So, while i was patiently doing that, having a great time, my win impending: boom. Suddenly, the round ends and it says draw. I was like, what the absolute F**k. \n\nthe next round fared similarly, there was no real sign of time, but i'd learned. so i moved quickly, however the enemy is so much stronger than you, you cant really move that quickly. Once again, when i was on the eve of a hard won victory, it ended. this time saying defeat, when i was clearly about to win. \n\nThat was it for me. The devs ruined this game by adding a needless time element, which only makes the game frustrating and pointless. I uninstalled this not feeling like i'd had a satisfying gaming experience, but instead feeling depressed about the wasted time put into the game. I don't usually write reviews, but this upset me enough to do so. \n\nDon't get this game. it will ruin your night.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The in game Logic and AI make no sense, and even on the easiest difficulty i'm having trouble winning a easy battle. your units don't listen to you when you order them to do something and overall it is just not fun",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got very boring and out scaled in every battle even on easy.\r\nSome would say keep trying but it gets very Monotonous and makes you brain dead keep restarting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a glitchy mess,\n\n-draw a battle line your units will move all around the place and take massive casualities and route. \n-your units routing? 2000 size inf unit routes into the enemy and surrenders\n-your units are slightly close to each other? one unit entirely redeploys on its own and takes massive casualties\n-AI is able to have units shot behind other units while you can't, AI could literally just outgun and bumrush you with a horde of infantry no matter what\n-surronded the enemy? somehow its your units that gets the flanked debuff. \n-2500 inf unit getting charged by a unit of 500? every single unit next to the inf unit changes their facing to aim at the small unit of 500. Completely ruins the battle lines.\n-Trying to cross a small stream? good luck your entire army will blob up into one single place and take massive casualties\n\nThere are so many glitches that make this game unplayable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad, routed enemies running into the edge of the map only to come back, cav cant beat running infantry, artillery is useless. troops dont not follow order because they took 2 volleys. 500+ men charge field guns crew of 76, they make it to the pieces and are routed but the crew. Skirmishers just run, sorry cant support that unit being charged the yelling is really scary(no the hold order does not work)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks bad, dont listen to anyone. you can win every battle and they come back with more men then you. AI with a 500 man army with kill your 2500 like its nothing. Cannons and Calvary are useless. Every troop you have to constantly click for them to move but only a few step before they stop. Sitting While getting attacked. This game will piss you off.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've wasted ridiculous amounts of time on the campaign only to find that the AI repeatedly does what it wants when it wants regardless of the time and effort I put in playing. For some reason, the AI has teleporters and nuclear weapons in 1862 that break units instantly regardless of combat, leadership, quality, weapons, morale or anything resembling reality. No wonder nobody likes the other games in this series. I've tried my patient best as a wargamer of over forty years to get past one scenario, but when I come up against AI like this, I feel that it's just another game that sucks you into repeat playing until you realise that you can't win, and then they've got your money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A garbage Total War knockoff tbh. The game has no tutorial, no explanation of how any of the combat works, nothing. It just throws you in and hopes you figure it out, which is awful if you haven’t played a Total War style game before. I’ve played a decent amount of Total War over the years and can say, the controls in this game just aren’t good. I like the fact you can draw a path that your units will follow, but that’s about where it stops. This game has no way of drawing depth of units, which is essential for a game where line infantry tactics are being used. I don’t want a unit that’s more than 3 rows deep, because it effectively neuters the extra infantry sitting in the back. Napoleon and Shogun 2 are my favorites (especially FotS), and they allow you stack units up in that manner and then spread them out into a thin, two row unit with kneel firing to maximize the amount of shots going out. While in this game, the units at the back still fire, I just find it to be lacking depth that you can’t do that. Beyond that, units do whatever the fuck they feel like at all times pretty much. Oh, you have a key point that expands your view of the battlefield and you’ve sent your cavalry to capture to get an advantage at the outset of the battle? Man it sure would fucking suck if your cavalry just rode their horses in circles and then ran off in a random direction, crippling your reconnaissance. Artillery is borderline useless for you, but has pinpoint accuracy and devastating results for the enemy. You have to shift your battle line slightly in order to avoid a flanking maneuver? Guess what pal, FLANKED! REAR FLANKED! It’s fucking bullshit that you slightly adjust the position of your unit, and the enemy is still in front of your unit, but it counts it as a flank for some fucking reason. I picked this game up on sale and it sucked. I honestly should have been paid $15 to play it. If you want an overall worse experience than what Total War can offer you, buy this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I recommend anyone who attempt the campaign start with CSA route first. For the union side, the game should be called \"Ultimate Blunder: Civil War\". The campaign mode is terrible by the design. \n\nThe impact of each parameter(career points, troop stats, commander impact) is way more complicated than what the description could provide. For example, if a troop has 100 efficiency, what would the player expect it to do on the field? Will it be able to devastate enemies in one single volley? Likely not. Therefore, the lack of calculation and positive feedback indicate that the learning curve basically doesn't exist. As a result, the player could not out grow their enemies power curve and could not effectively test out what went wrong. The dev somehow expect you to pick the few possible combination as if the player is trying to open a lock. This made the campaign start up essentially a puzzle solving game.\n\nEvery combat, there isn't anything more than a bloody slug fest of your enemies constant rout and regroup. Your troops are engaged constantly on all sides by superior numbers of enemies and have no time to rest. Your enemies have 120 cannons and you have 12 6-pounder. Nobody sign up for this. If people say it is historically accurate that CSA has 40k troops in Shihou, then why would union only have 30k? Even all my recruits doesn't add up to 40k! What? you tell me to to max out politic and brings army organization to 4? and I thought choosing army related skills surely would help more than politics!\n\nI heard that people have to use mod so that the hard cracker of the content is more digestable.\n\nMaybe the customized battle would be the way to enjoy the game. The game is at least playable and have much room for imagination or recreation. Still, it is one of the kind for a specific community. Perhaps you would like it after spending 20 hours reading guide and take notes in the community-academy for inexperienced soldiering. Good luck crash and burn. There is no room for any grand strategy.\n\n[quote=Jiang Ziya]For those of you that haven't get the news, the devs that made this game had been shut down by it's parent company, which is stillfront. Expect no update in the future, and maybe avoid buying any more games from this company as the money won't go into Game labs but it will go to stillfront pocket, a mobile free to play company. [/quote]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an arcade game, and not a very good one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game ok but company has bad practices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks bad, plays bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its just a bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has no tutorial",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI cheats to such an extension that it makes the game-play unplayable. My soldiers get tired VERY easily while the opponents never seem to get tired. They start a march to the battle location and by the time they get there, they are tired.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game had so much potential: cool upgrade system, fun battle system. And then, you realize it has a timing system, and it completely ruins it. \n\nYou don't get to leveling up until the 3rd mission in, and the first two seem more like tutorials, so the time mechanic is not as prevalent and makes sense. \n\nthen you get into the real game. suddenly you can buy weapons and units, and level up, and it's like ok this is awesome-\nbut its a lie. \n\nI restarted the 3rd mission 4 or 5 times, trying to get it right. mind you, there is nothing that says you have a time limit. so when it hits, you're just blindsided. There isn't even a timer, or notification to let you know when the round will end. and when it ends, you can't replay it. which makes no sense, seeing as how you can manually restart whenever you want... until the timer runs out. then you don't get restarts, its just over and you move on with the campaign. \n\nI was so mad. The game already starts you off as an underdog, your forces are much weaker and very outnumbered by the enemy, so getting to where you can win is hard already. I got to a point, where my forces were so weak, i couldn't assault the enemy without losing. but i had taken out their cannon, and I could hold them off while my own cannon softened them up. So, while i was patiently doing that, having a great time, my win impending: boom. Suddenly, the round ends and it says draw. I was like, what the absolute F**k. \n\nthe next round fared similarly, there was no real sign of time, but i'd learned. so i moved quickly, however the enemy is so much stronger than you, you cant really move that quickly. Once again, when i was on the eve of a hard won victory, it ended. this time saying defeat, when i was clearly about to win. \n\nThat was it for me. The devs ruined this game by adding a needless time element, which only makes the game frustrating and pointless. I uninstalled this not feeling like i'd had a satisfying gaming experience, but instead feeling depressed about the wasted time put into the game. I don't usually write reviews, but this upset me enough to do so. \n\nDon't get this game. it will ruin your night.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The in game Logic and AI make no sense, and even on the easiest difficulty i'm having trouble winning a easy battle. your units don't listen to you when you order them to do something and overall it is just not fun",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}