{
  "positive": [
    {
      "review": "Celeste really is what its about, Climbing a mountain... I picked this game up not knowing what it was. Not having much platforming experience I got it thinking it would be a light and fun game to play for a short bit. I quickly realized I was incorrect and had made a mistake, this game was not for me... but I was struck by one of the first things the game tells you \"You can do this\" like it knew most people would think this way. So I kept going, easy enough at first but rapidly I was slowed to a dragging pace. At some point in each chapter I would audibly say \"There's no way\" and would get off. Everytime the next day something would tell me to try again. So I would try, die, try, die, try, die hundreds or thousands of times but eventually I would make it, only to say the same thing the next level. I have played many souls & souls-like games and enjoy high difficulty but this game hits different. Its brutally hard and frustrating and annoying at times but also beautiful and amazing and incredibly rewarding. This game is a mountain. Its filled with walls, setbacks and false peaks but if keep going you will learn can something about yourself. So begin the climb, be persistent and stubborn, forget the failures and relish in the successes and remember  \"You can do this\".",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "This game... is fun, loads of fun for me. How I played 580 hours of a single player game I have no clue but I never want this fun, precise, and well designed platformer to end. This is a great game for the people who love bashing their head into a brick wall and seeing if it sticks.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "This game has tested my will, my sleep and still everything about it is perfect. I beat all C-side and have done everything the game has to offer and still i wish i could go back to the first time i booted up the game not knowing what i was getting myself into. At the end of the day Celeste is a game i would recommended this game too everyone.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Celeste, in my opinion, is just the best game i've ever played, and I can say that after having gotten every achievement and +70 hours just on the base game (combined with my playthrough on the switch.) This game is amazing; it's a hard yet addicting plataformer game. For casual players, even the main story will make you fall in love with this game - The story is amazing. But if you love hard tight gameplay, or want to challenge yourself, then completing all the B, C sides and chapter 9 is something you won't regret (even though they're incredibly hard). I also thought I wasn't a mountain climber, but well... I guess that just goes to show how much I loved this experience.\r\n\r\n I couldn't recommend less this game to anyone, it is honestly my favorite game ever and it just has so much content to explore that you never get tired. There's also so many fun mods available if you ever want something different out of Celeste. 10/10. Just go play it already!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Everything about this game feels so finely tuned and purposeful; Every level, every stage, every story beat, and every visual. Quintessential in the land of modern day 2d platformers. \n\nYou could recommend this to almost anybody and they’d find something to get out of it; casual audiences within the genre, speed runners, modders, perfectionists, try hards, anyone with even a passing interest in these types of games. \n\nIt’s honestly astonishing how well Maddy Makes Games managed to refine and polish this game till it hit the levels it does in this final build. \n\nI recommend this game strongly, especially since it always goes on sale for like, a few bucks lol.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "An absolutely incredible game in every aspect. Incredible music, beautiful pixel art, amazing story, and most importantly incredible gameplay. It feels so incredibly smooth to play, and the movement is polished to perfection. The base game (as in just the a-sides) is challenging but still very accessible - I truly believe that with time nearly every person on the planet can beat it (and for those who can't or don't have the patience to, assist mode is there and perfectly implemented!) - but for those who want to go further there is always the much harder challenges of the b&c-sides, along with of course the infamous chapter 9. The modding scene is also one of the best I've ever seen, I highly recommend trying mods out! Absolutely worth experiencing at the very least the base game! (also, for those whom the price might get in the way, it goes on sale quite often and usually has a steep discount, so wait for one of those!)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "a really solid 2d platformer  with great music and a heartwarming story",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[h1] A timeless 2d platformer [/h1]\n\nEverything has already been said on this game. Just one of the best platformer of this decade easily with great level design, amazing soundtrack, mechanics and movement are on point completion and end game is pure fun to do.\n\n[h3] Can be a difficult game sometimes for sure but you can overcome this with some die and retry so no need to worry and dive into it, would recommend this game to anyone who like video games as a whole [/h3]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "this game is so fun yet so difficult i love how you can play casually by just going through the level or get strawberries and b-sides",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game made me cry both because of the story and because of how much I suck at 2D platformers\n\n9.5/10.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "BEST 2D PLATFORMER OAT\r\nI bought this game 2 days ago and it is already one of my favorite games i have ever played second only to botw.\r\nthis games controls feel soooo good and smooth, my only problem is that on controller it is sometimes difficult to dash in the right direction, but other then that ther controls are great.\r\nthe music is absolutely HEAVANLY.\r\nthe story is really cool and overall its just an amazing game.\r\nPLEASE PLAY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really cool game. Gets harder as the game progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best precision platformers i have ever played! You are playing a character that is having a physical and emotional journey while climbing the Celeste mountain. It is trying to give you interesting and meaningful concepts while climbing (e.g anxiety, mental health, self-doubt, self acceptance, depression etc) and the character is trying to face/accept/embrace them. The music was sooo beautiful and its difficulty was solid if you want to finish it casually. HOWEVER, the game gives you  the opportunity to play optional stages where their difficulty skyrockets a little bit because it focuses more on precision AND consistency. One last thing..... a lot of stages will be challenging but none of them are speedrunning/frame perfect ones. In other words, no matter the deaths, keep trying and you will make it. This is what celeste is all about.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Celeste is more than just my favorite game, it’s something that genuinely changed me. The art is beautiful in a soft, warm, and expressive pixel style that gives every moment its own emotion. The soundtrack is honestly one of the best I’ve ever heard. The gameplay is smooth, tight, and incredibly satisfying.\n\nIts message about self-doubt, anxiety, and pushing through your own limits hit me in such a positive way, and it’s a game that stays with you long after you finish it.\nIn every way that matters, Celeste is unforgettable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, love it a lot. Great representation of self discovery, would rec.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's a very good platformer with  very hard difficulty but when you learn it it's so much fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Celeste is a very challenge game for the players that want the 100%, it is a totally plataform game where you need to master all the mecanics of the game to go through on every stage. Sometime is very annoying jumping on the clouds, sometimes the jump works and sometimes fails and i am still figuring out how to jump far using the cloud. \r\nThe songs of some stages are pretty annoying and loud, but in others stage there are pretty nice songs, in overall the game runs well, the controllers are very accurate and has a nice feedback response to the player. The graphics are pixel art, nothing to say about it. The story is simple and straight foward. \r\n\r\nHowever the game is decent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "such a fun and reliable game you get to discover chapters and dash and get strawberries",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I adore this game. i have spent hours going through each of the sides and getting the 100% achievements. It is 100% worth the time to learn and play, it is a work of art all the way through.\n\nAlso, if you are someone who loves a good soundtrack in a game then this will be a treasure for sure, the soundtrack is phenomenal.\n\nI will be continuing to play to get as many golden berries as i can.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I just got the Moonberry, and Celeste is in my top 5 games of all time. The platforming is great, with unique mechanics, and the movement is amazing. The dash has so much movement tech, and once you learn it, it's one of the best feelings. The aesthetic of the game is great every chapter is amazing (except 6, I hate the bumpers) and looks incredible. The puzzles are good too they aren’t that hard but still very fun to figure out on your own. Finally beating a section you’ve been stuck on for hours is an amazing feeling. All in all, Celeste is a 10/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not just a very fun platformer but a beautiful connection from a story about overcoming adversity both mentally and physically through the gameplay itself. the main game presents a fairly tough but fair challenge. have not yet done the b side chapters or the core which I am ware is extremely hard compared to the main adventure.\nanyways, absolutely must play",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The movement is perfect and completely fair, one small issue... [spoiler]I suck.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "when you get to the summit madeline jumps out of the screen and cuts your balls off 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Welp I played it and now I'm trans, dash and all. Worked as advertised.\r\n(seriously tho play this game it's absolutely amazing)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its really fun, pretty and has good music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great pixel art, a good soundtrack, polished platforming, and a nice story. The difficulty however, can be a bit bullshit in places (the first b-side took me AN HOUR), and it does demand pixel perfection on ocassion. It does provide alot of tools to help you though, so that shouldn't be that big a problem (Though I haven't personally used it myself). I also hated anything to do with strong wind, but everything other than that was very well done I think. It's also a relatively short game, only 10 hours long, which is always good in my books. Probably less if you didnt go for most of the strawberries like I did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The controls are simple yet difficult to master. Tons of content and replayability. A lot of personal impact.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh. My. GOD. I can't express enough just how GOOD this game is. The controls are fluid, the pixel art is gorgeous, every level has care put into it. The game is extremely freaking hard, sure, but, as the Assist Mode description says: It's a challenging but rewarding experience. It feels SO GOOD when you finally beat a room that you've been HOURS trying to beat. Don't let this game's difficulty hold you back. IT IS WORTH IT. I PROMISE YOU. Also, I feel like I should mention the story. This game's story... is... well, how do I put this... This game's story is incredible. Truly incredible. I will try to keep this as spoiler free as possible, so just check it out for yourself. It's deep.\r\n\r\nTLDR: Great game, everything has care put into it, hard but rewarding, definitely should play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Celeste is essential if you like platformers. Even if you're bad at them. This game will change your mindset. It really doesn't get any better than this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do I think this is the greatest game of all time? No. But I would consider it a reasonable opinion if someone else thought it was.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and beautiful art. Although i found this game a little difficult and challenging, it was really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on Steam Deck OLED\n—\n\nPerformance: Ran amazing with extremely long battery life\n\nGameplay: A platforming masterpiece with an amazing soundtrack. By the end, I found myself humming the final tune even though I had died many times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the bast platformer out there! While a bit hard, the story and music are amazing. Don't buy this expecting a chill game, but rather a fast game with a cute story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes!\r\nIncredible game, absolutely recommend!\r\nIt is *hard,* but that's exactly what I wanted out of it. You don't have to go through the super difficult levels if you don't want to. I still have quite a bit of stuff to find, but it was absolutely more than worth the money I spent on the game.\r\n\r\nAlso I just had to play this game at some point, it's like the biggest game from the trans community, so as a trans person myself I felt like I needed to. Well worth the experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game honestly has a great story. I haven't finished it, but I see what all the rave is about. I’ve been more focused on going back and collecting the Strawberries I missed, rather than completing the game. I still can’t believe the Strawberries don’t serve a purpose. They are just fun to collect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game its just hard to play and unedited control are bad if you change controls game will be great kinda still its still to hard even with assist thing do i rec this game ? yes but only if you are god like player hope this helps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im never goldening farewell dude",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dont search about the main character, other than that game is really fun and challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing, so hard in places, very very rewarding when you get that section you've died on 40 times. Really lovely feeling about it. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a good game. the difficulty is medium unless you yourself choose to play the hard difficulties and challenge yourself. and the story is great too.\nOnly recommend it if you're sure that your nerves can take it, lots of dying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great use of only few controls to create amazing level desing, would highly reccomend it. THIS GAME IS FIRE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is easily one of my favourite games of all time, I highly recommend it to anyone and everyone, as it's simple and easy to understand, but it has a very high skill ceiling, but the game never punishes you or makes you feel bad for messing up, it instead incentivizes you to grow, and immerses you in it's surprisingly really good story by having you empathize with the struggles of Madeline\n\nIt's an amazing game, and I recommend it to the highest degree",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game, def recommend, pretty short but lots of content to check out after beating it. Music also slaps hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its my favorite game of all time. the story, gameplay and mechanics are all great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9 hours, 10 strawberries and 1867 deaths later I finally beat the 7 chapters. What an amazing game. The quick challenges and fast replay kept me hooked, and now my fingers are sore from operating the keyboard. It has the most amazing sound design I've ever heard. \n\n9 hours is more then I initially expected, and this is just rushing the main game. I did have to look up one mechanic, and I did see a minute of a walktrough for chapter 6. I'm not one to challenge myself, but I did it without the helpful mode. Still figuring out what this mountain represents.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hmm celeste a game where sometimes you will laugh and smile while other times you will cry and try to pull your hair out honestly its kinda fun just get through the hard parts especialy celestial resort trust me its pain and the spoiler badeline parts just climb that mountain you got this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a challenging game, but fun, has a good story and even when you \"beat\" it,  you still have a lot to do. Overall, just a very nice, cheap, (especially now, that it's in promotion) game 👍🏻",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jump, dash, climb. These are the three abilities that have had me in love with this game since I first played it back in 2020. The way these 3 abilities are utilized to create an interesting experience in EVERY single level in this game will never cease to amaze me. I have 120 hours in this game total across both Steam and Xbox and this game I don't think has ever been boring for a single one of those hours. Challenging, yes, but boring never.\n\nThis game is a very very technical game if you are to get into the speedrunning aspects and chapter 9 of the game as well as the B sides and C sides, which I do recommend. But don't let that deter you! This game is great and incredibly welcoming towards both beginners and people very familiar with it, as a matter of fact, they even implemented built in \"cheats\" with assist mode which I've also used to get through some very difficult challenges that I genuinely did not see a way to beat.\n\nAlso, the modding support for this game is astounding. If you want even more Celeste, feel free to download Olympus and try your hand at the many different modded and custom maps they have for people of all skill levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love this game. Been playing for 151 hours and its not even boring. adding mods helped advance the experience a dozen times. best game oat. play this if you like hard challenges. so fun!!!1!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obsessed with this game. You can overcome any obstacle, get through all hurts. You will slip, you will fall back, but you can get up again. We all belive in you. You can do this. You can climb your mountain. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's awesome, it had some impact on the way I perceive myself.\n\nBut if you don't care about that it's a great platformer anyways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty good, and you definitely get used to and thrive in the difficulty over time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played for 38 hours aka not a lot but I have everything eexcept for some golden strawberries. This is a game thats near perfection if not perfection itself. Its a hard 2d platformer with great level design, good mechanics that you can abuse to find shortcuts or perform cool tricks. The story is absolutely amazing and dont even get me started on the music. the music is so good it reaches the niveau of games like undertale and Hollowknight. top 5 indie games of all ime can definetly recommend as long as you dont rage easily",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beating this game without assist mode made me certifiably good at 2d platformers (using assist mode makes the game a joke so dont do that)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid Platforming game, played once on xbox console and once on PC and was very enjoyable, extra content is much more difficult if the main gain wasn't enough of a challenge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't really expecting much of a story, I just picked it up after playing Silksong because I heard people compare a part of that game I enjoyed (Fay Mountain) to Celeste, and I was not prepared for how much I'd enjoy this. When you conquer something you've been stuck on it feels very satisfying, and I think the narrative really adds to that.\r\nDefinitely play if you need a mountain to climb, I really like that you can stop at any point, even mid level, and pick right back up when you boot the game back up. It really lends to the game's narrative, learning to take things one step at a time, stepping back when you need to. Climbing a mountain is not an easy thing, and neither is changing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "man im finally buy this game and its worth it ASF DUDE it helps me idk beat my loneliness temporary BUT stilll THANKSSSSSS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i know its good but it wont load, im stuck on a mounten with the games name below it. i want my money or help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A contender for my all-time favorite game. \n\nI’ve beaten it on 2 other platforms countless times and once here. \nThe gameplay is challenging but fair platforming with level design that never feels repetitive. The extra challenges are there if you want them and worth playing. \nAnd then there’s the story. Well told and truly powerful. Madeline’s journey is deeply moving and relatable to me and anyone else who has struggles with depression and  anxiety.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh wow how this game spoke to me when i played it. I love the imagery in this game, its so beautiful despite the low pixel rate. I recommend this game to anyone. LITERALLY ANYONE. GET IT NOW. :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game was so good I finished the game and than went back couple of years later to 100% it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "passed chapter 6, i dont even know how i did that lol but regardless what an awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun. Good story and can be a challenge. One of the best platformers I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the art style and you can see everything clearly. Music and sound effects fit very well. The story was good until the very last level which is more challenging then what the game showed you before. Instant death and no combat is not my cup of tea. Overall it was a fun time, you can also unlock different versions of the levels so there is also replay value",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Likely the best platforming game ever made. If you enjoy platforming games even slightly, you will absolutely love this game. If you don't enjoy platforming games, you will still probably love this game.\n\nExceptional game mechanics, beautiful graphis, some of the best level design in the history of gaming, perfect amount of challenge with self-guided learning and no handholding, just the right amount of frustration before finally giving way to satisfaction, great story, great characters and dialogue between them, loads of content to enjoy... There's nothing not to like here. Masterpiece of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just like it. rlly cool gameplay. challenging but also incourages players to not give up ingame :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Challenging, but fair.\r\nGreat narrative, better gameplay\r\nBanger OST\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok like base game celeste is goated asl, but modded is like 1000x better. strawberry jam in particular. also i can say this with experience bc i have 800 hours on steam and probably 1000 on my old switch 🥶.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game ... Like itching a really bad mosquito bite.  Feels good ... kind of ... until you break a controller over a chair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Difficult platformer that makes dying part of the game loop rather than frustrating. Easy to recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Spent 3 months on the first level, still haven't completed it. Spent hours on the OG version trying to beat it, the same has carried over to this one. Best game IMO.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is both a heartwarming story of self acceptance and an incredibly fun platformer. Highly recommend for everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's hard to describe, but everyone who loves platforms needs to play this game for one reason or another, at least once in their life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply one of the best platformers ever made, with a easy enough barrier of entry to beat, but more than enough difficulty and challenges for anyone looking to push themselves or test their skills/sanity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good, but gets very challenging later on (im not saying that this is a bad thing, just as a mild warning to anyone who might think that this is just a relaxing platformer. i like how difficult it is but its stupidly frustrating.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is difficult, but fun!  I am still in the earlier levels but looking forward to enjoying the story progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of best games I've ever played, definitely a must play. I love that there's not much lore and reading yet it portays so much, I felt so comforted and happy to see Madeline experience/express negative feelings me and we all struggle with. It's hard in best way possible, you don't want to rage quit and return the game, you learn routes and keep trying. Even if you don't like hard games and won't wanna do B sides etc, I still recommend just the main game. If the price is too much for you then buy it on sale, it's fully worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy really difficult games please get. I've never cried due to a game in my life, but today I cried in anger. Chapter 9 is the worst thing actually to ever be created. I despise it with all my heart and I have never done anything more challenging in my life. I considered many things because of a single room in chapter nine. CURSE THE INVENTORS OF THE WAVE DASH.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probablemente de los juegos más estresantes pero más bonitos que he tocado",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "INCREDIBLE GAME!!! It's very hard, but still one of my favorities games of all time. The mechanics and art style are so good and beutifull. For me, it's a very unique gameplay and you should buy 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trans women goes climbing makes the best game ever. The music and art are phenomenal and the gameplay is some of the most rewarding a platformer game can ever be. 10/10\n\nMight make you a girl however.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very cozy and fun platformer game to play.\nThe bgm are very bopping and the story is about... climbing mountain yeah?\nMovement is very fluid and if you're not confident with it... well you explode... a lot...\nOverall a very exciting game for a platformer while also can be very challenging on some part.\n...\n\n\n\n\n\n\n\nYou will die a lot in this game, soo get some rest if it's too much. The amount of time I quit and continue is too many too count but eventually you can do it.\nOnly c side and moon berry to complete this....and i am not doing the golden berry...\n(Edit: I did it.... 7C was hell but I push through.. finally finish this game with an overall total of 15971 death...worth it...now to rest up hahaha)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game, though incredibly difficult, and not for the faint of heart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just finished the game at 100%. Please remove the 100%strawberry, It's the only achievement I cheated cause It's really annoying to find them all. I can understand the moonberyy achievement but the first one need to be removed. Else it's a really good game, you need to buy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice and satisfying game.\nI really love the style and music and yeah i dont have anything to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took me a while to actually play this from when I bought it, but I finally sat down and just played it. Genuinely this is probably one of my favourite games in terms of just gameplay and story, not a lot of games can bring me to tears, but I cried a fair bit. Game is superbly relatable and having some mental health conditions makes it more relatable. Beautiful game, beautiful music.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "playing this game feels like im bashing my head against a brick wall until it breaks only to be met with another brick wall and looking ahead and its just hundreds of brick walls\n\nI understand why people like it and i think it is a good game, but playing the game is just so tedious for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OMG this is the best platformer game that i have ever played. at hardly any point did i feel like the game didn't feel satisfying to play, let alone did something wrong. what a masterpiece of a video game. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of my favorite games of all time. Its story can mean so many different things to so many different people. It meant a lot to me when I first played it and it means a lot to me when I replay through it. Besides that, the gameplay is really fun! A sides are tough, but not too hard for most. B sides are for those who want a challenge. C sides are for those who really want a challenge. Get the game. Play it. Enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite platformer games, only other one that compares is hollow knight, 10?10 i've beat the game on xbox and am now re-beating it on steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Movement is so enjoyable, storytelling is great, and every new thing you learn is either taught to you, or is unnessesary to beat the game (except a part in farwell)! Just dont give up and stay DETERMINED!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ngl this game is genuinely amazing, but its just that Im strictly a keyboard player and its hard to just do things in the game. This problem might be fixed if i just play the game long enough, but right now my thumb is kinda bruised up tryna press my spacebar to jump which is my default key and any other key would feel off. \r\n\r\n\r\nOverall though, this game is actually peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cannot get past expert too difficult :( anyways i love celest i love celest i love celest i love celest i love celest i love celest  or something like that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is my favourite game of all times \nreally love this game \nand i love modded maps \nmasterpiece :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i need to finish celeste but so far its a lovely game, cute graphics, difficult gameplay, thats that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice story music and gameplay it pretty much has everything and optional challenges too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I'll contribute my \"recommended.\" Nothing else to say that other reviews haven't said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, the controls are snappy and responsive. (still fumbling the dash directions on a gamepad though)\n\nHad a nice story and if you want to you can challenge yourself with fully optional side quests and strawberries and such.\n\nCan recommend if you can tolerate dying a few hundred times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It lives up to the Hype i was hearing about. It can get frustrating somethimes tho, like i dont know where to go at certain places, i like all the hidden things, it feels nice discovering them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love his game it’s just so good, the player moves so good and the storyline is 5 stars. This is the best game ever.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Ok, sure, this is a good game, and the team has put a ton of work in it. \nBut it's still a PRECISION platformer. Which leads me to the core problem, and to Celeste special feature : \"inclusivity\" through the assist mode.\n\n I almost made it to the summit without assist mode, but then I reached the flag number 9, and there, everything went down the drain. I spent FOUR hours dying in repeat because I wanted to reach the end of the game in default mode, without assistance. But life is short, and I was starting to feel I was getting trolled. So yes, I switched to assisted mode... and passed the flag in 30 seconds. \n\nBut once this was done, there were no turning back : I immediatly lost the taste for the challenge of the eight remaining flags, and stayed in assist mode to see the end. To me, it was \"OK you cheated once, so the victory isn't your anymore\". But than I felt super frustrated, because I was almost there without assistance, so I restarted Chaper 7 from scratch, without assistance, I fought my way back to this freaking flag 9. But, as I felt is was less a matter of skill than a matter of \"know how\", I watch a YT video to undertsand what I was doing wrong. Seems that, though I spent more than twenty hours on the game, this flag had a peculiar logic I wasn't able to guess. After the video, it took me like 10 minutes to get to flag 8. So, sure, as I'm editing this review, I \"finished\" Celeste. But I feel I didn't. And, as I had to watch a playthrough, I feel I never finished the game. The accomplishment isn't mine. Sure, at least the game showed me that I had the perseverance to 1/ try four hours long while being stuck 2/ redo the whole chapter to get things done the legit way. But in the end it left a very bitter taste in my mouth.\n\nSo, where am I going with this personal story ? I think that, for a game which pretend to be inclusive, benevolent, or whatever you wanna call it, a game which repeats you that \"each death is a lesson,\" and that there's no shame to use the assist mode, it fails.\n\nFirst, dying four hours in a row didn't teach me anything : I already knew how to open a freaking YouTube tab to watch a playthough. \n\nSecond, if the game is so hardcore that I need an assist mode, it doesn't make me \"accept\" myself. It just makes me stuck in an impossible dilemma : losing hours of my life and feeling like s**it because I can reach the end by myself, or succumbing to the assist mode and feeling like I didn't earned to see the end in a noble way. \n\nThree : it's precision platformer, indeed, so it's not that much about reflexes and mecanichal skills then it is a matter of learning pattern by heart for long sections (like reach flag 2, with the feather). \n\nThis said, the game has great pixel art, OK from great music (not my favorite type of chiptune, especially when I'm stuck four hours with the same track but some of the quietest tracks are really beautifull) and a real artistic vision. The game masters storytelling by gameplay. Its flaw is its paradoxical, almost double bind, approach to self-care. Maybe the Dark Souls ways better : the series assume that you had to get good enough, and if not, yu can stillenjoy the lore and the graphics by watching let's plays. \n\nMaybe it's for you, and it got critical acclaim anymay, but for me the whole Flag 9 bulls**t ruined the whole experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I got lost at some point, as it wasn’t clear what exactly I was supposed to do. I expected a fun mechanical challenge, but instead I found complex navigation. Overall, it felt much less dynamic and entertaining than other games in the same genre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Here's the thing: I love the game, the story is great, and the platforming is fluid, but there are constant crashes, to the point where it is basically unplayable. It has crashed upwards of 20 times so far, and I estimate that I have lost 3+ hours of gameplay because of it.\r\nHere is the crash log:\r\n\r\nCeleste Error Log\r\n==========================================\r\n\r\nVer 1.4.0.0\r\n3/12/2025 1:56:02 PM\r\nSystem.OutOfMemoryException: Insufficient memory to continue the execution of the program.\r\n   at Microsoft.Xna.Framework.Helpers.GetExceptionFromResult(UInt32 result)\r\n   at Microsoft.Xna.Framework.Graphics.GraphicsHelpers.GetExceptionFromResult(UInt32 result)\r\n   at Microsoft.Xna.Framework.Graphics.GraphicsDevice.Present(tagRECT* pSource, tagRECT* pDest, HWND__* hOverride)\r\n   at Microsoft.Xna.Framework.GraphicsDeviceManager.Microsoft.Xna.Framework.IGraphicsDeviceManager.EndDraw()\r\n   at Microsoft.Xna.Framework.Game.EndDraw()\r\n   at Microsoft.Xna.Framework.Game.DrawFrame()\r\n   at Microsoft.Xna.Framework.Game.Tick()\r\n   at Microsoft.Xna.Framework.Game.HostIdle(Object sender, EventArgs e)\r\n   at Microsoft.Xna.Framework.GameHost.OnIdle()\r\n   at Microsoft.Xna.Framework.WindowsGameHost.RunOneFrame()\r\n   at Microsoft.Xna.Framework.WindowsGameHost.ApplicationIdle(Object sender, EventArgs e)\r\n   at System.Windows.Forms.Application.ThreadContext.System.Windows.Forms.UnsafeNativeMethods.IMsoComponent.FDoIdle(Int32 grfidlef)\r\n   at System.Windows.Forms.Application.ComponentManager.System.Windows.Forms.UnsafeNativeMethods.IMsoComponentManager.FPushMessageLoop(IntPtr dwComponentID, Int32 reason, Int32 pvLoopData)\r\n   at System.Windows.Forms.Application.ThreadContext.RunMessageLoopInner(Int32 reason, ApplicationContext context)\r\n   at System.Windows.Forms.Application.ThreadContext.RunMessageLoop(Int32 reason, ApplicationContext context)\r\n   at System.Windows.Forms.Application.Run(Form mainForm)\r\n   at Microsoft.Xna.Framework.WindowsGameHost.Run()\r\n   at Microsoft.Xna.Framework.Game.RunGame(Boolean useBlockingRun)\r\n   at Monocle.Engine.RunWithLogging()\r\n\r\nIf this does not have to do with the game, and is instead a hardware issue, I will change this to a positive review, but for now this is my stance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd like the start this with saying I'm a very competitive player, As a casual gamer I'm sure this game will be a unforgettable experience, The art for the game is truly incredible, the music and audio are some of the best I've heard in any game, The story is one of a kind. However I can't get pass just how truly AFWUL the platforming is, as of writing this I have done everything but the moon berry and collect all golden strawberries and the hitboxes and pure hatred I feel to the late 2 chapters are unmatched. Chapter 8 is easily the worse level in the game not a single hitbox even closely matches anything the fireballs, ice balls, the bumpers, either I clip almost fully inside and don't die, or not even touch the object and die, with no in-between, Every chapter has this issue with the different elements added to each, with not every chapter having issues, the red and blue spikes scattered across the whole game are also poorly implemented citing the same hitbox issues, Something I'd like to say is when the game Isn't railing me from poor hitboxes a lot of the later levels are insanely fun, with chapter 5 c-side being easily my favorite level, but all the hitbox issues and general frustrations, I have with the game that feel out of my control push it to a negative review, but if you actually enjoy playing games without needing challenge and the what not, complete ignore this review, this is a good game, with flaws I can't forgive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My biased take after finishing the main game is that it's simply too unrewarding, and I completely understand the 35% drop in players who got Chapter 1 achievement vs last Chapter achievement.\nIf you're interested in trying it out primarily because of the overwhelming hype, don't.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was looking forward to playing this game but instead I got stuck on the title screen with no way out. The files were installed correctly, everything was fine, it just didn't let me play the game no matter what I did. Waste of 30 dollars, definitely getting that refunded.\n\nto the people finding this funny this is an actual situation i couldnt fucking play the game i had to get it refunded and i probably wont get to ply this probably awesome game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After trying this game again after a long break, I can say for certain that I don't think this game is nearly as good as people say. It does everything I don't like about modern platformers, mainly, obnoxious mechanics. Almost every mechanic used in Celeste, when introduced, is fun and engaging, but after 10-15 rooms with it, the rooms become extremely annoying and just borderline unfun. I am honestly tired of hearing such high praise from people for this game when I just can't see how anyone could possibly find this game play loop enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love the game but it was just too hard for me. I died more than 500 times at the boss level and gave up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was so excited for this game, and I have been looking forward to playing it for a long while - But I just cant understand the hype. I think there are a lot of people who have hopped on the hype train due to the political weather... so to speak. Sorry, but I have to say nope!\n\nRight off the bat, the controls are just absolutely awful. You can remap them, but as a native KBM player - not being able to map the mouse to anything is a big glaring black mark - as its reflexively more comfortable than forcing my right hand to use keyboard controls. The controller isn't quite as bad, but playing on joystick makes any diagonal mechanics a nightmare because of stick sensitivity. Apparently there are 3rd party programs you can use to allow mouse binding - but really? No... That's just ridiculous - I mean how hard is it for the game to recognize a mouse input for key bindings? Plenty of games do it... this isn't a new concept and so many people have asked for it...\n\nThe jump after dash and diagonal dashing (specifically diagonal-down) does not seem to consistently work making it feel like the controls are constantly fighting me. Its a precision platformer, adjust expectations right? I get it - yeah yeah- just get good... I love platformers and the precision ones, while they give me hell - I usually love them... but I just cant be bothered. At only 3 hours in - I am already not having fun with this. I expect many deaths, I expect having to try a lot and fail a lot. But I feel like them adding 'accessibility mode' to the game, where you can turn off all the mechanics with infinite dashing, god mode, etc... they are aware of the flaws, and just said \"Oh please play our game, we will let you cheat!\" Yeah... no thanks.\n\nAdditionally, Why cant you look around the immediate level to plan the route? I really don't think that it would take anything from the gameplay allowing the player to plan a few steps ahead of them. You'd still have to fail plenty while training the coordination to carry out the path.\n\nI just can't recommend this with the terrible controls, the politically aligned plot, and the dismissive \"accessibility\". Its already bordering irritation and feels like there is no reward for the players perseverance. I have yet to see any reason to keep playing as it just lays out room after room of the same kind of levels with no payoff.\n\nAlthough the music and visuals are quite beautiful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i like the game but there are no tgirls in my dms, disappointing 0/10 where are my tgirl baddies ??",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a platformer game that breaks the laws of physics. how disgraceful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dev funds IDF, MOSSAD, AIPAC, ADL and JNF.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the pc controls and key binds is so bad what",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SHOUDVE COST MORE oh wait I got it for 4.99 lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Madeline is a self-insert",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its bad just bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has too many good reviews, which is why I'm giving it a negative rating. Btw, this game is absolute BANGER.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what the hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my eyes!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not liked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Art,music,feel and theme overall felt really good. But the movement just made me feel geniuenly disgusted, I know I could change and I tried, but it really just wasn't fun to control. I get that's suppose to be a hard game, but the game itself should be hard not the goddam controls. If you are use to Arrow keys and ZXC then give it a try, but this is just not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got lost at some point, as it wasn’t clear what exactly I was supposed to do. I expected a fun mechanical challenge, but instead I found complex navigation. Overall, it felt much less dynamic and entertaining than other games in the same genre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Here's the thing: I love the game, the story is great, and the platforming is fluid, but there are constant crashes, to the point where it is basically unplayable. It has crashed upwards of 20 times so far, and I estimate that I have lost 3+ hours of gameplay because of it.\r\nHere is the crash log:\r\n\r\nCeleste Error Log\r\n==========================================\r\n\r\nVer 1.4.0.0\r\n3/12/2025 1:56:02 PM\r\nSystem.OutOfMemoryException: Insufficient memory to continue the execution of the program.\r\n   at Microsoft.Xna.Framework.Helpers.GetExceptionFromResult(UInt32 result)\r\n   at Microsoft.Xna.Framework.Graphics.GraphicsHelpers.GetExceptionFromResult(UInt32 result)\r\n   at Microsoft.Xna.Framework.Graphics.GraphicsDevice.Present(tagRECT* pSource, tagRECT* pDest, HWND__* hOverride)\r\n   at Microsoft.Xna.Framework.GraphicsDeviceManager.Microsoft.Xna.Framework.IGraphicsDeviceManager.EndDraw()\r\n   at Microsoft.Xna.Framework.Game.EndDraw()\r\n   at Microsoft.Xna.Framework.Game.DrawFrame()\r\n   at Microsoft.Xna.Framework.Game.Tick()\r\n   at Microsoft.Xna.Framework.Game.HostIdle(Object sender, EventArgs e)\r\n   at Microsoft.Xna.Framework.GameHost.OnIdle()\r\n   at Microsoft.Xna.Framework.WindowsGameHost.RunOneFrame()\r\n   at Microsoft.Xna.Framework.WindowsGameHost.ApplicationIdle(Object sender, EventArgs e)\r\n   at System.Windows.Forms.Application.ThreadContext.System.Windows.Forms.UnsafeNativeMethods.IMsoComponent.FDoIdle(Int32 grfidlef)\r\n   at System.Windows.Forms.Application.ComponentManager.System.Windows.Forms.UnsafeNativeMethods.IMsoComponentManager.FPushMessageLoop(IntPtr dwComponentID, Int32 reason, Int32 pvLoopData)\r\n   at System.Windows.Forms.Application.ThreadContext.RunMessageLoopInner(Int32 reason, ApplicationContext context)\r\n   at System.Windows.Forms.Application.ThreadContext.RunMessageLoop(Int32 reason, ApplicationContext context)\r\n   at System.Windows.Forms.Application.Run(Form mainForm)\r\n   at Microsoft.Xna.Framework.WindowsGameHost.Run()\r\n   at Microsoft.Xna.Framework.Game.RunGame(Boolean useBlockingRun)\r\n   at Monocle.Engine.RunWithLogging()\r\n\r\nIf this does not have to do with the game, and is instead a hardware issue, I will change this to a positive review, but for now this is my stance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd like the start this with saying I'm a very competitive player, As a casual gamer I'm sure this game will be a unforgettable experience, The art for the game is truly incredible, the music and audio are some of the best I've heard in any game, The story is one of a kind. However I can't get pass just how truly AFWUL the platforming is, as of writing this I have done everything but the moon berry and collect all golden strawberries and the hitboxes and pure hatred I feel to the late 2 chapters are unmatched. Chapter 8 is easily the worse level in the game not a single hitbox even closely matches anything the fireballs, ice balls, the bumpers, either I clip almost fully inside and don't die, or not even touch the object and die, with no in-between, Every chapter has this issue with the different elements added to each, with not every chapter having issues, the red and blue spikes scattered across the whole game are also poorly implemented citing the same hitbox issues, Something I'd like to say is when the game Isn't railing me from poor hitboxes a lot of the later levels are insanely fun, with chapter 5 c-side being easily my favorite level, but all the hitbox issues and general frustrations, I have with the game that feel out of my control push it to a negative review, but if you actually enjoy playing games without needing challenge and the what not, complete ignore this review, this is a good game, with flaws I can't forgive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My biased take after finishing the main game is that it's simply too unrewarding, and I completely understand the 35% drop in players who got Chapter 1 achievement vs last Chapter achievement.\nIf you're interested in trying it out primarily because of the overwhelming hype, don't.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was looking forward to playing this game but instead I got stuck on the title screen with no way out. The files were installed correctly, everything was fine, it just didn't let me play the game no matter what I did. Waste of 30 dollars, definitely getting that refunded.\n\nto the people finding this funny this is an actual situation i couldnt fucking play the game i had to get it refunded and i probably wont get to ply this probably awesome game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After trying this game again after a long break, I can say for certain that I don't think this game is nearly as good as people say. It does everything I don't like about modern platformers, mainly, obnoxious mechanics. Almost every mechanic used in Celeste, when introduced, is fun and engaging, but after 10-15 rooms with it, the rooms become extremely annoying and just borderline unfun. I am honestly tired of hearing such high praise from people for this game when I just can't see how anyone could possibly find this game play loop enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love the game but it was just too hard for me. I died more than 500 times at the boss level and gave up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was so excited for this game, and I have been looking forward to playing it for a long while - But I just cant understand the hype. I think there are a lot of people who have hopped on the hype train due to the political weather... so to speak. Sorry, but I have to say nope!\n\nRight off the bat, the controls are just absolutely awful. You can remap them, but as a native KBM player - not being able to map the mouse to anything is a big glaring black mark - as its reflexively more comfortable than forcing my right hand to use keyboard controls. The controller isn't quite as bad, but playing on joystick makes any diagonal mechanics a nightmare because of stick sensitivity. Apparently there are 3rd party programs you can use to allow mouse binding - but really? No... That's just ridiculous - I mean how hard is it for the game to recognize a mouse input for key bindings? Plenty of games do it... this isn't a new concept and so many people have asked for it...\n\nThe jump after dash and diagonal dashing (specifically diagonal-down) does not seem to consistently work making it feel like the controls are constantly fighting me. Its a precision platformer, adjust expectations right? I get it - yeah yeah- just get good... I love platformers and the precision ones, while they give me hell - I usually love them... but I just cant be bothered. At only 3 hours in - I am already not having fun with this. I expect many deaths, I expect having to try a lot and fail a lot. But I feel like them adding 'accessibility mode' to the game, where you can turn off all the mechanics with infinite dashing, god mode, etc... they are aware of the flaws, and just said \"Oh please play our game, we will let you cheat!\" Yeah... no thanks.\n\nAdditionally, Why cant you look around the immediate level to plan the route? I really don't think that it would take anything from the gameplay allowing the player to plan a few steps ahead of them. You'd still have to fail plenty while training the coordination to carry out the path.\n\nI just can't recommend this with the terrible controls, the politically aligned plot, and the dismissive \"accessibility\". Its already bordering irritation and feels like there is no reward for the players perseverance. I have yet to see any reason to keep playing as it just lays out room after room of the same kind of levels with no payoff.\n\nAlthough the music and visuals are quite beautiful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i like the game but there are no tgirls in my dms, disappointing 0/10 where are my tgirl baddies ??",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a platformer game that breaks the laws of physics. how disgraceful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dev funds IDF, MOSSAD, AIPAC, ADL and JNF.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the pc controls and key binds is so bad what",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SHOUDVE COST MORE oh wait I got it for 4.99 lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Madeline is a self-insert",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its bad just bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has too many good reviews, which is why I'm giving it a negative rating. Btw, this game is absolute BANGER.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what the hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my eyes!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not liked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ok, sure, this is a good game, and the team has put a ton of work in it. \nBut it's still a PRECISION platformer. Which leads me to the core problem, and to Celeste special feature : \"inclusivity\" through the assist mode.\n\n I almost made it to the summit without assist mode, but then I reached the flag number 9, and there, everything went down the drain. I spent FOUR hours dying in repeat because I wanted to reach the end of the game in default mode, without assistance. But life is short, and I was starting to feel I was getting trolled. So yes, I switched to assisted mode... and passed the flag in 30 seconds. \n\nBut once this was done, there were no turning back : I immediatly lost the taste for the challenge of the eight remaining flags, and stayed in assist mode to see the end. To me, it was \"OK you cheated once, so the victory isn't your anymore\". But than I felt super frustrated, because I was almost there without assistance, so I restarted Chaper 7 from scratch, without assistance, I fought my way back to this freaking flag 9. But, as I felt is was less a matter of skill than a matter of \"know how\", I watch a YT video to undertsand what I was doing wrong. Seems that, though I spent more than twenty hours on the game, this flag had a peculiar logic I wasn't able to guess. After the video, it took me like 10 minutes to get to flag 8. So, sure, as I'm editing this review, I \"finished\" Celeste. But I feel I didn't. And, as I had to watch a playthrough, I feel I never finished the game. The accomplishment isn't mine. Sure, at least the game showed me that I had the perseverance to 1/ try four hours long while being stuck 2/ redo the whole chapter to get things done the legit way. But in the end it left a very bitter taste in my mouth.\n\nSo, where am I going with this personal story ? I think that, for a game which pretend to be inclusive, benevolent, or whatever you wanna call it, a game which repeats you that \"each death is a lesson,\" and that there's no shame to use the assist mode, it fails.\n\nFirst, dying four hours in a row didn't teach me anything : I already knew how to open a freaking YouTube tab to watch a playthough. \n\nSecond, if the game is so hardcore that I need an assist mode, it doesn't make me \"accept\" myself. It just makes me stuck in an impossible dilemma : losing hours of my life and feeling like s**it because I can reach the end by myself, or succumbing to the assist mode and feeling like I didn't earned to see the end in a noble way. \n\nThree : it's precision platformer, indeed, so it's not that much about reflexes and mecanichal skills then it is a matter of learning pattern by heart for long sections (like reach flag 2, with the feather). \n\nThis said, the game has great pixel art, OK from great music (not my favorite type of chiptune, especially when I'm stuck four hours with the same track but some of the quietest tracks are really beautifull) and a real artistic vision. The game masters storytelling by gameplay. Its flaw is its paradoxical, almost double bind, approach to self-care. Maybe the Dark Souls ways better : the series assume that you had to get good enough, and if not, yu can stillenjoy the lore and the graphics by watching let's plays. \n\nMaybe it's for you, and it got critical acclaim anymay, but for me the whole Flag 9 bulls**t ruined the whole experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game reminded me why I hate precision platformers.\n\nI really wanted to love Celeste. Everyone raves about it... the touching story about mental health, the beautiful pixel art, the soundtrack that's supposedly transcendent. I can see why people connect with Madeline's journey. The anxiety metaphors are thoughtful, the presentation is polished, and there's clearly a lot of heart poured into this game. But no amount of narrative depth can make me enjoy dying 47 times on the same screen because I mistimed a dash by 0.2 seconds.\n\nPrecision platformers demand a very specific kind of patience and muscle memory that I simply don't find enjoyable. Every death in Celeste is supposedly a \"lesson,\" and yes, the respawns are lightning-fast, but that doesn't change the fundamental loop: attempt, fail, repeat ad nauseam until your fingers finally cooperate with your brain. It's not that the game is unfair - the controls are tight, the mechanics are clear - it's that this style of gameplay brings out the worst in me. The mounting frustration. The clenched jaw. The \"just one more try\" that turns into an hour of my life I'll never get back.\n\nThe game keeps telling me to \"just breathe\" while simultaneously designing situations that make me want to throw my controller through a window. There's something almost patronizing about a game that says \"you can do this!\" while putting strawberries just out of reach, taunting you with collectibles that require frame-perfect execution.\n\nI understand why Celeste resonates with so many people. The metaphor of climbing a mountain as overcoming your inner demons is powerful. But sometimes a mountain is just a mountain, and sometimes I just want to enjoy a game without feeling like I'm studying for a reflex exam.\n\nIf you love precision platformers, you'll probably adore this. If you're like me and this genre makes you question your life choices, maybe skip this one.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is not at all wheelchair accessible. Would not recommend, 0/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art,music,feel and theme overall felt really good. But the movement just made me feel geniuenly disgusted, I know I could change and I tried, but it really just wasn't fun to control. I get that's suppose to be a hard game, but the game itself should be hard not the goddam controls. If you are use to Arrow keys and ZXC then give it a try, but this is just not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got lost at some point, as it wasn’t clear what exactly I was supposed to do. I expected a fun mechanical challenge, but instead I found complex navigation. Overall, it felt much less dynamic and entertaining than other games in the same genre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Here's the thing: I love the game, the story is great, and the platforming is fluid, but there are constant crashes, to the point where it is basically unplayable. It has crashed upwards of 20 times so far, and I estimate that I have lost 3+ hours of gameplay because of it.\r\nHere is the crash log:\r\n\r\nCeleste Error Log\r\n==========================================\r\n\r\nVer 1.4.0.0\r\n3/12/2025 1:56:02 PM\r\nSystem.OutOfMemoryException: Insufficient memory to continue the execution of the program.\r\n   at Microsoft.Xna.Framework.Helpers.GetExceptionFromResult(UInt32 result)\r\n   at Microsoft.Xna.Framework.Graphics.GraphicsHelpers.GetExceptionFromResult(UInt32 result)\r\n   at Microsoft.Xna.Framework.Graphics.GraphicsDevice.Present(tagRECT* pSource, tagRECT* pDest, HWND__* hOverride)\r\n   at Microsoft.Xna.Framework.GraphicsDeviceManager.Microsoft.Xna.Framework.IGraphicsDeviceManager.EndDraw()\r\n   at Microsoft.Xna.Framework.Game.EndDraw()\r\n   at Microsoft.Xna.Framework.Game.DrawFrame()\r\n   at Microsoft.Xna.Framework.Game.Tick()\r\n   at Microsoft.Xna.Framework.Game.HostIdle(Object sender, EventArgs e)\r\n   at Microsoft.Xna.Framework.GameHost.OnIdle()\r\n   at Microsoft.Xna.Framework.WindowsGameHost.RunOneFrame()\r\n   at Microsoft.Xna.Framework.WindowsGameHost.ApplicationIdle(Object sender, EventArgs e)\r\n   at System.Windows.Forms.Application.ThreadContext.System.Windows.Forms.UnsafeNativeMethods.IMsoComponent.FDoIdle(Int32 grfidlef)\r\n   at System.Windows.Forms.Application.ComponentManager.System.Windows.Forms.UnsafeNativeMethods.IMsoComponentManager.FPushMessageLoop(IntPtr dwComponentID, Int32 reason, Int32 pvLoopData)\r\n   at System.Windows.Forms.Application.ThreadContext.RunMessageLoopInner(Int32 reason, ApplicationContext context)\r\n   at System.Windows.Forms.Application.ThreadContext.RunMessageLoop(Int32 reason, ApplicationContext context)\r\n   at System.Windows.Forms.Application.Run(Form mainForm)\r\n   at Microsoft.Xna.Framework.WindowsGameHost.Run()\r\n   at Microsoft.Xna.Framework.Game.RunGame(Boolean useBlockingRun)\r\n   at Monocle.Engine.RunWithLogging()\r\n\r\nIf this does not have to do with the game, and is instead a hardware issue, I will change this to a positive review, but for now this is my stance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd like the start this with saying I'm a very competitive player, As a casual gamer I'm sure this game will be a unforgettable experience, The art for the game is truly incredible, the music and audio are some of the best I've heard in any game, The story is one of a kind. However I can't get pass just how truly AFWUL the platforming is, as of writing this I have done everything but the moon berry and collect all golden strawberries and the hitboxes and pure hatred I feel to the late 2 chapters are unmatched. Chapter 8 is easily the worse level in the game not a single hitbox even closely matches anything the fireballs, ice balls, the bumpers, either I clip almost fully inside and don't die, or not even touch the object and die, with no in-between, Every chapter has this issue with the different elements added to each, with not every chapter having issues, the red and blue spikes scattered across the whole game are also poorly implemented citing the same hitbox issues, Something I'd like to say is when the game Isn't railing me from poor hitboxes a lot of the later levels are insanely fun, with chapter 5 c-side being easily my favorite level, but all the hitbox issues and general frustrations, I have with the game that feel out of my control push it to a negative review, but if you actually enjoy playing games without needing challenge and the what not, complete ignore this review, this is a good game, with flaws I can't forgive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My biased take after finishing the main game is that it's simply too unrewarding, and I completely understand the 35% drop in players who got Chapter 1 achievement vs last Chapter achievement.\nIf you're interested in trying it out primarily because of the overwhelming hype, don't.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was looking forward to playing this game but instead I got stuck on the title screen with no way out. The files were installed correctly, everything was fine, it just didn't let me play the game no matter what I did. Waste of 30 dollars, definitely getting that refunded.\n\nto the people finding this funny this is an actual situation i couldnt fucking play the game i had to get it refunded and i probably wont get to ply this probably awesome game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After trying this game again after a long break, I can say for certain that I don't think this game is nearly as good as people say. It does everything I don't like about modern platformers, mainly, obnoxious mechanics. Almost every mechanic used in Celeste, when introduced, is fun and engaging, but after 10-15 rooms with it, the rooms become extremely annoying and just borderline unfun. I am honestly tired of hearing such high praise from people for this game when I just can't see how anyone could possibly find this game play loop enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love the game but it was just too hard for me. I died more than 500 times at the boss level and gave up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was so excited for this game, and I have been looking forward to playing it for a long while - But I just cant understand the hype. I think there are a lot of people who have hopped on the hype train due to the political weather... so to speak. Sorry, but I have to say nope!\n\nRight off the bat, the controls are just absolutely awful. You can remap them, but as a native KBM player - not being able to map the mouse to anything is a big glaring black mark - as its reflexively more comfortable than forcing my right hand to use keyboard controls. The controller isn't quite as bad, but playing on joystick makes any diagonal mechanics a nightmare because of stick sensitivity. Apparently there are 3rd party programs you can use to allow mouse binding - but really? No... That's just ridiculous - I mean how hard is it for the game to recognize a mouse input for key bindings? Plenty of games do it... this isn't a new concept and so many people have asked for it...\n\nThe jump after dash and diagonal dashing (specifically diagonal-down) does not seem to consistently work making it feel like the controls are constantly fighting me. Its a precision platformer, adjust expectations right? I get it - yeah yeah- just get good... I love platformers and the precision ones, while they give me hell - I usually love them... but I just cant be bothered. At only 3 hours in - I am already not having fun with this. I expect many deaths, I expect having to try a lot and fail a lot. But I feel like them adding 'accessibility mode' to the game, where you can turn off all the mechanics with infinite dashing, god mode, etc... they are aware of the flaws, and just said \"Oh please play our game, we will let you cheat!\" Yeah... no thanks.\n\nAdditionally, Why cant you look around the immediate level to plan the route? I really don't think that it would take anything from the gameplay allowing the player to plan a few steps ahead of them. You'd still have to fail plenty while training the coordination to carry out the path.\n\nI just can't recommend this with the terrible controls, the politically aligned plot, and the dismissive \"accessibility\". Its already bordering irritation and feels like there is no reward for the players perseverance. I have yet to see any reason to keep playing as it just lays out room after room of the same kind of levels with no payoff.\n\nAlthough the music and visuals are quite beautiful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i like the game but there are no tgirls in my dms, disappointing 0/10 where are my tgirl baddies ??",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a platformer game that breaks the laws of physics. how disgraceful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dev funds IDF, MOSSAD, AIPAC, ADL and JNF.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}