{
  "positive": [
    {
      "review": "Played it for a little bit, had fun. Will return.",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "spent 2 hours defending a bridge, then spent another 2 fighting for atleast 4 inches of soil. play this game NOW!",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Definition of Endless fun. You can just hop into any front, do any task, and you're set.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Honestly, one of a kind. There's no games like it (at least until Anvil Empire comes out).\r\n\r\nTeamwork is the whole reason the whole game works.\r\n\r\nPlaying solo is possible, but if you want to experience the game fully you need to play with others, that can be just some radom you met near the frontlines or a regiment of seasoned players organising hex wide operations.\r\n\r\nThere's a role for every type of players in this game, from those who love fighting, to those who are pure support. From material logistic, to medical. From the simple infantry with a rifle and one ammo clip, to the crew of a Battleship showering targets with hundreds of 150mm shells.\r\n\r\nThere  is a role for everyone.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "A game where rock eaters fill the front line and dads are in the back!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "this game is hands down one of my all time best i can hop in on any time and jump in a front and play and the community is like no other",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The community needs purged of trolls and broccoli cuts, but other than that the game is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Foxhole is the only game where you can spend hours hauling supplies, blow up on a pebble, and still call it fun. Everyone builds everything, everyone needs everyone, and someone will always steal your truck. Chaos, teamwork, and accidental heroism. Loved every minute.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've played now for almost 20 hours and I still have no idea what I'm doing, it's awesome! Definitely a game designed for those of us with a touch of the Tylenol.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great experience if you find the right people. Relies on communication for a lot of logistics, it has acceptable variety for different playstyles, and detailed systems that give it some depth which makes it unique.\r\nNotable Cons:\r\ntoxic clans, lots of bugs regarding vc connection(which make the game near unplayable with how significant of a role vc has)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Opened the game, joined the front line, guy played Churchills speech as we charged the enemy landing on the beach. 10/10\r\n\r\nBest game I've played. Feel part of something, make your gameplay have purpose to a greater whole, choose how you play, roleplay with others, laugh at the people that take it way too seriously, and have ball. Just try it, trust me.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The persistent war of Foxhole rewards players who invest in its Byzantine mechanics just as much as someone who only logs on to take part in the daily meat grinder of an endless war. This game is cool as hell and they just keep adding to it. If you've always wanted to buy the game, this is me telling you that I think you oughtta.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game but the community is insufferable, and very s3xually confused and seem obligated to let everyone in chat know.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honestly? one of a kind, i remember hearing about this as a kid of a YT vid/shorts of a game that lasted days, and now i bought it when it was on sale played on the Charlie server and man i love Colonials and their aesthetics! my first war on a pretty late one, it was stagnant as hell with regions constantly switching, had my first last stand on the Heartlands but also not really moving forward and then suddenly the Wardens broke and now i'm a colonial again, i still have much to learn, i bought this game to further improve my English and hopefully i get enough courage to actually talk instead of just listening.\r\n\r\nOne critique i do have to say though, the tutorial isn't really much of a tutorial ngl.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game in the market for warsims IMHO. Can't describe it, you have to experience it. So I'll focus on what kept me from playing it for some time and how I was wrong.\r\n\r\nThe Clans can be toxic that is true, but it's isolated and echoes a lot more which is also cool cuz it prevents future incidents. Most people are cool. Lot of unwritten MMO game specific social rules you will have to get adjusted over time. If you don't, you will be shot by your teammates, and it will be your fault. Accept that.\r\n\r\nYou can achive anything and everything alone, it just takes time.\r\n\r\nIt's ok to lose equipment, everybody does, just make sure it's not something abhorant.\r\n\r\nThe game is boring sometimes, you have to find your fun and sometimes it's not there. Log out, it's fine, come back tomorrow.\r\n\r\nDon't LARP too hard.\r\nMake sure you do LARP dough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is the BEST game if you're all about teamwork! It has an original gameplay idea. The top-down view instead of it being FPS or TPS is also nice. The fact that the PLAYERS SHAPE THE GAME is what I love the most. The guns that you are supplied with, are made by other players that mined for the materials, worked the raw materials, made the guns from the worked materials and in the end, brought the gun to the frontline! Doing the logistics part is actually enjoyable and not at all frustrating!  If you have the money, BUY IT ! I recommend joining a regiment for it being more fun. Its better with friends, so encourage them to buy it also. I will see you on the front on the Colonial side!\r\nI love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game with a variety of things to do. \r\nYou like logistics, driving, either backline or frontline? Foxhole got you.\r\nManaging factories and resources? Foxhole got you.\r\nFighting at the front? Foxhole got you.\r\nNaval, tank, and soon (tm) airborne fights? Foxhole got you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Foxhole is a game where all aspects of it are fun. You could be a frontline soldier, medic, front or backline logi player and the interactions with yourself and our players truly bring out best in this game but from that pool of players worst come out to ruin the fun of all the people around them just because \"It's funny\" or \"It's for roleplay\". I had an interaction with one of those people, he had kill me almost after his first couple messages. So I was probably using a leary shellbore 68mm to kill infantry in a desperate attempt to keep the last of this gun alive in the trench just 3 shots, three kills and the events leading up can make a even longer story filled with pain and kindness from the enemy. but to make this short, me and one other person had defended five of these and this was the last one because of mammon rush's and poor trench placement (five of them in one trench line shelling us. turned there heads into paste) I had to use before. this had me moving shells from near broken ones to the next saving up to at least 60 shells in the last gun before we where free to push back at dawn. then we there pushed back on the second night fight to this time i had completely survived this till my execution by this person so I just left at that time. I was locked in and was not looking at chat (and I don't turn voice chat because my headphones I use don't receive or put out so I just use chat but I think this person use it either. see in a future situation) and this person said something like \"stupid sgt or ssgt don't use gun\" after killing me. this guy was like 1 or 2 ranks ahead of me. looking back at it a couple later it could be some what justified. (In the eyes of someone who just what's to be  killing in the name of ). Till I saw this same man a war later executing a different man on the same team(Glory to the Wardens) and he only speaks about that the entire time in chat I see him except to say \"ty\" to medics(good on him). And one other time I encountered this killer he proves just here for an excuse to team kill. And with many hours on this game there will aways being toxic and I still have smaller story's of people being toxic to lower ranks that may have a complex series's of events of heroics leading up to an outburst that someone has. But don't let one moment ruin the complete game just the time as it happens. This is my first ever review on a game and it would be nice to see what I can do to improve and what you think.( sorry for any spelling mistakes I made this in the middle of the night)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an awesome game, I have personally never seen any other game really like it. \nTwo factions constantly at war you choose a side which you are locked to for the war you have selected it.\nWant action head to a frontline with \"high\" friendly population and you'll have it, ask around for help if you need any, people will give it! \nWant a more calm time? Logistics front or backline and building may not get the adrenaline pumping but can turn the tides of the war for your faction.\nReally you are just a small cog in a big machine no matter your playstyle but no matter your playstyle you can make a big difference \"It's not the size of the machine in the cog, but the cog in the machine\" or however that saying goes. \nFor new players just getting into the game I would suggest following any man who utters the words \"mammon rush\" like a dog, you'll have a great time! \n\nWould recommend for sure. Great multiplayer game where playing a session for almost any amount of time can result in a memorable experience. Better with a group/clan or so I've been told all my hours up to this review are \"solo\", aside from meeting up with people in game \"in hex\" randomly and joining a mission.💙💙💙💙💙",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the best game I ever played it's like a WW1 WW2 but it's not It's different\r\n\r\n10/10 will play this for a hella long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good the logistics all of it is good production lines and al that stuff is fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: The game is good, don't listen to people saying its bad because most of the time they have thousands of hours and want to complain. Buy the game, ask for help from clan members or randoms and you will almost certainly have a unique experience that could very well hook you.\r\n\r\nFoxhole's ratings dip and rise in time with its major issues which are numerous and its major updates which are, by and large, also numerous. The playerbase has a huge veteran population that treats the game as almost a second life and tend to be the most outspoken and therefore most seen group in the game's discourse. \r\n\r\nLet me be clear, this game is amazing. There are very few games with a focus on logistics. In Foxhole, every building, weapon, vehicle, and even bullet are produced by players mining, refining, producing, and then transporting to the front. Due to the size of the playerbase, if you fight in the same area a week later, you will almost certainly see several names that you have seen before on both sides and therefore makes this game heavily community driven.\r\n\r\nA word of advice, stay away from reddit, the discord, and some select youtube videos that are focused toward's \"balance\". Due to the inheriently asymetrical factions in the game, it can be easy to convince yourself that a weapon is unbalanced. This is because often times you will be right, the thing though is that there is hundreds of different forces counter balancing the unbalanced nature of a weapon weather it be your faction's own unbalanced weapons, the way tech progresses, or even the player culture that each faction's community cultivates.\r\n\r\nTry the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spawned in, couldn't tell friend from foe, got shotgunned to the face in a trench raid, got in a tank, ran over half the enemy team by falling into the trench.\r\n\r\n10/10 game that nails grunt fantasy extremely well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used to play Planetside 2 to get the feeling of a persistent war between factions. Since the game basically died, Foxhole has been the one game that really recreates the same feeling and makes it even better with logistics, with much more types of equipment and tactics. \n\nI've fought long grinding battles for a single bridge with maybe hundreds of deaths, small skirmishes where we went back and forth, winning a small position then losing it again immediately. Had days where we barely had any equipment to fight with, stealing whatever we could from dead comrades and enemies, having no way to harm tanks. Other days we were spoiled, having copious amounts of heavy weapons and ammo, yet we won on that day where we had nothing but lost when we had everything.\n\nBe prepared to cooperate with other players as fighting alone is usually quite limiting but still possible especially if the circumstances allow it or the battle is big.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its one of the best game i have played.community is very kind one of the best if not the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Foxhole is a great game with a great Idea and I need about 15-20 minutes to explain to someone what this game is and even longer to explain why I like it so much XD Ill save you the time and just recommend you watch a youtuber named Robertluvsgames who explains it best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ну очень плохая игра, так как, там нет мода на фурри фембо.... o_O есть?!\r\n10/10 всем советую! (только если играть компанией, иначе фембойчики уже не тянут)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got blown up repeatedly by artillery and got run over by my sides tanks 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an amazing game to play with your friend , community is suprisingly friendly  if you are looking for an addictive game with your friend , go buy it and light ur smoke and  play and suddenly u see  time fly .....  1000 form 1000  <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has something for everyone. Fantastic game, persistant world war that lasts untill one side win...then it starts all over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have played for 6.7 hours, and i have prob collected around 67 hundread supplies, but anyways this is a great game, def do u tube tutorials for beginners bc youll be stuck like i was",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "polite community, organized war, from every bullet you shoot to every soldier that carries it. it is all counted. to win the war. you must learn to be a part of something bigger. I just love the feeling of being important.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FoxHole is one of the few MMOs that makes use of the \"Massive Multiplayer\". This is not a solo game, every action you take will impact the war in at least a small way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game ever...If you like war then this is it as realistic as it can ever get but don't come into it think its an fps or smthing u are just one small cog in a big machine trying to win the great war between two massive giant factions that goes on 24/7 and lasts for months on ends sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t listen to people talking about getting reported for taking a truck they probably hit a lot of people and got a 20min vehicle ban. The game is great and has many great people don’t let one or two not so great people take you away from how great the great people are.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game might not fully click with me; but both the game itself, the devs, and the community are awesome\r\n\r\nit defo is hard to get into as a newby (nvm if ur not a hardcore gamer beforehand); as this game has very different mechanics as any other game ive played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cant believe i havent written a review for this game\n\nits awesome i love this game so much but i cant rlly play it due to work n college\n\ngreat game, i really recommend playing it on a weekend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is such beauty in the occasional role-play. I love the battles even if I win or lose, the melee is my favorite because I am biased towards it. And the best part is that people are chill and love the game. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy shit. The simplicity of jumping in, yet the complexities of a grand war happening and you being a cog in the machine....is incredible. Eve-Online level industry and logistics matched with an easy combat system (hard to master and figure out how to not be fodder at first). If you keep in mind this is not a runner/gunner platform you wind up dying less. This game is a constant war of attrition between two factions - in the best way possible. A battle for a bridge might last hours or even days with very little gain on either side up until someone might forget to run logi to restock bandages. It's flowing constantly. \r\n\r\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's really nothing else like it. It's slow af but if you're OK with spending more time staring into the void than actually shooting the tactical play is second to none.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is complex but fun when you get the hang of it, its best to watch a few guides on how to do stuff ahead of time, Freerk is a good channel for that. Joining a Regiment is a good idea, doing everything solo will burn you out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The facility requires more resources.  The BB requires more resources. FEED THE FACILITY!!!  FEED THE FRONT LINE BB!!!\r\n\r\nI have played both Coli and Warden. Siege Camp has done a good job in the last couple updates to adress some of the balance issues that were previlent in this game a year or even two years ago.  Each side has its strengths.  Each side has its colitions and political agendas.  With that said, you can still find a different and fun time no matter what you do.  If you get bored with one thing, there is something else you can always find.  For example, Roleplay medic on front line.  lots of fun.  Sit at a facility and feed it while you watch a movie. also fun and relaxing.  Tank battles on front line, learning curve , but fun.  Just running around roleplaying that you are looking for your cat. genious.  There is always something to do.\r\n\r\nOnly negative is, there is ALWAYS SOMETHING TO DO.  This last commend coming from someone who is a dopamine chaser and its sometime hard to stop doing the things.\r\n\r\nNew players, I would find a new player friendly regi to learn the ropes.  There are some quality of life teachings that I think will make your life easier, such as refinery, seaport, depot etiquette that will not anger a random LT.  Also, know that ranks dont matter, commends are just a way to reward random acts, and logi players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What if Euro Truck Simulator had war crimes?\n\nSNEAKY GIT GIMME MY TRUCK BACK\n\nand then I decide to turn the tables and become the sneaky git stealing trucks\nAnd then all of a sudden there's a tank blasting away at the bunkers I was hiding in. RUN!\nI got away and the tank just kept blowing up empty bunkers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the coolest war sim/action game there is there are so many possibilities of how the war could go or what you can encounter on the battlefield the only downside i see to it is that as a solo it feels overwhelming and kind of boring to play ever since i joined a clan this game has been a blast though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best strategy war game with more mechanics with how everything is run than any other game out there. Highly recommended. Get your friends involved. Choose a side, create a regiment, and have so much fun together strategising how you will beat the enemy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game, although i do accept some things are OP, both sides have their fair share of OP things wich in my opinion balances out the game and creates this feeling of an actual war where both sides fight each other with different equipment, overall, the comunity has been very nice most times and it is very easy to have a fun time.\r\n\r\n100% would get blown up by warden artillery again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is So much fun once you get into it. And community makes it so much better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the game i little bit.\r\nHere is couple things to remember:\r\n-You will die a lot \r\n-You will die a lot by artillery \r\n-You will die a lot by enemy tanks\r\n-You will develop PTSD by the  amount of 120s and 150s dropping on your spawn point\r\n-You will witness a lot of people die in front of you\r\n\r\nGetting blown up or getting shot at is part of this game.\r\nWardens or collies it doesn't matter what faction you pick have fun and always remember ''PRAISE CALLAHAN''.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredible experience, the friendliest community I've ever met. Everyone is on Voip and its just a great war with good social mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i opened the game and hopped into the war, got shot in the face by collie and then i respawned and some officer asked me to do artillery with him and we killed a 100 collies for the one who shot me 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard working devs \nGood player base \nSo much drama in each team \nBut still fun game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an unique MMO where you're not the main hero, or a superhuman, but only one cog in the machine that is war. \n\nYou are not collecting lootboxes and shooting down everybody, you are a part of the team. \n\nEverybody has a role, be as an infantryman, a tank driver, artillery loader, medic, facility man, working in the factory to make supplies and weapons, driving a train so that you can bring those supplies to the front. You are only a guy with a pistol and a hammer, and everything else you use is produced by somebody, brought to the front. \n\nYour life is worth next to nothing, and you will accomplish very little, like an ant. This is a great game to meet other ants, play with others, have fun. When you have some overview of the anthill, it is absolutely satisfying to watch the front line to move very little, day, by day, hour, by hour.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i spawned 2 chunkes  away took me an hour to get to the front lines i made it tho then i heal and fight, after all that  i died when wardens where pushing 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is overwhelming in the amount of stuff to learn and do, but it's a lot of fun. I got on RobertLovesGames' Discord server, found someone to show me the ropes pretty quick, go blown up by a tank twice, shot to death once, loved it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game for a total of 155 Hrs and still have no clue what im doing but its fun 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How many times can I simply run supplies and enjoy it, turns out quite a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Prepare your kit, walk to the frontlines, get blown up by artillery, start over again.\r\n10 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amasing game that you do not need to put a lot of time in to but you can if you want to have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game isn't for everyone.  The top-down camera throws people off, threw me off for quite a while.  But I love the logi in this game.  The fact that everything I make is making the difference on the frontline makes me happy :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have YOU ever wanted to get shellshock from the constant artillery shelling on your bunker?\nHave YOU ever wanted to have PTSD from when your bunker was on fire, and all your teammates were screaming for their life, trying to find a way out?\nHave YOU ever wanted to die of cold, beccause there was a shift in wheather, and there weren't enough parkas in your base for every soldier?\nHave YOU ever wanted to die a gruesome death of asphixiathion, because gas granedes also exist in this game?\nHave YOU ever wanted to do algebra in your head to try and predict where your own artilery barage might land, while also trying to guess how wind affects your shot, because thats a thing too?\nHave YOU ever wanted to get a master degree in neighberhood politics, facility building and burnout prevention, just to build a tank?\nHave YOU ever wanted to learn an entire wiki page full of slang terms ([url=https://foxhole.wiki.gg/wiki/Slang] You can find it here [/url]) just to know what everyone is talking about?\nHave YOU ever wanted to join one of the most dedicated and helpful community of artists, youtubers, devs, and players in general?\nHave YOU ever wanted to form long lasting friendships with people who enjoy the suffering as much as you do?\n\nWell do I have just the game for you...",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is what an MMO should be. It has a steep learning curve but its worthi it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, I love charging to death with 20 other randoms as we get mawn downed by a MG nest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got indoctrinated into a group of people against my will we then proceeded to do many tank runs it was fun as hell",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Nothing comapres or ever will, great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very addictive game, lots of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is awesome until you realise it needs to be your second job in order to have fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So much content -- so many things to do. \r\nIf you are a do-er this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good, best on ADHD stimulants.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not to be played for fun. but to be played for win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak gaming, there is no feeling quite like watching a front collapse because you cut off their logi routes. There are issues but overall its an incredible war sim that really turns you into one of the cogs of the machine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like that there are roles that you can get yourself acquainted to and dedicated to before you understand the scale of the entire game. The idea of being a cog in the wheel is very fun to me, but sometimes you can rise above and pull off a handy breakthrough with a few good kills to clear up an area and progress forward. The whole logistics and engineering stuff I am still yet to learn, and I love these things more than the fighting itself, so that is something I am looking forward to learning! And still, scavenging, fighting, and supplying munitions on the front lines has still been addictive. Fighting for the colonials in Charlie War.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The vibes of this game are unmatched. While the mortars can get a little annoying, the overall sound has this ambiance to it that feels like the gears of war are turning. \n\nPeople will remember your name and greet you. Getting a kill feels great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "- I played\r\n- I stuck with it for more than 200h\r\n- I had PTSD after the war 127, dreamed about the front line even after it ended\r\n-  Great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game cured my depression.\r\n\r\nThis game also gave me said depression in the first place.\r\n\r\n4000 hours later. I'm in a depression limbo. \r\n\r\nWould still recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played it once and had a blast but haven't touched it since. It was fun, I should really play it again sometime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love logistic games and no game did it better than foxhole \r\nthe scale of logistics is insane since without logistics all the weapons and ammo would end in day 1 \r\ncrafting tanks, ships and weapons to support the frontline and the frontline holding an area for days using the stuff we made in logistics just give it a sense of satisfaction no other game can give.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At the end of my first war I never would have imagined I'd lose myself for 474 hours. This is what foxhole did to me. I'm now a cog in the warmachine. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is the only game that i have played consistantly for the past 3 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "screamed for Callahan for like 5 hours straight. My family thinks I am crazy for real now. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Can be a little grindy, but is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You will start digging in your butt after playing this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Insane game, should have a lot more players!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "exactly like live die repeat. Who needs to ask for more?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, buy it, you will have fun!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I WANT IT TO SUCK MORE!!!\r\n(Peak game, I love dying)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never have I felt more useful, and useless, at the same time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Makes you feel like an ant in a colony in the best possible way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun unless you play the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game I’ve ever played. (Unironically)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with amazing moments",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WW1 meets GTA2. Beautifully wartorn landscapes.. a voracious variety of logistical loop love.. and of course a constant crusade of carnage to purge the lands of the evil other guys.. 9/10 Highly recommend. Get in the trench and try to love someone :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every middle age males dream who watched the old History Channel of the 2000s.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ONE of the best games i have ever played really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, would recommend to anyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is a good game, if you like see  how to do war",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is like a full time job. very good game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is alot more fun in a clan",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very well made and alot of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ever want to fight in war? WELL NOW YOU CAN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak team work i runover a person ever day",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Is it a fun game? Yeah\nIs it a toxic game? Oh baby yes\nFilled with people who flame you if you do smth wrong rather then explaining the game and will activley be toxic in chat. Thats about it from me",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Game is full of reddit trannys  and the devs will ban you for having fun. Its a dog shit game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I tried having fun with it and in the end I can't say I recommend it. Not if you want to play this as a solo oriented player.\r\nFoxhole sure is a unique war game and it offers a lot of different things to do, but none of them are particularly well made, at least not in the way I would like. It is a competently made game, albeit with some QoL issues. A lot of the negative reviews complain mostly about bad actors and the time sink that it can be, but I wouldn't say those are the biggest problems. Certainly not the community. The players are great.\r\nI'd say a lot of my negatives come from some sort of game dev's over-reliance on players taking care of each other and making the fun, if that makes sense. I'll try explaining it.\r\n\r\nThe first major thing is the learning curve, which is garbage. I believe that a game should be a feature complete product in the sense that it teaches you everything you need to know... which Foxhole fails at horribly. \r\nYou get on your starter island and try doing a boring tutorial. It has several sections, but I wouldn't be surprised if everyone gave up after 15 minutes of combat tutorial, which is what I did. Thankfully that is enough to let you try out being a frontline rifleman without being a detriment to your team.\r\n\r\nHow does the game explain things outside of the tutorial? Not well. The tooltips are too basic to stand on their own, there is no manual and there are no relevant hints popping up whenever you get your hands on something new. \r\nAnything other than the most basic or self-explanatory things must be explained to you by a veteran player. I can't imagine how lost must new players be if they aren't already military nerds.\r\n\r\nThe second major thing is the utter lack of feedback. This game is completely barren when it comes to things showing up on the screen, with the sound design also being too minimalistic.\r\nHow do you know you got injured by a shot? You see blood on your character. No red screen edges, no camera shake, no health bar. Keep in mind that this is a top-down game where your soldier is almost a speck on the screen and your focus is usually far away where the enemy in your crosshair is. I have seen many players not respond to getting shot.\r\nHow do you know if you are suppressed? You get a small shield icon at the bottom of your screen. Once again, too subtle.\r\nHow do you find out you are on fire? The game literally tells you with a small message in bottom left. Yes, I am not joking. Characters are mute and there is no such thing as flames appearing in your screen for visual feedback.\r\n\r\nAnd then there's the gameplay itself. There are way, way too many boring, uninspiring tasks where you achieve your goal by holding a button and waiting.\r\nConstruction & repair is done by approaching a building and holding LMB while resources are being taken away from your pockets. No additional button prompts.\r\nHauling via truck is done by driving with the stupid keyboard controls up and down the same road, waiting for the supplies to load slowly while you have it parked. Honking passerby's is usually the only thing you get to alleviate the monotony. Manually placing the boxes in the truck? Listening to the radio? Delicate steering? Not a thing.\r\nWhat about sniping people? Wait roughly ten seconds for the crosshairs to align with the target. If the target moved, wait again.\r\n\r\nPlaying as the medic is the most fun I had, but half of it is just holding LMB untill the patient is healed. Furthermore, it is unnecesarily hard to actually target the injured soldier.\r\n\r\nI will say that I got immense joy when I delivered critical supplies and got congratulated for it. Or when a player approached me after a battle and personally thanked me for my medical duties... but I cannot rely on these uncommon moments.\r\nLet me say once again that I do not recommend the game as a solo player. I'm sure you can have loads of fun coordinating things with friends and clan members, or maybe by playing it very casually like Farming Simulator, but it really isn't a game for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, however it's becoming worse to try to get into it.   Consistent login issues during peak times with either massively unplayable lag or just not being able to join a shard at all and loosing connection within minutes.\r\n\r\nAlas I'd like to think its down to my internet but it's not. Pretty sad about it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Played for a bit. The Community is ignorant garbage. Everyone demands you do things for them or they will just shoot you. If you try to build something, they will probably get mad because its in the way of something else. Plenty of drama playing with the intel or logistics side of players. I had more fun throwing ally tanks into the ocean than I did trying to play this game with others.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not terrible, but it lacks integral UI standards. It purposely gives poor communication and game mechanics that narrow you into building and blowing up bunkers with an absorbent amount of resources. This requires a level of grinding that only a large group can actually provide but they spend so much time running facilities that the complete and utter lack of hierarchy (in the army?) means that the vast majority of resources are wasted by inexperienced players or uncoordinated units doing random stuff.\r\n\r\nIt's not worth it and hits its cap for the average gamer pretty quickly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "1 Not friendly for new players\n2 Sat in my library for like 5 months\n3 \"tutorial\" if you wanna even call it that is over 2 hours to fully do, causing you to not be able to refund\n4 idk if it was just me but it felt horribly optimized \n5 everyone was oddly rude to me for no reason\n6 many additional rules that you have to find out by being yelled at (basically number 1)\n8 Regret buying it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2/10 seems like a sick game and i want to play but the player base has been nothing but hateful every time i try to play. They literally just throw you into the game, the tutorial islands suck straight cheeks at preparing a new player. I couldn't figure out how to do anyting ut die on the front for 2 hours or run around the back and midline and get yelled at by some squad when I do anything, like fuck I'm trying to learn and then they just flame you when you ask for help.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have never complained about balance in my life, and I've been playing video games since 1999.  I'm running out of explanations why the developers would favor one side so heavily in a game where you become attached to your faction. Do the devs hate collies because they're Canadians and more Americans play on collies?  \n\nWarden tanks, navy, artillery, infantry and lore are more interesting and fun to use.  Their logi lines are shorter on average, and they have most defensive choke points. \n\n50% of Colonial players think there's a dev bias against them, meanwhile 17% of wardens do  from a reddit survey of 300+ players.  \n\nSo why not play warden?  Oh wait, they already have more veterans on warden. I wonder why that is?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I can't believe that a game that's in development for 8 years has such horrible quality of life features:\n\n1. People download autoclickers to play this game to avoid holding down LMB when building. How hard is it to spend 2 days implementing a \"toggle LMB\" in the game? You already have toggle sprint.\n2. Midline logistics is already martyrdom, but somehow hovering over a depot STILL shows the items in order of quantity, rather than grouping them in some way that makes sense.\n3. Why is color coding item icons a mod? 8 years to not have it in the base game?\n4. The \"save loadout\" system is an example of \"programmer UX\". It would be much better if you could pin your favorite items to the top of the list AND if you could queue retrieving multiple items in advance (if the bmat value is below a  certain threshold).\n5. Why do I get a 30sec respawn timer after spawning and immediately getting killed by arty? I didn't run at an enemy face first to lose a shirt, don't punish me\n6. There is nothing that this game does to make midline logi fun. The mini-mechanics like gear shifting are given to taurine haulers rather than flatbed. Frontline logi is already rewarding because the trips are short, trucks are very fast, and you get commends. Taurine haulers even look like they drift when they turn. Flatbed players get nothing. By the way, if your hand hurts from holding \"W\", the *bug* (not a feature) is to press ENTER, CTRL+W, ENTER so that the truck drives on its own. No, you can't chat when \"W\" is synthetically pressed during that time.\n\n----\n\nUltra low TTK weapons like Volta, Hangman, Booker, Fuscina should not exist in the game. Spawning and picking up a loadout is tedious and takes time, so every player life has \"value\" because nobody wants to die and pick up a loadout all over again and run to the frontline. If you face off the tediousness of picking a loadout with getting randomly plinked by Volta as you come out of someone's nighttime fog of war without having time to react, you understand why a player can get frustrated.\n\nThe decision to make sniper rifles use 7.62mm ammo instead of 8.5mm is mind boggling to me for the same reason. Again, picking up a loadout and running to the frontline is tedious and nobody wants to do it. Snipers tend to play with some Call of Duty type mindset where they target you for the sake of getting a kill, not because you are a high value target (e.g. gunner of a halftrack). This is also frustrating as some regular Argenti+2 clip chump, since it's not an \"even fight\".\n\nThe devs intentionally hide the player population on each faction to hide their incompetence.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game gives a promise it can't fulfill and leaves with a terrible impression of itself \n\nThe core gameplay revolves around 2 things: battle and logistics. \n\nThe battle part is a typical top-down shooter, you point and shoot, that's it. This part works great... as long as you are playing infantry which has a wide range of weapons and tools. If you enjoy top-down shooters for the sake of them, you will like this game, for the most part. The bad about battle is everything that isn't infantry, all vehicles are terrible and don't act as such really, they are damage sponges with a weapon and your experience from using them will surely be terrible because: there is no such thing as armor really (it acts as chance of taking damage), you simply take damage from all AP weapons directly to your HP pool, once it reaches 0 your vehicle turns black and you die. Essentially every tank is measured by how much HP it has, and its DPS, very arcadey (to be fair, there are many gimmicks but they are minor), this arcadey feeling is also everywhere about actually the battle roles of the vehicles, their design is non-sensical and explicitly makes tanks even less useful on a battlefield that already can't utilize any of the IRL benefits of having a tank apart from having a damage sponge that is quite easy to kill anyways because actual shooting range is almost nothing and every battle is close-quaters battle allowing for banzai attacks for infantry to throw grenades which is hard to counter and even if countered the price of the attempt is extremely small compared to losing even a single tank. An example of non-sense would be that one of the faction's tanks have no anti-infantry weapons meaning that they are not simply vulnerable to infantry but are utterly helpless to any infantry attack even having friendly infantry around to help out and can't really support an infantry push because of the lack of tools to kill or suppress enemy infantry.\n\nIf the battle part can be liked or hated, the logistics part is straight up time sink designed to make the game harder which is alright but the very process of producing and delivering supplies to the front lines is a tedious experience of doing the same thing over and over with no real aim or purpose. During one of the wars on Charlie my regiment (212th Colonial) basically held on our backs the entire logistics for several days because people got burnt out and refused to do anything risking us losing the war. We grinded productions for many hours just as the deliveries and despite us saving our faction from utter collapse it only showed me how pointless all of this was and playing logi is basically doing chores but in a virtual world.\n\nThere are good parts of the game but heed my warning, better go read Plato or learn like anything useful instead of wasting your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The cool moments you saw online are few and far between, 90% of this game is janky aiming that is impossible at most angles just because the red line says so and 20 min sessions of driving across the map just to get ambushed before the last stop because 1 single dude snuck around the entire front. The only fun to be had is saving people as a medic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not recommend this game, developers do not know what the word balance means and are considerably biased towards one faction over the other.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game in not rewarding, feels like a job and the devs do not care about players experience, balance between factions or anything. They just make one or two updates each year, with new vehicle and weapons and dissapear again. The game does not need additional toys but someone that care enough about it to solve it's issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't stay connected for more than 10 minutes, nothing works to troubleshoot it, even with perfectly fine system requirements",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth it. Squads will Team kill you just because they want to horde resources. Can't do anything except fight with pistols since these squads horde everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent 8 hours building a base for C3T clan to come destroy it because it was too close to one of their pipes.\n\nhad a good time before getting griefed tho",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "one of most worst games I tried to play\n\nfriends are killing you, because they thinking you standing in their base\nfound normal people - new problems - voice chat is not working\nwant to add them in my friends to restart game...maybe voice chat will somehow work - not found adding in friends option\n\nI really don't understand who liked this game. Do you even played other games? \nDon't waste money like me, don't buy it. It is not good game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I could give this one a neutral review, since clearly it is not for me. I think that it lacks much of what make modern military games interesting: progress tracking.\n\nYou don't know how many enemies you killed (and it doesn't tell you if you killed someone at all), how much you helped in the war effort, who killed you, nothing.\n\nProgress didn't have to be new guns, skins, etc. It could simply be badges and medals to show on your profile or something like that. \n\nIn the end it felt kinda pointless to respawn once again without knowing if I'm helping or not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Quality of life needs urgent improvement. Otherwise a chill game for older people to spend time in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unbalanced game, Devs do not fix know issues and just try to push more stuff into a game that badly handles what is already in it. Worst is the issue with know cheats that are not adressed by the Devs at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What if you wanted to steamroll the wardens but Devman said: \"you are 7th in queue to deploy\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well i play this for long time and it feel like if ur not on the wordons time u never win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sucks game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Games super trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balance is bad",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i rewieved Foxhole 1-2 years ago, i would say its worth your money and time but... at the curent state - no\nNo if you're not ready to leave your job, college etc. just to.. ride trucks for supply\n\nDevs keep updating the game, adding new stuff which is good.. i would say, but with all these updates it became a game for CLANS, if you're a student, or have real job - you wont have any time to play it. You can have a squad of 4, 6 people, but it wont make your farm for resources any easier, you will spent hours and hours to just ride the truck from point A to point B, maybe to build yourself a tank, maybe to build your own base\n\nAnd if you're a solo player and dont want to have any buisness with big clans, well... you can enter to shoot your rifle or mg for few hours and thats it, its all gameplay you can get as solo player here. \n\nAnd yes Foxhole community, not everyone want to spend hours to grind, try to join an clan, and live in this game.\nGame wont tell you that you HAVE to play in a clan, or in a big squad. It looks just like a cool shooter with elements of bulding at steam page, but in reality its euro truck simulator.\n\nI want to play it, but with new systems, with how HARD it is to do refined materials (AND that your truck can carry only a little, if we speak about an base) i just cant, its timeconsuming, its not a game, but a JOB.",
      "voted_up": false,
      "votes_helpful": 257
    },
    {
      "review": "enjoy the game but not the player base, you take an unlocked car to check out the map and the whole region starts spam reporting you and calling you a collie on an alt, cant just enjoy the game anymore, playerbase treats it as their entire life",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Is it a fun game? Yeah\nIs it a toxic game? Oh baby yes\nFilled with people who flame you if you do smth wrong rather then explaining the game and will activley be toxic in chat. Thats about it from me",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The lag is becoming unbearable, glitching, rubber banding, phasing through the map, not being able to shoot, it seems that the more time goes on, the less playable the game is.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "only review I will ever post; do not get invested into this game; if you make a name for yourself you can and will get spam reported by in-game regiments, in all essentiality high-school cliques, which will completely limit your ability to play this game. All it takes is a handful of users to dm each other, take 3 seconds to click on your username and hit submit, and you will no longer be able to play this game, with them facing zero consequences or retribution. It starts with a 60m ban, then a 12h ban, then a 3d ban if you're lucky, then a 2w ban and the cycle repeats 3 times until you get an \"indefinite ban\". Developer moderation is utterly obsolete and or essentially non-existent; game includes a link for a ban appeal option (which let's be honest, any game that you pay for outside of a free to play should have no such thing as player moderation restricting use of the game itself/others being able to decide whether or not you should be able to play a game that you yourself have paid for is complete bafoonery), and brings you to a page for the \"developer website\" that includes a log-in for the so-called moderators (quite literally outsourced call center-esque Pakistani national tech support) right next to where they want you to create a log-in account to make a ban appeal request (what kind of shitty web-development is that amirite not even a separate page for \"your\" so-called \"employees\"). After you submit a request, some guy named Hakeem will bring up your account 8 days later on his ROG Strix while he's sitting in his mother's basement in the favelas of some fucking third-world country who knows where for his 3 hour, 1 day a week, 13 shillings an hour remote job, take 5, maybe, MAYBE 10 minutes tops to go through your entire in-game text history, and, upon finding literally anything that you have ever typed in local chat not SFW PC that you wouldn't type on your child's iPad under the supervision of your work's entire HR staff, under the supervision of an entire sanctimonious congregation of nuns, while under the advisement of a democratic congressional hearing, will be quoted, sent back to you, and your ban appeal denied, 3 to 4 business days after the ban had expired, even though you were reported for saying that and quote \"There is an empty artillery piece right there, why don't you fire that one too\". Even if you previously had the gall to inquire whether your fellow infantrymen prefer Camel or Marlboro, it will be used as an absolute reckoning for your inability to play a game that you have unequivocally spent payment on. Multiplayer in this game is about as satisfying as playing Wolfenstein with your mother-in-law's liberal stepson, and quite literally as enjoyable as getting sent to HR to take 1000hrs of inclusion training. In summary, do not play this game if you are not a practicing Jehovah's Witness, frontrunner for the Democratic convention, an abstaining catholic monk, or currently wearing a chastity ring. And especially, if you are one of the few who wishes that video games could go back to being video games, and believe that the peak of entertainment was the in-game voice chat of the real MW3, when men could be men and put the harsh realities of life aside for just a moment, to share the real, pure moments of gaming and insult each other without care. You will be sorely disappointed until you get lynched out of this game. Work culture has truly seeped into every corner of society, even your precious online pastimes. When playing a video game is inseparable from being grilled in HR for your IG handle, you truly start to wonder if Ted, or even Kurt, were right all along. My heart goes out to you brothers. Godspeed.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "People have multible accounts so dont think of doing big things anything and evereything is done using alt accounts in another faction. Developers dont care focusing on other things so dont buy this and put your time into it for nerds to magicly get in your base or magicly a truck with explosives is found. Do not start you will regret wait for a update that will deal with this.\n\nRevising its even worse now theres ques in all the places you can play. If you accidently go to another hex theres a hole web to go true to make sure you keep your reserved spot ect causing for alot of issues",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Foxhole is a cool game. The sad part is the community is not as cool.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game is full of reddit trannys  and the devs will ban you for having fun. Its a dog shit game",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "not my best second impression, I tried learning how to make a factory only to not even have the room to build one due to the clutter of factories and bunkers everywhere and when I spawn in I get friendly killed by some Russian dude cause I somehow was trespassing in their factory even though it was on top of a spawn point on the main map, I tried getting back into this game but it was just turned into A annoying experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "QoL infantry -> kill inf gameplay\nQoL Build -> kill build gameplay\nWhats next ?\n\nVery good game but all the last maj since 1.0 are total trash, dev wont listen community about true problem and QoL needed.\nBut at least we got new tank, boat and plane !",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "im a neutral faction guy and love the game but heres a problem LUNAIRE IS TOO OP FOR EVEN BOTH FACTION DEVMAN FIX IT",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too difficult game with extremely mean and aggressive community. I was trying to give the game a fair go. Then I logged in and it says I've been banned indefinitely due to violating their rules. What rules? Not sure, the website's link was broken when I tried to check and I never got an email from an admin explaining what I did \"wrong\". Don't recommend this game. Terrible customer support.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Naval in this game is in the current moment impossible.\nThe last big update introduced anti naval cannons with no counterplay that are after the second half of the war all over the map.\nIn the regions that there are non of those. There are artillery shelters that make it impossible for ships to kill for example bunker cores. If a ship attacks anything succesfull the enemy can instandly rebuild it.\nIm in a huge naval regiment and we are not doing anything because there is nothing to do for ships in this game.\nBut the worst part: The developers know they killed naval and just delete all the Player complains in the official discord",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Toxic community, which is supported by developers banning players for enough reports from the same clan.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it feels like most of the time I am waiting for something to happen there just is not much action the battles are fun when they actually happen its just not my kind of game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "God the devs dont even play there own game and then add thing they think will make the game better but in the end 10000% more work and pain and suffering",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "if you dont have a job and love being unemployed and joining discords and attending \"clan trainings\" then uh this is for you. otherwise its ass.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "walking sim that expects you to put your entire life into the game for a lobby that doesnt end for weeks. dont buy this game, go play a real tactical teamwork game like arma 3",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has become very clique-y and it's no fun as a casual, solo player. The only real game-play without a big clan backing is frontline soldiering and medic duties.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played this game since it first released and it's the worst it has ever been at this point, too much bias towards one side and the addition of snipers in this game make infantry combat cancerous especially when one side gets a better sniper rifle than the other, just really unbalanced and broken at the moment.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Your border logic is broken. People with logi getting 30+ queues. Men with rifles walking up to border with no prio, just logged in, walking right across.\r\n\r\nCrashed three times, \"lost connection to host\" all in the 30 minutes I tried to wait in queue. I'm done trying.\r\n\r\nI used to love this game. I wish I could still play it.\r\n\r\nFix your broken game @DEVS. Airborne is your last chance before it dies forever.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Everything is intentionally slow and tedious, and there's time gates, all on purpose to foster cooperation between players, but it feels artificial. You can't play this casually, the game doesn't respect your time and demands a lot of it. The only casual thing you can do is drop to the front line, which consists of dancing and peeking the fog of war at the edge of your screen. You probably won't get to use any tanks or heavy weapons, because you need to grind out and craft those, and they take a team to operate. Not a solo casual game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the game is fun and all but you will encounter people who dont care the effort you put in to get the supplies to the frontline and will activley do everything they can to grief and make your life hard, locking your vehicle on purpose so you cant use it, throwing all your grenades you bring just so your team cant use them, driving away with vehicles that are activley being used and bringing them to the enemy to use or to blow up, Good on surface but its a game that you will burn out on very fast just because the toxic community who doesnt respect the fact that new players want a good experience but they have played for 10 years so they feel entilited to ruin everything your trying to accomplish, Bad game, dont buy",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Hello.\r\nI am a newbie, but already very frustrating. The game as tactical shooter is not bad. But social laws are awful. In 2 weeks I see a lot of scam facts. Charlie, 14 war. Someone burned our (warden) public fuel facility in the north on Integrum. But before this, there were scouts alts. And they wretched fire truck and hide it down of rock, so, yes, technically it was not destroyed (but this can be done easily, more down was sea), but there was impossible to drive it up. Obviously it were scout alts. At the same time, server Able, map Isawa. Btw II very like this location. It was wardens. Only one collie soldier killed me and takes town hall to collies. I was reborn in BB and went to town haul to take it back. I meet two alts (collies played warden), both was russian, but one of them lied that he is a pole. They said, that I must go with them to fight collies. They just transfer me on motoboat deep inside collie territory and leaved me on boat without fuel. And I was not able to jump back from home location, because town hall was captured. Also, by the way, they destroyed  a listening device, a warden listening device on collie territory. Just disassembly it and drop on the ground. What is interesting one collie real soldier, who did real thing, was supported by two alts. The proportion 1:2.\r\nWell, after that I saw a lot facts of collie alts. The common their tasks: scouting security information (game map), pointing enemy artillery, destroying listening devices, stealing and hiding vehicles. But it was alts, this easily detected by low ranks and low game statistics.\r\nBut now, on Charlie, I met something new. The whole collie clan PKKA changed faction and go for wardens with real characters. We was a neighbor on the island and they invited me to the russian clan. First of all, despite  they played for warden (first time, several other wars was for collie), they still was collie. In the voice chat they was glad when collie wins and call this like \"our victory\". Second, they begin just stealing everything. Any vehicles, even when they don't need. Just because they can. All vehicles on the island, all ironships that they can see packed on the beach (near Conclave), lied me, that it was not locked. But I checked before, it was. Well, they tried at this moment don't steal vehicles from me, but they still it, when they didn't know that is my. For instance, the lives on very south of Partisan island, they stole my crane that I set up on the very north near mines, to unload fuel there from an ironship. And they stole my crane from EOC, when I borrow it to them. And EOC was forced to bring me a new crane from Conclave. Later I wrenched cranes and I saw that both was stolen by PKKA. That why there was conflict, I was disagree with such behaviour. Also, I tried to build public fuel station on oil facility and they sabotage my work just by installing 2 oil well on oil field near my base, while there own base was very far from. And question is to very they constantly load shipping containers full of public cargo in Conclave? There is no seaport on Partisan island. Is this possible to simply load containers full of public warden crates and bmaps and simply transfer it to collie?\r\nAll of this was tolerable yet. But after this they just came to my base, when I was online and steal my landrunner with concrete, I saw this. They unload my concrete and returned on my landrunner for oil from oil wells. I killed both of them and blow my truck and... My weapon was blocked and I sure they complained me for \"friendly fire\". Game not only don't protect from thieving, but also game protect enemy thieves from common people.\r\nAll of this very disappointing. The game was planed as global conflict, war of honor people. But instead this game about scam, thieving, dishonor, lie and betrayal. And game mechanics encourage all this.\r\nI understand when before, also collie, but honor callie, came to my base, was three waves of attacks, they fight fiercely and died like heros from my hands. But at last they destroyed my crane and 120 concrete on palette. Well, game is game and they partially win.  I understand, when some later the collies gunboat destroyed my base, returned later, destroyed husk of my base, I lost everything, and begin from the beginning. Well, the game is game, it was honest. But why exactly the same collie (but without honor) can just come to my base and steals everything, what they like? And I am totally unprotected from this, instead the game protect thieves from me. I was in real army, there this was simply impossible, no one can cross secured perimeter, no matter what uniform they wear. Anyone will be arrested and killed or killed in place.\r\nWell, this game gave me a lot good and strong emotions, but.. The game is deeply ill and project will die, if this problem will not be solved.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "игра максимально сырая, в ней нет ничего, кроме токсичности дотеров, не ведитесь на обзоры на трубе - медийке всегда будет интересно играть из-за бесконечного числа подсосов",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really in depth game, very original idea and for the first few days I played the hell out of it. The problem for me is the other people. I keep hearing how it's an amazing community and that may be true but my personal experiences differ a lot from what I hear. I have had two or three very negative experiences within my first week with miserable, nasty players. I've been tk'd when I'm just loading up a lorry for logistics. I've had players blocking me from delivering supplies because they think they know better. Even if I just say things in chat, nobody acknowledges you unless you have something they want like a delivery or help doing something. The clans ruin the whole point of the game, imo. The idea is that everyone in your faction is working together but if you don't have the backing of a big guild people just seem to treat you like you're nothing. And I'm okay with being nothing, or rather not particularly important because we are all just cogs in the big machine, but you see the same clan darlings lapping up all the attention in chat, it's painfully cliquey. I got the sense everyone is doing shit for themselves or for their guilds, and after a week I just felt like the negative, selfish attitudes all the long time elite players have is just something I don't need in my life. Started off mind blown with what this game does, but quickly got disillusioned with the player base.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You have to be too much of a fat discord mod to play this game. Like if you want the good shit then you need to sign over real world hours to be part of a regement, and as we all know, discord communitys are just full of weirdos.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like not doing what you want to do, go ahead. If you want to do anything cool and don't have 10+ friends on for a week straight, don't even bother. You either run in and die because you don't have any equipment OR you get team-killed for trying to use some other equipment. Don't forget that player (on both sides) have alternate accounts just to grief you and open up holes in defenses. Like opening a gate and blocking it with their alt and then letting the enemy drives tanks through it. Or pulling YOUR tanks from storage and driving them into the ocean. This is just the enemy doing alt. Your actual teamates? You'll spend 10 hours gathering resources, refining them, building tanks, crafting fuel and ammunition only for your frontline to lose it in less than 2 minutes. If you don't like many many many hours of work wasted, do not play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, however it's becoming worse to try to get into it.   Consistent login issues during peak times with either massively unplayable lag or just not being able to join a shard at all and loosing connection within minutes.\r\n\r\nAlas I'd like to think its down to my internet but it's not. Pretty sad about it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gave almost 18 hours of my time i will never get back nor refunded to this glorified dog shit of a game and heres what i can tell you:\n\n>>> horrendous community that will crucify you if you happen to be new. \n\n>>> absolutely terrible gunplay. You'll spend most of your time dying to hitscan more than anything as bullets will somehow curve around walls to catch you anyways or when its you shooting someone, completely miss all together because your crosshair just happened to be 1 pixel above or below your target since this shit is top-down for some reason.\n\n>>> Very steep learning curve with zero REAL tutorials unless you count those crappy obstacle courses where they teach you the very VERY basic fundamentals that's not in any way, in line with how people actually play this game or whatever the current meta is. Youtube tutorials dont help either as almost all of them are explained in a certain way like you should already know how to play.\n\nUnless masochism turns you on. I seriously do not recommend this game. This game and its blood thirsty piranhas of a community will eat you alive should you make the dreaded mistake of being new",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not terrible, but it lacks integral UI standards. It purposely gives poor communication and game mechanics that narrow you into building and blowing up bunkers with an absorbent amount of resources. This requires a level of grinding that only a large group can actually provide but they spend so much time running facilities that the complete and utter lack of hierarchy (in the army?) means that the vast majority of resources are wasted by inexperienced players or uncoordinated units doing random stuff.\r\n\r\nIt's not worth it and hits its cap for the average gamer pretty quickly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I tried having fun with it and in the end I can't say I recommend it. Not if you want to play this as a solo oriented player.\r\nFoxhole sure is a unique war game and it offers a lot of different things to do, but none of them are particularly well made, at least not in the way I would like. It is a competently made game, albeit with some QoL issues. A lot of the negative reviews complain mostly about bad actors and the time sink that it can be, but I wouldn't say those are the biggest problems. Certainly not the community. The players are great.\r\nI'd say a lot of my negatives come from some sort of game dev's over-reliance on players taking care of each other and making the fun, if that makes sense. I'll try explaining it.\r\n\r\nThe first major thing is the learning curve, which is garbage. I believe that a game should be a feature complete product in the sense that it teaches you everything you need to know... which Foxhole fails at horribly. \r\nYou get on your starter island and try doing a boring tutorial. It has several sections, but I wouldn't be surprised if everyone gave up after 15 minutes of combat tutorial, which is what I did. Thankfully that is enough to let you try out being a frontline rifleman without being a detriment to your team.\r\n\r\nHow does the game explain things outside of the tutorial? Not well. The tooltips are too basic to stand on their own, there is no manual and there are no relevant hints popping up whenever you get your hands on something new. \r\nAnything other than the most basic or self-explanatory things must be explained to you by a veteran player. I can't imagine how lost must new players be if they aren't already military nerds.\r\n\r\nThe second major thing is the utter lack of feedback. This game is completely barren when it comes to things showing up on the screen, with the sound design also being too minimalistic.\r\nHow do you know you got injured by a shot? You see blood on your character. No red screen edges, no camera shake, no health bar. Keep in mind that this is a top-down game where your soldier is almost a speck on the screen and your focus is usually far away where the enemy in your crosshair is. I have seen many players not respond to getting shot.\r\nHow do you know if you are suppressed? You get a small shield icon at the bottom of your screen. Once again, too subtle.\r\nHow do you find out you are on fire? The game literally tells you with a small message in bottom left. Yes, I am not joking. Characters are mute and there is no such thing as flames appearing in your screen for visual feedback.\r\n\r\nAnd then there's the gameplay itself. There are way, way too many boring, uninspiring tasks where you achieve your goal by holding a button and waiting.\r\nConstruction & repair is done by approaching a building and holding LMB while resources are being taken away from your pockets. No additional button prompts.\r\nHauling via truck is done by driving with the stupid keyboard controls up and down the same road, waiting for the supplies to load slowly while you have it parked. Honking passerby's is usually the only thing you get to alleviate the monotony. Manually placing the boxes in the truck? Listening to the radio? Delicate steering? Not a thing.\r\nWhat about sniping people? Wait roughly ten seconds for the crosshairs to align with the target. If the target moved, wait again.\r\n\r\nPlaying as the medic is the most fun I had, but half of it is just holding LMB untill the patient is healed. Furthermore, it is unnecesarily hard to actually target the injured soldier.\r\n\r\nI will say that I got immense joy when I delivered critical supplies and got congratulated for it. Or when a player approached me after a battle and personally thanked me for my medical duties... but I cannot rely on these uncommon moments.\r\nLet me say once again that I do not recommend the game as a solo player. I'm sure you can have loads of fun coordinating things with friends and clan members, or maybe by playing it very casually like Farming Simulator, but it really isn't a game for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have never complained about balance in my life, and I've been playing video games since 1999.  I'm running out of explanations why the developers would favor one side so heavily in a game where you become attached to your faction. Do the devs hate collies because they're Canadians and more Americans play on collies?  \n\nWarden tanks, navy, artillery, infantry and lore are more interesting and fun to use.  Their logi lines are shorter on average, and they have most defensive choke points. \n\n50% of Colonial players think there's a dev bias against them, meanwhile 17% of wardens do  from a reddit survey of 300+ players.  \n\nSo why not play warden?  Oh wait, they already have more veterans on warden. I wonder why that is?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "1 Not friendly for new players\n2 Sat in my library for like 5 months\n3 \"tutorial\" if you wanna even call it that is over 2 hours to fully do, causing you to not be able to refund\n4 idk if it was just me but it felt horribly optimized \n5 everyone was oddly rude to me for no reason\n6 many additional rules that you have to find out by being yelled at (basically number 1)\n8 Regret buying it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game gives a promise it can't fulfill and leaves with a terrible impression of itself \n\nThe core gameplay revolves around 2 things: battle and logistics. \n\nThe battle part is a typical top-down shooter, you point and shoot, that's it. This part works great... as long as you are playing infantry which has a wide range of weapons and tools. If you enjoy top-down shooters for the sake of them, you will like this game, for the most part. The bad about battle is everything that isn't infantry, all vehicles are terrible and don't act as such really, they are damage sponges with a weapon and your experience from using them will surely be terrible because: there is no such thing as armor really (it acts as chance of taking damage), you simply take damage from all AP weapons directly to your HP pool, once it reaches 0 your vehicle turns black and you die. Essentially every tank is measured by how much HP it has, and its DPS, very arcadey (to be fair, there are many gimmicks but they are minor), this arcadey feeling is also everywhere about actually the battle roles of the vehicles, their design is non-sensical and explicitly makes tanks even less useful on a battlefield that already can't utilize any of the IRL benefits of having a tank apart from having a damage sponge that is quite easy to kill anyways because actual shooting range is almost nothing and every battle is close-quaters battle allowing for banzai attacks for infantry to throw grenades which is hard to counter and even if countered the price of the attempt is extremely small compared to losing even a single tank. An example of non-sense would be that one of the faction's tanks have no anti-infantry weapons meaning that they are not simply vulnerable to infantry but are utterly helpless to any infantry attack even having friendly infantry around to help out and can't really support an infantry push because of the lack of tools to kill or suppress enemy infantry.\n\nIf the battle part can be liked or hated, the logistics part is straight up time sink designed to make the game harder which is alright but the very process of producing and delivering supplies to the front lines is a tedious experience of doing the same thing over and over with no real aim or purpose. During one of the wars on Charlie my regiment (212th Colonial) basically held on our backs the entire logistics for several days because people got burnt out and refused to do anything risking us losing the war. We grinded productions for many hours just as the deliveries and despite us saving our faction from utter collapse it only showed me how pointless all of this was and playing logi is basically doing chores but in a virtual world.\n\nThere are good parts of the game but heed my warning, better go read Plato or learn like anything useful instead of wasting your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The cool moments you saw online are few and far between, 90% of this game is janky aiming that is impossible at most angles just because the red line says so and 20 min sessions of driving across the map just to get ambushed before the last stop because 1 single dude snuck around the entire front. The only fun to be had is saving people as a medic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not recommend this game, developers do not know what the word balance means and are considerably biased towards one faction over the other.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for a bit. The Community is ignorant garbage. Everyone demands you do things for them or they will just shoot you. If you try to build something, they will probably get mad because its in the way of something else. Plenty of drama playing with the intel or logistics side of players. I had more fun throwing ally tanks into the ocean than I did trying to play this game with others.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game in not rewarding, feels like a job and the devs do not care about players experience, balance between factions or anything. They just make one or two updates each year, with new vehicle and weapons and dissapear again. The game does not need additional toys but someone that care enough about it to solve it's issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't stay connected for more than 10 minutes, nothing works to troubleshoot it, even with perfectly fine system requirements and decent internet",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth it. Squads will Team kill you just because they want to horde resources. Can't do anything except fight with pistols since these squads horde everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent 8 hours building a base for C3T clan to come destroy it because it was too close to one of their pipes.\n\nhad a good time before getting griefed tho",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "one of most worst games I tried to play\n\nfriends are killing you, because they thinking you standing in their base\nfound normal people - new problems - voice chat is not working\nwant to add them in my friends to restart game...maybe voice chat will somehow work - not found adding in friends option\n\nI really don't understand who liked this game. Do you even played other games? \nDon't waste money like me, don't buy it. It is not good game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game forever ago but never got around to actually playing it. I finally give it a try and play logistics for a couple days. Eventually I decide to try playing in combat so I grab a light machinegun and head towards the front. I arrive at a destroyed bridge with a small ongoing battle. I post up with the machine gun and we trade shots with the enemy for probably a half an hour or more and neither side is getting any kills. Then I see a grenade fly into my cover and I am vaporized before I could even get up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Quality of life needs urgent improvement. Otherwise a chill game for older people to spend time in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unbalanced game, Devs do not fix know issues and just try to push more stuff into a game that badly handles what is already in it. Worst is the issue with know cheats that are not adressed by the Devs at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What if you wanted to steamroll the wardens but Devman said: \"you are 7th in queue to deploy\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well i play this for long time and it feel like if ur not on the wordons time u never win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sucks game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Games super trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balance is bad",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i rewieved Foxhole 1-2 years ago, i would say its worth your money and time but... at the curent state - no\nNo if you're not ready to leave your job, college etc. just to.. ride trucks for supply\n\nDevs keep updating the game, adding new stuff which is good.. i would say, but with all these updates it became a game for CLANS, if you're a student, or have real job - you wont have any time to play it. You can have a squad of 4, 6 people, but it wont make your farm for resources any easier, you will spent hours and hours to just ride the truck from point A to point B, maybe to build yourself a tank, maybe to build your own base\n\nAnd if you're a solo player and dont want to have any buisness with big clans, well... you can enter to shoot your rifle or mg for few hours and thats it, its all gameplay you can get as solo player here. \n\nAnd yes Foxhole community, not everyone want to spend hours to grind, try to join an clan, and live in this game.\nGame wont tell you that you HAVE to play in a clan, or in a big squad. It looks just like a cool shooter with elements of bulding at steam page, but in reality its euro truck simulator.\n\nI want to play it, but with new systems, with how HARD it is to do refined materials (AND that your truck can carry only a little, if we speak about an base) i just cant, its timeconsuming, its not a game, but a JOB.",
      "voted_up": false,
      "votes_helpful": 257
    },
    {
      "review": "enjoy the game but not the player base, you take an unlocked car to check out the map and the whole region starts spam reporting you and calling you a collie on an alt, cant just enjoy the game anymore, playerbase treats it as their entire life",
      "voted_up": false,
      "votes_helpful": 69
    },
    {
      "review": "Is it a fun game? Yeah\nIs it a toxic game? Oh baby yes\nFilled with people who flame you if you do smth wrong rather then explaining the game and will activley be toxic in chat. Thats about it from me",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The lag is becoming unbearable, glitching, rubber banding, phasing through the map, not being able to shoot, it seems that the more time goes on, the less playable the game is.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "only review I will ever post; do not get invested into this game; if you make a name for yourself you can and will get spam reported by in-game regiments, in all essentiality high-school cliques, which will completely limit your ability to play this game. All it takes is a handful of users to dm each other, take 3 seconds to click on your username and hit submit, and you will no longer be able to play this game, with them facing zero consequences or retribution. It starts with a 60m ban, then a 12h ban, then a 3d ban if you're lucky, then a 2w ban and the cycle repeats 3 times until you get an \"indefinite ban\". Developer moderation is utterly obsolete and or essentially non-existent; game includes a link for a ban appeal option (which let's be honest, any game that you pay for outside of a free to play should have no such thing as player moderation restricting use of the game itself/others being able to decide whether or not you should be able to play a game that you yourself have paid for is complete bafoonery), and brings you to a page for the \"developer website\" that includes a log-in for the so-called moderators (quite literally outsourced call center-esque Pakistani national tech support) right next to where they want you to create a log-in account to make a ban appeal request (what kind of shitty web-development is that amirite not even a separate page for \"your\" so-called \"employees\"). After you submit a request, some guy named Hakeem will bring up your account 8 days later on his ROG Strix while he's sitting in his mother's basement in the favelas of some fucking third-world country who knows where for his 3 hour, 1 day a week, 13 shillings an hour remote job, take 5, maybe, MAYBE 10 minutes tops to go through your entire in-game text history, and, upon finding literally anything that you have ever typed in local chat not SFW PC that you wouldn't type on your child's iPad under the supervision of your work's entire HR staff, under the supervision of an entire sanctimonious congregation of nuns, while under the advisement of a democratic congressional hearing, will be quoted, sent back to you, and your ban appeal denied, 3 to 4 business days after the ban had expired, even though you were reported for saying that and quote \"There is an empty artillery piece right there, why don't you fire that one too\". Even if you previously had the gall to inquire whether your fellow infantrymen prefer Camel or Marlboro, it will be used as an absolute reckoning for your inability to play a game that you have unequivocally spent payment on. Multiplayer in this game is about as satisfying as playing Wolfenstein with your mother-in-law's liberal stepson, and quite literally as enjoyable as getting sent to HR to take 1000hrs of inclusion training. In summary, do not play this game if you are not a practicing Jehovah's Witness, frontrunner for the Democratic convention, an abstaining catholic monk, or currently wearing a chastity ring. And especially, if you are one of the few who wishes that video games could go back to being video games, and believe that the peak of entertainment was the in-game voice chat of the real MW3, when men could be men and put the harsh realities of life aside for just a moment, to share the real, pure moments of gaming and insult each other without care. You will be sorely disappointed until you get lynched out of this game. Work culture has truly seeped into every corner of society, even your precious online pastimes. When playing a video game is inseparable from being grilled in HR for your IG handle, you truly start to wonder if Ted, or even Kurt, were right all along. My heart goes out to you brothers. Godspeed.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "People have multible accounts so dont think of doing big things anything and evereything is done using alt accounts in another faction. Developers dont care focusing on other things so dont buy this and put your time into it for nerds to magicly get in your base or magicly a truck with explosives is found. Do not start you will regret wait for a update that will deal with this.\n\nRevising its even worse now theres ques in all the places you can play. If you accidently go to another hex theres a hole web to go true to make sure you keep your reserved spot ect causing for alot of issues",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Foxhole is a cool game. The sad part is the community is not as cool.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game is full of reddit trannys  and the devs will ban you for having fun. Its a dog shit game",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "not my best second impression, I tried learning how to make a factory only to not even have the room to build one due to the clutter of factories and bunkers everywhere and when I spawn in I get friendly killed by some Russian dude cause I somehow was trespassing in their factory even though it was on top of a spawn point on the main map, I tried getting back into this game but it was just turned into A annoying experience.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "QoL infantry -> kill inf gameplay\nQoL Build -> kill build gameplay\nWhats next ?\n\nVery good game but all the last maj since 1.0 are total trash, dev wont listen community about true problem and QoL needed.\nBut at least we got new tank, boat and plane !",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "im a neutral faction guy and love the game but heres a problem LUNAIRE IS TOO OP FOR EVEN BOTH FACTION DEVMAN FIX IT",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too difficult game with extremely mean and aggressive community. I was trying to give the game a fair go. Then I logged in and it says I've been banned indefinitely due to violating their rules. What rules? Not sure, the website's link was broken when I tried to check and I never got an email from an admin explaining what I did \"wrong\". Don't recommend this game. Terrible customer support.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Naval in this game is in the current moment impossible.\nThe last big update introduced anti naval cannons with no counterplay that are after the second half of the war all over the map.\nIn the regions that there are non of those. There are artillery shelters that make it impossible for ships to kill for example bunker cores. If a ship attacks anything succesfull the enemy can instandly rebuild it.\nIm in a huge naval regiment and we are not doing anything because there is nothing to do for ships in this game.\nBut the worst part: The developers know they killed naval and just delete all the Player complains in the official discord",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Toxic community, which is supported by developers banning players for enough reports from the same clan.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "it feels like most of the time I am waiting for something to happen there just is not much action the battles are fun when they actually happen its just not my kind of game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "God the devs dont even play there own game and then add thing they think will make the game better but in the end 10000% more work and pain and suffering",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}