{
  "positive": [
    {
      "review": "I Shot up a crowd of people blew up a king and commaneded a bunch of red people to attack blue people then played TABS great game honestly",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "Belive me, ive played this game for 217 hours. longer then any other game I have and Totally Accurate Battle simulator is amazing. There are almost no bugs (unless if you count units getting glitched into the ground from sheer force) It runs great on all devices. And the units and maps that come with this game are amazing but I recommend downloading some units or factions or maps from the workshop. Also the unit creator is one of the best parts. Then theres also the fact that this game does not suffer from player burnout. Overall, totally accurate battle simulator is an amazing game 100000/10  and is a must buy even at its price of 20$",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "simulator for war and also a challenging game. multiplayer,mods and a l o t  m o r e.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "gets boring after you complete all the missions and gets too easy with the dlc but i did not regret buying this",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The only game where you can hardly tell the difference between living ragdolls and dead ragdolls",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "just a very fun sandbox war simulator game, but with workshop everything become wild and fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "an amazing game, i had amazing fun making an entire army of skeletons with complex tactics that often destroyed base game units",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "so fun a great game and super funny too",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What is there to say for this game? It's a totally accurate battle grounds game for totally accurate games to play in a totally accurate way! (Seriously it's a really cool game, perhaps cooler then you think...)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, I used to watch people place this all the time and it looked incredible. Out of the countless hours that I have spent playing this masterpiece, I can not honestly say the last time it has bored me. Whatever they were feeding these guys when they made this game has to be labeled as radioactive without a doubt. Some of the comedic characters within the game blow my mind for the reason alone that I would not have been able to comprehend such things without.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun sandbox game you can do basically anything in it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun funny fun fun game funny short fat people push big king sword of cliff it funny and horsey run into walls  trying to get axe boy funny fun funny great fun funny yes game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty fun as you can play the campaign or go into a sandbox and make the whole map full of characters. I really enjoyed the fact you can creat your own characters, maps, and battles. This game was really fun when I first got it but after a while, once you play the campaign for a bit and play in a sandbox, it does get a bit boring and repetitive. I got a new PC and the game wiped all my data, other than the stuff I posted on the worshop, so that wasn't fun. But overall the game is fun and I do recomend it.\n\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is Worth it It has funny bugs and Creating your own units Spawning your own armies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great with its funny mecheanics and goofy gameplay i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool, but there are a lot of glitches and bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a very fun campaign and good custom content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of diversity and different style then other simulator games. Gotta try, the experience hits harder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best and most accurate battle sim ever tottaly guys yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a totally accurate battle simulator  10/10 game would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First saw the game when it was fresh out of the game jam i think\r\n2016 i believe, Fell in love with what it was. Literally bought a laptop just to play it.\r\nRight now it's probably more fun than ever, physics based battle simulator? Say less! Every battle is unique, kinda.\r\nReplayability is enough for days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun sandbox game. you can even control some of the characters. pretty lit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the best simulator ive ever played in my life . the price is worth and there is so much to do like make your own units fractions battlles campaigns and maps.the quality is ok and the units are funny as hell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it bEEN REALLY FUNNY SEEEING THE CHARACCTERS WITH THEIR GOOGLY EYES THIS ALSO WAS RALLY FUN WHAN THEY ADD THE LEGACY FACTION BACK IN I THINK 2019",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it! there are 54 hidden units! Sprawled throughout the map which really gives something to do while playing. Then with the bugs DLC it truely made it feel like a proper sandbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has good game play for both campaign players and sandbox players allowing people with different play styles to enjoy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First saw gameplay back in the day and now I'm playing it. It's amazing, fun, family friendly. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, kinda goofy at times but its really good to pass the time. the feature where you can make your own units are also great, definietly recomend this to other players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "how to play TABS, step one play sandbox bc the main story is BORING, step two go to legacy find everything there and mess around with the tank, step three make a shit ton of military and non military things, step four, make every major political dictator, step five make them fight each other, peak game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty accurate, you could say its totally accurate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game but after you have done everything it gets boring from lack of new content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun and silly game for all ages!\r\nWould highly reccomend.\r\nFrom silly characters to insane battles, there is nothing this game can't do!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game you can make your own units (which is what i usually do for entertainment besides using the usual characters) ive been making demon slayer characters and the abilities you can choose for them matches pretty well for any character. just gets a bit repetitive :]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS AN AWESOME GAME!  I have played this game for over 200 hours, and it is so fun. There are some simulations that made my whole family laugh, and secret characters that you can find in all maps. Please play this!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game that allows you to create battles and has a really nice campaign mode. runs well on most devices (except my m1 macbook air) and the sandbox mode is fun and allows you to absolutely nuke your computer with hwacha, overall really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had this game for multiple years and every time that I do play it I always end up playing for 1-3 hours straight\r\n#ADDICTING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pure, concentrated jank. Extremely fun. Wish I could put more time into it.\nIf the price isn't a concern, it's probably worth trying.\nIf the price is a concern, bear in mind you probably won't play it for all that long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is tuff I love the unit creator,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE THIS GAME BECAUSE it iss about planing and skill sometimes its luck but you should play because sandbox is fun and adventure this game is very funny to with you acting with voices and more but its funnier if you act like a one of those people that help you or the other team and you can slow-mode and become by a sertain key so i hope this helps if this is your first time so you know \"as a new player\" that this game is fun and silly at the same time bye...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was pretty good, I found the levels fun yet challanging although some did seem a little unfair and took some elbow grease to get it done. Overall the design and gameplay was fun and the soundtrack was really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of love went into this fun and janky sandbox. If you want a low demand sandbox RTS then this is your best option. Extremely re-loadable and a great time with friends or alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game with funny physics, recommended for people who like this kind of physics and have nothing to do or play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game. needs updates though on new campaigns and stuff. excellent ragdoll physics and modding community. OG insane game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not only for strategic thinking, but also for laughter, because the characters make funny noises, fall out of the blue, perform strange actions and much more)\n\nTo die laughing, the options \"drunk\" and \"waving a weapon in different directions\" should be added to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game I would definitely recommend this game. It's just stupid fun okay, the derpy noises, physics and creativity are amazing. I do wish they'd fix some bugs and add more updates because they stopped the updates when there's still so much more to do, but great overall. 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I throw this on whenever I'm bored and it kills the time, it's very fun and even goofy at times. And the customizability factor of the characters makes it all the more worth it.\r\n\r\nGood game. \r\n\r\n🤲 67",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another Landfall hit, this game doesn't get updated often but it still holds up all these years later. Shoutout to eatv1llager for helping me find all the secret mobs, I mean units sorry! Seriously though you should buy this game if you like making riggas and biggas fight each other!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game it's so funny and fun it's self and I love the user created units 9/10 highly recommended and fitted for people that wants to do role-playing stuff or re create wars or historical stuff, and multi-player fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun and pretty cool, I have lots of fun playing the sandbox and making my own units.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has many different outcomes fun to play with friends and family and overall its a pretty good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game ive ever playd i love this so much!!!!! the figures and that you can controll them is awsome!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, lots of content and very derpy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the creativity you can express through this game! I highly recommend this game to others!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing but i feel like its needs a tiny bit maybe 2 more factions the game is amazing with slow mo lag :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is one of the best purchasable games ever created. even though i haven't played it much, it is so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "prety good game and why we need more cosm- options enay bobb ross for bob ross",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is funny and hard and really good to play you can create your own units and use them in battle and heck you can even make your own map with 1000's of styles and theres secret units and lots of other stuff so download tabs  and have FUN!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very fun game review over very cool. Some things are easy to find in terms of secret units and I didn't realize that you had to put a custom unit that you made in one of those tribe thingies like you know the medieval thing like one of those I didn't know that which is kind of bad but it's still a good game. I think they should make a new version or never mind. They should really just have Collabs Godzilla Marvel. Something like that imagine Spider-Man swinging through your game that would be awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Totally Accurate Battle Simulator is fun, it has funny ragdoll-like characters, and you can even create your own! Personally, I think this game is a game to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best to play when not feeling creatively bankrupt, but still great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite good to waste a couple of hours on, if you like a ragdoll godmode sim with a little bit of jank in the middle, this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a fun, goofy game where you make little ragdoll dudes fight ranging across different eras. you can even make your own units! this is 100% a must buy! ive bought this on multiple platforms such as xbox, nintendo switch, and pc. definetly the best version is pc, though. this is one of my fav games to play when im bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember watching Markiplier play the first versions of this game and to see it now is crazy with how much different and more detailed it is now, this is an enjoyably absurd strategy game that's very fun to play through, set up you're own battle or create your own omnipotent unit and play as them lol. For $20 i'd say it's almost worth the price.\n\n7.4/10 Good game to get on a sale and has some fun to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The unit creator allows so much diversity, not to mention, the difficulty is perfect, and you can even download other people's battle scenarios, campaigns, and even units! And if you like doofy-ness, this game is so perfect. WORTH. EVERY. PENNY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well its definitely accurate. i gotta say this is one of my favorite games oat, it has really good graphics good gameplay blah blah, but the rng is what makes it best, your units can be small as your toe or as big as your favorite modded game. Definitely recommend if your having a tough time and want to have some laughs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a lot  of fun and u get to look for some other characters to unlock them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "epic game so dirpy and fun lol i killed a dark peasant then made a giant banana!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Text Review:\n\nPros:\n -Great, diorama visuals (Colourful and cartoony). It's lush but can\nlack refinement at less viewed areas (Might be fair even if you're\nexpected to look for secrets). So detailed you can see a musket\nball! Some cosmetic items clip through one another\n -Nice music that fits with the different faction themes (Strangely\nserious in tone though) and the unit noises are funny!\n -Brilliant and extensive customization tools, if it's difficult to create\nvehicle riders and balancing the units!\n -Great physics and combat simulation gameplay (Quite funny).\nSometimes it's light and breezy and other times it actually\nrequires tactical thought in a strange way\n -Good hidden object gameplay to find secrets and unlock units and even\ncampaigns (A proper reward!)\n\nMaybes:\n -No story or tutorials so I had to look up how to unlock secrets and as\nmentioned some guidance regarding customization would be nice!\n -Physics based humour is kind of the point! The game is  kind of\ninherently indirect (Even when you possess units because they are so\nslow, wobbly and attacks are hard to connect)\n\t\n\tCons:\n -Unrefined as it will just let you place more units than is wise for\nprocessing and the camera resets so you can't start with the view\nyou prefer and have to pause for that immediately especially\nif you want to posess units\n\nCheapness Checklist\n\n -Took me 15 (Quite a lot of levels left plus I subtracted 9 hours of\ncustomization)\n\n -Price During\t\t\tFull Price\t\tSale Price\t\tPrice per Hour\nSteam Summer\t\t  \t R199.00\t          R67.66\t             R4.52\nSale 2025\t\t\t\t  $19.99\t\t   $6.80\t\t     $0.46\n\t\t\t\t          £15.99\t\t   £5.44\t             £0.43\n\n -Fairly big download size as it only takes up 4.49 Gb on the hard drive\n\n-Not easy to run... the Warhorse test did not go well!\n\n-Splitscreen multiplayer for 2 players (Weird and finicky - \nnot controller flexible)\n\n -Kid friendly (At worst some voices may be offensive but that's\nharsh!)\n\nVideo Review:\nhttps://youtu.be/jburrdd996g\n\nShort Review:\nhttps://youtube.com/shorts/VwhXsaD2wcY",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Casual and fun, a great addition to your collection, that is, if you are able to stare deep in those GOOGLY EYES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and ragdoll and like enough maps and you can make your own campain units and maps and even share them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a great game because you have to find some of them and you have a lot and I like when one of the things are in my lesson at school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would recommend this to others because it is a funny and enjoyable game but after a little of non stop playing it gets boring so in my opinion i think this game is a little mid still fun though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the campaigns are really fun and theres a lot of volatility in the game that makes it fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game.\r\nalmost infinitely and easily moddable, and can have some funny, unique moments. in other battle sims, the results will almost always be the same between two armies, but in TABS, the balance of success and loss could hang on a halfling tripping over or not. overall, a 9/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its absolutely golden with basically no flaws. even if you lose its still very much enjoyable and there's plenty of secrets and places to find and explore. over all 100/10 worth the price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best goofy fun fighting sandbox and campaign ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good and all, But please bring back these characters from the beta: \n\nChicken-man \nChicken-man Man. \n\nThank you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very fun to experiment with diffrent battles and use the slo mo feature",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is fucking awesome if you got some time to kill. i love making my own units especially with mods, would recommend 10/10 sandbox dude.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game. Its simple, funny, kind of complex depending on what level your on. It will take you a while to get bored of it and the controls are simple so it isn't hard at all. You can also create your own characters which is very fun! you can create a short guy with a mini-gun or a giant with a small sword and make them fight! it wont take you while to progress which is very good. Although, for some reason when there are more than 50 characters on each side it can blur out a lot and sometimes will freeze for a second or two which is something which may just be my laptop as its not the best. anyway one of the best games I have bought on steam so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You see my hours, I'm not explaining shit.It's basically when you were a kid playing with toys and making battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty good, definitely fun for for like few hours, totally not for like a hundred hour something, who would do that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had picked this up due to the youtuber Doug Doug making this look fun. Happy to report it is fun playing it, it is perfect for when you are too tired for a fast pace game but you still want death and destruction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game at first seems like any other battle sim.\r\nWrong.\r\nIts a game about more then that.\r\nits a game where diffrent factions fight for order and peace, in a land of blue and red.\r\nso next time you play, give some thougt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mid asf, barely any updates but decent gameplay, would reccomend but heed my warning that there hasnt been an update in a year and a half.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Totally Accurate Battle Simulator never takes itself too seriously, and that's a good thing - behind the wacky characters and wobbly physics lies a genuinely expansive, engaging and challenging battle simulator that will keep you invested for a multitude of wars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love game. try thing lose. try diffrent strategy. lose, then try another strategy and loose. then rage, download op mod, use it to diffeat every campain and get achievments. then figure out the multiplayer, find out that its buggy, sandbox, get bored then gets off and hops on minecraft, gets bored, goes on tabs. 10/10 experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i dont know... this game kinda okay like i only have 232 hours and it lwk idk okay idk fine okay. STOP PLEASE STOP PLEASE STOP STOP OKAY STOP I WANT OKAY WAIT. mb i was meant to type that in the the groyp chat with my gropu chat with okjay please. hey guys tabs good okay is good is good okay it good is good unit find secret unit likeing seceret i see samureai and kinight they fight and win and maze sim good map balrigght.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your into caosy sandboxes this game is for you if your into making your own... EVERYTHING i found just the game for you if you into fighting sandboxes this is the game for you just find out by playing it! you can find new units and even HIDEN EASTREGGS and guess what unlike other sandboxes this one is MULTYPLAYER!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dogshit terrible game do not bye cant even have sex, caut a cold playing this casue how bad it was, ice giant kinda hot tho\nhot damn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sandbox pretty good for a started 2nd level of ampaign is hard and chill, overall dis game is 10/10 because so chill im gonna be playing this on christmas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this battle simulator is so realistic that i saw a real explosion outside my house",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "you can recreate middle eastern conflicts using wobbly stick figures. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ragdoll and monk duplication explosion flying wizard and thunder haha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good i would reccomend buying it because of the custom workshop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loooove customization, so i like to spend hours upon hours  making custom content in-game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hell yeah amazing game 10/5 stars i love how you can control each individual troop and it has rlly good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addicting but sadly devs stopped working on the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty funny and theres loads of custom content you can create",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You Can Like, Make Tiny Bois Fight Eachother, And Then Control One And Torment It For Fun :) Best Game Evar!!!!!!1!!!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "i recently got back to the game, only to find out ALL my CUSTOM BUILD content has been deleted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "More tedious (repeat fight until optimal combo of units is found) than fun (haha googly eyes lol derp).\nMaybe 2021 was different? Pandemic madness and boredom?\nIDEK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love how the game doesnt even work, I launch it and its just a black screen no matter how long I wait.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This would be the best Landfall game if those stupid musketeers didnt get stuck in walls\n8/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It kind of loses its fun after an hour or two",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk I just felt like saying no nothing wrong with game tho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i payed for the game with my steam walet and thay just took it from me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game gets repetitive i dont like it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its dead to much bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "miniclip game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its boreing af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty ass game yo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "never really got the hang of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME SO MUCH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "okay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i recently got back to the game, only to find out ALL my CUSTOM BUILD content has been deleted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "More tedious (repeat fight until optimal combo of units is found) than fun (haha googly eyes lol derp).\nMaybe 2021 was different? Pandemic madness and boredom?\nIDEK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love how the game doesnt even work, I launch it and its just a black screen no matter how long I wait.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This would be the best Landfall game if those stupid musketeers didnt get stuck in walls\n8/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like seemingly every other major landfall title it's been completely abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It kind of loses its fun after an hour or two",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk I just felt like saying no nothing wrong with game tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kernel level anti cheat should not exist.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i payed for the game with my steam walet and thay just took it from me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game gets repetitive i dont like it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its dead to much bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT A GAME THAT YOU CAN PLAY FOR A WHILE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "miniclip game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its boreing af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty ass game yo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "never really got the hang of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why cant i play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant sex the mammoth",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "okay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uhff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i recently got back to the game, only to find out ALL my CUSTOM BUILD content has been deleted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "More tedious (repeat fight until optimal combo of units is found) than fun (haha googly eyes lol derp).\nMaybe 2021 was different? Pandemic madness and boredom?\nIDEK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love how the game doesnt even work, I launch it and its just a black screen no matter how long I wait.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This would be the best Landfall game if those stupid musketeers didnt get stuck in walls\n8/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It kind of loses its fun after an hour or two",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk I just felt like saying no nothing wrong with game tho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i payed for the game with my steam walet and thay just took it from me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game gets repetitive i dont like it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its dead to much bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "miniclip game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its boreing af",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty ass game yo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "never really got the hang of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME SO MUCH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "okay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not fun",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}