{
  "positive": [
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "[h1]PEAK DYING LIGHT[/h1]\n\nThis game was gifted by one of my closest friend and I never really knew that this game was actually really good. By judging the previous and recent negative reviews of this game, to me, they are wrong. This game is really really good, and it holds up next to its predecessor, Dying Light. This game's atmosphere is really good. The character's were average. The story was mediocre but the immersion and the gameplay of this game is just, just AMAZING. The combat is good, mechanics have been improved really well but the parkour is just at its peak. I, myself mostly ran around the world and doing parkour instead of fully completing the side-missions and the main quests. The world design is reall really good. The soundtrack is not as good as the first Dying Light but its good. The zombies are of same kind from the first Dying Light and the volatiles are NOT as scary like it is in the first game. The dialogues are okay, nothing good, nothing bad. The main character is kind of dull but he improves himself during most parts of the game. The parkour, immersion, world design are the main contents which got me playing and interested in this game specifically. I really enjoyed this game,\nOverall Rating –⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☆ (9/10)",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "1st ive pirated ts game, cause i was kinda sceptic, but actually one of the best games imo, recommend it a lot",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Dying Light 2 Stay Human: Reloaded Edition is the definitive version of Techland’s open-world action survival game. It includes all major updates, balance fixes, new content, and system overhauls released since the original 2022 launch. This version aims to deliver the most complete and stable experience for both new players and returning fans.\n\nThe core gameplay remains centered on fast parkour traversal and brutal melee combat. Players navigate a vast post-apocalyptic city filled with infected and hostile survivors, using agility and improvisation to survive. RPG progression remains a key feature—skills, gear, and moral decisions continue to shape both the protagonist and the world around him.\n\nThe “Reloaded” edition introduces significant improvements, most notably the long-awaited addition of firearms. Pistols, rifles, and new ammunition types enhance combat variety, allowing smoother transitions between melee and ranged play. Techland also rebalanced enemy encounters, skill trees, and loot drops, making progression more rewarding and less repetitive.\n\nVisually, the game still impresses. The lighting, environmental detail, and day–night cycle remain among the best in open-world design. Performance on current consoles and PCs is mostly stable, though minor bugs and animation quirks persist. The improved optimization makes exploration and combat feel smoother than before.\n\nMultiplayer and co-op modes have also been refined. Teaming up with friends to clear infected nests, parkour across rooftops, or tackle story missions adds longevity and replay value. Cross-play and better network stability make cooperative play far more enjoyable than in early versions.\n\nContent-wise, Reloaded Edition consolidates previous DLC and seasonal events, while expanding on side missions and world activities. Combined with improved AI and combat responsiveness, it feels more cohesive and polished overall. For returning players, it’s a strong reason to revisit; for newcomers, it’s the best way to start.\n\nOverall, Dying Light 2 Stay Human: Reloaded Edition transforms a solid but flawed game into a robust, complete package. Its refined systems, new weapons, and technical upgrades finally realize the game’s potential. While a few rough edges remain, this is easily the definitive version—a satisfying blend of parkour freedom, visceral combat, and post-apocalyptic atmosphere.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Long-awaited sequel to the beloved 2015 parkour–zombie hybrid. It expands the original’s formula with a larger world, deeper RPG systems, and a strong emphasis on player choice. While not without flaws, it delivers memorable moments, exhilarating movement, and one of the most atmospheric open-world settings in modern games.\r\n\r\nStory & Characters\r\n\r\nYou play as Aiden Caldwell, a wandering Pilgrim searching for his lost sister in a world devastated by the virus. The story takes place in Villedor, a massive European-inspired city filled with factions, political tensions, and survivors fighting for control.\r\n\r\nThe narrative is more ambitious than in the first game. Choices matter and can shape the entire city—opening new areas, changing water access, or determining which faction controls a district. While not every choice feels impactful, the major ones genuinely change how the world reacts.\r\n\r\nCharacter writing is mixed but improved from the original. Aiden is more expressive than Crane, and characters like Lawan stand out with emotional depth. However, some story beats feel rushed or underdeveloped.\r\n\r\nGameplay & Combat\r\n\r\nThe parkour system is significantly expanded—smoother, faster, and more expressive. Climbing buildings, sprinting across rooftops, and chaining moves together feels fluid and incredibly satisfying. Once you unlock a few upgrades, movement becomes almost addictive.\r\n\r\nCombat leans heavily into melee. The weapons feel weighty, brutal, and impactful, with satisfying animations and dismemberment. The special infected create tense encounters, and nighttime is still dangerous—but less terrifying than in the original.\r\n\r\nSome enemies sponge hits, especially early on, but upgrading your skills and gear fixes this later in the game.\r\n\r\nWorld & Atmosphere\r\n\r\nVilledor is the game’s crown jewel. The vertical design is fantastic—lower streets dark, hostile, and filled with infected; rooftops alive with human activity, greenery, and sunlight. It creates a genuine “two worlds” feeling.\r\n\r\nThe game’s day–night cycle completely changes gameplay. Daytime feels like a typical open-world RPG, but nights are tense and risky, with infected flooding the streets and chases escalating quickly.\r\n\r\nProgression & RPG Systems\r\n\r\nThe game leans more into RPG elements: Gear with rarity levels, weapon durability, skill trees for parkour and combat, crafting and modding, faction rewards for city zones. Progression feels rewarding, but some systems—like gear scaling—can make earlier weapons feel irrelevant too quickly.\r\n\r\nIssues & Criticisms\r\n\r\nStory pacing is inconsistent.\r\nSome dialogue choices feel meaningless.\r\nDurability can feel restrictive early on.\r\nNighttime is less scary and intense than the original.\r\n\r\nBut despite the flaws, the core gameplay remains excellent.\r\n\r\nVerdict\r\n\r\nDying Light 2 is a big, bold sequel that gets the most important parts right: parkour, city design, atmosphere, and satisfying combat. While the story and progression systems don’t always hit the mark, the moment-to-moment gameplay is so fun that the imperfections fade quickly.\r\n\r\nIt’s not as groundbreaking as the original Dying Light, but it’s still one of the best open-world action games in recent years.\r\n\r\nRating: 8.5/10\r\nA flawed but fantastic parkour-zombie adventure that’s absolutely worth playing—especially if you love freerunning, exploration, and atmospheric open worlds.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At first its noting like the first dying light but after some time you warm up to it and its unforgettable, honestly as much fun as the first one but each got their own quirks and uniqness.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "overhated, in my opinion it was goty if elden ring didn't exist\n\nbest parkour in gaming, makes moving around the best part of the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After finishing this game, yes I can say that this game is worth it, it's a lovely story. Now I can say I have completed Dl1 and Dl2 thoroughly!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game.  I love all the Dying Light games.  Have them all only The Beast I have on Epic.  Great story, great graphics, and the gameplay is smooth.  If ya like zombie/survival games,  give the series a try.  Plus they always be updating and adding content,  even in the original 1st one.  Awesome Devs!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game, would have been nice if there hadn't been bugs at safe zones when waking up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Improved zombie parkour game.\nEz one or two tap enemy with throwing knife.\nWorth to get on discount.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely adore Dying Light 2! This game took everything I loved about the first one and made it even better. The parkour system feels smoother and more dynamic, and exploring the city is such an amazing experience especially when you’re jumping across rooftops at sunset. The combat is intense and satisfying, and every choice you make actually feels like it matters.\nThe atmosphere is fantastic too  from the day-night cycle that keeps you on edge to the story that keeps pulling you in. I love how alive the world feels, full of danger, mystery, and hope.\nOverall, Dying Light 2 is one of those games I could play for hours without getting bored. It’s thrilling, beautiful, and full of heart. I truly adore it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I went into Dying Light 2 without huge expectations, but the game absolutely won me over. It’s one of those titles that pulls you in slowly and then suddenly you realize you’ve been playing for hours without noticing the time. The overall atmosphere, the movement, and the world design come together surprisingly well.\n\nParkour and movement are easily the strongest parts of the game. The flow of running, jumping, grabbing ledges, sprinting across rooftops, and chaining moves together feels incredibly smooth. Once you get a few upgrades, moving around the city becomes almost addictive. It’s rare for a game to make traversal itself this fun.\n\nThe combat is also satisfying. It’s rough, heavy, and brutal in a good way. Every hit feels solid, and the melee-focused style fits the world perfectly. Modded weapons, elemental effects, and the general chaos of fighting infected or human enemies keep things from feeling repetitive..\n\nThe story surprised me more than I expected. It’s not perfect, but I genuinely got invested in the characters. People like Hakon and Lawan give the game personality, and even when their actions frustrate you, they stay interesting. Some of the choices actually made me think for a minute before deciding. The decisions don’t always change the world dramatically, but they do affect the emotional weight of the story, and that was enough to keep me hooked.\n\nThe world-building is another strong point. Villedor feels alive despite being broken. The difference between daytime exploration and nighttime danger is well-executed. During the day, you’re climbing buildings and looting freely. At night, the tension rises, chases get intense, and UV lights suddenly become the most comforting thing in the world. It creates a good balance between freedom and fear.\n\nOf course, the game has flaws. Some side missions are repetitive, certain choices don’t matter as much as they should, and the pacing can be uneven in places. There are still a few bugs here and there, though nothing that ruined the experience for me.\n\nOverall, I genuinely enjoyed Dying Light 2 far more than I expected. It delivers great movement, fun combat, an atmospheric world, and characters that keep the story engaging. For anyone who likes open-world games with a focus on parkour, survival, and character-driven storytelling, this one is absolutely worth playing.\n\nMy score: 9/10\nA highly enjoyable, memorable experience that kept me hooked from start to finish.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While it's a little different from Dying Light there is so much that makes up for it. The parkour is much more fluid, the graphics are amazing, combat is fun, and the voice acting is great. I often find myself stopping to listen to the NPC's talk to each other. I like what they've done to celebrate Halloween by dressing up the Bazaar and the zombies.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best zombie games I've played, it's perfect in many ways. It only has a few minor drawbacks, including that the night isn't as scary as the first part. The story and additions are great and worth every penny you pay. Remember to play it with your friend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Although the story was not as great as in the first game in my opinion, the zombie slaying and parkour stayed briliant and that's what matters here.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Aight listen… Dying Light 2 was lowkey fire.\r\nParkour smooth, world big, zombies goofy, and the night chases had me runnin’ like I owed someone VC.\r\nJumpin’ rooftop to rooftop had me feelin’ like Twizzy Spider-Man with alien leg upgrades.\r\n\r\nBUT…\r\nI can’t lie, twin —\r\nDying Light 1 still wipes this game off the map.\r\n\r\nThe OG had that GRIT.\r\nThat FEAR.\r\nThat “I’m not goin’ outside at night, bro, I got kids” energy.\r\nVolatiles in the first game used to chase me like I stole their Tonka.\r\nIn DL2 they kinda just vibe until you yell at them.\r\n\r\nCombat decent, parkour fun, story… eehhh.\r\nIt’s like they tried to sprinkle a lil’ drama over a zombie pizza.\r\nStill good, but not hittin’ like the old slice.\r\n\r\nEvery time I was playin’ DL2, I kept thinkin’:\r\n“man… remember how crazy the OG felt?”\r\nThat first nighttime chase in DL1 still lives rent-free in my soul.\r\n\r\nDon’t get me wrong — DL2 solid.\r\nFun. Big map. Good upgrades. Cool co-op.\r\nBut the OG?\r\nThat’s history.\r\nThat’s legacy.\r\nThat’s Twizzy trauma level 3.\r\n\r\n8/10 — fun game, nice parkour, cool world… but the first one STILL the real Tonka.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not as bad as it used to be. It actually makes fun playing now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It has a Level Editor that works on Steam Deck! I like the amount of neat world building details like GRE's Zombie Infection symptoms posters, Military curfew posters, zombies wearing GRE uniforms, old military checkpoints, quarantine zones, things like that. If you like that stuff and want to make zombie levels, this game is perfect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dying light 2: Reloaded Edition is the ultimate comback story and a testament to Developers who actually listen to its player base and fulfill almost every wish of their's. With the massive addition of firearms, overhauled visuals, and the inclusion of the Bloody Ties DLC, Techland has turned a rough launch into a masterpiece of zombie-slaying freedom. The parkour flow is mesmerizing, the combat is crunchier than ever, and the world feels truly alive.\r\nI would highly recommend you to try it out its an absolute triumph of post-apocalyptic fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got this game after finally upgrading from my potato laptop to a mid range gaming PC. The game has its pros and cons, and i'll list them down below. Be warned that these is based on my experience and what i felt while playing, and comparing this to the first game. \n\nPros:\n- A lot more parkour variations compared to the first game. The only downside i have is the delay in some of the skills activating and sometimes not activating. The delay are from the sliding skill and the paraglider. Both have a delay when trying to trigger. Like you need to hold it for a second or two before you begin sliding or taking out the paraglider.\n\n- Smooth combat. Weapon handling feels good. The devs implemented weapon range. Meaning each type of weapon has its own range. Like knives needing you to be closer to the enemy, while two handed weapons give you more distance.\n\n- Beautiful scenery. You get to experience old architecture and new ones in two distinct maps. \n\n- Quite a variety of weapons compared to the first game. And each has its own benefits. Like to handed axe power strike will slash, While a polearm will pierce on power strike.\n\n- Gun play is nice. Despite the annoyance of not allowing overlapping buttons for Aiming Down Sight, the gunplay is smooth. The guns feel heavy when you're moving, shooting, and even when reloading. The reloading animations are also very nice.\n\n- Detailed enemy hitbox. Meaning you have a lot of areas to damage. You can cut off hands. arms, heads. split the body in half, etc. Just that it makes it slightly difficult to get that nice decapitation.\n\nCons:\n- Compared to the first game, the Bloody Ties DLC is crap imo. Its just basically a set of challenges that has a timer, forced equipment, and boss enemies that is tanky. Im fine with forced equipment, but making the enemies almost impervious to my parkour combats skills that i worked hard to get, plus the small arena, just makes the whole experience being annoying rather than fun. \n\n- Main Story is kinda dull. I wasnt able to immerse myself into it. Despite my first playthrough, halfway through the game and almost 100 hours in, i find myself fast reading and skipping most of the dialogue.\n\n- Main Story boss has plot. We literally took down hordes of enemies, but everytime we come across him we either kept getting thrown around or our \"infection\" triggers which causes our character to spasm and blackout.\n\n- Im sure its for optimisation, but there is a lot of reused assets. Especially seen in the interior section of buildings. This ruins most of the immersion, since youd expect the layout of a pharmacy and a convenience store to be different, but no. The inside are the same. You expect the safehouses for each area, or at least between Old Villador and the Central Loop, to be different. But nope. Its all the same. \n\n- Armour from vendors are too expensive. A unique purple armour piece costs 65k at max level 9. Unless you havent been upgrading, repairing or buying anything, youll unlikely to have that much money. \n\n- Knuckle Dusters and Knives are so rare in the vendor or loot pool. Knuckle Dusters in vendors ive only seen it thrice, not once for knives. And knive loot drops only four times and non for knuckle dusters. This is after 130 hours of gameplay.\n\n- DLC armour pieces are trash. The main armour itself is good. But the prefixes stay at level 1. Meaning youd be better off using base game armour.\n\n- A lot of combat skills. But most youll unlikely to use. Because a lot of them are situational. Remember the spinning 360 degree strike in the first game? Its also in this game. But, unlike the first game where its easy to trigger, in this game you have to charge your power strike and then press CapsLock. Of which your power strike can be interrupted by attacks.\n\n- In Nightmare mod, you cant tell the time. Outside of hearing the sound cues for going into night time and the sun setting. They shouldve made the character model wear a watch like the first game. Where preparing to throw the weapon allowed you to look at the watch on the character's wrist. The also shouldve made the Infection Monitor worn backwards, towards the player. So you can see it without needing to rely on the hud. Why? Because like the watch to tell time in the first game, its dynamic. Meaning the longer you spend in the dark, the more the infection takes over, the Infection Monitor bar will drop from green to red. You can see this when equipping the knife.\n\n- No faction gear or outfit. Sure you can say we have the Survivor faction gear because they mostly wear casual clothes. But there is no faction gear for the PK faction available for the player to use. The only side faction that actually gave you clothing, or outfit, based on their faction is the Courier Guild. Theyll give you two outfits based on the missions you complete for the guild.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best zombie game, I've played so far. \ntho sometimes it crashes on the arena.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played DL The Beast first and loved it. This one is at least equally great. Visuals are gresat and run fast in 2k on an dated 2080 rtx. Story keeps me continuosly going for more. Parcour feels great and very responsive.\r\nKinda like a mix of Fallout and Far Cry.\r\nIf they only let me drive one of those  trucks....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While not as good as Dying Light, it carries the weight and responsibility of the first game well enough as a sequel. However, considering that it falls short in terms of gameplay, I think it's a good enough and playable game. Give this game a chance and try it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, love the fighting against zombies. Parkour is fun too. Felt a bit repetitive but lots of content. Story is meh, but tbh if you are playing this game it is not for the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved DL1 and played coop with a friend from start to finish, had a blast.\nThis is also fun to play! Whenever it is not server problems with coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Люди ругают игру за медленный паркур, скучный сюжет и однотипный мир. Но извините меня, никто не паркурит, как Кацл Крецн, в сюжете почти нет принеси подай, а дома вокруг вас и есть однотипный мир. Разрабы сделали реалистичный мир с более менее реалистичным паркуром(ну кроме момента, где аден отскакивает на 4 метра от гнилого)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hot take:\r\nThis is the best the Dying Light franchise has to offer. Played it straight through when it first came out and loved it, but since then Techland has made vast improvements to the game overall. Out of all the Dying Light games, this one provides the best parkour, the best map to explore, the best combat, and the best usage of the day/night cycle. The only thing lacking is the writing/story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty good game and you can have a lot of fun playing and sometime may get annyoed because u might suck at first for not having good weapons and health bar maxed but eventually it gonna get better. \n\nalthough u might wanna play this game with your friends, i mean u can play it alone but its much more better with your friends.\n\noverall i give this game a 7/10 rating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, Great Stor. thx to devs for the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes you have to become a monster to stay human. - Aiden\n\nWhat I liked the most about this game was the way you could direct the story with your decisions, even if the city itself was not changing at all with your decisions, also because this take a lot of work and I could expect this to a multi billion dollar company, I still loved the possibility to play the game however I wanted with my decisions.\n\nThe game could be very glitchy sometimes, nothing crazy dont get me wrong, is just that to fix the glitch you gotta reload the save or close the game and reopen it. Some part of the story feels rushed but overall I liked it anyways.\n\nOne thing Techland should do, even if the game its been out since years, is to make the night really scary like the first Dying Light or Dying Light The Beast, because honestly, after you upgrade a bit your character, you dont even if is day or night, dont get me wrong, the Volatiles are still strong if you try to fight them, but you dont have that scary thing to run away from them. They could also make the night darker too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being late to the Dying light party I would have hoped that majority of the bugs had been ironed out but sadly this game glitches all over place.\n\nHowever, that said.\n\nThere is so much going on in this game once you start to unpack it that I feel the glitches just became a part of it. from random objects suspended in mid air, to volatiles getting stuck all became part of the chaos and charm that is DL2.\n\nAt the time of review I'm 118hrs in with lots of side missions and farming completed. I did though find the main story to be fairly short within this 118 hours.\n\nGlitches aside I thoroughly enjoyed this game\n\nGFX are ok, I was greedily hoping for a for a bit more of a boost from DL1 as the rig can max it.\n\nI like that they nerfed the grappling hook and fire arms availability from DL1 as I felt that made DL1 way to easy.\n\nI like that I was forced to grow a pair to complete many missions at night, adding to the intensity.\n\nI liked the choices I could make to have my own experience and journey within the story. \n\nI liked the characters, and the set pieces and plot twist within the story.\n\nTo sum it up for me, this is a big bold violent chaotic blast that 118 hrs just flew by, could easy do another round.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy zombie game that expands upon the first one! Best played with friends (or enemies).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. The combat is excellent especially later in the game when you have better weapons - in fact you won't fear anything once you get weapons with almost 500 damage and most skills in the skills tree. Some weapons are really cool and you can add venom, electricity and other effects to them making them very deadly. The parkouring is also great and navigating the map is fun. The open world is not too large which is good and exploration is rewarded with loot which you can use to repair or upgrade weapons or other tools at your disposal.\r\nI completed the game with the good ending and the story is ok, nothing amazing though.\r\nMy only criticism is that there are way too many side quests. The usual stuff, which are there just to inflate the game, some of them are fetch quests to people in settlements - you know the deal.\r\nOverall I had a good time with the game, so I definitely recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall quite good, but nothing beats the first and original Dying Light !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The quests can be a little repetitive but overall great fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Not sure if its better than the first one. Better play both and form your own opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as hard hitting as the first one, but still fun in its own way. Imo, made too rpg-like which takes away from the fun factor of things. But if this is on sale, give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good, but it could be better like the first game Dying Light.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't expecting this game to be this good ! Yes, definately worth a play especially coop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 is a story based game, you discover secrets, you get rewarded. Enjoying the game with friends will make it bettter, single playthroughs are also solid. It's got wild gear and new characters, some are meh but you can glide with a parachute, its pretty cool ♥ Recommend the game yo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great storyline. Very immersive and constantly keeps you on the edge of your seat. Full of surprises and requires you to think fast and smart.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really nice game but I would recommend you spend your money on Dying Light 1, as it's superior in every way to the second game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the game came a very long way. I never played DL1 so I can't compare the two but you could tell at first this game was lacking in some aspects. Great parkour and the feel of killing zombies is dope. The characters yap way to much at times; making this game more of a \"spam space bar to skip dialogue.\" Besides that the game is worth the price now a days. Just don't expect a good story like DL1. Also, I never bought any dlc or cosmetics yet I still feel like I have a lot of cosmetics and post game content to enjoy and play with so props to techland for making most things free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐  Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑  Very good\n☐  Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐  Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☑ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐  Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐  To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 is a game of brilliant, exhausting contradictions. It’s a parkour sandbox that feels more natural than breathing, yet its story often feels like a lead weight tied to your ankles. The sheer kinetic joy of scrambling up skyscrapers, kicking zombies off rooftops, and gliding through a gorgeously decaying European city is a high that the game’s narrative constantly tries to sabotage.\n\nThe world itself is the star. The day/night cycle isn’t a gimmick; it’s a fundamental shift in gameplay philosophy. Daylight is for methodical exploration and clearing out infested nests, while the night is a terrifying, pulse-pounding race for survival against Volatiles that feel genuinely threatening. This dynamic is masterful.\n\nWhere it stumbles is in its choices. The promise that your decisions will radically reshape the city is overstated. You’re mostly just changing the color of the flag on a building and which faction of forgettable NPCs gives you quests. The main story is a slog of betrayals and McGuffins that fails to land any emotional punches, making you wish you could just ignore it all and focus on the sublime movement mechanics.\n\nUltimately, Dying Light 2 is a game you play for the journey, not the destination. It’s a first-person platformer with a combat system and a forgettable story duct-taped to the side. If you can tolerate a narrative that actively resists being engaging, the physical experience of navigating its world is absolutely top-tier. It’s a masterpiece of movement tied to an anchor of mediocre plotting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a fun co op game with small competitions between the players throughout the map.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 Stay Human  36 hours played (review)\ni’ve put 36 hours into Dying Light 2 now and honestly it’s grown on me a lot. when it first came out everyone was complaining about bugs and the story, but after all the updates it runs way better and i’m actually having a blast.\nthe parkour is still the best part. once you unlock the higher skills you literally fly across rooftops, it feels so smooth and satisfying. night time chases are legit scary the first few times, those volatiles will make you panic and mess up a jump lol. i still scream sometimes.\noverall i’d say 8.5/10 now. it’s not perfect but if you liked the first Dying Light or just want a zombie game where you can parkour everywhere, definitely worth grabbing especially when it’s on sale. way better than the launch reviews made it seem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Over the years it has released, the game has been improved a lot by the developers. There is a lot of new content in the form of events and co-op.\r\nWould recommend if it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very different from the first game, after a few years of constant updates, it kinda lives up to its name so its fine to try this game out,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty awesome! but....it's also disappointing at the same time. The gameplay of parkour is insanely fun and there's a variety of combat & in-depth customization. Plus the graphics are excellent and a great expansion from the first game.  The game stutters once and awhile and can become very glitchy at times. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not as good as the first game, way more features and buttons i find it complicated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, I really enjoyed this game. The zombies, the night chases, the graphics, all so good. Story had me hooked more than I expected. Played it two times and still love messing around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good zombie´s killing game. Amazing graphics, interesting story. Ton of activities, nice outfits, weapons and tools.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For me it was and still is the best and favorite dying light game. The soundtrack, the graphics and the story all perfectly met. Gameplay may become a bit boring at daytime after some time, but when the night falls.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a beautiful game with nice story. also has cool sidequests and fun gameplay overall (including parkour and many other things). i suggest it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game definetely a graphical improvement from the first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vary good game but i have to put heavy empethies on this-\nThis is a parkour game with zombies, not a zombie game with parkour. Loot is extremely common. Melee weapons are also everywhere. Combat mechanics try to convice you that its *deep* but its piss easy because everything dies so quick.\nThe bosses are pathetically easy as you can just stun them down and spam right click to kill. The parkour however is really fun and all that iv said before makes it extremly power fantasy once you put in just a *tiny* bit of grinding. Dont buy this game expecting a quality zombie game, expect a parkour game with zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything’s great, but that magical touch is missing.\n\nThe graphics are stunning, parkour feels just as smooth, and the zombies are still nightmarish.\nBut the ‘spirit’ of the first game feels a bit missing here\nStill, it’s fun to play—just wish it had a bit more depth.\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun. Doesn't deserve all the hate. I bought for 20. Well worth it. Story was good. I would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Techland struggles in the writing department, as it always has, but Dying Light 2 provides a game that is genuinely fun to play, and is enhanced by the performances of Jonah Scott and Rosario Dawson. The story is tired, often predictable, and seldom cohesive, but Scott and Dawson do well with what they were given. Parkour and combat are quite good, and more fluid than in Dying Light 1. If you don't care about storytelling but like running on rooftops and smacking heads, this is a decent option.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The way the game feels to play is its greatest strength. The movement and combat feel really good and responsive. There are some buggy things that can happen with movement but only happened to me 3 or 4 times in almost 100 hours.\r\nThe progression system in this game is extremely good, and makes for a great and satisfying gameplay loop.\r\nIt is a very good looking game, every time you get to climb somewhere high enough go glimpse over the rest of the city you will stop for a moment to appreciate it.\r\nThe story is good enough to keep you hooked, and you'll meet a lot of interesting npcs and some not so interesting.\r\n\r\nDownsides:\r\ngame has a lot of side quests not all of them good.\r\nsome annoying \"bugs\" like when you pull up the item wheel the game kind of roots you in place and you have to force movement again after you exit it\r\nlimited equipped items is sort of a weird choice imo. The game gives you 4 slots, but late game you will have most of these occupied by key items like the grappling hook and the UV lamp, don't see why they didn't let you equipped more stuff and just add more than 4 directions on the wheel - they could have even made it part of progression by letting you find or craft bags for extra equipment slots.\r\nthe story is strange in some places, as if some npcs or choices you make are just swept under the rug and never mentioned again.\r\nalthough I think this progression system is one of the best i've seen for this kind of game (leveling up blueprints, and gaining xp by doing the thing you get the xp for) a lot of the skills you get for the combat and parkour tree are underwhelming and will go unused for most of the game.\r\nthere are a lot of \"checklisty\" things to do in the game, which is not bad by itself, as most are useful and make gamelogic sense, but not all of them are fun to do\r\nlastly, the reuses a lot of areas for the dark hollows, which is a bit of a shame as my favorite part of dying light 1 were the handcrafted \"dungeons\" which felt like a really special and exciting thing to explore whenever you found one.\r\n\r\nOverall, I recommend this game mainly for its gameplay which is very fun and satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend it for sure. Although it has some glitches is playable with great graphics, nice kill animations, decent story and lots of weapons, equipments as long as buffs to adjust on the character and weapons and armor. Weapon or armor upgrading is decent enough but sometimes the resources that are required to upgrade them is a little expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "f.3.a.r. ruined my standards, i can't enjoy any game as much as i did it. but this game is kinda fun y'know",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best zombie survival game out there, rich story and amazing gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so big and has a lot of side content as well.\nthe feel is different from first game but the dlc and other missions kept me hooked",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 hits like a dropkick from the rooftops. The parkour is smooth, fast, and addictive, you’ll be sprinting across Villedor like it’s your second home. Nights are terrifying in the best possible way, and the world feels alive with danger around every corner. The story is genuinely gripping emotional, full of tough choices, and packed with moments that actually matter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very impressive game graphically and engaging story. Very long, ton of things to do, a lot of nice outfits, weapons and tools. But very difficult, find your way to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As far as i have to say...\nThis game isnt as bad as they say, yes it's not better than the first game, by a far mile, but the improvements that came after the first game show, better parkour, better hand in hand combat, and better general gameplay.\nI still prefer the first game since the game's story was a meh but mostly because of the ending and late-game story that couldve been worked on much better since its the only thing that kept the story from being decently appreciated than underwhelming and a really big let down.\nBut they really did work on the game to update and improve alot of those aspects from the first release, so i do have to thank the developers for that,\nThat said there's honestly not a reason not to play the game if you've played the first one,\nIt's enjoyable and improved and i hope to see the changes they'll make with the next title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok, many bugs, and visual bug, is ok gameplay, but the price is so expensive for the game for story it's end in 20h",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The reason I bought this game because of DL. I was very excited for the sequel because of how well made DL was and I actually bought the game the first week of release if I'm not wrong. Well, I was disappointed because the feeling of DL was not there, the parkour, combat, gore, atmosphere. It just was not there. I tried my best to enjoy it but you know it is like forcing myself to do the things that I do not even enjoy. I stopped playing for a while until the combat update, well I really did not expect Techland to improve the game that much. The COMBAT finally feels amazing, the gore is there and it was not just a splash of blood from cutting or punching. Parkour actually feels better. The feeling was like talking to the 3/10 in high school but still respected her just for her to turn out 10/10. Dont get me wrong, im not saying its the best but they definitely tried their best by improving and listening to us players what we actually WANT. I mean they could be like some company or game just ignore us players and do not fix the game but milking the whole franchise but they chose us instead. Thank you Techland for listening to us players and improving the game. GOSH I LOVE DYING LIGHT SO MUCH. I WILL PLAY DYING LIGHT:TB ONE DAY JUST TO SEE HOW OUR KYLE CRANE DOING. LOVE YOU TECHLAND AND THE COMMUNITIES. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Bad story\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 is an outstanding open-world action game that successfully blends intense parkour movement, brutal combat, and meaningful player choices into a thrilling post-apocalyptic experience. The city feels alive and dangerous, with every rooftop run and nighttime escape delivering pure adrenaline. The improved traversal system is incredibly fluid, making exploration both exciting and rewarding. The combat feels impactful, and the variety of weapons and enemies keeps encounters fresh and engaging.\r\n\r\nOne of the strongest aspects of the game is its choice-driven narrative. Your decisions genuinely shape the world, the factions, and the fate of many characters, which adds depth and replay value. The dark atmosphere, combined with strong sound design and visuals, creates a truly immersive survival experience.\r\n\r\nThat said, while the game offers well-designed individual missions and side quests, it would be amazing to see a completely new main story and an entirely new map added in the future. A fresh setting with new characters and conflicts could greatly expand the longevity of the game. Additionally, an upgrade and expansion of the character skill system would be a welcome improvement, giving players even more freedom to customize their playstyle and evolve their hero in new ways.\r\n\r\nOverall, Dying Light 2 is a fantastic sequel that delivers thrilling parkour, intense combat, and a gripping world. With a new story, a new map, and deeper skill upgrades in future content, it has the potential to become an even greater masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been one of my favorite parkour games I have ever played. I feel disappointed when playing any other game with parkour. I highly recommend this game for any person who likes zombie type games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game may not be the original, but using the same layout as the original in most ways to make it a sequel, this game is still so fun and there is so much you can do, i have spent hundreds of hours in this game now and i can say this game is wonderful. also props to whoever makes all the festive things in the game. the Halloween event was amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The games story is a clear downgrade from the first DL due to far worse plot, dialogue and voice acting, it makes the story overall meh and your choices do not matter as much as you think they do.\n the quest design and gameplay for the story is decent, music and overall feel are also not the best as the game decided to focus on the human element instead of the zombies.\n This is where the negatives end tho as techland has been listening to the community and updating the game alot! Its nothing like when it first released in a good way.\n new nightmare mode, new game plus enemy scaling, guns and volatiles really make the combat and roaming around feel like you are playing a more dangerous game than DL1. Combat is where this game shines.\n\nThe parkour has been perfected and you're playing in a much bigger world giving you far more opportunity to actually use your skills. New paraglider and skyscrapers give you the option to go vertical in a way that the previous game lacked. The world is filled with challenges and parkouring in coop is good fun.\n\nThe Bloody Ties DLC\nIs bozak horde 2.0\nThe story and plot is more coherrent than the base game funnily enough. the DLC is worth playing through for the rewards alone. The DLC is free for everyone\n\n \nNew tower raid mode offers some fun solo or coop play and unlocks rewards for the base game ( battlepass) , its decent fun and gives the game some longevity.\n\nTechland has promised support till atleast 2027, Its unlikely this would include another DLC. Its mainly events with great rewards and bugfixes, but its better than nothing.\n\nWorth picking up on a sale.\n Vanilla game score 6/10\n\nThe community picked up where techland failed and gave us\n2 major overhaul mods called\nE3 definitive\nand\nI am Legion\n\nI really cant recommend these mods enough, that being said I'm giving modded DL2 a rating of 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall isn't a bad game, but the 1st one was much better than this one. The combat system/gore level was better done in the 1st one.\n\nCan't say much about the story as I didn't complete the game yet, however it looks mild compared to the 1st one.\n\nIt is worth grabbing it on a discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game,good story,good gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good and fun game for the most part. Sometimes the volatile is all over an area and makes it hard to get to nightquest or you have to walk the long way around. I know there is quest the includes them, but sometimes they just happen to have a community meeting just in the way of my quest :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reasons I recommend this game:\n1. I have played Dying Light and I loved it, just awkward for me cuz I'm used to fast travel.\n2. I haven't really played DL 2 but it is installed and I see all the updates this game needs, meaning it is still getting new content regularly.\n3. The little bit I did play, I really loved the atmosphere and the vibe. \n4. Just a suggestion if any dev reads this, can we players know the effect of changing each graphic setting on our performance and quality? I have to experiment a lot to find the best quality I can play in.\nThanks.\nPS: As a general rule of life, everything might be worth it on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sadly no guns, but I think its fun and in my unpopular opinion I think some of the game play was a lot more enjoyable then the first dying light.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "used to hate it when it first came out. The game is still very flawed but the devs have done the best they can to improve the mess they created to a point it can be fun if you play it without nit-picking the small details. There are still zombies poping up outta no where parkour feels slower than DL1 but the world does seem interesting. Havent finished it yet as i just got it recently and dont play it all that much but I do fire it up once in a while and have some fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's actually a really good game overall, u have a lot of stuff to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game this year and I like it but I do believe that the combat and parkour are a bit floaty and occasionally have trouble getting a hold of the parkour making mistakes I wouldn’t not had if it was DL1 \nVisual it’s a upgrade and a lot of quality of life stuff but still feels like a big downgrade from the previous entry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing Dying Light, jumping into the sequel has been an exciting experience, especially because I’m committed to enjoying the full story. I’ve always loved Kyle Crane as a character, and even though Aiden felt different at first, he’s really starting to grow on me.\r\n\r\nVisually, the game is a huge step up. The graphics are cleaner, the lighting is richer, and overall optimisation feels much smoother. The only thing that throws me off a bit is that Aiden seems to run a little slower compared to Crane, but it’s a small detail in the grand scheme of things.\r\n\r\nGameplay remains top-tier: fluid parkour, satisfying combat, and a world that pulls you in. I’m genuinely excited to finish this playthrough and enjoy every moment of it.\r\n\r\nAnd when I’m done?\r\nThe Beast, I'm coming for you next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this series, actually finished this game long time ago minus the DLC which i came to check if i left something undone in-game.\r\n\r\nReally enjoyed the parkour—so fluid and fun. The story is typical but your choices genuinely shape the city. Combat and crafting are solid, and it’s great to see how much the developers continue to support the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterpiece game, Parkour is awesome but only once you unlock a few upgrades. Combat is decent. Story is perfect, side quests also. One of the best open world games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game i love it and it is amazing i have hundreds of hours on my ps5 and i am thinking of getting dying light the beast if it goes on sale for christmas",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the combat to me is perfect the only thing i hate abit about this game is the bugs, ive hade about 10bugs that happened all around the place.\r\n\r\nbut other then that its a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most immersive Dying Light yet. Its vision of a world slowly healing brings a refreshing sense of hope, along with incredible parkour, a living city, and meaningful choices, making it one of a kind. It's rare to see a game create such a unique synergy with the only other game coming to mind - metro series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprised me! \r\n\r\nDidn't think I would enjoy this genre of game. \r\nGameplay is engaging and parkour features are fun to play with.\r\nNight time gameply is gripping when you're getting chased down by the hoard!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of my all time favorites and Is a great build from the first. Gameplay and graphics are amazing, the story is superb and the ability to replay is high. I highly recommend it. They are still updating and adding stuff regularly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is okayish, the play style is not bad but there are some parts where is fustrating doing the parkour cause now we have stamina counted for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I went into Dying Light 2 Stay Human expecting more of the same parkour-and-zombies formula from the first game, but it ended up surprising me in a lot of good ways. The parkour system is easily the highlight here—once you unlock a few skills, moving across rooftops feels incredibly smooth and addictive. There were plenty of moments where I caught myself just running around for fun instead of doing the next quest.\n\nCombat takes a bit to grow on you, but once the upgrades kick in, it becomes way more satisfying. Smacking infected off rooftops never gets old, and the nighttime chases still deliver that adrenaline rush the series is known for. The city itself has a great atmosphere too; Villedor feels alive, messy, and believable, with each district having its own style and mood.\n\nThe story isn’t perfect—some characters hit harder than others—but the choices you make actually matter more than I expected. Seeing districts change depending on who you support adds a nice sense of consequence.\n\nPerformance-wise, the game has improved a lot since launch. Fewer bugs, smoother framerate, and co-op is much more stable now. If you played early and bounced off, it’s worth giving it another shot.\n\nOverall, Dying Light 2 Stay Human isn’t flawless, but it delivers a fun world to explore, tense nights, and some of the best movement in any open-world game. If you enjoy parkour, scavenging, and making choices that shape your world, it’s absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 is a solid 7.5-8/10 game that I recommend picking up on sale when it's $20 or less.  There's definitely fun to be had, but you can see the development issues that arose while Techland was making it.  The story is fine, and there are some major choices that can affect it, but the majority of the \"decisions\" in the game don't matter and yield the same result - you just hear different dialogue.\n\nWith my specs (i7-8700K and 3080Ti), the game looks and ran very well and I don't think I had a single crash in the 104 hours I put into it.  Parkour and combat are very fun and fluid as well.\n\nThe game has A LOT of side quest filler and I say that as someone who doesn't mind side quests, but a good chunk of them are uninspired fetch quests that you don't even have you interact with someone in person, just a job board and then drop of the requested item at community box.  There are a couple side missions with multiple sub-missions and actually have some story to them so that was nice when it happened.\n\nOverall, very solid game, but DL1 is still superior to DL2 (haven't played The Beast yet, but plan to) IMO.  I enjoyed my time with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game kept my attention for 80+ hours at launch but something lost me. Still, I think this is one of the best zombie slashers with stellar parkour and a bit of a generic open world but it works for the overall experience. I’m gonna reinstall it later. 🦍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, some funny bugs, some annoying ones as well, like frame stuttering that only occurred in lower Dam Ayre and a texture glitch on one specific bag, gameplay was excellent I like some things more then the first and other things less so, story is serviceable, I do like that the boss fights are actually boss fights and not QTE cutscenes (specifically for the final boss) although Waltz’s first faze when he spams two different ground attacks was rather annoying, love the new city and map felt like the parkour flowed better at times then the first one, overall I think it’s a pretty worthy sequel to the first looking forward to playing through Dying Light the beast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was a bit rough on launch, but Techland has impressed me time and time again with their dedication to community feedback and consistent support to their games. I still personally prefer the first game, but with the combat and parkour upgrades this game has gotten over the years, and the content it is still receiving to this day, if you enjoyed the first game, you're bound to enjoy this one as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Run, Jump, Fight and repeat.\r\nVery fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dying Light 2 was great but the story feels a little short to say in the least, in the aspect of the gameplay it's honestly better than Dying Light 1 and definitely feels like an upgrade but KYLE CRANE is the embodiment of the game and giving us a new character with no relation to him at all feels a little redundant but overall the game is a solid 9.5/10, because lets be honest Techland is probably one of the last few game studios that genuinely gives an actual shit about their players. Endless fun awaits you! Go for it, you won't regret it!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It boggles the mind how they made a game that just plays worse than the first one but now with microtransaction. Almost 4 years later this game still get those little bugs that get sprinkled everywhere. \n\nThe UI and UX are utter dogshit, the dev made just questionable decisions. It takes 2 menus and 3 window pops to change a keybind, and seriously, I have never seen a game that reset your keybind because the key you are trying to bind just to happen to be the same key that set your keybinds to default. Some of the worst UI clutter in any games I played, impossible to follow a mission marker or player marker (co-op). It's like they did play their game at all before releasing it.\n\nCutscenes drags on and on with your character sometimes just standing around for 5 seconds waiting for the scene to fade in/out. Story is kinda boring imo, generic characters that I could not care less about, but that might just be me. \n\nFor a combat focused game, the combat starts out like you are a feeble victorian child and runs out of stamina 5 seconds after doing pretty much anything. Combats gets much better later on (albeit the depth perception is kinda ass), but you still runs out of stamina paragliding for like 7 seconds and promptly fall to your death. Hope you like screaming and sliding down a slanted roof as a zombie is kicking the shit out of you while the game lets you do literally nothing besides sliding, and there sure are a lot of slanted roofs. And let you tell you about parkour. It's a 50/50 toss if you will grab onto something or not. Sometimes your character will just let go from a zipline or a monkey bar and jump to his death, sometimes you wall run and your character will decide to......just not.  \n\nIt's not a bad game, it's got a lot of good things going for it. When the parkour and combat work, they REALLY work, but just when you start to have fun the game bitch slap you with a fist full of bullshit and you just question why you started to play this game in this first place.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really wanted to play this game and enjoy it, but I don't want to sit and do technical support for hours on end trying to solve the issue on why trees keeping popping in and out of existence. Tried disabling DLSS, turning up LOD, changing Anti-Aliasing, among SO many other options and nothing has worked. Really takes you out of the world and atmosphere. I'd rather just play something else.\n\nReally disappointing. I was really looking forward to finally getting into this game. But I just can't get my head past the environment just disappearing and reappearing as I move my character's POV around.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "thx very much for last update and killing my whole game progress 170h of gameplay gone game is crashing each time while loading last save",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Do I recommend this game if you are playing solo? Maybe.\nDo I recommend this game if you are playing coop? Absolutely not.\nDo I recommend this game? No.\n\nThe problems with this game are numerous, I have never played a more unfinished product 3 years post launch. It seems Techland spend more time making skins to fob people off for cash instead of addressing issues outlined in their reviews. The experiences of this interview were within coop and I only played solo while my partner was fondling his nuts to navigate crashes/disconnects.\n\nThe good:\n- When the combat works (yes there are problems there), it is satisfying to cave heads in with a mallet, for I am the mallet man.\n- The game looks fantastic and runs well (the issues faced are not related to graphical settings.\n- The parkour (at times, when it works) feels fluid but more on that later.\n\nThe bad:\n- Ubisoft style icons everywhere, breaks immersion and a lot of the time, they're not even accurate to the thing you're looking for. In coop, these icons are different for players. and markers are inconsistent, no you spend a lot of time using the teleport feature.\n- The bugs: absolutely riddled with them, elevators are a no go due to falling to your death, coop partners crashing or disconnected (despite living 25 geographical miles apart), ledges not being grabbed despite all skill upgrades, enemies appearing out of nowhere, characters not being animated in cutscenes. I could go on endless about the shit that's cropped up.\n- The combat: Parry windows are inconsistent, enemies seem to swing a half foot in front of you but then immediately spring into a 3 hit combo, nullifying your attempts to parry or even block. Seems to be an animation issue but I'd suspect it also has to do with connection between players/servers. \n- The parkour: You start the game as a coughing baby despite Aiden being some Pilgrim who has travlled 2000km for the events of the game, only to be exhausted climbing a ledge. This is fixed upon levelling up but your first few hours will be spent falling to your death, breathing yourself to death, or being mauled to death as you have no stamina to run away. If you want to see parkour, go see Mirror's Edge, which released in 2008 and pisses all over this game. \n- The story: Every character is designed to fuck you over and I'm the asshole for not helping them? The game locks a crossbow behind one of the factions, so obviously you're going to choose that cos melee weapons for the most part stink, then the game lectures and moans at your for siding with that faction, despite the fact they're the only ones who actively help the MC. Story blows, totally boring and I couldn't care about any of the characters, additionally it doesn't seem that your actions even matter but this may crop up down the road. \n- Enemy density: not sure if this is by design due to plot but the sheer volume at enemies at any locations makes clearing encounters a total ball ache. You'll clear 15 shitters before handling a big Dave, only for 15 more shitters to sprout of the ground likes moles.\n\nI will continue to persist with this tragic title despite my numerous issues and will report back with anymore chaff that shows up throughout the playthrough. However I would advise people to look away and not invest here. This game has also wilted any interest I had in the sequel \"The Beast\" which I still can't believe they made a DLC into a full release, likely due to the fact 'Bloody Ties' panned cos it was low effort. Buy Dying Light 1, for that game is far superior and will give you much joy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I can't in good faith leave a positive review. Not that this game has no redeeming qualities, but it has very few, and most of these things, Dying Light 1 did it better. I'll be honest, it feels like a hollow shell of its predecessor. Story and characters aren't engaging, the failed attempt of an RPG takes me out even more from the story and characters, and the art style of the game kinda gives it this \"Fortnite\" look of non seriousness. Something the first game hammered home well with its gritty and horror inspired visuals and settings. I understand they are two different settings between the two games, however I don't feel the same level of dread, or survival that the first game encapsulated. All in all just play the first game. IMO it has its shortcomings as well, but its far and few between, and the rest of the gameplay, story, and visuals far outshine its slight bugs or somewhat bad writing in some areas. Very disappointed with this. I wanted to give DL2 the benefit of the doubt as I played it a bit after launch on console, but heard over the years they fixed a lot and really brought this title back to life, but I'd say they just put it on life support.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphically outstanding, but that's where it ends. After completing Dying Light 100%, I had high expectations for this game, but I am utterly disappointed. Yes, the animation and graphics have improved.\nCompletely unbalanced: throwing knives as weapons that do far too much damage. (2 hours spent killing volatiles for fun)\nClunky parkour where you constantly get stuck on corners or edges you can't climb up. And many other bugs that I've noticed in the 22 hours I've played so far, e.g.\n- NPCs stuck in the ground\n- Volatiles attacking me during the day\n- Enemies climbing THROUGH the ground\n- NPCs randomly attacking\nOverall, not worthy as a Dying Light game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tons of minor issues that just kind of irk me.\n\n-Loot spawning beneath the ground/loot container.(Looking at you police car and dresser.)\n-When you Rematch against Revenants you cannot loot any enemies.\n-Enemies hitting you in your/other enemy's animations that just seem really actually garbage.\n-Your own animations getting stuck or not triggering at all, plus input cancelling(I have a mechanical keyboard, so don't even start.)\n-Being forced into animations from enemies that you don't even see/can't even stop, even dodging doesn't stop it at times when you do see them.\n-Enemies respawning literally right in front of you while you're clearing out an area in order to loot it.(Military checkpoints are the worst offender.)\n-Oh, almost forgot, GETTING HIT THROUGH WALLS by Volatiles specifically, but enemies in general.\n\nJust many, many, minor issues and this isn't even all of them. I was willing to look past everything though because I had been having fun killing zombies, overall, it has been a decent zombie killing game.\n\nHowever, today it all culminated into me fighting through Volatiles all night just to have the game HARD CTD as soon as day started, meaning ALL of my hard fought loot on the ground is now gone, this isn't the first time something like this has happened, but it's the first time due to a crash. \n\nAgain don't even start, my computer is not a potato. I have a 4080 Super(16GB VRAM) and an I7 that can overclock to 5.5GHz with 32GB of DDR5 RAM and have allowed a higher shader cache size due to other games. My CPU and GPU both run below 60-65C running this game on highest settings(With other things open in the background of course). This is not a my computer issue.\n\nI just, cannot, in good conscience, recommend this game in its current state. It has been out for almost 4 years and the next game already came out, this is nonsense.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is just not it. After the ending I instantly closed the game and went to watch E3 demo, the demo that I've seen a dozen times already, it's just so unfortunate that with all the endless possibilities there could have been regarding the games story, it seems that they went with the worst one. For some reason there are some people, who like to bring up the 1 games story, saying that \"well, it wasn't much better\", except that - it was. The story around the first game was interesting due to the fact, that the virus was something mysterious, undiscovered, existing in one place only, it made you curious about the origins of it, people in the skyscraper felt like victims of something they couldn't prevent. But it's not the same for this game, I don't want to go into details on why I hated Hakon, Lawan, Frank, every character in this game, because they are all poorly written, horribly if I'm being honest, and the conflict between people within this city? They had SO much potential to make it interesting, to make those conflicts something you genuinely immerse in, it's all gone, there is no immersion, no meaning to it, it's empty. The game is empty, it's painfully easy, it lacks character, combat is just bland, parkour is, well parkour is actually pretty good, the flow is there, I mean it's okay if we forget about the existence of dying light 1, who is this (2) game made for? It brings nothing, it explores nothing, \"well it's more about gameplay\", well not for me, I liked the setting, I was curious about the virus, there could be so much mystery to uncover and it's just there for you to take it, but Techland is either blind or they didn't care enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3 crashes in a first hour of game\n\nWell... what can I say, I'm frustrated, I'm in prologue and already had 3 crashes. Very disappointed experience for the game that had been launched for a few years",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I loved the 1st one and I thought this would as good, well it is not. Full of bugs and cheesy story. And somehow every patch takes hours to complete, not the download part, but the patching!\r\nOverall it is a 'meh' game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its ok, but it just feels lazy and i cant give it a thumbs up. do not pay full price",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is constantly crashing and when it's not crashing, it runs horribly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does both too much and not enough, at the same time.\nVarious avenues of gameplay are presented and playable, but none of them feel refined or thought fully through, which on top of sits a hodgepodge of game systems and badly structured story beats.\nDefinitely an ambitious title, but that's the only thing it has going for it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "thanks tencent for ruining the game. lots of cutscenes deleted at the exchange of more worthless DLCs",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Много багов ломающих игру, застревание в стенках, квесты и персонажи багуются. Сетевой код наихудший. Техническое состояние игры напрочь отбивает желание возвращаться в игру.\r\nСюжет супер. Мир интересный. Система прокачки персонажа приятная. Много классных активностей. Система лутания/гринда/прокачки предметов весьма душная. Удерживание одной клавиши для всех действий лута - самое тупое решение. В чем проблема сделать автоподбор или хотя бы нажатие вместо удержания.\r\nИгра на один раз, пока хотя бы не починят критичные баги.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very buggy and game does not save properly in co-op. Has occurred more than 4 times.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has actually been kept alive by the Chinese Communist Party. The authoritarian, dystopian regime that currently rules China. in 2023, Tencent acquired Techland. Tencent is a state owned organization that bends the knee to the CCP, like all large enterprises in that regime. You, the consumer, have been turned into a lemming. A dumb little fish that forks over your money for half-baked DLC scams because you read the bot comments in the review section. Good lemming. You deserve this slop.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Managed to finish the game (including DLC also)\n\nPoor level of writing, side quests are very skippable and the main story choice with consequences doesn't make sense no matter how you tried to help. Game not properly polished between the fight and parkour that I keep landing on a non-existent platform or falling in a small hole of 1 inch diameter that I cannot understand the meaning of \"Reloaded edition\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the worst games I've ever played, even playing with friends doesn't save the experience. Co-op feels unfinished. \nMovement (which in a game about parkour should be refined and smooth) is so awfully choppy, you get stuck every 10 meters. \nMelee weapons are decent (not great), but guns are locked behind rank system, so you cant just buy a gun you need do missions that are just filler, no plot or anything.\nThe missions are mostly, go there kill that, sometimes running from one NPC to another makes you travel across the whole map, sometimes it's just a couple of meters and you are rewarded with a cutscene that just hides another loading screen.\nStory writing is done by kindergarteners. The main character was lobotomised at some point. He trust everyone and then acts suprised when someone betrays him, which happens in almost every mission. The illusion of making choices is insane, no matter what you choose the outcome is almost always the same.\nPolish dubbing is the worst I've heard.  Coming from a polish studio I expected something \"passable\" and it's not even that.\nDon't recommend even if it's free,  Just a massive waste of time. The fact that this game is full price is criminal. It's such a disappointment after the first DL game, which I loved. \nI haven't finished it yet, but I will, I doubt there is going to be anything that will change my mind.\n\nEdit after finishing the game: \nBRUH. What a joke, lol. The amount of bugs in coop made finishing the campaing very difficult.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have been a die-hard fan of the first Dying Light since its release, and it has been one of my favorite story-based zombie games of all time, up there with the tippy top of that list, The Last of Us. I absolutely adore it. I bought the second game on release on my Xbox, and maybe got an hour of time into it before I was disinterested and moved on. \r\n\r\nNow a couple years later, I've thought back to that older time and wondered why I never put more time into it. I bought it and the first game here on steam like a year ago, and since then, the second game has just been rotting in my library. I figured since I had some time on my hands, I'd put more time and energy into it.\r\n\r\nNever before have I been so incredibly disappointed in a sequel to a game I've loved.\r\n\r\nA lot of my gripes are very nitpicky, i.e. things you wouldn't really notice or think about if you weren't REALLY paying attention. But with me being older, I'm able to notice flaws a lot more than I used to, no matter how small, and my tolerance for such flaws has diminished alongside that. So, I'd like to put my thoughts down and really talk about why I dislike this game, because in all reality, I feel like I do in fact enjoy it, but it feels held back by a lot of qualities. Most of my gripes come from the fact that I adore the first game, so a lot of the things I don't like here stem from the fact that it's a downgrade of major capacity.\r\n\r\nThe first thing I noticed, worldbuilding design. In the first game, you are taught how to make a medkit while healing an injured person right in front of you. You subconsciously associate it with something that could heal, YOU. Instead here, you are taught how to make a medkit, for the sake of teaching you how to make a medkit. You don't even need to heal at that point, no dialogue excuse of \"oh gosh i'm injured, i should make a medkit\".\r\n\r\nOn top of that, there are things in the prologue home that irked me immediately. In the first game, no piece of dialogue exists without purpose. Everything that everyone says, is designed with a reward in mind, whether it be mission completion, story progression, etc etc. In the second game, Aiden looks at a painting and says, \"this is what qualified as art? weirdos\". This isn't Undertale, or some Telltale ass interaction game where every piece of furniture has a text box. This is Dying Light, and the Dying Light that I thought I knew doesn't just quip for the sake of a small laugh. I get the need to add dialogue to add personality to your characters, but there are better ways to do it. Take how The Last of Us did it, turn it into a dialogue interaction between to characters, or give an insight to your character's thinking. \r\n\r\nOn top of all of that, a lot of the dialogue in this game doesn't mesh well together. Person A starts and finishes their sentence, then Person B starts and finishes their sentence. It feels like the game is waiting for each person to say their piece. Now, think back to the end of Dying Light 1, when Crane and Rais are having their final exchange. The dialogue flows, it's bounces between both in rhythm, and Crane even cuts Rais off at one point, as well as the GRE later in that same cutscene. It feels real, like a genuine conversation. But to this game, it's like the game is checking to see if \"diagolue_1\" is finished so it can start \"dialogue_2\", instead of it all being a part of the same mp4 if that makes sense.\r\n\r\nSpeaking of dialogue, please explain to me why they had to find the one voice actor on the planet that sounded the closest to Roger Smith? If you're gonna reuse a voice actor for a different character, which even on its on is lazy on the front of it, REUSE THE VOICE ACTOR. It took more work to find Jonah Scott than it could've to just renew Roger's contract.\r\n\r\nNext up, the motion capture and camera control in cutscenes, in tandem with cutscene pacing. Think back to the first game, back when you meet Rahim in the Tower. His mo-cap feels alive, more than just a character in a video game, and the camera in those cutscenes really do feel like I'm seeing it from Crane's perspective. Meanwhile here, the mo-cap moves for the sake of moving, just to fake showing that these characters are supposedly alive. It feels like an older RPG where NPC's cycle through idle animations, instead of them moving like real people. The camera is taken up by their entire silhouette and moving the camera does not feel nearly as smooth as it did prior.\r\n\r\nKeep in mind, as negative as I'm being, all of these aspects fail as being a sequel to an already incredible experience. Most of the game is actually fun to play, the minute to minute I mean. I like how they changed the quests to include more nighttime segments, I like how parrying and blocking feels. I'm not completely dunking on this for being awful, because it's not all that.\r\n\r\nAnyways, the crux of why I'm writing this at 4hrs playtime: I got into the metro tunnels, getting to the end of what I assumed to be the first act of the game. I walked up to a door, game crash. No biggie, game crashes occasionally happen even to the monsters of the industry. I boot it up, crashes on file load. I boot it up again, it crashes at a different door. I boot it up, AGAIN, and it crashes before I even start the dialogue prior to either door. I have one of the best PC's money can buy, graphics should not be the issue. But even if it was, that seems like such an obvious crash that testers should've noticed.\r\n\r\nI do like this game, at the very least, I want to. But to love games to their fullest, I need to criticize them to see them in their best light, so they could be improved for the future, or at the very least not let those mistakes happen again. With most of the issues I described, this feels like a live-service mmo, and it should not feel this way. This should feel like Dying Light 2. \r\n\r\nThe game, is great. The story, feels.. underdeveloped. And due to the fact that I as a player am a story first, game second type of person, I can't recommend Dying Light 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Soft locked in main quests and they ruined the nights. Environment not as good to parkour in as in the first game either.\r\n\r\nStory and characters are garbage too",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I liked Dying Light, but this is just a downgrade. The glitches are atrocious, the combat is also atrocious, the game design is atrocious....  I mean, if the gameplay looks cool, then go for it, but I just did not like this game. \r\n\r\nOne thing Dying Light did amazing was night whereas Dying Light 2 lobotomized it. Instead of being hunted by volatiles, you can make them stuck in place and not know where to walk. Game is also downgraded in many other ways. The only real improvement from the original is more and new content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is so much worse than the first one. The gameplay loop is the exact same throughout the entire story. Find someone, they're dead, cutscene, talk to someone, cutscene and you get out of the cutscene looking at enemies. You repeat this over and over. The co-op is unplayably annoying, everytime you interact with anything related to a story or side quest you teleport the entire lobby even if they're in close prox. Just play Dead Island 2 it's way better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game would be fun if it wasn't a buggy mess, especially in co-op mode. \n\nBe prepared for parkour glitches, quest givers disappearing, quests not counting and need redoing, being kicked from Co-op games, constantly losing each other in a co-op game, not being able to swing a weapon, enemies randomly becoming invincible. and many more fun game breaking glitches, \n\nFor a game that is made around parkour, its parkour is a pile of shambles, there are countless times where a jump wont register and therefore you fall, or he just wont grapple onto something he should, or even he just wont go anywhere after grappling. It makes the game and the gameplay feel disjointed, especially when there are quests that revolve around being able to get somewhere quickly and you are having to troubleshoot why he wont just climb up the damn wall when you have climbed up a similar wall in other areas. I have died way more to a parkour fail than any other method in the game. \n\nThe mechanics get old really fast. The whole being chased by a volatile? Yeah the first few times its exciting. The 10th night of the same damn thing, combined with the bad parkour where you just end up hiding out, dying or passing the night away because the volatiles can and will fuck you up. yeah no thanks. \n\nDont even get me started on the button configuration, Why is healing yourself and reviving someone the same button? so you end up wasting precious time healing yourself and not reviving your ally. There are so many nonsensical button configurations - and that i could deal with, if they werent doubled up in a way that causes chaos. SO many times i have done the wrong thing because the game hadnt registered that button input. \n\nI bought this game thinking it would offer me and my partner a fun co-op game where we kill zombies, instead i got bugs, glitches, bad parkour and bad game mechanics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story wise it's awful. You are supposed to like the survivor faction but they are so annoying I wanted to kill every single survivor ally the game forced one me, and I regularly drop kicked every survivor off a rooftop or wholesale massacred them whenever possible. They don't even drop anything I just hated that they constantly bitched and whined at me. The greatest joy I had in game is when I told the BPD miscegenated woman to bomb herself as her old lover died in her arms. I also gladly killed the fedora kid in the DLC that was great that I could just do that. \n\nGame play wise the breath of the wildafication of dying light and the art direction that I can only describe as the product of the gayest most annoying calart graduate make this game a mistake. The adhoc ductaped on addition of guns in the most annoying way that forces you to play a terrible multiplayer mode in a single player game was retarded. There is no other way to get a good gun and the crossbow you get from the peace keepers is better than any of them too. If you liked the original game just buy dying light the beast.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to like the game, but I'm not sure what's worse the writing of the game or the controls. I feel like many of the mechanics of how the game flows if you just want to go and have fun are more like throwing wrenches into your plan. Over and over and over.... eventually you get annoyed. Fights seem scripted to, against this enemy they always dodge your third attack, even if your weapon goes right through them, everytime. \r\nThe writing is odd if you're into story,  some parts are good, others brutal, some so devoid of logic it's actually funny. Like the story and content was written by 6 people who never spoke to each other and all just wrote content in the same general direction.\r\nIt looks great, the type of game is exactly what I enjoy, but I can't stomach it anymore. Not worth the space on my hard drive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to enjoy Dying Light 2 especially after how good the first game was but this is honestly one of the most disappointing gaming experiences I have ever had. The game is still full of bugs even after years of patches and many of them completely ruin the experience.\n\nCoop is basically unusable\nQuests do not trigger, progress does not save properly and it only works in the host’s world. Why can only one player progress their story. Why does the map not uncover or save anything for the joining player. I bought this game specifically to play it with a friend but it simply does not work.\n\nPerformance is terrible\nNo matter the hardware the game runs poorly, stutters constantly and feels unoptimized on every level.\n\nThe story is a mess\nThe ending makes no sense, the writing feels like it was done by a ten year old and the characters are impossible to take seriously. The atmosphere is completely destroyed by how shallow and silly the writing is.\n\nSide quests are extremely short and boring\nMany of them feel unfinished or rushed offering almost no meaningful content.\n\nAnd the worst part\nSimple bugs that appear in every play session like sleeping and then glitching into a wall have been around since launch and still are not fixed even though Techland already released The Beast two months ago. After more than three years this is just embarrassing.\n\nOverall Dying Light 2 is a massive downgrade from the first game. Broken coop terrible performance weak story and endless bugs make it almost unplayable. At this point it is honestly just laughable.\n\nNot recommended",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, i really tried to enjoy this game. But as of state 2025 almost 2026 it crashes almost every 20 minutes, I bug into walls after sleeping in bed and so far i havent had a single session lasting more than 30 minutes without having to restart. No matter how good a game it is underneath it deservers a bad review from me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy, glitchy, crash-y piece of trash game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not all that fun in my honest opinion, grab it on sale (like me) and maybe it'll worth your money, get friends to play it with you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "updates made this game more bareable and towerraid is fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, I know I'm writing this very late after the release, but idc. Here we go.\n\nI want to enjoy this game. I want to love it. And part of me does.\n\nI have tried of 4 separate occasions to get through this game, but I can't do it.\n\nThere are a mix of personal preferences in the game I'll go over, but the biggest problem I have are the bugs/weird, unexplained mechanics that are just... well, weird. I dunno. Ima tell a story of my last session, a view into my experience. Spoiler warning I guess\n\nSo, first, I enjoy a hard game. I enjoy the atmosphere this game brings, the enemies can be spooky, things can be tense. I like dat. Runnin and avoidin cuz I have to.\n\nWhat I DON'T like is when ol' man Marco, the water poisoner guy, has a skull made from the reforged remains of a Tiger tank, and proceeds to headbutt my machete until it breaks.\n\n33 damage (which was alot at the time) and 145 durability. And it breaks before he dies. Oh, BUT HIS OLD ASS TWO SHOTS ME. Cool. So I die, and then I respawn across the universe.\n\nIts dork. Night time.\n\nI wanna run around during the DAY, cuz, yknow, volatiles n shi. Spooky. So, theres this cool feature called a bed. I just respawned by it! So I hold the good ol \"F\" key, and take a schnozzy. SNORE SNORE SNORE, wake up, walk forwarrrrr-I'm stuck in a wall. Why am I in a wall. Game? Dev? WHY'D YOU PUT ME HERE!?\n\nTry jumping, crouching, cant attack or blow myself up, cuz safe area, so... Main menu.\n\nRestart, and I spawn in the... Hospital? Yknow, when you and Hakon are getting the bio-wrist thing? And then you gotta run from the Volatiles out a door..? A door thats... now... closed?\n\nMain menu.\n\nRespawn somewhere else. Cool.\n\nRun back to Marco, chop him up. Win. Yay.\n\nLeave the place, and, with my Pilgrim (not witcher) senses, I hear the cries of a fella in need! I engage my turbo glutes and rush to the scene. There are three dudes with a poor man tied up.\n\n\"Kill em.\" I hear in my head. So, I hop down, don my remaining machete, and, oopsie, I forgot that humans are actually God.\n\nOne of God pulls out a crank-a-doodle and starts a tootin on it.\n\nBy the second toot, I've yucked a throwing knife at him, and stopped it. Or so I though, two toots is too many, back up is on the way! Well, cool, surely the zombies will come too.\n\nTwo more gods show up, so, now I start SWINGIN. But poor me and my feeble metal-stick, its no match for this guys hoodie! It was dipped in a cauldron of boiling Dragons tears, at the base of ice-fire mountain, while a titan bled into it.\n\nOh, and the zombie-backup I was waiting for? Yeah, no, zombies have selective hearing.\n\nNow, somehow, by an unotherworldly miracle, I kill one. Three swings at a time, by the way, because my guy goes into cardiac arrest after the fourth swing. And I guess the dead guy poo's himself? Cuz, he leaves behind a stinky. Like, a big ol' POOF cloud of ew shows up and... and now the... the other guys are zombies!\n\nSO, I keeps bashin and crashin and slashin, and this is when I learned about the selective hearing, cuz... Zombies heard my melee. Not the DOOOOOOOT...... DOOOOOOOOOOOOT...... DOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT!\n\nSo more virals arrive outta, I dunno, sewer Hell, so I keep fighting.\n\nAnd... perhaps I made the game mad, cuz, boom? B-BOOM!? I JUST EXPLODE? THE GROUND SAYS \"FUCK YOU DIE!\" AND I BLOWZ UP!? No barrels, no propane, no zomb-bombs.\n\nSigh.\n\nRespawn. Run around. Look for something to do. OOOOH WHATS DAT? Night activity? INDOORS!? That sounds *awesome*. So, I go and find a bed so I can pass the time, cool feature, I hold \"F\", screen fades, comes back, walk forrrr-and I'm in the wall again. Is this a skill check? SLEEPING!?\n\nI quit.\n\nI dont understand what is happening half the time. Virals hear melee but not NPC sounds, constantly spawning them during fights, random explosions killing me or my enemies (I wanna fight em dammit), the poo clouds, the glitches, random spawn points, it's all just a clunky mess. I cannot recommend it, as it is one of the most un-polished and rocky experiences I've had, even if I do, at the core, love the gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun in the beginning but then you level up so much that it's no longer a challenge and then it loses its charm",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's like Dying Light, but a little shit in every aspect",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abismal lighting. the game constantly crashes.  the 3d modeling doesn't work correct.  items in game that should show up ie the key to access GRE things doesn't show up.  and the stupid puzzles for the power stations are stupid annoying and pointless.  the only game i've played thats worse than this is starfield.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi! I will be reviewing DL2 after playing for a bit.(Bought since 2022, played 2025)\r\nNote. This is my opinion, you don't have to trust or think about it. Just read for fun :)\r\n\r\nPositive\r\n-Love the gore, nice combat mechanics.\r\n-Gameplay has lots of content.\r\n-Movements very smooth\r\n-Random player in this game is very kind and cool\r\n-If you love exploring world, you MIGHT love this game.(a lil' bit)\r\n-Soundtracks are really good. (I LOVE this game's soundtracks as much as i love my mama & papa)\r\n-Graphics are well-optimized imo. (RTX 3060 intel i5-12400F ram 32 Gb)\r\n\r\nNegative\r\n-Inhibitors (There's some of inhibitor that you have to do sidequests, etc.) should've mark those too. (If we have the GRE detector might as well detect those inhibitor same as the safe one.)most people might miss those inhibitors and can't do a 100% upgrade.\r\n-Lots of bug still after 4 years can't even fix the game properly. \r\n-The map scaling is unnecessary, many blind spots in the map. \r\n-Movement kinda bugging.\r\n-Co-op movement is very stiff and weird.\r\n-Story is meh.\r\n     -Interactive quest is just a choice that affects the map, same quest & gameplay.\r\n     -Epilogue auto-skipping the ending. (Happens to me & my friend while we're playing together in Co-op mode)\r\n***The inhibitor fixed to related story line is already fixed***\r\nSummary.\r\nimo, just skip this one and go play Dying light : The Beast instead. :D\r\nThe expectations were very high that this game's release was such a mess.\r\nI played this game for 100 hours, met a lot of bugs (almost thousand times). \r\nThe game's still in ALPHA state.(please do not expect much)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very mixed feelings about this game, big fan of first DL that's why was so hyped on this one. Developers tried to improve sequel with bigger world, better story, more characters and so on, in some parts they succeed, in some don't.\r\nGame is not new but still have quite a lot of bugs( stuck in random places ,sometimes in middle mission fall through textures and die, hit impact sometimes works incorrectly, which none of this was in the first one, at least for me)\r\nStory more complex and dramatic in which you try to survive zombie apocalypse, but in the same time new art style and bright colors make you feel like some fortnite game compared to first. \r\nQuite a lot backtracking, grinding and repetitive tasks (especially in dlc).\r\n\r\nWhat I very liked, city verticality, it's a great when you can run from one building through another in skyscrapers jump from window and just fly with glide back to street. \r\nParkour- great, nothing to add!\r\nGameplay in open world is fun and have good varieties ,after some time starts repeat, but still enjoyable.\r\n\r\nDL2 isn't  bad game, just to me it causes mix feelings after first one. If this is your first entry to series,  and you have none expectations, then you probably have better experience than me :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much of a follow the game script, there's a lot of time spent talking and interacting with other characters, it's just not for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good parkour game.\nBut a poor Dying Light. There is zero threath or horror feeling.\n\nIf you love the current ubisoft games and don't like the horror vibe, you will have a lot of fun with this game.\n\nThe atmosphere is not good for a survival game.\nFor me, DL2 consists of an extremely boring world.\nIt's a kind of Disney version of Dying Light 1.\nVilledor consists of a few houses that have been copied everywhere.\nDark Zones are over-copied.\n90% of quests are always the same repetitive tasks.\nThere's nothing to explore and a game for people with an incredible amount of time due the grind.\nIt's totally okay that there are people who like this kind of thing, but I would love more quality > quantity.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game on launch\nIt felt wrong and I've tried playing it for years on and off and keep dropping it. I want to like this game so bad since I like the first game so much but it still just feels ass to play.\nJumping, attacking, and then the plot on top of it all just sucks ass. Another choices that \"matter\" and your options and what your character says just don't allign, pretty much all the time.\n\n3 years later, closing in on 4, I'm still experiencing constant bugs that ruin my experience that shouldn't even bee this frequent in a game that's been touted as \"Fixed\" and \"improved\"\n\nIt's got the ideas and execution of some of the things I loved so much about the first game, but not of it feels even half as good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone who really enjoyed DL1 and also as someone going into DL2 with VERY managed expectations, I was disappointed. \n\nThe story is extremely boring, generic and forgettable, the gameplay gets old fast and the world feels uninspired. \n\nAs some has said before me, the spark that made DL1 special feels missing.\n\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Items don't reset after death on a boss. Inconsistent block timing. Inconsistent dodge windows. The difference between blocking with a 2 handed weapon and a 1 handed weapon is cheap. It is a good game that is programmed bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there are tons of things to say about this game, more negatively than postiv. however i will make it very short. Its not a bad game, but definetly not good. people who played dying light 1 and love that game, i recommend them to play dying light the beast instead dying light 2, before they are loosing their love to dying light or getting dissapointed. this game is just hmm... just 4/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit fukin game just let me coop no one wants to play this shit game alone y do i have to finish fukin missions to coop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has been out for years now and I got it when it first came out on Xbox playing it on pc/ steamdeck now, and still a huge amount of bugs nearly makes the game unplayable.... \nNot able to play at night the flashlight won't turn on \nThe paraglider will stop working mid air.... \nOnly allowed so many perfect parrys then won't allow anymore.\nBeing hit through walls with arrows and melee weapons. \nAnd there is many more \nI am greatly sad about this because the first one they made was absolutely amazing and the DLC the following.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE this game, have to say that. Well done, BUT... \r\n\r\nIt crashes randomly.... Nothing helps! Reddit, Steam, nothing. Game started crashing randomly and no matter what I do, what I install, re-install, game crashing in 30 seconds up to 20 minutes, just randomly. Freezes or straight to the windows. \r\n\r\nSorry, but that is just shame. So many other comments on internet, so many users complaining. \r\n\r\nIf that is fixed, I can ONLY recommend!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is it the second coming of god... no. It is not absolute s*it either although plenty of parts in it was straight from trash. It is one of games in the zombie genre for sure... I dunno, mayhaps I was looking from it something that it never was ment to be. What I would have wanted was much more deep rpg with post apocalyptic + zombies. But I am up to my ears with the timed events and \"parkour challenges\". There were few actually pretty decent rpg elements and quests in it for sure, mainly somewhere in the middle of the game. Sure, I did not play co-op or some other tower raid or some such multiplayer bs, but it was enough of a grind and slog to begin with. Traversing through the city is way better to be sure, and \"guns\" or ranged combat in general is mainly just a after thought. Now knowing what it is I would probly not buy it even for 10, and certainly not dump 180 hours in it. But having completed the main game and started the \"dlc\" im out, and I am glad i left the blood ties to last because I can now gladly unistall this from my pc and from my memory. And I am one of those twisted people who would like to complete games 100%, but for this, I could care less anymore. In the future would be more likely to pick up either DL1 again or Dead island 1 for these kind of iches. Oh nearly forgot 2 major issues. 1 it is buggy mess, just accept it. I had a quite few different and consistent bugs but the biggest without any doubt was the \"no run\" bug... in a parkour game... that occurred probly every 30 minutes or so... And 2, just give us manual saves ffs... The \"rollback\" does not a function hence my 180h because i restarted from scratch midway.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disapointing, underwhelming and stuff.\nThe open world activitys are so fucking bad, I becamo more angry then happy when making this stuff, you can see how this could be good, but its bad, you can see the problems, but even so, the main story is interesting, if you buy this just for the main story its actually interesting, but DO NOT DO THE OPEN WORLD ACTIVITYS, that things starts good, but rapidly become repetitive, and simply bad, not fun.\nIf you want to buy this just to experience the grappling hook in a big city, and be amazed to by it, because it grab your atention on The Beast, just like me, you dont get it until far in the story, or I missed something.\nYou can feel the wokeness of it, even if its not much, and when you starts to feel disgusd by the side content on it, you remember that you bought the bloody ties DLC, then you starts to ask your self, why I bought this? But you cant buy the game without the DLC, yes, you, and I, threw our money away, I dont have a singular motivation to play it.\nBut really, the main story is not that bad, and new game+ to start the game with the grappling hook seems interesting, maybe I come back one day.\nThe parkour stuff is good and really fun, you naturaly start to do some fetch quest just to walk around the map, before start doing only the main quests, thats really personal right? Whatever.\nI dont recommend playing it, either buying it at all, only if you really like Dying Light, DL1 and DLTB are awesome, playing those 2 first is better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Compare to the first game, it struggles to meet its standers. I have some hope for the game, but if I had to choose DL 1 or DL 2 to play all day, I go with DL 1. Story is good, But it doesn't pull me in. Exploring gets boring as I feel like I already explored the area, even though I hadn't been there. Combat okay, but when fighting a night boss at dusk to dawn there a problem. I only play on default difficulty, and it feels to easy.\r\n\r\nWhen I think about these issues a lot of them go away if I focus on the story rather then exploring. But I love exploring so my character gets to strong. But then again I can't seem to do enough damage to one of the night bosses. Honestly there a lot of short coming to this game but, if this game was the first and DL 1 was the second. I'd would be less critical to this game.\r\n\r\nTL/DR: DL 1 is better, but this game isn't bad. If you like story driven games you will like this a lot more then me. If you like Exploring as much as me then this is just good game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they done fuckd up multiplayer, tried playing with friends but that was a mess, my friend was seeing things that wasnt even there, and zombies disapeard out of thin air, just to respawn again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont know much to say, i guess its a mid zombie game like the synthetic man review says. but also, they have the inappropriate people pride brigade flags everywhere like they own the place like we've been conquered like sodom and this was the end result, zombie apocalypse lmao i didnt personally notice them because the place looks so eroded but was brought to my attention, so they have the wokeslop geyliens in this company as well. theyre in every game studio just about to groom everyone but in particular the young into normalcy of the inappropriate. definitely dont recommend. 'well whats wrong with it' whats right with it? keklmao nothing. nothing wholesome at all. and they want to condition everyone nothing is wrong with it. all kinds of conditioning these days. these ppl dont reproduce but they're really proud of themselves. the only way they reproduce is conditioning the youth to make more of themselves. proud of population decline, abnormal unhealthy lifestyle and health issues. theres nothing to be proud of. get back to The Tree of Life, The Truth, The Way. its not safe being a branch on the forest floor, you wont last long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so boring bro. like idk, i guess the first hour is good but then its so boring, and just becomes even more boring once u get the paraglider. parkour becomes essentially useless with a max level paraglider and grapple hook",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing, that's what define this game. Even with discount feel like ripped off. Feel empty even bigger map than previous game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They keep taking away features I liked back when I played this on PS4. They added guns, which completely destroyed the balance of combat (though thankfully this is something you can just not have active). They also removed the stamina bar for parkour, making the reason you collect Inhibitors completely irrelevant to the story of the game. I would be okay with this second change if they made the change optional, but at the time of this review there is no setting for it. IMO, it ruins the experience/immersion when all of the windmills, radio towers, power stations, and subway stations are doable as soon as you enter the area. The only reason you had to collect inhibitors was to increase Aidan's strength and stamina so you could climb new heights; and now that doesn't need to happen at all. Very disappointed with the new updates and I am going to try rolling my game back several versions. I recommend other people do the same.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lowkey garbage ngl. Terrible movement with too many abilites that overlaps with each other. Stamina feels nonexistent. and the content they release is bland like unseasoned chicken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are so many buttons to memorize and the worst part is that they still don't work when you want it. Fuck this trash game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Picked it back up after years, realized why I don't play. This game crashes all the time, a ton of weird technical errors, and Aiden and most major characters just suck. Hermann is one of the best characters in the game because he [i]doesn't fucking speak[/i]. I'm glad Dying Light decided to stick to Crane after this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only redeeming part of the game is its OK gameplay, missions/objectives are mind numbingly pointless at times, and the storywriting is godawful.\nCutscenes are not engaging, and once you notice that every single NPC ends a cutscene by leaving the frame then vanishing you never stop noticing that fact. (pointed out by friend)\nDLC (bloody ties) is a needlessly difficult and boring mess. and it made me stop playing completely.\nnighttime is not as engaging as it was in the first game, and the characters have no sense of how the world around them has changed. (like a child just hanging out on a roof when infected roam the streets and rooftops? how the heck are they nochalantly resting there?\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sucks my arsehole and plays with my nipples the wrong way. trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wasn't terrible, just really meh compared to the first one. I played the first one a ton. This was like more of a chore slogging through this. I definitely will not be revisiting it. I'll give it a 5/10.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DONOT BUY THIS GAME! IT IS THE MOST BROKEN GAME I HAVE EVER PLAYED! YES, MORE  BROKEN THAN CYBERPUNK ON RELEASE. Me and my friends were playing the halloween event, having a good time. We were running through the nightmare tower easily when we encountered a deliberate wall to keep players from completing the tower. Basically, there is an area where you have to restore power, but it doesn't tell you how to and there is literally no generator or any key items to complete that level. So basically you are stuck forever. I admit that we used WeMod to search for it, because apparently in that room you are bombarded in the ass with bombers and you cannot take a break, all while trying to search for an item that doesnt exist. Anyways, there are no YT videos on how to do it, because it is impossible to complete, and it is extremely frustrating considering how well we were doing with our gameplay and got screwed over by the fucking developers. Do not purchase this game if you value your mental health and friendships.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You cannot chance controller layout... modern game...\r\nYou cannot make this FUC*ING epic game store popup to stop...\r\n\r\nI was thinking about replaying this but I forgot how UNACEPTABLE this shit is...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game crashes every 10 min ! I have a  really great pc with a 5070 tried some thigs i read on the forum till this is fixed it will remain a no recommendation from my side :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Prob the worst game ive ever played on steam, got it barely for free for hallows. Veilguard was more entertaining. These people should be ashamed for making such absolute shit. Shame on them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would not recommend this game to others. I didn't like the first Dying Light game, but I gave this one a shot too. I highly doubt I'll ever play anything else from Techland.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playing one hour of this game felt like torture, what a disgraceful downgrade from the first one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes every time I start it after the newest update.  Guess I won't revisit this one!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For me playing is awfull, have an up to date pc but lots of graphical bugs and random fps drops",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Floating like your body is full of helium, smoke alarm quest notifications, small child calling you Aidybaby. Dying light lost it's touch with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3.5 years. Remastered. DLC. And yet the monkey bars at Saint Joseph's Medical Relay still have not been fixed. In a Parkour game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor parkour, trash story, ton of side quests and awful coop mode. Just play dying light 1",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A mess of a game with so many problems, play with friend or not at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "aiden is the most pathetic piece of human waste ive ever seen! \r\nwon't play this shit ever again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Getting parkour XP is actually really fuckin stupid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GAME IS STUPIDLY BUGGY DO YOURSELF A FAVOUR AND JUST PLAY THE FIRST ONE",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Gra jest co najwyżej średnia. Żadnej postaci nie da się szczerze polubić przez to, jak płytko są napisane. Sam świat jest bardzo powtarzalny i w 95% przypadków niczym nie zaskakuje. Z zadań pobocznych zrezygnowałem po kilkunastu próbach - zadania poboczne nie wnosiły do gry niczego ciekawego ani pożytecznego.\r\n\r\nGameplayowo jest okej, ale technicznie to lipa na nowych platformach. Nie byłem w stanie ukończyć fabuły przez ciągłe crashe podczas misji z pewną postacią mającą atak klaustrofobii w windzie.  Po przesiadce z RTX 3060 na RTX 5070 Ti gra wyrzuca do pulpitu przynajmniej raz rozgrywkę, a przy wyżej wspomnienej misji dosłownie po 30s potrafi wywalić grę.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has got very buggy loosing inventry items, really not sure if it is worth playing anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A game where all the promotional material was spent talking up how high quality the story is and how impactful \"decisions\" would be. Then firing the only person who knows how to write.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You want me to buy dying light the beast when dying light 2 is in this condition? Ive finally persuaded my friend to play your mung infested flaps and I've crashed to desktop 3 times as his coop partner. Thats after upgrading my pc to a I7 and a 5070TI. Alot of the problems i experienced at launch are also still here. Sort your crabs out you stupid, crab fueled anal bandits or I will shit on your stepfathers encrusted ballsack.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Loads of bugs DLC is a outright scam for how expensive it is unless you get this on a 75% or higher discount DO NOT BUY IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A total disappointment, doesnt worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat is terrible you The Banbee is trash not reccommed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps randomly crashing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played 15 hours thinking \"maybe it will be good eventually\" and I have given up",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Uninspired slop not worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think there's a game in my bug",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "overall, not the best sequel",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes every 2 mins",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck I hate this damn game !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game hurt me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dying light 1 is better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "MEH. (with friends)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable dogcrap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "stay chuj",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too many timed quests",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "crash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Scamed again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why I dislike this Game.\n\nparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkourparkour.\n\njust to much............ unlike one where you would parkour kill zombies and quest,\nyou spend hours just trying to get from A-B\n\nAnd on top of that they keep Tweeking the game mechanics for no reason more then they can...\nyou log in and play and your super zombe smasher the next there blowing up in your face ;/",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}