{
  "positive": [
    {
      "review": "this game is the best i give most of the credit to camodo gaming ive been watching him for 5 years and i mostly loves his brick rigs videos, so ide advise all the people reading this to go check out and sub to his channel",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "great game and has tons of untapped  potential",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun to play by yourself, and with friends. I love that there is multiple different ways to play this game such as RP, and just goofing :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very very fun game, It's just fun to watch things explode put very demanding you definitely need good specs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1.start playing the game \r\n2.hate's it at first glance \r\n3.never touch it again \r\n4.comes  back  \r\n5. starting to like the game \r\n6. making frame drop to friends Pc / laptop",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The games very good, for builders it's basically all youd ever want as its a very creative heavy game.\r\n\r\nHowever in terms of the player base/public lobbies its all just 9 year olds that only troll and dont even try to have fun and there are so many RP servers, the potential for big racing servers are there but no one hosts them (Americans might do but I'm not in their time zones), the game seems like its on a bit of a decline from experience and just talking to players but all that being said its a great game to play with friends and use some of the amazing things created on the workshop.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the toy is awesome, the equipment is very cool, and the construction doesn't break, but the destruction needs to be repaired. When you touch the car, half of it breaks, and when you touch the plane, it flies off the map. I recommend playing more and learning more about the game.!!! 🤙👍👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good but you need to remove infinite ban beacuse people caan abuse it (yes it happened to me)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "can you notify the fact that why they made this game look like Beam NG but LEGO form on the store page and also little wonky physics but I definitely recommend this if you like goofy stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, lots of modding that doesnt need to be installed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i little like the game, teardown. its great but the best part is probably multiplayer for most. its a sandbox lego sort of game having physics, parts and even terrain. it runs really great even with a bad gpu or cpu.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really fun demolishing buildings and cars and all that stuff i really recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played Brick Rigs for a long time and I've enjoyed the game while playing alone and with friends looking at all of the things people have in the workshop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and easy to make stuff with and do basically anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "watched spycakes play this all the time and fell in love with it. loveley game but it might also be becasue of the nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spaycakes, O.B, Commando gosh i loved seeing them play this game on the daily man i wonder what they up to these days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING GAME. i really wanted to get this game becuase i saw camodo gaming,spycakes,beutiful ob and fusturated gamer play this and i finally got this game this summer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, i love playing this with my friends, its so much fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great for anyone who wants to actually build with unlimited legos, make build plans, or just wreak havoc with the physics based destruction. Anyone who love lego should definitely check this one out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun existing and theres loads of worskshop mods!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes would recommend, really fun and good muti player, unless mods and a lot more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, and very addicting. anybody who likes to build or destroy stuff HAS to play it. 10/10 although there are a few flaws so maybe a 9.7/10. its not for everyone. very addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really cool it gives a real life lego sim with all kinds of lego vehicles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first game i ever got on steam so i might be a bit bias. this game is top tier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it fun you can build and play with your friends and you can battle too and do rolplay it fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have played a total of 2 minutes of this game, my son who is autistic loves this game! the Lego, the trains, and running cars over with trains, he loves this game. I'm sorry if he went into your map and destroyed your stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with friends. Has great crash physics you can do almost anything you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun, the price is way better than brickadia, but after all it has very good things.. Uh yeah idk what to write anymore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun in multiplayer, as long as you have the right cars that is! 10/10 Would recommend to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has made my aim using any form of military equipment 10 times more lethal to civillian airliners",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“Brick Rigs is pure chaos and creativity. I built a GO Transit train, crashed it into a taco truck, and Charles chased me through the wreckage. The physics are wild, the Workshop is endless, and multiplayer is a blast. If you love building, breaking, and storytelling—this game is a dream. 10/10 would scroll again.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game to roleplay,stunts or anthing else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good but some people are dumb and lag your pc but its a coll game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game I’ve ever played. The editor makes it so fun. I can literally turn any car into anything I want. Or do anything I want I build houses get stuff off the workshop. I recommend trying Phoenix in troubadour car company.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Handles fairly well typically, very fun. Though I do wish that the building was a bit more simple, I’ve tried to build stuff (even modify a few creations) and it’s so over-complicated than it needs to be. I tried some tutorials but not a lot of them exist or are really good at explaining anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beamng but multiplayer and more content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game i ever play the mods are crazy so buy to have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brick Rigs is a fun building game where you make or download vehicles and test them. You can crash them, race them, or fly them. The physics make everything feel fun, and multiplayer adds even more fun. It’s simple but great if you like building and messing around.\r\n\r\n10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like BeamNG but with Lego and guns, The game has a full selection of cars to choose from made by the community being added every single day. You can play single player or you can join / create a server and have fun with other people on the internet. The only problem i have with the game is that cars flip over a lot when being off road. Either way, this is a really fun game.\n\n\n9.5 / 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "favorite game realy good pyshics mostly playing with mods  i give it a 10 realy good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An hiden gem that NEED more spread. This game is a very nostalgic one for me. But it is really good and complex. You can do stuff I didn't even knew about like fkin guided missile or entire AI's. The only problem is the optimization that is clearly suffering from an old game engine and stucture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Labai geras žaidymas.mes su draugu darom Lietuvos rp. serveris būna atidarytas kiekviena diena vakare.Tai kas yra lietuvi tai prašau nusipirk šita žaidyma.Visiem labai siulau :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i refund the game and i have not got my money it ban 2 day and the reason i refund it was becaz i did not like it and i just want my money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Joins server, gaint flying penis missle kills me.\nBest game ever!!!!11!1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such an amazing game. the controls take some getting used to but i highly reccomend, also i crack femboys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“Building dreams, one brick at a time.” \r\n\r\n“Life is all about building.”\r\n\r\n“The smallest pieces can build the biggest worlds.”\r\n\r\nWhat you build tells the story of who you are.”\r\n\r\n\r\n“Dream it, build it, live it.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun with lots of cool builds you can get!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fun and its better with friends i give it a 10 star reivew",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing! a fun, chaotic game with ENDLESS possibilites!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oh yesssss undertale lol\nlong ahhh cars lol \nahhh!ban the diddy cars pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best and super fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so peak. you can make your own car, plane, or whatever, theres active Rp and combat servers. handling and car physics kinda suck at high speeds tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great playing with friends! Would recommend the Advanced Combat mod.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game good yes very good game you should play you should play game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "verry gud but plepoe dont really join my servers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "itss s s s s ss s s s s s s sossososososososossssssssoooooooooooooooooo bffffffffffffffffffffffiiiiiiiiiiiiiiiiiiiiiiirrrrrrrrrrrrrrrrrrrrrrrrrrreeeeeeeeeeeeeeeeeeeeeeeeeee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "roses are red your screen is blue brick rids dletid sistum 32 sorry i can spell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very fun game though it has a pretty limited map supply solid 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "thiss game is so fun with friends i truly recmend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "افضل لعبة سيارات و في العاب مثل محاكي الحوادث وبعد تير داون",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yeah i wish i could build good stuff but i suck ): atleast its FUCKING GOODDD *EAGLE SREEACHES*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good like i saw mason 67 in here he had everything!!! the fluffy hair AND the ice cream outfit!!! I Recommend this game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER!!!11!!!!!1!    THE TANKS GOT ME ROLING LIKE A OFFBRAND VOLKSWAGEN TIRE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes... at some parts it.... cringy but yes i do reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's so fun maybe a bit laggy but it's vary good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good gme i would recomend but it is hard to get mods on this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just a fun and relaxing game i recommend you shouid play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BeamNG.drive but with Legos (probably lol I dont have BeamNG.drive)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game and very fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is THE BEST, I can do A LOT of stuff!!!! 10000000000000/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game! I have over 1400 hours in this!\nWould recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is very nice and fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my whole childhood was watching ppl play this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After 10hr I can say this is a good game if you have the mony.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game, great community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mmm, me see bloc\r\n block get placed\r\n\r\n\r\n satisfaction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ">join a server\r\n>gets shoot in the head\r\n this game is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "OG game and if u dont like ur wrong",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idk what to say, but it's a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game alot RP server 5 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it fun and i hope people likes this as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun if u wanna destroy stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IF YOU HAVE WATCHED SPYCAKES YOU KNOW WHAT THIS IS!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I crashed into my friend's pig mobile and it went flying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun with friends, yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First tried it, my friend sniped me with a nuke 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good, needs better optimization though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best lego game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lego shenanigans 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game needs tutorial tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "build and kill fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rlly fun game what shoud i say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Legos\r\n\r\nBut on steriods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire game comodo plays it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked the crashings and the engein fires so i vary much think all of you shoud donload this game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hope you guys love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "creative good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game: amazing\nPhysics: piece of SН1...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game. there is a lot to do.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "There's really not a lot of content here other than building vehicles and driving them. That's about all you can do. After an hour or two it gets incredibly boring. The whole inventory system is a weird addition and I cannot imagine why it's in a vehicle building game.\n\nThis feels like the type of game you'd add a bunch of workshop mods into (like Garry's Mod). It's so... empty??????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So whenever you join a server: First, there is admin abusing, Second, there is a long desc to the server to make it look good but its really not that good, Third, there are the infamous server crashers, they yeet servers into oblivion and destroy your computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not worth 20 bucks, game is really buggy, honestly roblox is way better and its free ( and im saying this and I hate roblox), the updates that do happen are so bad and this whole game just around pisses me off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not get this ass game it will break after putting 1 thousand hours on it do not get addicted to it this game is absolute shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "saw youtubers playing it years ago, and thought id join in on the fun.\n\nbut it turns out that... for lack of a better word, that the game is absolutely unstandardized... some basic controls are as you would expect them to be, but already at basic movement things like crouching are hooked up to letter keys instead of left ctrl as you would expect.\nand the whole vehicles and aircraft controls system being split into a quartet of odd subsets where alternate mode for some reason disables your camera is just so weird to me, like... why do i not get to look around in third person anymore?\nand where are the sticky keys at? and the enable/disable for mouse control?\ni would really like to have that option, instead of screwing up every landing approach because my idiot self tried to look around and forgot to hold down the arrow key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant find out what any button does because theres no tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is full of racist people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game broke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know, its kinda meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sux",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's really not a lot of content here other than building vehicles and driving them. That's about all you can do. After an hour or two it gets incredibly boring. The whole inventory system is a weird addition and I cannot imagine why it's in a vehicle building game.\n\nThis feels like the type of game you'd add a bunch of workshop mods into (like Garry's Mod). It's so... empty??????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So whenever you join a server: First, there is admin abusing, Second, there is a long desc to the server to make it look good but its really not that good, Third, there are the infamous server crashers, they yeet servers into oblivion and destroy your computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not worth 20 bucks, game is really buggy, honestly roblox is way better and its free ( and im saying this and I hate roblox), the updates that do happen are so bad and this whole game just around pisses me off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not get this ass game it will break after putting 1 thousand hours on it do not get addicted to it this game is absolute shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "saw youtubers playing it years ago, and thought id join in on the fun.\n\nbut it turns out that... for lack of a better word, that the game is absolutely unstandardized... some basic controls are as you would expect them to be, but already at basic movement things like crouching are hooked up to letter keys instead of left ctrl as you would expect.\nand the whole vehicles and aircraft controls system being split into a quartet of odd subsets where alternate mode for some reason disables your camera is just so weird to me, like... why do i not get to look around in third person anymore?\nand where are the sticky keys at? and the enable/disable for mouse control?\ni would really like to have that option, instead of screwing up every landing approach because my idiot self tried to look around and forgot to hold down the arrow key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant find out what any button does because theres no tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is full of racist people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game broke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know, its kinda meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sux",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's really not a lot of content here other than building vehicles and driving them. That's about all you can do. After an hour or two it gets incredibly boring. The whole inventory system is a weird addition and I cannot imagine why it's in a vehicle building game.\n\nThis feels like the type of game you'd add a bunch of workshop mods into (like Garry's Mod). It's so... empty??????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So whenever you join a server: First, there is admin abusing, Second, there is a long desc to the server to make it look good but its really not that good, Third, there are the infamous server crashers, they yeet servers into oblivion and destroy your computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not worth 20 bucks, game is really buggy, honestly roblox is way better and its free ( and im saying this and I hate roblox), the updates that do happen are so bad and this whole game just around pisses me off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not get this ass game it will break after putting 1 thousand hours on it do not get addicted to it this game is absolute shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "saw youtubers playing it years ago, and thought id join in on the fun.\n\nbut it turns out that... for lack of a better word, that the game is absolutely unstandardized... some basic controls are as you would expect them to be, but already at basic movement things like crouching are hooked up to letter keys instead of left ctrl as you would expect.\nand the whole vehicles and aircraft controls system being split into a quartet of odd subsets where alternate mode for some reason disables your camera is just so weird to me, like... why do i not get to look around in third person anymore?\nand where are the sticky keys at? and the enable/disable for mouse control?\ni would really like to have that option, instead of screwing up every landing approach because my idiot self tried to look around and forgot to hold down the arrow key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant find out what any button does because theres no tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is full of racist people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game broke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know, its kinda meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sux",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's really not a lot of content here other than building vehicles and driving them. That's about all you can do. After an hour or two it gets incredibly boring. The whole inventory system is a weird addition and I cannot imagine why it's in a vehicle building game.\n\nThis feels like the type of game you'd add a bunch of workshop mods into (like Garry's Mod). It's so... empty??????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So whenever you join a server: First, there is admin abusing, Second, there is a long desc to the server to make it look good but its really not that good, Third, there are the infamous server crashers, they yeet servers into oblivion and destroy your computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not worth 20 bucks, game is really buggy, honestly roblox is way better and its free ( and im saying this and I hate roblox), the updates that do happen are so bad and this whole game just around pisses me off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not get this ass game it will break after putting 1 thousand hours on it do not get addicted to it this game is absolute shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "saw youtubers playing it years ago, and thought id join in on the fun.\n\nbut it turns out that... for lack of a better word, that the game is absolutely unstandardized... some basic controls are as you would expect them to be, but already at basic movement things like crouching are hooked up to letter keys instead of left ctrl as you would expect.\nand the whole vehicles and aircraft controls system being split into a quartet of odd subsets where alternate mode for some reason disables your camera is just so weird to me, like... why do i not get to look around in third person anymore?\nand where are the sticky keys at? and the enable/disable for mouse control?\ni would really like to have that option, instead of screwing up every landing approach because my idiot self tried to look around and forgot to hold down the arrow key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant find out what any button does because theres no tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is full of racist people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game broke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know, its kinda meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sux",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's really not a lot of content here other than building vehicles and driving them. That's about all you can do. After an hour or two it gets incredibly boring. The whole inventory system is a weird addition and I cannot imagine why it's in a vehicle building game.\n\nThis feels like the type of game you'd add a bunch of workshop mods into (like Garry's Mod). It's so... empty??????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So whenever you join a server: First, there is admin abusing, Second, there is a long desc to the server to make it look good but its really not that good, Third, there are the infamous server crashers, they yeet servers into oblivion and destroy your computer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not worth 20 bucks, game is really buggy, honestly roblox is way better and its free ( and im saying this and I hate roblox), the updates that do happen are so bad and this whole game just around pisses me off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not get this ass game it will break after putting 1 thousand hours on it do not get addicted to it this game is absolute shit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "saw youtubers playing it years ago, and thought id join in on the fun.\n\nbut it turns out that... for lack of a better word, that the game is absolutely unstandardized... some basic controls are as you would expect them to be, but already at basic movement things like crouching are hooked up to letter keys instead of left ctrl as you would expect.\nand the whole vehicles and aircraft controls system being split into a quartet of odd subsets where alternate mode for some reason disables your camera is just so weird to me, like... why do i not get to look around in third person anymore?\nand where are the sticky keys at? and the enable/disable for mouse control?\ni would really like to have that option, instead of screwing up every landing approach because my idiot self tried to look around and forgot to hold down the arrow key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant find out what any button does because theres no tutorials",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is full of racist people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My game broke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know, its kinda meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sux",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}