{
  "positive": [
    {
      "review": "We all know Ubisoft is just an evil company at this point but we can't deny this banger game they created\n\nFar Cry 5 delivers a satisfying mix of open-world chaos, solid gunplay, and a surprisingly engaging setting in rural Montana. The freedom to approach missions your way — whether stealthily or loud and explosive — makes every encounter feel dynamic, and the world is packed with enough side activities to keep things fresh. The story leans into its cult theme with some memorable moments, and while it doesn’t always hit the emotional highs it aims for, the overall experience is fun, polished, and easy to recommend for fans of sandbox action games.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "It's a great entry to the series. But Far Cry 4 is better IMO.\r\n\r\nStill, many memories were made playing this game back in lockdown, with friends in co-op. Being able to do story missions with your lads was great! And the map. Gotta be the most stereotypical hillbilly American I've ever seen. loved it.\r\n\r\nShame the series went down the drain in the more recent entries. I guess Ubisoft never disappoints in that regard.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Far Cry 5 is a very good game. Once again, they made a beautiful open world game. They improved a lot and changed the formula a little bit from Far Cry 4. I really liked the gunplay and the characters. The world was full of surprises. Joesph Seed was a very great villain and the ending was unexpected. This is one of the better Far Crys. Only the random abductions that keep happening as you progress through the story weren’t great. The DLCs are average and worse than for Far Cry 4. Overall, it was a very great game and I had a lot of fun finishing it!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This game is very well written and showcases one of the best vilain, all media considered, of all time.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This game feels so authentic and good it's story and gameplay are phenomenal for a pve game it works sp or mp this games a blast, Only downside is that the story mode is capped to 2 players but other than that peak game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Far Cry 5 was an absolutely amazing experience. The gameplay felt super fun and intense, and playing it in co-op made it even better. Exploring the open world with a friend, taking down outposts, hunting, and just messing around in Hope County never got boring. The game world feels alive, the gunplay is satisfying, and the missions are a perfect mix of action and chaos. The story isn’t the strongest part, but the atmosphere and freedom more than make up for it. The graphics are beautiful, the soundtrack fits perfectly, and there’s always something cool to do, from fishing and flying planes to fighting cultists in epic battles. Honestly, I had a blast from start to finish. There are a few small bugs here and there, but nothing major enough to ruin the experience. Also, I didn’t expect that kind of ending, it completely caught me off guard and left me thinking about it for a while. I’d definitely recommend playing it with a friend, that’s when the game really shines. 9 out of 10, one of the best co-op open world shooters I’ve ever played.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you are someone who liked far cry 3, and was wondering if this game is going to hit the spot. \n\nA lot of the things that 3 has missing - this game has polished. I love the fact that you dont really need to do any quests and can just get yourself a sniper rifle and hunt all day and sell that skins for money, some weapons are missing if you dont advance in the story line but its not something really worth mentioning. \n\nIn comparison to far cry 3, this title is weird in a sense that some weapons that were free and considered the worst in 3 are here, in 5 locked away behind a wall of progression. For example the ak47 is locked - and is unlocked only after 55% of story line and is considered a very good weapon, but in the far cry 3 title it was worst...\nIn real life in comparison to other guns, the ak47 is superior to most if not all weapon in assault rifle arsenal that 5 has to offer, and 3..\n\nThe animations are not better or worse but different. \nFor example the legs are visible from first person perspective in far cry 5, the animations and weapon animations are realistic, and smooth however the weapon model and weapon shooting have a better punch and sound in far cry 3, very action oriented - the 5th title however went with realistic approach and the weapons have better sound objectively..\n\nMost of the weapons in far cry 3 were not completely able to be customized. for example ak47. colt 1911 or SVD and many other weapons we locked from attaching a supressor for example, that was because game devs wanted you to unlock other weapons and force progress - in 5 this is not really needed and you can put multiple attachemnts to a starting pistol like colt 1911 which is something far cry 3 had missing.\n\nThis title - compared to far cry 3 does not have knife takedowns - you are breaking necks, punching, and hitting.\nCompared to far cry 3 where you have three knives to choose from and stab, slice and cut the enemies.\n\nHunting is actually better and more realistic in far cry 3. \nIts because when you kill animals in far cry 3, to take the skins from the animal you actually activate animation that the protagonist does to skin the animal and that the skin pelt. In far cry 5 there is no animation, you just approach the downed animal, press \"e\" and the skin appears in you loot. Kinda lame and straight up downgrade from far cry 3, a game made in 2012..\n\nObviously im nitpicking here, but far cry 5 has a better approach to hitting animals with bullets. In far cry 3 if you shoot an animal with a gun and dont kill them, they run away, but in far cry 5 the animals jump in terror, start to run, but after 200 meters due to their injuries they die, that part suprised me and the attention to detail was amazing. Very good detail.\n\nThe weapon models are acurate in both titles but of course the far cry 5 wins here because engine was upgraded in the mean time. They look better, and sound more realistic. I just prefer 3 because nostalgia + action oriented \n\nThis game has \"silent protagonist\" - so dont hope for breathtaking dialouge like Jason Brody (Gianpaulo Venuta) had in far cry 3. Not sure why honestly. \n\nThe gameplay (gun play, fight, animations such as reloading, takedowns) = 7/10\nThe story (including npc quality of speech, story in general, and characters) = 7/10\nThe nature or environment, including wild life was amazing and diverse and I have to say it was 10/10\n\nGreat bonus is that this game has great replay value. I get that ubisoft gets a lot of hate but every far cry they made was amazing.\n\nAlso btw Hurk is here as a side quest companion and if you play the far cry 3 he still has that comedic relief, tho in far cry 3 he was slightly funnier - but here he can be your follower.\n\nI would recommend, and game is worth full price.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This was my first Far Cry game and let me tell you this is a very fun game with a really cool story! Shooting, a religious cult, fishing, plenty of side quests and achievements, and cool companions! Multiplayer is a huge plus! Played this on easy with a friend the first time and had to go back and replay on infamous. Still working on 100% for the game but it definitely is a game fun enough to want to!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played 46 hours, and Far Cry 5 is still one of the best in the series. Hope County looks beautiful, the story and villains are strong, and the gameplay is nonstop fun. Great gunplay, great companions, and tons to explore even after finishing the main missions.\n\nSimple verdict:\nFun world, amazing villains, smooth combat, and worth every hour.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Far Cry® 5 is an open-world first-person shooter developed by Ubisoft. Set in the fictional Hope County, Montana, it continues the series’ tradition of large, explorable environments, emergent gameplay, and chaotic combat systems. It replaces exotic settings with a rural American backdrop, giving the story a grounded yet volatile atmosphere.\n\nThe gameplay loop focuses on exploration, combat, and liberation of occupied zones. Players dismantle the control of a doomsday cult by destroying outposts, rescuing civilians, and completing story missions. The freedom of approach—stealth, gunfire, or vehicles—remains a defining strength of the series.\n\nThe gunplay is fluid and responsive. A wide selection of weapons, from rifles to makeshift tools, supports multiple playstyles. The AI is aggressive but predictable, creating consistent tension without overwhelming the player. Vehicles, aircraft, and companions further diversify combat strategies.\n\nHope County serves as both playground and battlefield. Forests, lakes, and farmland blend seamlessly into dynamic encounters with wildlife and enemies. The open world is visually rich and full of emergent events—ambushes, rescues, and random explosions define its unpredictable rhythm.\n\nThe narrative revolves around a charismatic antagonist, Joseph Seed, and his fanatical family. While the central story of rebellion and faith-driven extremism is uneven, the performances and cinematics maintain intensity. The player’s silent protagonist weakens emotional connection but keeps focus on world events.\n\nTechnically, the game runs smoothly on modern hardware. Lighting, textures, and environmental effects demonstrate strong engine optimization. Co-op integration allows the entire campaign to be played with a partner, adding variety to missions and encounters.\n\nOverall, Far Cry® 5 delivers a vast, dynamic sandbox of chaos and freedom. Its gameplay systems remain finely tuned, and its world design encourages constant improvisation. The narrative may not achieve its full potential, but the sheer variety of experiences—combat, exploration, and spectacle—make it one of the most polished and satisfying entries in the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorites of the Far Cry series. The connection to the fictional world and the real world is really great and very well thought about. Though maybe it could have been more polished at the edges but overall great game. Lots of fun exploding stuff.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good experience for the most part but it's weird difficulty (the classic game decision of enemies having more health and two-hitting you when increasing the difficulty setting) makes it less appealing than 3, 4 and Primal, actually, even FC6 didn't have that problem when I played it.\r\n\r\nBut despite the annoyances it has a good villain, setting and I can't hate a game with fishing in it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My ratings & opinions for FARCRY 5:\r\n\r\nStory - 8/10 (The Story was frickin awesome and unique, Maybe the finale might be something good, I feel like I struggled for nothing.)\r\nGameplay - 9/10 (Stealth was completely satisfying. )\r\nMusic / OST - 10/10 (One of the best soundtracks, I played numerous times because of the OSTs of this game.)\r\nCharacter Definition - 8/10 (Not every character had a good intro, but the way the took till end was great!)\r\nWeapons - 9/10 (Each n every weapon had a unique mechanism, for stealth its marvelous and dangerous)\r\nEnemies - 7/10 (The level design was too good and the playing Infamous mode, was damn hell.)\r\nGraphics - 9/10 (Loved the Environmental design and especially climbing mountains its a good design though, loved it)\r\nOVERALL - 9/10 (After FC3 i would suggest to play this good shit for once and then you'll know it.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my 3rd time playing the game. I feel its better than a number of the Far Cry series already on offer",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great Far Cry. It's better than Far Cry 4 which was also good and much, much better than Far Cry 6 which was one of the least interesting Far Cries I've played.\n\nThis game made a gamble with the decision of not having a main character, instead you the player are the main character, so the character you're playing doesn't have any lines, it never talks, you just listen to what the other characters say, you're there to help them and be part of their story instead of your character being the center of the story and despite loving the main characters of other Far Cries, I do think that this choice works well and makes the game insteresting in a new way.\n\nEdit: Like any Ubisoft game, this game is dependent on the ubisoft launcher, I'm tired of that launcher, I never remember the password and the launcher is becomming slower and more bugged, I wish ubisoft would just stop forcing that annoying launcher on their games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i fucking love this game so much it's had a special place in my heart since childhood...used to walk to my friend's house everyday after school to watch him play. super awesome and the scenes and story have made my jaw drop many times. on a scale of 1-10 i give it a 30",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really great mechanics and world exploring. Worth playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i shot down john seed and proceded to hunt him on foot, only to have a grizzly bear run by me completely focused on him and watch him being mauled to death by the grizzly. peak game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Coming from a die hard farcry 3 fan , this is the game that push similar experience towards anyone who wants a a fu*king crazy lunatic chasing and brainwashing cult what more can i want. Absolute must play of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a big leap in graphic from far cry 4. probably the last good far cry game and it ends here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really cool game, I played it a long time ago. It's almost like GTA. Maybe even better. And if you play online with a friend, it'll be even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You know we play Far Cry for the guns. Oh yea and the open world with the classic liberation progression system. Oh yea and the realistic yet tongue in cheek writing and performances. Oh yea and the explosive set pieces. Oh yea and the psychedelic trip sequences lacing linear gameplay throughout your playthrough.\n\nIt's kind of like this game is a fantastic delivery of a unique idea. I'd say my only critiques were that the religious overtones made for a lot of repetitive monologues from the villians. And there were too many shrines in Faith's region. Good luck with that if you don't use a guide.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely captivating! The open world is huge and full of life, and the story draws you in instanly. Huge thanks to the developers for this amazing experience, to the Steam team for their support, and to everyone involved. Highly recommended for all action-adventure fans!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has an amazing story and you don't have to play the story if you want a hunting game where you have to worry about other people shooting at you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 5 is one of those games that grabs you almost instantly. Hope County is absurdly beautiful — from the forests and mountain ridges to quiet rivers and wide-open fields — all contrasted by the unsettling presence of a fanatical cult that turns this peaceful countryside into a powder keg. That contrast gives the world an energy few open-world shooters really capture.\n\nGameplay-wise, it’s peak Far Cry chaos. You can sneak through outposts, blow everything up, send your animal companions to do the heavy lifting, or get distracted for an entire play session by something totally unplanned. In fact, some days I don’t even touch the story — I just roam around looting prepper stashes like some kind of Montana treasure goblin. And honestly? Those stashes are some of the best content in the game: clever puzzles, hidden bunkers, and fun rewards that make every detour worth it.\n\nGunplay is solid, the world is packed with activities, and the freedom to approach missions however you want keeps things fresh. The story is darker and more serious than the previous entries, with Joseph Seed and the whole Seed family leaving a strong impression you won’t easily forget. The ending is divisive, but it’s bold and memorable — the kind that makes you sit back and think.\n\nCo-op adds another layer of hilarious disaster, and the open world is consistently entertaining… even when the occasional Ubisoft-ism kicks in. Random interruptions can get repetitive, and AI allies (and enemies) sometimes act like they’re running on borrowed brain cells, but it rarely kills the fun.\n\nFar Cry 5 delivers exactly what you want from the series: a beautiful world, explosive freedom, a compelling villain, and a sandbox full of unpredictable mayhem.\n\nPersonal scores:\n\nGameplay: 8.5/10 (flexible, chaotic, and reliably fun)\nWorld & Atmosphere: 9/10 (gorgeous landscapes and immersive environments)\nStory & Characters: 8/10 (strong antagonists and a bold narrative direction)\nContent Variety: 8/10 (tons to do, especially prepper stashes)\nAI & Polish: 7/10 (fun but occasionally a little too goofy)\n\nOverall: 8.3/10 — A beautiful, chaotic open-world playground where exploring, liberating, and looting prepper stashes is just as fun as the main story itself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fluid and engaging. The combat, the graphics, the setting, the freedom it gives the player, everything feels right. On top of it all the characters, especially the antagonists are very compelling and add to the desire to play the game just to see how it all unfolds. I also really love the fishing minigame. It runs very well even on more modest hardware. I can't recommend it enough!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my fav game in farcry series,its not about story and characters, its all about the gameplay and stunning visuals and maahn i love love hope county",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very woke.... charachter is an AFAB enby in an enemies to lovers toxic yaoi fujoshi relationship with an agender amab activist xtian....... stay far away......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Far Cry game! Story and villain in 3 is a bit better but everything else is better here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not on par with the other games in the far cry franchise but still a fun game if you like the other far cry games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not too bad. I remember playing this at launch and being very impressed, it still holds up well 7 years later. I wish they had more outposts and guns.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game, everything is just done very nicely. Definitely don't buy it for $60 tho, wait for a sale off of isthereanydeal.com",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starts off as a banger and gradually tapers off; the ending is wholly unsatisfying. Overall, gunplay is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely top ten videogame villains of all time along with a beautiful world and music, while also having some really good psychedelic horror sequences, also even the sub villains actually had layers to them which is weird for a Ubisoft game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "out of all the far cry series i still come back to play this game and i beat this game so far 5 times on different  platforms i love the beautiful scenery the charters in the game it is extra fun if u are able to play with another person that is a bonus.  no matter haw many times i beat this game i will still come back to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i absolutely loved this game. one of ubisoft's best recent games. it has fantastic gameplay, fun open world, and a decent enough story to follow along. plus, it does a fantastic job of portraying middle america through a black mirror.\n\nwhat really made this a 10/10 game to me was the co-op, arcade custom levels, and fun dlc. if you think you'll like this game, get the complete package and enjoy the game to its fullest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kept this one on the shelf for way too long.\r\nFantastic game and actually comes close to the quality of Far Cry 3.\r\n\r\nGet it while it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd absolutely recommend this game, but given the age, I'd still say you should wait for a sale. That said, there is plenty to do in this Far Cry installment, and it has the most engaging story of the franchise. Performance is stable, even in co-op.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 5 left me with mixed feelings. On one hand, the open world of Hope County is beautifully crafted, with diverse landscapes and a solid variety of vehicles and weapons. The co-op mode adds a fun layer to the experience, and the premise of battling a doomsday cult led by Joseph Seed had strong narrative potential.\nOn the other hand, the mission structure started to feel repetitive after a while, and the forced progression system sometimes broke the sense of freedom I expect from an open-world game. Enemy AI was inconsistent, and occasional bugs disrupted the immersion.\nOverall, Far Cry 5 isn’t a bad game, but it’s not a masterpiece either. It offers moments of excitement and visual appeal, but it doesn’t fully deliver on its ambitious setup. If you’re into open-world shooters with a unique setting, it might be worth a try—just temper your expectations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Game #17 of my 2025 100% Marathon.)\nFC5 was my introduction to the franchise years ago, and after returning to get all the achievements, I'm surprised at how different it feels in comparison to the previous games. I did not realize how floaty the camera felt until returning after playing FC3 and 4, and similarly I didn't realize how much was missing from the experience by not having a voiced protagonist. Having said that, still a great game and an enjoyable 100% grind. Infamous difficulty is very tough, but once you adapt it becomes more manageable. The DLCs are certainly not on par with much of the content in the rest of the series, but I didn't hate them as much as others seem to. Dead Living Zombies is a fun arcadey campaign with a semi-frustrating points system if you want to get gold on every level, Lost on Mars is a bite-sized campaign with a neat location, cringey dialogue, and fun weapons, and Hours of Darkness is a gritty and immersive campaign set in Vietnam that doesn't offer anything groundbreaking but still manages to be engaging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Montana Simulator is nuts! One of the best Co-op experiences out there, and the storyline kicks ass! -Rating: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very beautiful, atmospheric, and exciting game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Totally worth it, best far cry ever, best music, good grafics, nice place and more..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall great game, buy it at discount and have some fun, After Far Cry 3 this one will be my favorite. Don't know why but after Nov 2025 update game start crashing so be aware",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a hell of a game. With villains you absolutely love to hate, a fishing minigame that could be its own game, flying in planes and dive bombing compounds, the slick gunplay and having a on command attack bear - it's pure chaotic fun. \nRip ubisoft.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game on a sale that included Far Cry New Dawn, that cost me less than the standard version of the game. I've been playing this game for a while now, and I have to say that it's entertaining. Here are the pros and cons that I have found so far.\r\nPros:\r\nEntertaining game play.\r\nGood story and a good villain.\r\nThe map is bigger than the one in Far Cry 4 and more diverse.\r\nMinimal HUD and no mini map on screen, reminds me of Far Cry 2\r\nVisually still looks good (even if you run it in a system with a ryzen 3 2200G, RX580 8 GB and 16 GB of RAM at 720p).\r\nCons\r\nNot too different from the last couple of Far Cry games.\r\nGame play can be a bit repetitive.\r\nThe capture sequences disrupt the flow of the story.\r\nMany Weapons feel under powered and some scopes barely offer any magnification.\r\nSome enemies are bullet sponges.\r\n\r\nI would recommend it if you like or liked Far Cry 3 & 4 or if you find it on sale like I did, so you could give it a try with out any regrets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Of all the Far Cry games I've played, this one is my favourite. The story is great, the mechanics are sweet, the graphics are stunning, and there is so much this game has to offer; even without the DLCs. The graphics are also the best out of any Far Cry game (including 6).\n\nOverall, this one is the best, and is highly recommended to any gamer who is a fan of liberation games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great story. The best Far Cry in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game but you can feel the wokeness setting in for Ubisoft around this time. It started to bleed out into their games in smaller but noticeable ways back then.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, story's good, but slightly limited actual gameplay compared to Farcry 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very different from 4 and 3, does some thing better some things worse. but all in all its still fun and enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game play it all the time on my ps5 just had to refund on my old pc cuz it was too weak to run it now i got new pc probably going to buy it soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had this as a negative review but after playing some more, honestly, the game is okay. It didn't meet my expectations at first but once I got used to it, this is actually a pretty damn good game. \nI won't forgive them for companions not being able to get in your vehicle though, that is the most immersion breaking oversight there is. And enemy spawnrates could have been reduced quite a bit too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game, probably my favorite in the series. I think it was some of the most fun in a ubi title ive have playing with friends in a while as you know ubi's gone to sht. Anyways, great story, open world and kind of do it as you please. Very glad there is new game + but it really sucks theres only 1 save file just like 4.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of them games wgich I keep coming back for easy immersion. Big fan of all installments, Hope County is somewhat standing out though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1000/10 love this game gave me the same vibes as farcry3 but fuck the dev who made admiral fish, fuck you man why it is so hard to catch him I spend fucking 2 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far cry. Like Assasin's Creed, but with guns. And boats. And planes. Ubisoft and Nintendo are basically the only companies that get away with just re-releasing the same game over and over again.\r\n\r\nBut hey, it's good, casual fun, as long as your suspension of disbelief is strong.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5.5/10 \nGood \"fast-food game\" it's neither bad or great, just \"meh\" with a shitton of additives added to it while still lacking substance.\nGameplay is a clear downgrade from the previous entries, going from semi-grounded to full arcade. Not to mention the spam of \"things happening\" thrown at you all the time as if the game is scared of you being bored after 1 minute of nothing happening.\n\nStory is...there, with many many flaws that had to be reckoned in the sequel.  It's supposed to be this really serious situation with characters that leave a mark yet that aspect misses the mark completely...\n\nThe world is gorgeous, feels like a red white and blue American summer.\nAlthough the regions look samey –except for John's–, with the same 4-5 enemy types copy pasted everywhere\n\nThe weapons are an insane downgrade from other games, went from 70+ weapons to ≥15 without reskins, for a game set in America this is quite disappointing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a far cry game worth being placed in the top 3. the story is fun and unique, the shooting mechanics are fun and crisp and the characters are unforgettable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Farcry 5 is a pretty fun game with an interesting story and great companions like Grace and Cheeseburger. Joseph Seed is a great villain though his rambling can sometimes be lengthy and his plot armor seems invincible lol. sadly not much to do after completing the game except capture territory and destroy everyone, though the base story offers more than enough hours of fun.\n\n8.1/10 it's time to cull the herd.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is by far one of my favorite Far Cry games. This is my Far Cry 3. Truthfully, I understand what a lot of people mean when Far Cry 3 is their favorite game and every game after it is slop but in my experience, after playing both 3 and 4, number 5 is still king to me. \n\nI think its an assortment of things: The setting, the music, the characters, the side missions. It's like a nice warm and hearty soup on a cold winter day. I love me a good cult story. \n\nWhen I first played this game, it was back during launch in 2016 on my ps4. My buddy and I had a blast in this game but even playing it solo was a grand ol time. Finding all the easter eggs the first go around was so memorable. Fighting along side a dog or a freaking cougar, what more can you ask for!? \n\nThe PC version does well. I have only had it crash on me once and I am running at the topest of top with the specs. I've seen some comments saying that the PC port is unplayable but I haven't experienced that. \n\nTry it out! Its not as garbage as people make it out to be. There is a lot of nuance with a lot the cult leaders that make the game super interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best far cry games ever made, along with far cry 3. The story is very immersive  and great along with the  map which is big,  game runs very smoothly, the graphics are great even in 2025  since the game released in 2018 along with many other great games made in that year. Would always recommend to any returning players who already played the game or anyone that didn't play this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i want to love this game, i really do. however, the humor in such a serious game is not it. the fantasy stuff Ubisoft loves to pull, the drugs and everything is too much, and too used up. just because the enemy is a junkie emitting green gas they can tolerate 2 headshots from a shotgun point blank? damn. didnt know drugs did that to you... sarcasm aside, if this game would be more grounded on realism, and the world its trying to portray in its state and condition, the context of a cult take over of a county. it could be wonderful. what else could be wonderful? if sniper scopes actually did something. sure, they do... not even the bare minimum. this is something in every farcry game, where amplification scopes dont actually do shit or do it weakly just barely enough to be considered \"good enough\" farcry5 says \"lets lower the bar here.\" and REALLY tones back the zooms. effectively making snipers obsolete since you cant hit anything past 200 meters using a fucking .308 Remignton 700... already paired with the horrible zoom on scopes (yes, included the select 2 amplification ones) you struggle to even line up a shot because the crosshairs are bigger than the fucking target. and the bullets fly so fucking slow too, and dont get me started on the bullet drop... its cool to see they moved on from hit-scan to projectile trajectories, but holy fucking shit i should not be able to see a 50 bmg projectile fly from my barrel to the target unless im like a mile away and looking through the scope. this game? bro. bro... the animations are cool though! by far my favorite in the franchise, i love the animations of the guns and the gunplay is fun along with the cooked but enjoyable story. (i still hate how slow the bullets are, good luck shooting planes down. which PS, randomly spawn and hunt you for the sake of it, not even the lore.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE.BEST.FAR.CRY.PERIOD !\n\nThe fact that this is in the US make is so much better, bye bye the tropical island or tropical mountains or tropical country, say hello to the deep christian US of A ! \n\nI even found myself slowing down at the end, feeling that the game would end soon, just to enjoy it a bit more. That's the proof of a masterpiece for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "overall been having fun with this but need to note its a terrible console port\nshows badly on fishing and airplane flight\n\nalso the drawn-out un-skippable cut scenes are super annoying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played 3rd and 4th and didnt like em. This one i vibe with. Much better combat, beautiful world. Besides stupid flying stuff which in all games is always the Vice City RC Hellicopter nightmare all over again, the game really rocks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Far Cry game hands down. A good combination of good gameplay, fairly good story, and tons of quality of life changes the Far Cry series has been missing over the years. \n\n-Radio/Bell towers have been completely removed which is great if you thought those were repetitive and annoying (me)\n-they got rid of pretty much all animations for menial tasks that you do over and over again\n-guns have had their attachment limits removed and with the exception of pistols (they're kinda meh in this game tbh, but I guess they're kinda supposed to be?) all guns have been improved to fill a specific niche (Also shotguns have actual range and are nolonger doodoo)\n-Tons of added vehicles which are fun to use and have guns\n-The level up system has been removed in exchange for basically an achievement system, which forces you to use different weapons and tools to get perk points\n-and last but not least the super repetitive side content of previous games has been exchanged for more individually unique missions. No one two missions were the same and while I didn't 100% the game, I found myself seeking out and completing side content of my own accord rather than skipping it like in previous far cry games\n\nI dug this game. It's got its fair share of issues, but I think from a gameplay perspective this one felt great. Big fan. From a story perspective its pretty good but (spoiler) [spoiler]They captured you easily like 7 times, clearly wanted you dead, and didn't just use these means to kill you? God Tier plot armor.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far cry 5 is an exprience . the story is top notch the chracters are good and the villans are calm but terryfying and the soundtrack man the soundtrack so smoothing i loved it.the only con i found when i played the game is that the gunplay became more arcady and less weight to the guns which the arcady gameplay can be fun to me but i missed the weight gunplay like fc3 and 4 . and the Ai is also Dumb fc3 4 AI was not that dumb. anyways the optimization is also great never faced any bugs or crashes.overall a masterpiece game with a great soundtrack. and the dlcs are also fun i really liked mars and zombie dlc. for me its a 9/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Engaging campaign and fun (Very buggy) co-op mode. You can spend 20 hours just fly fishing\r\n\r\nGood replay value 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very few things I dislike about the games. The storyline is great, the music-chef's kiss, and the absolute mind fuck that is the cult is just top tier. Absolutely recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of my friends recommended that I should try to play this game and it turns out it was really fun, and the story was so cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good fun - US deep south environment and cult backdrop also works well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of singleplayer shooters like I am, then this game is a must-play. The shooting feels good and the story is pretty good too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.. Loads of stuff to do..Nice story progression with great gameplay..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the FarCry the video-essayists talk about.\n\nFor optimal experience, go into Interface settings and turn OFF:\nReticle\nDetection Meter\nExplosive Warning (Highly optional but funny)\nCompass\nALL Icons\nGPS feedback\n\nYou're welcome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "36 hours in, and I’ve done everything except what the main story told me to do. I came for the plot, but stayed for the chaos.\r\n\r\nYou play as the new deputy dropped into rural Montana, where a doomsday cult has taken over. Sounds serious, right? Yeah… until you realize you can recruit a bear named Cheeseburger to maul bad guys while you zipline into an explosion holding a shovel.\r\n\r\nThe world is gorgeous—sunsets, forests, rivers—and every 5 minutes, something insane happens. A plane crashes near you. A moose attacks. A random cultist runs you over in a truck blasting gospel music. It’s like living in a Michael Bay movie directed by a redneck with dynamite.\r\n\r\nGuns feel great, stealth is solid (for the first 10 seconds), and the freedom is peak Far Cry. You can fish, hunt, liberate outposts, or just blow up everything that moves. The story hits surprisingly deep too—equal parts dark, funny, and weirdly emotional.\r\n\r\n36 hours later, I’ve saved Montana, tamed a bear, and lost count of how many helicopters I “accidentally” crashed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i play for 13 hour, but if you see is it will be lot more, i like the game but i think it need a lot more blood in the game, but it is good\r\n\r\nIch spiele seit 13 Stunden, aber wenn du siehst, wie es ist, werden es viel mehr sein. Mir gefällt das Spiel, aber ich finde, es bräuchte viel mehr Blut. Trotzdem ist es gut.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game. Most fun I have had in far cry, honestly, although I need to go back and play far cry 3 again just to see, but I think this is my favorite one. It's ridiculous enough, and plenty of side stuff to do. Graphics are good. Definitely worth playing if you are new to the series as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Far Cry 5 Review[/h1]\n\n[hr]\n[h1]Overview[/h1]\nMy favorite Far Cry. It clicked fast, felt fresher than the older entries, and just nails the “big sandbox, do anything” vibe. I have finished it twice fully, three if you count the new game plus achievement run, and it still holds up. Great world, fun combat, solid story. Easy thumbs up.\n\n[hr]\n[h1]Story Overview[/h1]\nYou play a rookie deputy sent to arrest cult leader Joseph Seed in Hope County, Montana. The arrest goes sideways and the county fractures under the control of Joseph and his siblings. You work region by region to free communities, build resistance, and decide how to deal with the Seeds. It is a clean setup that fits Far Cry perfectly.\n\n[hr]\n[h1]World and Atmosphere[/h1]\nHope County is gorgeous. Forests, rivers, farms, mountain ridges, sunrise flights over foggy valleys, it is all just beautiful to roam. Driving, flying, hunting, and fishing are actually relaxing between chaos bursts. Ubisoft absolutely nailed the look and the feel of Montana here. Massive thumbs up for world design and visuals.\n\n[hr]\n[h1]Combat and Tools[/h1]\nNothing crazy, just a big toolbox that feels great. Snipers, ARs, pistols, bows, RPGs, C4, you know the drill. Helicopters and planes with mounted weapons are a blast. When you feel like going loud, it delivers. When you want to stealth an outpost, it also works.\n\n[hr]\n[h1]Guns for Hire and Fangs for Hire[/h1]\nBring companions like Boomer, Cheeseburger, Peaches, Grace, Nick, and more. They change the feel of fights and make patrols less lonely. Simple to use and surprisingly effective.\n\n[hr]\n[h1]Co op[/h1]\nCo op makes everything better. You can run the full campaign and side content with a friend. Heads up: in story missions only the host gets main mission progress, but both players keep loot, cash, and perks. Outposts and sandbox chaos are where co op shines.\n\n[hr]\n[h1]Progression and Side Activities[/h1]\nPerk points come from challenges and magazines, letting you build what you want. Treasure Hunts are quick and fun. Hunting and fishing are solid side loops. The balance feels right. Exploration actually rewards you instead of drowning you in busywork.\n\n[hr]\n[h1]Arcade[/h1]\nI did not get into Arcade. It felt out of place for me in a primarily single player game. Servers are not very active now, so if you want the Arcade achievements you will likely need to organize sessions on Discord or the Steam community.\n\n[hr]\n[h1]DLC[/h1]\nThree themed packs. Hours of Darkness (Vietnam), Lost on Mars, and Dead Living Zombies. They are fun side trips. Zombies has a very grindy achievement that asks you to kill a huge number of zombies, which felt unnecessary and tedious.\n\n[hr]\n[h1]Achievements and Completion[/h1]\nGood list. Respectful of your time. New game plus exists for the NG+ related achievement. Most tasks line up with normal play, plus some co op and Arcade bits you may need to plan for.\n\n[hr]\n[h1]What Works[/h1]\n[list]\n[*] Stunning open world that is a joy to roam\n[*] Big, satisfying weapon and vehicle sandbox\n[*] Co op elevates outposts and patrol nights\n[*] Companions add variety and personality\n[*] Story setup and characters fit the setting well\n[/list]\n\n[hr]\n[h1]What Falls Short[/h1]\n[list]\n[*] AI is pretty dumb, especially in stealth\n[*] The formula can get repetitive after many outposts\n[*] Arcade feels tacked on and is quiet now\n[*] A few DLC achievements are grindy\n[/list]\n\n[hr]\n[h1]Verdict[/h1]\nStrong recommend. If someone asks where to start with Far Cry, I point to 3 or this. Far Cry 5 has the best world in the series, a great toolbox, and co op that makes the chaos even better. If you can live with simple AI and some repetition, this is the one to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still great in 2025, Best far cry out of 6. Fc3 is outdated for today",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I didn’t expect Far Cry 5 to grab me the way it did. I thought it would be just another open-world shooter, but it turned out to be so much more. The atmosphere of rural Montana is incredible — driving down the roads with the music playing feels unbelievably real.\n\nThe story surprised me too. I usually skip cutscenes, but here the characters are so memorable that I wanted to watch every single one. The Seed family, especially, is packed with personality — they’re creepy, charismatic, and genuinely interesting.\n\nGameplay-wise, everything just feels right. The weapons have a great punch to them, the vehicles handle well, and the companions are pure chaos in the best way possible. Sometimes they caused more mayhem than I did, and that only made the game funnier.\n\nThe world is full of things to do, but it never feels overwhelming. I kept telling myself “just one more mission,” and suddenly an hour had passed.\n\nFar Cry 5 ended up being a really pleasant surprise — the kind of game that reminds you why you love gaming in the first place.\n\nEasily a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game brought my dead father back to life after his grusome battle in afghanistin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fictional representation of the MAGA cult in action",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Far Cry 5 — An Intense and Unforgettable Journey Through Hope County[/h1]\n\nFar Cry 5 is, for me, the most meaningful and impactful entry in the franchise. It’s not just an open-world game — it feels alive, unpredictable, and emotionally heavy in the best way. Hope County stays with you long after you close the game.\n\nOne thing that truly elevates the experience is Joseph Seed himself. His presence, his sermons, and his chilling conviction leave a mark on the entire story. As he says:\n[i]“I was once blind… but now I see.”[/i]\nLines like this aren’t just quotes — they shape the entire tone of the journey.\n\n[h2]Narrative & Story[/h2]\nThe narrative unfolds slowly and powerfully. Joseph Seed and the Heralds are not simple villains — they feel disturbingly real. Their philosophy, manipulation, and faith-driven extremism create constant tension.\n\nJoseph’s sermons echo through Hope County, especially lines like:\n[i]“You all will be cleansed. You will be purified.”[/i]\nThese moments give the story a sense of dread, inevitability, and emotional weight.\n\nEach region reflects the madness of its Herald, making the storytelling rich and immersive.\n\n[h2]Gameplay (Fluid and Well-Crafted)[/h2]\nThis is where Far Cry 5 truly shines. The gameplay feels [b]fluid, responsive, and deeply satisfying[/b]:\n\n◈ Impactful and polished gunplay\n◈ Weapons that feel varied and meaningful\n◈ Smooth movement and solid controls\n◈ Complete freedom in mission approach\n◈ Both stealth and full chaos feel rewarding\n◈ Guns for Hire add personality and unpredictability\n\nIt’s the kind of game where one planned mission turns into hours of unexpected exploration.\n\n[h2]Map & World Design[/h2]\nHope County is one of the most beautiful open worlds I’ve ever explored:\n\n◈ Stunning mountains and landscapes\n◈ Natural forests, lakes, and rivers\n◈ Towns full of charm and personality\n◈ Hidden locations with their own micro-stories\n\nNothing feels artificial — the world feels handcrafted, alive, and full of meaning.\n\n[h2]Graphics[/h2]\nFar Cry 5 still looks excellent today.\nThe lighting, colors, and natural scenery are atmospheric and immersive.\nFrom warm sunsets to storms rolling in, the environment constantly delivers striking visuals.\n\nCharacter models, animations, and effects remain polished and impressive.\n\n[h2]Soundtrack & Audio[/h2]\nThe soundtrack is unforgettable.\nThe dark, hymn-like songs and eerie choir themes perfectly match the cult’s presence.\n\nWhen Joseph speaks during key moments, especially lines like:\n[i]“This world is on fire. You are the spark.”[/i]\ncombined with the music, the atmosphere becomes unforgettable.\n\nWildlife, wind, engines, distant echoes — everything sounds alive.\n\n[h2]Recommendation[/h2]\nFar Cry 5 is perfect for players who enjoy:\n\n◈ Open worlds that feel alive\n◈ Fluid and flexible gameplay\n◈ Emotional storytelling\n◈ Memorable villains and strong characters\n◈ Freedom to explore at their own pace\n\nWhether you come for the story, action, or exploration, the game delivers a complete and powerful experience.\n\n[h2]Final Verdict[/h2]\n[b]Far Cry 5 is, without question, my favorite entry in the entire franchise.[/b]\nIt blends atmosphere, storytelling, fluid gameplay, and unforgettable characters — especially Joseph Seed, whose words linger long after the credits:\n\n[i]“We will rise again. Only together.”[/i]\n\n[b]Score: 10/10 — A powerful and unforgettable journey.[/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Joined a cult, blew up a tractor, got attacked by a turkey. 10/10 would liberate Montana again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its aight, but what a horrible ending. Sorry but everything i worked for, every friend i made, everything is dead and destroyed?  So i played the whole thi ng for nothing?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "blah blah blah writing this so steam will let me thumbs up since i can't just leave a rating without meaningless words blah blah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried sneaking into a base.\nAccidentally honked the truck horn.\nSomeone yelled “WE’RE UNDER ATTACK.”\n5 minutes later everything’s on fire, a plane is shooting at me, and a turkey killed my teammate.\nPerfect Far Cry experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game play with friends and its 100 times better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but rn its stoped closeing the gmae so it wont work tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun shooter. Actually, probably top shooter for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gunplay is pretty fun decent open world fps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this one takes place State side.  Going to get a lot of hate but, this is my favorite FAR CRY game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game the arcade mode is as good as the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This version of \"Far Cry 5\" is way different then from the first version, kinda like \"Just Cause 4\" on steroids. Drives you nuts but really makes you like to test this with a friend or two and see how far we can get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun with friends, i wish the distance warning on coop was toggleable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This my third Far cry game, and I like the story, the mechanism, etc.  Best far cry, Imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game even in the big 2025 100% recommend to new players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes i reccomend this game just get it on sale 60 bucks is just a wild price.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Ubisoft are scam artists and frauds. I purchased Far Cry 5 in 2018, preordered the gold edition and everything. I am now completely and utterly unable to play this game AT ALL. Ubisoft decided to permanently disable and then delete my Ubisoft account (completely without my knowledge OR permission) that was linked to this game, and my other Ubisoft PC games, and they refuse to help out at all. I have a $90 game with 87 hours of gameplay, that Ubisoft won't even let me play. I don't know how this is legal, but I hope their company goes under.\r\n\r\nF*** Ubisoft, don't give them your money anymore. Apparently they have the power to delete your account whenever they feel like it and run off with your money.",
      "voted_up": false,
      "votes_helpful": 114
    },
    {
      "review": "Game is fine. I don't like the ubisoft client and valve should have balls big enough to tell the vendors no 3rd party clients.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Honestly, it's myself to blame for thinking this series has done something new to innovate its games. It's Far Cry 3 all over again, but 5x more bugs and cringy gameplay. It's the last time I bought any Ubisoft game ever again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is an absolute disaster.\r\nIt feels like it was made by someone who’s never played a game before. The “story” — if you can even call it that — could’ve been written by a toddler. Nothing makes sense, nothing’s fun, and the ending is so bad it almost feels like a joke. Don’t waste your money on this garbage — unless you’re rich and enjoy throwing cash straight into the trash. The only fun thing are some side Story with your friends",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The absolutely horrid ubisoft launcher makes this game unplayable, Steam should really ban 3rd party game launchers. This is a scam. Shame on you Ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft connect is the worst third party game launcher ever created, it ruins the already poor reputation Ubisoft has.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "classic ubislop title. generic main story missions and a sh*t ton of copy-pasted fetch-quest side content. unlike the previous two entries in the series however, far cry 5 additionally lacks anything remotely resembling an interesting storyline, which is what made 3 and 4 enjoyable (or rather what made suffering through boring stretched-out content bearable). \n\nthe plot is totally unrealistic, and the playable protagonist is a completely blank slate with no defined personality, gender, backstory, or even any voicelines, all of which contributes to a total disconnect between me the player and the game.\n\nthe open world is very pretty, detailed, and more sandbox-y than ever before, but on its own not enough to keep me interested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completed the game but worse than FC4 imo. Just like FC4, things just get really boring really fast. Took all my will power to finish this. \n\n- Couldn't care about the cult story\n- Characters were boring\n- Gunplay was boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun enough game but holy fuck ubisoft launcher sucks so bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "excellent fun, when you dont encounter a hard lock bug that requires you to download a mod in order to edit your save file. After killing the first main boss(spoilers ahead) John Seed the game just. forgets that i killed him and no finagling seemed to get him to either respawn or retrigger his death. Other Bosses die just fine- but i could not progress the story with John stuck in an eternal limbo. Insanely embarssing behavior for a 8+ year old game from a AAA game studio",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I found it to be too difficult with just relentless attacks with very little chance to breathe. Combined with the fact that like 4 shots will kill you I found myself more frustrated and angry while playing than having a good time. It eventually became a slog that I just tried to push through to finish. The DLC made made me abandon the game entirely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game not that good pretty buggy got once parachute and fall into the void, AI is dumb and soldier coming to car take too much time and movement like robot and takedown are the worst...so far best game series for me is farcry3 and farcry4 and i havent try farcry6 because review is bad......kinda regret it for buying the unpolish game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is great, Ubisoft requiring account linking cost me my copy of the game.  Steam is unable to help, all on Ubisoft's side.  Removed from library and refuse to purchase anything from Ubisoft again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It takes way too long from dying to getting back into the fight to make this enjoyable. I've watched more in game vide and game intro that I've played the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same issue repeats. Ubisoft what are you doing. Game is very good. Works properly. But the thing is loading times is too much. 2-3 minutes every time you start the game and also if you die again 2 minutes of load times. It really ruined my experience of enjoying this game. Honestly speaking avoid all the old and future Ubisoft games on PC. Better get it on console.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gunplay is very good, the look of the game is very good, vehicles feel pretty poor to drive and fly, im pretty sure there are only about 6 models for enemies, scopes dont zoom, spawn radius for enemies is very short, you see them spawn in about 100m away, radio only has 2 channels which are both bad. when purchasing the DLC as a new player, why would i use any other gun than the LMG?? AI will jump into random vehicles and start crashing into literally everything, or steal your vehicle, like a helicopter and just hover above you, friendly AI will stand in front of your car and not move, so you run them over and the others shoot you. various other bugs, why were they never fixed even after 7 years? Great game at a surface level but tons of issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so weak. The gameplay itself is fun but Ubisoft seems to go out of its way to try and prevent you from having fun. The boss-fights (with the exception of John Seed) are so boring, the game constantly interrupts you with cheap cut-scenes where you are drugged or captured to prevent your seemingly God like character from being able to fight back to force tension. Most of the missions are the same, just one shooting gallery after the next. The combat is completely neutered, taking away the over the top brutality of Far Cry 3 and 4 and just replacing it with weak take downs and piss easy combat as your guns cut through every enemy like butter.\r\n\r\n\r\nNo matter how many people you kill, no matter how many bodies you stack, they always talk about you as a rookie or deputy. In Far Cry 3 the enemies grow scared of you as you go from California boy to animal mother, in this game no matter what you do the game treats you as weak. \r\n\r\nWithout spoiling the ending, it was absolutely terrible and ridiculously out of tone with the rest of the game. Ubisoft, do better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I simply cannot get past \"The Cleansing\" no matter what I do or how many times I play it. So far, I've played it 29 times on easy. There is no way around this and it's a complete roadblock for me. It's a shame, too, because this is the first time I've played an Far Cry games and I'd been enjoy it very much. I just hate these often nearly-impossible missions that take a game from fun to frustration to anger to walking away. I won't be trying any more Far Cry games unless I know this kind of situation doesn't exist. Games should be fun, not frustrating, and a cheat to get past this thorn in a rose of a game would be welcome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can not recommend for Linux users. Purchased to play coop with friends and jumped through many hoops to attempt to get coop to work to no avail. Asked for a refund early on but it appears to have been unanswered.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game with all my heart, my favorite far cry game out of them all. It hurts me to recommend you dont play it but whenever i boot up the game im able to start a new game and by the time I can play MP, if I were to ever close the game and then get back on later to play with my buddy I lose all my progress on startup and have to play the turtiorial again to reaccess mp (use to take me an hr, did it in just 30 min today). Im not even trying to play from my save file, just trying to join up on him which requires me to have still compleated the tutorial however I love this game and would love to play it again but I know that I wont be able to when I wanna try because if I do it HAS to be in 1 sitting and I dont have that kind of time nor do I want to speed run the game. I want to be able to enjoy hope county and see cheeseburger and hear Joseph preach his word while I try to take him and his siblings out. \r\n\r\nFather, have I sinned too much to be able to keep a save file for you? if so please cut that into my skin and carve it off of me. I will say yes, I will let John teach me the right way.\r\n\r\nAlso because of this game I am actually brainwashed with only you because now whenever I hear it all I can think of is Jacob. Very striking whenever I play Arkham Knight and see joker because all I think is Jacob.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is alright just to shit the bed in the last hour. The ending makes those 15 hours a meaningless waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Complete garbage storyline with clunky shooting mechanics (in an FPS game). It's predecessor Far Cry 3 was better in every aspect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible companion ai and cracked enemy ai + everything else just sucks especially the guns 2/10(just because the graphics are nice nothing else)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go buy FC3 or 4 this is post the downfall of Ubisoft quality. The game has Bad writing,  and worse shooting than 3 or 4. This game feels bad to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to like a game that takes a stab at homegrown American terrorism and lets me shoot Christofascists, but the story and execution on this one is just...ugh, it's really bad.\r\n\r\nIn terms of gameplay, Far Cry 5 is alright. The game removes the familiar Far Cry staple of tower climbs and instead allows you to explore the map at your leisure, which is better in some ways and worse in others. Side missions are abundant, typical and forgettable, and serve only to give you skill points and money for unlocking guns and cosmetics. The actual meat of the game still feels like Far Cry - scoping out a location, making a plan of action, then using stealth or firepower to storm the place - though I will say many of the gun options feel kind of unbalanced and leave a lot to be desired.\r\n\r\nBut the real reason I don't recommend the game is its story. For a series that prides itself on writing complex and interesting villains, I was sorely disappointed in how amateur the writing for the Seed Family turned out to be. A lot of the plot elements like the use of classical conditioning and hallucinatory drugs simply don't add up, considering side characters literally come up with methods of deprogramming and counteracting these things, and it feels like the game is constantly using this concept to jerk control away from the player, making it feel like your actions and choices really have no meaning. It's possible that's the point of the game's story, but if that's the case, it's an extremely unrewarding and unenjoyable way to pull it off, and does not make the artistic point the game wants you to think it's making.\r\n\r\nNot to mention, major plot points occur in between completing side quests, where your characters are abruptly captured, knocked out, forced to listen to a villain monologue, then pushed into an (often hallucinatory) escape sequence that doesn't really make sense in context. In the case of Jacob, the escape sequence occurred three different times and was completely identical each time, save for the \"plot twist\" on the third one. I was not a fan of being constantly pulled away from what I was doing for another round of amateur philosophy and psychology from a poorly-written villain who at many different points could easily have just been shot by the protagonist if not for \"plot armor\".\r\n\r\nAnd then there's the finale. There are three possible endings, but all of them amount to roughly the same exact outcome, and they all feel extremely hollow. I won't spoil it here, but I really want to, as a warning against how awful the game's writing really is. It genuinely felt as empty and vapid as Bioshock Infinite's story did to me, and that's saying something, considering how much I hated that game's story.\r\n\r\nAll in all, massive disappointment of a game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Remove Denuvo and the third party account requirement. \nEdit: Launcher and online requirements too.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a mediocre game. I've greatly enjoyed Far Cry 3 and 4 but this one doesn't feel like it has a soul. If you like casual fun and don't care about the story then you will have fun with it. No major technical issues. But for me it is difficult to stay invested mentally to this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game in co-op from beginning to end. I recommend against this game unless you have someone to play through with.\n\nI like that there is a lot freedom in causing havoc, with aircraft, cars, and so on. The experience in multiplayer was seamless and we were able to do all the missions and explore the world together. However, only the host gets credit for campaign progress, meaning that you as the \"joiner\" will never unlock a 4th weapon slot, or certain other perks, because those are restricted by making progress by taking down lieutenants (mini-bosses).\n\nThe story is ass. I think you get kidnapped about ten times, 3 for each mini-boss, and once at the end. I might be missing some instances. Frankly, I have no idea what the cult believes in, other than an upcoming apocalypse; the cult has no stated belief system, and you aren't given any reason or hint as to why they've gotten so much traction in the region.\n\nThere are many very strange cosmetic mistakes. A \"perforated\" barrel shroud that is actually solidly filled in, or the primers on rounds all being dented before being fired. All the casings used in practice seem to be brass, but the brokers and bases are full of steel-casings. All bullets travel with a very low velocity, which is not a cosmetic mistake, but makes them feel less \"authentic\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Best game of the series.  Thumbs down for ubisoft connect.  If I have to waste so much as one zeptosecond messing with some third party launcher, then forget it.  I have better things to do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even though 5 seems like a continuation of 1, 2, 3, and 4, with Far Cry 5 it is, ironically... a far cry. The fifth iteration in this series may be considered as a fifth copy of the same game, although to be completely fair, I don't have much experience with all the previous games. \r\nWhile the game looks awesome, it's not enough to make up for the laughably cliché story. Overflow of content tries to compensate the poor characters and story line, but gets old pretty quickly.\r\nThere is a variety of weapons to use but the upgrades are almost identical to every weapon. It's plays easily even on hard difficulty, has a few bugs here and there, but nothing game-breaking. The game treats you like a lost puppy, guiding you through a forest to a comfortable place but putting on a rough and crude facade with an over-the-top cultist ideology.\r\nA nice touch is the multi-player feature, helping you get through the painful story with the disadvantage of bringing more people to this vast land of missions, stories, people... which at the same time feels completely empty.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you can only play 2 in open world and the tutorial takes over 2 hours to complete so i couldnt refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have never played a game where you can do so many things and none of them (including the ending) are satisfying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Fucking hate Ubisoft Around 2 months ago my fucking Ubisoft account got hacked and i lost access to a lot of games around 15 i ofcourse immediately appealed it gave so much information all the way to the fucking credit card the games were bought with and i just got a fucking bot response saying not enough info after i told them i have steam ,epic,xbox,nintendo connected to my ubisoft account and i have full access to the and everything they again told me not enough info and again a bot response so i cursed them a lot and they send me the same fucking bot email but in the end they said if i don't stop cursing they will take away my fucking right to send them emails about my account and i just gave up cursed them one more time and told them im going pirate fucking bay and they send the exact same email word for word not even ai or smtn just copy paste by a very stupid bot and then had the fucking audacity to say at the end of the email this is not a bot response after its the exact same fucking email for the 100th fucking time please don't buy any fucking games from this fucking company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "لقد اشتريت اللعبه لأجل اصدقائي ولكن طور الاون لاين لديه مشاكل كثيره يقوم بطرد صديقي في كل مره يحاول الانضمام الي وعند الانتقال الاني وعند الموت ايضا",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't play the game because of ubisoft launcher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a f*** joke. Do not waste your money on this piece of UBISOFT crap. The game looks nice, but you can forget about CO-OP because UBISOFT CONNECT crapware rarely works. Are you kidding me? What did I actually pay for?? And not to mention the auto-skipping of missions which is totally intransparent and useless. This s*** UBISOFT company should be sued into oblivion and the CEOs locked up! And I will never forgive them for removing THE PREDATOR from wildlands, bastards!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sampah, multiplayer sering ngebug.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trshing fking game cant even play offline this is why people pirate you idiots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant 100% due to arcade issues :( so sad :(  GG DC Always!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's so repetitive it's unbearable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ass game wont let me play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why the fuck is this 7 year old game 60 bucks still???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft account now required to play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry is Overrated, Send me a Jester Award, I dare you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game shit as fuc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "multiplayer online not work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game have the longest intro in the world.....\nSCREW THAT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game makes no sense",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "full screen isn't full screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much grinding",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft app to run this shit? Then why did I fucking buy this on steam? No thanks fuck you ubisoft",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a terrible finale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "STUPiD GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "story SUCK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE THIS GAME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft are scam artists and frauds. I purchased Far Cry 5 in 2018, preordered the gold edition and everything. I am now completely and utterly unable to play this game AT ALL. Ubisoft decided to permanently disable and then delete my Ubisoft account (completely without my knowledge OR permission) that was linked to this game, and my other Ubisoft PC games, and they refuse to help out at all. I have a $90 game with 87 hours of gameplay, that Ubisoft won't even let me play. I don't know how this is legal, but I hope their company goes under.\r\n\r\nF*** Ubisoft, don't give them your money anymore. Apparently they have the power to delete your account whenever they feel like it and run off with your money.",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "To get it out the way UBISLOP WHY TF DOES MY SINGLEPLAYER GAME NEED WIFI. I live in a home of 6 people the internet shits itself a lot and what I didn't expect is my singleplayer game to stop working because of it. Actual fucking joke.\n\nThe game itself is great, I grew up on this game on the xbox one but the fact I need internet to play a game that should be offline makes it a not recommend from me and the fact Ubislop will just shutdown the game whenever they want. Overall 1/10",
      "voted_up": false,
      "votes_helpful": 92
    },
    {
      "review": "Game is fine. I don't like the ubisoft client and valve should have balls big enough to tell the vendors no 3rd party clients.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Honestly, it's myself to blame for thinking this series has done something new to innovate its games. It's Far Cry 3 all over again, but 5x more bugs and cringy gameplay. It's the last time I bought any Ubisoft game ever again.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is good but it is not compatible with e-cores in 12th/13th/14th gen Intel CPUs. I think the problem is actually the DRM. No way to fix this other than disabling the e-cores *in the BIOS*. Software solutions do not work.\nThe problem with the DRM and e-cores is the loading times (3 minutes for \"fast\" travel and 5 minutes to start the game).\nUbisoft does nothing about it. They say the no longer support the game. Same thing for New Dawn.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The absolutely horrid ubisoft launcher makes this game unplayable, Steam should really ban 3rd party game launchers. This is a scam. Shame on you Ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is one of my favorite Ubisoft games.\r\n\r\nThat being said, there is something to be said about Ubisoft's insufferable foresight in adding multiplayer arcade achievements this long after the game has been released. The game was released March 2018. The achievements were added December 2024. \r\n\r\nWith today as an example, I went to lobby browser and there were 5 total people in multiplayer lobbies. To get the achievement for the featured maps, you need to matchmaker with 6 people (you + 5). Since this is not crossplatform, this achievement is effectively impossible. \r\n\r\nSo I'm not recommending due to the fact that Ubisoft is infuriating when trying to finish achievement lists for games. Stopping after I finish story mode because why bother hunting all but a couple achievements? (For those of you who are going to say just use SAM, guess what? They blocked SAM changes, just to *ensure* they can screw over people trying to 100%).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't even know where to begin with this game. I haven't even thought about writing a review for something in a long time, but this was a special blend of fun and painful. I need the catharsis of venting about this on the internet to strangers. I was excited by this because I lived up in the area of Montana that this is based on and thought getting unleashed into Montana wilderness with a gun and a can-do attitude would be an absolute blast. And for the most part, the game delivered. The parts where you, the player, have control over what is going on are pretty damn good! There are some problems with balance regarding weapons and especially the wildlife, but it's a game and I know full well you can't always get everything perfect before release.\r\nI give the gameplay a solid 7.5/10\r\n\r\nBut holy fucking fuckcakes, the narrative is so goddamn bad. The writers are obviously under the impression that this is a masterful commentary on modern living and blah blah blah. Three times per area, you are plucked from the world and forced to do some \"cinematic\" sequence where some tripe about how you don't have control in one way or another is forced down your throat. It completely clashes with the core themes of the gameplay and the dissonance is not handled well.\r\nLook, I'm gonna fess up to something. I went to art school. I have been exposed firsthand to the ham-fisted attempts by first year students to comment on something they are under the impression is super important and isn't getting talked about. I have been guilty of flirting with those same delusions of grandeur that tell them that they'll be the ones to finally communicate our addiction to TV by doing a photoshoot of a bunch of CRTs strung up from a tree in their backyard. \"Don't trust the government, maaaaaaaaaaaaaaaan!\"\r\nThis is that. This is an entire game with good core gameplay absolutely ruined by smearing a shit narrative into the cracks so the stench can rip you out of a good time every few hours and force you to play a minigame about choices and powerlessness and drug addiction and blah blah blah blah blah.\r\n0/10\r\nI am both mad and disappointed.\r\n\r\nStill gonna give the post-apocalypse followup a try because Blood Dragon was 11/10",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Soul less game. Fun element is missing and you could sleep through it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I only played it because of the nostalgia I had for Far Cry 3, and god was this a disappointment.\r\nWhile the story truly captured the craziness of the vilian, the gameplay was forgettable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy. Launcher breaks steam. Absolutely not worth $60 or even the $10 I paid.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I used to like this game. Loved it. But Ubisoft has harmed the rep of this series with their handling of keeping these games operable... Tell me, why should a game from 2018 take ages to load on pretty high-end hardware 7 years later?  nothing [i]special[/i] mind you, but it's a darn good PC that can load me in into cyberpunk at max settings at 1440p for really good framerates in under 15 seconds. so why does it take 2 or 3 minutes to load in? And this is with high res textures *off*, as i'd heard that was bugged. \n\nIn this state, i cannot recommend buying this game. Only do so if you're fine experiencing long loads every time you die.\n\nreason for edit: forgot to include the word minutes",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Far Cry 5 as an independent game is enjoyable, but misses out on the charm and appeal of the other Far Cry games.\n\nThe thing I enjoyed most about the previous titles is that you cared about the main character and their relationship with the culture they were plunged into, and how they became one with the culture they had to learn about in order to survive. You also cared about the antagonist and their charisma, and how their relationship with the protagonist played out.\n\nIn this game, there is no culture to explore. And the main character is silent and has no personality to enjoy, so you don't get to see how they interact with the culture around them and how they grow as a person\n\nThe antagonist is ... fine. There's several of them, and I've always felt that the more characters you add takes away from the depth of the existing ones.\n\nI hope there's some future for the games to return to the formula they had in the previous two games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Annoying cut scenes, headache inducing characters, pointless 'challenges'  and inconsistent physics mechanics. (Bullet drop changes {shooting from 100m has more drop than 150m}? Gun range changes?? Enemies can shoot through walls and cars erratically???) With Much more to complain about I still played this game to confirm this is how I feel; this game wasn't even worth buying on discount.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "main story of the game. get kidnapped escape with nothing, get kidnapped escape, get kidnapped escape, get kidnapped escape with nothing, get kidnapped escape, get kidnapped escape with nothing. and finaly get kidnapped kill the ring leader end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ubisoft connect is the worst third party game launcher ever created, it ruins the already poor reputation Ubisoft has.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played it for a while but recently came back to it. The game will not open.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is an absolute disaster.\r\nIt feels like it was made by someone who’s never played a game before. The “story” — if you can even call it that — could’ve been written by a toddler. Nothing makes sense, nothing’s fun, and the ending is so bad it almost feels like a joke. Don’t waste your money on this garbage — unless you’re rich and enjoy throwing cash straight into the trash. The only fun thing are some side Story with your friends",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"You're blocked from logging in due to repeated failed attempts. Please come back later.\"\r\n\r\nBro I just coming back after several months",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is very one-note and preachy.  Stealth completely trivializes everything and there's basically no reason to use 3/4ths of the things you are given because you can already almost effortlessly beat the game with the stock, unmodified rifle they give you at the start.\n\nIncredibly bold of Ubisoft to make a game where you play as the bad guys.  I will give them that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot open the map/arcade editor. Gamepad not working correctly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Far Cry 5 is probably one of the most disappointing games I’ve ever played. Not only is the entire world filled with repetitive side missions (rescue a hostage, blow up a truck, clear out a camp over and over again), but the main story itself is so illogical and stupid that by the end I just sat there feeling like I had completely wasted my time.\r\n\r\nThere’s no proper ending. Ubisoft decided to be “deep” and show that violence can’t bring freedom. Seriously? You spend the whole game portraying a disgusting cult that murders, rapes, kidnaps, and tortures people, you use every narrative trick to make us hate them, to show they are absolute evil and then in the finale you go “Actually, the villain was right, the apocalypse happened anyway, and everything you did was pointless.”\r\n\r\nYou fight for dozens of hours, save people, dismantle the cult, and Ubisoft just invalidates all of it with a cheap “message.”\r\n\r\nCongratulations, Ubisoft, you’ve managed to kill my interest in your games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The story is alright just to shit the bed in the last hour. The ending makes those 15 hours a meaningless waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is great, Ubisoft requiring account linking cost me my copy of the game.  Steam is unable to help, all on Ubisoft's side.  Removed from library and refuse to purchase anything from Ubisoft again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It takes way too long from dying to getting back into the fight to make this enjoyable. I've watched more in game vide and game intro that I've played the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same issue repeats. Ubisoft what are you doing. Game is very good. Works properly. But the thing is loading times is too much. 2-3 minutes every time you start the game and also if you die again 2 minutes of load times. It really ruined my experience of enjoying this game. Honestly speaking avoid all the old and future Ubisoft games on PC. Better get it on console.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gunplay is very good, the look of the game is very good, vehicles feel pretty poor to drive and fly, im pretty sure there are only about 6 models for enemies, scopes dont zoom, spawn radius for enemies is very short, you see them spawn in about 100m away, radio only has 2 channels which are both bad. when purchasing the DLC as a new player, why would i use any other gun than the LMG?? AI will jump into random vehicles and start crashing into literally everything, or steal your vehicle, like a helicopter and just hover above you, friendly AI will stand in front of your car and not move, so you run them over and the others shoot you. various other bugs, why were they never fixed even after 7 years? Great game at a surface level but tons of issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so weak. The gameplay itself is fun but Ubisoft seems to go out of its way to try and prevent you from having fun. The boss-fights (with the exception of John Seed) are so boring, the game constantly interrupts you with cheap cut-scenes where you are drugged or captured to prevent your seemingly God like character from being able to fight back to force tension. Most of the missions are the same, just one shooting gallery after the next. The combat is completely neutered, taking away the over the top brutality of Far Cry 3 and 4 and just replacing it with weak take downs and piss easy combat as your guns cut through every enemy like butter.\r\n\r\n\r\nNo matter how many people you kill, no matter how many bodies you stack, they always talk about you as a rookie or deputy. In Far Cry 3 the enemies grow scared of you as you go from California boy to animal mother, in this game no matter what you do the game treats you as weak. \r\n\r\nWithout spoiling the ending, it was absolutely terrible and ridiculously out of tone with the rest of the game. Ubisoft, do better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I simply cannot get past \"The Cleansing\" no matter what I do or how many times I play it. So far, I've played it 29 times on easy. There is no way around this and it's a complete roadblock for me. It's a shame, too, because this is the first time I've played an Far Cry games and I'd been enjoy it very much. I just hate these often nearly-impossible missions that take a game from fun to frustration to anger to walking away. I won't be trying any more Far Cry games unless I know this kind of situation doesn't exist. Games should be fun, not frustrating, and a cheat to get past this thorn in a rose of a game would be welcome.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can not recommend for Linux users. Purchased to play coop with friends and jumped through many hoops to attempt to get coop to work to no avail. Asked for a refund early on but it appears to have been unanswered.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game with all my heart, my favorite far cry game out of them all. It hurts me to recommend you dont play it but whenever i boot up the game im able to start a new game and by the time I can play MP, if I were to ever close the game and then get back on later to play with my buddy I lose all my progress on startup and have to play the turtiorial again to reaccess mp (use to take me an hr, did it in just 30 min today). Im not even trying to play from my save file, just trying to join up on him which requires me to have still compleated the tutorial however I love this game and would love to play it again but I know that I wont be able to when I wanna try because if I do it HAS to be in 1 sitting and I dont have that kind of time nor do I want to speed run the game. I want to be able to enjoy hope county and see cheeseburger and hear Joseph preach his word while I try to take him and his siblings out. \r\n\r\nFather, have I sinned too much to be able to keep a save file for you? if so please cut that into my skin and carve it off of me. I will say yes, I will let John teach me the right way.\r\n\r\nAlso because of this game I am actually brainwashed with only you because now whenever I hear it all I can think of is Jacob. Very striking whenever I play Arkham Knight and see joker because all I think is Jacob.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requires Ubisoft running. Requires a login on top of that shite app. I wish Ubisoft never makes another game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IS this game good? quick answer NO\r\nLong answer: No, and here is why\r\nOur main character is not talking at all(but its not any close to gordon freeman), character is not reacting at all, other characters not even saying if were showing any expression or not\r\nwere invincible special \"rookie\" killing everyone and saving everyone(rly interesting)\r\ninsane grind of super boring and uninteresting missions that i was mostly skipping\r\nhunting is awful, animals dont spawn, only by luck, ingredients for syringers are super far from each other\r\nand most importantly, achievements ARE AWFUL\r\n1. DLC's: theyre there just to be annoying, vietnam one requieres you to complete game 3 times..........on different modes...........are they actually different?no..................\r\nMars: super boring trying to be funny dlc\r\nzombie dlc: even more boring dlc that tries to be even more funny(none of them were successfull)\r\n2.basegame achievements: most of them are either super grindy(skinning a bunch of animals and catching all fish and beating record of weight) and etc. some are just straight up STUPID, headshot someone from 150m away...you will do it ONLY by guide because trust me, ive tried so many times myself and it was legit looking like 150m and yet, nothing. Infamous achievement is awful because the only difference between normal game and NG+ infamous is that you will be dying from.........something? and from only 3 bullets(i had all perks for hp) and even hobos will be beating the shit out of you easily. sometimes your chopper will explode just beacuse........\r\nAnd in general as usual world lacks of activities and interesting places, the only narrattive is letters, side quests that no one cares about and thats it. main quest is too annoying, at any moment it can just take you to do some repetative bullshit interrupting whatever you were doing, race thing made me ragequit legit because of how bad it is.\r\n1/10  its even worse that far cry primal, if you want at least some kinds of fun, dont try far cry games, as a kid i thought they are fun, but if your more than 10 years old, its really hard to seriously play\r\nbraindead shooting tier :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is ok, story is bad, ending is trash. Dont waste your time and money on this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're an offline player like me, you're out of luck with this game. Even in single player. I've read that there's a work around buying it direct from the Ubisoft, but trying to launch it from steam is a nightmare. \n\nPeople with Internet should have no problem with buying it and playing it though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game starts in the background. I can hear the main menu music, but the game window never appears on screen. I’ve already tried multiple fixes for a couple of hours, but the issue still persists.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game makes you wait almost 2 minutes to reload after every death/mission fail and that makes it unplayable.\nDon't buy this game.\nSpecs:\nAsrock Z790 Taichi\nIntel i7 14700K\nMSI GeForce RTX™ 4090 SUPRIM LIQUID X 24GB\n2TB Crucial T500 M.2 2280 PCI Express 5.0 x4 NVMe (Game drive)\n\n1. Steam, Ubisoft Connect and the game are already on the same M.2 NVME.\n2. Clean Boot - no change\n3. No extra peripherals\n4. Cleared Steam and Ubisoft cache and it now takes an extra 30 seconds to load\n5. Already worked through the faq with UbiSoft support team.\n6. Reinstalled already\n7. SFC - no change\nReinstalled C++. No change whatsoever, the review stands. Ho hum...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring and repetitive gameplay with some really annoying bugs that ruins the whole experience.\n\nIssues like absencse of controller support, coop sesion lags and straight up crashes, Far Cry 5 has been mediocre at best. \n\n(4/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its your typical cookie-cutter, low effort, ubisoft game. Wide as an ocean, deep as a puddle. As with everything ubisoft, very surface level and knows how to draw you in, then after a while, the polish really wears off and the rough facade is shown.\n\n Still a decent game, but as I type this from in game, im stuck doing a multi-part side quest for a \"TESTICLE FESTIVAL\", with the main gist of this part being to kill three bulls while they mate with cows so some dude can cook them up. And they intentionally play this fuck-ass romantic music. And since my game is bugged, I am stuck at this part unable to continue with said fuck-ass music playing. \n\nGenuinely have to wonder who at Ubisoft allowed this, alongside many other of their curious choices for narrative / gameplay decisions, to pass so many checks and balances without pushback. \n\nAgain, they know how to draw you in, typical ubisoft, low effort narrative, and as I play \"Wide as an ocean, deep as a puddle\" echoes in my mind. Worth spending 10$ when on a huge sale. Anything more than that and you got scammed.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}