{
  "positive": [
    {
      "review": "it was a journey through history, art, and the beauty of naval engineering. I grew up loving the navy, and this game once brought that passion to life.\n\nBut the spirit that made it special has faded. Balance is broken, support feels distant, and loyalty no longer matters. The focus has shifted from players to profit, and what was once a masterpiece now feels hollow.\n\nI’m grateful to the original creators — the ones who built this world with heart and respect. To them, thank you.\nTo those who run it now — you’ve lost sight of what made it great.\n\nIt’s time to let go.\nGoodbye, Captain.",
      "voted_up": true,
      "votes_helpful": 53
    },
    {
      "review": "Ive played world of warhips for 12 years, before it came on steam. It is very fun, and probably the least \"grindy\" free to play game I own. It is still a long grind, but it is possible to go from bottom to top in a week of playing, if your good. The game has held my attention for the past decade.\n\n It is not a simulator, it is arcadey, and that makes it significantly more fun than war thunder naval.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The game it self is fun. But it has the most toxic and rude player base of any game I ever played",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I enjoy playing World of Warships.  It can be fun, annoying, challenging, etc.  I'm not the best player.  Noting like what you see on youtube, but i like to play when i can.  There are different types of battles that mix things up if i'm have a rubbish day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve played tons of online games, but World of Warships hits differently. The combination of strategy, tension, and cinematic naval combat is just… wow. Every match feels like you’re commanding a massive steel beast in the middle of an ocean war movie.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far, excellent game.  I would like to see more Xbox controller integration and maybe even videos about the different ships as there is a lot of history.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall a good game. Dont bother trying to talk to management. Just enjoy the game. This is a game of practice. That being said an average ship battle is 15 min. So play when you have some free time. GL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remember Kids, don't do crack or play a game where you can buy the best ships and extras, so you can own the seas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game in every way. be it the ships, maps, music & sound, ports, and the overall design of the game elements, its just so beautifully done \n\ni find the gameplay to be quite fun and engaging, with a high skill ceiling and some strategic thinking required to ensure victory\n\nalthough i feel like i joined the game too late and missed out on its prime glory days, i don't regret playing it and having all the fun memories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT'S MADDENING. Frustrating, gratifying, and edge-of-your-chair fun. I've been playing off and on for TEN YEARS and just spent five happy hours in game after being away for a year!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun naval game, certainly worth grinding out the ships just be ready to have a mix of losses and wins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game just wish you did not have to purchase every ship in order to get to the next one but besides that I like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "slow paced tactical game with high skill cap for both macro and micro gameplay, which doesnt require headset/discord.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love the game play and free gifts you're able to get without having to pay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was enjoyed the game and learned a lot about ships. Also the graphics are very good and have good art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game many years ago and couldn't get into it. Then some friends that have over 1,000 hours here taught me how to play the game. I never realized how good this game is. Collecting ships is addicting, and playing in divisions with friends is a lot of fun. The dockyard missions are almost impossible however, unless you are willing to sink a lot of time into the game. World of Warships is definately worth a look, especially if your are into WWII ear ships or history. It's even better with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish Warthunder's boats were better so I didn't need an extra install, but this is fun by itself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics.\nGood PVE.\nTerrible players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "do not get addicted to this game. one moment you are playing in 2017, the next? you discover its November 30th, 2025 and you're playing wows with a bowl of green bean casserole because you were gifted a tier 8 ship for your accounts 8th anniversary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is pretty fun, with some historic events, and game collabs, sad thing tho is they don't feature Frigates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is solid.  I have been playing for over 10 years.  I take breaks - but always come back to WoW.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do like it but i opend 10 crates and it said it was a 12% chance to get stuff and I did not get it so dont use crates their rigged",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way better than War Thunder, the free rewards are often quite good, and progression isn't terrible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great concept for a multiplayer naval combat game, with some significant caveats.  \r\n\r\nIf you are primarily interested in player vs. player matches (random and ranked battles) you should know that you are at a disadvantage playing the free \"tech-tree\" ships vs. the \"premium\" ships that are primarily acquired directly or indirectly by paying money.  A play-for-free player can definitely acquire some of these premium ships, but overwhelmingly a pay-to-play player will have a far deeper and robust bench of ships to employ.\r\n\r\nNonetheless, there is a great deal of cooperative play content (co-op matches, operations, asymmetrical battles) and if these appeal to you then you can find a very fun and rewarding game.  You play against AI bots and while you may have teammates with overpowered ships, you do not feel at a disadvantage winning vs. losing.\r\n\r\nLastly, this game is very suitable for teaming up with your friends.  Matches of any type with friends is a great deal of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "World of Warships is a visually impressive and strategic naval combat game with tons of ship variety and genuinely satisfying battles. When the gameplay clicks, it delivers some of the most immersive large-scale naval fights out there. However, the grind can be slow, the monetization can feel aggressive, and certain ship classes or tiers often end up poorly balanced. What makes this worse is that the developers are not very good at listening to player suggestions that could fix many of these balance issues, leaving long-standing problems untouched. If you enjoy tactical gameplay and have patience, it can still be fun, just be prepared for frustrating balance decisions and a dev team that isn’t great at community feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is for me, much more relaxed than world of tanks, there are good prizes, gifts in the game, events are okay. I started to prefer this game more than WOT, it is also good that you can play some PVE modes, which gives good XP, so you can upgrade your modules before playing random battles.\r\n\r\nPerformance is great, visuals are great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You don't need to spend any money on this game! Ofc You can and it can help you. But when you get to tier 8. You can grind out the battlepass and get anything and everything you want!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Core gameplay is fun but hard to master \n\nMonetization is absurd but you can manage by grinding thorugh the battle pass and dockyards",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time play this game and all i heard was..\n\"Achichichichi! Moeteru moeteru!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game, the best battleship game ever plus its free. Try now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favorite games next to NBA2k & FortNite, also one of the most challenging games i've ever played. With game chat boards every player makes me feel right at home just the right kind of competitive edge to keep you wanting to come back day after day! Thanks to everyone who help build and supports this game my life is better thanks to you guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun play if you're a naval enthusiast, be it casual or hardcore gamer; easy to play a few quick rounds or a longer session if you lock in. So many of history's amazing ships can be found in here, and it's fun to just watch them duke it out and be part of it. Friendly enough to players who want to stay F2P too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a competitive game, with lots of fun. makes you feel like you really took down a battleship. Feels realistic and its fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty fun game. Love the different ships and detail put into this game. It's very satisfying to sink another ship.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy WoWS, have played it for years, both on and off Steam. Its fun, but don't let it take over your life because the game-as-a-service mechanics can be designed to be a bit predatory at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but match making could be a bit better; also the player count differs from ship tiers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game that is historically accurate and competitive. Would highly reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realistic ships and graphics, interesting reward system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game for over a decade and, it never gets boring. The thrill of being in control of your ship is like looking after your children.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "World of Warships is one of the best tactical online games about naval warfare. The game impresses with its level of detail: the ship models look almost like real historical prototypes, and the attention to detail — from turret animations to the sound of gunfire — creates a truly immersive experience.\n\nThe gameplay is built not only around shooting but also around tactics. Positioning, concealment, engagement distance, and understanding the strengths of each ship class make every match intense and engaging. It’s especially nice that different ships feel distinct: destroyers are fast and stealthy, cruisers are versatile, battleships are powerful but slow, and aircraft carriers require strategic thinking.\n\nThe progression system motivates you to keep playing, unlock new tech-tree lines, and upgrade your ships. Regular events, modes, and updates keep the game fresh. Team battles often deliver those memorable moments when victory depends on a single well-placed salvo or a smart maneuver.\n\nYes, matchmaking and balance can sometimes be frustrating, but overall the game remains fair and exciting — especially if you love history or naval battles.\n\nWorld of Warships is the kind of game you launch for “just a couple of matches” and end up playing all evening. 🌊🚢",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely love World of Warships. The gameplay is strategic and immersive, and there’s always something new to do. The daily missions and rewards keep the progression exciting, and the variety of ships, nations, and playstyles makes every match feel different. The visuals and sound design are top-notch, and the teamwork element adds real depth.\n\nWhether you’re jumping in for a few quick battles or grinding missions for a new ship, there’s always something to look forward to. Highly recommend if you enjoy tactical multiplayer battles and steady progression!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has good graphics. The gameplay is also enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WOW is a thrilling and visually stunning naval combat game. The constant updates, variety of ships, and immersive battles ensure top choice naval warfare.\r\n\r\nIf you haven't tried it yet, I highly recommend giving it a go!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with strong mechanics and fundamentals. Surface ship combat is really fun (even when the ships are busted). The issue of game balance comes mostly from aircraft carrier spotting and submarines. You can play around both, it's just not that fun to do so. \n\nIf you are new and trying this game do not skip to high tiers (VIII+) - the game gives/ sells you a lot of those ships, but you will not have a good time if you don't have an understanding of the base mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an older gamer, I really enjoy playing World of Warships in co-op mode. The pace is something I can keep up with and think about instead of lightning fast PVP matches. I recommend World of Warships for anyone that enjoys naval combat and a relaxing atmosphere. It's honestly fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game that is free to play with optional pay to play content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This never gets old.  The core gameplay stays fun. It have ships for all playstyles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, doesn't require split-second timing for controls, and no overly complicated in-game mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game just wish they would add more modern ships and i would love they online campaign  where other player can join to help the accomplish the goal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, highly recomend if your into realistic War Ship and  Shooting and shooting/blowing enemy ship up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very f2p friendly. Just do your research of roughly what ship lines you're interested in and you can get all the way to lvl 10 just by playing games and not spend a dollar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics- Great, the details of ships are accurate specially if you are using a proper gaming pc. If you like collecting visual model of historic ships, this game is for you.\nGameplay- Please add more maps/modes. Operations are getting monotonous. Overall the game play is enjoyable.\nGrind- too much grind after the in-game economy rework.\nstory- some events are story rich. They are not regular feature of the game though.\nMusic- great\nDifficulty- average\nBugs- not at all. Just match the settings with the capabilities  of your device.\nSystem requirements- Even the 7th gen i5 with integrated graphics can play it. It looks cartoonish though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having played and still actively playing Wows since 2015; I can say in confidence I think it is a good game. I was recently able to convert my main WG account over to Steam, which easily has a couple thousand hours. Since learning of the game all the way back in 2015 from one of BaronVonGames' videos, the ability to visualize historic and non historic ships, and machines of war was the biggest pull for me to start playing. \r\n\r\nThe game has a relatively low skill ceiling, of which increases at a good pace as you progress. Continuous updates, additions, and events, make the game fun to play even if you cannot play that frequently. \r\n\r\nI will say though, similar to many modern MMO's, Wows' only hamartia is its FOMO mechanics and cash grabs. Although you will progress through the game quicker than other games such as Warthunder, many added premium items or new ships are sold for obscene prices, or are to be gambled for; to then in some cases be nerfed to the floor. \r\n\r\nMoreover, gameplay is extremely fun especially when you do get the hang of things, figure out lead times, how to angle, and general map knowledge. Yet newer additions see newer gimmicks and mechanics that do take away from the fun and lean the game more towards stupidity, rather than actual logic. This increases exponentially as you play higher tiers VIII-X. For example additions like Valparaiso, high tier subs, high tier CVs, and of course airstrikes. However, the biggest issue you will face like any other multiplayer game is; your teammates.\r\n\r\nGameplay is entertaining, but not when you have your entire team leave the flank to go sit behind one island or in the corner of the map. Also not fun when you have no DD or CV to spot. So teammates are a big part of the game, and if you have friends to play with even better, as it will save you headaches. \r\n\r\nFor a free game, I would easily pay for it if told otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me está gustando bastante este juego de barcos. Tiene un ritmo entretenido, buenas mecánicas y partidas rápidas. Está guay, así que lo seguiré jugando siempre que tenga un rato libre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Joined for the big boats, stayed because I accidentally became a naval tactician at 2 AM. The ships look amazing, the guns go boom in the most satisfying way, and even when I sink, I sink with dignity… usually. Great game if you enjoy strategy, explosions, and yelling at torpedoes you definitely saw too late.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had a lot of fun with this game and have not seen anything else that can offer a good similar experience, but I do struggle somewhat to recommend it due to some economic design decisions.\r\n\r\nGameplay-wise, this game has a lot going for it with a variety of pvp and pve game modes.\r\n\r\nStarting with pvp, which seems to be the focus of development, there are four \"standard\" game modes: random matches, ranked matches, brawls, and clan battles. Random matches are the most basic form, with large teams of mostly-unrelated players competing to destroy the other team, capture specific locations, or otherwise win by out-scoring the opposing team. These are generally uncoordinated and vary significantly in quality from match to match. ranked matches are similar, but with smaller teams and a tighter selection of ships available. This allows greater individual impact and generally has better communication, but in my experience also has a more toxic playerbase. Brawls are the most extreme extension of this, allowing ships of only a single tier and limited classes with teams of three or fewer ships each on smaller maps. These are usually quick matches with varying levels of strategy (usually not too much) an team coordination (its easy to support your team but unreliable to expect them to support you). Clan battles take random match team sizes, but compose teams of players within the same clan for potentially much better teamwork and more complex strategy, but I haven't played this mode, so I can't say how it turns out in practice. Brawls are my favorite of the pvp modes, where I mostly play utility cruisers.\r\n\r\nMoving on to pve, there are two main game modes: co-op and operations. Co-op is the first mode available to teach players the game, an involves simple bots that functionally act as a shooting gallery for players who want an easy time sailing around in their virtual boats. It also has a guaranteed quick wait time, capped at 30 seconds. Operations is only available for tiers six and up, and adds (slightly) smarter bots and missions with specific objectives and sub objectives for a relatively small team of players. this is my favorite game mode, but it is definitely limited by a somewhat small selection of mission scenarios. Some of the scenarios have randomization in the order or location of bot/objective spawns, but they are still fairly easy to learn after a few matches of each scenario/spawn combo. Additionally, asymmetric matches are sometimes available, and play like co-op with much smarter bots and a small, higher-tier team of players opposing a large, lower-tier team of bots.\r\n\r\n\r\nShifting over to economic aspects, the game consists of both free-to-play and paid content, but I have not found it to be particularly pay-to-win.\r\n\r\nWhen playing the free content, the game is fairly grind-centric in the long-term, but if you find a line of ships you enjoy playing individual matches in, said grind can be fun despite the time sink required to ultimately complete the line. So be prepared to take your time working through the game, and take care to enjoy the ride rather than simply rushing to the end. \r\n\r\nWhen considering spending money on the game, remember that everything is overpriced, some things quite dramatically so. As such it is important to first determine what your goal is in doing so. If you want a specific ship, try to use coupons, and know that it is always better to just buy that ship than to rely on any of the gambling mechanics. In contrast, if you just want to maximize the number of sips you have or can get, save for events that have good drop chances (I believe Christmas, Anniversary, or Black Friday events are generally the best in this regard). If you are looking for the best deal for progression in the game, I recommend getting premium time deals near the holiday/new year season when there is a deal. Depending on how much time you have to play, 3-6 months can last forever supported by additional time gained from events, or a year can provide a stronger buffer with less playtime to maintain it.\r\n\r\nUltimately, I am recommending the game because I have enjoyed free content, and think that there is a lot to get out of it if you have the time and are looking for the gameplay provided.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "offers epic naval battles with detailed ships, strategic combat, and satisfying moments that make every encounter feel massive and impactful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brutal, fun, and overall great game. Recommended for anyone who loves some old School battleships! I honestly enjoyed this very much thanks to my friends who recommended it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good for a free to play war vehicle simulator. Very big issue though is matchmaking, it sucks. Also some predatory tactics of forcing you to play the game a lot or lose out on rewards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it a lot.   This game is a strategic FPS, with torpedos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and addicting game to be honest. It is 100% a game that you will have to grind, but the tech trees for the different countries is diverse and rewarding. Very nice strats and if you are a history buff then there is fun there as well. great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In an era of greed (Warthunder), World of Warships is very providing to its players. Free premium, free premium currency, free everything, all from events that happen every month. \n\nThat's just the icing on the cake. You can progress through lines of ships in this game quickly!\n\nYou may not like the hp system, you may prefer Warthunder's accurate damage, but for a naval combat game I would consider this an acceptable simplification for the sake of enjoyment. This is a fun, free game, that you won't need to waste hundreds of hours on to play your favorite naval vessels from the World Wars.\n\nMy only complaint is that the division sizes for random and coop matches is a little too low.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, have been playing since the inception of the game when it was just talked about through playing WOWT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing on of since alpha us and alpha eu, its a great game, if you filter out the angry ones that think win rate really matters, and have no clue about how it accumulates over time. thats the biggest problem, if you fail the first hundreds of matches while learning to play there will alwyes be thoose omg your winrate is low, but they seem to forget that if you have bad luck the first hundreds it takes 4x more good luck to increase.\r\n\r\nAnyway grind isent that bad join a fleet/caln have have fun matches participate in clanwars and just have fun. also good if you dont have alot if time to play, play some matches return when you have time.\r\n\r\nAnd in the end the most funny matches ive had have 96% of the time been lost matches. some players are way to serious, its about fun afterall win or loose",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spending lot of time, frustrated because get uptiered, but winning next match, happy again, repeat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to run operations with historical ships and play out their strengths.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game ,would be better if the devs are more prosperous",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "probably the best ship game on steam if you want pre-Cold War naval battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great Game. somewhat expensive if you like to collect ships",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have found the game to be very entertaining so far.  The graphics are very good, and the game is exciting to play.  I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played legend when it was released on xbox back in 2017 and still do but this is by far 10X better cheaper dlcs and the tech tree is far better as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Free and not pay to win like some seem to think. Constant updates and new content. Glad they finally allowed my account to work on Steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Long term grinds with some need to use real money or do login and missions every day grind to get free stuff.\r\nLots of events at multiple times of year some are free to grind and others require real money purchases.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "'Bout to hit these seas running... swimming?   If you want to tear around the seas with cannons blazing, here it is!    Clearly it welcomes you to spend like thousands of dollars on this game, which is hilarious.  It's very fun to tinker around with without spending a dime (or only a few...)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better then warthunder and most of the goon content is gone also not really pay to win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you played this game, came back to it each time and played one match 10 times, and you think war thunder is an okay game, you'd enjoy the match [spoiler] 6/10 times. [/spoiler] No more needs to be said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for a party style multiplayer... I put this on the same level as Mario Kart. Well done",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if you like warship battles. plenty of ships to obtain and do battle with. Join a clan and go to battle with your clan to upgrade your naval base for bonuses. Plenty of events to get ships or containers through grinding different ships and missions.\r\nalways something new going on so grab a life jacket and head off to see for glory and getting a larger fleet-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is incredibly realistic and action packed making it interesting to control all the different warships and see how they operate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE IT!!!!!!!!!!!!!\r\nThis is the most realistic warship game for a warship enthusiast!\r\n100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great game you dont have to pay for. or you can choose to pay. It is a Pay to win kind of game tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combination of strategy and first person shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played countless hours of this game on the standalone Windows client. I have the Arkansas B (as in Beta) from the Beta test. My current listed playtime on Steam is only for the Steam version.\nI switched over to this version because its easier to get working with Linux, which is does very well.\nIMPORTANT NOTE: I had to link my Steam account to my Wargaming account BEFORE I booted up the game here for the first time, otherwise it will create a separate account automatically!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's something about the slow pace as you set off to battle. Figure out who's headed where. Decide on your direction. Set your AA priority sector. Look off into the distance for enemy ships. Sit back. Relax. Then, you see that first enemy ship appear, followed by two more. Once the battle begins, there's no relaxing. I love playing this game.  I took a break for a couple years. When I came back there was a LOT of stuff I needed to look through and catch up on. At its core, though, it's just fun boom boom.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Out of all free to play grindy games this one is actually kinda good. It's not super grindy, you start having fun before it gets boring.\n\nThe game is really easy to get into. Very arcady, but for me it's a good thing.\nPvP is optional. There's actually a lot of PvE content, like operations. Perfect for noobs like me.\nYou can play as a submarine or an aircraft carrier, which is kinda unique in a multiplayer game.\n\nGet your ship hyperfixation fix today for free!\n\nHowever, there are some cons too:\nFOMO events and some rare things are extremely hard to get unless you have thousands of hours or are willing to spend hundreds of dollars. I don't and I'm not, so I'm missing on some interesting and unique ships with no chance of getting them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the game that made me want to join the Navy, and I still want to join the Navy, so suck on it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Challenging and fun! Great game for strategy, esp if you love to blow stuff up XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun naval game, but not for those going after accurate battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why super ship is unprofitable? It's is impossible to make profit in any game mode. For random is fine. It's overpower but when play against bot is still a HUGE LOSS. WHAT'S POINT OF SUPERSHIP AFTER ALL. When you collect 50 million, you expect BETTER SHIP, NOT THE WORSE.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has truly taught me the arts of patience and perseverance through the grind of earning XP and getting to your first Tier X ship. The game has encouraged and allowed me to conduct research in my spare time to understand the historic ships and their relevance but also how they translate into the game to see how they differ from one another. The game has been really fun to play with friends - being able to try different strategies and combinations of ships in order to win. I highly recommend the game for all players who might enjoy slow paced games which involve more decision making and strategy based thinking!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent naval battle game; the anniversary event is great especially for f2p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly it feels like an AI wrote the progression system: boring, predictable, and designed to keep you hooked while spending. If you’re here for deep naval tactics, be prepared to wade through a swamp of RNG and microtransactions.\n\nPros:\n\nDecent ship models and water effects.\n\nOccasional fun in cooperative play.\n\nCons:\n\nGrinding feels like punishment.\n\nAI/automation in tutorials and systems kills challenge.\n\nPay-to-progress is painfully obvious.\n\nMatchmaking is inconsistent.\n\nRating: 5/10 – Looks pretty, plays slowly, and feels like it’s testing your patience more than your skill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WG is adding much much much more power creep faster than before. I think it has about 3 years left but it is fun and you dont have to spend TOO much money nowadays",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well! It's Naval Warfare!! And there are Achievements!! Plus, the Playerbase is ........Eccentric!!\n\nAll that and the Historical Ships that YOU can Captain. Yeah, 'World of Warships' is a Good Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "JUMBOCANNON,\n\nOVERALL THE GAME IS GREAT~! I WISH EARLY ACCESS WAS MORE LONG TERM, 1 MONTH SEEMS SHORT! DAILY REWARDS ARE NICE~ I SPENT OVER 1K IN THE GAME, I REALLY ENJOY IT! OVERALL LOVE IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you learn how to fight multiple ships from multiple countries, each with different strengths and attributes, the strategy behind the battles adds the excitement that keeps me playing. You need to try hard to be good and I like that.  The only drawback is time in play to advance without spending loads of cash.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the look of the ships and the play of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10 overall. I wish they would add additional Operations maps. \r\nPearl Harbor\r\nLeyte Gulf \r\nHunt for the Bismark\r\nCoral Sea\r\nMidway\r\nSolomon Islands/Santa Cruz Islands",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Last memories with my grandfather before he passed in 2018, a buddy of mine needed help and so i reinstalled it. I don't think ill touch any of the ships my grandfather last played as i don't want to change anything he done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“World of Warships lets me command a giant metal beast, miss every shot, and still feel impressively dangerous—solid entertainment!”",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Between Steam and non-steam version, I probably have close to a 1000 hours (over 259 hours on Steam at the time of writing). This used to be a great game, because devs actually did something about toxic players, afkers, bots, etc. Premium ships were inferior to tech tree ships and most of microtransactions were cosmetic. This was very different from World of Tanks in that regard. These days, it's just a dead version of World of Tanks. Premiums ships rule all tiers and they sell ship packages for over $200 USD. Game is ridden with low population and when you do get a full game, it's full of griefers and afkers. The core gameplay is fun, which is why it's so upsetting.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "you get on to play a fun game only to be out matched every time. fighting t9 t10 when your always below. you will always lose. not fun not worth playing above t5 now. Get subs and mess with people, not worth spending money.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "this game has me so angry with disconnects, crashes, whatever you call them.  I've never had issues like this before i've tried playing with steam, without steam and same thing happens.  i used pingplotter and it says the IP is in chicago which is right next door to me, and it says my connection is dropped on your end, fix your network wargaming! and people report you for afk gaming which is crap!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "At the moment, I do not recommend the game.\nI would only recommend it if you genuinely enjoy naval combat, ships, and the WWII aesthetic and you have no intention of falling into the gacha loop or the pressure of “playing to win.”\nIf your goal is simply to enjoy the battles, take the game lightly, and play free-to-play because you like the ships or the era, then yes — you can still have fun.\nI’ve been a player for over eight years, even before the Steam release, and I’ve witnessed many stages of the game: its evolution… and its degeneration.\n\n➤ The main issue: the gacha model\n\nA few years ago, the game introduced a business model based on loot boxes, random rolls, and probability systems.\nThis completely changed the experience:\n\nIt’s no longer just paying for a ship.\nNow it introduces anxiety, bundles, odds, and the illusion of obtaining something valuable.\nShips have become excuses to generate spending, more than actual content.\n\nWhile there is some generosity toward free-to-play players, that generosity is completely tied to profit.\nThey cannot be “too generous” unless revenue stays high — and it shows.\n\n➤ The rarity system reinforces the gacha feeling\n\nThe game also added a rarity-based ship classification system, depending on how frequently ships appear or how difficult they are to obtain. The categories go from Common to Legendary:\n\nCommon (gray): standard tech-tree ships\nUncommon (green): often premium or shop ships\nRare (blue): usually Research Bureau ships or ships obtained with coal or steel\nEpic (orange): time-limited ships; very difficult or expensive to obtain\nLegendary (yellow): extremely rare; I own none, and the Captain’s Logbook only shows two legendary ships in total\n\nThis system shifts the focus from gameplay to collection pressure, encouraging investment based on scarcity more than value.\n\n➤ Game balance: certain ships dominate ranked\n\nThe variety of ships and playstyles has always been one of the game’s strongest points.\nHowever, lately I’ve noticed bad players performing well simply because the ships they use are overly strong, especially:\n\nPan-American battleships\nGerman alternate cruisers\n\nIn Random Battles, the balance is still somewhat acceptable due to larger team sizes (12 vs 12).\nBut in Ranked Battles, any ship from these lines heavily tilts the match, and if a skilled player is behind them, the difference becomes overwhelming.\n\n➤ The deeper issue: the psychology of PvP\n\nIn any PvP game, players ultimately want to win.\nSo when a ship becomes S-tier — whether premium, special, epic, or part of a tech tree — many players choose it simply because it increases their chances of victory.\n\nBut when everyone gravitates toward the same S-tier ships, the game stops being about skill and becomes a race to pick the strongest tool.\nThis creates a meta where diversity disappears and the experience becomes unbalanced and predictable.\n\nThe dangerous part is that players often don’t even realize this is happening.\nThey think they are “just playing to win,” while the entire environment is being shaped around a handful of overtuned ships that distort the whole match experience.\n\nAnd the developers likely understand this dynamic.\nIf an overpowered ship generates revenue, the cycle repeats:\n\nA new strong ship appears\nPlayers rush to get it\nThe meta breaks\nThe next strong ship is released\nThe loop continues\nThis self-reinforcing cycle benefits monetization at the expense of balance.\n\nThere are also other game modes that can be enjoyable for casual play, farming missions, or playing with friends, such as Operations and the occasional Asymmetric Battles. These modes still offer some fun and variety outside the main gameplay loop.\n\n➤ Naval variety: its biggest strength… with a big “but”\n\nThe game includes real historical ships, prototypes, and ships that never existed.\nEach nation has its own mechanics and identity, and some hybrid concepts are genuinely interesting.\n\nBut one thing ruins part of the experience:\nit doesn’t feel good to play a real historical ship and get destroyed by a design that never existed, especially when that fictional ship is clearly superior for commercial reasons.\n\nYes, many ships are free-to-play friendly and obtainable with steel or coal — and that remains one of the best aspects of the game.\nBut even this gets overshadowed by the greed behind bundles and the gacha system.\n\n➤ Gameplay mechanics that no longer maintain even the illusion of realism\n\nThe game was never fully realistic, but it used to maintain a coherent naval atmosphere.\nThat illusion breaks when mechanics such as these appear:\n\nCruisers and destroyers launching bomber planes\nAbilities that contradict traditional naval logic\n\nThese mechanics completely break immersion.\n\n➤ FOMO and psychological pressure\n\nMany events and limited ships rely heavily on FOMO (fear of missing out).\nThis encourages quick purchases, impulsive decisions, and the constant feeling that you’re always “missing” something important.\nShip collectors are especially vulnerable.\n\nFor this reason, I do not recommend spending money on a game that relies more on illusions and psychological pressure than genuine value.\n\n➤ In the end, what matters is not what the game offers, but what you expect from it.\nThe experience depends less on the game and more on what you seek inside it.\n\nAre you playing the game… or is the game playing you?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Overall the base game is well done and super fun to play. The depth of the mechanics and the variety of the ships all make for hours and hours of interesting and fun play. Where it all goes south is the everything outside of the battles. The developers do a really poor job at making the missions easy to understand and to make matters worse players cannot pick the type of map they wish to play making accomplishing many of the missions unnecessarily long and painful as some map types make it impossible to achieve the mission goals and you cannot simply quit out and pick a new match hoping to get a map that works for the mission requirements. Player support is almost non-existent. I could write a page on how poorly this team is at answering support questions but it takes weeks and weeks to get anything resolved if you're lucky. It's free to play so enjoy the game play but I wouldn't recommend spending money on it and I would definitely NOT recommend recruiting friends to the game because the recruiting part is poorly explained and broken most of the time and the devs will not go back and give you credit for recruiting them if the recruiting link didn't work (which it usually doesn't)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "normally the game is fine, but when the servers lag-out and you loose all control over your ship, you'll get punished because of \"idle during battle\" or \"leaving battle early\".\r\n\r\nThe graphics are great, but you are limited by the amount of fun you \"may\" have, until you pay cash for in-game items.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, but fueled by pay to win and by bots from certain Countries......\r\nSuch a shame we live in this bs world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has been declining for years now and will only continue to get worse for standard players. WG keeps adding gimicks and mechanics under the idea of what would be fun for the person in the ship, with no care for the experience of their opponents. \n\nHonestly, it's cool to play a carrier and permaspot a destroyer or play a sub and be the silent terror but for the other 9 people in a match there's not a lot of agency when facing either class. Your best option is often just to kite away and hope your own cv/sub pulls through.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its just dog shit tier v ship and i have to fight against tier 7? like what the actual fuck did you brain dead devs do to this already mediocre game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "World of Warships is ideal for anyone who has access to unlimited cash and is looking for a short cut to learning skills. Oh... you can \"level up\", buy skins, mods, trinkets,  as much as you want!! Super ships, longer range, more fire power, higher damages, etc. you name it they sell it.  BUY BUY BUY! The offers are constant and those with them dominate. Creating an endless harvest of your funds if you're so inclined. Dominate with no skills required! And those players LOVE to talk smack about others whom they decimate unusually quickly. \n\nHowever, if your looking for a naval warfare game that has realistic engagements that tests your naval tactics against your opponents, then this is NOT the game for you. The only real enjoyment are the first two or three levels, then the spread between ships with and without paid for mods shows. I have over 150 hrs in game and after this post I will be uninstalling my game from my Steam account. Nothing in life is free, and this game proves it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Awful P2P game. Can not earn enough Doubloons to do anything at all with, you have to purchase them. played 380+ hours and just can not stomach the amount of crap they want you to purchase. I would not recommend this garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This has to be the greediest model for revenue in all of gaming.  Also the game devs solely rely on power creep to keep sales high.  Basically anything old is so power crept to be basically not worth playing.  Many ships can exceed $100 asking price.  And now they are threatening to delete my account because I havent played in a year. After several hundred dollars invested since 2017.  Because there are no DLC.... Anything purchased dies with your account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is really fun until you get to that one ship you have to level up, which is absolute garbage and gets one-shotted by everyone and everything. It's a shame, but I'm not interested in that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall, it’s not a bad game, sure maybe it’s not particularly realistic (mostly for balancing reasons) and one of the few games that it’s actually a pay to lose, so I consider it a good free to play. But the reason why I gave a bad review is simply because it requires really too much grinding to unlock anything above tier V. To not mention that to get a useful number of doubloons or coal (just in game) takes years and even if they can be also used for cosmetics, they are the essential resources for upgrades and for converting XP. So, when they will decide to properly balance those problems, I’ll also change my review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a game with a history that Wargaming should be proud of.\n\nThis is a game that has dragged its playerbase through controversies, questionable game designs, greedy monetization schemes, and some of the most outright consumer-hostile decisions I have ever seen in a game's life. Somehow, in an age where garbage like The Day Before and Concord managed to get out the door, World of Warships somehow continues to chug along despite having enough mishaps and incidents to fill out a damn TvTropes page.\n\nWhether it's because of or in spite of Wargaming's efforts, I cannot endorse a game whose dev team is competing with Ubisoft for the most morally and creatively bankrupt developers in the realm of video games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game since Closed Beta.  It's my sunk cost fallacy now.  If you like naval combat but not enough to play a simulator, the game is fine.  Just don't get sucked into the gambling loot boxes and ridiculously expensive ship packs.  Some of which can get up to $400-$500.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Predatory monetisation\n\nexcessive grind for basic rewards\n\nPay-To-Win mechanics in various cases\n\npoor consideration for Real-life situations and punishment on players for IRL Interruptions.\n\ncompany has EXTREMELY poor customer service and piss poor service in general.\n\nif i have the ABSOLUTE AUDACITY to leave the battle after i have been sunk, instead of JUST SITTING THERE AND WATCHING EVERYONE ELSE HAVE FUN instead of starting a new game - I GET NO REWARDS OF ANY KIND FOR WHAT I DID.\n\nwhich means if i play a twenty-30 minute game - i get killed 15 minutes in, and i decide to go play another game with another ship - I GET NOTHING FROM THAT FIFTEEN MINUTES OF MY TIME BECAUSE I HAD THE AUDACITY TO LEAVE THE BATTLE.\n\ngame itself is brilliantly fun, but as per usual, its all undermined by management that cannot be lobotomized due to lack of brain, and programming that was probably off an AI that was bought second hand from Temu.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i mean its fun for a while till the mp cheaters start one shotting you with their opening salvos. But the biggest piss off for me is the games main menu UI. Whoever did the UI for this and the console version needs to be FIRED AND BANNED. FFS. GO BACK TO SCHOOL. \"Campaign\" has no campaigns. Its just a string of opt-in achievements. FKING DUMB. Theres a shipyard where you can build a ship? i guess? NO IDEA HOW  IT WORKS. NO EXPLANATION. Hey! theres a model on the table that has other \"quests\"! NO IDEA HOW TO GET IT TO WORK, NO TUTORIAL, NO INTRODUCTION. NO INSTRUCTIONS. THIS GAME IS FULL OF DEAD ENDS UNLESS YOU PAY. PAY WHAT? WHO KNOWS!? THERES 20 KINDS OF EFFING CURRENCY AND ITS A CLUSTER FK OF A SYSTEM ON PURPOSE. F THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is odd because it has elements that triumph over its contemporaries and still has such a grind and so much FOMO in the events I WENT BACK TO WAR THUNDER NAVAL.\n\nearly tiers are enjoyable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked this game i play it on GeForce now and lately i can't login because the game freezes on the logging in screen i have a week not playing it's so annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yo I just talked this game up, in a review on war thunder and I did not know y'all turned my boy into a gat damn uwu.\nSaddening.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "takes too long for gaining exp  way to much of a investment game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it never loaded when it did it was since i did a tutorial to change some stuff but the next day it stopped working again, would not play again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Anything built in england will catch fire as soon as the game starts. Which is really fun because nothing beats waiting to play and game and immediately combusting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know who decided that destroyers should be the most ridiculously OP thing to every exist in any game ever, but man, it ruins the game. They have no problem penetrating BB armor, which is impossible in real life, and lighting BB's on fire every other second, which makes no sense with metal ships, and to top it all off, they get infinite torpedoes! Yay, infinite torpedo spam! It's insane, I cannot comprehend how anyone can play this game and not get infuriated by destroyers being by far the most outrageously OP things that's ever existed in any game ever. Sure the economics of the game are ridiculous, but not 1/10th as ridiculous as how unbalanced and OP destroyers are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Monetized for wallet warriors. Unbalanced game where you fight against aircraft carriers with unlimited planes who sit at the back of the map and against undetectable submarines with homing torpedoes fighting pre WWII ships",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "been playing for years, i enjoy the game, but they dont fix features that break, so i cant recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the bote engagement is pretty fun, until a submerged sausage or sky cancer comes and invade. with how the game is moving right now then im pretty sure its only getting worse. i only play ranked (only when sausage and planes are banned) and pve so i mostly could avoid the frustrating, infuriating and borderline malding gameplay.\r\n\r\nif you're going to play this game expect a lot of predatory cash grabs, lots of gambling, and fomo marketing. the dev likely wont listen anything from the community, the QC has either been sent to the gallows and replaced by sub human apes. some bugs persist through years without any signs of fix, and more game breaking bugs has been introduced. and they still wont fix it unless it stop them from making money lmao. \r\n\r\nif you really wanna play arcade imaginary ships, then there are no better comparison to this. and if you do i encourage you to not ever spent a single penny unless they actually start improving the game. and honestly if you want \"better\" as in less bugs and less frustrating gameplay mechanics you should probably play the SAME exact game but developed by a different organizations (look it up) and the only reason i didnt play there is i live far from the server and i cant get a good ping for a smooth experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely hate this game, my mates play it and the black friday sales are quite frankly shit, paid 80 bucks for some gamblin in ame and got fuck all, do not recomend, if your mates say get the game say no, if you think about buying stufff in this ame punch yourself in the head to rid your mind of the thought, DO. NOT. GET. THIS. GAME. save yourselves for i am allready lost",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For historians, this game will appeal. For people who like long battles where your attacks do basically nothing and miss 90% of the time even if you lead your shots; and a single destroyer swoops on by your ship and instantly kill's you with torpedos, this game will appeal. For me, this game dose not appeal.\r\n\r\nWhat initially drew me to try this game was the collaboration with with Azur Lane, a different free to play historical ship game. I added that content to my library, and this being steam, I thought it safely would at least save the DLC content listed, even if the event was no longer avalible. Nope, for some reason even the DLC items are tied to time gates. But fair enough, you don't own the IP. So I let it go easily and played for about 12 total hours.\r\n\r\nHere is my honest review of each ship I could play:\r\n\r\nCruisers are the bread of the game. No butter, cause that would add some satisfaction. No, they shoot wet paper balls at enemy ships, their rounds swerve wildly off course even when aiming at a stationary target, and when you lead shots to catch moving targets, 1 in evey 6 fired shells will actually connect, doing 1% of the enemies total HP in damage. And that is your primary weapon's damage.\r\n\r\nDestroyers are basically the only real killers in this game. Fire off torpedoes in the enemies general direcion, and 1 to 2 min later you will be notified that something died. Or you can sail right up next to a big ship like a Aircraft Carrier or Battleship, and point blank nuke them with the torpedoes. This tactic works with cruisers too, just make sure you are slightly ahead of them.\r\n\r\nBattleships are slower cruisers, except their guns do good damage. Only issue is they take forever to reload. You get the benifit of having better armor, but as I said; its irrelevant in a game where even some cruisers have access to torpedoes and can just sail next to your ship to nuke you.\r\n\r\nFinally, the class I was somewhat excited for: Aircraft carriers. Again, a dissapointment. If you don't make your ship hide in some corner of the map, you are easily the most easy kill for any torpedo volley. And the planes you attack with all suck. Only the torpedo plane is somewhat ok, and you'd never guess why: torpedoes.\r\n\r\nIN summation: this is game is World Of Torpedoes. If you insist on playing, better get used to dying through no fault of your own as you desperately try to make your slow turning ship dodge the rapidly approaching point blank volley of torpedoes (You won't).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's alright, but torps seem poorly balanced to me, and as per usual with wargaming the grind is sharply exponential rather than a smoother curve, fun for messing around at low tier but not worth the time required to get high up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only play this game to spend time with friends who are fans. But the UI is confusing, especially in mini-games. Must useful buttons are set under the most useful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "80gb for the most boring game of all time\n\nsit in a boat and shoot simulator, legit could find a game like this on roblox and itd prob be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable since last update, constant \"critical error\" messages, developer doesn't seem to acknowledge  the issue..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hate this game so much. Said some bullshit like 'You have conflicting credentials\"  And then it says I cant play the game because my steam located me in Asia. Says change my email but everytime I click account management it blocks me. Wargaming needs to fix this very important issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game with one of my closest (Ex)best friends. We were inseparable—two idiots ruling the seas, bullying lower-tier ships and throwing ourselves at higher-tier ones just for the chaos of it. Those were some of the best moments of my life. We loved the game, hated the game, and laughed at all of it together. We’d even paint Warhammer minis while waiting in the queue, just to jump back in as soon as the match popped. And don’t get me started on how much money we sank into Christmas loot boxes.\n\nThen I moved away. It was a once-in-a-lifetime opportunity, but leaving him behind felt awful. The worst part is that we never got to say goodbye—not properly. And since the day I left, he hasn’t sent a single message. Not one.\n\nSo yeah. Screw this game. And screw the friendships it creates and makes you miss.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i played a while ago but now as i try to start playing now it says i have a EU account witch i dont have and sine i cant login i cant make a ticket for help i cant login or play anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be great fun with destroyers and cruisers and battleships. But now with the addition of submarines and carriers and special gimmicks for new ships, it's unbalanced and not fun anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THEY PUT GUIDED TORPS AND STUPID IMPOSSIABLE AIRSTRIKES IN THIS GAME NOW ITS A DYSFUCNTIONAL HELL SCAPE OF STAY THE FUCKE AWAY FROM THE PLAY TO WIN SHITTER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So we cant log into our old accounts? Oh! and the FAQ does NOT help whatsoever!!! YAYYY!!! Good job! Years of work and playtime all for nothing!! DO NOT DOWNLOAD!!! THEY WONT LET YOU INTO YOUR OLD ACCOUNTS!!! I WOULDNT BUY ANYTHING EITHER IF YOU DONT WANNA WASTE MONEY!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many trolls and the population is staggering",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend this game anymore. Very high $$$ cost for a game if you want to level anything at a regular pace. Need to buy premium time, event passes, and special event passes. Plus, if you want special ships from events, that's more money. They also offer everything in Gacha format in addition to all this too. Guaranteed drops could run into the hundreds of dollars for a single ship.\n\nThe Christmas crates used to be good. They ruined them for 2025, I'm no longer actively putting additional $$$ into the game because of the way they've slowly sucked out any real event that greatly benefits players for the holiday. Keep getting less and less for the same amount of investment. It just doesn't hit right. \n\nGood luck WG!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoy the fact that the content makers have absolutely no interest/regard for their player base....then play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "RNG game, still one of the worst games ever. Amazed how it's lasted this many years and people enjoy it. Maybe you will too?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's fun if you have been playing for 900 years.  Otherwise legit don't bother",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game can be really fun sometimes but the microtransaction slop killed it for me.\n\n4/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was built, balanced, and designed around that wear tails. \nThe entire balance discussion is nothing but an echo chamber resonated by mods, devs, and community. \n\nDo not waste your time./",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Apparently enemy players can hit you but you aren't allowed to hit them, even with good aiming. Targeting is bugged and needs to be improved.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute garbage. The dev team should be ashamed of themselves for working on such worthless, pay to win, slop. It is truly insane how the odds are genuinely stacked against anyone who plays for free, while players who spend hundreds of dollars reign supreme in every single encounter. Just met a cruiser that was tier 9 while i was tier 7 and their main guns were reloaded fully every 5 seconds. That is simply not fair and not even plausible. My cruiser was reloading every 20 seconds and battleships on average reload every 25-30 seconds. Not to mention being matched up with players who have been whales on this game for 10 fucking years and they never miss a shot. Don't even get me started on the crashing of my computer by this game and possibly even hacker interference.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring and suck",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is very good. In the one match that I have played, I loved it!\nBut there's one problem tanking all of it. I can't log out. So, I joined mostly because of TheRussianBadgers video, and I would love to kill people in the USS Lobsterminator but, I created my account on Steam, not on their website, so I can't use his referral code and once you make a account, you can't use a code. (to the best of my knowledge) So I just needed to sign out right! right...\nYOU CANT F**KING SIGN OUT. I DOWNLOADED THIS 86 GIGABYTE GAME, WHICH ISNT SMALL FOR ME TAKING 3 HOURS 2 TIMES TRYING TO SIGN OUT AND I HAVE PRETTY GOOD INTERNET TOO.\nWell, you can sign out, by unlinking your Steam account from the Wargaming account and linking a different account, but I already tried to delete it (which gives you a month to restore it) so I canceled it and now I'm waiting a day, on the dot, for me to have the account restored to unlink it and delete it, and I can't just log in while it's being restored/deleted, it just says that it can't connect to the server.\n\nNow, why don't I fix this by installing the client? Well, I use Linux (\"Because F*ck 'em that's why.\") and it's not on here, and I don't want to spin up Wine, Lutris, Windows, or another Steam account. (\"Because lazy that's why.\")\n\nSo that's the limbo I'm in. I love the game, but can't sign out to use a referral code and need to wait a day to unlink and delete my account.\n\nBut through all of this, remember, I did say it is a good game and I do recommend you try it out! I'm just trauma dumping on you about my account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I KEEP GETTING GIGED FOR THERE SERVER CRASHING WTF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "expensive PayToWin game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TTK takes donkey years. Extremely slow paced.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fucking worst game ever",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do NOT waste your time or money on this absolute POS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Remove sub and CV from this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice game, i will play it again !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Predatory.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "be ready to grind..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when i go to exit, its stuck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Pirate Ships",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its a pay to win money pit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very bugged",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Matchmaking its horrible ! ! !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "whattheheellyy",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ew",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To all the players of World of Warships,\n\nI believe everyone has noticed the recent changes in the in-game economy, whether it's for anniversary celebration,plot battle,random battle,special modes,dockyard,battle pass,sequential bundles or armory. Wargaming is continuously pushing the boundaries and testing the limits of its players. If you are familiar with the game \"War Thunder,\" you probably know the consequences when game developers constantly provoke their player base. As players of this game, we contribute to its activity, and in theory, Wargaming should appreciate each and every one of us who continues to support and encourage this game. However, Wargaming keeps pushing the boundaries and exploiting each and every one of us. This recent eighth anniversary is not just a simple anniversary, Wargaming is gradually making it clear that if you don't pay for this game, you don't deserve to play it.\n\nI implore every player here to bravely stand up and resist this behavior. Wargaming has now infringed upon our rights as players, and we cannot, and should not, let Wargaming continue to exploit us in the future. It is time for us players to unite and stand together. We should be a collective, a class, opposing Wargaming's exploitation and oppression towards us. We are here to enjoy this game, to find joy in it, and we should not be working for Wargaming.\n\nI hope that each player will save and spread this message. This post will undoubtedly be deleted, but we should copy it, share it, on any platform, anywhere that allows us to make our voices heard. Fellow warriors, let's fight for our future. Stay strong!\n\nStop recharging,leave your criticism!",
      "voted_up": false,
      "votes_helpful": 149
    },
    {
      "review": "I have been a fan of World of Warships for ten years. It is a true gem, telling the story of naval fleets and warships, allowing players to dream and admire the art and engineering of these incredible vessels. Since childhood, I have been fascinated by the navy, and for me, World of Warships was a true discovery — a whole new world where I got lost for many years. I loved studying ships and their history, and when the game first appeared, I registered almost from its very birth. Immersing myself in this world of history and adventure was magical.\r\n\r\nOver time, however, the game began to decline — slowly but steadily. This became especially noticeable after the complete move to the European server. Numerous inconveniences appeared. For example, in certain battle types — cooperative and asymmetric — players using destroyers and cruisers often have an advantage, while others face difficulties. The balance is disrupted, and instead of simply enjoying naval battles, players are forced to select specific ships and use special mechanics just to keep up. This partially applies to random battles as well.\r\n\r\nProblems also appeared with the Support Center. There were inconsistencies in information about gift and loot boxes — for example, regarding the chances of receiving ships or valuable items. The developers partially addressed this by showing how many boxes are needed before a guaranteed ship drop. Yet the inconveniences remain. Previously, responses to inquiries came almost the same day; now it can take weeks. And even when a reply arrives, it is often purely formal — it does not reveal the essence of the issue, does not take the specific situation into account, and does not lead to a solution. Many issues remain unchanged.\r\n\r\nAs a lover of history — especially the history of the German navy — I owned almost all German ships available in the game. Many of them I purchased with real money to complete my collection. In addition, I bought many other ships — those I liked, that had historical significance, or that were designed with care and imagination. And now, though it pains me, I realize it is time to free myself from this pleasant addiction and part with all of it.\r\n\r\nToday, the game no longer considers the interests of veteran players who have supported it for years. It has lost its customer-oriented nature. World of Warships calls itself free-to-play, but the pressure to spend is growing — and the costs are higher. Even my long-term premium subscription now offers far fewer benefits than before.\r\n\r\nAll these factors have led me to one conclusion: after ten years, I understand that the game has run its course. I would like to say “thank you,” but, alas, I cannot. Those who do not change — who stop listening and evolving — are destined to fade into oblivion.\r\n\r\nYet I remain sincerely grateful to the people — the original team — who created this game. My deepest gratitude and respect to everyone who gave life to this project. World of Warships is a remarkable and beautiful creation for true admirers of naval history and the fleet.\r\nBut to the current management, I must say: you are not professionals, and your actions are destroying the soul of this game.\r\n\r\nIt is time to free myself from this pleasant addiction. Farewell.",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "Playing on higher tiers is a financial trap. Instead of enjoying the ships you’ve been grinding for years, the system punishes you with massive maintenance costs. Even when you’re using a premium ship, one bad match and you end up in the red. Yes, you literally pay for the privilege of playing. That’s not motivation – that’s discouragement.\n\nPremium ships are not premium. They are supposed to make credits and be a reward for your investment, but the reality is that even with a ship you bought for real money, you can easily finish a game with minus 200k credits just because you got sunk early. That’s a joke.\n\nThe entire system is designed to force you to spend. Without a premium account, boosters, or permanent camo, playing on higher tiers is practically unsustainable. The game pushes you to either pay or grind endlessly on lower tiers just to afford a few games at T9–T10-*\n\nWG exploits players. Instead of rewarding time and skill, they tuned the economy so that even after a decent performance you often don’t earn as much as you should. This is intentional, not a mistake. And you can feel it in every battle.",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "Between Steam and non-steam version, I probably have close to a 1000 hours (over 259 hours on Steam at the time of writing). This used to be a great game, because devs actually did something about toxic players, afkers, bots, etc. Premium ships were inferior to tech tree ships and most of microtransactions were cosmetic. This was very different from World of Tanks in that regard. These days, it's just a dead version of World of Tanks. Premiums ships rule all tiers and they sell ship packages for over $200 USD. Game is ridden with low population and when you do get a full game, it's full of griefers and afkers. The core gameplay is fun, which is why it's so upsetting.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "The game is fun and has great graphics like World of Tanks. Unfortunately the game is ruined by ridiculous exp/level grind, even more ridiculous than World of Tanks, and has outdated gambling boxes *cough* sorry \"loot boxes\". This has also led to a horribly low player count that is so low I only ended up playing against bots EVERY SINGLE GAME for three hours. This game is horribly managed: stay away until they get their act together.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "Let's start with the positives about this game:\r\n- It's a beautiful, unique and simple basics but hard to master -type of game.\r\n- A lot of ships, every one of them requires some hours to understand them fully.\r\n- Game is still kicking after 10 years with above 30k daily players across NA/EU and maybe ASIA servers (?)\r\n\r\nUnfortunately we have A LOT of bad things to say about the game:\r\n- The community is very toxic, flaming and \"I am better than you!\" You are not allowed to make a mistake as a new player or as a veteran player. If you don't play accordingly, you get venom all over your face.\r\n- There is a karma system; you can +1 or -1 anybody you recently played with. A very toxic system and abused by many, because the enemy can also +1/-1 you, even if you had a fantastic game.\r\n- The game is f2p, yes. But actually only in the first couple of months. Then you will realize it's a game that needs monthly fees to maintain ingame currency and upgrades. Of course, a f2p game has to have ways to earn money, servers aren't cheap and you have to pay the salary of your team that create content for us the players.\r\n- The game can make you a gamble addict if you are not careful, there are loot boxes that can be purchased with ingame currency but also real money. Please stay strong and don't get sucked dry :)\r\n\r\nAt this point I cannot think of more positive/negative points so I'll leave the comments box open for other players to add.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "dont ever play this is full of bots and gambling and fucking over the customer",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "you get on to play a fun game only to be out matched every time. fighting t9 t10 when your always below. you will always lose. not fun not worth playing above t5 now. Get subs and mess with people, not worth spending money.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I played this game for quite a while.\n\nI liked it a lot, but as time went on, Wargaming seemed keen on scraping the bottom of the barrel labeled \"Box O' Gimmicks\".\n\nAnd trust me, I was fairly resilient to the constant change the game's meta had. I thought Aircraft carriers were OK, just needed some work. Submarines... were implemented terribly, with an insane degree of arcade-y feel to them.\n\nBut everyone has something that was \"The Last Straw\" when it comes to leaving this game.\n\nFor me, that was Superships, AKA Tier 11.\n\nUnderstand that world of warships has a degree of arcade feel and historical source material, that is attempted to be balanced on a razor's edge, an edge that got finer as time went on. I feel the arcade feel is warranted, as otherwise we would have the snooze fest that is War Thunder's Naval mode (not to mention bigger = better). However, as Wargaming proceeds to scrape the Box O' Gimmicks barrel, the scale of arcade vs historical \"feeling\" tips too far to arcade-y.\n\nThat is what superships introduced. Ultimately for me, it was Burst Fire that broke it for me. How the hell does a fictional late 40s, early 50's paper ship design magically fire salvo after salvo, with a second interval between them? The answer? They can't! Only modern systems can achieve that, not designs rooted in late 40's, early 50's.\n\nThis is what shattered the fun for me. Which leads to the next point: Economy.\n\nI spent so much time grinding for tier IX and X ships. And then they add superships so bored veterans with a bottomless supply of credits can just play a overpowered ship that has the infamous F-Key or colloquially known as \"The Funny Button\". Be it the impossible burst fire mechanic or \"I have magic dispersion on THIS salvo, you are guaranteed to DIE\". So I grind my tier IX ship, that faces these dumb superships and just get dumpstered if it's not a meta ship for tier IX. This was before the gap between tier IX and X wasn't so large.\n\nThe economy in general is just garbage. You HAVE to have premium time if you want to grind in any meaningful amount of time, and it's not just for XP, it's for credits! If I wanted to buy all my tier IX and X ships, I would legit need like multi-million amount of credits to do so. This is another reason I stopped playing because I was getting so tired of just playing Kii that had a special camo (now eco-bonus) that gave extra credits, making it one of the most efficient credit farmers beyond any lucky person that has Missouri before it went off sale. It gets real boring when I have to essentially play the same ship for probably 200 battles to get ~200 million odd credits I need to get all my tier IX & ships BEFORE upgrades.\n\nI had to stop myself from buying credits outright because I was getting so tired of grinding credits, and once I dropped cold hard cash just for credits, I asked myself, \"What the hell am I doing spending 100$ for the ability to buy like maybe 3 top tier ships??\" There are other monetary problems with this game, such as FOMO tactics, delayed releases of ships outside bundles (seriously, when was the last time they released a new premium that WASN'T first part of a bundle?!), and how some ships are just not available anymore, and can only be gambled for in santa crate boxes.\n\nThis game has a great amount of love put into in some areas, be it the ship models, the Original Game Soundtrack (Artur Tokhtash is the GOAT!!), and so on. I really liked dockyard modes, it felt meaningful to grind and complete missions to get new pieces to your ship. The gameplay loop is solid... when steamrolls don't occur. The classes interact with eachother mostly in a balanced manner.\n\nThere was a lot to love, but this game has just gotten worse and worse, more and more arcade-y, all in the endless pursuit to scrap more gunk out of the bottom of the barrel labeled \"Box O' Gimmicks\".\n\nMaybe one day Wargaming can do something to course correct, but as it stands, I cannot bear playing this game anymore.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Unplayable on weekends. You will get teammates that are so unbelievably bad you will lose easy PVE missions which will cost you ingame currency that you will have to earn back, so you can play your ship again.\n\nAnd how come there is almost never more coal in the container if I choose \"more coal\"?\n\nThere is just no end to the ways in which this game tries to waste your time. Just don't do it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game has me so angry with disconnects, crashes, whatever you call them.  I've never had issues like this before i've tried playing with steam, without steam and same thing happens.  i used pingplotter and it says the IP is in chicago which is right next door to me, and it says my connection is dropped on your end, fix your network wargaming! and people report you for afk gaming which is crap!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "At the moment, I do not recommend the game.\nI would only recommend it if you genuinely enjoy naval combat, ships, and the WWII aesthetic and you have no intention of falling into the gacha loop or the pressure of “playing to win.”\nIf your goal is simply to enjoy the battles, take the game lightly, and play free-to-play because you like the ships or the era, then yes — you can still have fun.\nI’ve been a player for over eight years, even before the Steam release, and I’ve witnessed many stages of the game: its evolution… and its degeneration.\n\n➤ The main issue: the gacha model\n\nA few years ago, the game introduced a business model based on loot boxes, random rolls, and probability systems.\nThis completely changed the experience:\n\nIt’s no longer just paying for a ship.\nNow it introduces anxiety, bundles, odds, and the illusion of obtaining something valuable.\nShips have become excuses to generate spending, more than actual content.\n\nWhile there is some generosity toward free-to-play players, that generosity is completely tied to profit.\nThey cannot be “too generous” unless revenue stays high — and it shows.\n\n➤ The rarity system reinforces the gacha feeling\n\nThe game also added a rarity-based ship classification system, depending on how frequently ships appear or how difficult they are to obtain. The categories go from Common to Legendary:\n\nCommon (gray): standard tech-tree ships\nUncommon (green): often premium or shop ships\nRare (blue): usually Research Bureau ships or ships obtained with coal or steel\nEpic (orange): time-limited ships; very difficult or expensive to obtain\nLegendary (yellow): extremely rare; I own none, and the Captain’s Logbook only shows two legendary ships in total\n\nThis system shifts the focus from gameplay to collection pressure, encouraging investment based on scarcity more than value.\n\n➤ Game balance: certain ships dominate ranked\n\nThe variety of ships and playstyles has always been one of the game’s strongest points.\nHowever, lately I’ve noticed bad players performing well simply because the ships they use are overly strong, especially:\n\nPan-American battleships\nGerman alternate cruisers\n\nIn Random Battles, the balance is still somewhat acceptable due to larger team sizes (12 vs 12).\nBut in Ranked Battles, any ship from these lines heavily tilts the match, and if a skilled player is behind them, the difference becomes overwhelming.\n\n➤ The deeper issue: the psychology of PvP\n\nIn any PvP game, players ultimately want to win.\nSo when a ship becomes S-tier — whether premium, special, epic, or part of a tech tree — many players choose it simply because it increases their chances of victory.\n\nBut when everyone gravitates toward the same S-tier ships, the game stops being about skill and becomes a race to pick the strongest tool.\nThis creates a meta where diversity disappears and the experience becomes unbalanced and predictable.\n\nThe dangerous part is that players often don’t even realize this is happening.\nThey think they are “just playing to win,” while the entire environment is being shaped around a handful of overtuned ships that distort the whole match experience.\n\nAnd the developers likely understand this dynamic.\nIf an overpowered ship generates revenue, the cycle repeats:\n\nA new strong ship appears\nPlayers rush to get it\nThe meta breaks\nThe next strong ship is released\nThe loop continues\nThis self-reinforcing cycle benefits monetization at the expense of balance.\n\nThere are also other game modes that can be enjoyable for casual play, farming missions, or playing with friends, such as Operations and the occasional Asymmetric Battles. These modes still offer some fun and variety outside the main gameplay loop.\n\n➤ Naval variety: its biggest strength… with a big “but”\n\nThe game includes real historical ships, prototypes, and ships that never existed.\nEach nation has its own mechanics and identity, and some hybrid concepts are genuinely interesting.\n\nBut one thing ruins part of the experience:\nit doesn’t feel good to play a real historical ship and get destroyed by a design that never existed, especially when that fictional ship is clearly superior for commercial reasons.\n\nYes, many ships are free-to-play friendly and obtainable with steel or coal — and that remains one of the best aspects of the game.\nBut even this gets overshadowed by the greed behind bundles and the gacha system.\n\n➤ Gameplay mechanics that no longer maintain even the illusion of realism\n\nThe game was never fully realistic, but it used to maintain a coherent naval atmosphere.\nThat illusion breaks when mechanics such as these appear:\n\nCruisers and destroyers launching bomber planes\nAbilities that contradict traditional naval logic\n\nThese mechanics completely break immersion.\n\n➤ FOMO and psychological pressure\n\nMany events and limited ships rely heavily on FOMO (fear of missing out).\nThis encourages quick purchases, impulsive decisions, and the constant feeling that you’re always “missing” something important.\nShip collectors are especially vulnerable.\n\nFor this reason, I do not recommend spending money on a game that relies more on illusions and psychological pressure than genuine value.\n\n➤ In the end, what matters is not what the game offers, but what you expect from it.\nThe experience depends less on the game and more on what you seek inside it.\n\nAre you playing the game… or is the game playing you?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Extremy greedy company, community managers dont know what PR even mean.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Overall the base game is well done and super fun to play. The depth of the mechanics and the variety of the ships all make for hours and hours of interesting and fun play. Where it all goes south is the everything outside of the battles. The developers do a really poor job at making the missions easy to understand and to make matters worse players cannot pick the type of map they wish to play making accomplishing many of the missions unnecessarily long and painful as some map types make it impossible to achieve the mission goals and you cannot simply quit out and pick a new match hoping to get a map that works for the mission requirements. Player support is almost non-existent. I could write a page on how poorly this team is at answering support questions but it takes weeks and weeks to get anything resolved if you're lucky. It's free to play so enjoy the game play but I wouldn't recommend spending money on it and I would definitely NOT recommend recruiting friends to the game because the recruiting part is poorly explained and broken most of the time and the devs will not go back and give you credit for recruiting them if the recruiting link didn't work (which it usually doesn't)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Please do not get into this game.\n\nIt is so unbelievably terrible in almost every way possible. Everything is built from the ground up, it seems, to be as irritating and rage inducing as it can be. There are so many aspects of this game that don't work as intended and are down right broken (I won't go into detail as people reading this who have not played before wont understand). There are bugs in this game that have been there from the start ... ten years ago. Every new thing added to the game is designed to extract as much money from you with as little effort from the devs and benefit to you or your account as possible. \n\nin conclusion this just any other \"free to play\" money grab with the only difference being that it has ships.  Which blows because I love ships and have sunk a ton of hours into this game over six years. I can and will say with confidence that all that time and the time that I will still put into this game (because its sadly  one of the only games like it) has and will be wasted. \n\nThank you for reading and I really hope this has given you some insight into the true nature of this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "to much push to pay. nickle and diming players at every point.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A great game made by programmers, art designers, and community content creators with love, but is currently ruined by ill sales team who fights for taking away as much free component of the game as possible from the players and always desires to see the players hurt TWICE by the mistakes made by the team. It is so sad that I see no care for the players from this game I loved, despite so many great content, updates, and events.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is a grinding/farming game if you play it F2P. If you love gadgets and skins and putting money into it, will be ok for you. I want it free? no. But you can ask for a monthly fee and that be it. But they manage the game mechanics, buffing and nerfing at will. So simply you loose interest after some time. and gets boring. Doesnt matter if you dress the ship of Dua Lipa, you wont get people more interested,",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has guns and ships.\r\nIt also has two types of ships where you cant use your guns, carriers and submarines.\r\nI would not recommend this to anyone.\r\n\r\nPredatory monetisation, and the fact you cannot play ranked with your friends is just a bonus.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Terrible matchmaking, heavily team reliant game but everyone only cares about his own score and not winning the game or helping the team, every new ship is more broken than the previous with new gimmicks and heavy rng based",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "normally the game is fine, but when the servers lag-out and you loose all control over your ship, you'll get punished because of \"idle during battle\" or \"leaving battle early\".\r\n\r\nThe graphics are great, but you are limited by the amount of fun you \"may\" have, until you pay cash for in-game items.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game, but fueled by pay to win and by bots from certain Countries......\r\nSuch a shame we live in this bs world",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "World of Warships gameplay hasn't changed much in 10 years.  Wargaming has instead decided to focus on lootboxes, tokens to obfuscate gambling mechanics, and re-skinned ships that can be pumped out with almost no effort.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "An absolutely terrible experience. WG clearly has no idea how to run a game—simply put, this is the most player-disrespecting game I’ve ever played. WG acts like they’re doing players a favor just by letting us play. Any slightly decent reward feels like a bloody fortune to them, while what other games consider basic benefits, WG treats as some incredibly generous act—like we should be groveling with gratitude.\n\nAnd this redemption code incident is utterly disgusting. It was clearly WG’s own mistake, yet they had the guts to sound all high and mighty, blaming players for \"taking advantage,\"  then went ahead and revoked half-completed missions as if those measly rewards were worth some insane amount.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I played the game happily for over 300 hours. I quit due to frustrating bugs, penalties, and the fact that communicating with the management is pointless and difficult. The penalty system needs to change. It's better not to play a game that punishes its players for game's own bugs... especially when there are tons of other great games out there.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}