{
  "positive": [
    {
      "review": "Well now what can I say, I had a great experience playing this game, I was there from the beginning. What I love about this game is you can kind of write your own galactic story such as what fronts you fought on, who with, what major orders you volunteered for and so fourth. I just remember running around the creek with an anti material rifle on just hard difficulty not knowing wtf I was in for lol Met some cool divers and ended up part of a larger helpful community called the Hell Crusaders on discord so shout out to them. This games visuals and sounds are beautiful, I'm a huge fan of PvE work together type games so this ticked all my boxes. My only gripe with this game is when you hit level 150 and upgrade your ship fully collecting samples and all that gets overlooked, I suppose all your xp goes towards the galactic front as a whole but even being able to prestige or customise your ship with decorations for hitting certain kill counts would be nice. I have stopped playing because I've nothing really left to get but grind super credits for the new warbond and that is a boring cycle. \n\nRemember friendly fire isn't :)",
      "voted_up": true,
      "votes_helpful": 67
    },
    {
      "review": "Helldivers 2 is a great game, but one that you should start slow. if someone tells you to jump to level 3, tell them to eat dirt. Start level 1 or 2, earn in-game credits. Use credits as you level up to unlock anti-tank-capable weapons and strategems, and get permanent character upgrades known as ship modules. Slowly progress through leveling up, and trying harder mission levels. Also, I strongly recommend binding stim heals and strategem code entering buttons to your 2 mouse side buttons. The nice thing is that you don't feel forced to try hard levels. You can play it casually or go tryhard. It's your choice. Oh, and prepare to die a lot from silly things sometimes. ALSO you can't swim, don't touch water lmao.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "overall a solid experience it has its flaws but its a fun game nontheless.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Absolute Cinema! Sadly this game suffers from the \"It's joever and We're so back!\" Syndrom meaning that most of their new releases of content (warbonds or full expansions with missions and new biomes) are either amazing or bring a ton of bugs.. with some bigger hiccups especially on PC.. Optimization and Filesize has to be looked at and better solutions have to be found but overall a really cool game to play with your friends!\r\nSome advice for low-end pc users: if you have space on an SSD please put this game on it and you'll save quite a bit of space and patch time later when updates roll out!",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "The game is amazing, but the devs are not making it easy to enjoy the game and support them",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Edit: Didn't even leave this review for more than a month lol. While I still have some disagreement with their balancing \"methodology,\" I've personally felt some performance improvement and the file size is just *chefs kiss*. I still think it's important AH stop mucking around with balance so much, but as long as I can enjoy the game I'll happily bear with it.  \n\nOriginal bellow:\n------\nLeaving this review to voice frustration in the balance patches and performance issues.\n\nGame is great and has added a lot of depth over the time. Weapon customization and other feature changes are quite meaningful. We have honestly gotten a lot since launch.\n\nThe updates have consistently made core gameplay more tedious as opposed to more difficult. We've seen the addition of less interesting enemies (less agency in killing them), changing older existing enemies similarly (aka broad weapon nerfs), performance degradation/crashes, and more nerfs. I'm sure I probably forgot some nerfs.\n\nClear weapon nerfs used to be rampant but are now being guised through enemy changes. Increased dmg doesn't mean anything if enemies have more HP.\n\nIf AH can fix either the performance issues or annoying balancing, I'd probably recommend. Ideally both should be addressed, but as of now, it's a general and sad no. I genuinely believe older versions of this game would be more enjoyable than it is currently and have no idea why they feel the need to balance this more often than some hyper-competetive shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helldivers 2 is a fantastic 3rd-person shooter that keeps me coming back for more. It features a ton of cool guns and 3 different factions worth of enemies to shoot at. It can be played solo, and I have a lot of fun playing it with my friends. The game's atmosphere and gameplay allows for a lot of cinematic and hilarious moments.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Blast bugs and robots in very satisfying ways with a large variety of weapons and explosive perks on many different planets accomplishing a diverse set of objectives along the way with a squad of friends.\nThe game looks great with all the different planets and enemy types being well detailed and the audio is also well done especially when all hell breaks loose and it sounds like a warzone.\nWith a different perspective from its predecessor and with regular content updates Helldivers 2 is an absolute blast to play with friends and will keep you occupied for a very long time.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Helldivers 2 was already a rock-solid game, but the recent update that shrank its install size from roughly 150 GB to around 30 GB deserves huge praise. This level of optimization should be an example for other developers—massive 150+ GB games should not be the standard. The team behind Helldivers 2 showed that with proper effort, great performance and reasonable file sizes can go hand in hand. Outstanding patriotism!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly very fun game, especially if you support freedom of speech, democracy etc. \n\nLots of different builds and stratagems to choose from, much fun seriously!\n\nIf I may suggest the most fun build in my opinion ofc \n- light armor cuz of speed (perhaps one that lowers recoil whilst crouching), \n- autocannon (you can kill almost everything with it)\n- some pistol\n- grenade (impact vs robots, flame vs bugs)\n- stratagems obviously depend on different factors but I almost always get: 500gk (ofc), orbital laser, orbital railcannon, napalm (vs bugs), orbital smoke (vs bots), autocannon obviously\n\nHaven't played much against Illuminati tho, so not sure whether build fits, but can't miss much with autocannon (ba dum ts)\n\nI do not play it all the time but obviously keep coming back, perfect game to zone out.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Immersive game, very fun with friends, still being updated with new content.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "At first I wasn't all that crazy about this game till my buds kept pestering me to pick it up and play it with em\n\nSo I picked it up, played some sessions with em... and I am hooked\n\nThis game plays greats, the weapons sounds and feel amazing, defeating enemies feels great, and tons of armor that will fit your play style\n\nPlus playing with randos been pretty fun too, most I play with been pretty chill and awesome\n\nI highly recommend this",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "They finally optimized their storage, it went from 130GBs+ to barely 25GBs, best update ever now",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I wrote it for newcomers who are thinking about buying this game; for the Skull Admirals it’s obvious.\n\nWhat I wanna say first: it’s literally a “bugged” and badly optimized game. I put the word “bugged” in quotes because the bugs aren't that big, like:\n- After ragdoll, you can fly away and get stuck in stones, trees, whatever, and cannot get out until you get shot, eaten, or kill yourself.\n- The mission stratagem can get stuck on the Hivelord and you cannot call another one. This can happen very rarely, even once in a thousand — and yes, I’m that lucky one).\n- When you’re on the extraction point, Pelican-1 can fall under the textures, land in another place, or land vertically, and you cannot get in.\n- Broken character arm animations, sound problems, falling under textures, and so on.\nExcept for one issue that annoys me: when you play in one session with friends and you’re on the Destroyer (the ship), sometimes you can encounter connection problems — “Connection timeout” or “Connection to server failed.” Now it’s more stable, but sometimes it still happens.\n\nBut the biggest problem is the optimization, especially CPU-wise. Some campaigns, planets, and fights put a lot of load on the processor. FPS go down or the game can freeze during a match and you cannot do anything — only a restart can help. Don’t get me wrong, my hardware is not bad:\nIntel Core i7-13650HX\nNVIDIA GeForce RTX 4060 8GB\nRAM DDR5 24GB\nGame was installed on SSD\nI don’t wanna make an article about that — you can find more on the Internet, there are people who describe this better than me.\n\nBUT still, it’s one of the best games that can entertain you (of course, if you aren’t afraid your CPU will burn). The game rots if you’re playing solo — instead, it shines when you play with friends. Missions get chaotic: waves of enemies, heavy weapons, explosions, friendly-fire accidents.\nI think it’s more fun if you get shot by a friend’s turret (and not just one DAMN TIME per round) or when your teammate revive you on mine fields with a sarcastic phrase, quote: \n\"Welcome to rice fields motherf*cker\". \nIt’s more fun if a swarm of bugs chases your friend and you call a 500KG bomb on his side, killing the swarm with him — after which he’ll curse you while you laugh and much more funny moments. Yeah, I described how I spent my time in this game. \n\nAnother virtue I wanna mention is that the game is maintained all the time. Developers keep in touch with players, listen to our suggestions and ideas, and interesting ones they even implement. If developers continue this way, Helldivers 2 will be a great game, but right now it still needs optimization improvements — and big ones.\n\nI give a thumbs up because I’ve had a good experience with it. Do I recommend this game? I’d say wait with the purchase.\n\nFor Democracy. For Liberty. For Super Earth.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good little action game. A bit difficult to start, but the player base is good at helping people. Combat is action packed, quite varied given the possibilities of different play styles, and overall good fun. One thing to note, the difficulty level plays a huge role in the feel of a run. If you are getting board because runs are too easy, just go up in difficulty. The dynamics change quickly to intense and difficult combat. I joined a bit late, but still jump on daily for a few runs.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "[i]This review has been changed (full rewrite) from negative to positive as of December 3, 2025.[/i]\n\nIn [url=https://store.steampowered.com/news/app/553850/view/491583942944621274?]yesterday's patch[/url], many of the issues I raised in my original review are actively being addressed—enough so that I think it warrants me revising my review, as I said I would.\n\nPerhaps the most important part of this update has been the [b]game size reduction[/b]. Today the game is roughly 154 GB by default, however, you can now [url=https://store.steampowered.com/news/app/553850/view/491583942944621371]opt into an experimental branch[/url] that will reduce the size to around [b]23 GB[/b] (which I believe is about a third of the size the game [i]launched[/i] as).\n\nThis is a [i]massive[/i] step in the right direction as far as I'm concerned, on top of other long-standing issues they're addressing, such as performance and scopes (things I mentioned in the previous review). The game is not perfect, of course, and I still have several gripes. For me, the important part is that I believe Arrowhead is showing themselves to be taking many of the community's concerns more seriously than before, and their prioritization appears to be improving.\n\nI'm cautiously optimistic, but optimistic nonetheless. If the state of the game regresses into a worse state (as it is infamous for doing), I may have to update this review again, but hopefully we continue seeing the improvements. As I've said prior, I want to see this game do well, so props to Arrowhead (and Nixxes) for getting us closer to that.\n\n[h2]Review History[/h2]\n[table]\n[tr]\n[th]Recommend[/th]\n[th]Helpful[/th]\n[th]Funny[/th]\n[th]From[/th]\n[th]Until[/th]\n[/tr]\n[tr]\n[td]Negative[/td]\n[td]1,775[/td]\n[td]41[/td]\n[td]November 16, 2025[/td]\n[td]December 3, 2025[/td]\n[/tr]\n[/table]",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I don´t know how but it is very very hard and pretty damn fun at the same time. The only Issue I face is the very slow progression through out the Levels. Gathering the supplies to upgrade your ship and weapons is taking actually ages.\n\nBut despite that: surely an 8/10, highly recommending this game. Thus I have to add: play it with a friend. Singleplayer or with randoms has it´s charm, but it will lift your experience totally up to a different level when playing with two or even three friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At the current time I'm writing a review of the game Arrowhead is making an effort to patch out all the bugs and issues currently ongoing that affect the performance of the game. In it's current state the game is still playable though so it's not like it's struggling that badly.\n\nHow does the actual game fare?\n\nFor someone wanting to play PVE game with their friends or random people? The game is great! I do recommend you give it a shot if the aesthetics of the game appeal to you. For the most part the community is positive and people seem to enjoy the roleplay aspect of it to the point where it has rubbed off on me as well. The weapon and strategem balance is varied enough for you to roleplay certain builds just don't expect most combinations to work as well at the max difficulty.\n\nArt direction is pretty amazing, skyboxes and weather feel so immersive and cinematic, customisation though in terms of visual look and ship aesthetics are standard across all players, you only get a different Democracy officer and aesthetic changes based on ship upgrades. Perhaps something might change in the future. \n\nAll the premium content can be accessed for free however which is great, because plenty of premium weapons and upgrades are fun to use on enemies and the grind to get the content isn't made painful, especially if you have friends to help out. It is at least obtainable, that I count as another positive as well. \n\nGet the game on special if you want to try it out, or definitely get it if you really want to try it, there's always people online and the community is very welcoming to new players.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game strikes the right balance between challenging but silly and fun. The tongue-in-cheek live service narrative is hilarious to experience. New content and updates are constantly being added to the game to keep it fresh and fun to keep dropping in with your friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I do love burning my personal democratic ideas and values into other species by force, fire and literal hell.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Probably the only game I can join a game, land, instantly die, and laugh about it; just to do it again and still laugh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly this game is a must buy for someone who enjoys freedom, democracy, and liberty.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Helldivers 2 is, at its core, a fantastic game. The moment-to-moment gameplay is thrilling, the cooperative mechanics are tight, and the presentation captures the spirit of chaotic camaraderie better than most. But despite this strong foundation, it’s hard to ignore that the game is being held back by a lack of long-term, meaningful content — and a concerning trend of scaled-back offerings in recent warbonds.\r\n\r\nThe cadence of updates is sluggish. Months pass between meaningful additions, and when they do arrive, they often lack the depth or staying power to keep the player base engaged for long. A few new weapons or cosmetics aren’t enough to sustain interest when deeper progression systems remain underdeveloped.\r\n\r\nWhat Helldivers 2 desperately needs is a shift in focus toward lasting progression and enhanced player agency. A perfect opportunity for this lies in the long-teased attachment system. By fully realizing this feature — and offering a broad selection of attachments that can be freely applied across weapon types — the game could open the door to creative, personalized builds. Let players experiment. Let them make wild, even ridiculous loadouts and find what works best for their squad.\r\n\r\nEven better, tie these attachments into the existing resource economy. Give players a reason to keep grinding samples and requisition slips — not for more throwaway gear, but for unlocks that meaningfully expand their tactical options. This kind of system would echo the rewarding progression loop from the first game, giving players real goals to chase and builds to refine.\r\n\r\nHelldivers 2 has all the potential in the world. With deeper systems and more consistent content delivery, it could go from great to legendary. Right now, though, it risks burning out its most loyal players before it gets there.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I wasnt that excited about Helldivers 2 when it came out. I didn't even heard about Helldivers 1 exisists. Then, Sony decided to make their sh*tty PSN to play game and after they were beated by the Righteous Hand Of Community, but Sony still being d*cks to others, so they've just deleted game from over 100 countries. \n\nIt was April 2025 when i bought a key of HD2 and that was the most expensive game in my account, but, also, that was the best waste of 20$ u could've made. At start, i liked the game, but it's just don't hit me, like i wanted to play alone, without friends. There's also my sh*tty-ass old GPU (1650 4gb) that made game lag af. On some [i]\"dedicated\"[/i] areas of the map my FPS dropped to stable [b]8[/b]! Espescially on Automatons.\n\n[h1]Factions[/h1]\n\nBugs are fun because i love that feeling, when you just shooting down these motherf*ckers. Extra dopamine appears when you killing a horde of bugs with one (or a few) big explosions and that feels awesome (Bugs 10/10). Automatons is the front where i get my first PTSD. When playing on a D10, this's really feels like war - unfair, scary and the only thing you feel when meeting face to face with Factory Strider is numb. If you ever played some of Battlefield or Squad you'll get flashbacks (Automatons 9/10). Illuminates are simple creatures actually, but that [i]vibe[/i] of [i]aliens[/i]. Wooh, i like it. Illuminates somewhere between war-like Automatons and hordes of pretty similar Terminids. They were boring, but after that one Patch, that changed the game to before and  after, made Illuminates also a good faction (Illuminates 8/10).\n\n[h1]Gameplay[/h1]\n\nGameplay can be described in one word: Cinema. For a basic arsenal (primary, secondary, throwable, support weapon, backpack) they made thing, that i've never seen before and this is sick. Allowing to player to call Orbital Strikes and so called \"Eagle-1's\" strikes is what i like the most. Imagine, seeing a bunch of bugs, for example, and throwing at them thing, that calls a 500KG of [b]Managed Democracy[/b] right one their heads! Shooting system is also pretty unique and god, it feels amazing. \n\n[h1]Visuals[/h1]\n\nThis is one of the most Beautiful games i've ever played. After a GPU update, i can afford myself to play on pretty high-quality settings and sometimes i just stand and looking around, thinking, how cool it looks. And the explosions are especially satisfying. \n\n[h3]You should buy this game... Right Now! Sya in fight, Helldiver.[/h3]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Low graphical settings being required and any terminid planets are some negative aspects. But goddamn if bringing manifest democracy to the galaxy isn't dangerously addictive.\r\n\r\nTell your friends, unlock the higher difficulties early; and try to also get some sunlight. \r\nOr not - good game though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is very fun, since no dive is really the same. Looking past the performance issues and focusing on the gameplay itself, it's…fine. Like most people say, the developers are smoking something. Constantly going from “We're so back” to “We're cooked” by constantly “fixing” things.\n\nBut I also want to highlight something. We're expecting a lot from a team the size of an office floor. Sure, not everything is good; their drama with some creators is unjust, but the internet is hella sensitive at times. At its core, it's fun. Really fun. We're all really impatient at times, and some people slander others for exactly that or spread hate on this game because they can't get new weapons right away.\n\nIf you like shooting, keeping your head on a swivel, and using different weapons while also being part of a greater narrative? This is for you. If you don't like having to actually play the game to unlock stuff, its core concept, or its many enemies, then this isn't for you. \n\nThis all applies if you can even play the game without it crashing, of course. I'm thankfully exempt from this issue, which is why I'm not commenting on it. Personally, I like it, since I had never seen this kind of genre before, and it re-lit my reason to play video games at all. It's so unique in a sense, since there's a bigger story at play, in which YOU matter and can take part in. It's refreshing to play without having to loot crap to make crap, like in other games. Actually being a part of some military force while fighting for actual options being presented by a game master is truly something unique. Rather than some loner with a backpack and a bandana or a dead guy fighting gods in an empty world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super Earth told me to kill my Roomba with a sledgehammer.\r\n\r\nThank you Arrowhead for fixing your game's size, respect.\r\n\r\n9/10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game But has to be played in a group, a lot more fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you enjoy spreading managed democracy and liberty for a better tomorrow, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, my main issue at this point with Helldivers 2 is that the remaining community seems like a bunch of insufferable arseholes. Either you fawn over the game to a blinkered degree or hate it with the heat of a thousand suns... yet stick around to bitch and moan... there doesn't seem to be much inbetween. I can only imagine how Arrowhead must feel at having a community that is so hot and cold over every little thing they do... how do they please a community that fundamentally doesn't want to be pleased.\n\nOther than that, the gameplay loop is entertaining enough, there's a fair amount of variety and opportunities for teamplay with friends... some areas could do with more depth, naturally. Hopefully it gets gradually filled out here rather than in a sequel, though I am rather late to the party.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the game's sometimes rough patches with questionable developer choices. I would still highly recommend this game. Helldivers rarely ever gets stale and there's decently constant updates in content and the still evolving story. Still very much worth the $40 USD however personally I would still grab it at a sale. Very fun with friends as well as queueing with randoms can be frustrating at times.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love killing bugs, other two factions are okay. The grind is real, but each game has unique challenges and different teamates that keep things....interesting!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Though in my opinion not as charming as the original Helldivers, Helldivers 2 brings the chaotic co-op action into 3D. retaining the silly deaths and big booms while introducing all new items in the form of weapons, stratagems, and enemies.  While often failing to keep the ever-present fear of death that Helldivers 1 had (not being locked onto the same screen as your teammates is the main contributor to this), 2 still sees many many many stupid, weird, and funny deaths.  Weapons feel satisfying to use, stratagems feel insanely powerful, and enemies are a pleasure to cut through with democratic ease.  The paid currency can be found in-game, meaning everything can be earned for free (and honestly the grind isn't all that bad).  The progression feels satisfying and unlocking a new item always gets me excited to try it out.  The voice acting is great.\r\nThe game is quite resource-intensive on my computer, but that's to be expected.  It occasionally loses frames for about a minute but then returns to normal gameplay for the rest of the mission.\r\nEnemy variety is awesome except for the Illuminate (still holding out hope that we'll see the original Illuminate return).  Bugs are satisfying to squish and burn and present a decent \"beginner\" faction to ease people into the game.  Bots provide a satisfying challenge (even if their aim sucks often) which feels like an actual fight should shit hit the fan, as it often does in Helldivers.  Illuminate are boring in my opinion, but hopefully they'll get fleshed out eventually with their old units.\r\nTeamwork is much less present in this game as compared to the previous (which forced teamwork by locking everyone to the same screen, resulting in many hilarious shenanigans).  Oftentimes everyone will run off on their own and clear the map, only ever asking for help for a certain point of interest that requires two players.  When you DO get a team that is willing to work together, though, oh boy...  It feels AWESOME.  Ripping and tearing through enemies, blowing stuff up with a democratic lack of prejudice, accidentally shooting your teammate with a machine gun because they dove into your line of fire.\r\nIt's an amazing game.  It could improve, but it is still very fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My friends might say that the Mortar turret is the worst stratagem to bring, however for me, it's the only one I need.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my go to games whenever i want to chill out and kick some ass. \n(Aswell as launching eagle strikes on my teammates at any minor inconvenience.)\nFor Super Earth, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game, especially when you have teammates who know what they are doing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2] Great game! [/h2]\n[hr][/hr]\nThe developers continue to support the game, add new content, and fix bugs. The community's feedback is always taken into consideration and is not ignored. \nOverall, despite mediocre optimization, this is an excellent shooter with a great gameplay experience and featuring tons of action, explosions, enemy guts, and democracy. \n[hr][/hr]\nDemocracy needs YOU. Enlist today, become a Hero, become a Legend, join The Helldivers\n[b] FOR SUPER EAAAAAARTH [/b]\n[hr][/hr]\n\n[spoiler] The review is sponsored by the Ministry of Truth [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game. Though the reinforcement algorithm still needs to be improved further, especially in some cave areas.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game plenty to do variety of interesting weapons gear honestly a must try",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I experienced oshuane,calypso,and malevolon creek. good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dev keep updating this game to make it better and better, even though there were some updates that made the game poor performance. Whatever we still need u all Helldivers for liberty!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good game, I kept playing after the story ended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good but needs commitment, there will be ups and downs but those will get fixed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Helldivers 2 is a masterpiece!\r\nThis game made me feel like i was in a movie.\r\nChaotic co-op shooter and incredibly fun.\r\nFOR DEMOCRACY!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you have seen the original Starship Troopers\" and liked its humor and over the top \"violence solves everything\", you will LOVE this game! This \"looter shooter\" is much different than Destiny2 (which I just moved off of) and love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game still manages to hold up very well despite being a live service game. Usually developers will abandon their project or slow down releases, but not Helldivers 2. Still plenty of content to consume.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best played with friends. Although, it sucks that you can't invite friends to your party here in Egypt and you have to run a VPN to bypass that shit but anyways, it's a great game nonetheless.\r\n\r\nFor democracy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never have I played a game that just felt so cool, nor have I since. This game is a cinematic masterpiece that will make you feel like your the star in an epic action movie. I would highly reccomend. Definitely better with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Atenção, Cidadão! Enquanto você perde tempo lendo análises na Steam, os inimigos da Liberdade avançam sobre nossas fronteiras! A maior vantagem de se juntar aos Helldivers não é a diversão, mas a honra inigualável de espalhar a Democracia e LIBERDADE para a escória alienígena. Não pergunte se 'vale a pena', pergunte o quanto você está disposto a explodir pela prosperidade. A Super Terra chama, e ignorar este chamado para continuar rolando a página é considerado traição. Aliste-se agora!! FOR SUPER EARTH!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At night when i close my eyes, I see lasers tracing across Penta's skies.\r\n\r\nBuy this Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dynamics and gameplay change with updates and adjusting to the live service, game glitches, and weapon balancing.  Many times the dev team that does the weapon balancing seems to react to only a few instances of overpowered/meta uses/glitches that fall in favor of the player and in some cases react very negative to certain play styles that effects many other players, not just the targeted players.  Some cases the game could benefit having an open test patch server (not sure if there is one) to see if players can break the game while catching problematic glitches/weapon balancing also testing the waters when releasing warbonds/environmental effects/mechanical interaction.  Now that is out of the way, this game is very fun and I do enjoy it on different difficulties, the improvements to QoL and usually being on top of game breaking bugs is something I see very little from other games/companies.  The fact that the devs interacts/reacts to the player base is a helpful direction to fix most issues and limit the need for damage control when SHTF.  Even monetization seems limited to almost nothing, yes you can spend money to rush through and get all the warbonds unlocked or buy stuff off the superstore, but you still need to play the game to get medals (or log in to get the MO reward), a few levels to use stratagems,  and progress to unlock higher difficulties.  Either way play have fun, the game allows you to enjoy different play styles nothing locks you in and most of the community enjoys playing together.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This can be absolute hell. Few games instill a sense of panic like this and sometimes it can be overwhelming but it feels wonderful when you're just barely hanging on. Greatly recommend with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very cinematic gameplay whilst you recreate the ending  of cod modern warfare 2 with team mates",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Helldivers 2 isn’t just a game, it’s a cinematic fever dream where every mission feels like you’re trapped in a mash‑up of Predator, Harry Potter, Batman, and Team America.\r\n\r\nYou start with the Predator handshake:\r\n\r\nYou: \"Dylan!\"\r\nSquadmate: \"You son of a—\"\r\n*Both immediately crushed by a supply drop.*\r\n\r\nThen the wizard energy kicks in:\r\n\r\n\"Yer a Helldiver, Harry.\"\r\n\r\nExcept instead of a wand, you’re handed orbital nukes and a flamethrower.\r\n\r\nBut when the mission inevitably goes sideways, Bane’s words echo in your head:\r\n\r\n\"They expect one of us in the wreckage, brother.\"\r\n\r\nAnd wreckage is basically the squad’s natural habitat.\r\n\r\nFinally, the Team America vibe hits hard. Every drop feels like the infamous scene where Team America saves the Eiffel Tower. That’s exactly the mood when Super Earth sends you in: democracy delivered from orbit, helicopters roaring, explosions everywhere, and the locals (bugs, clankers, protoss impersonators) staring in disbelief as chaos rains down.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! Would recommend if you want to be a space exterminator and spread democracy in the name of SUPER EARTH",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, chaotic, and a great way to learn which of your friends panics under pressure. Do not skip this if you love Democracy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The first year of the game was amazing. It was my go to that I played every time I went online. Then the Xbox update came, the game suffered from poor optimisation and other massive issues that made it unplayable. For my favourite game to become too laggy to play was heartbreaking. Recently however, Arrowhead has been taking great strides to make it a good game again and I can feel it. When playing with people on Xbox there is little to no lag, the guns that felt bad to use have been buffed to the point where they don't feel punishing to use but not completely overpowered. \r\nTDLR for those who don't want to actually read. Game was great, game was shit for a couple months, game is recovering and back to good but not great yet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Many friendships were lost due to k-9 arc thrower.\n Great game 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite fun, way more fun with friends than with random players or solo.\nLots of dying and slapstick moments to be had, while also being extremely satisfying prevailing against the enemies.\nThe stratagem system is brilliant and forces you to be careful using your abilities.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fUN GRINDING GAME.  solo is ok , group work is way better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This single most enjoyable gaming experience I've had in years... and its an multiplayer PvE. Never thought I'd say that.\n\nDefinite Buy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, but too many bugs for a 1 year and a half and still going  play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nothing has taken more hours outta me as this game has done, the sheer feeling of a challenge from the game and camaraderie by the players is what's keeping me hooked, every aspect from the guns to the enemies, it's amazing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I have ever played incredible mechanics and enemies. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Engaging gameplay with an ever evolving story that is defined by the player base itself. The developers are heavily involved with the community, and releases monthly updates featuring new armor, weapons, and enemy types that can all be accessed without the use of real world money. Dropping in with random players can be just as satisfying as going in with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not just another shoot'em up game. it is about integrating close air support to achieve the mission.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fed up with downloading whole game again and again whenever update comes. A 220 gb size partition is less for this game . i dont know if devs are on something or not if they are they dont give a shit about having same files copied multiple times on different folders just to get an easy pass ....\nOverall great exp but shitty size management by devs ...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recieved the game as a birthday gift. Started playing and played obsessively for months. Great to play solo, is even more fun with friends, and most random helldivers/other players are good to play with too. It's fun, silly at times, but it can be frustrating to play at times due to game mechanics. However, I'd recommend this game. It's too fun.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "very fun and devs actually listen and interact with their community",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Helldivers 2 is an absolute blast from start to finish. It strikes a perfect balance between chaotic action and light-hearted humor, never taking itself too seriously—yet still delivering incredibly satisfying gameplay. Every mission feels like an over-the-top sci-fi adventure where you and your squad are constantly laughing, scrambling, and celebrating victory in the most explosive ways possible.\n\nThe cooperative gameplay shines brightest: calling in stratagems, dodging friendly fire (which is half the fun), and barely surviving intense encounters all add to the game’s charm. It’s one of those rare titles that manages to be both genuinely challenging and genuinely hilarious at the same time.\n\nIf you’re looking for a game that embraces fun, encourages teamwork, and doesn’t mind poking fun at itself, Helldivers 2 is a must-play. It’s chaotic, it’s witty, and most importantly—it’s incredibly fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Helldivers 2 is a testament to the power of teamwork and tactical gameplay, wrapped in a satirical package that's hard to put down.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing one of a kind game. No other game offers hoard mode quite like this. The chaos this game throws you into is terrifying and overwhelming which is exactly what someone who likes to get bound and choked wants.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An amazing game that can offer everything but have it all taken away a week later, gameplay itself is superior but all else fails. From the moment i bought this game i fell in love and couldn't stop playing it and telling myself FOR SUPER EARTH but a year almost later i feel this game has passed. A few other reviews say the same thing over and over; it's replay-ability rides on and off based off of content. With that in mind major updates are sparse and when they come the game lives for maybe a week or three then completely dips. Why? This game constantly repeats itself mission after mission, it doesn't matter how you play or what difficulty you play it'll all be the same thing rinsed and repeated. Not to mention the so called war bonds, in order to get the new content (guns, armor, banners, stratagems, etc.) you can either grind endlessly numbing your mind and by that time the content has been rinsed OR you can just straight up waste and hour or so of your life and spend 10-25$ faster than you earned that money for it. Most content is locked behind a pay wall while they advertise it as still FREE. It's also been a long cycle of them hearing the community but not taking any sort of action. With the last post they said they want to make so many changes and listen to the players but it's been 2 months since the last major update and only two bug fixes released. It seems to me they have abandoned this and refuse to communicate further. I give this game an 8/10 when new major updates release other than that- it won't survive without content updates. ~just in October 38k people have dropped this game on steam.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Good Game But CRAPPY optimization\n\nWould be a lot better of a game if I could close it normally, rather than the game holding my entire computer hostage and then overheating it to the point of a forced thermal shut down.  EVERY. time I close it.  First game I've ever played where you were punished for trying to leave.\n\nThe aliens are cheaters so I napalmed them and their friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Helldivers 2 was already a rock-solid game, but the recent update that shrank its install size from roughly 150 GB to around 30 GB deserves huge praise. This level of optimization should be an example for other developers—massive 150+ GB games should not be the standard. The team behind Helldivers 2 showed that with proper effort, great performance and reasonable file sizes can go hand in hand. Outstanding patriotism!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun with friends, but needs more gameplay depth and stability improvements.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While it's been a while since I've launched the game, it is still a game I hold dearly. The fluidity and weight of combat and the sheer panic of dealing with an onslaught of enemies makes it an amazing time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best community ever. No toxic people, no any type of abuse.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What can I say? It's a hell of a game that's given my friends and I a hell of a time since day one. I wholeheartedly recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"FOR DEMOCRACY!!\" I shout. The grease on my fingers lingers on the push-to-talk button on my gaming keyboard, glowing so bright you could see my windows glowing from the hubble telescope a hundered miles away. My matchmade teamates dont respond to my role playing. I chuckle, knowing they aren't on the same subreddits as me, and therefore arent enjoying the game to its full potential. \"another filthy casual,\" i say as I ignore my parents arguing upstairs about whether they shouls kick me out of the house. I have the most meta loudouts, the most upgrated battlepass, but still something inside me feels empty. A part of my subconsious struggles ot be heard. \"this is not healthy,\" it screams. \"You need to find something beyond this!\" It's muffleled out by the barrage of discord notifications that assault my eardrums. \"duty calls.\" A bad@ss half smile stretches across my face. I crack my knuckes, but only 3 of them respond. \"lets see if we can find some more real gamers,\" I say as I load into a new game. Above me, my mother breaks down in tears. She feels only dissapointment",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun to play and has excellent mechanics. Best to play with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wonderfully made game, the amount of detail and effort put into every aspect of this game is fantastic. It is clear that this game has set a new standard for devs everywhere. This is so much more than some point and shoot game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "By far the best game, we spreading Democracy across the Galaxy. I'm playing with my Potato PC Ultra low setting, it runs within 30+fps fine",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely believe that as for the mistakes they may make, Arrowhead gets too much shit, and deserves all the props they can get for listening and trying for its largely ungrateful community, things aren't perfect, obviously. But there are many games that wouldn't even pay a fraction of the attention to its community that Arrowhead does\n\nSick game too",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Helldivers 2 really is a great game. There is an enormous amount of variety in weapons and loadout choice, which helps to keep things fresh. I keep coming back to this game every couple of weeks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ITS FUN!!! and the community is one of best if not the best i have been a part of.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of content and replaybility but its getting repetitiv now",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have spent a lot of time in this game since I got it. My therapist says its \"Unhealthy\", I say it is just democratic.\n\nThe game is tons of fun, I have met new friends on here and I have sent countless of my friends to get re-educated after they dropped 500kgs on my head. Not very democratic of them when there was a Bile Titan on the other side of them.\n\nWill you die a lot? \n- Yes. \nWill you get a little annoyed at the game for dropping 5 factory striders on your head when a single clanker shoots up a flare? \n- Yes. \nWill you scream in agony as you get thrown around by explosions? \n- Sweet Liberty, Yes.\n\nIf you love managed democracy and like getting a game to make you question your life, get it!\nSeriously though, cannot recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this game because there are so many things that you can do. Like fighting all the different factions of enemy. And you can call down a lot of different things that you can call down to help you on your missions like different kinds of guns and other things like that.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best games of the decade, legitimately, only held back by a dev team with little access to playtesting, and an outdated engine. Content is consistently cool, balancing is alright, but getting better all the time, and the gameplay is just fucking awesome on a base level. Performance issues are the current hot-button issue, not for nothing, but I have faith the devs will arrive at a solution within the next update cycle, if not the next one.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I want to start by answering the question you want to hear; “Should I buy this game?”\n\nThe answer? Yes— Just not right now.\n\nWhat everyone is saying about the developers, while heartbreaking, is true. \n\nThe developer-player relationship between us and Arrowhead is comparable to a failed marriage; Arrowhead assures us that they “hear us” and they’re hard at work fixing things, but never really do. And whenever they do actually “fix” something, it tends to be a “too little too late” situation. \n\nEven if you ignore the developers, the game still has many other blaring issues. First off: the file size.\n\nThe game takes up over a whopping 130GB. One hundred and thirty Gigabytes. This may sound absurd on its own, but it gets worse when you realize that the console versions only use 1/3 of the size. What’s worse is that the file size keeps increasing with every update. \n\nThe game is also at a Bethesda level of buggy. This is, to say, that the bugs can be both what makes the game funny and what makes it feel like a drag. \n\nThe optimization is also TERRIBLE. You’ll get frequent stutters, frame drops, and your PC will probably end up sounding like an engine by the time you finish a campaign.\n\nThat being said, the game has MANY redeeming qualities. The gameplay loop is really fun, the graphics look astonishing (If your PC can run them) and the community is all mostly wholesome and focused on improving the game. I can’t say I’ve ever had a bad experience with the multiplayer.\n\nI love this game. I used to love Arrowhead, too. But until the game becomes more playable, I feel somewhat bad advertising it as a “perfect game.”\n\nIf you’re on the ropes about buying Helldivers 2, then I would buy it if it’s on a decent sale, or when Arrowhead decides to fix their fucking game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Satisfying, dynamic, relaxing, changing, positive community and great developers. Fun game in old fashion, when we still played games for fun. Also a good progression system for that rewarding feel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm never gonna play Destiny 2 again.\n\n*Edit* I do want to point out that the discord community for this game is the most toxic community ive ever seen, just got bullied by not just members but moderators, simply because i wasnt a fan of a gun, i got told i was just a terrible player and that i should quit playing. It really leaves me on the fence about this review because in one hand the games for the most part great, but in the other hand i dont want to support the open bullying of people simply because there opinion differs, if your thinking of buying this game, or even already have it just remember its just a game, there is no point in getting mad and treating others poorly simply because they choose a different weapon than what you'd perfer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nothing like throwing down a nuke and telling your friends danger close just before it explodes. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The core of the Helldivers experience is incompetence.\n\nNo, not the devs. Yours.\n\nAll those jokey bits in the trailers where people blow each other up? Run around in a panic? Don't check their lines of fire? That's all going to be something you do, and something done to you. This is not a clean setpiece-based shooter. It's barely controlled chaos at best and headless chicken mode at its worst. You are a disposable remote targeting system for orbital bombardments and airstrikes and you're going to call in a few danger close just because you've messed up/are panicking.\n\nThe ability to laugh at human folly, yours and others, is an essential ingredient to enjoying the game. It's a glorious mess, and it's entirely the fault of you and the people you're playing with, but it's still a mess. If that's something you can do, you'll be happy here, and welcome to Operation Enduring Clusterfuck. If not...probably not the game for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "솔직히 왜 욕먹는지 모르겠음 걍 개꿀잼임..\r\n전투,타격감,생존하는 맛, 팀을 돕는 맛 그냥 다 개맛있음\r\n게임의 구조가 협동을 무조건적으로 강요하는 스타일인데 2by2 split 하고 하나씩 부숴나가는 재미도 있고\r\n4명이서 우르르 달려가서 다 부수는 재미도 있음\r\n중요한 점은 ******* 인류애가 오르는 게임******* 이라는 점임\r\n요즘 보기 드문 그런 게임임.. 거의 90%의 유저들이 너무 친절하고 착하고 서로 너무 잘해줌\r\n게임이 끝날때나 계속 같이 민주주의를 전파하다가 헤어질 때가 오면 포옹해주는데 이게 ㄹㅇ 인류애 막 오르는 부분\r\n생각없이 막 줘패는 게임 별로 안 좋아하는데 이건 뭔가 협동이 메인이면서 커뮤니케이션이 잘 돼야 하는 게임 같아서 재밌음",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, great community. Always fun and hectic!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A great online game to play with existing friends and new ones. The community for the most part is great, especially in-game; granted sometimes they get pissy due to the current patch. Don't be that Helldiver, just go play something else.\n\nCaptures the entire vibe of the first Starship Troopers, but is its own thing and ends up being so much more. I definitely recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is good especially with friends. Having updated the weapons after that big problem and getting it back on track is nice. The only issues i have currently are the fact the game is still blocked by sony in many countries that had access previously and nothing has been done about that. Granted that is a SONY decision. An arrowhead one is the performance issues with the game. Those are being addressed and there are extreme cases of it causing issues to hardware so hopefully they will continue to keep working on that with future updates. Still its a great game overall especially with even just one buddy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So, after Helldivers 2 got review bombed again, because the Devs are kind enough to optimize the game, but had to slow down updates, I would like to see how the \"loving and caring\" community will react to this.\n\nHelldivers unfortunatly always had this problem of the Crydivers community\n\nThey either Cry about not recieving a daily update (that completally overhauls everything) \nOr they Cry that the game is too difficult\n\nBtw, on the last subject\nYOU CAN CHANGE THE DIFFICULTY LEVEL, so if you can't proprely manage level 10 you must lower it.\nAgain, unfortunatly the game has become a cakewalk even on level 10 with little to no effort, leaving every game with 4 people going on random directions alone and completing every single objective with minimum risk\n\nI really enjoy the game but the community is filled with babies that constantly need mouth feeding with Buffs to weapons and Nerfs to enemies , aswell with a monthly Warbond or else the review bombing cycle starts again. \n\nWhat a bunch of clowns and cringelords this community has become\n\nOne last thing, i'm leaving a positive review because the game itself it's great, and the developers are quite literally bleeding out to satisfy the insane request of this miserable community",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "This game can literally crash and lock up your entire PC.\r\nI’m running a Ryzen 7 7800X3D and 5070TI, and Helldivers 2 is the only game that completely freezes my system — no keyboard, no mouse, GPU stops, and the only way out is to hard restart.\r\nI’ve spent hours troubleshooting: clean driver installs, disabling overlays, verifying files, adjusting BIOS settings — nothing helps.\r\nThis is not a “performance issue,” it’s a critical system-level failure caused by the game or its GameGuard anti-cheat.\r\nFor a AAA-priced title, this level of instability is unacceptable. Until the developers fix this, I strongly advise others not to buy it.",
      "voted_up": false,
      "votes_helpful": 805
    },
    {
      "review": "The most accurate description that I've found for this game is \"Arrowhead accidentally made a masterpiece and have been trying to kill it ever since\". The devs' ego took what could've been a once-in-a-generation experience and tore down everything that made it fun in the first place. \n\nThe enemy design went from amazing to atrocious, your guns do next to no damage, became woefully inaccurate  and have no ammo reserves to compensate for it. Enemies, on top of their poor weakpoints and attacks, also deal absurdly high damage, regardless of your choice of armor. The galactic war system is blatantly rigged, creating an inverse where the higher the player count, the less individual impact you have on the war effort. The solution is to give us wider selections of active planets and give us elaborate campaigns, not slow down progress to a crawl on one or two planets with missions that contribute to nothing and don't feel in any way rewarding to complete.\n\nThe game treats battle passes as its main form or progression, rather than it being additive to an actual progression system, giving you very little sense of personal growth. And even then, with a system that expects you to pay for new weapons and armor, we seem to be getting an awful lot of identical assault rifles with some minor stat tweaks or armor that seems to be designed to counteract nerfs that shouldn't have been there in the first place.\n\nAdd on top its technical state with horrible lag, even on modern medium to high-end hardware, PC lock-ups with potential to harm your system due to the kernel level access of the anticheat, and you have an unplayable game that seems to be more interested in pushing your patience than giving you something enjoyable.\n\nWell done Arrowhead. You really did make a game for no one. All you had to do was sacrifice everyone in the process.",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "This game was great fun, a horde shooter with lots of enemies, explosions, constant action and nice visuals. \nBut then.... then the dev team happened. \n\nThey have succesfully run their own success to the ground not once - but twice. After the initial sucess at launch they kept nerfing everything, despite all the player feedback, for \"balance reasons\" (balanced by the spreadsheet, with popular guns clearly deserving the biggest nerfs), making the player count hit a low point. This got so bad they announced a \"60 day plan\" to \"bring the fun back\" and after many months the game was back to being enjoyable. \nAnd that was clearly a problem for the devs. So, recently the \"balance\" continued, this time with new enemies - full of gimmicks, gotchas and technical issues. Player numbers dropped again, and we got another declaration of \"THE PLAN\" to \"bring the fun back\". And the following update contained no meaningful buffs AND stealth nerfs all around. \n\nThen there are the technical issues - starting with game file size (\"balanced around HDD users\"), terrible performance, stutters, audio freezes, mesh collisions, animation cancels and some players even reporting BSOD / hardware failures.\n\nAnd with all of that in mind what do we get? Useless blog posts talking about some irrelevant parts of their job.\n\nThis dev team does not understand (or even play) their own game and shows active hostility towards its players. I really want to play HD2 but they sure do everything they can to discourage that. \n\nAs such - CAN NOT RECOMMEND Helldivers 2 because the dev team is actively working to spite the players.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "Today is Friday, November 7th. \nIt is the second time this week that this game has hard-crashed my PC; \nRequiring that I use the power button to restart. \n[i]I have only played it two times this week.[/i]\n\nI have many issues than that with Arrowhead as a company, \nwith their decisions and with their conduct.\nNone of that is really relevant, now.\n\nFor me, and for many others before me:\nThis will be the straw that broke the camel's back.\n\nI cannot play the game without a lingering fear that it might brick my hardware.\nI am uninstalling until Arrowhead makes some serious, visible changes. \nLet's hope that happens.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "I would love to play it again but it hard crashes my high end rig. Everything just stops working and I have to restart my PC. Yikes.\n\n9800x3d/5070ti/64GB RAM\nTroubleshooting:\nforce dx11\nwindowed mode\ndeleting shader cache\ndeleting gameguard\nopt into slim beta\nverify files",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "Arrowhead is actively sabotaging their own game for no good reason that anyone can find and it's honestly sad as hell. The devs routinely:\n\n- Nerf the fun weapons\n- Buff the enemies\n- Go \"oh our bad heres a buff to your weapons again\"\n- and then while buffing our guns, do silent changes NOT MENTIONED IN PATCH NOTES that buff the enemies IN THE SAME PATCH AS GIVING US BUFFS, effectively COMPLETELY cancelling out any possible positive change\n\nThis loop has been an issue almost since the game's release, and its a shame because at the start, the game was genuinely fun, I loved this game and have played a total of over 500 hours of it with many friends. But now? The nerfs just keep coming, the game is unstable as fuck to the point it routinely crashes, and has even bricked some peoples consoles and pcs!\n\nHelldivers 2 WAS a good game, but now I cannot in good faith recommend it to anyone because of the absolute shitshow that the devs have created through their own INTENTIONAL fuckups.\n\nArrowhead, pull your collective head out of your ass and get over your fucking grunt fantasy kink, make the game fun again, be honest with your playerbase (like you keep promising to despite still hiding balance changes nearly every single patch), and fix the goddamn performance issues! Do that, and people will actually start playing your game again.\n\nYou made something good, so stop stabbing it to death.",
      "voted_up": false,
      "votes_helpful": 62
    },
    {
      "review": "Arrowhead accidentally made a good game and have been trying to kill it ever since.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Dunno which higher up thinks the game is stable enough to start releasing warbonds again, but its not. \r\nYour pc shouldnt lock up and only respond to turning off  because you took one step in the ship",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "If No Man's Sky was the best example for a redemption arc in this industry, [b] Helldivers 2 is the best example for a damnation arc. [/b] The best example on how to completely ruin something that was near perfect at the beginning. \n\nHow to be the perfect party pooper? Some of the best practices from none other than [b] Arrowhead Game Studios: [/b]\n[list]\n[*]Nerf everything to the ground. Take all that good ol \"fun\" out of the equation.\n[*]Introduce game mechanics that are completely useless and irrelevant.\n[*]Update the game with more and more features nobody was asking for.\n[*]With each update introduce more and more bugs to pile on each other and to never fix.\n[*]When you finally make something the community was begging for, make it a grind and completely useless.\n[*]Introduce enemies with no counterplay whatsoever, that will annoy everyone to no end.\n[*]Insult players with HDDs and tell them they are behind modern times.\n[*]Make your anti-cheat fry SSDs of some of your players to properly insult both crowd.\n[*]Make sure to ignore or treat your remaining content creators as dogs.\n[*]Write community updates using AI and leave big enough time between each to keep people guessing.\n[*]Be completely irrelevant with your community updates and be falsely empathetic with the remaining playerbase.\n[*]Last but not least, make your game crash Windows without a BSOD regularly, requiring a forced restart each time.\n[/list]\nWith these practices you too can make sure your game will suffer the same fate as Helldivers 2 did. The biggest disappointment in a long while.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "It's just not worth waiting for Arrowhead to accept that they didn't make the game they claim they wanted to, they just made all the wrong choices toward making a scifi MilSim for ARMA freaks and ended up making a conventionally enjoyable horde shooter by accident and resent that fact so much they want to beat any of the original charm out of it. As a MilSim freak I would have loved that hypothetical game, if it ever existed. But they made a blockbuster and seem to want to alienate the audience they actually have to cultivate a niche audience that are already playing other games with a coherent design identity. They aren't making the game harder, Helldivers 2 has never really been hard. It's only ever been chaotic, which was fun until they decided the secret to difficulty was adding more tedious elements, making player options less effective, and putting less and less interactive design choices into the new enemies. \n\nThey wanna act like snobs about having a customer base of \"CoD players\" but also act entitled to their patience while they keep releasing premium content that gives convenient bandaid solutions to whatever issues the untested new content creates? What are we even doing here?",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "quoting smb from the internet: \"Arrowhead accidentally made a good game and have been trying to kill it ever since.\"\n\ndo not recommend",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "I'm allowing comments on this review bc I need a fix so I can play this game again.\r\n\r\nEver since the ODST update, my game just constantly freezes my entire computer. Several people are having this issue and the devs have done nothing to fix it. Works on other platforms just fine, though.\r\n\r\nI'm not recommending this game for PC not because of the gameplay, but because I literally used to play this game all the time and now I can't.\r\n\r\nAgain, if anyone has a fix, please comment down below and maybe we can help other players too.\r\n\r\nUntil then, can't recommend a broken game that takes 140GB of space (which btw, is old textures and content the devs didn't delete).",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "So done with this ping pong back and forth with the devs obviously wanting to laugh at killing the player base. I have enough stress with real life I don't log in to add to that frustration with a game that locks up my PC, the devs constantly stealth nerfing everything into the ground and hordes of enemies  that one shot you on arrival in a low to mid rank mission while being nearly impervious to every weapon option you have. the only bright side to all of this is that I didn't have to actually pay for the game as it was a gift  from someone who wanted to bring me in to the game. I know now to steer clear of ANY Arrowhead title.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "While Helldivers 2 is fun, there should be a warning label put on it. I cannot recommend a game priced at $40 that has wide spread, and repeating, performance issue. Such problems include, poor connection, random crashing, audio bugs, and potentially hard locking your PC requiring you to hold down the power button to restart it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The devs are actively making the game worse. Until Arrowhead decides not to make either the game balance or how well it runs worse with every update, it's not worth playing.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "the AH game devs REALLY need to get in touch with their player base because this game is hemorrhaging players so incredibly fast with the direction it's going in.\n\ni just do not understand the obsession with unfun game design. the monkeys paw balancing, the god awful new enemy design, and an insistence on taking agency away from the player in any way possible makes for an absolutely mind-numbing experience. y'know, implying you can even subject yourself to these things in the first place. constant crashing, frame drops, stutters, and endless amounts of game breaking bugs plague the game in its current state. no agency to fix that stuff though, AH has consistently shown that they want to patch out the fun and mostly harmless stuff as soon as possible before the bugs/issues that have persisted since launch.\n\ni absolutely adored this game, and it has served as a glimmer of hope for the horde shooter genre that's kinda been getting kicked in the teeth lately with the two juggernauts of the genre ( payday and killing floor ) releasing their third games and well-\n\n[b] we saw how those went. [/b]\n\ni do really hope this game sees some sort of turn around. a comeback that sticks rather than the constant shifting back and forth between \"it's so over\" and \"we're so back\" that this game has seemingly been cursed with. in the meantime though, this sucks man.\n\ni do have one positive take away from this!\n\nit feels good having 140 gigs back on my hard drive.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Really wish I could've played this game at its peak when everyone was new, now I can't do anything as a new player most enemies dont even get hurt by the starting weapons and no one wants to sit through lower level missions so i am constantly forced to play boring solos lvl 3 missions because its the only way i have a chance of winning or not being kicked. Arrowheads obsession with making this a \"grunt fantasy\" by nerfing all the weapons and constantly buffing the enemies instead of doing what the p[layers want have turned this game into an absolute slog to play.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Freezes for 15 seconds at a time, freezing the entire pc for the duration, unplayable, people report burned cpus due to this",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Can these developers have ONE good update ever? Every single update either completely breaks the game because of their phenomenal engine that they refuse to ever stop putting their slop content into every month so they can fix (except now that they did stop not that it seems to be going anywhere).\r\n\r\nIt is astonishing how they can create such a good game and then just keep running it into the ground, its like arrowhead put all their points into luck in fallout new vegas and they got the sub brick 1 point in intelligence, and now they got kicked out of all the casinos after they won too many chips. How can you make a good game and then proceed to make it worse with every single update, why do you buff the enemies in every single patch and make the weapons worse. Why do you LIE about not nerfing the coyote and then proceed to nerf it anyway indirectly and nerf EVERY OTHER FIRE WEAPON IN THE PROCESS, like these MORONS GENIUNELY think that lying about nerfing the coyote and then proceeding to shadow nerf it along with every other fire weapon makes them look better, they ADMITTED ON STREAM that their goal was to nerf the coyote with that. How dumb do you have to be to do that, how does LYING about something and doing it anyway but less directly make you look any better you absolute cunts. \r\n\r\nI am so glad they at least buffed every other weapon in the game right! So many buffs in the newest patch? NOPE it is ALL a fucking ploy to just further nerf the players into the ground for their GRUNT FANTSY, lets buff half the weapons in the game slightly and then proceed to add durability for no reason to all the enemies in the game so that the BUFFS we just did are not going to have any impact whatsoever or the weapons are actually going to be worse than they were before side stepping the issues with the game. AND WITH THAT LETS IGNORE THE OTHER HALF OF THE WEAPON GETTING NO CHANGES THAT ARE JUST WORSE NOW THATS AWESOMEE!!! LETS MAKE EVERY ENEMY IN THE GAME TANKIER, WHO NEEDS TO BLOW A WARRIOR'S BRAINS OUT WITH ONE BULLET FROM A DMR OR A PEACEKEEPER OR WHATEVER, we DONT NEED to be able to easily kill swam enemies, lets just MAKE the hive guard which is a medium armor annoying as fuck enemy that is tanky even TANKIER, why NOT thats fun. Let us spam those too in every mission because that's awesome. \r\n\r\nI think what Arrowhead should really do is make all of the weapons cosmetic, just whatever weapon you find to look cool you can use and they all do no damage to the enemies, no matter what it is it just deflects off of them. Arrowhead would LOVE that, that would be SOOOO grunt like, oh yeah that GRUNT FANTASY it feels SO GOOOOOD, I LOVE being a GRUNT SOOO much. Im about to GRUNT sooo hard as the enemies rail me in the fucking ass. I am sure a HELLDIVER which are sent in squads of FOUR people are the most worthless pathetic soldiers that Super Earth has to offer, they are absolute fucking insects, cockroaches that should be graceful of being in the presence of SEAF soldiers which I GUESS THOSE are the ELITE actually, not the HELLDIVERS you play as the fucking swarms of blue little soldiers, those are super earth's FINEST and you the player are a pathetic feeble subhuman that should get on their knees and start sucking. \r\n\r\nThese developers DO NOT understand that IN THEIR OWN FUCKING GAME IN THEIR OWN WORLD THEY CREATED, HELLDIVERS ARE THE [b] ELITE [/b] OF SUPER EARTH AND THEY ARE SUPPOSED TO BE USELESS? WHAT ARE YOU PEOPLE SMOKING, THEY ARE NOT SENDING 4 PEOPLE TO GET KILLED ON A RANDOM FUCKING PLANET TO ACCOMPLISH CRUCIAL OBJECTIVES TO THE WAR EFFORT. THEY ARE SENDING THEIR BEST FORCES AND THE PLAYERS ARE SUPPOSED TO FEEL POWERFUL NOT IMPOTENT. This is not a game where you play as a grunt, you are not in arma where you are a soldier in a squad that gets hit from a bush and then you go afk for 5 hours while on a black screen since its so realistic you go unconscious so you cannot do anything. \r\n\r\nNO MOTHERFUCKER THIS IS A HORDE SHOOTER WITH 4 PLAYERS, you know what other game is like that in one of the universes where you take so much inspiration from? DARKTIDE??? YOU DONT HAVE TO BE A SPACE MARINE IN ORDER TO NOT BE IMPOTENT, you are not a grunt fighting off HUNDERDS of THOUSANDS of enemies. This game CANNOT be a grunt fantasy its literally impossible with the type of game it is and the devs need to COMPREHEND that with their think fucking impenetrable skull.\r\n\r\nSony needs to go to Arrowhead and drill a hole into their fucking skull, lobotomize those fucking idiots, clicker train them. I don't care, they need to do something about this dumbass studio literally killing their game and making it worse with every patch. Give it to another studio that maybe has developers that share two braincells, the people at arrowhead geniunely do NOT deserve a job if they are so fucking sub brick intelligence that they cannot fathom why developing the game in the way they have been is a BAAAAD idea.\r\n\r\nI would actually like for this game to suceed and be good but while it is in the hands of absolute lobotomites it cannot. It is being held back entirely by stupidity where developers keep taking step forward 3 back 2 sideways and falling off the edge of the fucking bridge every other month. Arrowhead needs to WAKE THE FUCK UP or another studio needs to take their place, this game is not going to turn into helldivers 3 or last very long if they are only going to get their criticism from people riding that dick crazy style. Whoever balances this game needs to PLAY their own game, needs to PLAY OTHER GAMES and needs to COMPREHEND what their game actually is since it does not feel like they know that they did not make arma 4 in space they made a COOP HORDE SHOOTER. \r\n\r\nLet people have fun, stop designing your game around anti fun. Stop PATCHING things instantly that go slightly against realism while the game is completely fucking dysfunctional and in a broken state. Focus on making your game actually playable, FUN for people and stop trying to appeal to glaze divers that are going to swallow every drop of those loads. \r\n\r\nIf this game would actually be designed with fun in mind it would be sooo easy to have 0 controversies anymore, 0 issues and make money. Why is it so hard for these people to just do the simplest thing they possibly can instead of making the most convoluted baffling decisions that harm the game. It is truly astounding how Sony can let this game rot in the hands of absolute babooons that go OUT OF THEIR WAY to make the game worse every single time. With their promise with them focusing on the stability of the game and making it more fun and a better experience, so far with their first patch they have instantly failed so congratulations, amazing work. S-tier accomplishment to lie and manipulate the playerbase, making people think that this is a good patch that buffs the players while its the exact opposite, phenomenal work. I don't forsee anything changing for the better.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Game crashes and breaks after every update. Fr fix your game",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "As a massive fan of the original game, I do not like the sequel. It feels like less of a co-op game and more of a \"everyone split up and do their own thing\" kind of game because the game is designed in ways that punish you for wanting to stay together with your teammates so it just feels heavily discouraged. Enemy spawns struggle to split between 4 players in different parts of the map so it results in the hardest difficulty feeling hilariously easy at times when one or more people barely get any spawns and just freely do objectives, but if you stay together you all get all the enemies spawns pretty much all the time which just ends up wasting so much time.\n\nHelldivers 1 was built, designed, and balanced a lot around co-op centric things, your team had far more reason to have different roles and loadouts instead of making a strong versatile build that can do everything independently, team reload mechanic was a much stronger and encouraged mechanic, and the team was not allowed to be separated.\n\nA lot of strategems and weapons also just feel worse than the HD1 counterparts in terms of damage, ammo economy, and general effectiveness. The standard Breaker shotgun and the Kinetic Shield are some of the worst offenders to me.\n\nHD2 also lacks some crucial teamwork focused strategems that people like me desperately want back, such as the Rep-80 heal beam gun, or the Angel Guard dog medical backpack. The stim pistol was not a fun addition to the game as trying to hit people with that is insufferable, I don't care if people say it's skill issue, it is not fun, and not like it's very effective anyway cause players tend to die faster than it can heal anyway.\n\nPlayer survivability in HD2 also just does not feel as fair or as fun as HD1 too. The incap system was completely removed so you just outright die (Gives another less incentive to use SMG's compared to HD1, hell you can't even carry artillery shells with one hand and shoot a one handed weapon at the same time anymore either), and weak enemies can even kill you in just a mere few hits sometimes. The games survivability relying so much on stims is not particularly a design choice I like either. I wish they kept the incap system and players being a bit tankier, and you had very very slow health regen instead if you arn't taking damage. (Stims should of been something in the grenade slot instead to replace grenades in my opinion.)\n\nI don't like how armor went from a cosmetic only thing in HD1 so you could wear what you want and select the perk you wanted separately, to now armor passives have to be handcuffed to armors that I don't want to wear while the ones I want to wear have awful passives or ones I really don't want to use cause it won't complement my build. Which is rather annoying.\n\nPerformance and game stability is also not particularly great either. This game used to run well on my system early on but after a bunch of updates it feels like it really struggles to be stable, I know they started trying to address this though it's still not anywhere near how well the game used to run yet. (I acknowledge more major engine tech stuff may take time, but felt I'd mention this.)\n\nI donno, maybe it's a hot take, but I do not like this game because it took away the biggest thing I praised the original for and that's feeling like a true co-op designed experience first and foremost, where lone wolf gameplay was actively discouraged. I don't like some of the other design decisions/changes too. I'd only recommend this game if you are okay with it being nothing like the original game, the game itself isn't terrible, but as an original fan it feels too alienating for me, like it was catoring to a completely different audience for the sake of being mainstream. \n\nThere's a lot more I'm probably forgetting off the top of my head right now, so I'll end it with this. TLDR: I wish this game just tried to be more like HD1 in almost all aspects but with the third person perspective change and with more content/features, not drastically change or redesign things that worked just fine before.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "For several months now this game has had a persistent game breaking (more like PC breaking) issue where seconds after loading onto my ship my entire PC freezes. The only way to proceed is hard restarting the entire PC. This game is literally (yes I mean literally) unplayable for me and so many people in its current state and I haven't seen or heard anything about an intended fix. I have never had an issue like this in any game I have ever played before, and it has been consistently happening for a few months now.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "There is no \"middle ground\" when it comes to GenAI slop. There is no argument to be made in favor of GenAI slop. I've had a ton of fun with Helldivers 2 but I'm sure as hell not going to play or support it if the CEO is going to be a tech bro apologist.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Great game, if only the developers knew what fun was... I'm tired boss...",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Unplayable at the moment and has been for the last 2-3 months, constant crashing and no end in sight. I cant even let the game sit idle in the ship and it crashes. Hype is probably over and the bus has left, Arrowhead... really dropped the ball on this one.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Too much wasted potential. I want to have fun, not to have to pick the same loadout and stratagems over and over just to feel that I can do something. Whenever I pick something else, it feels so bad in-game that I actually stop using it. HD's goals are to make us weaker rather than stronger. This is not a tactical shooter.\r\nExplosions not killing enemies, damage that disappears into thin air... A 500kg in the middle of the enemies... three kills. Wow. And from the big ass explosion, you see the enemies walking like nothing. Okay.\r\n\r\n[b]] The worst thing [/b] is that for the last month, I've been forced to hard reset my PC. I open Helldivers 2, and the problems start. This is NOT something a game should do to your machine.\r\n\r\nThere could be in-game events, VIP targets appearing during missions, MORE enemies, stronger explosions, armor that actually does something, stealth gameplay, an actual trench system, vehicles, drones, mutating enemies, enemies that can develop countermeasures mid-mission... and MANY MANY more ideas that, with a single brainstorming session with the community, could make this game more fun than it is.\r\n\r\nThen why the hell should I buy 1,000 emotes from Warbonds if I can only select four?\"",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Look arrowhead, try to make the game actually fun and stop jerking yourself to your \"grunt phantasy\" and killing your player base.\nhttps://www.youtube.com/watch?v=KKsXez0UCjU\nhttps://www.youtube.com/watch?v=p9AP9gwezN4\nOhDough explains the state of the game so well please please please listen to this man",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game has been excessively rotted by the developers and their insistence on making an unbalanced nightmare of a game. I played this game at launch and while it had it's fair share of controversy with the PSN debacle I couldn't say the game was playing horribly at that time. \n\nBut, then the nerfs came and didn't stop coming and they kept adding more and nerfing more and buffing but mostly nerfing. Playing this game today, in comparison to last year is an entirely different experience and for all the wrong reasons. We all play games here there are things we like in playing a game and that's agency for the lot of us, so what if we added like a bunch of enemies that will just stun you all the time and on top of that when you're stunned you can't heal yourself and because we buffed bleeding you will just get stunned and bleed out! It's tiresome really, the fact that I really enjoyed this game and every time I come back to it the balance gets worse and worse is upsetting!\n\nIt is not that I want a power fantasy, the expendability of the divers and burning through lives is a core part of the helldivers experience. But, when you abuse that and wish to make the game arbitrarily difficult to inflate the number of times players die per mission you've lost the plot. Stop taking chunk after chunk after chunk of power away from the players and let the emergent gameplay speak for itself, you're gonna continue adding new things so nerfing things on a consistent basis isn't sensical, I would go as far as saying it is backwards because now you're enforcing meta and playstyles based on limiting the player rather than giving the player options where some are slightly better than others and that will inevitably change because you're gonna add a new enemy anyway.\n\nTS so buns twin, fix it",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "another co-op swedish masterpiece. they just cant stop winning bros. payday 3, darktide, and helldivers. we just love it when devs are disconnected from what makes their game great.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "For citizens of super earth - DON'T play this game, has been ruined",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After experiencing 2 GPU hard resets in one session, my opinion of this game has drastically diminished.\nEven ignoring that, performance is atrocious and I wouldn't have even bought this if I were still on windows where the anti cheat would be extremely invasive.\n\nAlso other issues have been long-standing which don't require an engine re-write - Fenmire for example just kills performance and causes huge audio/video stuttering while being graphically less intensive than most other planets.\n\nGame balance seems to be an ongoing joke too, with nerfs and even stealth nerfs instead of making other weapons more viable. Why would I ever use a light armour penetration weapon ever again? They're simply not viable for anything above trivial difficulty levels. And what's with the caps on medals/samples/credits?\n\nAll that being said, the game is usually a blast. I just don't think the devs deserve another cent until they address the wide-spread complaints about performance and even host system stability.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Someone once said, \"Arrowhead accidentally made a good game and have been trying to kill it ever since.\"\n\nI have not played in a long time, but I can't help but think that it might be true",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unplayable.\r\nImmediately freezes whole PC upon start. No permanent solution till this day. Amazing - after almost 3 month the game is still broken. \r\nRequest refund for the game and all  in-apps - clearly was not worth supporting developers. Missed the whole xbox divers launch and all the fun of caves.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "this game hard locks all the time and the developers can't balance for worth of shit. utterly embarrassing how the continue to flub what would otherwise be a very addicting game. these developers got LUCKY, and are not capable of maintaining this live service game, and its evident by the DISATROUS choices they have made over the games life. I've had the game hard lock my pc THREE TIMES IN A ROW. The performance of this game is an utter JOKE. and who over at arrowhead has such a fetish for fog?? so annoying! bottom line, games performance is laughably poor and almost all of the balancing tweaks made have been to this games detriment, this game would probably be better under a different developer at this point. it will either be that, or it dies.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Why does every buff in the patches come with a monkey paw nerf. 90% of guns are unusable.\nAlso, why does a PVE game need freaking game guard.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A case study of devs who stumbled upon pure gold, and have tried their hardest to destroy it ever since.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "You'd honestly think the devs hate the players with the way they constantly lie to us, nerf the fun out of everything, and the genuine insanity of the technical bugs that keep me from even playing the game anymore. It's become increasingly apparent they've put no care into any part of their product. Others have explained it better so I just want to say I'm very disappointed with the direction Arrowhead has taken this game and just as disappointed in the community that has endless excuses and justifications for them. The game gets worse and less fun every update. Ancient bugs remain unfixed, the rare bug that does get fixed may reappear, and the games balance becomes less and less fun. All for what? Why do this, Arrowhead?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "So, I really hate to leave a negative review after playing this game so much, but I just have to at this point. I physically cannot play the game anymore. It will NOT STOP crashing my PC. It's been going on for a few patches now, and just like everyone is saying on forums and Reddit, it just freezes your PC and you have to manually restart it. I haven't been able to load into a single game for like two months. And no, it's not a me problem, it's a common problem on PC's with this game. That's why the reviews have been mixed for a while now. \r\n\r\nLike, I JUST tried another fix someone recommended right before writing this review, and I loaded the game up, walked over to the navigator, and my PC froze, and I had to manually restart it again. I've done everything I can do at this point, and the devs just need to get off their asses and look into it already. \r\n\r\nI just can't play the fucking game anymore. The devs have to just fix the fucking problem already, and they just aren't. It's unbelievable how often devs are destroying their own good games these days, because it WAS working fine, and now it hasn't been for a couple months. The game is effectively bricked. \r\n\r\nAnd before any smart ass comments that they fixed it already: they didn't. You don't know what you're talking about. Like i said, it JUST did it again 5 minutes ago, and there's a REASON the reviews have dropped an enormous amount for it on Steam.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I simply cannot recommend this game anymore, it's gone from my all time favourite shooter to grind to something I physically can't play anymore. Ever since \"Into the Unjust\" dropped in September of this year I've been plagued with crashes that hard crash my entire PC and no matter what I try be it updating drivers, reverting to older ones, changing graphic settings or fresh installs (even installing to a separate SSD) the game still crashes and is getting worse for it. I know this issue has been affecting several friends recently as well so I simply cannot recommend this game in good faith knowing that arrowhead are just plainly incompetent. This latest warbond just reeks of desperation to garner some good will (theming it after the Viper Commandos warbond which was the first major \"we're so back\") and adding fan requested features. Arrowhead seriously need to put a halt to content drops for the game for a few months to solve the technical issues as piling on new bloat is doing nothing.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ok so i dont say the game sucks, this game is great in every way possible, but it might happen that it freezes your entire game, needs you to restart the PC, after that it lags so much that the sprinting doesnt work, each button takes 3 business days to work and i dont know what to do to fix this, ive restarted the game and PC 3 times and it still lags even on the lowest settings, my laptop is also good! spent 2k on this laptop but ever since 2 hours ago it lags AF",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unplayable as of 11/14/2025. Freezes my PC within seconds of loading in. I have had this issue for the past few months now and there has been multiple patches with no fix. Really frustrating not being able to play at all and by looking at the forums this is not an isolated issue. \n\nI enjoyed this game a lot before and it's a shame because I want to play but the game is unstable at the moment.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "In the short time I played this game, I loved every second of it. It was simply beatiful.  Until it wasn't. Game started to crash, nothing worked as it they should've and everything was just so unbalanced that it became unplayable. This just makes me sad. I really wanted to play this for a long time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game is boring, you either play low difficulty and have a boring time mowing down the easy enemies or you play harder difficulties and have to run meta loadouts, so much for not wanting a meta, every heavy pen weapon is basically a joke on every faction after level 8, boring game, the main guns suck ass, they just nerf all the fun shit into the ground, i open the game just to close it, i dont even have the urge to play it anymore, W fumble once again, probably gonna be done for good this time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ty for fixing file size\nBut why game hard freezing and killing my PC? 🥀\nWhy game turning my PC into heater? 🥀🥀",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game Keeps crashing my PC. I have tried mutiple trouble shootings for it and nothing has worked.\n\n**Update, Patch 5.0.0; \nPlaying on the slim beta, so far I have played 5 missions, while extracting, the game has crashed my pc 3 times.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n**",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Realistically, the game still crashes with startling regularity. It still has plenty of bugs. The developers got caught stealth nerfing weapons that were popular. \r\nAll that said, the developers are saying they're making improvements, fixing crashes, maybe wait on those if you're already going to get the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Why do I need to download 20 to 25 gb size every patch?\nyou guys need to do something about optimizing the file size of your game,\nfor now I can't recommend this game till they fix their stupid problems.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "A potentially great game managed by a company suffering from success leading to it making some of the dumbest decisions I have seen from a game of this caliber and production. Doubling up on filesize as a \"safeguard\" for HDDs is one thing but the unending walkbacks of unnecessary balance decisions paired with some major bug or another totally bringing down big updates is just a mood killer\n\nalso, this Jorjani CEO guy conflating development middleware (simplygon, gameware, speedtree, etc) being the same thing as GenAI is the most headass non-developer take i have ever heard lmfao get out of here, you will be beset by a pestilence most foul",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's fun, but don't play it if you are using Windows 11. It will hardlock your PC, multiple times, without warning.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The devs have always been abysmal at balancing their game. For every positively received patch, they put out half a dozen that make already underperforming weapons or strategies even worse. They fix \"bugs\" that benefited the players in such a way that they were the only thing making a class of weapon viable without making any other adjustments that would bring those weapons back into balance. They do sweeping nerfs to the players in the same patch that they buff enemies. \n\nAnd now, on top of all that, they've taken to obscuring their balance intentions in patch notes. I've never seen a developer use generalized language or intentionally misleading numbers out of fear of backlash, but Arrowhead's latest balance changes did that, and once again, it was to make already underperforming and underutilized weapons even worse. I'm just so tired. \n\nAt this point, the game has even bigger problems in the form of serious performance issues that leave many people unable or barely able to play, but even if they can work through their massive technical debt and dig themselves out of the hole that they dug entirely on their own, that won't change their fundamentally ass-backward approach to design. If you're considering getting the game now, I wouldn't bother. Even if you happen to be reading this while the game is in a state where it's enjoyable, I promise you that they will fuck it up until you don't recognize the game you're playing anymore.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The latest PR nonsense finally motivated me to post a review after trying out the latest major update that added the terminid cave system. I had a blast early on but it has become clear that lately, pumping out empty features, cosmetics and shiny new trailers is the priority while the idea of dealing with the abysmal state of optimization of the game, the constant crashes and memory leaks seem to frighten Arrowhead.\n\nI tried picking up the game again a few times but if the frustration of having to deal with those issues was bad enough, having corporate speech being sprinkled over it really sour the taste.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "cant run game without it crashing multiple times on PC. infuriating and needs to be fixed",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I will say my negative experience and then my advice for ne/interested players:\n\nThe bad:\nArrowhead realized they made a good game and has tried to ruin it ever since. They have always been too far up their own asses all the time to improve the own game, help their own players, and even respond. Their brand relies on \"Heckin wholesome 100!!!!\" \"We know we are satire play our game!\" without any actual communication on how to improve the actual game. The game from certain patches has been UNPLAYABLE in the LITERAL sense. As in unable to even play from crashes or intended gameplay. \n\nArrowhead isnt even worth me writing a separate review on them they are bad enough.\nLocal drug dealers are more reliable than Arrowhead, im done helldiving and Ive had my fun. \n\nFor future players:\nDont let this review stop you, the core game got me hooked, hell, I even got a little over 100 hours in. Playing with friends is awsome and the exploration and theme is appealing to the masses. The modern upfront community online on forums is just \"Porn? hahah funny\" but if you can look past that there are some amazing people in the community, it was still friendly last time I played. You can still have fun solo but just know that the grinding is possibly the WORST I HAVE EVER SEEN and honestly is one of the main reasons I quit tbh. You aimlessly roam around in the most boring way possible to press E to collect credits to unlock a \"pass\" (you dont have to pay real money its just in game credits though you can on your own) which you then have to get medals for. The weapons are awesome and you can have fun, but like I said Arrowhead is so unfair with \"fixing\" their games that there are just REQUIRED ways to play. I know this is like every game and hard to say, but when you have a game with over dozens of options, and you constantly have to play the same 10 or less weapons, skills, etc, it kills the funs. But if you are willing to take a risk go ahead. \n\nI am writing like a disappointed person because I am and I cared about the game, it was some of the happiest times I ever had before greed or laziness took over. I cant tell because arrowhead cant even respond lol. \n\nSee ya, helldiver out",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Havent been able to play since september, the game is crashing and hardlocking my PC, the reccomended \"fixes\" are not working. Everytime I launch the game, my just freezes completely, becomes unresponsive and I have to hard restart the PC. Its a good game, but - this has not been fixed in over three months.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Helldivers was fun until the devs decided that the next big thing would be getting stunlocked by hordes of both flying and land enemies (all armored btw) while you can't even aim a pistol properly because the devs said so.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "'Update' every couple days that is less than 0.5G, and has to redownload the entire game every single time it happens.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fuck this game!\nThis game is really fun to play but It turns off my pc sometimes right away when enterigng the game but if not after a game or two):",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The moment to moment gameplay is great. \nThe game sells itself as an experience of holding a machinegun into an overwhelming horde of insects or whatever and fighting nonstop desperate defenses as the enemies keep coming.\nAny individual mission is going to be a fun time.\nBut in the long term what carries a game like this is the community and the relationship between the community and the developer.\n\nI think the best example for all of this is turrets.\nIt used to be possible to position sentry turrets on top of elevated terrain. \nThis allowed you to setup a little local defense zone, but was deemed to strong by the developers and now it is no longer possible to put turrets into cool places.\nBut the turrets have always had limited ammo, the angle that they can aim at is fairly limited, any enemy capable of shooting can just destroy them and taking a turret in one of your slots means you didnt take a combat mech, minefield, nuclear bomb or airstrike instead.\nAdditionally most missions in this game require you to move to several places and you dont always get nice locations for this strategy.\nWe were never in a meta where everyone just spams turrets and trivializes the game with just turrets and yet the ability to do any of this was removed.\nAnd boohoo you can still spawn them on normal ground whatever no big deal, but this kind of philosophy keeps happening to everything. It is a death by tenthousand tiny cuts.\nYour weapon that you like now has slightly more recoil, slightly more damage falloff etc and it is never a big deal on its own but then after a few months of this suddenly there is a big emergency patch where many different weapons get buffed again because the game has reached a rather poor state in its balancing.\nAnd then the ten thousand cuts return and its just this again and again.\nThe game is being balanced like the most competitive esports shooter where everything must be perfect and nothing can be too strong but the consequence of being \"too strong\" is killing insects a little better.\nSo what? \nBack to the turrets.\nAs a consequence of this change to the turrets there is now often the case that you cant spawn things even on perfectly legimate terrain.\nStuff will bounce off completely normal ground and roll to Narnia where it then deploys where it isnt relevant.\nIn an attempt to enforce balance the overall experience has become more buggy for everyone.\nThere are giant amounts of technical issues.\nAnd these technical issues dont dissappear they simply get exchanged for new ones.\nIf your game or session crashes for a completely new reason, it still crashes.\n\nSo again, playing 1 round of helldivers and holding a flamethrower into those democracy hating insects is great and nothing will ever change that. But you have to be prepared that your flamethrower gets declared as too good at killing bugs and does less damage.\nAnd it might spawn flames that are invisible to teammates frying them when they dont know what hit them.\n\nIt is a frustrating experience to try and like helldivers in the long term.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I enjoyed the game until it crashed my computer every time I logged into the game, sometimes to the point I would have to hard restart my PC. Please fix your game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "After the updates from today and  the previous one, my pc is crashing  every time, and i need to force restart . This is not nice.. please fix.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I used to love this game, even was a die-hard fan for it for a long while . . . but the experience I came to love frequently gets altered or ruined by bad updates and patches, making parts of the gameplay loop feel worse, and then it takes months for those awful patches to be reverted or changed in response to player feedback. Time and time again, and that's not even addressing how these repeated updates to the game have tanked the performance into the floor, with them only *now* addressing the issues. This itself wouldn't be that bad, but the most recent update was so large that I literally did not have the disk space for it (120 GB of memory, yet the game itself is already at 130 GB). Would I really want to uninstall a bunch of other, smaller games I enjoy that have a stable and consistently enjoyable experience, or uninstall the game that is never consistent on anything?\nThe developers themselves aren't exactly saints either, given how they targeted out the content creator Eravin and treated him like shit (if you are curious about what happened, here's his own words: https://www.youtube.com/watch?v=6h4ugKpz_oU).\n\nI used to love the company, and I used to love the game, but neither is the case anymore. The game is a balance mess, the gameplay is hit-or-miss much of the time, and the company itself is shitty (and by the way, they didn't help cover any damages caused when their game was literally crapping out people's PC components from their own messy code and poor optimization). I'd rather just play DRG (Deep Rock Galactic), where the experience hasn't been horribly tampered with, and the company behind it is chill (it's getting a new update/season too soon after a long wait).\nIf you were looking to play Helldivers 2, I'd highly recommend playing Deep Rock Galactic instead, since it is far more consistent and far more team-based, much like this game was originally intended to be. Less toxicity, less headaches, more stable, and simply a more consistent playing experience with its own fun humor and great community; you'll get a similar overall gameplay experience, but far, far less of the bugs and annoyances you have to deal with in Helldivers 2.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I love this game..! However, I don't understand... is this their funny way of banning PC players by making the game un-launchable, crashes way too many times, freezes up every 2-5 seconds, a glitchy/buggy mess and really all of this makes the game unplayable? The content I am missing on by simply being unable to play the game at all is so disheartening. Could this also be a Windows 11 issue too? In any case, they need to fix this STAT!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Arrowhead made my favorite game, Magicka 1.\nA beautiful glass-cannon style power fantasy that's creative, hilarious, and easy to understand.\nThey (and/or the publishers) then proceeded to overload the already unstable engine with DLC.\n\n\n\n\n\n\n\n\n\n\n[i]Foreshadowing is a literary device in which[/i]--...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The gameplay is overall good when it works. I have put many hours into this game and enjoyed most of it, tolerated many bugs, but recently too many crashes, freezes, and connection issues all this with an intel 285k and a 5090. Right when I finish some missions, I get disconnected from the game and basically get no rewards. I'm not sure how people are able to play this game currently. Every time i try to start it up, it freezes my computer and maxes out my gpu fans until i just completely reboot my system. Kindly, please prioritize these fixes above all else. No other updates matter if we cannot even run the game. Until these bugs are addressed, I suggest people save their 135gb+ of storage and play another game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "please for the love of liberty investigate the reason for pc lockups! we've had 1 large patch and 1 small one to address the crashing issues but in turn have just caused more crashes. and for the first time booted the game, went to start mission, hopped in pod, complete pc hardlock requiring hard restart of the system.\n\nthis can (and in some cases has) cause complete SSD brick ups, requiring replacement. Don't play a game that can damage your pc!\n\nif this ever gets fixed i will come back and change this review because the game itself is fantastic fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Tbh game was fun early on but got tedious and boring overtime and after all of the updates they made the enemies more tanky yet Nerf the weapons to kingdom come",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game comes packaged with malware (Gameguard).\nCannot recommend this game at this time. Come back when it does not install malware into your system.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I adored this game. It has depth, charm, wit and bottomless replayability. \n\nHowever, I haven't been able to play it for months now, because the game hard freezes my entire computer about 1-2 minutes into any given mission. None of the dev's recent updates addressing technical issues have changed this for better or for worse, even slightly, and  I am simply left now with a ~120GB waste of space that I will be uninstalling until Arrowhead address this issue. If they ever do, at this point.\n\nDamned shame. See y'all on Arc Raiders.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "When the game works, it is a beautiful piece of FPS work. The enemies are well balanced at each difficulty, the world creation is so immersive and all the loadouts and weapons are so much fun that team killing accidents are always hilarious.\r\n\r\nThat being said, I run a 4070Ti. This game runs it to 97% capacity with moments where it maxes out. 32GB Ram and an 11th Gen I9. The game crashes almost daily. Often, I don't get the mission rewards and so have wasted 30 minutes of serious hard work.\r\n\r\nIt is beyond me why only this game out of the hundreds that I have, is so resource intensive, even on the debriefing screen where it counts your completed objectives.\r\n\r\nIf they optimise the game better, I will change the review, but I cannot afford an even better PC to play this game more reliably.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is absolutely unplayable. For the last 2 months every time I play this game it freezes and hard locks my PC. had no problems prior to this loved playing, simply can't play now.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The only game to successfully soft brick computers via hard locking the entire system and forcing a potentially corrupt shutdown, I mean bravo.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I would love to recommend this game and maybe it's only a few people who have my specific issue but it is a known issue and has been for it's entire lifespan.\n\nFor whatever reason this is the only game in my Library that can't Update properly. Basic 2-5GB updates take 5hrs. It's actually quicker to uninstall the game (All 140 bloated GBs) than to patch it.\n\nForums say that it's because it moves the entire game off your SSD and does the patch installation on your most free hard drive and then moves it back again. No other game, even the 90GB ones do this and I cannot find a fix. I'm not uninstalling and reinstalling a 140GB game on my SSD once a month so it's time to say goodbye.\n\nI have 2 more gripes, 1 is the fact they refuse to make some weapons viable which indirectly forces you to take the same loadouts and playstyles each time. Not a massive issue but for a game which thrives on variety and repeated runs, it's an odd choice.\n\nLastly the Medal, Currency and Sample Cap has no right to exist in a paid game like this. If I want to save up my Medals so that when the time comes I can just unlock all of a Battle Pass once I get it, that is my choice to do so. Capping people and giving out zero rewards is a shady marketing tactic to pressure people in putting extra money in sooner than they may want to for fear of making no more progression in the game. This and the overly grindy nature of every unlock leaves a bad taste in my mouth.\n\nAll this to say, it is extremely fun which is why I've put so much time in and outside of the update issue I probably would have continued to jump back in now and then with friends. If you find you don't have this issue, give the game a go.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ruined the game with the nerfs, not a competitive shooter, should be a power fantasy game not a grind.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Love this game but their slowly gonna kill it with their dumbass patches and severe lack of optimisation",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not worth playing currently in the slightest the mix of the just awful balancing and new enemies making the game super unfun.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Well well well...\n\nI've put quite some hours into the game through some years, and now I am frankly disgusted by what I am seeng.\nI am done watching how the devs massacre and rape the game which at some point was peak co-op combat.\nYes, I am talking about hidden nerfs, they've been a hot topic, and hear me out why me specifically find it outrageous.\nY'see, the game needs new content. Right? \nExactly, you will say.\nNow here is a Catch, how do we make players more interested in the new content?\nThere are many ways: \n1) make new weapons which introduce new mechanics and gimmicks, they might not be the meta, but fun to use;\n2) introduce new enemies which are fun to fight and/or feature new approaches to the enemy design;\n3) introduce new type of mission/rework the existing type of mission\n4) rework combat sandbox to make it deeper/more interesting.\n\nSo, me, a talented and experienced amateur in the world of videogames (I've been playing videogames since about 2001) have ennumerated 4 cool ways to introduce new content. I have seen them before in other games.\n\nThough, Arrowhead chose the dumbest and laziest way. That is, to make the player weaker and nerf existing weapons and combat sandbox into oblivion.\n\nOh! And it' STILL played by connection issues! Whenever I was not the host I could not play at all!\n\nAt the moment there are better alternatives to PVE combat co-op games.\nTake:\nDeep Rock Galactic\nWarframe\nReady or Not\nDying Light series\nMycopunk\nJump Space\nto name a few.\n\nIf Steam policies allowed it, I would refund the game and all purchases made there.\n\nI hereby implore all helldivers to initiate mass review bombardment of the game. The developers are traitors to Super Earth and Democracy.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Casual PvE action shooter that had a fad phase and is now in its last stages. It can be fun with teammates and trying builds, but it's in maintenance mode now.\n\nOn the technical side, expect low fps, stutters, p2p networking issues.\n\nNew players will face a p2w grind, a store filled with gear packs (\"warbonds\") that are mixed bags and generally cause choice paralysis. There is a declining (but stable) player base, but this game is well past its prime in terms of players having fun and spontaneous teamwork going on.\n\nOverall, the game and developer has an internal identity crisis and at this point has missed the boat with current trends on what's possible for multiplayer games.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "i cant even play this game bro, i get to the loadout screen and my computer *turns itself off*",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Helldivers 2 is a fun game with friends, but not fun enough to stomach a 135GB file size and terribly optimized update downloads that basically make you reinstall the entire game every few weeks.\nOther Third-Person shooters at similar graphical levels offer more content for fewer paywalls at a fraction of the hard drive space. Especially damning considering the console release takes up a fifth of the space.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As of 11-12-25, this game is a risk.  Its not if, but when it will break your computer.  Seriously, play at your own risk.\n\nEdit: 11-19-25  Changed nothing after finally getting stable.  After patch, hard shut downs again.  Uninstalling, not worth the effort..",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "game was promising like six months ago but its been on a nasty downward spiral. the developers are pushing really hard for one specific (maybe the most boring) playstyle, making anything the player has direct control over feel horrible, and pushing the enemies into being unfun to fight. one of the original strengths of this game was the build diversity, but that has just been neutered. if you dont want to use explosive weapons and stratagems that just kill everything for you, good luck. \n\nyou managed to take one of the coolest concepts for a game and gradually morph it into a shallow, hollow, boring husk of the original idea. if you manage to pull your heads out of your asses and make something thats fun to play, i may be back, but until then i will have only my memory of what this game used to be.\n\nleaving the game online while it is actively destroying the players' computer components for months is inexcusable, and using the development time since that ordeal started to continue to make decisions that make the games less fun, lie about it directly to the players' faces, and not even mention let alone fix the hardware bricking issues that you caused is unforgivable. \n\ndo not buy this game",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Everytime this game stutters or freezes due to the engine's audio issues makes me an inch closer to burning my tits off",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have seldomly seen a dev team so up their own asses about \"balance\" in a purely PvE game that is still riddled with game breaking bugs, to the point that it compromises people's hardware. It totally has the potential to be a terrific game, but the asinine philosophy behind its continued development keep holding it back.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's getting too large of a game, I cant have other games downloaded as well. I'm likely going to have to delete it. Maybe in the future it will be worth having downloaded but until they lower the space its not worth it. If battlefield could do a game way smaller then this game can do it too.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great Game! Love it! 2 years ago.\n\nUnfortunately, I will have to thumps down due to the current state of the game. It is unplayable! Crashes every 10-15 min in due to poor optimization. Devs critics feedbacks is nonexistence b/c they don't care. All in all fix the game and the attitude and I will thumps up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Games been fun for the first few months I've been playing but the studio has really been getting ahead of themselves on new additions to the game over testing and bugfixing so issues stemming from that stability wise are beginning to really show now, maybe think of buying the game later when it will actually be playable if you haven't already.\n\nYou aren't going to be missing out on anything ingame that won't just happen again later anyway",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is pretty cool, but the recent update literally made this game unplayable. I have a pretty beefy pc that I use, and even THEN I get these like weird freezes & crashes, to the point sometimes I have to turn my pc off, and back on to do anything. Even setting the graphics to LOW didnt fix it, like what the hell? How do you manage to make a game so unoptimized that even the most beefiest of pcs literally explode??",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Never ending loop of game doing exceptionally well then patch drops with unpopular changes that either ruins your favorite load outs or makes the game actually unplayable performance wise. I don't want to play a game that renders itself unplayable for months at a time fixes itself for two then goes down again. \n\nThe dev team has a vision to inconvenience you at every possible moment they can.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is good. The publisher is not. \n\nAfter finally bailing on PlayStation brand due to Sony's progressive, insufferable incompetence and fully switching to Steam, I decided to buy Helldivers 2 again, since as I said, the game is good. However, Sony managed to screw me over here as well.\n\nDespite having the whole \"Link PlayStation account\" thing set up, which was unnecessary and caused huge controversy and backlash back in the day, there is no form of cross-progression at all. The only things this linking accounts was mean to do. These fools can't get one thing right. \n\nAfter 200 hrs on PS5, I refuse to start from scratch, because of Sony's incompetence. Unacceptable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fantastic game, but the optimization has genuinely gone downhill",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a starting player, this game is unfair in many cases.\nI dont know how it was on Day 1, but now, gathering resources, even with farming means, sucks. You rarely get what you need and most you'll get are \"weapons\" (which are always off-theme, flamethrowers for Illuminate, armor piercing for bugs, always the opposite of what you need) which are always useless.\nStarting guns are abysmally uneffective, even complicating the solo situation. The missions you do manage to get out off (not thanks to the game but, thanks to your high-leveled friends) and farm medals , are locked behind warbonds, which means you are stuck on peashooters for the first 15 levels or so of the game.\n\nThe game is turning out to be much more fun to watch or to use others' items and weapons, than to play with my own items and guns or try to level up or farm solo. Its boring and bad for someone which are starting. I do not recommend this if you dont have time to dedicate grinding countless hours to start getting to the fun part.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Devs outright admitted to wanting to change their horde-slaughter game into a milsim while actively lying to/ignoring everything the players ask for to retain \"muh realism\" while making the game incredibly unrealistic.\n\nIf you like a game that requires you to abuse mechanics that will be inevitably patched out just to play at the higher end difficulties, go ahead. But if nonstop crashes and in-game issues are a dealbreaker for you, give the game another year or two to sort their internal issues out.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Helldivers 2 is an incredible game to play. Arrowhead have created something unique yet familiar, and is an excellent experience well worth the money. However, it's also a mess of connectivity and software issues. For the last few weeks (as of writing, Nov. 2025) I have been unable to launch the game without an immediate crash to desktop, and no error code given. I have tried every common recommended fix, to no improvement. I am unable to use this software that I have paid real money for. Until I can simply play the game again this review will remain negative, in spite of how much I love Helldivers 2's gameplay and personality.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm not the most critical reviewer, but I am a below average skill gamer with a few braincells so i'mma say my piece\n\nBefore the redacted warbond I had gripes with this game, enemies phasing through walls, most my weapons shoot like nerf guns, opponents that have no immediate understandable weak point, and falling through walls getting sent straight to hell, but that was all ok for I have played Dark souls 2, tolerance to this level of BDSM and shenanigans is simply second nature... But then the optimization issues came like the gimp testing his new whip, striking with the might of Kratos upon my ugly pale ass.\n\nYou see while the previously mentioned Dark souls 2 will bust your balls, it had mechanics and designs that not only people love in that game, but also went on to improve the quality of newer titles by Fromsoft. While it may be an extreme comparison, the amount of incompetence in these newer updates is painful as the quality did not go up and up, instead it spiraled down taking all of my frames. Not only has the game managed to look worse (like textures FEEL sloppier) the performance has been taking a nose dive. Just last month I was experiencing quite a few crashes, now I can't play for 2 minutes before crashing. For context My cpu is the ryzen 9 5950x and my gpu is the 7900 XTX neither of which are bad parts (I have only had them for a year) so tell me why on even lower settings I still crash?\n\nI'm sure there is tons of other complaints I could make, or a more detailed analysis to be made, but I'm to lazy to do that. To anyone who may not have bought the game yet and are wondering if it is worth it, keep it as a thought as IT IS NOT WORTH IT.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is still suffering from terrible performance issues, crashes. even bricked some people's computers. and it seems the devs don't care about the game anymore. well, it was fun while it lasted. see you guys in ARC Raiders.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "so many fking bugs and glitches. they said they fixed the performance issues but the game still crashes randomly. a total fking mess.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game has a very bad problem of spawning enemies behind you. Read the following guide that comprehensively, scientifically, breaks down exactly how this game's bullshit enemy spawning mechanic works,\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3210768641\n\nThe difficulty in this game can spike to ludicrous levels randomly, for no reason other than because the game decided to spawn enemies behind you.\n\nEven if you move tactically, from spawn camp to spawn camp, nothing is stopping the game from spawning a massive Harvester tripod from the direction you just came from. And then, when you're busy dealing with the Harvester tripod that spawned behind you, it will spawn a Watcher drone in the complete opposite direction, and you won't be able to stop it from summoning reinforcements because you're too busy dealing with the Harvester.\n\nI'm only in difficulty 4 out of 10, and I've already been experiencing fights that last more than 5 minutes, just because the game keeps spawning patrols around me as I'm busy dealing with the patrols it's already spawned. Constantly spinning my head around, trying to keep an eye out for more bullshit patrol spawns while I'm fighting.\n\nThe only time this bullshit stops happening is once you've cleared out the entire battlemap of spawners, at which point, the enemies will always spawn in the direction of the nearest map border.\n\nThis turns the first 80% of every mission into an exercise of clearing out spawners, just so that the game stops pulling this bullshit.\n\nThere's nothing more infuriating to me that fake bullshit difficulty like this.\n\nEventhough we have multiple lives per mission, nothing pisses me off more than a game intentionally designed to gaslight me into thinking I missed clearing out some enemies.\n\nThere's no reasonable counterplay to this bullshit, besides the method described in the guide of hugging the map borders.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Well folks, it's been real, and it's been good, but it hasn't been real good as of late.\nAs a long-time supporter and optimist about the game overall, I've finally hit my breaking point today.\n\nI've spent the last few months waiting for updates and bugfixes, booting the game up, experiencing a constant cavalcade of bugs, disconnects, softlocked missions, mobs phasing through terrain and buildings, stuttering (ON A 5090 BTW) and crashes.\nThen I wait another week or two, and turn the game on again to have the same things happen again.\n\nToday it hardlocked my PC.\nI'm done. This broken mess of a game isn't worth risking 1000s of dollars of hardware just to try to play.\n\nI have lots of good memories with this game, but they're all from like a year ago, before it degenerated into it's current state.\nMaybe I'll be back in 6 months or something, i dunno.\n\nThe devs have done some great things and made some choices I respect, like their dedication to having everything in game be earnable for free (within a reasonable time too), and not having a FOMO shop, even giving out content that was supposed to be paid, for free, just for goodwill because people thought it was overpriced.\nBut until they fix the trainwreck of the current gamestate, I cannot recommend this game to anyone.\n\nThey're supposedly in the middle of an \"all-hands\" focus to improve said gamestate, even pausing content drops to do it, but at the time of writing we're two patches into that and... I'm not seeing any improvement.\n\nMaybe I'll give it another shot down the line, see if they were able to pull through, but for now I'm done.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "When you start messing with Gen AI in your game I stop messing with your game. Simple as.\n\nPay the people who made your assets, not the AI companies capitalising on them.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wish I could leave a positive review for this game. It was probably one of my favorite shooters of all time, because the gameplay is more focused on moment-to-moment strategy, taking use of deep system mechanics, and crafting effective loadouts. It still is that game despite several enemy designs trying very hard to counteract this.\n\nNow, the devs do address these issues, but it's rarely ever everything that needs to be. Over time we've had these \"it's so over\" and \"we're so back\" tides coming and going for this game. However the devs have in their most recent attempts to please the community, still hidden changes or obfuscated them to make them unclear to players that nerfs every single weapon in the game. Some will say it's in pursuit of difficulty but the deceitfulness towards that goal and the lack of consideration for actually satisfying weapon designs that tightens the game more and more in terms of what loadouts aren't trolling (trolling can be fun though).\n\nI loved this game, a lot. But between performance issues, a weakening meta, awful new enemy designs, poor community communication, and so forth, I just simply have better games to play and learn, so I haven't opened the game for quite some time. I'm not an angry, reactionary reviewer, I'm just sad that the game I enjoyed refuses to excite me with content updates, and instead offers me only more dread at the idea of playing new content.\n\nDo not buy this game. Do not trust a comeback. Do not let news headlines suck you in to giving it a chance. The devs will improve the game, but only to make it even worse in the near future thereafter. I hate it.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}