{
  "positive": [
    {
      "review": "258 hours..... \r\n5 full restarts\r\nMore than 40 memory repos\r\nDay restarts?...... I stop counting after the first 200......\r\n\r\nDid I had fun? Yes\r\nDid I had a desire to make a lobotomy for myself? YES\r\nDid I hate this game? Yes\r\nDid I love this game? YES!\r\n\r\n3 of 5 restarts and almost all memory repos, because I had 96% codex and 2 fu^&^ didn't want to show up (Doctor and BALD).",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "idc how statistically impossible it is german rifle man can solo the entire game with enough time",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "this game is very peak and good and i got to day 45 before realizing i didnt unlock bina cs yet but play the game!!!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The abnos all feel unique and the game can be painful at times but it feels rewarding completing a hard day/mission.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "It's like if you made torture into a videogame, and then the videogame is one of the greatest ever made. Modding it makes you a pussy but you should absolutely do it",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "guantanamo bay torture simulator. very painful. very euphoric.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": ">Lobotomy Corporation\r\n>buy game\r\n>look inside\r\n>no one gets lobotomized\r\n>\"wtf.jpg\"\r\n>10/10 this should've won the goty",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really good monster management sim with a super fun gameplay loop, charming visuals and a good story. \n\nI'd say the one issue I had with the game is that its tutorials could be improved slightly, as right now they dump a massive amount of information on the player all at once, though in my opinion this is only a minor issue and once you get past the first hour the game does a very good job of explaining new systems as they are introduced.\n\nThat stupid magical girl can eat shit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When Project Moon decided to make such a story, they made great decision, which for some reason is almost always ignored by other devs and companies, to make a refined world that is not just completely optional part of a game / series, but an essential place for story to unfold, that lives by its rules and is basically one of the forces which makes the story progress. On top of that, world is expanded way more by LobCorp's successors and actually is one of the biggest reasons it got me invested in series in the first place.\nGameplay wise however, LobCorp is absolute torture(but the one you absolutely need to experience yourself). You get a hang of it pretty fast, and 80% of the game can go completely smoothly, but some challenges the game throws at you are absolutely unbearable and make you question your life decisions(yes Hokma, im talking about you). And while it technically makes sense to have a hard time because of story reasons, it still sometimes gets really annoying to replay the same day over and over again just because you didnt get lucky enough.\nOn top of that, getting 100% abnormality dissolution for epilogue is another questionable decision(the amount of times i had to restart same one week for that is diabolical). Actually made me use speedhacks because i was not willing to replay the game from day 1 for better chances of getting lower level abnormalities. Made me respect Ayin really much though, dude got way more dedication than i had.\nOverall, the game is best experienced when you have a ton of free time, but make sure to rest from time to time as it gets kinda frustrating or repetitive sometimes. If you're peak story enjoyer, then Project Moon's world is definitely for you\n10 forgotten Magic Bullet users  / 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Probably one of the single best gameplay loops I've ever experienced. I picked this up after initially dropping it for 4~ years after getting to Day 28 and after completing PMs other major works its a breath of fresh air.\nI like the gameplay loop.\nI like failing.\nI like being frustrated and overcoming.\nI love it all. Thank you Project Moon for this incredible, yet so evil masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "getting research on abnormalities is like stepping through 8 layers of eggshells and every time you step on an egg your skin gets peeled off & your balls get ripped off\r\n\r\n\r\n\r\n10/10 game. best one I've ever played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Idk why i like this game tbh... Prolly a combination of lil things that scratch muh brain the right way. always a fan of the whole SCP type story and gameplay thingys. I like having muh lil guys who i've customised go abt the place and face unfathomable horrors beyond their comprehension :3 ... There is a big skill curve towards the end of the game and certain factors which can ruin runs but the 'rogue-lite' element makes me happy to replay whenever that may happen.\r\n\r\n P.S there is a weird RAM leak issue thing which u'll prolly need to look up a guide to fix or something",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just lost all my progress due to accidentally unplugging my laptop charger thus causing an shutdown in the middle of the game. But that's probably part of the game since suffering is the game main theme.\n\nStill a fun game though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "so i already know all the abnormalities and lore, and this game is good just wish i could forget everything from pakpaks video, anyway i dont do retries i am more of an ironman player and i got mountain of smilling bodies in my training team after opening it after maxing the control team so i dont know the exact day but i think that is under day 10 that i got my first aleph",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great storytelling, great character design, Gebura is a 10/10 and Chesed is my spirit animal. 0/10 would not recommend even to my worst enemy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game HATES you for playing it, and that is part of the charm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wouldn't really recommend, but I like the little designs, the gameplay is painful, my eyes are tired, the whole building is on fire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "express train to hell is agony and i cannot believe i cleared day 49 with it, and to also think i managed to keep my starter nugget alive is something i am proud of. 10/10 will never play this again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Naming agents after my friends and forcing them to face the horrors for fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is hard, if you don't like micromanaging dozens of Agents this isn't for you, warning you very early as this game will kick your teeth in unless you're prepared. Music and Abnormalities are really good, additionally trying to figure out what the Abnormalities do without much info is really good, I wish there were random aspects to make it new each time as once you know them all it doesn't change and only mods can fix that really. Overall really hard but really fun game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just beat this game and all I can say is it feels like being lobotomized with how tedious it was at some points. Forget the difficulty, at a certain point the real challenge of this game is putting up with doing the same thing on the same abnormalities over and over again until you can get to the proper stuff. With that being said I absolutely love this game so go play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is great.\nSome of the characters and their stories are amazing.\nMy favorite part is probably that the bosses in this game are extremely challenging, most of them in very unconventional and creative ways. Finally beating them feels like a real accomplishment and a testament of your skill and, on occasion, good luck. And also the rewards for beating them are sometimes outright game-changing.\n\nThe game could definitely use some more music for just normal gameplay where nothing bad or special is happening. But special music is very good, it can be intense, stressful, haunting or chilling.\n\nThere is some jank and I do recommend installing some QOL mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a masochist or just enjoy hard ass games. Try this one out. Its basically the side effects of being drunk and having to deal with 13 tigers at once.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For almost 200 hours i have listened to my friend go absolutely insane over this game and they refuse to post a review until they have beaten the game, i firmly believe by the time they beat this game they will need a lobotomy, but who am I to judge, also butterfly man and and sharpshooter can GET it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely unforgiving game that beats all other games in the Project Moon series in terms of difficulty. One slight mishap or a single moment of letting your guard down is enough to raise hell and fuck up and entire day and I love it. You are pretty much guaranteed to reset everything on a first blind run and this game has ZERO patience or sympathy for you, the manager. Despite the masochistic mindset required to play this game it has so much replayability and enjoyable gameplay (for the most part) and I could not recommend this game more for anyone who enjoys a tense management game. And honestly whether you want to just make it to the end, learn the lore, or 100% the game, you will not be bored of things to do due to the sheer amount of shit you have to pay attention too, absolute 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have spent 4000 hours of my life playing this game and i can say that its the best piece of fiction ive ever had the chance to experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jesus, This game is HARD hard, retrying would become muscle memory, even the simplest thing WILL mess you up. The wiki page is probably the only option for progress unless you'd want to suffer from RNG, however, this game has so much to offer and a lot of detail. Unique game that turns corporation sims into hell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play the game \r\ngets to day 14 \r\ngets nothing there\r\nall employees die after i look away for a second",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this ages ago, before the SCP foundation became mainstream, in fact. And I was never able to go very far in the game. Not much in the field of walkthoughs online and the difficulty goes from 0 to 10, completely skipping the other 9 levels. \r\n This being said, it's intriguing enough to have me come back to it once in a blue moon. Recommended, I guess?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is basically Fallout Shelter for masochists. Regardless of whether you came here from Limbus Company or elsewhere, if you enjoy looking at impossible odds only to think to yourself \"Nah, I'd win\", then this is the game for you.\n\n10/10 Would let BongBong solo [spoiler]Red Mist[/spoiler] again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect game if you want to  speedrun experiencing schizophrenia, insanity, insomnia, chronic stress and mental exhaustion all at once for 50 days straight under the watchful eye of a borderline android\n\n10/10 would suffer whitenight again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite overall deep stories in a game, but the game itself is the most punishing thing i have ever played (as fitting a story about how hard it is to change and grow as a person), and as such isn't for everyone. I love it, but cant reccomend it without prefacing it with the fact the fact loving it means there's probably something wrong with me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite sucking at the game I absolutely love it. The ost, the art style, the story, and the gameplay are all really good. The best introduction to Project Moon's games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked SCP, and this was a fun game to give a try. I loved the story building and game mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game for so many reasons, the story telling, the music, the characters, the art style, the creativity, it's one of my favorite games I've experienced playing. \r\nI will say though, it can also feel quite tedious, even stressful to play, which it honestly should be. I don't mind it personally, but I can understand that turning some people away. Personally, once I reached day 10, I was locked in to the story, with many other moments to follow that altered my perspective on the world so deeply... \r\nIt's peak\r\nSIlent Orchestra was a mistake though the Head should personally execute that abnormality in particular.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't have many hours on this game, and personally the only reasonI'm here is because I played limbus and ruina, but I despise the apostles, other than that good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The start of the PM Franchise! So cool!\n\nAs you may of heard, it is a hard game, with a great story to boot if you also like that kind of stuff. It has some bugs, but they're pretty minor from what I've seen and experienced. If you're trying to get into the game series and this game isn't quite your tempo, then that's perfectly fine! It's not like you need to play the games in order, or anything (unless you like playing stuff chronologically). Go on and try out Library of Ruina and Limbus Company, as they're less \"Real-timey\"! If you do intend on playing through this game, here are some tips! From a #pro! (beating the game)\n\nProtips!: It's perfectly fine if an employee or 2 dies! Trust me, keeping all of your employees alive to the end of the game is comparable to a challenge run. It's really, really hard. And those employees are fine anyways, it's lore stuff. If you love me let me go type stuff\nYou will have multiple restarts! Don't worry if you have to do that, it's all part of the game, literally. Literally every gameplay feature is tied to the lore. It's pretty cool.\nMissions are really important! Besides the giant \"this is how you experience the entire story\" thing, completing missions will grant buffs that are super duper useful! And on completing every mission for that branch, removes the \"DO THIS ABNORMALITY OR THEY WILL DO SOMETHING BAD\" timer on every containment chamber for that branch! Pretty cool!\n\nSo yeah, amazing game. Don't like it? Try the other games Project Moon has made. Don't like those? Watch gameplay videos on YouTube! Don't like those? Oh well! bye reader",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game I love it, I would recommend it. One of my most favourite (I've not finished it yet). very amazing 2D management Simulator\r\n\r\nThe game sucks the soul out of me with how long the days get when you try to micro manage everything to prevent failure and level worker stats. This game definitely gave me more braincells with how much I must remember about each entity. Truly the best management simulator I ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay so where do i begin.... this game is hell. If you cant stand basically restarting the game 30 times because you misclicked a box and now your entire facility is covered in pink gooey slime because the slime mommy got pissed and escaped, then dont play it. It is hard. Very hard. And not to mention that you have to put precious time into every character and monster. \n\n     BUT, if we're ignoring the difficulty... then it is an AMAZING game. The story is amazing and well put together, it feels like every little thing that happens in the story matters. the character designs and emotion is actually REALLY good. Every character (except that bum hokma) is loveable in their own way (ESPECIALLY netzach...).\nSo now the gameplay. Whats it like? looks weird, boring, annoying, and complex. Well youre right! You start your facility, train nuggets (agents), get them cool armor and weapons, fight cool abnormalities, unlock more and more, \nand be proud of yourself!\n\n     Game seems fun right? Well then why is it all that bad stuff mentioned earlier? Because stuff happens. Like after all that then a plague doctor becomes a seraphim and turns 12 of your agents into apostles causing your entire facility to be wiped out in a matter of minutes so you force one of the apostles to pray to the in-game god/jesus of this god-forbidden city (who has no lore and is only relevant as the starting abnormality) to smite it down with a laser that does 6666 pale damage (strongest damage type btw) and save your last 4 employees.\n\n     10/10 game! We love it! Don't forget, lobotomy corp needs YOU.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not for everyone.\r\nYou will not be spoon-fed information. You will have to drag it out of the gameplay loop with blood, sweat, and tears.\r\nThis game should be treated as a rogue-like, with an expectation of successes being along the lines of \"if at first you don't succeed,\" try and try and try again.\r\nDo not be afraid of starting over: knowledge begets progress.\r\n\r\nThat being said, the story and the world this game builds defies expectation. The lore is deep and rich and I am still being drawn in again and again after 100 hours of game time. Do *I* recommend this game? Yes. Do I think everyone will enjoy it? Certainly not. But if the idea of an SCP base-management game intrigues you, give it a shot. Just don't lose your head over it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story was amazing and I enjoyed the story, the gameplay itself was hell. I realized that I like managing and simulations but only on creative mode and stuff, overall I really enjoyed the story mostly and kind of enjoyed the gameplay, this game is NOT for the weak though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A small part of a grand world, this game truly reflects the greatness of said world. I look forward to future creations by PM.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is cool, here's a few things to make your playthrough 100x better than mine:\n\nI highly recommend downloading a couple of mods even for your first playthrough.\n\nI used Optimization and DetailedInfo from Nexus (along with BaseMod). Neither of these really impact your gameplay but Optimization can save you from a potentially disastrous game crash caused by a memory leak (that a certain big, scary monster from the dark, dusky forest inflicted on me upon dying) and DetailedInfo just grants a tad more awareness on the happenings behind the 'Common,' 'Very High,' etc. work results.\n\nThe game is fun and people call it hell because of the endgame and boss fights but they're, like Ruina, good tests of your multitasking and planning skills which naturally punish you for any minute error. Yeah it's annoying, but the game gives you some really nice tools such as memory repository to hone your skills.\n\nIf you're gonna play and see this review, here's a great piece of info that isn't super well explained in-game:\n\nReturning to the Memory Repository (most recent day ending in 1 or 6) retains ALL of your EGO and Unique PE boxes as well as observation level--however it resets your nuggets (agents) back to the state they were in on that day (EGO gift-wise and back to life if they died). But crucially, mission progress is KEPT. If you finish a boss fight, complete a bunch of missions for multiple departments (including ones you unlock and then revert to a point where you don't have them unlocked anymore), you will keep the mission progress AND respective department research. Resetting to Day 1 has a similar effect of keeping your EGO and mission progress, but it will remove all of your employees. A certain Training Team 'upgrade' will help out a lot if you plan on doing this.\n\nTrue ending requires 100% main-game abnormality dissolution (observation lv. 4) and completing all Sephirah missions. If you reach Day 45 and haven't done all of these, you WILL have to go back to Day 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game came out of project moon but i wish it had butt booty ass naked gregor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just beat this game and I have no idea how to feel about this game. It is one of, if not the, hardest games I've played. There is so much I could say and so much I shall not. Play this game and push through. Face your fear. It shall build upon yourself and your future. There are no words to express how this game makes you feel. It has high highs and EXTREMELY low lows, but it remains worth it. The suffering, the joy, the hatred. All of it, worthwhile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worst and best game that I've been gifted ever\n(330 days since acquisition, still havent beaten it once)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is like crack with all of the side effects and withdrawals, i can't stop playing it but i wish i could i fucking hate it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "will write proper review once i fully beat it, but this game is like crack. def not for most players, but if you are just the right kind of person (read: loves taking notes and methodically developing a strategy based on trial and error) this game will fuckin grab you and make your brain into a smoothie and it'll be the most fun youve ever had",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Weaver did not like this game because this game wasn't made for actual lobotomites.\nHe'd be a great Project Moon fan though, cause he doesn't read.\n\nHope this helps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally enjoyed this game, so I've labeled this as a positive review, but truthfully I have no idea who this game should be recommended for.\nBear in mind that this review is coming from someone who has not played the other Project Moon games and does not play video games frequently. I purchased this game and Library of Ruina while they were on sale, and installed Limbus Company because I figured it made sense to do so.\n\nWhen I first started playing the game, by far the most fun I had was learning about the Abnormalities and how to work with them. I found both the lore and the designs to be quite interesting. I didn't mind restarting a few times to learn how they worked.\nAt a certain point though, it became too difficult to discover how to manage the Abnormalities on my own. I had to look up how to deal with them, and some of their mechanics were incredibly stressful, even if they weren't difficult to manage. I stopped playing for a while because the amount of different mechanics I had to mentally juggle became too much for me.\n\nEventually, I returned to the game because I was in the mood to pick up a video game. The biggest reason I chose to return to this game is because of the story, which is quite good. I looked up a guide, and I learned about quite a few unintuitive or poorly explained system mechanics, mostly Day 1 restarts and the Memory Repository. I was able to create a more manageable facility and keep playing, but the joy of discovery had been somewhat lost. Rewinding or resetting my facility was rather tedious as well, and I mostly did so while I was on call with my friends.\n\nI did begin to enjoy the challenge the game posed, and it certainly did feel rewarding when I was able to clear a difficult event. I finished the game with a pretty positive impression of it.\nThe issue is that this game does require you to enjoy discovery of interesting Abnormalities and characters, and tedious, stressful, and challenging gameplay, which aren't meshed together very well. Quite honestly, I'm not exactly sure whether the time I spent playing this game was worth it or not.\n\nI hope this isn't too negative of a positive review. I think this is a genuinely good game, but I just can't confidently say exactly which types of players would like it. Just be aware that it is quite demanding, and that there will probably be at least a couple parts of the game that you have to force yourself through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such creative game design, but man, it is literally hell. To me in a good way, but tastes might differ. I wish I was an abnormality",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game so much but i love it so much, it's a love hate relationship and it makes me want to die, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest and most painful experiences I've ever had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "singlehandedly one of the best games I've ever played.\ni came in expecting a fallout shelter type disappointment of a game, and left a genuine diehard fan.\nif you enjoy this type of game, i absolutely recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is not perfect but its undeniably charming and unique\r\nwe need more games like lobcorp :]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gave me a lobotomy, 10/10 experance would recomand if you like watching your fav chars, ocs and friends die reptivily",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trial and error management game where you do way more error than trial.\n\nThis game changed me as a person. For the better or for the worse... I don't know.\n\nAnd yes, the cactus WILL bear flowers. Eventually. When I get good enough to actually manage to win the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY IT UNLESS YOU LIKE SUFFERING, PLEASE PLAY LIBRARY OF RUINA AND WATCH A VIDEO ON THE STORY OF LOBCORP PLEASE I BEG YOU, SPARE THYSELF THE SUFFERING ABOUT TO BEFALL YOU\r\n\r\n\r\n10/10 game will be playing 27 times over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you really hate yourself then you should play this game. queen bee singlehandedly halted me for 2 days and is still very threatening. 10/10 experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game makes me want to turn my dog into a skateboard and do a kickflip with him. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a W game, pretty stressful an shit, Binahs hot, thats bout it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me when enkephalin +solemn lament + those who know + noradrenaline +limbus company + don quixote + walpurgis \r\n\r\non a serious note this game is driving me insane (halfly for angela :drool:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't even know i was into monsters till i play this game. I love being destroyed by my husbands and wifes and have to reset every single day i progress. 1000/10\n\nPD: The birds have peak lore, mythology ahhh story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worst gaming experience of all time. the mechanics will make you attempt to gouge your own eyes, and give you depression. cool story tho, 10/10 would play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have cracked this game and play for hours.Then the game goes on sale.so i buy it,because it just so PEAK.\r\ni also goon to the magical girl(ALL OF THEM).aghhhh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you want a hard experience that makes you restart the day after giving your life just to save one of your agents, you're in the right place.. don't expect mercy from this game but if you like to have pain go ahead and buy it. this game has a amazing lore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. One mistake and you have to reset the day, losing around 20~40 minutes of progress. PEAK.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my friends told me not to play but i did not heed their warnings\r\ni hate this game but it hurts so good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "INCREDIBLY good game. Great setup to a second, even greater game. I absolutely love lob corp and project moon and everything about the verse and always will. However i can absolutely concede this game is NOT for everyone. The highs are VERY high. Some of the most fun i've had playing a game in a while. The lows? Absolutely fucking soul crushing. The worst part? The lows are always your fault. So on top of having to reset the last 10-15 minutes of extremely well thought out progress for the 5th time, you have to know you yourself fucked up to cause it. If you're okay with absolute pits of hell depressive episode lows, play lobotomy corporation. or maybe play it just because you REALLY like being kicked in the nuts repeatedly, and would like that to be gamified\r\n\r\nDEXTER TIP 1 : just use the wiki. maybe not to look at the work types but DEFINITELY to see their effects and names. Nobody likes trial and error.\r\nDEXTER TIP 2 : don't be afraid to start from day one. the game gives you that option for a reason\r\nDEXTER TIP FINAL : DO THE MISSIONS AND CORE SUPPRESSIONS!!!!! THEY GIVE PERMANENT AND MASSIVE BUFFS THAT MAKE THE GAME FAR EASIER AND MORE FUN!!! DON'T GET TO DAY 30 AND HAVE NO CORE SUPPRESSIONS DONE CAUSE YOU'RE TOO LAZY TO DO A DUSK ORDEAL!!!\r\n\r\n9/10. I like being kicked in the balls by video games and i pretend geburas doing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is no game that has made me lock in harder than this.\n\nNot dark souls, not sekiro, but the stupid lil' chibi nugget game that contains Satan, several eldritch horrors, gigantic shrimp, a korean speech-bubble that makes you go bald, and the abstract personification of Jesus Christ.\n\nThe game is HARD, and you'll commonly hear that its hard unlike any other game is, and I have to agree; You have to be hyper-aware of 50 different little demons with wildly different effects, work requirements and dangers, half of which you will be completely oblivious of until you either crack, and look at a wiki, or hyper-focus on 1 specific beast so you can avoid it's silly little instant death ability (I hate ALEPHS)\n\nSome people quit, and thats perfectly understandable, but if you want to be a stubborn masochist like me, don't be afraid of starting over. Build your knowledge, learn what works, and please for the love of god, do not trust a single goddamn thing this game tries to tell you, cuz' half the time, it's a lie.\n\nThe gameplay is somehow both a 1 and 10 out of 10 at the same time, but the story's worth it.\n\ngod i wanna perform 13 works on plague doctor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "never thought that i would change all of my moral values when a employee dies stupidly and just isn't worth my time to save, just so i can get through a day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game so far. It definitely took me 8 hours to really get the hang of managing where I need employees to be and not overcommitting with points and equipment. \n\nGenerally this game has quite a few dumb or just slightly annoying quirks with it that I wouldn't blame someone for not having a good time with the game. And I do think it can end up feeling like there's a lot of artificial difficulty due to lack of QOL features it really just should have and unavoidable deaths. (Like it is a bit annoying to have to squint and figure out what gifts each employee has and which slots)\n\nI personally enjoy these games where \"the world is hard as balls\" and you gotta do the best with what you have. Slowly learning more about it and slowly becoming better at overcoming, but still having to deal with the unfair reality. And I feel the brutality of the game honestly makes the setting a lot more believable. You don't magically control these dangerous anomalies or know how to do it. Even if you learn all you can or such. Like in a world with dangerous scp-like creatures. There's obviously gonna be a lot of outbreaks and death even if you make the perfect facility. It makes the characters a lot more believable and the story more immersive. \n\nIn order to learn, you will lose brutally over and over. Most times it feels unfair (cause it often is) and a lot of the management \"hints\" are basically useless. Reason being they just tell you information you can figure out with common sense. Like \"oh the result has an average chance of lowering if the result was normal/average. Or \"bad outcome = high chance of lowering count\". uh... like no shit sherlock.\n\nSometimes it'll give just general info about the anomaly which I honestly am fine with cause you get to learn more about them even if it's not directly helpful. Or details into the lore which I also think is cool. But I do generally think \"management tips\" should give actual valuable information about managing it. That stuff can just be in the description and unlocked over time maybe?\n\n\nSome other minor gripes I had with the game...\n\nWhy is there a \"roguelite\" aspect to the game. It gatekeeps QOL features behind a linear progression of quests. Which is just obnoxious and pointless. Also, it literally goes over these features (you won't even have access to) in the tutorial. So it's not even for the sake of not overwhelming the player. \n\nAdditionally, I also feel like there's just not enough information displayed in general. And even when it comes to the controls, for how much micromanagement you can do. I don't understand why you can't choose exactly where an npc will stand. And also sometimes it can be really funky trying to get your employees to stop doing a task like suppressing. I started realizing the \"suppression task\" usually causes more issues and its easier to just select groups and move them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "True pain and suffering can only come when one walks the path of no turning back. After all keeping your facility alive is harder then it looks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ya like Cognitive Behavioral Therapy? you like gnostic overtones of a story in a very dystopian future? YA LIKE BEES? if you answered yes to any of these this might just be your kinda game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A shitload of details, but overall a great game both in terms of lore and gameplay (in my opinion)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its only been 15 hours and now im losing my mind over losing all the energy 5 of my best people died for \r\n\r\n[b]pretty good game[/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're already a Project Moon fan, or if this is your first time hearing about Project Moon, and you love management sims or suffering for over 150 hours then this game is perfect for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly wanted to purchase and play this game for a while, and now that i finally have (after so long and watching a few youtubers play it) I really enjoy it, it keeps you in a state of checking on everything and each abnormailty has it's own unique management style. 100% would recommend for any scp lovers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a pretty good game I have not completed it yet but i am a masochist sooooo...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "make vampires extinct at the end of the game simulator\r\nabsolutely NOTHING else of note i mean theres nothing there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Project moon games are timeless masterpieces.\r\n\r\ngods, the lore n gameplay are so good\r\n10/10 would recommend if you like challenging strategy games w/ a good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its not really that hard once you get into the swing of things. can be stressful though. Overall, this game SUCKS.\r\n\r\nbuy it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the gameplay, concept, and general vibes. Very interesting and unique. I do wish it wasn't so ball-breakingly frustrating and difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend, very fun. Its basically a game where u manage SCP's. Having your employees die is a core mechanic of the game, so don't worry when that happens. Also try not to care about them too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game so much it's actually a form of torture and I look back on my days playing it with a sense of nostalgic fondness for how much I hated it and how much it hated me\nthat being said this is literally the best game ever made and you should play it (except library is better go play that one. unless you haven't played this one yet then play this one and then that one, and then regret having ever played this one except for when you don't)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game heres how it feels\r\n1. Oh hey this game is pretty easy\r\n2. Oh ok its a bit hard\r\n3. I want to kill myself",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Accurate amazon warehouse experience\n\nThis game will give you autism\n\nplay the other 2 games too",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "no ce conpren este juegop pedorro horrible loo dio juego feo i mlcriado proyecgt mun bas a caer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "YEAAAAAAAAAAAAAAAAAH! I LOOOOOOOOVE spending 2 hours on a SINGLE day and watch my computer melt from everything that is happening on the screen!!!!!!!!!\nALSO\nI LOVE THE CITY I LIVE IIIIIIIIIIN!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you see a big red button that says \"do not press\" on it, do not press it\n\n[spoiler]I lost so much progress... [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I HAT- I love this game with all my heart, I hope the creator of this game (Project Moon) gets a lot of money from this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the greatest games in the entire world. Jank and laggy at times, but mods help a lot. Cried my eyes out at least 3 times. Kinsley, my first agent, my beloved Solemn Lament turned Twilight nugget, I'm glad I was able to finish day 50 by having you work with One Sin. I'm gonna write so much yaoi between you and Vincent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its like undergoing an acctual lobotomy then watching the entirety of the brainrot timeline ammount of white dmg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played for an hour straight\r\nStuck on how to rid of my ego gifts\r\nSomething breached and killed all my agents\r\n10/10 wouldn't play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first warning = just a piece of cake\r\nsecond warning = use more brain cells to solve\r\nthird warning = put all remain brain cells to \"restart\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun BUT VERY DIFFICULT SCP LIKE MONSTER GAME THAT MAKES ME WANT TO TEAR MY SKIN OFF, RAHHGUJDHKJHS. I like how rough-like the game is tho, working hard to learn more lore is really fun and the background stories are really interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "whatever you do do NOT take the magical girl abnormality early game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "every time oliver dies i want to do things to myself that arent good and i should not be thinking about",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I lost my sanity here and I'm going to lose more.\n\nanyway... after all this...\ndid you notice a cactus on your chaotic table?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really difficult, yet with a driving story, good characters, and it feels really rewarding when you finally do something right. Management sim from hell.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Art is subjective. I can tell everyone around here enjoys the way difficulty works in this game but I personally did not. So not as to bash the game but to ensure anyone who might share my feelings ignores this game and doesn't lose a precious afternoon, let me tell you why I hate this very good game.\r\n\r\nI am the kind of guy who likes to have the ability to think things through and get out of tough spots. I like to work with what I have and make it work. I like saving people like a hero. I like the fantasy of having to power to do that. This game took every character I controlled. Spat in my face. Changed the way the game works, and then proceeded to kill all of them in an instant repeatedly.\r\n\r\nThe way the game works is that you have several entities in containment that can break out and hurt people. You have the job of testing them to get energy from them with the risk that they can kill the employees under you if they do. Testing them reveals information about them that is useful to help you keep them contained. This information is constantly contradictory. \"do a test on an entity with a high rating of (insert skill) and you will test more effectively.\" then entity two says: \"Nah actually I'm going to kill you for doing that. See you next run!\" and proceeds to kill 3 of the 7 characters I have at random, with no way to know how to stop it. Instant death to all of them. Doesn't matter if they were your best ones.\r\n\r\nSeveral game mechanics in this are completely random. I maxed out all stats on a character, knew all the info on an entity and then did a test on it. I knew it would have a bad effect if I failed but I knew everything about how to do the test correctly and did that. The entity still broke through containment. Then it literally forced me to roll on a roulette wheel and then killed a character it rolled at random.\r\n\r\nBrutal. Now what about that was strategy? Was it the part where I repeated a day over and over to get enough information I needed to figure out what the entity even did? Was it me spending hours to learn without actually getting to proceed with the game? Did I do something wrong? No. I got unlucky. And if I did proceed as normal, I never would have even gotten info on that entity because any info I recieved was erased because I failed the run. I learned nothing. Gained nothing. Have nothing. Start over.\r\n\r\nI've spent 33 hours on this trying to figure out the strategy on this game. Do you know what I learned? There isn't any strategy for entities you don't already know. That means your run ends on every new entity and then you start over. Hours of play lost at a time, no power over what to do.\r\n\r\nThis isn't difficulty. It's memorization. I started making progress when I knew what entities did and started over. It wasn't even hard it was just long and senseless. Characters are meant to be toys that die. Their stories and feelings don't matter. Everyone dies. Your actions don't matter until you've died enough it's extended game play with no actual sauce to it. I'm doing the same thing on repeat every time. I COULD just go to the wiki and follow instructions step by step but then what was the point in me specifically picking up this game? What was the point in me playing it? What did I actually do or add to this?\r\n\r\nI feel miserable. I was promised a strategy game and everyone here seems to claim they are having fun. I didn't see the strategy. I can't find the fun. I can't find what I'm even supposed to do. There was no point in me playing this game. To anyone who enjoyed this, can you please tell me where my own decisions mattered? What was I supposed to do? Lose time? Is that why it's hard? You just have to sink time into it? That is hard but it's not challenging. It's not testing my wit. It didn't make me think. It didn't make me fight. I just had to spend time. That's no different than grinding away at monsters in an RPG. I may as well have played Genshin and called it hard because it made me spend time on it. What a waste on this game.",
      "voted_up": false,
      "votes_helpful": 168
    },
    {
      "review": "beautiful storyline\r\n\r\nhad to 100% this twice\r\n\r\ntoo stressful dont ever play this\r\n\r\nim not touching this game ever again\r\n\r\n10/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good game (already end). However many bugs (bad optimization) make the gameplay unreasonably unbearable without guides，which makes less fun. Will change to positive the day the bugs get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I thought i would enjoy scp management sim.  I was wrong. game systems are unique, but clunky and not engaging.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is very little strategy and lots of fiddly micromanagement. I'd describe the gameplay as tedious, but if you rush ahead you might just lose half your pawns when one of the events trigger. The theme is interesting but the actual story is not. The English translation can be challenging to understand at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i beat apoc bird and then pressed the button because i was so excited...... play this game its so fun\n\nfuck you hokma\nfuck you binah\n\nsuppression 😅😅😅😂😂😂😂 :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this seems like such a cool game/fandom, too bad i have a skill issue and suck D:\nalso bad optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not intuitive at all. no good intro guides anywhere, shocking circlejerk of fans of the ip that prefer long texts and jokes to actually explaining the basics.\nmany unrecoverable fail states with no warning or explanation.\nmany annoying sound effects. endless waves of text that are irrelevant for most of the game.\nyou're supposed to grind a lot, but also supposed to die a lot, and reset a lot, and go in blind. what? just read the wikis. and avoid plague doctor.\njust play other simulation games and only come back to this when you're done with all other good ones.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this out of obligation, and still have not finished it.\r\n\r\nThis game sucks, with all respect for Kim and Project Moon, it was their first major project, and it SHOWS. The game is a grind-fest, endgame days take multiple hours, one mess-up on a later game abnormality = restarting and all time lost. Losing an employee before you are omega endgame = losing their gear, which you might not have the abnormality to get back.\r\n\r\nStarts to lag later on as well without mods to fix memory leaks. I cannot in good faith recommend this, please go play Library of Ruina or just look up a story video of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is bad because netzach doesnt touch me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all these squares make a circle",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No achievements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hard start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "doo doo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Josh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art is subjective. I can tell everyone around here enjoys the way difficulty works in this game but I personally did not. So not as to bash the game but to ensure anyone who might share my feelings ignores this game and doesn't lose a precious afternoon, let me tell you why I hate this very good game.\r\n\r\nI am the kind of guy who likes to have the ability to think things through and get out of tough spots. I like to work with what I have and make it work. I like saving people like a hero. I like the fantasy of having to power to do that. This game took every character I controlled. Spat in my face. Changed the way the game works, and then proceeded to kill all of them in an instant repeatedly.\r\n\r\nThe way the game works is that you have several entities in containment that can break out and hurt people. You have the job of testing them to get energy from them with the risk that they can kill the employees under you if they do. Testing them reveals information about them that is useful to help you keep them contained. This information is constantly contradictory. \"do a test on an entity with a high rating of (insert skill) and you will test more effectively.\" then entity two says: \"Nah actually I'm going to kill you for doing that. See you next run!\" and proceeds to kill 3 of the 7 characters I have at random, with no way to know how to stop it. Instant death to all of them. Doesn't matter if they were your best ones.\r\n\r\nSeveral game mechanics in this are completely random. I maxed out all stats on a character, knew all the info on an entity and then did a test on it. I knew it would have a bad effect if I failed but I knew everything about how to do the test correctly and did that. The entity still broke through containment. Then it literally forced me to roll on a roulette wheel and then killed a character it rolled at random.\r\n\r\nBrutal. Now what about that was strategy? Was it the part where I repeated a day over and over to get enough information I needed to figure out what the entity even did? Was it me spending hours to learn without actually getting to proceed with the game? Did I do something wrong? No. I got unlucky. And if I did proceed as normal, I never would have even gotten info on that entity because any info I recieved was erased because I failed the run. I learned nothing. Gained nothing. Have nothing. Start over.\r\n\r\nI've spent 33 hours on this trying to figure out the strategy on this game. Do you know what I learned? There isn't any strategy for entities you don't already know. That means your run ends on every new entity and then you start over. Hours of play lost at a time, no power over what to do.\r\n\r\nThis isn't difficulty. It's memorization. I started making progress when I knew what entities did and started over. It wasn't even hard it was just long and senseless. Characters are meant to be toys that die. Their stories and feelings don't matter. Everyone dies. Your actions don't matter until you've died enough it's extended game play with no actual sauce to it. I'm doing the same thing on repeat every time. I COULD just go to the wiki and follow instructions step by step but then what was the point in me specifically picking up this game? What was the point in me playing it? What did I actually do or add to this?\r\n\r\nI feel miserable. I was promised a strategy game and everyone here seems to claim they are having fun. I didn't see the strategy. I can't find the fun. I can't find what I'm even supposed to do. There was no point in me playing this game. To anyone who enjoyed this, can you please tell me where my own decisions mattered? What was I supposed to do? Lose time? Is that why it's hard? You just have to sink time into it? That is hard but it's not challenging. It's not testing my wit. It didn't make me think. It didn't make me fight. I just had to spend time. That's no different than grinding away at monsters in an RPG. I may as well have played Genshin and called it hard because it made me spend time on it. What a waste on this game.",
      "voted_up": false,
      "votes_helpful": 170
    },
    {
      "review": "beautiful storyline\r\n\r\nhad to 100% this twice\r\n\r\ntoo stressful dont ever play this\r\n\r\nim not touching this game ever again\r\n\r\n10/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "So I'd really like to recommend this game, but I cannot in good faith doing so without the use of mods. The game can be unfun and straight up torturous to play. If I never got mods I'd never even beat this game. You can have hours and hours wasted all because you didn't understand a gimmick or didn't have enough information on an abnormality, where you're fucked. I'd love to say the difficulty is what makes the experience, but that's simply untrue, it feels horrible being screwed to abnormality rng, having to reset the past 4-5 days (which could be from 1-2 hours to nearly 6-8 hours depending on how far you are into the game) which feels horrible to do, over and over again. \r\n\r\nBut the story is great, the writing feels cohesive, even though there's an illusion of choice with the dialogue options that i don't really connect with. The rewards when completing missions feel fantastic and always worth doing, there was never an upgrade I felt was bad for my Facility. The characters are all pretty memorable, (besides maybe 1 or 2), and getting to know all of the abnormalities and learning the muscle memory behind the gameplay is addicting.\r\n\r\nThe bugs can fuck right off, kinda make the game nearly unplayable.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[h1] Lobotomy Corporation, A huge curse for being PM fan. [/h1]\n\nI came from someone who beated Library of Ruina and Limbus Company (Canto 8 at the time I'm writing this review), I decided to play Lobotomy Corporation, I usually try to endure difficulty spikes gameplay but my God, this game actually ruined me. \n\nFor starters, the game is management sim, I wasn't expert in this kind of game but once you start getting hang of its core gameplay, you can handle gameplay just fine, however there's few points where I don't really recommend playing it unless you're maschoist and desire for one of the most painful experience in videogames.\n\nFirstly, The game doesn't hold any punches, at first few management days you're getting fine selection of abnormalties but later you get ones that just there to force you to give up on playing. I won't spoil much details but one of them you get punished for performing good work. And it gets worse down the road.\n\nSecondly, and that's main reason I don't recommend is that it doesn't respect your time at all, one single mistake and half hour worth of progression gone in a blink. The game just consumes your time like plague and you don't get anything in return.\n\nThere's also few parts of the game where you got no choice but to just cheese the game, Backward Clock for example is most essential abnormal tool needed to beat most challenges and final days.\n\nThe Story is amazing and this is what makes me keep going with gameplay otherwise I would've gave up way early since its not worth hurting my sanity.\n\nTL;DR Just watch on YT if you're here for story. Otherwise you're welcome to try hurting your mentality by playing this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good game (already end). However many bugs (bad optimization) make the gameplay unreasonably unbearable without guides，which makes less fun. Will change to positive the day the bugs get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever but also the best game ever i do not recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I thought i would enjoy scp management sim.  I was wrong. game systems are unique, but clunky and not engaging.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is very little strategy and lots of fiddly micromanagement. I'd describe the gameplay as tedious, but if you rush ahead you might just lose half your pawns when one of the events trigger. The theme is interesting but the actual story is not. The English translation can be challenging to understand at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i beat apoc bird and then pressed the button because i was so excited...... play this game its so fun\n\nfuck you hokma\nfuck you binah\n\nsuppression 😅😅😅😂😂😂😂 :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this seems like such a cool game/fandom, too bad i have a skill issue and suck D:\nalso bad optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "amazing game 10/10 will make you distort though (yes you will have to full restart multiple times)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not intuitive at all. no good intro guides anywhere, shocking circlejerk of fans of the ip that prefer long texts and jokes to actually explaining the basics.\nmany unrecoverable fail states with no warning or explanation.\nmany annoying sound effects. endless waves of text that are irrelevant for most of the game.\nyou're supposed to grind a lot, but also supposed to die a lot, and reset a lot, and go in blind. what? just read the wikis. and avoid plague doctor.\njust play other simulation games and only come back to this when you're done with all other good ones.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this out of obligation, and still have not finished it.\r\n\r\nThis game sucks, with all respect for Kim and Project Moon, it was their first major project, and it SHOWS. The game is a grind-fest, endgame days take multiple hours, one mess-up on a later game abnormality = restarting and all time lost. Losing an employee before you are omega endgame = losing their gear, which you might not have the abnormality to get back.\r\n\r\nStarts to lag later on as well without mods to fix memory leaks. I cannot in good faith recommend this, please go play Library of Ruina or just look up a story video of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is bad because netzach doesnt touch me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all these squares make a circle",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No achievements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hard start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "doo doo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Josh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art is subjective. I can tell everyone around here enjoys the way difficulty works in this game but I personally did not. So not as to bash the game but to ensure anyone who might share my feelings ignores this game and doesn't lose a precious afternoon, let me tell you why I hate this very good game.\r\n\r\nI am the kind of guy who likes to have the ability to think things through and get out of tough spots. I like to work with what I have and make it work. I like saving people like a hero. I like the fantasy of having to power to do that. This game took every character I controlled. Spat in my face. Changed the way the game works, and then proceeded to kill all of them in an instant repeatedly.\r\n\r\nThe way the game works is that you have several entities in containment that can break out and hurt people. You have the job of testing them to get energy from them with the risk that they can kill the employees under you if they do. Testing them reveals information about them that is useful to help you keep them contained. This information is constantly contradictory. \"do a test on an entity with a high rating of (insert skill) and you will test more effectively.\" then entity two says: \"Nah actually I'm going to kill you for doing that. See you next run!\" and proceeds to kill 3 of the 7 characters I have at random, with no way to know how to stop it. Instant death to all of them. Doesn't matter if they were your best ones.\r\n\r\nSeveral game mechanics in this are completely random. I maxed out all stats on a character, knew all the info on an entity and then did a test on it. I knew it would have a bad effect if I failed but I knew everything about how to do the test correctly and did that. The entity still broke through containment. Then it literally forced me to roll on a roulette wheel and then killed a character it rolled at random.\r\n\r\nBrutal. Now what about that was strategy? Was it the part where I repeated a day over and over to get enough information I needed to figure out what the entity even did? Was it me spending hours to learn without actually getting to proceed with the game? Did I do something wrong? No. I got unlucky. And if I did proceed as normal, I never would have even gotten info on that entity because any info I recieved was erased because I failed the run. I learned nothing. Gained nothing. Have nothing. Start over.\r\n\r\nI've spent 33 hours on this trying to figure out the strategy on this game. Do you know what I learned? There isn't any strategy for entities you don't already know. That means your run ends on every new entity and then you start over. Hours of play lost at a time, no power over what to do.\r\n\r\nThis isn't difficulty. It's memorization. I started making progress when I knew what entities did and started over. It wasn't even hard it was just long and senseless. Characters are meant to be toys that die. Their stories and feelings don't matter. Everyone dies. Your actions don't matter until you've died enough it's extended game play with no actual sauce to it. I'm doing the same thing on repeat every time. I COULD just go to the wiki and follow instructions step by step but then what was the point in me specifically picking up this game? What was the point in me playing it? What did I actually do or add to this?\r\n\r\nI feel miserable. I was promised a strategy game and everyone here seems to claim they are having fun. I didn't see the strategy. I can't find the fun. I can't find what I'm even supposed to do. There was no point in me playing this game. To anyone who enjoyed this, can you please tell me where my own decisions mattered? What was I supposed to do? Lose time? Is that why it's hard? You just have to sink time into it? That is hard but it's not challenging. It's not testing my wit. It didn't make me think. It didn't make me fight. I just had to spend time. That's no different than grinding away at monsters in an RPG. I may as well have played Genshin and called it hard because it made me spend time on it. What a waste on this game.",
      "voted_up": false,
      "votes_helpful": 170
    },
    {
      "review": "beautiful storyline\r\n\r\nhad to 100% this twice\r\n\r\ntoo stressful dont ever play this\r\n\r\nim not touching this game ever again\r\n\r\n10/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "So I'd really like to recommend this game, but I cannot in good faith doing so without the use of mods. The game can be unfun and straight up torturous to play. If I never got mods I'd never even beat this game. You can have hours and hours wasted all because you didn't understand a gimmick or didn't have enough information on an abnormality, where you're fucked. I'd love to say the difficulty is what makes the experience, but that's simply untrue, it feels horrible being screwed to abnormality rng, having to reset the past 4-5 days (which could be from 1-2 hours to nearly 6-8 hours depending on how far you are into the game) which feels horrible to do, over and over again. \r\n\r\nBut the story is great, the writing feels cohesive, even though there's an illusion of choice with the dialogue options that i don't really connect with. The rewards when completing missions feel fantastic and always worth doing, there was never an upgrade I felt was bad for my Facility. The characters are all pretty memorable, (besides maybe 1 or 2), and getting to know all of the abnormalities and learning the muscle memory behind the gameplay is addicting.\r\n\r\nThe bugs can fuck right off, kinda make the game nearly unplayable.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[h1] Lobotomy Corporation, A huge curse for being PM fan. [/h1]\n\nI came from someone who beated Library of Ruina and Limbus Company (Canto 8 at the time I'm writing this review), I decided to play Lobotomy Corporation, I usually try to endure difficulty spikes gameplay but my God, this game actually ruined me. \n\nFor starters, the game is management sim, I wasn't expert in this kind of game but once you start getting hang of its core gameplay, you can handle gameplay just fine, however there's few points where I don't really recommend playing it unless you're maschoist and desire for one of the most painful experience in videogames.\n\nFirstly, The game doesn't hold any punches, at first few management days you're getting fine selection of abnormalties but later you get ones that just there to force you to give up on playing. I won't spoil much details but one of them you get punished for performing good work. And it gets worse down the road.\n\nSecondly, and that's main reason I don't recommend is that it doesn't respect your time at all, one single mistake and half hour worth of progression gone in a blink. The game just consumes your time like plague and you don't get anything in return.\n\nThere's also few parts of the game where you got no choice but to just cheese the game, Backward Clock for example is most essential abnormal tool needed to beat most challenges and final days.\n\nThe Story is amazing and this is what makes me keep going with gameplay otherwise I would've gave up way early since its not worth hurting my sanity.\n\nTL;DR Just watch on YT if you're here for story. Otherwise you're welcome to try hurting your mentality by playing this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good game (already end). However many bugs (bad optimization) make the gameplay unreasonably unbearable without guides，which makes less fun. Will change to positive the day the bugs get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever but also the best game ever i do not recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I thought i would enjoy scp management sim.  I was wrong. game systems are unique, but clunky and not engaging.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is very little strategy and lots of fiddly micromanagement. I'd describe the gameplay as tedious, but if you rush ahead you might just lose half your pawns when one of the events trigger. The theme is interesting but the actual story is not. The English translation can be challenging to understand at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i beat apoc bird and then pressed the button because i was so excited...... play this game its so fun\n\nfuck you hokma\nfuck you binah\n\nsuppression 😅😅😅😂😂😂😂 :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this seems like such a cool game/fandom, too bad i have a skill issue and suck D:\nalso bad optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "amazing game 10/10 will make you distort though (yes you will have to full restart multiple times)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not intuitive at all. no good intro guides anywhere, shocking circlejerk of fans of the ip that prefer long texts and jokes to actually explaining the basics.\nmany unrecoverable fail states with no warning or explanation.\nmany annoying sound effects. endless waves of text that are irrelevant for most of the game.\nyou're supposed to grind a lot, but also supposed to die a lot, and reset a lot, and go in blind. what? just read the wikis. and avoid plague doctor.\njust play other simulation games and only come back to this when you're done with all other good ones.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this out of obligation, and still have not finished it.\r\n\r\nThis game sucks, with all respect for Kim and Project Moon, it was their first major project, and it SHOWS. The game is a grind-fest, endgame days take multiple hours, one mess-up on a later game abnormality = restarting and all time lost. Losing an employee before you are omega endgame = losing their gear, which you might not have the abnormality to get back.\r\n\r\nStarts to lag later on as well without mods to fix memory leaks. I cannot in good faith recommend this, please go play Library of Ruina or just look up a story video of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is bad because netzach doesnt touch me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all these squares make a circle",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No achievements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hard start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "doo doo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Josh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art is subjective. I can tell everyone around here enjoys the way difficulty works in this game but I personally did not. So not as to bash the game but to ensure anyone who might share my feelings ignores this game and doesn't lose a precious afternoon, let me tell you why I hate this very good game.\r\n\r\nI am the kind of guy who likes to have the ability to think things through and get out of tough spots. I like to work with what I have and make it work. I like saving people like a hero. I like the fantasy of having to power to do that. This game took every character I controlled. Spat in my face. Changed the way the game works, and then proceeded to kill all of them in an instant repeatedly.\r\n\r\nThe way the game works is that you have several entities in containment that can break out and hurt people. You have the job of testing them to get energy from them with the risk that they can kill the employees under you if they do. Testing them reveals information about them that is useful to help you keep them contained. This information is constantly contradictory. \"do a test on an entity with a high rating of (insert skill) and you will test more effectively.\" then entity two says: \"Nah actually I'm going to kill you for doing that. See you next run!\" and proceeds to kill 3 of the 7 characters I have at random, with no way to know how to stop it. Instant death to all of them. Doesn't matter if they were your best ones.\r\n\r\nSeveral game mechanics in this are completely random. I maxed out all stats on a character, knew all the info on an entity and then did a test on it. I knew it would have a bad effect if I failed but I knew everything about how to do the test correctly and did that. The entity still broke through containment. Then it literally forced me to roll on a roulette wheel and then killed a character it rolled at random.\r\n\r\nBrutal. Now what about that was strategy? Was it the part where I repeated a day over and over to get enough information I needed to figure out what the entity even did? Was it me spending hours to learn without actually getting to proceed with the game? Did I do something wrong? No. I got unlucky. And if I did proceed as normal, I never would have even gotten info on that entity because any info I recieved was erased because I failed the run. I learned nothing. Gained nothing. Have nothing. Start over.\r\n\r\nI've spent 33 hours on this trying to figure out the strategy on this game. Do you know what I learned? There isn't any strategy for entities you don't already know. That means your run ends on every new entity and then you start over. Hours of play lost at a time, no power over what to do.\r\n\r\nThis isn't difficulty. It's memorization. I started making progress when I knew what entities did and started over. It wasn't even hard it was just long and senseless. Characters are meant to be toys that die. Their stories and feelings don't matter. Everyone dies. Your actions don't matter until you've died enough it's extended game play with no actual sauce to it. I'm doing the same thing on repeat every time. I COULD just go to the wiki and follow instructions step by step but then what was the point in me specifically picking up this game? What was the point in me playing it? What did I actually do or add to this?\r\n\r\nI feel miserable. I was promised a strategy game and everyone here seems to claim they are having fun. I didn't see the strategy. I can't find the fun. I can't find what I'm even supposed to do. There was no point in me playing this game. To anyone who enjoyed this, can you please tell me where my own decisions mattered? What was I supposed to do? Lose time? Is that why it's hard? You just have to sink time into it? That is hard but it's not challenging. It's not testing my wit. It didn't make me think. It didn't make me fight. I just had to spend time. That's no different than grinding away at monsters in an RPG. I may as well have played Genshin and called it hard because it made me spend time on it. What a waste on this game.",
      "voted_up": false,
      "votes_helpful": 170
    },
    {
      "review": "beautiful storyline\r\n\r\nhad to 100% this twice\r\n\r\ntoo stressful dont ever play this\r\n\r\nim not touching this game ever again\r\n\r\n10/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "So I'd really like to recommend this game, but I cannot in good faith doing so without the use of mods. The game can be unfun and straight up torturous to play. If I never got mods I'd never even beat this game. You can have hours and hours wasted all because you didn't understand a gimmick or didn't have enough information on an abnormality, where you're fucked. I'd love to say the difficulty is what makes the experience, but that's simply untrue, it feels horrible being screwed to abnormality rng, having to reset the past 4-5 days (which could be from 1-2 hours to nearly 6-8 hours depending on how far you are into the game) which feels horrible to do, over and over again. \r\n\r\nBut the story is great, the writing feels cohesive, even though there's an illusion of choice with the dialogue options that i don't really connect with. The rewards when completing missions feel fantastic and always worth doing, there was never an upgrade I felt was bad for my Facility. The characters are all pretty memorable, (besides maybe 1 or 2), and getting to know all of the abnormalities and learning the muscle memory behind the gameplay is addicting.\r\n\r\nThe bugs can fuck right off, kinda make the game nearly unplayable.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[h1] Lobotomy Corporation, A huge curse for being PM fan. [/h1]\n\nI came from someone who beated Library of Ruina and Limbus Company (Canto 8 at the time I'm writing this review), I decided to play Lobotomy Corporation, I usually try to endure difficulty spikes gameplay but my God, this game actually ruined me. \n\nFor starters, the game is management sim, I wasn't expert in this kind of game but once you start getting hang of its core gameplay, you can handle gameplay just fine, however there's few points where I don't really recommend playing it unless you're maschoist and desire for one of the most painful experience in videogames.\n\nFirstly, The game doesn't hold any punches, at first few management days you're getting fine selection of abnormalties but later you get ones that just there to force you to give up on playing. I won't spoil much details but one of them you get punished for performing good work. And it gets worse down the road.\n\nSecondly, and that's main reason I don't recommend is that it doesn't respect your time at all, one single mistake and half hour worth of progression gone in a blink. The game just consumes your time like plague and you don't get anything in return.\n\nThere's also few parts of the game where you got no choice but to just cheese the game, Backward Clock for example is most essential abnormal tool needed to beat most challenges and final days.\n\nThe Story is amazing and this is what makes me keep going with gameplay otherwise I would've gave up way early since its not worth hurting my sanity.\n\nTL;DR Just watch on YT if you're here for story. Otherwise you're welcome to try hurting your mentality by playing this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good game (already end). However many bugs (bad optimization) make the gameplay unreasonably unbearable without guides，which makes less fun. Will change to positive the day the bugs get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever but also the best game ever i do not recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I thought i would enjoy scp management sim.  I was wrong. game systems are unique, but clunky and not engaging.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is very little strategy and lots of fiddly micromanagement. I'd describe the gameplay as tedious, but if you rush ahead you might just lose half your pawns when one of the events trigger. The theme is interesting but the actual story is not. The English translation can be challenging to understand at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i beat apoc bird and then pressed the button because i was so excited...... play this game its so fun\n\nfuck you hokma\nfuck you binah\n\nsuppression 😅😅😅😂😂😂😂 :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this seems like such a cool game/fandom, too bad i have a skill issue and suck D:\nalso bad optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "amazing game 10/10 will make you distort though (yes you will have to full restart multiple times)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not intuitive at all. no good intro guides anywhere, shocking circlejerk of fans of the ip that prefer long texts and jokes to actually explaining the basics.\nmany unrecoverable fail states with no warning or explanation.\nmany annoying sound effects. endless waves of text that are irrelevant for most of the game.\nyou're supposed to grind a lot, but also supposed to die a lot, and reset a lot, and go in blind. what? just read the wikis. and avoid plague doctor.\njust play other simulation games and only come back to this when you're done with all other good ones.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this out of obligation, and still have not finished it.\r\n\r\nThis game sucks, with all respect for Kim and Project Moon, it was their first major project, and it SHOWS. The game is a grind-fest, endgame days take multiple hours, one mess-up on a later game abnormality = restarting and all time lost. Losing an employee before you are omega endgame = losing their gear, which you might not have the abnormality to get back.\r\n\r\nStarts to lag later on as well without mods to fix memory leaks. I cannot in good faith recommend this, please go play Library of Ruina or just look up a story video of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is bad because netzach doesnt touch me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all these squares make a circle",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No achievements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hard start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "doo doo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Josh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Art is subjective. I can tell everyone around here enjoys the way difficulty works in this game but I personally did not. So not as to bash the game but to ensure anyone who might share my feelings ignores this game and doesn't lose a precious afternoon, let me tell you why I hate this very good game.\r\n\r\nI am the kind of guy who likes to have the ability to think things through and get out of tough spots. I like to work with what I have and make it work. I like saving people like a hero. I like the fantasy of having to power to do that. This game took every character I controlled. Spat in my face. Changed the way the game works, and then proceeded to kill all of them in an instant repeatedly.\r\n\r\nThe way the game works is that you have several entities in containment that can break out and hurt people. You have the job of testing them to get energy from them with the risk that they can kill the employees under you if they do. Testing them reveals information about them that is useful to help you keep them contained. This information is constantly contradictory. \"do a test on an entity with a high rating of (insert skill) and you will test more effectively.\" then entity two says: \"Nah actually I'm going to kill you for doing that. See you next run!\" and proceeds to kill 3 of the 7 characters I have at random, with no way to know how to stop it. Instant death to all of them. Doesn't matter if they were your best ones.\r\n\r\nSeveral game mechanics in this are completely random. I maxed out all stats on a character, knew all the info on an entity and then did a test on it. I knew it would have a bad effect if I failed but I knew everything about how to do the test correctly and did that. The entity still broke through containment. Then it literally forced me to roll on a roulette wheel and then killed a character it rolled at random.\r\n\r\nBrutal. Now what about that was strategy? Was it the part where I repeated a day over and over to get enough information I needed to figure out what the entity even did? Was it me spending hours to learn without actually getting to proceed with the game? Did I do something wrong? No. I got unlucky. And if I did proceed as normal, I never would have even gotten info on that entity because any info I recieved was erased because I failed the run. I learned nothing. Gained nothing. Have nothing. Start over.\r\n\r\nI've spent 33 hours on this trying to figure out the strategy on this game. Do you know what I learned? There isn't any strategy for entities you don't already know. That means your run ends on every new entity and then you start over. Hours of play lost at a time, no power over what to do.\r\n\r\nThis isn't difficulty. It's memorization. I started making progress when I knew what entities did and started over. It wasn't even hard it was just long and senseless. Characters are meant to be toys that die. Their stories and feelings don't matter. Everyone dies. Your actions don't matter until you've died enough it's extended game play with no actual sauce to it. I'm doing the same thing on repeat every time. I COULD just go to the wiki and follow instructions step by step but then what was the point in me specifically picking up this game? What was the point in me playing it? What did I actually do or add to this?\r\n\r\nI feel miserable. I was promised a strategy game and everyone here seems to claim they are having fun. I didn't see the strategy. I can't find the fun. I can't find what I'm even supposed to do. There was no point in me playing this game. To anyone who enjoyed this, can you please tell me where my own decisions mattered? What was I supposed to do? Lose time? Is that why it's hard? You just have to sink time into it? That is hard but it's not challenging. It's not testing my wit. It didn't make me think. It didn't make me fight. I just had to spend time. That's no different than grinding away at monsters in an RPG. I may as well have played Genshin and called it hard because it made me spend time on it. What a waste on this game.",
      "voted_up": false,
      "votes_helpful": 170
    },
    {
      "review": "beautiful storyline\r\n\r\nhad to 100% this twice\r\n\r\ntoo stressful dont ever play this\r\n\r\nim not touching this game ever again\r\n\r\n10/10",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "So I'd really like to recommend this game, but I cannot in good faith doing so without the use of mods. The game can be unfun and straight up torturous to play. If I never got mods I'd never even beat this game. You can have hours and hours wasted all because you didn't understand a gimmick or didn't have enough information on an abnormality, where you're fucked. I'd love to say the difficulty is what makes the experience, but that's simply untrue, it feels horrible being screwed to abnormality rng, having to reset the past 4-5 days (which could be from 1-2 hours to nearly 6-8 hours depending on how far you are into the game) which feels horrible to do, over and over again. \r\n\r\nBut the story is great, the writing feels cohesive, even though there's an illusion of choice with the dialogue options that i don't really connect with. The rewards when completing missions feel fantastic and always worth doing, there was never an upgrade I felt was bad for my Facility. The characters are all pretty memorable, (besides maybe 1 or 2), and getting to know all of the abnormalities and learning the muscle memory behind the gameplay is addicting.\r\n\r\nThe bugs can fuck right off, kinda make the game nearly unplayable.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "[h1] Lobotomy Corporation, A huge curse for being PM fan. [/h1]\n\nI came from someone who beated Library of Ruina and Limbus Company (Canto 8 at the time I'm writing this review), I decided to play Lobotomy Corporation, I usually try to endure difficulty spikes gameplay but my God, this game actually ruined me. \n\nFor starters, the game is management sim, I wasn't expert in this kind of game but once you start getting hang of its core gameplay, you can handle gameplay just fine, however there's few points where I don't really recommend playing it unless you're maschoist and desire for one of the most painful experience in videogames.\n\nFirstly, The game doesn't hold any punches, at first few management days you're getting fine selection of abnormalties but later you get ones that just there to force you to give up on playing. I won't spoil much details but one of them you get punished for performing good work. And it gets worse down the road.\n\nSecondly, and that's main reason I don't recommend is that it doesn't respect your time at all, one single mistake and half hour worth of progression gone in a blink. The game just consumes your time like plague and you don't get anything in return.\n\nThere's also few parts of the game where you got no choice but to just cheese the game, Backward Clock for example is most essential abnormal tool needed to beat most challenges and final days.\n\nThe Story is amazing and this is what makes me keep going with gameplay otherwise I would've gave up way early since its not worth hurting my sanity.\n\nTL;DR Just watch on YT if you're here for story. Otherwise you're welcome to try hurting your mentality by playing this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good game (already end). However many bugs (bad optimization) make the gameplay unreasonably unbearable without guides，which makes less fun. Will change to positive the day the bugs get fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever but also the best game ever i do not recommend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I thought i would enjoy scp management sim.  I was wrong. game systems are unique, but clunky and not engaging.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is very little strategy and lots of fiddly micromanagement. I'd describe the gameplay as tedious, but if you rush ahead you might just lose half your pawns when one of the events trigger. The theme is interesting but the actual story is not. The English translation can be challenging to understand at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i beat apoc bird and then pressed the button because i was so excited...... play this game its so fun\n\nfuck you hokma\nfuck you binah\n\nsuppression 😅😅😅😂😂😂😂 :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this seems like such a cool game/fandom, too bad i have a skill issue and suck D:\nalso bad optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "amazing game 10/10 will make you distort though (yes you will have to full restart multiple times)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not intuitive at all. no good intro guides anywhere, shocking circlejerk of fans of the ip that prefer long texts and jokes to actually explaining the basics.\nmany unrecoverable fail states with no warning or explanation.\nmany annoying sound effects. endless waves of text that are irrelevant for most of the game.\nyou're supposed to grind a lot, but also supposed to die a lot, and reset a lot, and go in blind. what? just read the wikis. and avoid plague doctor.\njust play other simulation games and only come back to this when you're done with all other good ones.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this out of obligation, and still have not finished it.\r\n\r\nThis game sucks, with all respect for Kim and Project Moon, it was their first major project, and it SHOWS. The game is a grind-fest, endgame days take multiple hours, one mess-up on a later game abnormality = restarting and all time lost. Losing an employee before you are omega endgame = losing their gear, which you might not have the abnormality to get back.\r\n\r\nStarts to lag later on as well without mods to fix memory leaks. I cannot in good faith recommend this, please go play Library of Ruina or just look up a story video of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is bad because netzach doesnt touch me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all these squares make a circle",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No achievements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hard start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "doo doo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Josh",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}