{
  "positive": [
    {
      "review": "There is something about this game that keeps you wanting to go back. It's really smartly designed. In a way, it's both simple and complex, it's vague and dark, but when you beat it, you realize it was so clear and bright.\n\nThe story is amazing, leaves a lot to think about, without being flooded with tons of cinematics and dialogue.\n\nOn cinematics, it has one of the best opening cinematic ever, so badass. I found an upscaled version of it on YT I watch it from time to time\n\nThe way New Game Plus loops into the story is something I experienced for the first time in this game, so smart, I felt that journey myself, understood it better, and wanted to go at it again\n\nIf you're new to the souls-like genre, this game can be frustrating if you're not patient. I know that the reputation is that these games are hard, and sure, they can be challenging, but think of them as they need problem-solving rather than get gud. There is always an easier way to tackle the obstacle at hand, you just need to find it.\n\nThe remastered version is a great upgrade, it runs smoothly with no issues and better anti-aliasing. I found it to be more visually appealing than DS2 Scholar of the First Sin.",
      "voted_up": true,
      "votes_helpful": 83
    },
    {
      "review": "Got invaded, dude is fat and naked and only has his fists, fists me for multiple minutes cuz he does like no damage, I assume he gets bored and presents his back so I can actually end the fight, I respect his naked fisting ways and jump off a cliff to kill myself, he is granted the victory. 10/10 game",
      "voted_up": true,
      "votes_helpful": 74
    },
    {
      "review": "A chosen undead is rekindled once more... now with more frames and worse lighting.\n\nhttps://www.youtube.com/watch?v=n2eos3V7jTI\n\nOnly way to engage in the multiplayer aspect though so REMASTER has its place. At least the changes are not on the scale as the Demon Souls 'remaster' which is another can of worms.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "What can I say about Dark Souls that others haven't already said? Nothing really.\n\nWhat I will say though is that I raged when I died against hard bosses after multiple attempts, I celebrated when I defeated them, I explored everything Lordran had to offer, I engaged in jolly cooperation, but most importantly I enjoyed my time with Dark Souls.\n\nIn short I got gud",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Dark Souls Remastered is a masterpiece of challenge, atmosphere, and interconnected world design. The world design is immaculate — It's a game that rewards patience and persistence like few others. It's a game that really brings you back and then makes you wish you were never there to experience it in the first place. It's not for the faint of heart but the absolute most enjoyable thing about the game besides the nostalgia is that you get to see the progress the studio made over the years, from Sif being The Red Wolf of Radagon and so on. It's absolutely amazing to see how things have changed since their first title and for that alone I'd recommend the game a thousand times over. Besides Blighttown being the true final boss of Dark Souls it is a masterpiece. \r\n\r\n\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠒⢶⣆⠀⠀⠀⢰⣇⠀⠀⠀⠀⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⣸⡛⡆⠀⠀⡜⣿⠀⠀⡔⡩⡲⠃⠀⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⢦⣄⠀⠀⢡⢣⡓⠤⡀⡇⡇⡇⠀⡆⠸⡅⠀⠀⣠⡴⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠻⡻⡢⢄⠑⡌⢣⣹⣁⣇⣸⡔⣡⢀⣇⠤⣺⠟⠀⠀⠀⠀⠀⠀\r\n⠴⢿⣲⣄⠀⠀⡱⡌⢢⡩⠛⠉⠀⠀⠀⠀⠈⠑⠿⡡⢊⠎⢀⡤⣔⣢⠄⡺⠀\r\n⠀⠀⠻⣏⠉⠭⠬⣉⠞⢀⠤⢤⣤⡄⠀⣄⣠⢤⢄⡙⡟⠐⡫⢊⠖⠉⠉⠀⠀\r\n⠀⠀⠀⠈⢉⣉⡱⡞⠰⣥⣾⣿⣿⡏⠀⡿⣿⣻⣷⠬⠸⣭⣔⡊⠀⠀⠀⠀⠀\r\n⠤⠴⢶⣭⠥⠤⠤⡇⠀⠀⠀⠁⠠⡖⠀⠷⡄⠁⠀⠀⠀⠧⠀⣈⣩⠿⠶⠆⠀\r\n⠀⠀⠀⠀⣨⢟⣛⢿⠀⠀⠀⠀⠘⣛⣒⡋⠁⠀⠀⠀⣸⠻⡁⠀⠀⠀⠀⠀⠀\r\n⠀⣠⠤⠴⡣⣫⠄⡾⢣⡀⠀⠛⠙⢟⣛⣻⠋⠀⠀⡰⣍⠓⠀⣒⣫⢷⡄⠀⠀\r\n⢸⠟⠛⠓⠒⠁⡘⠠⢊⡩⢲⠤⣦⣄⣉⣀⣠⢴⣯⡑⢌⢫⠉⠀⠈⠫⠷⠶⠂\r\n⠀⠀⠀⠀⠀⣼⣴⠔⠁⢇⠘⠰⠹⡈⡇⣼⠘⡜⢄⠉⠒⢕⣷⡀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠐⠋⠀⠀⠀⡼⡀⡆⠀⡇⣧⠃⠑⠺⡱⢣⠀⠀⠈⠳⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⡎⣮⠞⠀⠀⢸⣿⠀⠀⠀⣧⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⢷⠁⠀⠀⠀⠰⠇⠀⠀⠀⠙⠾⠶⠀⠀⠀⠀⠀⠀⠀⠀",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "finished the first playthrough and i loved everything about the game and no one doubts that this game is truly a masterpiece. and about Miyazaki : ahh lord what a genius \nlegendary story and story telling legendary world design and one of the greatest DLCs in the world \nso let's go for 100% the game and gain all achievements",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "There's not much to say about this that hasn't already been said. Yes, it's an amazing game, and it has so many followers in it's style that some of them have branched off into giant hits that have their own followers, and so on. There's a reason that 'Souls-like' is a category, even though this wasn't the first one (Blade of Darkness could be argued for that title), but this was the BIG one.\n\nThat being said, if you're reading reviews 7 years later and don't know about all the hype around this game: Welcome to Earth, I hope the stay is pleasant. This is a hard, but enjoyable game, and it's worth checking out.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's honestly more than peak. In fact, I have no words to describe how fond i actually am of this, and \"peak' isn't doing it justice in the slightest. So even if I know it's not enough I hope my admiration makes up for it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "There’s nothing more to say about this game. \nI’ve been playing it since I was a little kid, and I still enjoy it today. \nI can’t get enough of the feeling of victory after so many deaths.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Writing this at the end of my first playthrough and just wanted to say that this has been a really great experience.\n\nBlinded most of the game (only used a guide on how to get to the DLC and if you really needed to kill Sif because didn't want to kill the dogo)\n\nDidn't find the game harder like people say, only thing you need is a bit of patience because is a slow game, kinda like WoW Classic once you got the trick for it feels really good to play.\n\nReally got amazed by how the map do the connections between zones and the lot of things hiding in every zone like the fake walls and the backtracking you have to do was really enjoyable for me because it gave me very Metroid vibes \n\nThe bosses on this part where really fun and i even enjoyed a bit the not so praised ones like The Bed of Chaos\n\nQuestlines were a bit confusing but i figured some of them, i still have a lot to things to discover in the game so for sure i will be replaying it to try out another class or weapon that i did not use and will try different outcomes for the NPCS \n\nFor my finals thoughts i know the game is not for everyone but if you are willing to try it out, just DO IT! just remember to have a bit of patiente and you will overcome everything that stands in your way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is not a story about a hero, about bringing down a villain, it's a tragic story of hanging on to something you should have let go, or having the courage to let it go, and venture into the unknown, accepting change and embracing it, whatever the outcome.\nGameplay holds up, but, in my opinion, this game is about discipline, more than skill, you will have moments when you progress and look down onto the world, and see how far you've come, it will give you a great sense of accomplishment, you will realise you have grown, you are better, colder, stronger, and those moments will remind you of it.\n\nI didn't expect it to leave a lasting impression, but this game will change you, in more ways than you think, just persevere and don't go hollow.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 \nDark Souls is amazing. It also speedran my mental health straight into New Game+++ trauma.\nNow I flinch every time I see a chest because it might be a Mimic.\nStill single, but at least I can dodge-roll my emotions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First half is such a joy to play. The world layout feels pretty natural, like an actual ancient city and combat is fun. It feels heavy and weighty but consistent. And then it all falls apart for the second half with bland, un-inspired zones and tedious, jank boss fights. The main DLC is really fun though so all in all, a recommend but be prepared for a rough back half.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best games i have ever played. and i probably wont stop playing after writing this bcs its just too damn fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dispite what people might tell you DSR is the best one of the souls games to start with",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "incredibly nostalgic, heartbreaking, and because it was my first souls game its my favorite (though I adore ds3)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure what there is to say about Dark Souls 1 that hasn't already been said. Everything about this game is known by now, it has been dissected and pulled apart by scavengers looking for scraps of lore or game data, the Pve and PvP have been documented to death and back, and the highs and lows as well as the jank are fully explored.\n\nI personally love Dark Souls. I started with Elden Ring, and came back expecting a much less evolved game but it isn't. It truly stands on its own, just as great as the day it was released. Yes, it is frustrating. Yes, there is jank and that jank will cost you sometimes. Wait, that's a lie, I started with Demon Souls on PS3.\n\nBut there's also atmosphere that just can't be replicated. I'm not speaking ill of DS2 and DS3, but FromSoft truly made something special in Dark Souls 1. I've laughed, I've cried, I've screamed in frustration, but at the end of the day: this game is truly something special.\n\nRemember: if the game is hard, try readjusting your playstyle and reexamine your options. The tools are likely there.\n\nExcept for the Wheel Skeletons, **** those guys.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The bad guy from Lord of the Rings bought me this game, therefore I had to play it. I think he was unable to finish the game himself so I decided to take initiative and complete the game by myself. By ignoring his advice I was able to progress faster than even the best Speedrunners. The only annoying thing about the game were the runbacks, and his comment of course.\r\n\r\nIf you like loosing your mind you should play this game, if you wanna loose braincells, you should have someone unable to understand the game advise you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been curious with souls series since 2017 but never got to play any of them\nThis is a nice relaxing game series you can try to play after a long day of work(jk)\n\nThe first souls game in my trilogy play through as someone who have zero previous experience with anything souls like this game certainly will be a great start for anyone new to the Souls genre\nThis game although probably not as good as the later series still captures the atmosphere of the environment and a lot of the boss fights are actually interesting(with some exception that is more frustrating than difficult if yk yk)\n\nNot only that even while we have no fast travel for the good half of the game till we get the Lord Vessel(some people hate it and quit because they cant fast travel) i think its the map being interconnected helps early on\nThe map is also very well done and the interconnected map haven't been done properly in the later series from what i've seen people said it\n\nStory wise, you can't really understand much just from playing and NPC interactions, you have to read the items or if you are lazy to do each just watch youtube videos for the story or lore recap\n\nIn terms of difficulty it wasn't as difficult as DS2 sotfs(from my personal experience and currently going through the game) and so far i will still agree with my first statement, starting with Elden ring directly seems wrong for me since if i do that i would not appreciate the evolution FromSoftware\n\nThis is certainly recommended by me IF\n1. You are a hardcore player and actually have the willpower to go through it will certainly be fun to play, no matter your skill level(im certainly mediocre asf for these types of games)\n2. You are patient enough to go through any hardship the game throws at you\n3. You are patient and able to enjoy the atmosphere\n\nHowever if you are not the patient type and not capable of enduring pain or are easily frustrated then i would not recommend this for you\n\nI will certainly go back to this after finishing each souls series once (except demon souls i have no access to that game)\nPersonally this game i would rate it 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First half of the game is extremely-well designed with thoughtful shortcuts and memorable level design. Second half of the game is definitely a step down in terms of forgiveness and enjoyability, but the DLC more than makes up for its shortcomings. My favorite RPG of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite game of all times and a great first game to start with the souls like genre and the fromsoftware games that came after. Visually stunning and offering a good amount of challenge with the DLC included, which is a big bonus. This journey will be harsh but you will improve as time goes by and you will eventually learn to enjoy the beautiful area surroundings and always keep your cool after every defeat. This isn't one of those games where you have some king of guidance, you decide the direction you take which makes the experience even more interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is the game i keep coming back to! i first played it in 2011 on ps3, then again when it released on nintendo switch, then i finally decided to buy it on steam, simply a must have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know alot of people kill gwynevere to fight gwyndolin, but i dont because i need to be comforted. 10/10 early game\n4/10 after anor londo. Btw for new players, lautrec should be kept alive:)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] This game has the power to save your life [/h1]\r\n\r\nAmazing game with an incredible story and philosophy. Fun progression, plenty to do, and challenging in a good way. My only complaint is one that most other people say, the 2nd half of the game seeming a bit rushed and not as fleshed out as the first half [spoiler](bed of chaos)[/spoiler] but it is still a fun game even in those moments. Compared to newer releases, the controls are somewhat \"janky\" but nowhere near unplayable. This game helped me get through a rough patch in life, which is where the true beauty of this game is. Getting up and going after the same boss again and again and again until you finally win can teach you a lot about the true lived experience, if you're open to trying to understand what the game is telling you. Don't go hollow. 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'll always have a soft spot for Dark Souls 1. It was my first Souls game and introduction to games of its kind. It's dated, but with some mods the graphics can be upgraded. An all time classic experience. If you want the genuine Souls experience then look no further than the original Dark Souls. A genre defining game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Half the game is broken but the parts that are still intact are pretty good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Holds up well. Good combat, great level design, and an interesting world. It's a classic for a reason. 2nd half fall off is real though, unfortunately. Still worth playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is beautiful game and it's fun to play. Atmosphere and game play are top tier. It's hard to understand some things without internet guides and the second part has some downsides, but there are not a big deal",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The pinnacle of \"Souls Games\" or \"Soulslike\". This is what Demon's Souls started and it was perfected here. The game works on all fronts: gameplay, graphics, online, story and most importantly, the atmosphere or \"vibe\". I could not find any other game to fill the void left by Dark Souls Prepare to Die, until the remastered released and I bought it on all systems I could. My favorite of all From Soft games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the best dark souls title, arguably the best fromsoft title.\nalot of builds are op, which makes multiple playthroughs quite enjoyable. the simplicity of movesets and enemy design makes learning everything quite easy. late game areas can suffer a little with bad design but those areas are short.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game if you love dying and trying again. Other than that the story is great, great graphics for when it came out, and revolutionary.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "got the grass crest shield for the third time. life is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good story, bosses, places and people. It feels like my second home, when my mind is troubled i play it and it helps me relax, no matter how much this game is old I'll still chose it over and over again. For me NPC's make me feel less depressed and sad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite souls game. The richness of the story was brought to life in VaatiVidya's original videos he made on each of the characters which can still be found on YouTube. The amount of care and time From Software gives to each and every one of their characters in these games is outstandingly beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is something of it itself.\n\nNow as a remastered it's a joke as i had to download DSFix from Nexus mods just to even be able to play online.\n\nbut ignoring that the game itself is basically same as original Prepare to die Edition so if you own that then DON'T buy it but if you do then sure it is worth the experience and just remember this Don't you dare go Hollow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game through and through. One of the best to ever exist.\r\nThe only issue I had was with Capra Demon in Lower Undead Burg and Bed of Chaos, fuck 'em both!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just beat Smough and Orenstein, this game has been experience, it has changed what thoughts I had on the souls genre. Sekiro, Bloodborne, Dark Souls III, and Elden Ring were great. This game alone has taught me to have more patience and control than any other. I have enjoyed it thus far, and I hope to beat it. (I am using Zweihander btw.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute classic, a must play for any souls like enjoyer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty good. Might need a guide because there's a lot of information about the game that you aren't given or would miss otherwise. Also not being able to teleport between bonfires till you're half way through the game already is kinda lame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though i never grew up with this game and played it after elden ring, I still loved this masterpiece. The game does so much right between enemy design, world design, the atmosphere, the music, the characters etc despite the limitations it had at the time. The graphics still hold up and feel more like a classic style than dated, I still reminisce about this game today. \n\nThe First half of a game is a Divine Crafted Masterpiece, the map is so interconnected and beautiful. The lack of fast travel in the early game helps to highlight how interconnected the map is, which hints and nudges the player along the intended route to the next area and POI. The enemy layout is perfect, the music *chef's kiss*, overall I can't complain about anything here. \n\nThe second half isn't as good as the first, I still enjoyed it a lot, but it was clear that the developers had to rush a lot of it. The demon ruins is a clear example of this, with reused Taurus Demons just all placed together in a circle across a plain stretch of land. Its a pretty jarring comparision to the meticulous enemy placement of the first half. I personally didnt mind Bed Of Chaos, she felt like a skylander boss and was pretty fun but i can understand where the hate comes from. A lot of the later areas have some sort of half implemented gimmick to them, like needing a special ring to fight the 4 kings, the demon ruins and the lava. I would love to see a reimagining of the second half, I think it would make one of the Greatest games Of all time even better. \n\nThe endings to the game are excellent, The dlc was peak. I just wish there was some more you could do. Maybe an ending with Gwyndolin or Priscilla. Maybe finding where the real gwynevere went. stuff like that.\n\nOverall this is easily a 10/10 game, its a certified classic. Theres a reason theres the phrase \"The dark souls of .......\". I'd highly recommend to give it a try if you've ever considered it, Its not very linear but it rewards exploring off the beaten track and i admire it.\n\nGwyndolin is still my goat, buy ts game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterpiece. \nI finished it in 2018 with all achievements on PS4, and I buy it again now to relive the memories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. It is classic. The replay ability is great. There is deep lore, even if you have to go digging for it. If you're not sure about this game or need assistance, I highly recommend checking out ENB's  playthrough on YouTube. He is extremely thorough and listening to him go into detail about the level design and lore gave me a new appreciation of gaming as a whole. I just attained 100% achievements. I'm thinking about doing the same for the Prepare to Die edition. I will forever recommend this franchise. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A wonderful game that stands the tests of time, and you can sort of play with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty easy talking about souls games but definitely very good, good story, decent graphics, lovely desings and exccelent mapping.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fuck that game\n\n\nedit: I was mad after finishing it. Game was actually good, but still - fuck that game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played for most of my time with a keyboard and mouse and had some fun. The moment I got a controller however, this game got twenty times more fun. It felt like an actual game instead of a chore. If you have a controller and can bear being drop kicked into being humble, absolutely try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is right now one of my favorites and it is the only game in a while that i have actually enjoyed and was excited to play everytime i came home, the only thing i don't really like is the second half and basically the demon side of the game along with the crystal cave, there are a lot of areas that are just simply annoying, not hard, but extremely annoying to go through and can get you more mad than a boss, still not enough to make it anything even remotely close to bad, for me it is definitely a 9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Holy Molly Buy This GAME !!! [/h1]\nBack then in 2022, I played Elden Ring with hundreds of hours in it. That leads me to want more Dark Souls games. So here in 2025 I played Dark Souls Remastered. And I was amazed at how solid the gameplay, design, tricky dungeon, and Epic boss battle.\n\nI thought Dark Souls 1 was just a really drawback version of Elden Ring, but all the game mechanics like deep weapon upgrade system, online PVP, the design on how the world connected to each other it’s still on par with Elden Ring.\n\nYes I know the world is smaller, the graphics are just mehh.. and the online system is not great like Elden Ring, however looking back on their first release which is 2011, it was amazing that From Software was able to pull this off. And they Remastered it in 2018.\n\n[h2] Weapon & Armor Upgrade [/h2]\nGrinding, you need to do repeating stuff here, like farming certain enemies to get the materials you need in order to level up your weapon and armor. And it has different types of materials needed on each certain level thus fighting different types of enemies are inevitable, so that makes grinding less repeating.\n\n[h2] Graphics & Performance [/h2]\nAlthough the graphics are not great, the performance and FPS is really good. I never had a lag or delay during any gameplay or any boss fight, that's a total improvement for me which had lots of issues with performance in Elden Ring lol.\n\nI don’t mind the graphics as long as it has a stable FPS.\n\nBut for some reason I find it beautiful in some places during the [i] praise the sun message [/i] you will find this mostly on your journey.\n\n[h2] Overall Gameplay [/h2]\nThe parry here is more forgiving compared to Elden Ring, the lighter the shield the more timing window you have for parrying attack. \n\nDifferent types of enemies, I just can’t count on how many different enemies in this game. And they have their own unique moveset. \n\nTough boss fight especially for first timers, because you need to see what moveset that bosses have in order to find the attack timing window and healing.\n\nVery interesting armor list and also a good amount of weapons to choose.\n\nThe only drawback here is when you are using mouse and keyboard it’s really challenging to perform jump attack and kick. This is just really something that needs to bind to other keys duh… (But You can’t, perhaps mod would do this trick) \n\nBecomes addicted as hell when you already know everything, and want to create another build for the next run or just go to NG+.\n\nThe attack and defense mechanics on each different level of dungeon is really amazing, it is still the best. This is where the Dark Souls genre was born.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seen clips of this game and made me buy it. I played elden ring first so this game looked to be fun but lost motivation to play after i could not get out of the starting area either way this game seems fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still don't know how they came up with the level design and connectivity. This game deserves a bloody good remaster please fromsoft do it just bloody do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game even with it's flaws it it still one of the best I suggest you to buy this game not that hard in terms of gameplay only hard bosses are DLC and one mid game boss not gonna spoil and the one in New Londo Ruins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, it's also extremely fun to play with friends using the seamless co-op mod.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good. If you love backshots, 'cuz you'll be crawling through the intestines for 70% of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game so tiring that accidentally sleeping twice is the result of my 33-hour playtime (gud game tho)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard as balls and brutally unforgiving at times, but it's a must play for any RPG fans, and a true masterpiece!! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If only Elden RIng was more like this :(\n\nedit 1: Very conflicted ...\n\neverything \" good \" about this game is either drowned by what other people find funny/addicting/trendy AND the developers themselves seemed to not even care about in future releases.\n\nJust like Dragon's Dogma 1 ... these games are not the product of a \" genious \" ... instead, they are accidents, born of every part of the team making COMPROMISES while contributing their best in their respective field,\n\nInstead, modern games feel like the designer bosses around everyone else ... and thus, all the optimizations or uniqueness and diversity all the different teams COULD bring disappears ... and we end up with a broken product that satisfies only the director AND the manchildren that hype it.\n\nSad vibes all around, really ...\n\nedit 2:\n\none thing remains tho ... Dark Souls and Elden Ring are different, BUT both games in their own way DEMAND more time and attention, that if not given the game flat out doesn't work.\n\na sad thing ... where people value the needs of a product made to steal money from children and manchildren alike ... instead of the needs of people whose lives are finite, that could have anything happening in their lives and just wanted to escape for a little bit ...\n\nbut if you want and like so much a world where there is no escape ...\n\n\" I can only Provide \" ... like the good samaritan I am ...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Areas look beautiful despite the dated looks, Gameplay is fun (except for Blighttown) and story is great. Ending is underwhelming, but it's kind of good that way as it adds to the bleak world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "70% fighting camera\n10% fighting small spaces\n10% clunky movement\n100% im blind i cant see shit cuz why am i so blind \nalso fuck you capra demon <3\nfun have played d3 loved it alot felt like i might like d1 too i mean i do but its mixed on how the level is so small and so many tight spaces to the extent i cant see shit and \n90% im running back to bosses taking more damage than the boss can give me bro \nelden ring fixed this issue even d3 as you can run and do skip souls 3 lol. but i love this game i like it but im stuck at anor londo so ifykyk </3 hard ahh fight i love dark souls <3\nill come over it just like i got stuck at pontif sulviyan in d3 <3\nim mixed with this . 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dark souls is the biggest learning curve ive ever had in a game and it was an enjoyable experience at that. Learning how everything clicked together and how the dodging worked was a fun experience.\nThe first half of the game and the interconnected nature of the map was one of the coolest things I have ever seen in a game.\n\nEverything leading up to Anor Londo feels like you really are getting stronger, gaining power and making real progress. Arriving in the city feels like you have reached the peak and, in terms of actual map scale you have.\n\nBattling through Anor Londo, killing the Gargoyle and Silver Knights is (Apart from the bow section) a fun and monumentous task that shows how far you have come from the chosen undead locked in the asylum. All culminating in the best skill gate in any game ever - Ornstein and Smough. A true skill check to see if you will be able to complete the 2nd half of the game.\n\nThat being said...\n\nThe second half of this game is unenjoyable and annoying.\n\nThe level design after you leave Anor Londo is miles below what we had seen in the first half. Lost Izalith, Tomb of Giants and New Londo are all irritating and non-cohesive beyond what can be considered the usual dark souls difficulty level. Half of what happens in the 2nd half feels like artificial difficulty.\n\nThe bosses in the second half all suck for the most part. \n4 Kings were boring and easy, the boss arena was shit too and don't give me that \"Oh its in the abyss!\" Manus's arena was more detailed. \nBed of Chaos is well. Bed of Chaos.\nGravelord Nito was far too easy and boring.\nSeath didn't even feel like a boss when I fought him.\n\nLeading finally to Gwyn. Honestly the boss fight was disappointing HOWEVER the storytelling of the fight was impressive; A sombre theme for a man who should have died long ago, his attacks are sluggish and tired as if he has given up himself.\n\nAnd at the core of it that is what Dark Souls does best - its environmental storytelling, the subtlety of the world you inhabit and your place in it all culminating in a decision that truthfully doesn't matter because at the end of the day you are just another undead. The story and message of Dark Souls is incredible even if the game does lack in places.\n\nNow, onto what I believe is the best part of this game and what brought me the most enjoyment.\n\nArtorias of the Abyss.\n\nThis DLC is just enjoyable all the way through, The Sanctuary Guardian is a fun boss and didn't cause me too much grief, the Royal Wood is a pretty environment and the enemies are well designed, and then you find him - The greatest character in all of dark souls, the best designed, most enjoyable boss ive ever fought.\n\nArtorias The Abysswalker\n\nThis boss is perfect, his moveset feels erratic and matches his melancholic fate that befell him down in the abyss, his theme is beautiful and his physical design is amazing.\n\nFollowing that the Oolacile township is an enjoyable area, the abyss is cool and saving Sif is a great touch and finally: Manus, Father of the Abyss the 3rd best boss in Dark Souls 1. Truly feels like you're coming up against a primal power. Just Incredible.\n\nAll in all, Dark souls is a game that is not for everyone. If you like difficult games and realistic combat then this is for you. If you don't like janky mechanics and huge learning curves then this game is most certainly not for you. But read the lore cause damn its cool.\n\nlist of things i hate in this game:\nDogs\nBone Dogs\nGhosts\nCapra Demon\nPoison Swamp\nKilling Solaire.\n\nAnyway. Dark souls 2 next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I could throw a hundred fancy words at Dark Souls, but none of them match how incredible it actually feels to play. It’s something you understand only when you experience it yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally my favorite game of all time, I have hundreds of hours I bought it on pc to start playing online",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"then, there was fire\" still sends chills down my spine. One of, if not THE BEST game I've ever played. The ability to play however I want adds so much replay ability to this already big package of a game. Whether it's someone who is quick on their feet with a lightweight sword, a mage casting spells, or my personal favorite wearing armor made of stone and wielding a big ass sword twice my size that has the ability to stagger a foe merely NEXT to my attacks. This game does an amazing job of making you feel like a badass the more you progress. The game throws what feels like impossible odds at first but slowly, over time, after every death, you learn, you adapt, you get more efficient at killing your target to the point where you don't even need an estus flask! Then you see \"VICTORY ACHIEVED!\" and a rush of dopamine hits your brain. You can see your progress over time as you go through this dark twisted world. What was once a boss level threat is now a common enemy as you make your way to the next boss. Oh and the world? Don't even get me started. In this dark fantasy RPG the world has moments of looking bleak, hopeless, and ugly but there some spots with exceptional beauty and inspire awe. The level design often regarded as the best. Everything is cleverly connected like a figurative spiderweb with tunnels, lifts, and locked doorways so there isn't many places where you walk into a loading screen making the world feel more alive and realistic. The places in this world offer a great variety of challenge and struggle that go along with what I think is the main theme of the game. The story and lore are convoluted and even if you look deep into it, like a lot of great art, some of it is open to interpretation. What I've interpreted from it is this: never give up. That's literally a plot point. Whenever someone in this world loses hope, gives up, lost their purpose they go hollow figuratively and literally where you are just a shell of your former self. A body with no host essentially. This game puts you through HELL. Dying over and over again, losing everything you hold dear, with what feels like no end in sight. Know this, it only ends when you give up and lose your purpose. You can see why so many people who've gone through hell in their personal life can feel connected or inspired by this game. I'm sure you've seen the videos about how \"Dark Souls saved my life!\" While I can see why and I'm glad it does. I don't think it's saved me personally. However, this game DEFINITELY has changed my perspective on gaming entirely. I went from thinking \"There's no way! This is impossible...\" to \"I will try a hundred or a thousand times if I have to, in order to finish this!\" Which is why you NEED to buy this. Play it through to the end. Overcome the challenges, the obstacles. Beat the game. Hell, beat it another time but don't you ever, EVER, go hollow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Walking into ash lake was for the first time blew my mind! one of the best gaming experience ive ever had. Ngl The game felt easy compared to other FromSoftware games, lowkey i first tried most of them except O&S and Manus they humbled me hard. Still DS1 is one of my fav games ive played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it on pc to play mods but have played on console. always a classic and always a banger, even if the second half is kinda mid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a classic, and something about this game always brings me back to it despite the amount of times ive already played through it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is fun and has intense moments during boss fights, good story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, bad movement. Overall, one of the best games ever created. Great for souls-borne starters, very easy game if you use strength.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nearly fifteen years on, and this game still stands up even to modern titles. Maybe not graphically, but design wise, combat, artistic vision, bosses? There's a reason this title (technically Demon's) started an entire genre of gaming. Often imitated, rarely duplicated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Dark Souls in the trilogy by far. There isn't much I can say that hasnt been said already and better. Biggest aspect of the game I like the most is def how non-linear the game is, while still not being \"open world\" (open world games tend to make their selling point you can go anywhere anytime while having virtually nothing in said world) and thankfully this game does not fall victim to this. It has an expansive and interconnecting world that feels lived in with various locations and enemies you can meet. A perfect game and a true work of art, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE classic game within its genre. Few other action RPGs have stood the test of time so well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my  favorite games to date, a fantastic challenge with a fantastic story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls, a Flawed Masterpiece. This game is pure comfort food, the story, the music, sounds, areas, everything about this game will stick in your brain. I love this game so much, and after my 8th or 9th playthrough now, i fell in love all over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just rang the bell in the undead church and while the game starts off slow it really starts opening up as you get more confident in your fighting capabilities. I really like all of the customization and I get the hype if you catch it on sale it's definitely worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's my least favourite of the trilogy (because of missing quality of life improvements and improvements in general that appear in the later games) but it still stands on its own and is a decent game worth playing for its combat and satisfying reward system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Older but gold, rust around the edges but god damn is this a fine game and obviously sets the tone for the future of this awesome franchise and genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly think that this game is damn near a timeless classic. You can feel the game's age at moments, but I think that feeling adds to the love, heart and soul that was put into this game. The worldbuilding and level design is easily the game's greatest strength, at least in the first half. There are many moments where you feel like you are miles away from the starting hub area, only to loop back to that area five minutes later. Although, I have to admit that the lows of this game are LOW. The second half of the game does feel perfectly fine at times, but absolutely ABYSMAL at others. I don't want to spoil the game, so I'll keep it vague. When you get to the Demon Ruins, Lost Izalith, and the Crystal Cave, be ready for them. But even with those downsides in mind, by the end of the game, hopefully you'll come out the other end of the game as satisfied with the ending as I was when I was fourteen years old on the Xbox 360.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed playing however I wish you could go back to the end to get the other ending (not starting over again).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's my first time playing Dark Souls in all my years of being interested. It's so much fun. Learning where to go and how to fight is like a puzzle sometimes. It's so worth going in blind without spoilers, but it's so hard not to view content now that I'm really interested.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still enjoying it even after buying it for the third time on PC. used to play on consols and that game still enjoyable and worth every penny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Second half of the game makes me want to end it all, anor londo kinda fire though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The pinnacle of level design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starting with this jank really set an expectation that I couldn't reach when I first brought this but at some point it really clicked and I \"got good.\" Just the most iconic souls out there that really has changed all of gaming imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so this is where Elden Ring started?\n\nhands down, one of the HARDEST experiences I've ever played in my life.\nSo many modern mechanics are missing from this and it's what makes this game hard, but at the same time, it shows you how far Fromsoftware has come. \nI hated this game for the majority of the experience, but I would recommend this to anyone who wants to hate themselves for a little while. (and to real gamers who want a challenge)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an amazing game with a great world, good challenge and deep mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I must say probably one of my most favourite gaming experiences ever, the world is a true marvel to explore, the bosses are fun and rewarding and the amount of weapons allows for so much creativity when creating builds, Every boss is fun to fight (Except bed of Chaos), and the final boss was truley incredible.\r\nIncredible Game 100% would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This might be the best dark souls ever. Where it all began, the lore, the mechanics, everything (except demon souls but it isnt in pc). Literally better than Elden Ring. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't a game, it is an experience.\nIt doesn't hold your hand, for better or for worse. \nYet, even while it spits in your face and takes away more than it gives, you will feel even more accomplishment afterwards. Bloody, tattered, emaciated, but still alive.\nYou look back to where you were walking from, and you see the trek you've made, from miles away, to here. Where you are now.\nCome forth, my friend. And don't you dare go hollow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can´t even start on how much i love this game. \r\nAmazing story writting and map design, the characters that you encounter in your game play really sticks to you (especially our boy solaire \\[T]/ ), but sometimes you just crash out due to stupid stunlocks our bad hitboxes, BUT, its still one of the best games of all time. And remember to thank God to be alive at the same time as this master piece. Praise the sun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always wanted to play Dark Souls but never thought I had the patience or ability. A year ago I finally caved and got Elden Ring, and somehow managed to get through the whole game, even beating Promised Consort Radahn! Decided to come back and check out where the series got it's start. So far, it's a pretty good game, and actually a bit harder than Elden Ring in some ways. I'm not sure I'll go for 100% like I did with Elden Ring, but I think I'll at least try to beat it once. Pretty fun though, would recommend if you want a challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly a life changing experience. Despite its themes, it's one of the most beautiful games ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a challenging game. if you like real hard game, this game is your choice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game. Dark Souls 1 on the PlayStation 3 was my beginning with the souls games and then I play every game from them. First walkthrough is rough but believe me it is worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really simple mechanics to be able to follow. You can really play the game any way you want and it's enjoyable. Just don't mess up your stats.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easiest souls game. Pickup the great scythe from spawn = 5 hit bosses max",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I truly love this game, its a masterpiece in every way. The only thing I dislike about the game is that you can't fast travel until you get through andor londo, also leveling is super hard in the beginning, enemies have little amount of souls to give you, so have fun grinding to be a high level. Other then that the game holds up well and looks amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everytime I log on to this game I am willingly going down a slide fully naked with my balls dragging all the way along broken glass, yet here I am.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has 100% this game, I can confidently say this game is truly amazing. If you have any desire at all, even a slight notion you'd like this game, I guarantee you will love it. Lordran is such a lovely place to spend your time, as the graphics and sound design is dated, yet so pleasant to hear when you're used to very attention-grabbing ADHD games that currently come out. 10/10, my favorite game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An acquired taste for sure, but there's a satisfaction and fulfillment that comes with the learning curve that a 40 hour job hasn't given me in almost 20 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game for beginners to gaming, it builds confidence and commitment, problem solving skills, and managment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holds up really well, pvp still somewhat active, gameplay still fun(although somewhat slow compared to future titles like elden ring)\r\n11/10 would kill every bounding demon in Lost Izalith again",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Flawed masterpiece but really should have been a free upgrade for those who owned Prepare To Die Edition (the original PC port). $40 price tag for this game is quite steep too due to this game's age.\n\nADDITIONALLY- The game falls off a bit after beating Smough and Ornstein. You're gonna do quite a lot of running and backtracking even after you gain the ability to warp. That's why I call it a flawed masterpiece.\n\nEdit: People really be giving me jester because they like running in open fields doing nothing OR they love paying extra for an arguably inferior version (though 60fps is nice). So look in the mirror fellas. Of course there are some solid bosses and areas after S&O but the first few hours of DS are (mostly) perfect.",
      "voted_up": false,
      "votes_helpful": 116
    },
    {
      "review": "Dark Souls is for a very specific type of player. That player should be patient, calculating, determined, and detail-conscious. Only by paying close attention to every single detail, from item placement to enemy behavior, can you start to unwind what is unquestionably one of the greatest untold stories in gaming history. You must force the world to yield up its secrets, or be condemned to wallow in ignorance. There is a masterclass in storytelling occurring here that has taken a decade to unpack. \r\n\r\nAll that said, the game actively tries to find ways to make you quit, and largely succeeds not due to the difficulty of enemy attack patterns or crazy timing, but rather an endless slog of bullshit that makes the simplest tasks an exercise in fortitude. In that regard the gameplay is more akin to arcade platformers, in spirit if not in execution. Prepare to run back through gauntlets to get to every boss battle, for boss battles that are as much about luck as skill, for an unforgiving combat system, and a constant battle between sunk-cost thinking and the question, \"could I be playing something that doesn't make me scream and throw my controller?\" Yes, yes you could. Still, even if it's not my cup of tea in comparison to its later entries, there is a lot of genuinely great material here that walked so Dark Souls 3 could run.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "My second attempt to finish this game (the first attempt being the Prepare To Die Edition), and I just had to give up out of frustration again. The game isn't even necessarily HARD, it's just needlessly frustrating, and too many of the mechanics (and controls) seem to be clunky and janky purely for the sake of making the experience less streamlined. People with more patience than me may enjoy it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "y*rrak gibi bir hitboxu var büyüm lavuğun içinden geçiyor amk almayın aldırtmayın leş gibi oyun\nedit:mekaniklere az sövmüşüm bir daha s2m bir de o stray demon 2.bossu tasarlayan mk japonu seni de elleyecem",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not all that great. After playing elden ring and sekiro this game feels like slow motion. The level design is frustrating and poorly designed (especially blighttown). and the game is not hard at all compared to elden ring and sekiro, most bosses can be killed in one or two attempts (dlc bosses are challenging). The difficulty in this game is it being tedious, with long run backs and annoying enemies, not actual difficulty.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "one of the worst games I have ever played in my life. I left it alone and came back to it and it was still ass. I cannot fathom how they made not one, but two sequels to this game, the former of which I have only heard worse things about. anyone who calls this game a masterpiece must be genuinely insane, or must have never played any other games in their whole life. at least the player base was competent enough to recognize the atrocity that was bed of chaos.\n\nanyway, stay tuned for my dark souls II review once I finish playing it.\n\nsolaire was good tho.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There are some aspects of this game I like, if I could I'd give this a middle review, but there's so much I didn't enjoy, that I wouldn't really recommend it\n\nThe DLC are and the wolf are cool though, the game definitely has it's positives but I don't recommend it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Started with Elden Ring and wanted to check their other games. This game is just too dated. 10 hours in, just got into blight sth. It's just too clunky and old looking. Combat is slow af, cant wear anything. For now it's just boring. Maybe I will change my opinion later, we will see",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for whatever reason controller support isnt working for me. i only play souls games with controller so fuck you and this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I´ve been enjoying DS:R so far... but when I reached Anor Londo I got invaded and before dude even spawned he insta killed me and all the NPCs in my game :) \r\nSo don´t play this game without some external anti-cheat",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont see point in wanting to play this, if there are less outdated souls games like dark souls 3/elden ring/lies of p, and so on... \n\ndark souls 1 made me angry because of outdated design (weird hitboxes,annoying runbacks,etc...)\n\ndark souls 3 made me angry because i was shit (good design, didnt feel cheated by game)\n\ni think the game is imo worth it (but not for 40$ holy shit) if you want to beat the ds trilogy/played other soulslikes and want another one/nostalgia\n\nbut one crazy good thing about this game is the atmosphere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah I dunno man, I guess I expected too much. I thought if it was good enough for ymfah, it'd be good enough for me.\r\nThe game looks really weird, first off. I blame the remaster for this; I bet the original looked fine. Volume mixing is atrocious, especially for dialogue. I think the intent might've been contrast (between combat and exploration moods) but it gets pretty bad.\r\nThe enemy design is really good, obviously the focus of the game. You know the design is great when it feels like the game wants you to win. Nowhere in enemy design was there ever a letdown. Unfortunately, level design did not match this. The setpiece fights have great arenas, tailored to their strategies, but world encounters suffer enormously from design oversight. I've been spoiled by Valve, I guess.\r\nThe music was pretty uninteresting, for the most part. I guess the few OST songs I'd heard were just standout good.\r\nReally just meh aside from the boss fights, but with more bad than good, hence the negative.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It´s great that it´s a tough game but losing out on important gear because of some buggy mess that kills a NPC without being able to rectify it? That's just being disrespectful of the time of players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is interesting enough to finish, but not enough to enjoy.\nand the jank oh the jank !!\nThe last 30% of the playthrough was just me half-seething.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was in the middle of a bossfight, doing really well, and then the game decided that there is something wrong with my network and forced me back to the title screen... How is this ok in a singleplayer game? I don't care about the online features, the vast majority of the time I'm playing by myself, and I like it that way. Why not just flash some brief message, somewhere in the corner of my vision, about the whole network issue? Why was I forced back to the title screen due to network issues, when the game I'm playing is singleplayer? I enjoy playing Dark Souls, but this just isn't acceptable. Oh, and cherry on top? My wifi was working just fine, so the feature doesn't even work properly. Just why...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "feels like playdough, lots of bugs, play ds3 or elden ring instead\n\nworst game of fromsoft for sure, even if there'll always be glazers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot have sex with Solaire. Gwynevere boobs aren't real. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Is this supposed to be a remaster? The sound disappears when alt-tabbing, even in Borderless mode. Furthermore, there is no information regarding which starting gifts are useful, meaning you could end up with a good one or garbage. It's just pure suffering as it is.\n\nThe controls are terrible; everything feels slow and unresponsive. Additionally, there is no specific button for the kick maneuver, which makes fighting shielded enemies tedious.\nAlso got price bump for Ukraine during the war -_-",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DARK SOULS has a lot of glaring issues that make this game NOT FUN.\nThe worst offenders:\nNo. 1: forced PvP (Player invasions). It's a shit design choice that should have been patched out. Later games offer the choice to play offline or semi-offline to prevent player invasions from happening when you don't want them, but NPC invasions (equally annoying) remain. Hopefully FromSoftware will ditch this antiquated crap mechanic once and for all.\nNo. 2: gank boss fights. That is just bad game design. And there's a lot here, the worst offender being the infamous Ornstein and Smough.\n\nNow the remaster updates the graphics that were rather poor when this came out, but the worst issues remain - hence it gets the thumb down. There are better \"Souls-like\" titles out there, MORTAL SHELL is much more fair and a superior title, and both LORDS OF THE FALLEN games are far superior. Sorry FromSoftware fan boys, I will not be joining your circle jerk.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't get how people legitimately enjoy this game, it is legit one of the worst games I've ever played, and I've been playing games since I was 5 years old. The music is awesome, that's ALL I can say about this game that's positive. The so called \"Intricate level design\" everyone claims it has is just a bunch of shortcuts that make no sense in any way shape or form, but hey at least it's all connected to Firelink Shrine, as if that somehow makes it better. I much prefer a game with logical structures (Not CONSTANT cliffs) that are connected through logical means (Not a 1 minute elevator to heaven that somehow gets you to a church).\n\nThis game is NOT difficult, it's INCONVENIENT, that's the biggest issue I have with it, barely any bonfires, and they're terribly placed, stun locking, gang fights, clunkiest controls I've ever had to endure... The bosses are super easy, but the enemies you face between the bosses are insane. A rat does the same damage to you as a giant Bull monster... Also, for some reason From Software still hasn't updated some move sets that they used in this game... Who tf slams a claymore the ground? How is that cool? Is our character as strong as a child perhaps?\n\nI could say bad things about this game for hours, but to make a quick summary: Game that prides itself on difficulty despite being more tedious than anything else, has terrible controls, combat is not satisfying, the map is nothing out of the ordinary but worst of all, it does not respect the player's time.\n\nIf Miyazaki himself has done nothing but strive away from this game is for a reason, it sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What is wrong with this game? Why are the settings automatically set to 0? Apparently my game is bricked on start up and I have to quit out and start the whole game again because my settings for UI are set to 0... I did not touch those settings. Also it seems that the automatic settings for all audio are 0 as well? What kind of mad design choice...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Мда уж вот это ремастер, дропнул эту душную, не интересную игру в который и больше часа не хочется находиться, ммм бежать до боса от костра 2 минуты и уворачиваться от толп зомби, крыс, рыцарей и другой местной фауны, нет уж спасибо у меня нет столько времени, лучше пойду элден заново пройду.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idc man I've tried to get into this game alone 100 times and it's just the same amount of bogus.\r\nmy last fight just ended with me losing, because I lost internet and it kicked me out of the game, I love not being able to just play singleplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "run back to the gargoyles is enough to not play the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very hard to the point where finally beating the boss doesn't feel rewarding it feels like i just got outta the dmv",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game gets repetitive really fast. Boss fights are super easy if you know how the game works. The only thing that makes this game challenging at all is that the game doesn't tell you what anything in the game is for or how it works, which is one of the worst ways to increase the difficulty of your games. It's not hard to drive a car, but if you take a car onto the interstate without knowing what any of the controls do, of course you're going to have a hard time. The game uses some familiar mechanics from other games like leveling up to bait you into making the wrong decisions because apparently the people at Fromsoft can do anything but code an actual difficult fight. You get encumbered at half your equip capacity, which the game doesn't tell you. Most games the capacity is the point at which you become encumbered. Once you learn how things work, most of the bosses die in three or four hits and you're pretty much invincible. A one trick pony.\n\nI don't know why I thought this would be different than Elden Ring, which I refunded after about an hour or so of playing. That game relies on input lag to make the fights harder, but still on my first playthrough of Elden Ring and being a complete noob I nearly killed the boss on the horse on my first try fresh out of the gate. At least Dark Souls Remastered has ultrawide support (how does that make sense?) and the controls are responsive and not laggy so it is technically a better game. \n\nI think the only reason people play these games is to see if they can do it. Let me save you the trouble. Yes you can. It will just be monotonous and repetitive whether you steamroll all the fights having figured out the game or you play the same boss over and over trying to defeat it. You can do it, but whether you will want to depends on whether or not you have better games you want to play.\n\nAside from the gameplay, one other thing that stands out as really bad is the grammar of some of the dialog, particularly when they're speaking Early Modern English. They constantly use the third-person singular simple present conjugation of verbs for the second-person. I've seen clips of later Souls games and this hasn't changed. An example:\n\n\"But cometh thee not for the grave of Sir Artorias?\"\n\nwhich should be \"But comest thou not for the grave of Sir Artorias?\"\n\nThe way it is written in the game it's the equivalent of saying \"But it comes to you not...\" as thee is used as an object and not the subject, and cometh is the wrong conjugation. Except for a few verbs, this is pretty much what happens across the board. Strangely enough, in certain places where they do use the second person singular simple present conjugation it is where the imperative should be used which is the same as the bare infinitive. Go figure. Another abomination is:\n\n\"Thou dost cometh.\"\n\nAs in Present-Day English, when using an auxiliary verb with a verb, the auxiliary verb is conjugated as normal and the verb it's modifying is the bare infinitive. You say \"He comes\" or \"He does come\" not \"He does comes.\" And again, as always they're using the wrong conjugation of come so even if you drop the auxiliary verb it's still wrong. And all these examples are from just one of the many dialogues that use this language.\n\nI know this is a strange thing to be critical of, and I know this is a Japanese studio, but maybe don't attempt to use archaic language for the dialogue. If you're not familiar with Early Modern English, you probably won't notice but if you are it's a bit immersion breaking as these characters are clearly not all making a conscious choice to use improper grammar.\n\nAs far as the story, it never made me care about it. The story is as crucial to this game as a story is to a mindless action movie. It's there because it would be pretty stupid not to have it, but it's just an illusion of a story, in the end this is just a series of boss battles. You spend almost all of your time either in a boss battle or trying to get to the next one. I do have to say the opening sequence for this game is 100 times better than the one for Elden Ring. At least this one explains the set up quite a bit more while the Elden Ring one was just a list of character names you're supposed to care about without knowing who the heck they are. This one does list a few names but the list makes sense in its context and isn't a borderline parody like the Elden Ring one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's dated beyond repair. having 2 fights where healing is just not an option is a sign of a bad game, the only reason i would ever tell someone to play this game is so they can say they have beaten it. \r\n\r\nvery few parts of this game ever felt fun and when it did it was often followed by dissapointment. \r\n\r\n(spoilers ahead) \r\n\r\nLets take the last boss as an example, i ran in and right of the bat the fight felt fun. his moveset seemed fun to learn and i was ready for a fun fight right up until i tried to heal, no matter how many different times i tired no matter what attacks or moves i did it after it didnt matter he always got a hit in. \r\n\r\nthat ruined the whole fight, which then made me go for the parry method which felt empty. pluss having to run all the way back every time you die (for any boss) is just a waste of time, its not any harder and adds nothing but a timewaster. 3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this some fucking bullshit im just tryna do some coop but this bitch saved my file on my laptop STOP DOING THAT I NEED THIS SAVE BRU please patch NOW :pray",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TBH, if you thought you liked DS3/elden ring so you'll like this one... Don't count on it. Really a bad game in comparison. Such low quality of life and hostile game design in this one. Controls are more clunky too. Half of my deaths are BS infuriating deaths due to bad game design or lack of polishing and I hate it. In DS3/Elden ring, dying is mostly your fault, not caused by BS half the time. I still enjoy playing a souls game, but oh god it is so bad half of the time. Glad they improved on it in the later released games. Bosses also tend to be super easy on this one, most with easily exploitable weakpoints you find right away... The hardest ones are actually garbage but they cause artificial difficulty by putting you in tight rooms so you can't maneuver. That ain't fun, thats BS again. They do that with thrash mobs too. I hate it. Again, not an amazing game by today's standards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did you think anything that Elden Ring did was oddly archaic? Did you enjoy janky AI and poor camera angles that made the game feel clunky and frustrating?? Well then this is the game for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]IMPORTANT EDIT : I realized that according to several media outlets and official sources, there are security flaws in Dark Souls 1, 2, and 3. And we're not just talking about finding an IP address and be like “Nyeh nyeh nyeh, I know where you live, but since you live 1,000 kilometers away from me, I'm not going to do anything!”\n\nNo. These flaws allow hackers to control your PC remotely and do pretty much whatever they want on your machine. So they can effectively: control your PC remotely, ruin your PC if they want to, install viruses, steal your personal data, hack your browser cookies (Google Chrome, Firefox) including your Google, Steam, and Facebook accounts, your bank accounts, your health insurance accounts, and do I need to go on? \n\nIt's an ABSOLUTE DISGRACE. The creators of this game deserve CRIMINAL penalties, and very severe ones at that, if I may say so. Imagine playing a mediocre game and then someone potentially ruining your life? I know I've been very harsh on this game, and despite everything, I respect those who enjoy this game and the Souls series, but this is no longer just a subjective opinion from someone who doesn't like the game, but your life is literally at stake. Someone with malicious intent could literally steal your identity or empty your bank accounts.\n\nSeriously? There's also the same problem with older Call of Duty games (even WW2, for example), and Activision doesn't give a shit about it and continues to sell their games for $60. Well, it's the same thing here, it's a joke. I bitterly regret installing this crap on my PC. Where is Steam moderation to remove these games permanently until the problem is solved? But no, because there are suckers with white liquid in their mouths, the game is still accessible to everyone. What an outrage. Never install this thing. At worst, play it offline or on a console, but it's an absolute disgrace. ABSOLUTE. So, to conclude, I'll give you the honor of my rating for this game: 0/10. Don't install this piece of crap on your PC.[/b]\n\nA game that has aged very poorly. The controls are unresponsive and extremely slow, the level design is absolutely terrible, and the game is ugly despite being “remastered.” The game is not fun. Don't fall for the reviews that consider it an excellent game; they are blinded by biased nostalgia and their lack of experience with video games at the time they played this game. No one can change my opinion about these Souls games; they are bad and will always remain so. Stop living in a utopia, thinking that this game was incredible for its time. Even when it was released, the game was already outdated and absolutely no fun. Definitely the most overrated game ever. \n\nI advise you to turn to great “Souls-like” games that deserve infinitely more recognition, such as Black Myth Wukong or Lies Of P, which are infinitely better than this game. I'd like to take this opportunity to point out the 60 fps lock, which isn't absolutely horrible because it's still playable and because games weren't previously capable of running at higher refresh rates, especially on consoles or older PCs, but having a 60 fps lock on Elden Ring released in 2022 or even Nightreign released in 2025, is absolutely shameful and demonstrates terrible optimization that is unworthy of what video games can offer today, especially on PC. But I'll go into more detail on this point when I review Elden Ring and I'll probably be very salty about it.\n\nIn short, this game deserve no recognition and would be better off in the void of forgotten games. I regret buying it even on sale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ts is so ass 😭 made me appreciate ds2 even more because of how much of an improvement it was over this game. The first half of the game is fine i had fun unlocking shortcuts and stuff but the second half was unbearable and this remaster sometimes looks even worse than the og game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is hard and pointless. I don’t understand people who love Souls games—why do you spend all your time memorizing a boss’s movements, dodging them, and killing it? And why do you feel such an incredible sense of satisfaction when you finally do it? Is it because you can’t accomplish anything in real life? Do you get your sense of fulfillment by telling others what you managed to do in this game?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Open Steam Profile\" on sinners will spam-open new tabs in steam overlay and not be stoppable, How do you manage to incorrectly implement that?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the absolute worst soulslike ever created (after ds2)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is like blue cheese but most of the time it's just the blue bit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too clunky for a remaster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck u trash mechanics ruin the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dunya uzerındekı en kotu oyun olabılır",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i dont like this very much so far its making me unhappy",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Outdated with poorly designed boss fights.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My ass tastes better than this game plays.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game suck massive dick",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is Aweful.. Like very bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Searching for another world to invade...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is the best dark souls game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most famous kusoge game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "didn't feel like torrenting ptde this time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this shit fucking sucks yo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I died twice to pinwheel",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Aged like vomit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "outdated asf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NO STEAM CLOUD SAVES",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dark souls 2 is better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bed of chaos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ds2 better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bilewater",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Flawed masterpiece but really should have been a free upgrade for those who owned Prepare To Die Edition (the original PC port). $40 price tag for this game is quite steep too due to this game's age.\n\nADDITIONALLY- The game falls off a bit after beating Smough and Ornstein. You're gonna do quite a lot of running and backtracking even after you gain the ability to warp. That's why I call it a flawed masterpiece.\n\nEdit: People really be giving me jester because they like running in open fields doing nothing OR they love paying extra for an arguably inferior version (though 60fps is nice). So look in the mirror fellas. Of course there are some solid bosses and areas after S&O but the first few hours of DS are (mostly) perfect.",
      "voted_up": false,
      "votes_helpful": 116
    },
    {
      "review": "Dark Souls is for a very specific type of player. That player should be patient, calculating, determined, and detail-conscious. Only by paying close attention to every single detail, from item placement to enemy behavior, can you start to unwind what is unquestionably one of the greatest untold stories in gaming history. You must force the world to yield up its secrets, or be condemned to wallow in ignorance. There is a masterclass in storytelling occurring here that has taken a decade to unpack. \r\n\r\nAll that said, the game actively tries to find ways to make you quit, and largely succeeds not due to the difficulty of enemy attack patterns or crazy timing, but rather an endless slog of bullshit that makes the simplest tasks an exercise in fortitude. In that regard the gameplay is more akin to arcade platformers, in spirit if not in execution. Prepare to run back through gauntlets to get to every boss battle, for boss battles that are as much about luck as skill, for an unforgiving combat system, and a constant battle between sunk-cost thinking and the question, \"could I be playing something that doesn't make me scream and throw my controller?\" Yes, yes you could. Still, even if it's not my cup of tea in comparison to its later entries, there is a lot of genuinely great material here that walked so Dark Souls 3 could run.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love dark souls 1 so if u want play it buy it but I am giving negative review because I they delisted the original version of the game and really we cannot access it without pirating, and because I am not pirate and I cannot play original version I am not giving positive review but if u want to play ds1 then I am recommending the game itself but I just don't like the marketing they did",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Not all that great. After playing elden ring and sekiro this game feels like slow motion. The level design is frustrating and poorly designed (especially blighttown). and the game is not hard at all compared to elden ring and sekiro, most bosses can be killed in one or two attempts (dlc bosses are challenging). The difficulty in this game is it being tedious, with long run backs and annoying enemies, not actual difficulty.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "My second attempt to finish this game (the first attempt being the Prepare To Die Edition), and I just had to give up out of frustration again. The game isn't even necessarily HARD, it's just needlessly frustrating, and too many of the mechanics (and controls) seem to be clunky and janky purely for the sake of making the experience less streamlined. People with more patience than me may enjoy it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "y*rrak gibi bir hitboxu var büyüm lavuğun içinden geçiyor amk almayın aldırtmayın leş gibi oyun\nedit:mekaniklere az sövmüşüm bir daha s2m bir de o stray demon 2.bossu tasarlayan mk japonu seni de elleyecem",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A heartbreakingly low-effort, compromised version of my favorite game. The original PC port was a technical nightmare, plagued by frame drops and framerate dependent game logic, to say nothing of what the lack of anti-cheat allowed to happen in multiplayer. But it was also visually striking and had a boldness to its shadows and light that have caused some passages to by burned into my memory. \nThis \"Remaster\" smoothes over the visual flair and stark contrasts, tosses out assets that give the game's world a unique look, and carelessly unifies the color grading. If games are art, this is an amateur restoration covered in smudges and a stranger's fingerprints.\nPassword matchmaking is nice, I guess.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "one of the worst games I have ever played in my life. I left it alone and came back to it and it was still ass. I cannot fathom how they made not one, but two sequels to this game, the former of which I have only heard worse things about. anyone who calls this game a masterpiece must be genuinely insane, or must have never played any other games in their whole life. at least the player base was competent enough to recognize the atrocity that was bed of chaos.\n\nanyway, stay tuned for my dark souls II review once I finish playing it.\n\nsolaire was good tho.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There are some aspects of this game I like, if I could I'd give this a middle review, but there's so much I didn't enjoy, that I wouldn't really recommend it\n\nThe DLC are and the wolf are cool though, the game definitely has it's positives but I don't recommend it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I´ve been enjoying DS:R so far... but when I reached Anor Londo I got invaded and before dude even spawned he insta killed me and all the NPCs in my game :) \r\nSo don´t play this game without some external anti-cheat",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "~40 hours on my other account\n\nidgaf how many clowns I'm spammed with, this is overhyped, glorified shit from actual donkey ass. not even mods can fix it.\nanyone who says this is a masterpiece is just blinded by lens of nostalgia, and I say this as a big fan of DS3 and even DS2. Hell, I even 100% DS3, and that's a pain for anyone who has been through it.\n\nOnline is still plagued with people who can corrupt your game and get you banned on a whim, or people who genuinely cannot for the life of them find it in them to play any other game on the planet.\ngameplay has not aged well in any way, shape, or form. the world is cool, there's a lot to do, but is it worth ripping your hair out to rng and cheap deaths such as the literal floor caving out from underneath you randomly that you *have* to suffer for not having the hindsight for? no. this is genuinely awful.\n$10 game? yes. $20? big maybe, depends on how much of a maso you are. $40? not even close. I genuinely regret buying it at full price on launch, and every time I come back to give it another shot I'm just disappointed. I get thoughts like \"maybe I just suck. Maybe I'm washed. maybe I need to just give it another go.\" No. The game has just not aged well at all.\nDon't buy it, just go watch some lore videos and get the only meaningful experience you can obtain out of this game. A remaster isn't enough, this game genuinely just needs remade.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is too fucking scary\n\nThat's what I wrote when I started this game. I was told, my fear would turn to anger, and it did,\nIt did so, and did not look back. This game is a sadist's dream.\n\nEvery time I die to a boss, I have to go sulk in the corner for two minutes, and think about how bad I've been doing. Every single time, I have to walk back, and I have to tell myself, \"Alright, I'm not gonna die in two hits this time. I'll read my opponents moves.\" Is this to make me like, chill out or something? Is that what it is? And then you put enemies in the corner and I have to kill them too, before even getting to the boss.\nThe online features are nice, and all... I had to turn them off about halfway through Anor Londo. People can just join you and kill you, so long as you are human. Isn't it cool? This is what people praised about this franchise. That people can just do that. \"You'll get used to it\". No, I don't think so.\n\nI know at this point I wouldn't recommend this game, not just out of frustration, but out of necessity. Please play other hard games instead of this. Genuinely. They respect your time more than this game ever will. They will also probably take less of your money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Started with Elden Ring and wanted to check their other games. This game is just too dated. 10 hours in, just got into blight sth. It's just too clunky and old looking. Combat is slow af, cant wear anything. For now it's just boring. Maybe I will change my opinion later, we will see",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "why does anyone like this, I genuinely hate this game. I came from Elden Ring, Sekiro, Dark souls 3 and 2, but this game is garbage. I ruined my whole mouse, now my mouse is fucked up. Once you open the game, your mouse kills itself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for whatever reason controller support isnt working for me. i only play souls games with controller so fuck you and this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont see point in wanting to play this, if there are less outdated souls games like dark souls 3/elden ring/lies of p, and so on... \n\ndark souls 1 made me angry because of outdated design (weird hitboxes,annoying runbacks,etc...)\n\ndark souls 3 made me angry because i was shit (good design, didnt feel cheated by game)\n\ni think the game is imo worth it (but not for 40$ holy shit) if you want to beat the ds trilogy/played other soulslikes and want another one/nostalgia\n\nbut one crazy good thing about this game is the atmosphere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah I dunno man, I guess I expected too much. I thought if it was good enough for ymfah, it'd be good enough for me.\r\nThe game looks really weird, first off. I blame the remaster for this; I bet the original looked fine. Volume mixing is atrocious, especially for dialogue. I think the intent might've been contrast (between combat and exploration moods) but it gets pretty bad.\r\nThe enemy design is really good, obviously the focus of the game. You know the design is great when it feels like the game wants you to win. Nowhere in enemy design was there ever a letdown. Unfortunately, level design did not match this. The setpiece fights have great arenas, tailored to their strategies, but world encounters suffer enormously from design oversight. I've been spoiled by Valve, I guess.\r\nThe music was pretty uninteresting, for the most part. I guess the few OST songs I'd heard were just standout good.\r\nReally just meh aside from the boss fights, but with more bad than good, hence the negative.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It´s great that it´s a tough game but losing out on important gear because of some buggy mess that kills a NPC without being able to rectify it? That's just being disrespectful of the time of players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is interesting enough to finish, but not enough to enjoy.\nand the jank oh the jank !!\nThe last 30% of the playthrough was just me half-seething.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was in the middle of a bossfight, doing really well, and then the game decided that there is something wrong with my network and forced me back to the title screen... How is this ok in a singleplayer game? I don't care about the online features, the vast majority of the time I'm playing by myself, and I like it that way. Why not just flash some brief message, somewhere in the corner of my vision, about the whole network issue? Why was I forced back to the title screen due to network issues, when the game I'm playing is singleplayer? I enjoy playing Dark Souls, but this just isn't acceptable. Oh, and cherry on top? My wifi was working just fine, so the feature doesn't even work properly. Just why...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "feels like playdough, lots of bugs, play ds3 or elden ring instead\n\nworst game of fromsoft for sure, even if there'll always be glazers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot have sex with Solaire. Gwynevere boobs aren't real. Literally unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Is this supposed to be a remaster? The sound disappears when alt-tabbing, even in Borderless mode. Furthermore, there is no information regarding which starting gifts are useful, meaning you could end up with a good one or garbage. It's just pure suffering as it is.\n\nThe controls are terrible; everything feels slow and unresponsive. Additionally, there is no specific button for the kick maneuver, which makes fighting shielded enemies tedious.\nAlso got price bump for Ukraine during the war -_-",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DARK SOULS has a lot of glaring issues that make this game NOT FUN.\nThe worst offenders:\nNo. 1: forced PvP (Player invasions). It's a shit design choice that should have been patched out. Later games offer the choice to play offline or semi-offline to prevent player invasions from happening when you don't want them, but NPC invasions (equally annoying) remain. Hopefully FromSoftware will ditch this antiquated crap mechanic once and for all.\nNo. 2: gank boss fights. That is just bad game design. And there's a lot here, the worst offender being the infamous Ornstein and Smough.\n\nNow the remaster updates the graphics that were rather poor when this came out, but the worst issues remain - hence it gets the thumb down. There are better \"Souls-like\" titles out there, MORTAL SHELL is much more fair and a superior title, and both LORDS OF THE FALLEN games are far superior. Sorry FromSoftware fan boys, I will not be joining your circle jerk.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't get how people legitimately enjoy this game, it is legit one of the worst games I've ever played, and I've been playing games since I was 5 years old. The music is awesome, that's ALL I can say about this game that's positive. The so called \"Intricate level design\" everyone claims it has is just a bunch of shortcuts that make no sense in any way shape or form, but hey at least it's all connected to Firelink Shrine, as if that somehow makes it better. I much prefer a game with logical structures (Not CONSTANT cliffs) that are connected through logical means (Not a 1 minute elevator to heaven that somehow gets you to a church).\n\nThis game is NOT difficult, it's INCONVENIENT, that's the biggest issue I have with it, barely any bonfires, and they're terribly placed, stun locking, gang fights, clunkiest controls I've ever had to endure... The bosses are super easy, but the enemies you face between the bosses are insane. A rat does the same damage to you as a giant Bull monster... Also, for some reason From Software still hasn't updated some move sets that they used in this game... Who tf slams a claymore the ground? How is that cool? Is our character as strong as a child perhaps?\n\nI could say bad things about this game for hours, but to make a quick summary: Game that prides itself on difficulty despite being more tedious than anything else, has terrible controls, combat is not satisfying, the map is nothing out of the ordinary but worst of all, it does not respect the player's time.\n\nIf Miyazaki himself has done nothing but strive away from this game is for a reason, it sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What is wrong with this game? Why are the settings automatically set to 0? Apparently my game is bricked on start up and I have to quit out and start the whole game again because my settings for UI are set to 0... I did not touch those settings. Also it seems that the automatic settings for all audio are 0 as well? What kind of mad design choice...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Мда уж вот это ремастер, дропнул эту душную, не интересную игру в который и больше часа не хочется находиться, ммм бежать до боса от костра 2 минуты и уворачиваться от толп зомби, крыс, рыцарей и другой местной фауны, нет уж спасибо у меня нет столько времени, лучше пойду элден заново пройду.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idc man I've tried to get into this game alone 100 times and it's just the same amount of bogus.\r\nmy last fight just ended with me losing, because I lost internet and it kicked me out of the game, I love not being able to just play singleplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "run back to the gargoyles is enough to not play the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very hard to the point where finally beating the boss doesn't feel rewarding it feels like i just got outta the dmv",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game gets repetitive really fast. Boss fights are super easy if you know how the game works. The only thing that makes this game challenging at all is that the game doesn't tell you what anything in the game is for or how it works, which is one of the worst ways to increase the difficulty of your games. It's not hard to drive a car, but if you take a car onto the interstate without knowing what any of the controls do, of course you're going to have a hard time. The game uses some familiar mechanics from other games like leveling up to bait you into making the wrong decisions because apparently the people at Fromsoft can do anything but code an actual difficult fight. You get encumbered at half your equip capacity, which the game doesn't tell you. Most games the capacity is the point at which you become encumbered. Once you learn how things work, most of the bosses die in three or four hits and you're pretty much invincible. A one trick pony.\n\nI don't know why I thought this would be different than Elden Ring, which I refunded after about an hour or so of playing. That game relies on input lag to make the fights harder, but still on my first playthrough of Elden Ring and being a complete noob I nearly killed the boss on the horse on my first try fresh out of the gate. At least Dark Souls Remastered has ultrawide support (how does that make sense?) and the controls are responsive and not laggy so it is technically a better game. \n\nI think the only reason people play these games is to see if they can do it. Let me save you the trouble. Yes you can. It will just be monotonous and repetitive whether you steamroll all the fights having figured out the game or you play the same boss over and over trying to defeat it. You can do it, but whether you will want to depends on whether or not you have better games you want to play.\n\nAside from the gameplay, one other thing that stands out as really bad is the grammar of some of the dialog, particularly when they're speaking Early Modern English. They constantly use the third-person singular simple present conjugation of verbs for the second-person. I've seen clips of later Souls games and this hasn't changed. An example:\n\n\"But cometh thee not for the grave of Sir Artorias?\"\n\nwhich should be \"But comest thou not for the grave of Sir Artorias?\"\n\nThe way it is written in the game it's the equivalent of saying \"But it comes to you not...\" as thee is used as an object and not the subject, and cometh is the wrong conjugation. Except for a few verbs, this is pretty much what happens across the board. Strangely enough, in certain places where they do use the second person singular simple present conjugation it is where the imperative should be used which is the same as the bare infinitive. Go figure. Another abomination is:\n\n\"Thou dost cometh.\"\n\nAs in Present-Day English, when using an auxiliary verb with a verb, the auxiliary verb is conjugated as normal and the verb it's modifying is the bare infinitive. You say \"He comes\" or \"He does come\" not \"He does comes.\" And again, as always they're using the wrong conjugation of come so even if you drop the auxiliary verb it's still wrong. And all these examples are from just one of the many dialogues that use this language.\n\nI know this is a strange thing to be critical of, and I know this is a Japanese studio, but maybe don't attempt to use archaic language for the dialogue. If you're not familiar with Early Modern English, you probably won't notice but if you are it's a bit immersion breaking as these characters are clearly not all making a conscious choice to use improper grammar.\n\nAs far as the story, it never made me care about it. The story is as crucial to this game as a story is to a mindless action movie. It's there because it would be pretty stupid not to have it, but it's just an illusion of a story, in the end this is just a series of boss battles. You spend almost all of your time either in a boss battle or trying to get to the next one. I do have to say the opening sequence for this game is 100 times better than the one for Elden Ring. At least this one explains the set up quite a bit more while the Elden Ring one was just a list of character names you're supposed to care about without knowing who the heck they are. This one does list a few names but the list makes sense in its context and isn't a borderline parody like the Elden Ring one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's dated beyond repair. having 2 fights where healing is just not an option is a sign of a bad game, the only reason i would ever tell someone to play this game is so they can say they have beaten it. \r\n\r\nvery few parts of this game ever felt fun and when it did it was often followed by dissapointment. \r\n\r\n(spoilers ahead) \r\n\r\nLets take the last boss as an example, i ran in and right of the bat the fight felt fun. his moveset seemed fun to learn and i was ready for a fun fight right up until i tried to heal, no matter how many different times i tired no matter what attacks or moves i did it after it didnt matter he always got a hit in. \r\n\r\nthat ruined the whole fight, which then made me go for the parry method which felt empty. pluss having to run all the way back every time you die (for any boss) is just a waste of time, its not any harder and adds nothing but a timewaster. 3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this some fucking bullshit im just tryna do some coop but this bitch saved my file on my laptop STOP DOING THAT I NEED THIS SAVE BRU please patch NOW :pray",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TBH, if you thought you liked DS3/elden ring so you'll like this one... Don't count on it. Really a bad game in comparison. Such low quality of life and hostile game design in this one. Controls are more clunky too. Half of my deaths are BS infuriating deaths due to bad game design or lack of polishing and I hate it. In DS3/Elden ring, dying is mostly your fault, not caused by BS half the time. I still enjoy playing a souls game, but oh god it is so bad half of the time. Glad they improved on it in the later released games. Bosses also tend to be super easy on this one, most with easily exploitable weakpoints you find right away... The hardest ones are actually garbage but they cause artificial difficulty by putting you in tight rooms so you can't maneuver. That ain't fun, thats BS again. They do that with thrash mobs too. I hate it. Again, not an amazing game by today's standards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Did you think anything that Elden Ring did was oddly archaic? Did you enjoy janky AI and poor camera angles that made the game feel clunky and frustrating?? Well then this is the game for you!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]IMPORTANT EDIT : I realized that according to several media outlets and official sources, there are security flaws in Dark Souls 1, 2, and 3. And we're not just talking about finding an IP address and be like “Nyeh nyeh nyeh, I know where you live, but since you live 1,000 kilometers away from me, I'm not going to do anything!”\n\nNo. These flaws allow hackers to control your PC remotely and do pretty much whatever they want on your machine. So they can effectively: control your PC remotely, ruin your PC if they want to, install viruses, steal your personal data, hack your browser cookies (Google Chrome, Firefox) including your Google, Steam, and Facebook accounts, your bank accounts, your health insurance accounts, and do I need to go on? \n\nIt's an ABSOLUTE DISGRACE. The creators of this game deserve CRIMINAL penalties, and very severe ones at that, if I may say so. Imagine playing a mediocre game and then someone potentially ruining your life? I know I've been very harsh on this game, and despite everything, I respect those who enjoy this game and the Souls series, but this is no longer just a subjective opinion from someone who doesn't like the game, but your life is literally at stake. Someone with malicious intent could literally steal your identity or empty your bank accounts.\n\nSeriously? There's also the same problem with older Call of Duty games (even WW2, for example), and Activision doesn't give a shit about it and continues to sell their games for $60. Well, it's the same thing here, it's a joke. I bitterly regret installing this crap on my PC. Where is Steam moderation to remove these games permanently until the problem is solved? But no, because there are suckers with white liquid in their mouths, the game is still accessible to everyone. What an outrage. Never install this thing. At worst, play it offline or on a console, but it's an absolute disgrace. ABSOLUTE. So, to conclude, I'll give you the honor of my rating for this game: 0/10. Don't install this piece of crap on your PC.[/b]\n\nA game that has aged very poorly. The controls are unresponsive and extremely slow, the level design is absolutely terrible, and the game is ugly despite being “remastered.” The game is not fun. Don't fall for the reviews that consider it an excellent game; they are blinded by biased nostalgia and their lack of experience with video games at the time they played this game. No one can change my opinion about these Souls games; they are bad and will always remain so. Stop living in a utopia, thinking that this game was incredible for its time. Even when it was released, the game was already outdated and absolutely no fun. Definitely the most overrated game ever. \n\nI advise you to turn to great “Souls-like” games that deserve infinitely more recognition, such as Black Myth Wukong or Lies Of P, which are infinitely better than this game. I'd like to take this opportunity to point out the 60 fps lock, which isn't absolutely horrible because it's still playable and because games weren't previously capable of running at higher refresh rates, especially on consoles or older PCs, but having a 60 fps lock on Elden Ring released in 2022 or even Nightreign released in 2025, is absolutely shameful and demonstrates terrible optimization that is unworthy of what video games can offer today, especially on PC. But I'll go into more detail on this point when I review Elden Ring and I'll probably be very salty about it.\n\nIn short, this game deserve no recognition and would be better off in the void of forgotten games. I regret buying it even on sale.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ts is so ass 😭 made me appreciate ds2 even more because of how much of an improvement it was over this game. The first half of the game is fine i had fun unlocking shortcuts and stuff but the second half was unbearable and this remaster sometimes looks even worse than the og game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is hard and pointless. I don’t understand people who love Souls games—why do you spend all your time memorizing a boss’s movements, dodging them, and killing it? And why do you feel such an incredible sense of satisfaction when you finally do it? Is it because you can’t accomplish anything in real life? Do you get your sense of fulfillment by telling others what you managed to do in this game?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Open Steam Profile\" on sinners will spam-open new tabs in steam overlay and not be stoppable, How do you manage to incorrectly implement that?",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}