{
  "positive": [
    {
      "review": "playing this game is like trying to do backflips underwater without getting water in your nose but the water turns into rats and the rats take you away and encase you in wax.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "If you like vehicle simulation it is a great game, if you are looking for combat you will have to pay extra for a DLC, along with going to space, but if you are here for flying planes building planes and vehicles, this is your game. Although, the crash physics are a little bare bones.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "A friend recommended this to me and I thought I would play it for a couple of hours and be done with it... 78 hours later.\n\nI went in to the deepest rabbit hole with this game it is incredibly detailed which I like hence the 78 hours in the last 2 weeks. Now don't get me wrong the game isn't without it's faults, but that doesn't stop it from being incredibly fun (at least for me). I like building and my favorite block so far is the Microcontroller, it's basically Garry's mod/Wire mod all over again.\n\nLets talk about the faults:\nWhile the career/classic mode may be fun with the right Addons, it is incredibly underdeveloped. In career mode mining serves no purpose because you can get everything from the editor if you have the money\n(At lest from the little time I spent in the career considering I mostly build in custom mode so I don't get killed).\nStill it could be that I am wrong since the time I spent playing and the time I spent building are like the sun and moon (99% Build / 1% Play) witch is not really a bad thing per say... but the reason I build mostly is because I constantly find stud in the career to make countermeasures for and because I was learning how to build. \n\nThe balancing issues and other stuff aside. It is an incredibly detailed and I wouldn't have it any other way.\n\nFinal verdict: 8/10 one of the best experiences that i've had with a game and will continue to have for a long time still.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i have always wanted to play this game when i was younger, now im older with a job and money and cannot be happier, i love life",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "its a bit buggy but still a good game (you need a minimum of 100hours to know all the basics of the game)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h2] I would say it is one of the best sandbox games for now. [/h2]\n\nDespite some rough edges, the breadth of possibilities in this game makes it pretty unique and easily outweighs its downsides. Here you can build almost everything. But the game can't be equally good in all its aspects, right? Regarding vehicles, I can't really recommend trying spacecrafts (and the Space DLC respectively): maybe building and launching them is ok'ish, but everything that relates to orbital mechanics has too many simplifications and its own rules. Not to mention that besides Earth there is only one celestial body — the Moon. If you really want a game similar to KSP, then it's not your pick (pay attention to a project called KSA though). Coming down to planes, helis and other flying vehicles, you need to know that aerodynamics here are pretty simplified too. Take-offs and landings are too short, even the biggest of your planes will most likely have a TWR ≈ 1. In terms of flight model, a game called Flyout, for example, or even SimplePlanes/SimplePlanes 2, does its job better, but it still can be pretty enjoyable in Stormworks. Building land vehicles (cars, trucks (yes, the game gives you a reason to use them. Basically you can try \"ETS 2 gameplay\" at any moment), trains (yes, they are practical too (and cool, I love trains)) is generally good, but sometimes the two biggest islands (one in the Industrial Frontier DLC) that the game provides can feel a bit empty (there are addons from the Steam Workshop that can fix it though).\nThe aspect in which the game is almost perfect is marine vehicles. That's the game's origin, and it works the best from my point of view, plus I can't really name a good alternative sandbox game with the same or better quality in sea or underwater gameplay (maybe From the Depths, but idk, haven't followed this game that much).\nFrom what I wrote, you may guess that the game is a hodgepodge of everything with a kinda meh realization, but it's not true. The building from blocks and small parts plus the fact that you play as a character gives you a lot more immersive feel compared to other games, where you can only play as the \"creation\" itself (I mean by that SimplePlanes 1, KSP, From the Depths etc.), and that's where Stormworks earns its additional points for me personally. However, what really distinguishes it from other games is the so-called \"logic\", thanks to which it's possible to create something truly complex, and that is what gives so much depth to your creations. It can be a little harsh at the beginning, but after all it's maybe the best part of the game.\nThere is a career mode too, which is already good for a sandbox game (two modes actually, with a lack of customisation for me, but the already mentioned addons can fix it), not something extraordinary, but you definitely can spend several dozen hours there.\n\nIn conclusion, I can only say that Stormworks, at least for me personally, deserves the title of one of the best sandbox games :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At this point they should remove the \"...and Rescue\" from the game because it has evolved so far beyond that.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "With 1,000+ Hours logged- I can confirm that this is the perfect game for anyone with a creative mindset like myself. Want to build a simple Car? You Can! Want to build a Boat, Ship, Semi Truck, Train, Plane, Helicopter or Spaceship? You Can! How about a Nuclear Reactor? You Guessed It-You Absolutely Can!! My Favorite part about this game has to be the Microcontrollers, It allows you to learn LOGIC in blueprint form, it takes some time to learn what each LOGIC component does-especially if you know nothing about LOGIC like myself when I first started playing this game-but once you learn the basics its not hard to master, and at that point your Creativity is LIMITLESS. I went from making Basic cars with blocks to- programing engines and gearboxes to- creating fully operation and stable Nuclear Reactors. This game is an 11/10, if you have a creative mindset and what to test your limits or challenge yourself I would highly Recommend Stormworks-100% The Best Purchase I've Made On Steam",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A good game with a very dedicated and a LUA dedicated community",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Multiplayer (without using mods, and even really with using them) can be an absolute laggy mess, i know they've been trying to fix this, and i appreciate that, but some times the lag is so horrendous you're not actually playing with your friend, you are so far behind them you're essentially playing through something that (for the host) happened ages ago... Other than the horrific lag sometimes, the game is pretty fun! Would recommend especially if they keep up the updates, one of these days i may even get the 'Search and destroy' DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably some of the most fun I had building engine configurations and vehicles.\nLots of nuance for how different things effect the performance of any given design.\nIf you're looking for a sandbox to build cool vehicles in with a shocking level of depth, this game has it.\nIf you're looking for something with a decent career mode, this ain't it.\nThe fun is mostly found in building things like actual diesel-electric power systems for trains/boats, gearboxes with finely tuned gear ratios, low level logic controllers for handling everything from engine ignition to clutch control and gearing, and mechanical systems to handle tasks like mining, logistics, oil drilling/processing, and so on. \nThe problems are that multiplayer has desync issues, performance is pretty poor, career mode is a long series of randomly generated quests, bad AI, and an overall lack of depth or direction to career mode.\nLike space engineers if you added daily quests and greatly expanded on the finer details in ship building.\nMakes me wish there were something like it that was a bit more stable, performant, and with a more developed career mode and better enemy AI, I could picture me and a few m8s sinking hours into something like that just running tanker ships around and fighting off the occasional hostile.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Well, Stormworks: Build And Rescue is a very good game. Tons of different workshop items, from cargo ships, to freight trains, there are tons of vehicles to use. Spawning them is hard at first, but it gets easier. The plane are sometimes hard. No rudders, so you have to line them up perfectly and takeoff quickly before they crash. Amazing waves and disasters, too. Although, the damage vehicles make is kinda low.  I want to be able to cause dents and fires and explosions and cracks, but all you get after ramming two huge boats is a couple of tiny scratches, and that's not enough. Please consider raising the amount of damage vehicles make. other than that, it's pretty cool. Probably my 3rd favorite game. Would recommend to somebody who likes vehicles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I booked a first class flight in a plane but the pilot crashed it but we all survived and i later stole his golden toilet i didn’t know people can have golden toilets in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty fun pretty low poly but still fun i watch spycakes play this when i play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "step 1: think of vehicle idea to keep me up.\nstep 2: spend the whole day building said vehicle, instead of socialising and going outside.\noutcome 1 (99% chance): vehicle doesnt work because it feels like it and feels like pissing you off, so you end up just using a workshop vehicle in the end.\noutcome 2 (very rare): vehicle does work, but then you get bored after 5 mins, and then you end up using a workshop vehicle in the end.\n\nuh so its like minecraft for anti-social neurodivergent people. thumbs up 👍🏻",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big game with lots of creative things and functions!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is complex and has a steep learning curve but it is overall great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game takes some getting used to but amazing game overall I recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10 \r\n\r\nThe only issue is the jank, and non uniform building. But its light",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good, but has its issues. Apparently everything runs on Core 0 for physics, so multiplayer and low end systems have lagging issues, but otherwise its great! super fun and and super satisfying making a fully functioning engine!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Acest joc este minunat! Tocmai ce m-am apucat de construit vehicule! Comunitatea este foarte pozitiva si foarte helpfull!\r\n\r\nRecomand celor care vor sa isi exprime creativitatea prin constructii!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game tons of complex game mechanics that give me a headache every time I we ant to debug a problem in my car but it's the kind of complexity that I enjoy and there are a ton of ways to mess the mission you're doing up. Overall is a great game and it's even better with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W sandbox and exploration game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game to sink ships and kill people in ways not even the us army thinked about .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The ratio of war crimes to rescues is something along the lines of 1000:1\r\n\r\nPerfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you have creativity or just want some realism this is the game for you. very fun with freinds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Would be more fun if it was better optimized though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really creative game and i love to download vehicles from the steam workshop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is so very underrated, without even touching vehicle creation you can get 100s of hours just off of the workshop content and the game is so addicting once you start building vehicles yourself! There is a learning curve but it is all worth it and never gets old. I also recommend getting all three DLCs as it allows for so much more fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game gives you almost full control over anything such as \nbuilding a plane and crashing in to two tall buildings\nbuild a sub that implodes at a depth\nbuild a boat that survives big waves \nmake a car to tow your creations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this has been one of my favorite games, building is so fun, and i love the dlc's. i hope a new dlc comes out soon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sailing update is one of the best it added so much but the best is probably sinking ships like it was so hard to simulate sinking but now its easier and the game is just good some controls are hard to understand but there is a chance to get the hang of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is realistic and I like how most things are used with buttons or switches, but the building is a bit hard unless you know what you are doing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really FUN! Lots of stuff to do and stuff to get from workshop. The only thing I don't like is that when you spawn more than like 4 stuff in it lags wayy more than it should.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great \n\nfun to mess around in and to test things out\n\nmissions could be more varied but other than that it's a solid sandbox game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun and has a lot of mods to pick from so i think you should get it (cause i have 60 hours on it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a grate game and i love the engineering knolage I can put into my creations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing sandbox game, def should play it if your into building and engineering",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is epic, but for people who want a specified answer, here you go:\n\nHear ye, hear ye, gather round you soggy lot, for I bring forth a proclamation of such magnificence that even the Queen’s corgi would shed a patriotic tear. Stormworks: Build and Rescue is, without a sliver of exaggeration, the single most splendiferous creation to grace God’s green Earth since the invention of the kettle. Upon launching this divine marvel, I felt my soul ascend straight past the pearly gates and into a heavenly workshop where angels in hi-vis jackets applauded my every button press.\n\nFrom the very first block I placed, I knew I had entered the realm of true British engineering excellence. Brunel himself would rise from the grave, give Stormworks a respectful nod, and promptly uninstall reality for failing to compete. The machinery one can build in this illustrious game is so wonderfully daft and simultaneously genius that it could power the entire United Kingdom on pure national pride alone. Bridges? Barges? Helicopters? Mate, you could probably build a flying pub if you fancied it.\n\nAnd the storms. By the blessed biscuit tin of Saint George, the storms are British beyond measure. The skies darken faster than a Northerner’s mood on a Monday morning. The ocean rages with such ferocious enthusiasm you’d think the North Sea itself had been personally offended. Waves slap your vessels harder than your nan slaps the back of your head when you swear at the dinner table. Every rescue mission feels like braving a Boxing Day sale in London: chaotic, dangerous, yet undeniably glorious.\n\nSaving lives in Stormworks fills the heart with such noble energy that I half expected King Arthur to rise from the lake and knight me on the spot. Every time I plucked a poor soul from disaster, I could practically hear a choir singing Rule Britannia in the distance. By the time I completed my tenth rescue, I had convinced myself I deserved my own statue somewhere near Buckingham Palace.\n\nSo let it be known across all lands and all Steam libraries: Stormworks is a masterwork of such unholy brilliance that not playing it should be classified as high treason. This game is a national treasure, a digital crown jewel, a glorious spectacle of British engineering chaos wrapped in rain, saltwater, and pure heroism. God save the King, God save the tea, and above all, God absolutely save Stormworks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too broke to afford the dlcs but i gotta apretiate the people who made me buy this game and this game being apart of my childhood. \r\n(spycakes and his friends)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun. You get to construct your own vehicles, or download vehicles from others via steam workshop. You get to control the weather, time, wind, natural disasters, megalodons, and krakens. I recommend this to anyone looking for a dynamic ship simulation game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love how the devs continue to update and respond. Will forever be the best creativity game on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Steady flow of updates/support. Best building/career sandbox on Steam IMO. DLC is worth it. A true \"play what & how you want\" game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is such a great game and with workshop it's even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, either with friends or alone, you could literally fly a super detailed plane in this game, thanks to the awesome Workshop support. Also there's always new updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is perfect for testing your logic and engineering capablities",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stormworks: Build and Rescue is a creative and detailed sandbox game where you design your own vehicles and use them in rescue missions. You can build boats, helicopters, planes, and many other machines, which makes the game feel very open and flexible.\r\n\r\nThe missions can be challenging, especially in bad weather or at night, but they are also rewarding. The physics system is impressive, and seeing your own creation work (or explode) is always fun. The game also supports multiplayer, which makes building and rescuing with friends even better.\r\n\r\nStormworks is still being updated, but it already offers a huge amount of content and freedom.\r\n\r\nIf you enjoy engineering, problem-solving, and creative gameplay, Stormworks is a great game to dive into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Possibly my favorite game I've bought on Steam. Great community, and wonderful Devs support. Would highly recommend it to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a good game with cool physics for stuff like sinking and realistic buoyancy but a tutorial for building vehicles would be nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The building in this game is amazing the level detail you can go to is awesome I’ve spent all my time just building random things then testing tweaking them, I will eventually get to doing the missions but so far I’m happy building and testing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my friend forced me to get this game because they had 7000 hours on it, it is actually  a good game  but i certainly need to  play more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good other than beamng drive with dosent have multiplayer so very very good i would recomend geting either search and destory or industrail frontier for starting it two best things to have",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Honestly, one of the best ship building games ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game. lots of creativity involved and fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stormworks is a great game it doesnt need outstanding graphics or physics as you can whatever you want without spending 30mins doing a checklist to take of but you can and thats what i like about stormworks a veichle could just have 1 button to turn on the engine or you could have to turn on magnetos and fuel pumps you can pick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is really hard at the beginning, but I remember playing it for 24 hours in the first 2 days when I bought it. If you are interested in the game then you should buy it, it is better than how it looks in the videos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend this game as I have over 800 hours on record of playing this game. It is a fun game if you like building and exploring. The DLCs have been known to lag but I have never experienced this, and recently they did work to optimize it to make it run smoother.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game, well deserving of the labor of love steam awards is an excellent combination of physics, puzzle, building and exploration. It allows players to experience a career in which you help others to gain money which in turn allows you to afford more building materials. This is a truly sensational game which I recommend to anyone who likes building and exploring. Best with friends!!! ♥️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good interesting game that really challenges you in creative way.Very versatile as you could make virtually anything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved playing this game with my friend we had a amazing time although he spawned a whirlpool once and we drowned to death but it was funny 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may not be the best out there, but if you mess around with friends, you'll have fun no matter what you do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the jewels in my collection! As you may see, I like engineering sandboxes, but this one something special. Yes the envoirnment in this game are really simple, very low poly, as well as characters, but thes simulation of ocean, and air - is something amazing. The building capabilities as another rare thing. I know very few games, where you can built normal ships (not space) with sych details, while even hull shape has an effect on the ship control and swim dynamics. As about trains and helicopters, i can't even say, becuse not tried them yet, but I thik, there will be same intresting feeling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game if u understand it, i almost never get bored of it tho i dont have many hours compared to others but i think with all the dlc you can do practicly anything here, my fav game i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "can be laggy as hell for certain devices, but if you've got a good pc it can be pretty fun, not worth the pricetag though id say take a couple bucks off it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game.\none of the best water physics that I've ever seen. Boats are fun\nCreating things takes a bit of time and know how and could use some deal of simplifying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun i guess, you spend about half of your playtime learning how to make anything but once that clicks it gets pretty fun. some performance issues and could use a better career mode but other than that 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game you can do so much stuff like build and use other builds and it even gives you starter builds!!!\nI recommend trying the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game its like minecraft and garrys mod mixed together in some weird way. Verry good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Games extremely addictive and fun in general, i can play for hours without getting bored.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really like this game because you can download things you want and use them and i really like to roleplay and drive planes and ships.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the best, if you love boat get this game like plane get this game like saving people GET THIS GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really fun game and it can show a lot of creative builds in the work shop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m gonna be honest, I haven’t slept in 3 days and this game has claimed responsibility",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best addictive building game that is actually decently realistic and has a huge variety of parts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game, only downside in my opinion is the space DLC, its just not fully there in my opinion, but otherwise it's a fantastic game with such a great community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is perfect. Lots of vehicles, map is gigantic, sounds and musics are great. Good job!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing for anyone who wants to learn about engineering and things like that. It is great for learning how to build great boats and planes and just creativitiy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game in not for the faint of heart, or small of mind, or short of patience but if you REALLY like building boats this game might be right for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its not bad. There are alot of bugs but it is still a good game. Good to play with friends and alot of good mods. The search and destroy DLC is good to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely fun to play, coming from Trailmakers this was a huge upgrade and I couldn't recommend it more, just be prepared for a relatively steep learning curve is all I can say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game with awesome fandom and building mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if your planning on playing this, please remember to use tutorials as this game is very complex with building, and plus theres always the workshop too, and another thing, you can edit workshop stuff for rescues and such (which is what i've done) so yeah.\r\ndeccent game, but requires a BEEFY computer for large builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The bugs can really ruin the experience temporarily, but eventually you learn to work around them and that just makes it feel even more like you are beginning to master the game and is very rewarding. There is no game quite like this one and I will likely always come back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really fun, the controls are hard to learn at first, but its certainly worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game but you need to download boats off steam workshop first or you are stuck with a small boat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really liked how easy it is to replay and it kept bringing me back. Although its hard to learn, its still a really fun game top play, especially with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's something so relaxing about steering a boat then a kraken, megalodon, tsunami, tornado, and whirlpool all hitting your boat at once. very calming experience and good community builds 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☐ Good\r\n☑ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☑ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☑ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As you can see, many hours of my life have been positioned in front of my computer enjoying this game. I began playing this game years ago with my friends, and those times are among the greatest memories I have. This game gave me the medium in which to express my creativity, and encourage my friends to do the same. Is the game itself perfect? No, in fact it has a lot to improve upon, with it's bulky physics engine being a notable example. Do the developers at time feel disconnected from the needs of the player-base? Yeah, but honestly, which game doesn't at times? When I think back, I don't deliberate on the negatives, I rejoice in the positive. I would recommend this game time and time again to those seeking a game to dedicate time with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun little snadbox, graphics need to be fixed because as of right now when your get in man do you chug if you don't set them correctly lol, but a fun little game to mess around nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stormworks is the BEST game by the fact that driving or flying is emersive makes it fun. but if you try to build things its REALLY COMPLICATED. well i hope you buy and enjoy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly its really good. They are still updating every month, the vehicle editor is good, and it has a workshop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a pretty good game specially the vehicles, the boats and aircraft are also amazing \r\nits good with friends i have not tried single player yet but id think its pretty good as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "550 hours later and i still have no idea how to build anything in this game or what micro controllers do, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Short review: Very good game — pick it up on sale or have a friend to play with.\n\nLong review: It’s a great game. It’s like Garry’s Mod for boats, cars, trains, and planes (even though GMod has those too). Geometa has a great game on their hands.\n\nThe only two issues I’ve faced are lag when playing with a friend — even with good internet, so it’s likely the game’s fault — and frame drops when loading big ships, though that might be because I’m playing on a friend-hosted server.\n\nOther than that, anyone interested should definitely try it. It has a Minecraft-like style: if you can think of it, you can probably build it (just don’t expect to be building houses). The three DLCs are also great, but I recommend playing with a friend — it’s a lot more fun that way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like to get Attack helicopter and rescue people with a great malicious intent also a lot of cool vehicles to explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend newer players take builds off the workshop and tinker with them, add their own systems, etc etc. Helps you learn the basics of the game as its very trial and error. Just make sure if you're posting said item to the workshop, you credit whomever you got the hull, microcontrollers, or items from. Also YouTube tutorials are a godsend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has had so many updates and there are so many builds to download. and if your into really complicated mechanics this is the game that you should get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. and belive that more players, could increse the budget even higher, and get some really cool things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS THE BEST GAME KNOW TO MAN\ntbh its really fun and with 1000's of vehicles it will last you a while",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a great game, but the Devs are horrible, and the multiplayer is almost entirely broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "HUGE learning curve, cant even build a ship without watching ATLEAST 30 hours of tutorials etc, I only suggest you play if you have a idea with engineering or straight up just trying to understand game logic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only because the multiplayer is basically unplayable. other than that great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game sadly I then got the DLCs now Physics Fps drop to almost 0 after playing 30 min this made it unplayable and they had enough time to fix these issues. Pc checks out fine too for the requirements so don't buy it waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its very buggy game, also it has many issues such as the fact when you download boats, etc off steam workshop it does not work half the time. and spawning in huge ships the game cannot handle it at all btw running 7 7800x3d,32 gigs of ddr5 ram, and an RTX5070 ti. so its not my pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game runs on lit potato servers so get the beefiest pc but for low end pcs just dont get it     (pls note i made this while mad at the game but for all the game is its not bad i just miss when the game was bigger)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "On paper this should be an amazing game with great physics simulation. Unfortunately I cannot play it because I am thrown into the game where I follow a little short tutorial and am abandoned to my own means. I can't figure out keybinds for my life and I have no idea where to go or how to survive. Money goes down but I don't know if that's important. I'm supposed to rescue people at sea but I don't even know where I am. Seriously? No satnav? Ok but then give me the ability to chart my position on the map so I can remember where I am and at least try to aim to be somewhere else. Building vehicles seems fun but at the start of the game I have no source of income other than looting the local hospital and that doesn't get me much so I have no clue where to go from here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks. you cannot even build an engine without rage quitting. no normal english speaking tutorials and half of audience are russian militarists",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "персонаж идет со скоростью ползания а бежит со скоростью медленной ходьбы, гравитация в прыжке почти отсутствует поэтому можно легко перелететь или недолететь прыжок (в комбинации с скоростью улитки) игра сама по себе норм но физика ходьбы и прыжка делает игру пыткой",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible-tried playing on steam deck none of the controls worked and most keybinds didn't show so i couldn't even spawn anything. DO NOT PLAY IT SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't see waypoints in career mode so i spent 6 hours trying to make a boat that works in classic mode to no avail",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a buggy mess for me. screen tear problems, 30 minute load times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its really hard to build in but im sure some could get the hang of it but its not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got banned from the discord for reporting someone with a far right hate flag as their profile pic, user was also bragging about being a Nazi.\n\nMods got mad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No tutorials for building whatsoever\nGo tell your mama to watch them on youtube",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "unplayable after 30 mins due to poor coded physics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Currently do not recommend, game is way too buggy in my opinion (where career becomes almost unplayable)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "weapons requires DLC and the dlc is not that cheap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very bad, don't buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4 hours into building a boat the games crash and delated all my saves",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games great unless you try to build anything",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "very poorly optimized",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my camera keeps drifting up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my boat sank what the fuck man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really is one of a kind when it comes to sandbox vehicle building games. Really thought this game would be my first 1k+ hour game, but it fell short really fast as the developers focused on adding features rather than fixing the major issues plaguing the game. On top of lack of fixes and excessive feature updates, the developers constantly share photos of player creations that could never be built naturally in the game without modifying the game files, which is essentially false advertisement.\n\nThis game suffers major performance issues, poorly designed physics (they released an update that makes it so you configure the physics because they couldn't be bothered with finding a solution to the complaints) and dlcs that have nothing to do with the title of the game (\"build and RESCUE\").",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "I feel like any fun I have with this game is always in spite of the game itself.\n\nThere is no tutorial for anything outside of a 4 year old YouTube playlist that only goes over basic engines and logic, there is no documentation of what worldgen variables do outside of vague descriptions, career mode quests constantly break to the point that to have a cohesive experience with it you basically need to play in the creative mode with all the cheats turned off so that you can debug the game in real time. I submitted a bug report over a month ago, uploaded my save and everything. It has received no response. At time of writing there are 429 open tickets on the issue tracker with the oldest ones being over 4 years old. I can appreciate that the dev team is still active so long after 1.0 but it is baffling how much they focus on adding new content over making any of the content they already have function properly, documentation of game features, basic QoL, or even just a complete tutorial.\n\nI can only recommend this game if you want a vehicle sandbox where you spawn in and mess around with stuff off the workshop, or if you have a huge amount of tenacity and drive to curate your own experience and set your own goals with the fragments of a functional game that are present. This is factorio without any tutorial, no item encyclopedia, three arbitrarily distinct gamemodes in place of being able to select specific difficulty settings at world-gen (a research tree and the ability to fast travel are mutually exclusive unless you want to play creative or edit xml files), massively increased jank and lack of QoL (for example wheels cannot have their input directions changed, this means if you assemble wheels in the formation commonly found on something called a car, the wheels on each side will turn (yaw) in opposite directions because you flipped one side. If you mirror that side's wheels they will now spin (pitch) backwards. The only way to fix this is to add a logic element that changes the input sent to the wheels on one side from positive to negative. Instead of just being able to change which way a wheel spins or turns when powered.), and of course just as many bugs. You can still get to space, and you might even find it kind of rewarding in the end, but it's still going to suck for 95% of the time. Not the \"I'm being challenged\" kind of suck, but the \"I have been trawling through two year old reddit posts to figure out how this game feature is supposed to work\" kind of suck.\n\nI cannot see the vast majority of people who get this game for anything other than a workshop vehicle sandbox enjoying it, so I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Too much going on... complete ballache and the controls are just painful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trying to play the game but it's literally annoying me how disgusting the editor controls are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game, but the Devs are horrible, and the multiplayer is almost entirely broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It used to be great and had a really fun concept, but the devs have completely broken it. Instead of fixing the issues, they just keep releasing pointless DLCs that make things worse.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve, cant even build a ship without watching ATLEAST 30 hours of tutorials etc, I only suggest you play if you have a idea with engineering or straight up just trying to understand game logic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only because the multiplayer is basically unplayable. other than that great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game sadly I then got the DLCs now Physics Fps drop to almost 0 after playing 30 min this made it unplayable and they had enough time to fix these issues. Pc checks out fine too for the requirements so don't buy it waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its very buggy game, also it has many issues such as the fact when you download boats, etc off steam workshop it does not work half the time. and spawning in huge ships the game cannot handle it at all btw running 7 7800x3d,32 gigs of ddr5 ram, and an RTX5070 ti. so its not my pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game runs on lit potato servers so get the beefiest pc but for low end pcs just dont get it     (pls note i made this while mad at the game but for all the game is its not bad i just miss when the game was bigger)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "On paper this should be an amazing game with great physics simulation. Unfortunately I cannot play it because I am thrown into the game where I follow a little short tutorial and am abandoned to my own means. I can't figure out keybinds for my life and I have no idea where to go or how to survive. Money goes down but I don't know if that's important. I'm supposed to rescue people at sea but I don't even know where I am. Seriously? No satnav? Ok but then give me the ability to chart my position on the map so I can remember where I am and at least try to aim to be somewhere else. Building vehicles seems fun but at the start of the game I have no source of income other than looting the local hospital and that doesn't get me much so I have no clue where to go from here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks. you cannot even build an engine without rage quitting. no normal english speaking tutorials and half of audience are russian militarists",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "персонаж идет со скоростью ползания а бежит со скоростью медленной ходьбы, гравитация в прыжке почти отсутствует поэтому можно легко перелететь или недолететь прыжок (в комбинации с скоростью улитки) игра сама по себе норм но физика ходьбы и прыжка делает игру пыткой",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible-tried playing on steam deck none of the controls worked and most keybinds didn't show so i couldn't even spawn anything. DO NOT PLAY IT SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't see waypoints in career mode so i spent 6 hours trying to make a boat that works in classic mode to no avail",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a buggy mess for me. screen tear problems, 30 minute load times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its really hard to build in but im sure some could get the hang of it but its not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got banned from the discord for reporting someone with a far right hate flag as their profile pic, user was also bragging about being a Nazi.\n\nMods got mad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No tutorials for building whatsoever\nGo tell your mama to watch them on youtube",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "unplayable after 30 mins due to poor coded physics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Currently do not recommend, game is way too buggy in my opinion (where career becomes almost unplayable)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "weapons requires DLC and the dlc is not that cheap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very bad, don't buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4 hours into building a boat the games crash and delated all my saves",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games great unless you try to build anything",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "very poorly optimized",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my camera keeps drifting up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my boat sank what the fuck man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really is one of a kind when it comes to sandbox vehicle building games. Really thought this game would be my first 1k+ hour game, but it fell short really fast as the developers focused on adding features rather than fixing the major issues plaguing the game. On top of lack of fixes and excessive feature updates, the developers constantly share photos of player creations that could never be built naturally in the game without modifying the game files, which is essentially false advertisement.\n\nThis game suffers major performance issues, poorly designed physics (they released an update that makes it so you configure the physics because they couldn't be bothered with finding a solution to the complaints) and dlcs that have nothing to do with the title of the game (\"build and RESCUE\").",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "I feel like any fun I have with this game is always in spite of the game itself.\n\nThere is no tutorial for anything outside of a 4 year old YouTube playlist that only goes over basic engines and logic, there is no documentation of what worldgen variables do outside of vague descriptions, career mode quests constantly break to the point that to have a cohesive experience with it you basically need to play in the creative mode with all the cheats turned off so that you can debug the game in real time. I submitted a bug report over a month ago, uploaded my save and everything. It has received no response. At time of writing there are 429 open tickets on the issue tracker with the oldest ones being over 4 years old. I can appreciate that the dev team is still active so long after 1.0 but it is baffling how much they focus on adding new content over making any of the content they already have function properly, documentation of game features, basic QoL, or even just a complete tutorial.\n\nI can only recommend this game if you want a vehicle sandbox where you spawn in and mess around with stuff off the workshop, or if you have a huge amount of tenacity and drive to curate your own experience and set your own goals with the fragments of a functional game that are present. This is factorio without any tutorial, no item encyclopedia, three arbitrarily distinct gamemodes in place of being able to select specific difficulty settings at world-gen (a research tree and the ability to fast travel are mutually exclusive unless you want to play creative or edit xml files), massively increased jank and lack of QoL (for example wheels cannot have their input directions changed, this means if you assemble wheels in the formation commonly found on something called a car, the wheels on each side will turn (yaw) in opposite directions because you flipped one side. If you mirror that side's wheels they will now spin (pitch) backwards. The only way to fix this is to add a logic element that changes the input sent to the wheels on one side from positive to negative. Instead of just being able to change which way a wheel spins or turns when powered.), and of course just as many bugs. You can still get to space, and you might even find it kind of rewarding in the end, but it's still going to suck for 95% of the time. Not the \"I'm being challenged\" kind of suck, but the \"I have been trawling through two year old reddit posts to figure out how this game feature is supposed to work\" kind of suck.\n\nI cannot see the vast majority of people who get this game for anything other than a workshop vehicle sandbox enjoying it, so I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Too much going on... complete ballache and the controls are just painful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trying to play the game but it's literally annoying me how disgusting the editor controls are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game, but the Devs are horrible, and the multiplayer is almost entirely broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It used to be great and had a really fun concept, but the devs have completely broken it. Instead of fixing the issues, they just keep releasing pointless DLCs that make things worse.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve, cant even build a ship without watching ATLEAST 30 hours of tutorials etc, I only suggest you play if you have a idea with engineering or straight up just trying to understand game logic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only because the multiplayer is basically unplayable. other than that great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game sadly I then got the DLCs now Physics Fps drop to almost 0 after playing 30 min this made it unplayable and they had enough time to fix these issues. Pc checks out fine too for the requirements so don't buy it waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its very buggy game, also it has many issues such as the fact when you download boats, etc off steam workshop it does not work half the time. and spawning in huge ships the game cannot handle it at all btw running 7 7800x3d,32 gigs of ddr5 ram, and an RTX5070 ti. so its not my pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game runs on lit potato servers so get the beefiest pc but for low end pcs just dont get it     (pls note i made this while mad at the game but for all the game is its not bad i just miss when the game was bigger)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "On paper this should be an amazing game with great physics simulation. Unfortunately I cannot play it because I am thrown into the game where I follow a little short tutorial and am abandoned to my own means. I can't figure out keybinds for my life and I have no idea where to go or how to survive. Money goes down but I don't know if that's important. I'm supposed to rescue people at sea but I don't even know where I am. Seriously? No satnav? Ok but then give me the ability to chart my position on the map so I can remember where I am and at least try to aim to be somewhere else. Building vehicles seems fun but at the start of the game I have no source of income other than looting the local hospital and that doesn't get me much so I have no clue where to go from here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks. you cannot even build an engine without rage quitting. no normal english speaking tutorials and half of audience are russian militarists",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "персонаж идет со скоростью ползания а бежит со скоростью медленной ходьбы, гравитация в прыжке почти отсутствует поэтому можно легко перелететь или недолететь прыжок (в комбинации с скоростью улитки) игра сама по себе норм но физика ходьбы и прыжка делает игру пыткой",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "terrible-tried playing on steam deck none of the controls worked and most keybinds didn't show so i couldn't even spawn anything. DO NOT PLAY IT SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't see waypoints in career mode so i spent 6 hours trying to make a boat that works in classic mode to no avail",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "a buggy mess for me. screen tear problems, 30 minute load times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its really hard to build in but im sure some could get the hang of it but its not for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got banned from the discord for reporting someone with a far right hate flag as their profile pic, user was also bragging about being a Nazi.\n\nMods got mad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No tutorials for building whatsoever\nGo tell your mama to watch them on youtube",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "unplayable after 30 mins due to poor coded physics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Currently do not recommend, game is way too buggy in my opinion (where career becomes almost unplayable)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "weapons requires DLC and the dlc is not that cheap",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very bad, don't buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "4 hours into building a boat the games crash and delated all my saves",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games great unless you try to build anything",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "very poorly optimized",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my camera keeps drifting up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my boat sank what the fuck man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game really is one of a kind when it comes to sandbox vehicle building games. Really thought this game would be my first 1k+ hour game, but it fell short really fast as the developers focused on adding features rather than fixing the major issues plaguing the game. On top of lack of fixes and excessive feature updates, the developers constantly share photos of player creations that could never be built naturally in the game without modifying the game files, which is essentially false advertisement.\n\nThis game suffers major performance issues, poorly designed physics (they released an update that makes it so you configure the physics because they couldn't be bothered with finding a solution to the complaints) and dlcs that have nothing to do with the title of the game (\"build and RESCUE\").",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "I feel like any fun I have with this game is always in spite of the game itself.\n\nThere is no tutorial for anything outside of a 4 year old YouTube playlist that only goes over basic engines and logic, there is no documentation of what worldgen variables do outside of vague descriptions, career mode quests constantly break to the point that to have a cohesive experience with it you basically need to play in the creative mode with all the cheats turned off so that you can debug the game in real time. I submitted a bug report over a month ago, uploaded my save and everything. It has received no response. At time of writing there are 429 open tickets on the issue tracker with the oldest ones being over 4 years old. I can appreciate that the dev team is still active so long after 1.0 but it is baffling how much they focus on adding new content over making any of the content they already have function properly, documentation of game features, basic QoL, or even just a complete tutorial.\n\nI can only recommend this game if you want a vehicle sandbox where you spawn in and mess around with stuff off the workshop, or if you have a huge amount of tenacity and drive to curate your own experience and set your own goals with the fragments of a functional game that are present. This is factorio without any tutorial, no item encyclopedia, three arbitrarily distinct gamemodes in place of being able to select specific difficulty settings at world-gen (a research tree and the ability to fast travel are mutually exclusive unless you want to play creative or edit xml files), massively increased jank and lack of QoL (for example wheels cannot have their input directions changed, this means if you assemble wheels in the formation commonly found on something called a car, the wheels on each side will turn (yaw) in opposite directions because you flipped one side. If you mirror that side's wheels they will now spin (pitch) backwards. The only way to fix this is to add a logic element that changes the input sent to the wheels on one side from positive to negative. Instead of just being able to change which way a wheel spins or turns when powered.), and of course just as many bugs. You can still get to space, and you might even find it kind of rewarding in the end, but it's still going to suck for 95% of the time. Not the \"I'm being challenged\" kind of suck, but the \"I have been trawling through two year old reddit posts to figure out how this game feature is supposed to work\" kind of suck.\n\nI cannot see the vast majority of people who get this game for anything other than a workshop vehicle sandbox enjoying it, so I do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Too much going on... complete ballache and the controls are just painful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trying to play the game but it's literally annoying me how disgusting the editor controls are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game, but the Devs are horrible, and the multiplayer is almost entirely broken.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It used to be great and had a really fun concept, but the devs have completely broken it. Instead of fixing the issues, they just keep releasing pointless DLCs that make things worse.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "HUGE learning curve, cant even build a ship without watching ATLEAST 30 hours of tutorials etc, I only suggest you play if you have a idea with engineering or straight up just trying to understand game logic",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "only because the multiplayer is basically unplayable. other than that great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game sadly I then got the DLCs now Physics Fps drop to almost 0 after playing 30 min this made it unplayable and they had enough time to fix these issues. Pc checks out fine too for the requirements so don't buy it waste of money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its very buggy game, also it has many issues such as the fact when you download boats, etc off steam workshop it does not work half the time. and spawning in huge ships the game cannot handle it at all btw running 7 7800x3d,32 gigs of ddr5 ram, and an RTX5070 ti. so its not my pc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game runs on lit potato servers so get the beefiest pc but for low end pcs just dont get it     (pls note i made this while mad at the game but for all the game is its not bad i just miss when the game was bigger)",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "On paper this should be an amazing game with great physics simulation. Unfortunately I cannot play it because I am thrown into the game where I follow a little short tutorial and am abandoned to my own means. I can't figure out keybinds for my life and I have no idea where to go or how to survive. Money goes down but I don't know if that's important. I'm supposed to rescue people at sea but I don't even know where I am. Seriously? No satnav? Ok but then give me the ability to chart my position on the map so I can remember where I am and at least try to aim to be somewhere else. Building vehicles seems fun but at the start of the game I have no source of income other than looting the local hospital and that doesn't get me much so I have no clue where to go from here.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}