{
  "positive": [
    {
      "review": "the game is dead now :( not dead dead but dead expect to not be able to play almost all mode but for 3-4 and expect long Q,s for games when the servers that are active are full. this review if for the base game not the commuinty servers",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Great game, developers are activly updating it, runs on modern iGPUs\r\nI wish for better support on linux thou",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "if you want a team based game this is not the game for you but if you wanna be a hero and have 7 other players saying good job when you get 106 kills then this is the game for you",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game is the perfect balance of arcade-realism. If you liked older COD titles such as MW2 (the original from 2009) this is a brilliant game to try when on sale. Movement is slow but smooth and balanced as people that try and drop shot or bunny hop will get a huge delay before firing or aiming. Weapon handling feels very smooth and the TTK is quick, no player is a bullet sponge. Some people may find this frustrating by being sniped by someone hiding with an AR on semi-auto or someone shredding you up close almost instantly. You want to play this game by flanking and getting the first shot on as most AR's are 2 shot kill (to the chest and above, 1 shot headshot, shooting limbs also may take an extra bullet)\n\nMost of the maps are a very nice size and well designed. Some maps are poor but no game has a perfect map selection. Insurgency SS is not a walking simulator (unlike squad). The proximity chat is also hilarious at times but some people do LARP. The enemy can also hear you in proxy chat. Graphically the game is also stunning and you do not need a NASA PC as it runs very well. 90% of the cosmetics are very cool and realistic for both factions. \n\nConsole cross-play has been added now too which is nice and hopefully keeps the game alive until their next project. If you're a Battlefield player who plays Rush/ Breakthrough you will enjoy a game-mode called \"Push\" which is similar in extending the map when an objective is captured.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I love this game. The fact that you can wipe the whole enemy team with a single mag is awesome. Say yes to fast dynamic shooters with low ttk.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Perfect for people that want the Cod experience but realistic. Insurgency Sandstorm is a mix of COD for the action you get in a short amount of time and Arma or squad for the realism and that's why I love this game so much. And for the VR gamers out here there's also UEVR support for this game which also works great.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best immersive tactical military experience. Its an absolute blast to play from the CQB simulator gameplay to the bass sounds of the snipers. The diehard community of this game is awesome, players actually use mics and communicate. This game is like hardcorde COD without the infinite running and gunning gameplay. You actually must use cover and teamwork to complete the objective. PLEASE BUY THIS GAME there are still matches with players even tho the player count is low.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It’s one of the best military shooters for people who have jobs, families, and a life outside the PC.\r\nThe well-designed gameplay system lets you log into a server within seconds, and matches rarely last more than 20 minutes.\r\n\r\nEven though the game isn’t fully focused on 100% realism, it’s mostly played by older players (20+), often including actual soldiers.\r\n\r\nThat brings a lot of advantages, since young kids tend to ruin milsim games.\r\n\r\nIn many ways, it’s a prettier, better, and more varied version of America’s Army: Proving Grounds.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The only FPS game I play. Everything else in the FPS genre has become fecal in nature",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the usual fps where your teammates are all literal potatoes while you go up against fucking seal team delta force 69 every fucking game. you know its bad when im level 24, and im higher on the scoreboard then level 300+ every game",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "fun, simple, brutal. You can play coop and still be challenged or play PVP and it's like old school red orchestra.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its great when you aren't playing with a bunch of babbling baboons who have the ear range of a newborn vat cyst baby and cant use their eyes to notice the flashing icon symbol that's jangling it's keys right in front of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A gritty, atmospheric, and immersive tactical shooter for players who value realism and depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Superb weapon mechanics, immersive audio, tense PvP encounters, and infinite PvE replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite how long this game has been out I still come back to it to this day and was surprised that this game still gets updated quite a bit. One of the best realistic fps shooters I played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, sniper revolver only mode is heat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best Military shooters on the market, some of the best gunplay and most intense gunfights you can ever experience in a game. The developers constantly add new maps and guns completely free to the community. Despite it going on 7 years, there isn't another game that compares.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great bullet realism and deaths. Very fun to go offline and kill ai in the co-op, and get killed by suicide bombers. Ringtone will give you PTSD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but it seems like it has some issues running occasionally. While playing I've encountered a fair few moments where the game would lag out really bad, along with a static-like sound in my headphones. Also, upon selecting the button to quit the game to go back to my desktop, the game froze and I had to manually restart the system to close the game.\n\nOther than these problems, the game itself is good, I hung out with some cool players in a PVE lobby, the gun play is good and very detailed, along with being ultra realistic. The guns themselves by the way, those sound VERY meaty, very loud and aggressive, just how guns in this style of game should sound. I especially like the AKM shot sounds. All and all, very good game, just a somewhat rough experience that I'm sure might be a bit of a rarity, especially seeing as they only happened once so far. (The bugs mentioned earlier.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is like Squad just in a smaller scale! even after 7 years the graphics and immersion are still awesome, gunplay is very good, good player base and most importantly - combat gives you PTSD and its great :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, 100/10.\nHopefully there will be a game just like this but with more immersive effects and stuff to do except shoot and destroy caches. \nBut i love the game. Don't really care about the bugs and stuff, bc is there or has there ever been a game so polished?\nNo, i have not see a game that has 0 bugs.\nThanks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes you have to magdump into a random body laying around because you dont know if hes dead or just laying there.\r\nvery good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im mostly a pve player so I will speak from that perspective: Its a pretty fun tac shooter, its not a super tactical \"running for 90 minutes to die in 4 seconds\" game, so you're still engaged while having that more \"realistic\" feel \r\n\r\nFor linux players: It works fine if you have proton on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great community met a lot of cool people along almost 600 hours in the game. Learning curve is very steep but definetly worth it. Would reccomend o7",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guns feel amazing! Very fun. Definitely what I was looking for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You join the game and you get tossed across the entire map by a Talib with a Dragunov.\nYou get in a car — an RPG flies straight into you.\nYou start camping — a grenade lands on your head.\nI rate it 10 TALIBS OUT OF 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the challenge and uniqueness of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super good game but only the recoil is a bit too much for the mgs mostly the m249",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun, decently-paced, arcade-style shooter mostly grounded in reality with a not too steep learning curve. I've had a blast in this game, mostly the co-op mode, and would recommend it to anyone who likes an FPS they can sit back and get into relatively quick. The community isn't super toxic, the developers are active with free title updates and open forums, and the gunplay is decent enough for me to rank it up there with the likes of Battlefield 4 (minus the bullet drop) and MW3.\r\n\r\nOverall, I give Sandstorm a solid 8/10 - I kinda miss the intensity from the first Insurgency's atmosphere. Only real downside is the inconsistent AI behaviour in co-op. Sometimes they're dumb as doornails and other times they will fly into the room like John Wick on crack. Makes it unpredictable, I guess, but it's rarely fun to be 360'd from outside a closed door...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "probably one of the best milsim games ive played. it can get laggy at times and i dont know the state of the pvp mode, but its a really great game. Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please give back the VIP mode on both online and local play with friends. It really makes the game more better and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IMO this is among the most fun and immersive middle-shelf FPS games on the market, with a devout playerbase even in 2025. The game is super easy to learn and the moment-to-moment action is ADDICTIVE. ALSO lots of customization. I haven't played Insurgency but I love this game. \r\n PLAY INSURGENCY SANDSTORM PLAY INSURGENCY SANDSTORM PLAY INSURGENCY SANDSTORM ! ! ! !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gunplay, sound effects, visual effects, realism, fragility of life, gore, etc, all of this makes me feel that the game is close to what real CQB looks like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I reached around lvl 830 on xbox and then 200 on steam between 2020 - 2024. No other shooter quite scratched this itch. No other lobbies reached the same volume or energy. If it ain't broke don't fix it and there are so few games that have approached multi player from that mindset. PiP voice, Friendly-fire, open match making, tight, high skill cieling movement. This game has everything but the vehicle warfare I love (a la Battlefield). Happily surprised how consistent the updates have been for this game given it's player count. Excited to see what happens next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a very phenomenal game, it has a lot of realism to it and a LOT of guns. If you are a person that likes Call of Duty and games with guns, realistic explosions and war simulation then this is the game for you. It has all of that, it has several gamemodes, guns, customizability, cosmetics and levels. It is worth the grind and really fun. There is also a voice chat in game that allows you to interact with people in the game. I would recommend you to get this game, don't let the 30$ fool you into not getting this game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried it and its alright. Maybe if I could have gotten my friend into it I would have had more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played the first one for 70hrs, this one is even more fleshed out and with better graphics, noice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is worse than that time I was part of the US invasion to Iraq.\r\n\r\n*Family guy cutaway of me lighting up a room of towlheads in Baghdad 2003*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It may be less polished, but this game still clears Battlefield 6 on the grounds that you can access all of the equipment options right off the bat, without needing to grind for hundreds of hours to unlock them. Plus this game has PVE integrated into its game modes, so the experience is a lot less stressful for someone like me who struggles to regulate their emotions in PVP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have many hours of this game on my Xbox. Although the weapon choices for rifleman vs advisor role and some cosmetics (such as the spirit halloween ass skull mask) can be questionable, the game is still one of my all time favorites. It strikes a flawless balance between immersive realism and casual playability. I have almost exclusively played COOP, but multiplayer isn't bad when I've played. The setting, although intentionally vague, is also very interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! I love the PTSD that flairs up when i'm in public and hear a phone ring loudly. Nothing says combat game like seeing my best friend's arms get thrown out of a window by a camping \"Sewerside\" Bomber or watching my entire team get wiped out by a guy in flip-flops and an RPG. 100/10 recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome but dead. On every match you're just going to have a 5 v 5, no matter if it's US or EU server.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game, but for me there’s only one big problem that has nothing to do with the game or the developers themselves, but with the gameplay: for those of us in South America… the servers.\n\nUsually the ping exceeds 180, which makes it unplayable, and if you move the servers to Brazil, Chile, or Argentina, it’s the same because those only benefit them, not everyone else.\n\nincreíble juego, pero para mí solo hay un gran problema que no tiene nada que ver con el juego o los desarroladores en si pero si con la jugabilidad y es que para quieens eestamos en sudamerica...los servidores \n\nusualmente el ping supera los 180 lo que hace que sea injugable y si ubican los servidores para brazil, chile or argentina es lo mismo por que esos solo les sirven a ellos mismos no a los demas en el resto de centro y sur america",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never have I had a game give me such an adrenaline rush while also making me dread ever being enlisted.\r\n\r\nEven if the devs make some questionable decisions, Insurgency Sandstorm's core gameplay loop combined with fantastic gunplay, sound design, and surprisingly good voice acting keeps bringing me back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the way that Insurgency Sandstorm feels to play, you can make a setup for whatever conditions are set before you enter any match you play, adjust it as needed, and every match I've played really plays out to me more like a slow paced & tactical version of hardcore and ranked Search & Destroy on Call Of Duty. Everybody can be brought down with a single shot from virtually any weapon, and classes have the ability to bring their technical specialties to the forefront of the game but only if players use them together and have good synergy, this game is a good addition to a tactical shooter library.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its an awesome realistic cqb simulator, but it needs some things to get improved imo.\npoint shooting grip zooms the weapon too much while aiming down (on ~half of weapons), and i wish AI's were better, it feels like they are too dumb while playing CO-OP. also noticed a bug when optics dont zoom image while using picture-in-picture zoom mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game cant stop playing it. but its missing crucial updates to keep it in today's standards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven’t heard more despicable, dastardly and revolting slurs in a game lobby since MW2.\n\nGreat game 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has amazing bones, but that's about it. \n\nThe devs have seemingly given up on trying to make this game refreshing. Rarely if ever do new updates come along and even more rare is it that they come with new guns. \n\nThe community is very mixed, but more often than not if feels like a 2011 CoD lobby.\n\nThe learning curve can be difficult, especially when you don't know the maps and boundaries. But after a few hundred hours, this game has become my favorite semi-arcadey mil-sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. I love how realistic and slow-pace it is. The only thing I'd recommend is to enhance the UI, and class selection is a mess. I have to manually configure classes for each mode separately, it would be nice if we can have the option to change one class of one mode, and all modes would have the same class, or something similar. And the other thing, add more voice lines to the characters, first time me playing it I was amazed by how realistic they are and terrified a bit. So it would be nice to see more slurs, especially the Arabic ones, and add more reactions, makes the game fresh. Overall, 9/10 Experience, really worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great FPS game, thanks to the weapon mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game all around , for sure needs some touch ups here and there but overall game-play is there, the sound design is top notch and gun play is extremely smooth. o very much recommend this for military buffs that want lots of CQB combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a cross between a mil-sim and a little arcade like game. Fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am an old, lazy FPS guy. No longer keen to keep up with the youts, hackers or hyper competitives, I almost exclusively get my FPS fix in co-op in this game, and it's great. \r\n\r\nGraphics? Great. Love 'em. Particular the sub-minimum hud. No extra crap to distract or twiddle my neurons. Just the game, objective, horror.\r\nMaps? Pretty decent, look great, work great, lots of variety.\r\nGuns? There's lots, and trying different load outs is fun.\r\nProgression? There is none, just a meaningless number. IDC.\r\nMods? Custom servers can be a great change of pace, if you're ok with your load outs bugging out when you go between custom and vanilla.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of those great games you can casually jump in and out of - Plus they're always adding updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and realistic gunplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helicopters scary. Jihadists scary. Dead game, but still ok to buy if there's discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Insanely addictive game. Never get bored. Title music is the best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, funny people, but weird that you can use snipers on tiny maps, especially bolt actions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i got 700hrs on console, but i love this game so much i wish it was a milsim ngl would be peak with the play style in my opinion, constant CQB constant explosions and constant phone rings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Insurgency: Sandstorm remains one of the most well-made and realistic tactical shooters on the market. Its core gameplay is incredibly satisfying and immersive. However, it feels held back by two significant issues.\r\n\r\nFirstly, the lack of substantial content updates in recent years has left the community wanting more from its potential. Secondly, and more critically, the death cam mechanic that reveals your position upon being killed severely undermines the Sniper and Machine Gunner roles. This feature punishes strategic positioning and long-range play, making these classes disproportionately reliant on team coordination to be effective.\r\n\r\nUltimately, Sandstorm is a fantastic game that seems to have been underappreciated, even by its own developers. It's a title with immense potential that deserves more attention and thoughtful design adjustments.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "OH MY. \n\n\nLet me just say as a horror nerd who does NOT like fps games that much this game has somehow HOOKED ME. That alone is proof enough of how good it is. \n\n\nLet’s just get this out of the way. Bo7,bo6, and (even tho bf6 is by no means a bad game) do not compare in anyway to this game. \n\nI’m so tired of health bars, revives, freebies and sweats. this is a MILITARY COMBAT GAME. Get the AAA SLOP OUT. And this game did military combat PERFECTLY. \n1 OH MY GOD IS THE GUN SYSTEM AMAZING!\nIn most fps games, you have a health bar, or a vest. And you can be revived even in some. But not this game no. BULLET HURT. Pistols can be just as deadly as smgs or rifles. It only takes 1-3 bullets to put someone out PERMANENTLY. And I LOVE IT! Kills feel so rewarding! \n2 pve or pvp both modes are amazing! Especially if someone is running at you with a grenade. Top notch. \n3 lack of restriction. While there is gun skins unlike cod games you get everything off the bat. No pay to win items or overpowered gun builds locked behind a pay wall. Any gun you want. For free. \n\nOne of my favorite military shooters \n8.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "born too late to die in the middle east. born too early to die in the middle east. born just in time to die in the middle east",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Play with Modded Servers Verses Bots, the best way, the only way. \r\n\r\nGreat till you get one tapped.\r\n\r\n6/10. Slap Me Harder Daddy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game and want to like it despite it's best efforts.\n\nThis game has 2 problems aside from being owned by new world interactive.\n1st is the spawn problems like\nWhy is the game spawning a squad of enemies on objective A after we just took it and are moving to B so i get shot in the back while trying to be a machine gunner and change the spawns to the current objective and near the next one (like if we try and take b it spawns them from C's direction too) like a cognitive capable human instead of at the already taken objective because i get it it's insurgents in a game called insurgency it's in the name but dumb AF spawns are still dumb AF or at least put them in places where you literally can't just watch them spawn in plain sight from the contested objective, and the once in a week i spawn in a group of enemy bots is also fun\n2 is the explosions and bullets\nDying because a artillery or mortar strike hits the roof of a 2 story building seems realistic unless you don't have actual building destruction then it just makes hiding behind cover kinda ridiculous if it stills counts as a hit. Being sniped from 40+ft away through a tree and a wall by a bot that i can't even see becuase i'm prone behind the wall but magically can aim at me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game especially when\npaired with beer and footjob",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2026 is in 1 month, and nobody has made a better FPS yet… The netcode, hitbox and everything FPS-related is great.\n\nMaps are great, with no jumping around and multiple ways to play. You can take it slow or run to surprise (either way, you will get your limbs blown off by nades or a shotgun or a free head-delete by an anti-materiel sniper rifle that will make you jump). \n\nIt is one of the few FPS games that still gives me adrenaline moments.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most amazing tactical shooter I played, definitely 2nd favorite tactical shooter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From how much I've played, this is a pretty good game. It is one of my top tier realistic shooter games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont forget that no one carries a flip phone anymore. if you hear one, make a quick prayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very realistic, goated game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Intensive infantry close quarters battles with different co-op and multiplayer modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If team play is your priority, look elsewhere. But if you’re a lone wolf and never rely on anybody, congratulations  you’re in the right place.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Hearing brazilian funk blasting through a veteran soldier's vocal cords as he runs around the map to then suddenly go silent after gunshots is pure gold. (He came back running 3 minutes later and died again)\n\nRPK GO BRRRRRRRRR!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "> whole team is on the point\n> everything is going fine\n> masked man dressed in black sneaks past the defenses\n> cellphone ringing and arabic war cries echo throughout the house \n> everyone starts panicking over voice chat\n> explosion \n> character starts panicking\n> checks leaderboard\n> i’m the last one alive\n> insurgent runs in and absolutely domes me\n> “ROUND 3 DEFEAT!”\n\nlove it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good bridge between casual shooters and milsim. Definitely leans more casual, but not a bad time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So good to unwind on PVP and hear the insanity of other people talking.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "shoot the bad guys, shoot the good guys wait who are the good guys again doesnt matter you were born to kill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trailers are trash. Bots arent headshotting you as soon as they see you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, realistic mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to play with friends. plenty of game modes,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i am terrible at this game and the fact i still hv more than 300 hours at it speaks for itself 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spawned, shot a car with rocket, got shot by 5 Enemies, died. \r\n271/10  needs more bullets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast decisions. Quick reflexes. Dire consequences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Although it would be nice to have some local (SA) servers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best arcade mil sims just buy it\n\nallah lak bar",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game, guns and boom.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Modern Miltary Shooters that tend to lean more to realism then total arcade then this is for you. I suggest you try it for more then 10 hours to really learn the basics and depth that this game has to offer!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has some of the best sound design of a fps game since BF1.\n\nI love coming back periodically for quality fun, the slow but consistent updates are great to see.\n\nI hope that one day we get a sequel that brings in some more players as it is a great franchise.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "es all i ever wanted when i was but a wee lad its beautiful could be more beautoful but am grateful",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I bought this game on sale after every source told me it was still active with players but i'm not sure if I was doing something wrong because I could not find an online game once.\n\nBesides that I mainly just played offline with bots which was still very fun because of how realistic the game is in terms of war like conditions, explosions everywhere bodies flying and instantaneous death via bullet mailed to the brain await. However the win conditions in the offline modes were very odd as capturing objectives gave you more lives to keep advancing but dying once and respawning was an immediate loss because of how far away you were most times but still fun overall.\n\n5.8/10 This is a strange one since i'm just rating the offline mode, but it's still very fun. I'd say this a ON SALE ONLY game, not at all worth $30 today due to it being seemingly dead, still it's an okay game to pick up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A really fun game with a small learning curve to get used to, The game can feel clunky at times with small fps drops causing stuttering due to network issues but overall a really enjoyable game that pulls you in and is very immersive and challenging. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Of all of the modern miltary shooters I think this one comes out on top.  It's visceral, brutal and epic every run through.  I love the Push mode.  Best shooter FPS on the market no competition.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game even though i have some performance issue with this game. Dev always brings update to this game so it does not get boring. 👍🏿👍🏿👍🏿👍🏿👍🏿",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great tactical CQB style shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pure hardcore!!! gutty and horrific at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good for relaxing and meditation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game, Great Modding option",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy the challenge of aiming without a projected crosshair",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "As a long-term ambush player it is very disheartening to hear dev team removing Ambush out of rotation without any explanation. I know the Ambush community always had core players that have played and returned to insurgency sandstorm for over 5 years I've played as this game had one of the best VIP-extraction when played with well seasoned players doing interesting strategic plays since the competitive mode was removed in earlier life of sandstorm. \n\nI am sure some of devs have seen many of our names through game plays and reports, and hope they would be open to reverse this decision and bring ambush back again.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Game used to be really fun. I took a break from it for over a year and come back to find a buggy mess with lobbies full of sweats who can't even accept a joke before just spewing slurs in VC. I miss the days when the whole lobby would have fun, making monkey noises and shoot the shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's hard to play the game when the frames stutter all the time, and it happen very often. There's a chance that when you get this game, the same thing will happen to you. For the past three days, when I try to open this game, the framerate stutters every few seconds for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Ambush, the only mode that separated this game from every other shooter, just got removed because loyalty and passion don't show up in player count metrics.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played this game for years and use to tell people all the time to try it. I would tell them it's a straight forward PVP FPS with somewhat realistic dps and time to kill. In general I would say if you want a good challenge and a way to improve on your aim, game sense, and communication play this game. I can no longer and will no longer say that to people. The developers prioritize what any company would \"money\". But its not a devs job to worry about money. It's about how to keep a game interesting. And to do that you need people. One of your most dedicated communities has been tossed to the side like a piece of garbage. And told to play whenever someone feels like throwing the game mode in. The devs don't care to mention it's their own fault that the mode never had more then a few servers. When the ambush game mode was removed the majority of long term players have moved on. The other game modes offer no challenge or intrigue. I wish the game the best but without ambush you've lost the only real thing that makes the game unique.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game used to be a lot of fun. But now quite literally every single match online is just full of douche bag cheaters. Literally almost every match. I do not even understand why people cheat online. How is it fun? Keep the cheating offline where it is fun to screw around. You low life vaginas are ruining online games. If you are a online PvP cheater then I hate you, everyone hates you, and your parents are embarrassed beyond belief and had wished they went through with the abortion. Cheater = Puss infected ass mold covered smothered in underwear gravy mixed with dog shit. Go F*ck a dead horse you rotten piles of dog sh*t. I seriously hope you all get a** cancer in your vaginas and die miserable unforgiving deaths alone in a pile of your own making. F*ck you! F*ckin goat f*ckers!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only US servers are available, playing on 200 ping is not nice.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Sadly, but Sandstorm is the only shooter that was able to hook me lately. \"Why sadly?\" you may ask. So, I'll try to explain. \nUnfortunately, this game is abandoned by its developers. I don't know what they did with their engine, but it runs worse than ever. Lags, bugs, freezes will be your constant companions. Netcode is sh.t as f.ck. In fact, you'll see a title screen more often than the game itself. \nNevertheless, I love this project. It has managed to grope this tiny balance between arcade shooters like BF or CoD and something more simulative like Arma and Squad. I know, I know. If I want to play with military equipment, I should play BF or Squad. But seriously? Only pathetic tachankas for the both sides? That's ridiculous. Espicially when you use it for Security side. Why can't you add... Hmm... Let me think... at least Hummer for example? Or maybe something just more relatable to NATO military cars? What are they doing instead of that? Right! Let's release some more useless DLCs with trashy cosmetics and nothing else. Pure genius! No fixes, no significant changes, no improvments, no progress in development. Ok, they`ve added two or three new maps, but most of the players tend to ban or skip them, as they`re poorly balanced and optimized. Honestly, I don't want to observe the strengths of this game in detail. Indeed, there are lots of them like impeccable sound design, brutal atmosphere of battlefield, shooting mechanics, detailed weapons simulation and etc. But it makes no sense. Sandstorm is technically dead both literally and figuratively and daily online peak barely hitting 1k players is the best proof of my takes. \nI dare say that Incurgency SS had all of the opportunities to stand in the line with the most popular shooters of our days and carve a niche of arcade tactical shooters, but NWI just f.cked up. \nWelp, \"keep it up\" fellas! \nThanks for your attention! I`m done...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is a real cop out an sell out. THis game is not even the same as NWI. Garbage updates every time and is hella buggy, this game wont survive",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love this game but there is not a single asia server so I have to play with at least 200 ping every match",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dont buy this piece of trash everyone playing rn either has 2k plus hours and sits in corners or they just bought it. Hope it dies",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has the sweatiest loading screen tips, things like \"eat pretzels instead of chips while playing because they're less greasy\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't really wanna say I don't recommend it, but the servers are painfully slow and It's hard to enjoy the game when all you do is lag all the time. It's a good game and I have more fun playing offline than online because i rarely get good Ping.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. Ambush game mode removed.\n2. Hard to find 14v14 match even when crossplay is disabled.\n3. Game is still a stutter fest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They forced this game to have parity with PS4 and Xbox One (2013 game consoles from 12 years ago btw) so we lost 14v14 PC lobbies and have to play the same big maps with 10v10 instead. Unless you wanna disable crossplay and sit in infinite queues to nowhere. Barely any voice chat now as a result, the real game as we knew it is lost to time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely loved this game but now i cant leave spawn with out people being there to shoot you or throw a grenade at your feet. i am constantly seeing people in areas that should be restricted to them. If that wasnt bad enough i am constantly getting hit with friendly fire while standing still. Im talking stabbing and shooting me in a panic. I am pissed off about this shit and it isnt going to change.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was not aware of the past this game had, they fucked over the original dev. \nhttps://www.youtube.com/watch?v=B-qW-rXWTMw\n\nif I was aware I wouldn't have bought the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Guns are cool coop is fine mostly but all and all meh not that worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lazy Devs! Buggy Mess! Netcode Sucks! Low effort updates!\n\nNo wonder its dead...\n\nSad to see because I loved the first one and this one showed a lot of promise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this shit is unplayable every server is chinese so expect a 200ms plus ping, my god this game used to be good i played alot but this is fucking heartbreaking",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has horrible issues now that it used to not have. Most notably, regardless of OS or drivers, on my systems it now causes hard lockups forcing me to reboot after needing to do a force reset. This is unacceptable and used to not be the case.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this fucking shit laggs and runs like shit on my amazing computer like come on man i just wanna play it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not Recommended\r\nWhile Insurgency: Sandstorm has solid core gameplay, its technical performance is unacceptable. The game suffers from poor optimization, frequent bugs, and inconsistent frame rates. Despite extensive troubleshooting, it never runs smoothly. Unfortunately, it appears the title has been largely neglected, reflecting a broader trend of developers abandoning their IPs rather than refining them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only people left playing this game are 30+ year olds. Most of them spend their time in game figuring out what their keybinds do and sitting in corners about 30 miles from any objective. Call of Duty left them behind, battlefield is too fast paced, and they found a perfect little nook to let their gaming passion die out in a 3rd rate shooter.\n\nRemember, these are the mentally deficient fools actually purchasing skins in this game. You simply can't fix the perfect consumer cattle that is a depressed failed man.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1. Nobody playes objective\n2. Nobody uses smokes\n3. Half the team cannot aim\n4. CQB grenades do not exist\n5. If you play objective, you get trolled for low KD despite high point count\n6. EVERYONE is either with a scope 2 objectives behind, or dead\n\nBots on local play behave better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game sucks. I do not know why it is called tactical or realistic, it is not even close. I gave it multiple attempts, I tried to like this game. A real FPS game should have you wish to preserve your life and not throw yourself into unecessary danger, which this game does, it gives you quick respawns and is too fast for anything useful for real life scenarios. Sure, some people could enjoy this, but I cannot. \n\nI also dislike that I need to reach a certain level to be able to use a sniper rifle and other weapons.\n\nThe only FPS I can enjoy for realism is Ready or Not, and that's as realistic as it can get for a videogame anyway, real cops have played it and found it useful for real life practice. Chris the cop and SixtyAteWhiskey come to mind.\n\nAn unrealistic shooter painting itself as realistic, it is not fun.\n\nAnother bad point is the outdated graphics, physics and mechanics. It is worse than Battlefield 4 in my view.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first one was better, this is a \"call of duty empowered arab special forces woman\"-type game. They tried to be too much like call of duty. cancer, game's capped on 10 vs 10 most of the time. Insurgency 1 was way more intense. this is slop and feels like roblox with shaders.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game became unoptimized, I came back to it after ~2 years, used to run on medium now can't run without lowest settings and ~70% resolution",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Completely unstable. Game crashes non stop. I love this game but this update is terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gotta be the most toxic playerbase in recent years. shit is modern day mw2 when you dont revive them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doesn't even come close to holding a candle to its predecessor. it's beyond hollow. i wish i hadn't lost so many hours on trying to find enjoyment in something so dull",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Paid for the deluxe bundle when it was on sale. Had a lot of DLC/Extra content with it. Downloaded it, got nothing.\n\nRe-downloaded it still nothing. Waited hours in main menu hoping it would load in nothing. I checked my Steam and Steam says I OWN those DLC's. Contact them via their website, no help whatsoever. Useless.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought it a while ago, just recently downloaded and played it for the very time. I've never seen any gameplay or heard anything about it, but it kept popping up on the store page, so I thought it must be popular enough. I was wrong\r\n\r\nI played against bots for a while, just to get a feel for it. then when I decided it was time to play on a server, I waited, and waited, then waited some more. after 15 minutes, I gave up on trying to connect\r\n\r\nearlier today, I watched a video on the tube about the game's history and development, and it's no wonder I couldn't get on a server. the ai can be a bit buggy (which is almost expected with games these days), the player leveling implementation is dumb, and the micro transactions is beyond disgusting\r\n\r\nis it fun? absolutely! it's like no other \"shoot em up\" game I've ever played\r\nis it worth it? absolutely not!\r\n\r\nI really wish someone buys the rights to this, hopefully the original creator, and makes it what it was supposed to be; good\r\n\r\n3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Güzel ama eskidi, veteranlar içinizden geçer yeni alacaklara önermem",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3,5/10\r\n\r\nShi feels like a mobile game comparing to the another game.\r\nits not it no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They removed ambush, the best gamemode they have. Oh wait, had.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i dont want to learn to write an entire server config file just to play with friends",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be good before the sweats arrived.\n\nIt's gonna be a NO from me, dog...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've put 1200 hours into the game. Many of the games best players kept Ambush alive for years because it was the only challenging part of the game. For the approximate same 200 players world wide that kept Ambush alive, I'll miss our 5 years of friendships and conversations. A few hundred THOUSAND hours logged for Ambush by the same regulars- Gone for good- so am I. \n\nIt was fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason I have continued to play this game over other shooter games for the past 3 years is the co-op Frenzy game mode and the Ambush Verses game mode. \r\n\r\nFrenzy is the one of the best unique co-op game mode I have play and is a good type of different mixed into the normal checkpoint format.\r\n\r\nAmbush was by far the most fun game mode in the game and insurgency did it better than any other game I have played. The ability for dead players being able to communicate with the living allowed players to play an overwatch and coordination role. The game mode wasn't a traditional shooter game mode it was a RTS merged with a shooter game. \r\n\r\nAmbush has been eliminated from the game and there is nothing uniquely special about insurgency compared to other games now on the market. If you are looking for a PvP/PvE game this is not the best option. I suggest battlefield 6 instead. If you are looking for a good co-op game to play with friends insurgency is still a good game to get.\r\n\r\nBring back Ambush, and or add a game mode to verses that rotates the community servers most popular game mode.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really good in gunplay, the guns are all pretty fun and realistic, and have very fun and cool details (ie. shooting the 50. too much gives you tinnitus) and there are plenty of fun modes and theres always new gamemodes in rotation. The customization of guns is also really nice with lots of options and customizability and the points system also keeps things balanced. The class system also gives new levels of teamwork between players needing to rely on each other to beat enemies, and balanced as it limits the number of people who can play each class. The best thing is probably no shitty or predatory monetization, you buy the game and theres no microtransactions, all dlc's are purely cosmetic. \n\nThe main thing that would turn away new players, and me sometimes is the crappy community, especially the higher level players, a lot of whom are sweats and very obnoxious and condescending towards newer players, their just overall very toxic. Even minor mistakes like hurting them once will have them full on killing you and yelling at you in voicechat. Most of them fail at proper teamworking and just yell in vc most of the time. Disable vc or just play the PvE gamemodes is probably what I recommend. \n\nthe community and playerbase is also pretty small, but I've never had issues with queuing into a lobby within a minute. The PvE alone makes the game pretty worth it.\n\nalso, my message to the devs would to please add a balancing system on both teams, it kinda sucks when its 10 level ten to hundred bronzes vs 10 level 800 to 4000 silvers and diamonds\n\nall in all, I would only recommend buying the game when its on sale for like 10$ or something, but its pretty decent, ruined by the toxic players, solid 6.5/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just can't vibe with this game for some reason. The reload mechanic is cool, but everything else is simply not as fun as the previous game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the best modern shooters ruined by pure incompetence",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "21st October - 1.19 update is released. Good update but a few issues to be fixed still. I purchase the Year 4 DLC for support, nice to see that we're still getting free updates.\n\n17th November - hotfix for 1.19 update and Ambush is removed?? It was supposed to be a permanent mode and now they've turned it into a limited time mode. \nOf course it's past the 14 days since I've purchased the DLC and the mode I want to play can no longer be played unless it's voted in for the monthly limited time mode or through community servers at our own expense.\n\nNot sure why the devs have made this decision, along with their refusal to add a server browser so we can start our own lobbies with the game mode we want to play. Really disappointed in the decisions made, I've spent over $50 on DLCs supporting the game, I guess that's all wasted now then.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Wasn't the most fun I've had in a game but worth a try.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead and Abandoned, also no competetive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They removed the only gamemode worth playing.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Doesn't hit like the real Insurgency 2 (The OG stand alone game)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Removing Ambush is like removing S&D from COD. What the **** and why.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ambush mode. Rest in peace, p00p and p!ss",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "trash community as per usual",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is dead . F this game tbh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "very fair game: my team: max 500lvl | enemy team: max 5000lvl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They removed ambush and skirmish. Like why else play?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "trash compared to the original",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dead game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the old one was better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "We want ambush back.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring: if you get killed you have to wait like 5 min to get respawned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit dead as hell",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ambush my balls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks. garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "говно",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just no",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "love this game with a passion i really do but im tired of the lack of support and consistent buggy messes",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "How do you solve a content drought problem that stemmed from catering to competitive play, then transitioning towards console inclusion, then treating it like a live service game amidst the single update once per year that comes with a singular new gun per team, and maybe a new map?\n\nCosmetic MTX supplementing that singular yearly update.\nCosmetics, cosmetics, cosmetics.\nSure, they might be cheap (they used to cost more iirc), but they release so much more superficial paid content than actual game content at this rate. Btw, the total cost for all cosmetics on Steam at the time of writing this is around $200 CDN. Too much? Don't worry, they gradually release \"(X) Editions\" every year that have all the cosmetics of the previous years and nothing else.\n\nOh, and pepper in a couple 3x XP weekends for a completely meaningless level system that has absolutely zero progression past lv. 20 (when you unlock the Commander role). And also make some innovative(?) gamemodes limited time for no real reason other than an attempt at FOMO, I guess.\n\nSome of the best assets and audiowork in the FPS genre (to the point where people port the assets and audio to many other games), and a really, really strong start that swiftly lost any and all momentum. Only a couple thousand die-hard fans still play it (peak being 3.9k over the last year, but averages around 2.0k~), and they're spread across each mode. It's sad, really, because this used to be a comfort game for me, and then they just gave up completely.",
      "voted_up": false,
      "votes_helpful": 84
    },
    {
      "review": "As a long-term ambush player it is very disheartening to hear dev team removing Ambush out of rotation without any explanation. I know the Ambush community always had core players that have played and returned to insurgency sandstorm for over 5 years I've played as this game had one of the best VIP-extraction when played with well seasoned players doing interesting strategic plays since the competitive mode was removed in earlier life of sandstorm. \n\nI am sure some of devs have seen many of our names through game plays and reports, and hope they would be open to reverse this decision and bring ambush back again.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The game was very gud, very many, with the PREVIOUS DEVS... the new devs deal mainly with cosmetics and mods which you often cannot apply on your bot or weapons, cuz the game does not function as it should anymore... therefore you are wasting money. Also, there are enemy bots sending headshot with 360° turn, which is (I believe) a common skill of every veteran 🙏\nThe servers are barely stable. so yes, I would recomend the game only bcs of nostalgy and it still has the previous features, but unfortunately, I see how its worth is slowly decreasing thanks to the new devs and their ignorance.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "Its a nice game and all, but developers just quit having regular updates and the anti cheat is a joke.\n\nI usually play with friends and there are these two cheaters/exploiters in my region (EU),\nand the are never banned. \n\nNO MATTER WHAT!\n\nThese speak Russian/Ukrainian and the harass others when confronted and never stop creating multiple accounts to do their thing. \n\nIts a shame because the player count is low and i know the players that i play with, by name. \n\nIn my opinion, this kind of behaviour makes the game unplayable.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game used to be really fun. I took a break from it for over a year and come back to find a buggy mess with lobbies full of sweats who can't even accept a joke before just spewing slurs in VC. I miss the days when the whole lobby would have fun, making monkey noises and shoot the shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Yet another example of a money grab by a dev company. This game could've been great as it mixes realism (like squad or arma) with more arcade type shoots. But they dropped the ball hard. The little to no new content, the gameplay and bots are super buggy, and they've completely given up on the game. This is what I hate about games nowadays, there's no passion in it. All the company's want is to squeeze the most profit out of a game then leave it to die when the cash flow slows. Shame on you, you're what's wrong with the gaming industry today.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really tried enjoying this game but I can't...\n\nIt nails being a first person tactical shooter but oh my God...the common tactic of everyone in this game is long-term camping. Seriously, everyone just picks a spot to sit in and that's how they are for the rest of the game. And since this game is realistic, they can just 1 tap you if you dare try doing something slightly aggressive like going to actually TAKE the objective instead of camping in the same spot. This game is basically if hide-and-seek made a shooter game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's hard to play the game when the frames stutter all the time, and it happen very often. There's a chance that when you get this game, the same thing will happen to you. For the past three days, when I try to open this game, the framerate stutters every few seconds for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Ambush, the only mode that separated this game from every other shooter, just got removed because loyalty and passion don't show up in player count metrics.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unfortunately, the current developers of this game are money hungry swine, hell-bent on breaking the game and SQUEEZING every ounce of profit they can out of it. They've added in new cosmetics which as of the date of this review, have broken ALL of my outfits which I have spent countless HOURS customising, with no fix even after reaching out to support. EVEN WORSE, is that the cause of this seems to be that I \"don't own the dlc\" i legitimately own and have paid for. do NOT support this game in it's current state. The gameplay is buggier than ever (ai spawning directly in front of you, hud markers and ui disappearing, constant and perpetual cosmetic bugs) and has been going on a steady decline since these new incompetent, money hungry, pathetic new developers took over. What a great game this used to be, slowly melted into dirt. Just play the original Insurgency at this point.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I've played this game for years and use to tell people all the time to try it. I would tell them it's a straight forward PVP FPS with somewhat realistic dps and time to kill. In general I would say if you want a good challenge and a way to improve on your aim, game sense, and communication play this game. I can no longer and will no longer say that to people. The developers prioritize what any company would \"money\". But its not a devs job to worry about money. It's about how to keep a game interesting. And to do that you need people. One of your most dedicated communities has been tossed to the side like a piece of garbage. And told to play whenever someone feels like throwing the game mode in. The devs don't care to mention it's their own fault that the mode never had more then a few servers. When the ambush game mode was removed the majority of long term players have moved on. The other game modes offer no challenge or intrigue. I wish the game the best but without ambush you've lost the only real thing that makes the game unique.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unfortunately, I cannot recommend this game. Its predecessor was unique, balanced and had a great community, whether you played on coop or pvp. I met a lot of good buddies during the good old days of the OG Insurgency. \n\nSandstorm feels like a magnet for people who should be in a psychiatric ward. I mean, I have mental illnesses, but man, the community here beats my anger management problems. You guys need to seek help, for real. \n\nThe game is not noob friendly and chad players can’t wait to insult everyone at their first mistake. Not even CS is this toxic lol \n\nI mean, I can understand 12-year-old kids whose brain isn’t developed yet: they’re annoying like mosquitoes in your ears when you’re trying to sleep, but they’re just screaming little sh1ets. \n\nGrown-up adults who flame in multiplayer? Alright, you are coward enough to be an ar5ehole in a VIDEOGAME. I take that, you are frustrated for a bad day or a bad period. Seek help. Take meds. M4sturbate or stick a fork up your ar5e but don’t play games which are, indeed, games made to unwind after a long day. \n\nStay away from this game and do yourself a favor. There are many other hardcore shooter games with super good communities out there. Don’t waste your money here.\n\nOh yeah two other things: MICROTRANSACTIONS. \nAnd sometimes you literally spawn directly in front of enemy fire.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I love the fucking game but it's in a really rough state. I don't know if it's worth the money anymore, the devs just keep adding two guns and a couple of cosmetics per update and that's it, while the game is dying and full of bugs. I really hope it gets better, but it doesn't seem like it will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is clunky at best, I figured after RussianBadger's video on the game that there would be a significant change to the game since the last time I played it years ago but it still feels like a game that belongs on a console from 2005. I can appreciate how realistic it is dying to one or two bullets but when every map is a jumbled mess there's about a million different pixel sized places you can be shot from at any given point in time, not to mention how useless the kill cam is in this game, no sort of indication other than a general direction of where you were shot from that shows 2/3rds of the map. The only way to really enjoy this game is to load up a lobby of people you know, otherwise you will be thrown into a losing game with 0 respawn waves left and held hostage until you lose, then about 80% of the way through the rest of the match you will be auto-assigned to the losing team since they will all leave before the game is over.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No European servers. Skins are resetting every time i start the game, it happens that paid skins are locked and you cannot use them for extend amount of time.\nThey made this Insurgency to lost the soul of the first part, and that was what Insurgency should be.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game has been out for years, yet the character preset saving bug still exists. Every time I save, the new preset overwrites the old one, and when I restart the game, my preset is randomized. This is a basic feature that the developers have ignored despite complaints from the community for a long time. Extremely disappointed and frustrated – feels like the players are abandoned. 1 star for this negligence.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "They keep on pushing garbage cosmetic DLC's while having a system where your preset outfits keeps on resetting to random outfits every time you launch the game the last few years.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game is fairly boring and very repetetive.\nThe game engine and/or its servers seem to have lots of problems in PVP especially regarding synchronization, i.e. even if you have better ping and shoot first, you often get killed by guys lagging around corners and similar stuff. \n\nAdditionally the community of this game sux major a$$. Intentional team killings, kill stealing & provoked team killing by running in front of your line of fire are the norm in PVE. \nOne of the reasons for this is likely the bad integration of cross play.\nFurthermore NPC spawns and paths on PVE are predictable which lead to spawn killing against NPCs which makes PVE modes very boring very fast.\n\nAnd do not get me started on the way to expensive microtransactions for ugly skins and fantastical military gear straight from a sh!tty marvel movie.\n\ntl;dr\nIf the game is on sale for 10 bucks you may get it, since its fun for like 10-15 hours or so but after that you should delete it again. Don't bother giving it second chances.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is my favorite game but purely for the wartime game play. There are many issues and bugs from not getting rewards when leveling up to skin and cosmetics not applying or saving properly. They just throw 3x XP at you on some weekends and hope you don't continually notice the many issues that have been here for years. With that said, the devs will likely not up keep this game so I don't recommend someone paying for it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game 100% for multiplayer pvp. Theres like 1 server for pvp and everyone else is playing COOP so this game is useless to me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I bought deluxe edition and only 1 dlc is available. Also there's Infinite connection to new world services, this problem is occured literally months ago and still haven't fixed. \n\nWhy selling the game if you can't even fix something that crucial",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When it runs, it is okay, fun BUT:\nI never played a game this buggy, cancel buttons don´t work, 3x booting up to get into the main screen. custimnizations reset.\nNames of teammmates often not shown or coloured - so you shoot - oops - that was a teammate - then you don´t shoot, oops, that was an enemy - death.\nTeammates constantly shooting at you or throw grenades at you. enemies shooting at the back of teammate - nothing,  I aim 0.3 ms turn and insta dead - teammate lives. \nI would ask a refund if I could.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Servers are empty, match making is broken. Gameplay is very OK. If you have insurgency then just keep playing that",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Alright, so... what the f*ck happened, a few years back everything was fine (I only play PvE) but right now, some bots can snipe you with a 9mm through a concrete barrier some 200 meters away, respawn points are sometimes the same with bots (so good luck with staying alive with a boltaction against some 15 hc bots) and my cosmetics constantly reset, which I could live with until today when I start up the game, notice that the presets are randomized again... and oh whats this? about 2000cr of cosmetics locked again without refunding the credits? What are you... EA?!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game used to be a lot of fun. But now quite literally every single match online is just full of douche bag cheaters. Literally almost every match. I do not even understand why people cheat online. How is it fun? Keep the cheating offline where it is fun to screw around. You low life vaginas are ruining online games. If you are a online PvP cheater then I hate you, everyone hates you, and your parents are embarrassed beyond belief and had wished they went through with the abortion. Cheater = Puss infected ass mold covered smothered in underwear gravy mixed with dog shit. Go F*ck a dead horse you rotten piles of dog sh*t. I seriously hope you all get a** cancer in your vaginas and die miserable unforgiving deaths alone in a pile of your own making. F*ck you! F*ckin goat f*ckers!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Servers are constantly dead, always having connection issues, getting booted off a match just before it ends. The community is great (Most of the time) but the game servers are just dead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only US servers are available, playing on 200 ping is not nice.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game needs serious overhaul.\r\nMaybe a masterpiece 7 years ago, but an early access in 2025",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sadly, but Sandstorm is the only shooter that was able to hook me lately. \"Why sadly?\" you may ask. So, I'll try to explain. \nUnfortunately, this game is abandoned by its developers. I don't know what they did with their engine, but it runs worse than ever. Lags, bugs, freezes will be your constant companions. Netcode is sh.t as f.ck. In fact, you'll see a title screen more often than the game itself. \nNevertheless, I love this project. It has managed to grope this tiny balance between arcade shooters like BF or CoD and something more simulative like Arma and Squad. I know, I know. If I want to play with military equipment, I should play BF or Squad. But seriously? Only pathetic tachankas for the both sides? That's ridiculous. Espicially when you use it for Security side. Why can't you add... Hmm... Let me think... at least Hummer for example? Or maybe something just more relatable to NATO military cars? What are they doing instead of that? Right! Let's release some more useless DLCs with trashy cosmetics and nothing else. Pure genius! No fixes, no significant changes, no improvments, no progress in development. Ok, they`ve added two or three new maps, but most of the players tend to ban or skip them, as they`re poorly balanced and optimized. Honestly, I don't want to observe the strengths of this game in detail. Indeed, there are lots of them like impeccable sound design, brutal atmosphere of battlefield, shooting mechanics, detailed weapons simulation and etc. But it makes no sense. Sandstorm is technically dead both literally and figuratively and daily online peak barely hitting 1k players is the best proof of my takes. \nI dare say that Incurgency SS had all of the opportunities to stand in the line with the most popular shooters of our days and carve a niche of arcade tactical shooters, but NWI just f.cked up. \nWelp, \"keep it up\" fellas! \nThanks for your attention! I`m done...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is absolute ass and the only reason i didnt get a refund is because i fell asleep with the game running you people ruin tactical shooters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Toxic player base and developer does not have an easy way to enforce bans.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Best known for its realism, and they really nailed it. But the bugs havent been fixed for like a year such as the loadout not saving is such a pain. And the community, ehh… might kill your mood. What can I say... its pretty much like most multiplayer shooter games out there",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game was peak like a year ago now its full of glitches in outfits and ton of other stuff the game is also preatty dead i couldnt find match for like 1 whole hour if your reading this pls dont buy this peace of trach as of now till it gets fixed",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the game is decent but, can you f*cking fix the issue with resetting of saved outfits and the sudden locking of previously purchased items / DLC items or not? oh let me guess, another XP event incoming for the weekend? f*cking lazy, good for nothing r*tards",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}