{
  "positive": [
    {
      "review": "I guess the game is alright. You need to grind a bit but other than that its not time consuming at all.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Been on this game for YEEEEARS, absolutely LOVE it, especially when I found out how to do the stuff you can do like Horse Breeding, Dream horse/Mythical horse things, Sailing on a ship, bartering on that ship, killing monsters in the sea, absolutely love this game!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Black Desert Online is one of the most visually stunning and immersive MMORPGs available today. The game stands out with its fluid, action-based combat system, offering deep, satisfying gameplay where every class feels unique. The world is massive, alive, and full of activities—grinding, trading, life-skills, exploration, PvP, world bosses, and a complex in-game economy that keeps you engaged for the long run.\r\nCharacter customization is unmatched, allowing you to create incredibly detailed and unique avatars. The game receives frequent updates, has a strong community, and offers complete freedom in how you choose to play.\r\nIf you want a modern, dynamic, and visually breathtaking MMO with endless content and a truly immersive world, Black Desert Online is absolutely worth your time. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The game, though I hate to say it, really is quite good once you move past the rough new player experience. But, even to a new player, it's clear the current direction of the game is less than ideal. In essence, they are incentivizing AFK players too much and not incentivizing active playtime enough. Is that a good direction for a living online world? Well, you can decide.\n\nThe other main problem is the monetization. If Pearl Abyss ever needs more money, they could just make a new, really cool skin. Infinite USD potential. That's real money, too, not whatever funny money Korea uses. They even... used to do that, I think, seeing as some of the skins already in the game are quite cool. Currently, however, they favor creating new P2W items instead. The game has enough paid \"convenience\" items, it doesn't need more. PA, trust me: you could make more money just by making cool skins and being more generous with your playerbase.\n\nBut yeah, the game is quite good. I get the sense it used to feel even better, though, when it had less AFK fishing and less pearl shop items.\n\nI'll leave the review positive, for now, since I don't think there's a better MMO available on the market (save for maybe GW2), but I hope PA addresses the AFK meta and focuses more on skins and less on costumes and pets.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Addictive with an intersting crafting system and Lots of different classes to freely choose from.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, Can see 100 + Hrs of content before hitting a wall.\r\n\r\nThe questing is very lackluster, Essentially run here, Press E , run there etc. But the combat makes up for it, its some of the best combat in an MMO. Once you get around level 40 you will start to experience the Grinding Combat system which i quite enjoy. Its not as populated as some games but still holds its numbers well and the chat is always pumping.\r\n\r\nWorth the $10 i spent but i cant imagine im going to get much more out of it as i've sort of hit a wall and its a very very very very confusing system once you graduate from the Seasonal Server.\r\n\r\nThere are loads of guides out there but most are 6years+ old and are outdated, the game has changed so much but the guides havent really reflected the changes so you can be very confused looking up how to do a certain thing.\r\n\r\nI would rate this game a 5/10. Very much worth the full asking price of $11. If you've played WoW, New world, Throne and liberty, Please give this a go and graduate to see if you really enjoy it!\r\n\r\nThanks for reading!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Coming back after a couple years and have really enjoyed the changes. The new and returning player experience is way better, and the combat is still addicting.  Despite negative reviews, I think most \"negative\" reviews being thousands of hours plus in playtime says alot. The game has its cons like any other, but what is there is alot, very in depth and rewarding combat. If your looking for a more old school no hand hold MMORPG this really scratches that itch. With lots of systems and bosses, this that and the other to discover. Played since original US launch and will honestly say the game is in a way funnier place now. The way BDO Does it all open world , is different but neat and it grows on you. And they still have sweaty gear PVP , And have added gear balanced PVP. Solo , Group, Life Skilling, Combat, Bosses, Quests, Crafting, RTS Esque Economy , Horse Training, Workers and Trading. Plenty of fun and neat things if your looking for something with alot to chew on. 8/10 in my Book over the years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PAS un jeu de sauce remplie de cinématique QUI SE LANCE parce que c'est PAS de la sauce\n\nIf you know you know (:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played a lot off MMOs. This is good. I enjoy the storyline.  I find myself caring about the NPCs. It is just a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a new player from 2024 i fall into mass content of the game an very long (still bored) main story quest. you go to A to get quest and go to B to done it all over again and again, the think shining is grinding and model. NOT NEW PLAYER FRIENDLY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great mmo, gameplay is awesome, combat system is awesome, visual effects are great and the over all visuals are great. Characters are beautiful. Great game, fun to play. Balanced and fair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if it wasnt so paid to win its got some of the best combat systems ever to exist in mmos but there is definetly huge issues this game needs to deal with including the rng state of enhancing the rates are a complete lie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lost my lvl. 61 sorc when major switch happened\nregardless, fucking good game tbh, especially if you like h&s/ pvpve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best MMORPG out there. Easy the best combat mechanics out there, unlike TL or even Where Winds Meet which are simple button press and wait for cooldown.\r\n\r\nGreat lifeskilling system, gear progression as well as events.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun grinding mmorpg great customization fun combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of players AFKing in town and fishing, but the combat is nice and you get a ton of options for character generation.\n\nTo be entirely fair, i've spent more time in the character creator than in the actual game, but then again in F2P so...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast-paced, immersive story, a plethora of classes to choose from, graphically a candy-eye. It can be overwhelming at times, but I liked thus far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this soul sucking game, it's still one of the best action mmorpg out there but fuck this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has good graphics and the character progression is much easier than before. If you're feeling tired, you can always go AFK fishing while playing another game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a marathon, not a sprint. If you start playing, start slowly with the main quests, that way you can learn most of the basics. It's pointless to rush - you will get at the endgame fairly quick even following that route.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strip mall MMO with so many THINGS ON THE GUI IT'S HARD TO FIGURE OUT WHAT'S GOING ON.\nGotta be an MMO Vet to enjoy this slop shop, but it is still fun.\nThe type of MMO to give you expiring discount codes. \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "people will say alot of bad about the game and although there are things that need to be improved its still my favorite mmo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spent too many time on Xbox, and now 100h on pc.. Still best combat in mmorpg. A real braindead grind, but atleast in this game the grind is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite \"non-western\" mmo's, I played originally at launch years ago, but it seems that it's changed hands since then and my character information was gone, so when I saw this was on sale for only .99 I thought I'd revist, and I'm glad I did! Only 3 hours in and I can't exactly remember why I left, it's beautiful, fun to play, and the one world server system makes the experience seem just alive today as it was at launch all those years ago. I understand that it can be grindy, and that rng is still the biggest boss to beat, but I've got tons of time and I'm looking forward to falling in love all over again.\n\nEdit: a few days later and I'm just under 80 hours played, some of that admittedly afk fishing, but I'm hooked, again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent story. Easy at first, gets progressively harder. Decent graphics. Lots of things to do. Quests, crafting, boss fights, fishing. Plenty of other things I dont even know about yet. Worth a try if you are looking for a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun mmo with ton of stuff to do most of them you do solo btw also \nalot essenstial stuff like pets/maids are paid only and \nis really super rare to get them with events or game codes \nthere quests that give you pets and other pearl items but not alot and they are 1 time only quests \ni play this for fun i don't grind like mad or spend real money like most serious ppl do and i still enjoy this just fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Customization could be wider, and every class should just have a preset male and female build. The story is easy to follow, and the perks, like the animals you can get are nice!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its aight. I come back to this game every once in a while because its gorgeous and very fun to play. I always leave the game after a while because the grinding isnt appealing to me. Maybe i need to give the \"mid to late game\" more attention and i might stick around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing BDO a few years Love the scenery , and the game mechanics are pretty neat , Quests are ample , I simply wish there was more for a group or duo to do . otherwise Not much I can say about this one other then it's worth it .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great  mmo if you love life skilling .its got  dungeons not sure how many but the game come alive with the combat omg i love this especially with the grinding you have to do . the world looks great and has some infac t the best charector  mod ...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly i dont play MMOs. i was just looking for something to grind and but this one got my attention 10/10 recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well if u  like adventuring  exploring and  epic storyline this game is for you. but you need someone who knows how to play so he can  help you. at first its confusing  until u actually give it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE the game, super interesting, soooooooo much contents, actually feels rewarding when I pay for Quality of Life stuff. Not mandatory, but I honestly don't mind the p2w feature when it's done this mindfully. LOVE IT!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "They have improved the quests and story of the game, the backstory and what to do is much clearer now. There's still plenty to figure out but I'm impressed that PearlAbyss has put so much effort into refining the game experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game :- Very Good game and Enjoyable\r\nStory :- Good\r\nGraphics :- Good\r\nDifficulty :- Balanced",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Black Desert is a massively multiplayer online role-playing game (MMORPG) developed and published by Pearl Abyss. It focuses on action-oriented combat, deep character customization, and an open-world sandbox design.\n\nGameplay emphasizes real-time combat rather than traditional tab targeting. Players use manual aiming, combos, and movement similar to an action game. Each class has distinct mechanics and fluid animations, rewarding skill and timing over automated combat systems.\n\nBeyond fighting, the game features extensive life-simulation systems. Players can fish, trade, cook, craft, farm, breed horses, or manage workers across cities. These non-combat systems integrate into the economy, giving players multiple paths to progress.\n\nThe open world is seamless—no loading screens between regions. It features cities, deserts, forests, and oceans populated by NPCs with schedules and personalities. Dynamic weather, day-night cycles, and a detailed node system create a living environment.\n\nVisually, Black Desert is one of the most graphically advanced MMOs available. The character creator is exceptionally detailed, allowing near-limitless customization. Environments and lighting are realistic, supported by smooth animations and particle effects.\n\nSound design enhances immersion through orchestral music, ambient nature sounds, and dynamic combat audio. Voice acting varies by region but complements the tone of each storyline.\n\nOverall, Black Desert offers a vast, visually stunning MMO experience focused on freedom, skill-based combat, and player-driven progression. Its depth and complexity appeal to dedicated players seeking a long-term, immersive world rather than casual, guided play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I highly recommend this game.  It's a Korean MMO so the game world is beautiful, character models are great and the game is full of complex systems (big plus for me as an older MMO player).  The combat is very fun and cinematic...if you're into the Soulcalibur style.  The combo system in combat gives a lot of depth and really rewards skilled gameplay.\r\n\r\nHowever, I do strongly advise players not to play this game like a sprint to the finish.  I don't think that's possible, or if it is you sacrifice your life and/or bank account to do so.  This is a game that's meant to be played slowly, taking the time to explore different systems in depth and really learn the intricacies of how to optimize your class.\r\n\r\nIf you enjoy that, then this an amazing game.  If you want the instant-gratification of quickly obtaining top-tier gear and jumping into the toughest content...this is not for you.  Also, there is very much a cash shop.  I personally don't feel the need to spend more than the $40 I already have, but if you want to sweat-lord the game then you probably will want to spend (a lot) more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I`m exctied to check It out for the 1st time today, didnt know the new version or mmo is coming out kinda sucks but guess i shouldve played sooner, im just hoping the community is still semi active and helpful all ive been praying for for 8years. is hopfully i can experanice engame as a new F2P It is what it is if not. and yes im writing my reveiw while reinstalling the game. Ill try to post a real one when i get a good feel of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yo, I just dove back into Black Desert, and it's like a beauty pageant where your character slays dragons while AFK-fishing for rent money—endless grindy glamour!  Combat's a combo-fest ballet: airborne flips, super-armor floats, and skill rotations that make me feel like a god until one mistimed dodge sends me ragdolling into a cliff. Spent hours customizing my waifu warrior in the god-tier editor, then parked her at a node for passive silver while I sieged castles with the guild—PvP sieges are sweaty epics!\n\nWorld's a jaw-dropper: vast seas for boat adventures, housing that's basically The Sims on steroids, and life skills like trading empires or horse breeding lotteries. 2025 updates? New classes like Wukong, AI attendants for lazy loot grabs, and events keeping the 20k+ Steam crowd buzzing (plus launcher hordes). Cash shop tempts whales, but F2P can thrive if you're patient. 8.5/10. Addictive black hole—my sleep schedule's bankrupt!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent graphics and combat but very grindy and repetitive after a while. Everything is very generic, from the story to the world and NPC Characters. Also we have heavy pay2win Endgame.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "no idea on anything guild related or node blah blah blah but if you like chill quest grinding and killing shit im 130 hours in and still enjoy grinding questing and killing shit",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good MMORP lots of content and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the only game where you grind so hard for pity that even your Black Spirit feels sorry for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра крутая мне понравилась играл 3ч 30м и все так и хотят со мной попиздеть. Нормально диалогов послушал 3ч",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever! :Steamhappy: \nthe game makes you FEEL like a medieval peasent circa 1403",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If u play Games Like Warframe u shouldnt start playing this ! The Grind is to hard to have a Real Life with this two games!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Yousa gonnsda likea dis one! Da dark side uh da force will be vankished. \r\n\r\nReal talk - it's fun. Especially once you hit Lvl 56, the awakening weapons/skills (or succession) add some depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only play this game to breed horses. Now that I have all 3 Tier 10 horses 6592 hours in, I can retire this game until a tier 11 horse sneaks its way in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda starts off slow at the beginning but overall a good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good MMO game for grinding enthusiast .. !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had fun Lifeskilling and Sailing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for 89p a bit tricky to get used to it but very cool efx",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely low key and allows for major time away and still able to get things done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good fishing simulator with some combat on the side",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the Best MMOs of all times, wish it never dies forever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very bad, very bad, wont play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun to play, not so fun to grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for spending time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "thumbs up people are haters play the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "скачал > апнул 61 > выпустил перса > игра пройдена (делать больше нечего)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arthiritis obtained\r\n\r\n10/10 would play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hope you like grinding, and beeing afk, 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10% active gameplay 90% idle fishing. W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "combat ruined all other mmorpgs for me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My ex gf gave me this game, i now realize how much she hated me.... 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game that has a desert that is of darker shade",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean it's alright played a lil bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PENG YUYAN WUKONG PEAK BLACJK DESERT LETS GO",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If could go back in time, would never start playing this :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright, i guess.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea what I'm doing, but my character looks cool.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "always good updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like fishing for 20h a day! very gameplay!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Look at my play hours... yep... that's a rookie number...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this because I can't download Final Fantasy XIV.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a good open world mmorpg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can play this game for 10000 hours.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "very fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed it i've played it a couple of times",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Me like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game i like so much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love afk fishing. Free gaming dopamines.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "P2W, but fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "thats good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best AFK simulator till this date",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do it all game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best mmo game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pog game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Black Desert <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice i love it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun AF",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "old but gold",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "i do not advice anyone to play this game unless you don't have a job and want to be an F2P player to spend 1000 hours grinding for 1 single gear upgrade after the mid game",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Do not recommend this game, as the game developer group is ruining all players game experience\n\n[h2] This may be RUMOUR but makes sense [/h2]\n\nPA is putting all effort into Crimson Desert, but its development is really a burn of money, so——\nBlack Desert is the blood bag for the new game, the deve group's new work is squeezing the last drop of blood from BDO players;\n\nThe old BDO deve group has been promoted(?). they are now working for Crimson Desert, and a new group is in charge of BDO, which explains why recent changes are so toxic as they are entirely new and know little about the game;\n\n(based on former PA Korean staff) Many ART staffs had been fired, maybe this explains why we only have one unique outfit for new chars(especially weapon skins), and just add universal outfits for all chars;\n\nJ no longer in charge of BDO anymore, he got promoted, so all his previous promises are now wasted. He used to promise that [b] PA would NEVER NERF any single class, if one was too OP, they would BUFF ALL OTHER CHARS to that level. [/b] But once that two phatty guys came, all players got trolled.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "As a long-time veteran of this game, I still enjoy it and continue to play, but I cannot recommend it to new players.\n\nThe game has steadily shifted away from meaningful PvP. It is no longer rewarding and actively penalizes players for engaging in it. Despite being marketed as an MMO, it functions more like a solo experience, with almost no substantial group content. Even at endgame, PvE group activities amount to at most a couple of hours per week. In the past, PvP helped fill this gap, but that is no longer the case.\n\nThere are many additional issues, but the core problem is the developers’ complete disregard for player feedback. Even when an overwhelming majority of the playerbase is unified in their criticism, it is consistently ignored. Meaningful action only seems to happen when backlash becomes so severe that it directly impacts their revenue. Each year they issue apologies for their so-called mistakes, yet the same patterns continue with no real change or accountability.\n\nFor these reasons, I do not recommend purchasing this game, even if it is free, and I would advise extreme caution regarding their upcoming title, Crimson Desert.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Returning player from 2017 tried it again just for fun to see where it was at and it’s mixed feelings.\n\nThe progression is fun up till around 740’sh GS. To get any type of upgrade beyond that is the most time consuming slog ever. You either swipe the credit card to melt costumes for crons to enhance. Or you literally grind for 10 hours a day to buy vendor crons with silver to enhance. You can save your silver and buy pen Debo to exchange for NOV Khara but no new player is going to do that. It’s a big time drain and it will burn you out if you think you can handle grinding for thousands and thousands of hours. I tried it, got burnt. Realized I will be doing this forever, then gave up. Because there’s no point when PVP is dead. More than half the player base is AFK fishing in Velia. And there’s hardly any group content to do with friends. It’s a lonely MMO and some people love that and some find it very boring. The combat is fun and the animations and detail put into the classes is awesome. But beyond that the game is in crying state. And will continue to lose players to OSRS if it doesn’t fix its path.\n\nTLDR: Heavy PTW, hardly any content, fun combat, cool outfits, crappy dev team.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Stay away from this garbage casino RNGesus, suck your life and money away and leave you souless at the end with nothing to show.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It totally contradicts the store page — it says it supports Xbox controllers, but it clearly doesn’t. The game often gets stuck on “running,” and I never know if it’ll actually launch. Sometimes I have to reboot my PC twice just to get in. And every time I launch the game and exit, I have to reboot again before I can open it. I’ve honestly never had a game run this terribly before.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Maybe the game and it's player base was once treated with respect by the developers but it only took a few hours to see the heavy psychological manipulation the entire game revolves around to get your dopamine pumping and geared towards the micro-transaction format. The combat is interesting, but hardly worth being bombarded with non-stop cheap attacks from every angle to get you to open your wallet. From daily log in awards and special market currencies to basic inventory slot expansions, this game holds back no exploitation available to lure in your money. I found the experience downright disrespectful and insulting to my sense of humanity and as a gamer. The status quo for gaming has never looked so bleak. Avoid at all costs. Low reward, High risk ahead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The pop-in, and stuttering in this game is actually egregious.\n\nFun game (awesome combat) saddled with very poor optimision that never seems to improve (or is even a focus to improve).\n\nI install it once a year (since 2015), to see if it's gotten any better, it never has.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Deleting character saves after putting in money for skins is such a scumbag way to conduct a business. Trash company. Don't support them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wow this is awful. Movement sucks, controls are terrible. Highly flashy, unintuitive, and non-impactful.\n  Spent 70 minutes not even getting to play the game.\nI never skip dialogue or story. This .. had me skipping everything. Still didn't even get to play much outside of \"Walk 10ft, skip dialogue, repeat, repeat.\"\nWorth the one dollar. Not the one hour.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "en varias ocasiones intente darle un intento a este juego, me gustan los juegos de grindeo y tengo entendido que este es uno de los que mas contenido para grindear tiene, sin embargo mi nota negativa va en base a que no se entiende nada, si bien 10 horas no es suficiente para saber que tipo de juego es si es suficiente para decir esto: \r\n\r\n-muchisima informacion hasta el punto de ser abrumador\r\n-muy poca explicacion de como funcionan sus sistemas o como deberias progresar.\r\n-los videos que te explican como jugar no te explican como jugar como tal, simplemente te dicen \"haz esto y haz aquello\", lo que hace que sea muy dificil saber por que hago que cosa.\r\n-es MUY invasivo, ni bien desbloqueo una habilidad o cualquier cosa que quiero leer que es o quiero intentar entender, me tira 35 pop ups, cuesta saber que hay que leer.\r\n\r\nme encantaria dedicarle mas tiempo al juego porque repito, me gusta el grindeo en general, pero el juego directamente no me dice que puedo hacer ni como empezar a hacerlo, para mi es un negativo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is beautiful and the combat is excellent, but everything else makes you don't want to play it. For example: The grind you make is irrelevant if you take a break. Game has constant pop-ups of rewards and other crap which you really don't need, but it makes you feel like you do if you don't get them. There are better addictions and MMO's out there. Not recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why the hell are you genderlocking classes. game is too confusing, funky & weird combat, and the tutorial is just talking to people and doing stuff i doubt will matter later",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "end game: run in circles killing mobs to fail an upgrade and repeat",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Can no longer load up the game? They must have broke something in a recent update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not balanced, network lags(not optimized), sometime glitches. Not recommend!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You're obligated to finish its TORTUROUS quest line to be able to play normally and unlock all the skills. And it is ABYSMAL. Feels like the author wants to spread his brain cancer on other people, and it works, because this excruciating STUPIDITY hurts every tiny neuron of my brain. Magnus part is a PURE AGONY, it's TORMENT, these characters boil uncontrollable hatred and desire to kill them all, but you're forced to continue and endure this IDIOCY. This game, without a joke, can induce mental illness and create a natural reallife maniac out of the most patient and peaceful person. It is dangerous. Don't play it. I'm not even talking about pay2win aspect, absolutely laughable economy, worst horses in entire history of videogames etc.\n\nIf you have a healthy brain, this game will torture you till you degrade to a level of its writing. Basically till you become an animal. A pig snorting in a pile of dirt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what is this? feels like everything is just dumped on you at level 1, what's the point of even playing the game. Boring slog running around one shotting everything taking no damage for 3 hours",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "First you give your life to this game. Then you give your soul to this game. Money and firstborn along the way. Blackspirit takes it all and gives you back a pile of poop. They call it rng.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Welp...got done with tutorial, load into the server, finished two quests right in the main spawning town area, servers crash and the game closes to desktop.\r\n\r\nGimmie my gawtdaym dollar back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Black Desert ... what a great game ... killed by the annoying 2 step code verification policy ( for \"our\" security ) that we have to go through every single time we log into the game ... everytime ??? really ??? well , the trust is broken , the game is unplayable if we have to submit to this scrutiny everytime we log into it . Inexcusable ! Unforgivable ! Horrid ! Unacceptable ! Another Dead Game in the library .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No thank you. I refuse to play games with things like \"Pearl boxes\". It's one thing when it is purely cosmetic but I only played for a short while and saw where you can buy things that affect gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "decided to boot up the game for the first time since like 2018, only to find out that all my characters and progress were completely deleted because the game was sold to another company!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Run away Simba! Run away and never return.  Don't start playing this game. It is the Hotel California. We all check in, but we never leave. I have a webclient version of this game with over 20k hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Have to restart my pc whenever I want to boot this game or it goes straight to white screen launcher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a game that tests the limitations of MMORPG.... and fails\n\nI faced lots of bugs during only one hour of play: in character creation, in tutorial, in first quests, in heroes movements, in graphics... also, step-by-step:\nInterfaces are not intuitively understandable, class selection give almost no explanation regarding how will it affect your gameplay, so you start googling on the first minute of the game. visually, starting characters looks good, they have their vibe. customization of the character is complex, but that's not really a plus here cause it is complex and limited. So, the tutorial teach you literally nothing: the plot is scripted, you just learn how to move the character and if you click any possible combination of buttons on your keyboard using 3-4 buttons, there will be a different type of attack, but it seems like it affects gameplay not, all the attacks make... attack... still don't know how to defend although. then, a first mission: the characters are spawning right on top of another, however cannot interact with each other. at the beginnings, the dialogues are limited in one possible variant as an answer. Somewhere at this moment, I already got bored and left to find some foxes and wooden... something, which were like a higher lvl than newbie me, but still made me no damage even if I was standing around and doing nothing. I tried to loot bodies. It takes 10s to loot (gather?) one body, which make even grind to be very boring. So, I went back to the main quest and tried to concentrate on the scenario. The last straw was that the quest was to crack the stone. I came to the stone and was particularly drawn in the stone, so the game couldn't properly distinguish even here, where my character's body start and where the stone starts. That's absolutely unacceptable. So, I quit and uninstalled. \nEven for 2017, there are way too many bugs. Thank you, I don't recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked the animation graphics. However, the game is way confusing and overwhelming. There are way too many things over the interface and too many functions and features that you don’t know what to go for. I don’t even know how I’m supposed to park my mounts and these annoying notifications keep popping up on the top.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game did not feel good to play nor was its story engaging NOR was its new player experience sufficient. I felt very lost and had no sense of progression",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "as a new player, looking up hints and tips. this game could get overwhelming. but i am a deal with it when i can deal with it kind of person. What got me to uninstall was the fact the gameplay felt shallow, this is a world of magic and different races but yet at character creation its all mostly human except for some small mousey looking species. \r\n\r\nbeyond basic looks and difference in abilities i do not see any difference unless you pvp. the focus is so Solo heavy that i kept wondering where the  MMO part of the game was going to start. heavy dialog and i mean heavy, i got so annoyed with one of the characters voices and attitude i just skipped dialog every time they came up during the story scenes. \r\n\r\nSkill building is..well automatic for the most part, not for everything. you pretty much do not have to do anything for while until you can choose to unlock extra skills you do not start out with. but most of the attack skills are 100% all there. so instead of focusing on a certain play style you are just doing all the things and figuring out the sequence of attacks you like best.\r\n\r\nNothing feels personal its like i am just playing a thing and that thing does things and the only real input i had that was personal was their cosmetics. like i was going to push a seasonal character up there. i was already hitting lvl 34 and i was just bored. stuff was going way to fast. the story felt weird. the CP and Energy system annoyed me. i ignored it, i could not ignore the energy system though. i love working on class skills in any game, so when i realized i just couldn't take a whole day and mindless farm materials as one does it turned me off to even caring about it. i don't know what to say here, it looks great but you can feel the weirdness in this game. its hard to describe it,  like something is missing and you can see the mask the game is wearing very early on. so trust your gut while playing if it doesn't feel right, move on.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go play Where Winds Meet much better on this game its garbage now spend all your saving in WWM if you spend here you got only suffering on RNG enhancement on gear 0.001% success WTF?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "such a lovely game, but perish by developers\n\nnot recommended for this dayz anumore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "With outdated UI and an aggressively monetized loading page, just a glance and you know the game is asking you to pay. But I doubt the game could provide equivalent emotional reward or gameplay experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cannot play the game becouse game account its linked to an older email adress that does not exist anymore, sent a ticket to pearl abyss and no answear from them in a long time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the 1.9 hours was spent on learning the game and TRYING to close windows.....and long drawn out monologues....and lots of running not so much battle, and returnib my screen back to 1080 after i give up. no end game button. but what can you expect for .99 \ncents",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There are a lot of bugs in this game, lags in missions and there are a lot of unknowns in the game, you cannot be sure of whatever you do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The screen is packed with just the most cluttered thing game I have ever played. Icons flash constantly but then you click them they won't stop. It changes my regular computer settings instead of just while in the game. \r\nI thought I was buying an action combat style game, but what I got was a \"hold down button to auto combo some really great looking attacks\".\r\nI don't care about the story, world is full of meaningless enemies that die in 2 hits so the chain combos are pointless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Configuration Settings reset every single time you launch the game. I have tried reinstalling, disabling One Drive, unchecking the file read-only, prayed to 12 different gods, and nothing worked. A 7 year old game with a simple game breaking feature like this is completely utter garbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Note to self before reinstalling:\r\nI don't enjoy this game, it's boring and repetitive, there are many activities in this game, but most of them are dull or not worthwhile. The classes feel like AI slop, even though the old ones feel weirdly outdated, as they were made by humans. The progression system is a casino at it's core, housing system is whack, ships are pointless, Too many p2w restrictions make it impossible to truly enjoy the pointless rest of the game.\r\nI would much rather play modded Minecraft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even boot up the game. Says like offline or something. Try to submit a ticket but I need to make an account which I don't have?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "great game till you cant complete a quest because it wont play the cutscene so your just stuck with not being able to complete it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant log in to a new account, keeps looking for my old email which is gone (sold but not for this game) im trying to start a new account but i dont know how cause theres a pop out message keep appearing and looking for a code in my old gmail",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant play with my friend in EU servers because my steam account region is not same with them ,most stupid thing i ever seen in a game in steam",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played back in the day (2017). Was interested in getting back into it recently. Come to find out my account has been deleted due to a transfer of publishers. Boooooo!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game graphics are great, the customization is positive as well, and fun to go through, and the game play potentially looks great, however the fact that every time I move my mouse the camera moves ruins the entire experience. There's no option to turn it off, and again, this just ruins it and I have no desire to play it despite all the positivity with it. I'm just grateful I caught it on sale for a dollar so it wasn't potentially a waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The cluttered and messy UI just makes you feel overstimulated and overwhelmed to the point that I wasn't interested in playing at all. Too  bad because I heard the combat could be fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics options are awful, the render distance is garbage even on ultra settings, you can see everything rendering right in front of you, there's no option to disable VSyn, the graphics options were made for monkeys and mobile players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't; just trust the negative reviews. Used to play this back when it was trendy. Had some ups, but the downs are way more pressing. Just save your money, trust.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game sucks. Story is dull, most equipment doesn't change appearance. Just a bad game, go play ff14 instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm sorry, I wish I could provide an objective review but my first, second, third, and fourth quit moments are me slowly, agonizingly pulling my way through character creation on a class I don't want, character customization I don't want, name I don't want, and hecking FAMILY NAME I don't want because I can't read any of the menus due to the default options crowding the screen so everything's on top of each other.\r\n\r\nGuys, you need graphics options at the start screen or, if you have that already, you need to make it a more obvious glowing sign.\r\n\r\nForreal, at what level do I unlock basic screen settings???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The tutorial is useless.  The UI is overwhelmingly complicated - how many icons can you possibly stick on one menu...what are the for?  How do you use them?  Level up - Ok, how?  Is there something I should do?  This game is a waste of time. I think the goal is to simply try and take as much money away from you as possible.  The Company should be embarrassed to put out such a pile of crap.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cant change region, cant use old account\n\nbrain damage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was good 5 years ago. Definitely not recommend starting now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible graphics even for a 2017 game,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pros:\naesthetics\ncombat\nmovement\nclasses feel amazing and very different\nnodewar in lower tiers still exist i suppose, maybe?\n\ncons:\nthe gear reset from the past year is just disgusting. if you played 1 year ago and you come back to the game your gear value is like 30% of what it used to be.if you were 700 gs last year(soft cap) you need to get to 800 gs this year(the new \"soft cap\") or you're basically worthless, even then, the new \"PVP BALANCE LMFAO\" made it so that there's no other classes in nodewars other than gauntlets and 1-2 random flavor of the month dps/healer class every few months..\n\n, it's insane how much they destroyed the countless hours people put in this game for their gear, they don't respect you, they don't respect your time, they don't respect your money. the developers are disgusting money gubblers, the game is more p2w than it ever was, in order to compete YOU MUST invest in the gamba boxes atleast a few hunder euros a month and who knows, next year they might reset the gear again and your thousands of euros become useless again. \n\ni'm talking as someone who has played and seen everything this game has to offer, from dungeons, to bosses, to top tier node wars (been top tier guild for 1 year +), to even decent pvp rank (the arena of solare is good when it's up, rest of the content is cooked). \n\nthey ruined the game, the systems, the p2w, the pvp is gone, the game is just an afk fishing simulator that throws rolly boxes and skimpy outfits at you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I used to play this game religiously and looked forward to play it everyday. But I feel like the recent updates were made for people that are willing to spend too much money on this game. When I started playing you progressed at your own pace and it felt like you were exploring the world, but now they force you through the story line and you don't know what to do once you are finished with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "-10/10 don't waste your time probably gonna refund this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Only worth your time for about 20h of gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "same trash p2w game its always been... Skip big time",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "spent money on a game got a black screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "brutal pay to win systems at end game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "holy sht why should i be forced to play in other than English language",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Would you recommend this game to other players?\"\r\nNo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game fucking sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't do it just dont",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Slop Desert",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "massive ass, thats why its given for free twice a week",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "2 h of auto run 1 h sleep then delete",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Language is russian",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lets all play Where Winds Meet and be done with this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful, way to much P2W.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "que conste mucho de mi playtime es afk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is like where winds meet, but much much much Much MUch MUCh MUCH worse and gayer. Just play WWM instead",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "buy this if u dont have a life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Save yourself. Don't start.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dead fuckinggame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hot shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brain dead grind",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so so bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "çöp",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gay",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "⬛⬛⬛⬛⬛⬛⬛⬛\n🟧🟧🟧🟧⬛⬛⬛⬛\n🟧🟧🟧🟧🟧🟧⬛⬛\n🟧⬜⬛🟧🟧⬛⬜🟧\n🟧🟧🟧🟧🟧🟧🟧🟧\n🟧🟧🟧⬛⬛🟧🟧🟧\n🟧🟧🟧🟧🟧🟧🟧🟧\n████║░░░████████████║ ████║░░░████╔═══════╝ ████║░░░████║░░░░░░░░ ████████████████████╗ ████████████████████║ ╚═══════████╔═══████║ ░░░░░░░░████║░░░████║ ████████████║░░░████║",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to look forward to getting home to play BDO, but this game just isn't what it used to be. \nPA keeps trying to improve things, only to make the overall experience even worse. They wiped out everyone's login loyalty points, in favor of an \"upgrade\" where how much you earn daily is now tied to how much IRL money you spend in the store. (That resets seasonally)\nI dunno man, I just can't recommend the game with the way it is right now.",
      "voted_up": false,
      "votes_helpful": 111
    },
    {
      "review": "As a new player, this was genuinely the biggest waste of time I have ever had the displeasure to play.\n\nThe combat is awesome until you realize it turns into a same 3-4 moves over and over for hundreds/thousands of hours. The UI is a mess with a slurry of items that have a small novel written on every single one. There's so many different elements on my screen at the same time and it has taken me several weeks to just barely scratch the surface of all the garbage scattered about. Trying to get PROPER HELP is a pain in the ** cause everyone's jorking each other off in the chat so questions rarely get answered unless I ask multiple times in a row. Oh you used an item that could've helped you with hundreds of hours and grind on the wrong thing? Guess you should've read the 900 different things and remembered it all at the same time and know what was relevant for when. The Mentor system is a joke cause no one actually wants to mentor anybody they just want to mooch the free rewards off new players.\n\nDon't waste your time like I did. This game wants to bleed you dry of your life and money just for a horrible gameplay loop of killing the same groups of enemies for hundreds of hours with minimal gain.\n\nMaybe take some time to declutter the mess you've made, Pearl Abyss. You wont get ANY new players with how bogged down your entire game is. You do not need all the bloat everywhere to keep people around.",
      "voted_up": false,
      "votes_helpful": 191
    },
    {
      "review": "i do not advice anyone to play this game unless you don't have a job and want to be an F2P player to spend 1000 hours grinding for 1 single gear upgrade after the mid game",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Literally scammed half its playerbase. \r\nTLDR; They full wiped, Including payed for content, Then refused any type of re-umbursement. \r\nIt is Currently being investigated potential class action from Australia.\r\n\r\nLiteral theft and as of right now, They are getting away with it.",
      "voted_up": false,
      "votes_helpful": 78
    },
    {
      "review": "Wow, just logged in today after a time to do some grinding only to be met with some major changes over the past year. They \"revamped\" the \"loyalty\" program that awarded players loyalty points daily for logging in that could be spent on things that otherwise would have to be bought with real money. With this \"revamp\" all loyalty points for ever player were wiped clean. I could not ever imagine what the need for removing every bodies points was. I am not sure how many 10s of thousands of points I had saved for when the time arose I needed something I was short on, so I cant imagine other players that have played for a decade. If that isn't bad enough the \"REVAMP\" added the feature of acquiring further loyalty points then the daily login amount by, YOU GUESSED IT, spending real money in the shop! When I looked up what happened to my points I also came to the realization they are adding time gated content through dailies or weeklies. Even worse news yet they added AP caps (Power caps) to mobs. So you are penalized now in an infinite grind sandbox game for having too high of a gear score? These seem like major steps away from what the game was originally intended to be, and what kept me coming back.",
      "voted_up": false,
      "votes_helpful": 70
    },
    {
      "review": "Do not recommend this game, as the game developer group is ruining all players game experience\n\n[h2] This may be RUMOUR but makes sense [/h2]\n\nPA is putting all effort into Crimson Desert, but its development is really a burn of money, so——\nBlack Desert is the blood bag for the new game, the deve group's new work is squeezing the last drop of blood from BDO players;\n\nThe old BDO deve group has been promoted(?). they are now working for Crimson Desert, and a new group is in charge of BDO, which explains why recent changes are so toxic as they are entirely new and know little about the game;\n\n(based on former PA Korean staff) Many ART staffs had been fired, maybe this explains why we only have one unique outfit for new chars(especially weapon skins), and just add universal outfits for all chars;\n\nJ no longer in charge of BDO anymore, he got promoted, so all his previous promises are now wasted. He used to promise that [b] PA would NEVER NERF any single class, if one was too OP, they would BUFF ALL OTHER CHARS to that level. [/b] But once that two phatty guys came, all players got trolled.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "The developers don't know what they are doing with the game, every update they are just ruining it more and more.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "As a long-time veteran of this game, I still enjoy it and continue to play, but I cannot recommend it to new players.\n\nThe game has steadily shifted away from meaningful PvP. It is no longer rewarding and actively penalizes players for engaging in it. Despite being marketed as an MMO, it functions more like a solo experience, with almost no substantial group content. Even at endgame, PvE group activities amount to at most a couple of hours per week. In the past, PvP helped fill this gap, but that is no longer the case.\n\nThere are many additional issues, but the core problem is the developers’ complete disregard for player feedback. Even when an overwhelming majority of the playerbase is unified in their criticism, it is consistently ignored. Meaningful action only seems to happen when backlash becomes so severe that it directly impacts their revenue. Each year they issue apologies for their so-called mistakes, yet the same patterns continue with no real change or accountability.\n\nFor these reasons, I do not recommend purchasing this game, even if it is free, and I would advise extreme caution regarding their upcoming title, Crimson Desert.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Pretty much game has devolved into unified gear, time gated content, and \"sales\" for 'coincidentally' the items you need to progress faster...until you run into the time gated content LOL\n\nThe combat is cool/flashy, but a lot of classes are outdated and there is no rebalance in sight. Constant promises every 6 month community event (called \"Calpheon/Heidel Ball\") that you never get. Sure you get some rewards but they will always fall short of the time investment needed to keep up AND gear up. \n\nI guess if you want a second job then this game is for you, otherwise I'd look elsewhere lul",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Returning player from 2017 tried it again just for fun to see where it was at and it’s mixed feelings.\n\nThe progression is fun up till around 740’sh GS. To get any type of upgrade beyond that is the most time consuming slog ever. You either swipe the credit card to melt costumes for crons to enhance. Or you literally grind for 10 hours a day to buy vendor crons with silver to enhance. You can save your silver and buy pen Debo to exchange for NOV Khara but no new player is going to do that. It’s a big time drain and it will burn you out if you think you can handle grinding for thousands and thousands of hours. I tried it, got burnt. Realized I will be doing this forever, then gave up. Because there’s no point when PVP is dead. More than half the player base is AFK fishing in Velia. And there’s hardly any group content to do with friends. It’s a lonely MMO and some people love that and some find it very boring. The combat is fun and the animations and detail put into the classes is awesome. But beyond that the game is in crying state. And will continue to lose players to OSRS if it doesn’t fix its path.\n\nTLDR: Heavy PTW, hardly any content, fun combat, cool outfits, crappy dev team.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Pay to win, terrible balance, and the same bugs in the game for years. \n\nAt times it's hard to tell if it's incompetence or apathy. They also seem to have forgotten some specs in the game even exist.\nBDO has been successful in spite of the efforts of Pearl Abyss, not because of them. This game could have been amazing in the hands of a better developer.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Stay away from this garbage casino RNGesus, suck your life and money away and leave you souless at the end with nothing to show.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}