{
  "positive": [
    {
      "review": "I mean this is obviously a mobile game... But it's very fun still, i just hate all the pay to win stuff, if you like base-building games then its for you. thanks for reading.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "i have a dude in my vault, sent him into the wasteland, checked up on him after a couple hours, he took down like 17 deathclaws and 7 yaoi gui, he had the stats of a fucking mole rat. also fuck them stupid ass ghouls (only the ferals)... 10/10 game, would jerk to again",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "It's nothing groundbreaking but for fans of the fallout series it's a fun waste of time. Game mechanics are incredibly simple, probably something you'll uninstall after 3 months and then come back to 8 months later.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fallout Shelter was clearly made for fans of the series who enjoy its strategic side. Keeping the familiar Fallout style and tone, the game offers a very specific kind of strategy experience where you, as the Overseer, must manage your dwellers, build useful rooms, and defend the vault from raider attacks.\n\nIt doesn't offer anything groundbreaking - it's a simple base-building simulator with some nice features, from the familiar SPECIAL skill system that boosts productivity to the easy-to-manage exploration missions. It's fun for a while, but it doesn't go much deeper than that.\n\n★ ★ ★ ★ ★ ★ ☆ ☆ ☆ ☆ (6/10)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Building rooms, managing resources, keeping everyone alive (and occasionally sending them out to die, oops)… it’s this perfect mix of chill and stressful.\nWatching your little vault grow from a tiny bunker into a fully functioning underground city is super satisfying.\nIt’s simple, but dangerously addictive — the kind of game you keep installed forever because you ‘might come back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're not a fallout fan then you might not enjoy it. its a cool FREE base management game for fallout",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is decent. The game is addicting and fun, and I like to play it occasionally, but the reason I said the game is decent instead of good is because of all the microtransactions. You have to have a lot of patience to play this game without spending things because sometimes things take DAYS to complete without spending things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game 67/67 better than fallout 4 get fallout shelter its free! i actually thought it was 2d not fun but i love the creation of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played Shelter on my phone a year ago and have 90 hours in it. Going to play it again here to get all the achievements. \nI love the sound of achievements. It's better than p0rn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a relaxed take on the Fallout universe. Canonically, it's an in-game simulator to train new overseers (don't quote me on that). A very fun game if you enjoy management sims.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and good time killer. works off my OCD lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played maybe a little too long was it worth it YES would I do it again yea why not. Would I recommend you do it NO The Months I spent Where some weird Months.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played it on Android and PS4, and it's quite immersive when it comes to the lore reason behind the shelters. You know, the social experiments and that kind of stuff.\n\nIt's the kind of game you would play when you're bored or you're waiting for something. Or for feel like a god.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple but addictive, Fallout Shelter nails the loop of building rooms, managing resources, and keeping your Vault citizens alive. It’s charming, easy to play in short bursts, and scratches that perfect little management itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy and chilled game to pass the time. becomes a little addictive trying to keep your dwellers alive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, so fun when a radroach infestation takes out half of your workers, and your other half die when you don't have enough workers for your facilities. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Fun to mess around a couple times a day for a few days or weeks then drop forever after.[/h1]\nOverall the game was a cool mini concept to launch for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like building stuff and playing old games this is 100% the best game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most chill & relevant game that will provide a cool experience when learning new mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came for the Fallout lore, I stayed because I'm now emotionally invested in the well-being of 150 digital residents who couldn't organize a picnic in a radiation-free park. Fallout Shelter isn't just a game; it's a profound social experiment where you learn that 80% of leadership is just making sure the lights stay on and making dwellers pregnant to produce more workers.\r\n\r\nWant a productive worker? Pump 'em full of stat-boosting outfits and make them do squats in the weight room. Need more Caps? Send your best guy into the wasteland to fight a Deathclaw with a butter knife. It's basically capitalism, but with more mutants and significantly better hats.\r\n\r\nThe fun comes from the desperate scramble for resources, the glee of finding a legendary weapon in a lunchbox, and the terrifying realization that your most charming dwellers are also your most fertile. You will laugh. You will cry. You will question why you're more stressed about your dwellers' happiness than your own.\r\n\r\nA must-play for anyone who secretly wants to be in charge of everything, as long as everything includes quirky animations and the occasional raider invasion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games that fits into the \"play whenever you feel like it\" category. I can log in at random times out throughout the day, jump right back in, and my dwellers return from quests like loyal little vault soldiers ready to unload loot. There's something really satisfying about the simplicity of it all. The gameplay is basic in the best way; build rooms, manage resources, send people out, repeat. \r\nThe game does have its timesensitive moments, where you will lose progress depending on how you manage it ...it can really harm or just be a lil hiccup in the road. After a certain stability level, it becomes very manageable. \r\nworth noting : deathclaws do start showing up after 60 dwellers, so i wouldn't recommend crossing that population unless you're prepared in the first few rooms.\r\noverall best free game that you can progress in, not much power in graphics but it def brings humor to the dialogs you encounter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun to play when you're bored and want to try a new game, you'll probably love it if your a fallout fan. Many different types of things to do like go out and do quest, design your base, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun sim. It's the most polished Bethesda game I have played. Maybe they should do more games like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun chill game, but it gets a bit repetitive after some time. Would recommend still since it's free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't like this game, but I can see why people like it. If you like base building and stuff like that, then it's for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout Shelter is a surprisingly addictive and fun little vault-management game. I had a great time expanding my vault, keeping everyone alive, and slowly unlocking achievements along the way. The mix of building, exploring, and managing dwellers is simple but super satisfying.\r\n\r\nIt’s easy to jump into, rewarding to progress through, and perfect for quick sessions or long playthroughs. If you enjoy management games or Fallout in general, this one is definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No different to the mobile version. Cool though does slowly devolve into \"do daily tasks\" type game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was looking for a game that would work on my Microsoft Surface Pro and this runs perfectly with the touchscreen + pen support for managing rooms and Dwellers.\r\n\r\nI love expanding my Vault and optimizing dweller skills, but I do wish the population cap was higher than 200.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoy the game and opening lunch boxes etc. i just wish they would update the game like they do on mobile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout Shelter is a fun game, perfect for logging on, looking around and maybe doing a quest that take about 5-10 minutes. Now the game is VERY outdated, I'm saying like years outdated and if you want to have the events like seasonal and the Fallout TV Show then you'll have to play the mobile version because that's updated almost monthly. With only about 6 hours of playtime as of doing this review I'd say this game a good free to play and building type game, with item to spend money on but honestly you could just change the time on your PC to skip some of the wait times so spending money is basically useless. Do I recommend this game? Yes, I do.\nThanks for reading.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No matter how many eyes I have to close to see straight, this game never lets me down.  It's my nightcap in no matter the occasion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun base building game. And its free , cant beat that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its like gambling but instead of having the risk of losing your money, you risk losing your residents life :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice little tycoon game. Microtransactions aren't as bad as I thought.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very great game has a lot of mods hunt for all achievements takes a lot of hours but still very fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable little colony game. Can be chaotic, especially in survival mode, with enemies being much stronger and death being permanent. Steady progression, basic and boring combat and a few glitches and bugs. Obvious mobile game cash grab with microtransactions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do recommend this game, especially to people who have played other games like this, But even if you like fallout games, but don't like waiting too much, this game isn't right to you. Because this game requires SO much waiting, it is hardly viable to not spend money, but this game is still good and is a nice game to play whenever you have a little bit of free time, but do not spend too much money, because this game will feel bland after a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already seeing this game in Google Play Store. But i don't know really interested at the time, after a views moment this game pop-up in my steam. So, i give it a try and to be honest. I kinda like game with this kind of mechanism. Focus on building, giving task to the inhabitants, make them reproduce for mankind future, upgrading the facilities and sending hero to exploring the outside world. Simple gameplay, simple goals but need a good way of thinking and good strategies to manage base resources. 9/10 for me, even i like the gameplay at somepoint there's something that missing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice and cozy shelter managing game! my only complain is that the missions and quests do tend to get repetitive for me. \nQuick tip: take a selection of your dwellers and train them to MAX EVERYTHING! then put 2 of them on your entry gate for gate-keeping in case of raids and shi, 9 of them (in teams of 3) for quests, and as many as you want for your perma-scavengers and gear all of them with the best outfits and weapons you have. it will help you in the material gathering and money. Name them by numbers for each team and division to make it easier to distinct them from another and manage!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a management sim where you willingly become the overworked landlord of an underground bunker full of incredibly needy people. In summary, it's addictively frustrating. You run a dystopian society under constant threat of fire and giant insects, and yet, you keep coming back. My real-life productivity is zero, but my Vault has never been cleaner!\n9/10. Needs more giant scorpions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took me a few restarts until I grasps the concept to build a stable shelter.  Fun game and would recommend to anyone looking for a interactive base building game.  As you grow, the base gets busy with tasks and infestations, or raids.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. I have been playing it on different devices since it was released. It's fun, and follows the franchise really well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is, obviously, very different from all the other Fallout games. The grim comedy is still there, but not as good as fallout or fallout 2. Very solid idle game if you like Fallout though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always a nice time killer and generally well done, can do the gameplay with or without micro-transactions but they tend to have regular sales as well that aren't a rip off. 10/10 would make Preston Garvey my Wastelander again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun relaxing game. Don't mind the time it takes because I can get off and it still progresses stuff. \r\nDon't think to deep on the game its chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for free.  Not much reason to spend money on it, save it for Fallout 5.  You can rule the wasteland without buying premium stuff for the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play it a lot on my iPhone 5S as a teenager. I really enjoyed replaying the experience on Steam \n\n+ the graphics are still charming\n+ vibe of my favorite universe\n+ u can play without donations\n+ nice gameplay. it's absolutely fantastic for a free game\n\n- boring at the beginning. while the shelter is small. there's practically nothing to do \n- some achievements are tied to a VEEEERY BOOOORING and useless part",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fallout Shelter is an efficient and well-designed management simulation. The game puts the player in control of an underground shelter, requiring a balance between resources, expansion, and the well-being of the inhabitants.\nEngaging management: the mechanics of building and optimizing rooms maintain a constant and rewarding pace.\nClear progress: each improvement and new function brings a real sense of advancement.\nVisual style: the retro design and 1950s-inspired aesthetics combine with the Fallout universe and maintain a lightness even in the face of a post-apocalyptic theme.\nAccessibility: simple controls and an intuitive interface allow you to play in short intervals without losing continuity.\nReplayability: the randomness and customization system of the inhabitants prolongs interest in the long term.\nIn short, it's a solid experience for those who appreciate strategy and management, with a balance between challenge and relaxation.\n\nSince the game is free, you decide whether to download it or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mobile (9/10):\nPerfect for quick play.\nIntuitive touch controls.\nCharming aesthetic.\nNon‑intrusive F2P model.\n\nPC (6.5/10):\nFunctional port.\nLacks PC‑specific features.\nFeels repetitive.\nVerdict: Must‑play on mobile, just okay on PC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bethesda keeps me amazed every time from the Elder Scrolls Serie to this now, I am an organised person I like this kind of simulation games, building looting and upgrading I have so much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's free and something to go back to when your bored, especially if your in a college lecture where you don't do anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit frustrating, but fun in a slow-burner kind of way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like fallout and you like shelters, youll love Fallout Shelter. Best of both worlds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wait for the microtransaction sale to shortcut yourself after you switch form mobile to steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its easy to play and requires a small amount of computer power to run",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Straight forward and easy going. Build a vault and help your dwellers thrive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] My Opinion and Review on Fallout Shelter (Short) [/h1]\n\n\n[h2] Description (Game): [/h2]\nFallout Shelter lets you run your own underground vault in the Fallout world. You handle everything—assigning dwellers to jobs, expanding rooms, keeping resources steady, and dealing with random wasteland problems. It starts off pretty chill, but once your vault grows, it becomes a fun little juggling act.\n\n\n[h2] My Opinion: [/h2]\nSo, even though I just started playing this on Steam, this isn’t my first trip into Vault Life. I’ve played this game way too much on my phone over the years. Like… actual countless hours. So yeah, my Steam playtime looks fresh, but I already know the chaos that comes with running a vault.\n\nWhat I love is how the game slowly hooks you. You jump in thinking you’ll check on your dwellers for a minute, and suddenly you’re upgrading rooms, sending explorers out, and planning where your next elevator should go. It’s simple, but in a good way—easy to chill with, easy to get attached to, and easy to lose time in without realizing it.\n\nIt does get repetitive once your vault gets stable, but honestly, I still enjoy popping in and watching everything come together.\n\n\n[h2] Pros: [/h2]\n[list]\n    [*]Super easy to play and weirdly addictive\n    [*]Has that classic Fallout humor and charm\n    [*]Tons of ways to shape your vault the way you like\n    [*]Great for short, casual play sessions\n    [*]Free-to-play and doesn’t force spending\n[/list]\n\n\n[h2] Cons: [/h2]\n[list]\n    [*]Repetition hits in the late game\n    [*]Progress can feel slow unless you’re patient\n    [*]Once your vault is stable, there aren’t many big surprises\n[/list]\n\n\n[h2] Final Thoughts: [/h2]\nIf you like chill management games—or you’re a Fallout fan—it’s a great little game to sink into. Even after all the hours I’ve already put in on mobile, jumping into the Steam version still feels fun and familiar. Perfect for when you just want to relax and watch your tiny underground society grow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish they would update the steam version in line with mobile, easy time passer when relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a fallout fan it's a fun and not to difficult to learn game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easier to play on the computer than the phone. its a good time waster,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kill 12 raider with your fist, worst quest of the game should be removed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has been one of my favorite games for years.  I play on my phone, iPad, and Tesla car.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its about as fun as the sperm races in the U.S.\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love Fallout, and even remotely love a simulator, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such a fun and addictive game. I've played before on my phone and Switch, but playing on PC has definitely been the best experience, and I especially love all of the achievements you can get. Fallout forevvvaaaa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where we live in a world where my small and humble self cant enjoy the experience of being a governing body of any community (for legal reasons I wouldnt be allowed) and control the lives of helpless and unaware civilians.\n\nPerforming unethical experiments on people and treating people like our failing government does allows me to express my own creativity of using and treating people like insects.\n\nAlso goofy outfits",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been around a long time, and continues to get better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "halloween version of fallout boy looks like bart and johny test at the same time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a decent little fallout themed vault survival game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an easy way to waste a couple hundred hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to kill time. Takes a while to get going.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like this because its a easy point and click.f",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sim Vault.  Eats time and not a long grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is an easy glitch where you change the time to get more stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty much the best game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just one of those idle games that are actually fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable and nostalgic for me :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it like a tycoon but a more realistic vibe yn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS LIKE BOARD GAME BUT BETTER ITS LIKE A IDLE BUT BETTER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with fun little tasks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Calm pace but good world build game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like grinding but i think its too much grinding but ig need more time to figure it out c:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FALLLoUt Is cOOL And Dis Game Is FAlLOuT SO iT Cool!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I left for an hour and my dudes got radiation poisoning and grew a second cock and then mega impregnated my woman and then shat himself whilst slapping his inflated belly while the hyper futa tomboy was rubbing her cock in the corner and then a hot furry with a massive chode started inflating and then let out a huge stinky green fart on a buzz lightyear doll",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good time waster for fallout fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game if your not busy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i kinda like it. were are the super mutants tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good way to pass the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a little casual game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have played any of the FO series, you should enjoy this. I recommend giving it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game that started it all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but gets old after a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game to play for fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome sauce game love it when your bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun little time waster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Careful... It's addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little game (no RPG elements)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD TIME KILLER AND PRETTY COOL INTERACTIONS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun for a couple of hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "why can't I send the children out into the wasteland?",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Unless you pay actual money this game gets extremely frustrating. It lies about percentages. Everything is pure rng. Enemies dont scale in a cohesive manner. Random attacks either come non stop or you get none at all. Not sure ill be playing much more. Extremely glad I didnt spend a cent on this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "the chibi avatars make me forget what i did to gary.... maybe this run gary 52 will make me forget the bombing of megaton! Gee-whiz this game surely has fallout things in it, i guess? Maybe?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to like the game but there seems to be some massive flaws in the pacing.\nTried twice now and shortly after starting and getting 12 dwellers, the game just slows to a crawl and nothing particular happens.\nOne of my dudes knocked up all 4 female dwellers and I spent the last hour+ waiting for them to plop out and increase the dwellercount so I could unlock more rooms and maybe continue.\n\nBut in the end I'll just do something else, Just staring at the screen while nothing really happens hours on end is not my idea of fun gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "random farmville like free to play with broken game dynamics to push you to pay. dont bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is mainly just pay to win, unless you have all the time in the world, after all the quests, there is just nothing for you to do, it is not a terrible game itself though. Also, there appears to be ps4 controller compatibility, unlike on console.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game though it is rough in some edges though updating the game would at least make that unnoticeable which is why i couldn't recommend it. It is still a good game though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst bunker game i've seen, no info of any kind, some random rad roaches show up and just kill 5-6 armed workers, drag and drop areas are all weird, what a waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game has a bug that eventually bogs down game play to a crawl then freezes, and its worse when not online. the game is just whack-a-mole and timer management with a fallout theme and things to collect. I only came back to it because someone said there may be an update in 2025, and i forgot how bad the freezes were.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is a pure money grab. you will have to spend a minimum 100+ hours to get the most basic stuff established and thats if the game doesnt kill youre dwellers because you cant get weapons or anything naturally you gotta buy it untill you magically get some somehow to go explore the wasteland so the dwellers run around and just die then takes HOOURS to days to get anough caps you revive one person out of many. absolute waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i played this game on mobile and appreciate the fact that they ported it to pc but the controls are unbelievably buggy. i would absolutely not recommend this game to others",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "loaded then closed the game now saying error and wont load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the steam version and computer version is brokeeeeeeennnnnnnn i had 4 hours on the verge of completing my goals and finally getting the overseers office and my whole vault deleted and disappeared my files arent even corrupted dont waste ur time down the pe smh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wouldve been nice to know that this version of the game doesnt get updates before i spent hours on it. thanks bethesda",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there are microtransactions, and the game feels rather slow. found myself just letting it run in the background while i did something else. not personally my thing ig.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashed mid game and wiped my whole savegame of 8 hours permanently. Thanks Bethesda.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely cannot stand this game. 3 times ive had my saved file corrupted. im never playing this complete waste of time again. i do NOT recommend this crap of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So i just play this game again before that i play in handphone tooo .. and i really enjoy this game, makes mee remember old times UNTIL MY SHELTER GONE AGAINNN?!! like.. mann, i waste my time for create a good shelter and i get result my shelter is gone ?? uhh i hate this, in steam in playstore, THIS DISEASE CANT BE NEVER GONEEE IN THIS GAME, AGHHHHHHHHHHHHHH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "breeding high special parents does not make high special kids.... you get baseline kids plus one extra point.  that's stupid.  stopped playing after that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Could be a fun little casual game to play over an extended time but that potential is lost on it's excessive time gating and by it's overvalued pricing in the in game store.\r\n\r\nNot much to do but click and zoom in and the available game area is rather small, very few distinctive sound fx and music. \r\n\r\nBetween in the in game store and the lack of entertaining game play compounded by the excessive time gating it's too badly hindered by poor design choices to be entertaining and enjoyable. It feels more like a parking meter than a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played this game once before, when there was no Steam/Valve to sell it .. and it's not been made any better .. \r\n\r\nIn short: It's a money grab, and if you are willing to spend an ever-increasing amount of money you can still be beaten by anything the game can through at you .. or you can \"tread water\" and continually spend more money .. your choice (not really, it's programmed to fleece you).\r\n\r\n\r\nTDLTR:\r\nWhat could be a great casual game completely ruined by greed .. without being willing to spend real money this game is just a complete exercise in micro-mgmt and some clever programming to continually rotate you through disaster and suddenly failing infrastructure that once provides food/power/water and then suddenly doesn't, despite no change in population ..\r\n\r\nThe vault floors and vault door are made of compressed oatmeal easily breached by everything with enemies that can simply disengage your defense forces, who calmly step aside and allow the enemy forces to progress through your vault complex, over and over again .. you will run our of stim packs and radex .. but, fear not, you can simply go to the store and buy stuff .. and if you do, the relefe will be fleeting followed by more frequent attacks by bigger bad guys .. \r\n\r\n.. it's a waste of time ..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game on Apple that I had premium items on, they do not allow the accounts to be merged and is a total double down for players to purchase microtransactions; Not just a boring game but a scam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't spend money on this game because of the bugs. Just play it for free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Istg if I get raped by another random rat invasion I'm offing myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a  misery simulator made to grab more and more money out of your pockets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greedy ass bastards stop updating 10+ year old games to try an introduce more paid mods. Actual fucking scumbags.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am so glad there are cheats for this game.  Don't give bethesda real money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't play it. Game closes when you try to pick a vault.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You guys update the mobile version but NOT The Steam PC version.... yeah... sounds about right!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It doesn't know what kind of game it wants to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4/10, on phone it was good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please update this game it has been years!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plz add Chinese language support",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "microtransaction slopfest",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "#1 most boring game in existance.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck I love mobile games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Real life poop from a butt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Done with BGS's BS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the only reason im giving a bad review is because i had a vault 2 weeks old and when i woke up today it was gone. nothing. not even a save file left :'''(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "eh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bethesda is not updating this game like they updated the mobile version of it. Do not play this until they update this Steam version.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Firstly you release a great game then you don't update this fun game on steam which was ok but I was disappointed then to put salt in the wounds you delisted the game instead of releasing a patch to fix the issues with hackers and malware issues with the engine. SMH.. I am disappointed in you and probably the community would agree with me on this. Over all the game was addictive and time consuming but fun with endless looting and missions to get and reach. I mostly play on phone version because it feels modded vs this version that feels like OG Vanilla version. We don't get updates, Promotions and support or team ups with the Fallout TV Show from the devs on steam which is crazy sad and weird to have two different versions.. \nPlease fix the game and patch it and release the game with updates! \nI will maybe change this review in the future after ( Fallout Shelter is no longer available on the Steam store) Tag is gone.. SMH..",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Unless you pay actual money this game gets extremely frustrating. It lies about percentages. Everything is pure rng. Enemies dont scale in a cohesive manner. Random attacks either come non stop or you get none at all. Not sure ill be playing much more. Extremely glad I didnt spend a cent on this game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "On the first quest after getting the overseers office and sending dwellers into the wasteland the game gets stuck on the zoomed in screen for the quest directions. this is not a quest you can skip and it will not let me back out to any menus during it. I've had it happen several times after reloads and re-downloads making the game unplayable, and with the age of the game i don't expect a fix.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "You don't have to like a person or agree with them or even mourn them. But to mock their death and lie about them (or maybe you're just really stupid enough to believe what you say....or a parrot...or a sheep) is wrong. This isn't about politics. This isn't about left or right. It's about wrong and right. I will no longer spend money on this or any of your other games because I won't contribute to the bank accounts of morally bankrupt humans. Uninstalling and will never play or purchase another game of yours.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Bethesda takes every opportunity to ruin our experiences and their own reputation.\nThe game is just another idle game with fallout branding.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Unfortunately a thumbs down.  Without the offline & unlimited cola/lunchbox mod, this game is basically unplayable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At the beginning the game is decent. mid to end game the game punishes you for advancing... i am trying to get the last couple achievments, have few to no quests to help, and get attacked every 5 minutes because i have over 100 dwellers.  Automation... ya they have it but if you get attacked they take damage and you cant heal them you just have to wait for it to die then waste caps on reviving the automation.  I would be willing to overlook all that but when you are being attacked if you move anyone they go back... even if the room is not being attacked... making the game a if your attacked wait till the attack is done to finish what you are doing....   The bigger your vault the harder it is to get bonuses.  Near end game i get on for 5 mins (trying to beat the attacks) to do the 60 clicks i have to do to accept training, levels, and see if anyone is done in the wasteland.  once i get the achievments to complete this game i am looking forward to uninstalling the game.  Oh and if you are achievment hunting you have such a low drop rate of legendary dwellers that you can play for 6 months and not even put a dent in the 20 legendary dweller quest..... \n\noverall i fell this game is more of a punishment to play and progress then to play the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Companies who support employees that call for political violence and their parent companies will not be tolerated. Do not give Bethesda nor Microsoft your money until they disavow the violent rhetoric.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I want to like the game but there seems to be some massive flaws in the pacing.\nTried twice now and shortly after starting and getting 12 dwellers, the game just slows to a crawl and nothing particular happens.\nOne of my dudes knocked up all 4 female dwellers and I spent the last hour+ waiting for them to plop out and increase the dwellercount so I could unlock more rooms and maybe continue.\n\nBut in the end I'll just do something else, Just staring at the screen while nothing really happens hours on end is not my idea of fun gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a slimey game. don't fall for the microtransacrions.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Games super fun in the beginning but when you spend more than 24 hours in it and finally get some more dwellers. Mole rats and scorpian's just attack ur vault 24/7 and gives either A all your people rads and kills all of them or b makes you waste all your stim's that take 30 minutes to make full;y upgraded with 4 people assigned to it. Oh also including the 1 hour wait time just to make 3 rad away's. Oh but no worry's you can spend 7$ in crates and revive all your players and get new dwellers with the money spent oh and weapons. This is nothing but a pay to win shitty fallout franchise game that honestly could have been sooooooooooo good. Pay to win don't play unless you got the bands to spend. Pretty fun if u wanna waste a ton of money tho.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun game, but shouldn't be this pay to win. Also having to log on like every hour is just not good design, had so much potential.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the chibi avatars make me forget what i did to gary.... maybe this run gary 52 will make me forget the bombing of megaton! Gee-whiz this game surely has fallout things in it, i guess? Maybe?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't say I recommend this. Having played every Fallout, I can only really say that this game is Stupid, as it lacks many of the core Fallout elements that made Fallout great, such as logic. Designed for Mobile, this game struggles with mouse, and being a PC game, the missing elements are Loud. Intro is good, Mid Game to End Game is Wrong. Strong Pass post Intro Gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ">Start vault for the first time and making good progress.\n>Alright, done for the day. Time to save and quit.\n>Apparently 'Save & Exit' doesn't mean the game is saved. Vault 580 gone forever.\n>itjustworks.jpg\n>Uninstall.\n>Finally achieve inner peace and enlightenment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cannot support a company that employs individuals who appear to sympathize with or condone acts of domestic terrorism. This crosses a moral line for me, and as a result, I will no longer purchase or engage with your products. I urge the company to address these concerns transparently and align with values that reject violence and extremism. Until then, I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "random farmville like free to play with broken game dynamics to push you to pay. dont bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is mainly just pay to win, unless you have all the time in the world, after all the quests, there is just nothing for you to do, it is not a terrible game itself though. Also, there appears to be ps4 controller compatibility, unlike on console.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game though it is rough in some edges though updating the game would at least make that unnoticeable which is why i couldn't recommend it. It is still a good game though",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst bunker game i've seen, no info of any kind, some random rad roaches show up and just kill 5-6 armed workers, drag and drop areas are all weird, what a waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game has a bug that eventually bogs down game play to a crawl then freezes, and its worse when not online. the game is just whack-a-mole and timer management with a fallout theme and things to collect. I only came back to it because someone said there may be an update in 2025, and i forgot how bad the freezes were.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is a pure money grab. you will have to spend a minimum 100+ hours to get the most basic stuff established and thats if the game doesnt kill youre dwellers because you cant get weapons or anything naturally you gotta buy it untill you magically get some somehow to go explore the wasteland so the dwellers run around and just die then takes HOOURS to days to get anough caps you revive one person out of many. absolute waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i played this game on mobile and appreciate the fact that they ported it to pc but the controls are unbelievably buggy. i would absolutely not recommend this game to others",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "loaded then closed the game now saying error and wont load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the steam version and computer version is brokeeeeeeennnnnnnn i had 4 hours on the verge of completing my goals and finally getting the overseers office and my whole vault deleted and disappeared my files arent even corrupted dont waste ur time down the pe smh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wouldve been nice to know that this version of the game doesnt get updates before i spent hours on it. thanks bethesda",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there are microtransactions, and the game feels rather slow. found myself just letting it run in the background while i did something else. not personally my thing ig.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashed mid game and wiped my whole savegame of 8 hours permanently. Thanks Bethesda.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely cannot stand this game. 3 times ive had my saved file corrupted. im never playing this complete waste of time again. i do NOT recommend this crap of a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent hundreds on Lunchboxes on the IOS and Android versions, and after one big update my vault would be gone and all that money wasted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So i just play this game again before that i play in handphone tooo .. and i really enjoy this game, makes mee remember old times UNTIL MY SHELTER GONE AGAINNN?!! like.. mann, i waste my time for create a good shelter and i get result my shelter is gone ?? uhh i hate this, in steam in playstore, THIS DISEASE CANT BE NEVER GONEEE IN THIS GAME, AGHHHHHHHHHHHHHH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "breeding high special parents does not make high special kids.... you get baseline kids plus one extra point.  that's stupid.  stopped playing after that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game on Apple that I had premium items on, they do not allow the accounts to be merged and is a total double down for players to purchase microtransactions; Not just a boring game but a scam.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't spend money on this game because of the bugs. Just play it for free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a  misery simulator made to grab more and more money out of your pockets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd recommend if it wasn't so innately designed to scam you into micro transactions worth FAR more than I'd pay for an actual indie game with way more functionality.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Greedy ass bastards stop updating 10+ year old games to try an introduce more paid mods. Actual fucking scumbags.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am so glad there are cheats for this game.  Don't give bethesda real money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't play it. Game closes when you try to pick a vault.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You guys update the mobile version but NOT The Steam PC version.... yeah... sounds about right!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It doesn't know what kind of game it wants to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "4/10, on phone it was good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "please update this game it has been years!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plz add Chinese language support",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "microtransaction slopfest",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "#1 most boring game in existance.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck I love mobile games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Real life poop from a butt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Done with BGS's BS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the only reason im giving a bad review is because i had a vault 2 weeks old and when i woke up today it was gone. nothing. not even a save file left :'''(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "eh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bethesda is not updating this game like they updated the mobile version of it. Do not play this until they update this Steam version.",
      "voted_up": false,
      "votes_helpful": 83
    },
    {
      "review": "Firstly you release a great game then you don't update this fun game on steam which was ok but I was disappointed then to put salt in the wounds you delisted the game instead of releasing a patch to fix the issues with hackers and malware issues with the engine. SMH.. I am disappointed in you and probably the community would agree with me on this. Over all the game was addictive and time consuming but fun with endless looting and missions to get and reach. I mostly play on phone version because it feels modded vs this version that feels like OG Vanilla version. We don't get updates, Promotions and support or team ups with the Fallout TV Show from the devs on steam which is crazy sad and weird to have two different versions.. \nPlease fix the game and patch it and release the game with updates! \nI will maybe change this review in the future after ( Fallout Shelter is no longer available on the Steam store) Tag is gone.. SMH..",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Unless you pay actual money this game gets extremely frustrating. It lies about percentages. Everything is pure rng. Enemies dont scale in a cohesive manner. Random attacks either come non stop or you get none at all. Not sure ill be playing much more. Extremely glad I didnt spend a cent on this game.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "On the first quest after getting the overseers office and sending dwellers into the wasteland the game gets stuck on the zoomed in screen for the quest directions. this is not a quest you can skip and it will not let me back out to any menus during it. I've had it happen several times after reloads and re-downloads making the game unplayable, and with the age of the game i don't expect a fix.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "You don't have to like a person or agree with them or even mourn them. But to mock their death and lie about them (or maybe you're just really stupid enough to believe what you say....or a parrot...or a sheep) is wrong. This isn't about politics. This isn't about left or right. It's about wrong and right. I will no longer spend money on this or any of your other games because I won't contribute to the bank accounts of morally bankrupt humans. Uninstalling and will never play or purchase another game of yours.",
      "voted_up": false,
      "votes_helpful": 17
    }
  ]
}