{
  "positive": [
    {
      "review": "After playing 100s of hours of WH3- I can safely say WH2 does a couple of things better:\r\n\r\n1. The campaign is much better as a narrative journey. \r\n2. The campaign map is lovingly brought to life with an artistic flair WH3 lacks. \r\n\r\nJust my 2 cents.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I spent way too much money on this thing. I hate micro payments, but I did it anyways.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It has fun, unique game play. The final battle for Vampire Coast in the Eye of the Vortex campaign is magnificent.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "great game. Strategy is good, balance seems decent (only tried a handful of factions) and campaign has high replay value. Could easily put 500+ hours into this without repeating any content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun gameplay, lots of factions, and once you get the hang of it, fun and challenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will probably return to this one in the future not a bad game its just i prefer the 3rd one because of more factions and units and mainly because of the multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice variety and change of pace from more traditional total wars. However I wouldn't buy any of it unless it is heavily discounted, the DLCs (from warhammer 1 and 2 -_-) flesh it out and complete it... there are soooooo many and so expensive if you don't wait for a sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very good game, I have played Total War series for a long time, and this is a special edition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Total War game, a lot of variety. I dearly miss the siege battles of previous titles however, missed opportunity to not put the work into doing them right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an amazing game... It can get repetitive, but seeing a dragon set things on fire never gets old!! :-D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best WARHAMMER Fantaasy game ever made (And i played Vermintide 2 on PS4). Probably, my favorite Total War game.\n\nDon't play Dark Elves in your first run by the way...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Allora, partiamo dal principio. \n\nSe pensavi che guidare un esercito fosse difficile, prova a farlo quando metà delle tue truppe sono goblin urlanti, l’altra metà draghi sputafuoco e il generale continua a inseguire due imbecilli in rotta.\n\nLa campagna è un delirio meraviglioso, tra strategia, diplomazia e intrighi politici e allo stesso tempo cerchi disperatamente di ricordarti se il verde tra i nani è alleato o nemico.\n\nE i combattimenti? Non è raro ritrovarsi a pensare: “Ok, sto per vincere!...No aspetta...\"\n\nLa cosa migliore? è un caos organizzato, una sinfonia di distruzione e comicità\n\nIl secondo capitolo è un capolavoro di strategia e fantasia.\nPerfetto per chi ama combattere, ridere e occasionalmente piangere mentre il caos domina il campo di battaglia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warhammer 2 delivers with perfect blend of action and strategy with a unique total war experience. Just when you think you have everything under control a new enemy makes you find a new strategy. This has become my personal favorite Total War Title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. If only they'd stop making everyone so mad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing strategy game and very well developed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "triple t sahur is a secret in this game on the Diddy blood's calculator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Late to the party... Great game... Huge investment... Hope 3 doesn't leave me bankrupt...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say, it was an instant classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you're looking for a fun war game that will run on basically any pc then this is the best choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming back to play this Total War game is still so much fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love warhammer, and I love strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, wish every faction wasn't dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I keep coming back to this one after playing the third one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best RTS in the past 20 years, 280+ hours in...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game rocks. what else is there to say?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is now among my favorite games. a MUST-HAVE for WH fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just when you think you know it all, play another faction.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's simly the best warhammer tw.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Who could not love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's got it's flaws but it's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "at least this won't random crash like the III",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i really like the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The golden age of TW : warhammer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gaem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and unique",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yep 90$ in DLC I LOVE THIS GAME!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SUMMON THE ELECTOR COUNTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "purfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "warhamer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BALTAaAAZAAR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little late with reviewing this game since its 3 years into the launch... of the 3rd game in this series but better late then never. Great game that really pushed the bounds of the first one. First they made the mortal empires map which is a huge achievement and really only surpassed by the later immortal empires (although that one seems to have pushed game 3 to its limits and is not stable at all) in scale, scope and looks. Secondly the faction variety is excellent, although a lot of that is in the DLC and game one factions but hey its kept me engaged all its life spans so I have them but worth remembering still, but saying that I imagine you can pick them all up on a sale quiet cheap now. Third is the game play itself which is snappy responsive and really captures the feeling of controlling a massive army and arguably better then even the table top game itself although you play TT for entirely different reasons then you do video games. forth is the modding community and the vast VAST amount of additional content it has created for the game ranging from entire new factions such as the Nagash mod that was added after game 3's launch and others favourites of mine such as Lily's bretonia overhaul, Xodads heirs of sigmar mod, Venris's SFO (although dont really play that one anymore but it gave me a good 500+ hours of gameplay probably way more so should mention it), and many many more on all different scales from big to small.\n\nSaying all of this the reason I decided to even review a game so far past its launch and end is that I want to highlight the places that this game still far out shines the 3rd in this series. The units just flat out respond far better, as in game 3 their seems to be a half second to a full second where they will not respond I have no idea if this was intentional but considering game 3's stability issues I assume its due to how overly taxed the game is now although that leads nicely onto the next point. Communication for development and problems that crop up as it feels like we get left in the dark for months on end, although since shadows of change they have somewhat improved this, but their are still lacking and maybe its because of the amount of issues or maybe its because they don't have enough staff anymore after the mass lay offs but some issues that from what creators on youtube say on occasion who do some QA stuff are reported before patches/DLC launch are never addressed at all before or after. Which finally gets me to my last section which is how those at the top have completely dragged this once pinnacle of what modern grand strategy into the mud as most of these issues arouse after SAGA announced its mass lay offs which hit CA very hard and resulted in industry veterans been lost that where ESSENTIAL to keeping these games alive and healthy. Many of the issues above from an outsider can and probably are summarised best by they don't have enough staff to keep us properly informed or collect and analyse issues to then be communicated to the player base, they probably don't have enough devs and coders to meet these dead lines they keep making and failing to meet for DLC and updates, and I'm certain that they don't have enough staff to not be crunching those that they do have as if there's one consistent thing about the gaming industry that hasn't ever changed in the 20+ years I've been aware of it its that real people are crunched endlessly to make and maintain these games people love and crunch results in real harm for these real people who are never even given proper recognition for it. This is all happening and more and why is it like this? Because some rich people who most of the time has no interest in these things they leach from decided that they want more so they ruined 100's of people lives and sacked them just so they could then funnel profits into their pockets all the while they did nothing to make in this instance the Total war warhammer series as non of them had a hand in coding, making art and assets, conceiving the systems, any of it. They just decided one day they wanted MORE and deiced to suck the life blood from CA which has resulted in it been left in the current state it is. These people at the top add nothing to the design process or our world in general, they are useless parasites who take and take so they can then use that money not to survive, but to then take more in other areas of the world such as buying up more property to then cause the current housing crisis's we see across the planet now in what should be a blessed age given the advances in technology and the stability those who usually make up the rich had in their life times afforded by their parents who fought in a world war to make that stable time period, but instead we are here in this time...\n\nAnyway.... got a bit carried away at the end there but point is I love this series, and I write this because I want to get back to that time where things where better and improving not this time where we struggle to even keep good things good after they come out (looking at you Darktide and Space marine 2, bloody live service tripe). In writing this I want us look back at when times where good and what made them good and focus on doing more of that and less of what ever is going on to make gaming and the wider world been honest so crap. TW Warhammer 2 was a great time I put 6774.6 hours into it and that's with me not touching the game for years now, it was given a great review by one of the great legends of the modern internet era John Peter Bain also known better as TotalBiscuit and even after his passing and the issues that cropped up in game 2 development cycle that positive review still holds up, his WTF is Total War Warhammer 2 still holds. To cap this long rant about the game I've put the most playtime of any game I can think I've ever played, good stuff great memories, great work by great humans, would like to see a return to this and a better fight put up against those at the top that dragged it down into the mud where the series currently is today with Total War Warhammer 3.\n\n(also sorry to anyone who felt compelled to read all of this, dyslexia go BRRRR, and this is mostly for me to get some feelings I have towards the gaming industry and wider corporate run world we are forced to exist in, and because I realised after seeing a friend post a review for a game he put 3800 hours into its weird I never put one for a game I spent 6700+ in so better late then never)",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "The DLC for this game is much cheaper now than it was on release. A major benefit since 3 is now the focus for all the new content.    \nIt runs much smoother and has lower system requirements than it's successor. \nIt's a smaller map and easier to understand. The narration at the beginning is better, if you are interested in the lore. The narration is similar to Shogun 2. \nThe art style is much more gritty than it's more cartoon-y successor. \nThe AI is more responsive and fluid. You have to worry less about a unit not following your orders like in 3. The enemy AI is more aggressive. \nTotal War Academy still has all the old YT videos for you to look at to get an idea of what means what and how things work.\nThere's less factions than it's successor and it has less endgame crisis but it's more of a loreful experience in return. \n\nPlay 3, if you want an excellent multiplayer experience. Play 2, if you want to immerse yourself into the world of WHFB. \n\nEdit: At the time of writing it costs $104.72 USD for everything to play in Warhammer 2. This is before any discounts are applied when CA or Steam have a sale which will decrease the price even further. \n\nWarhammer I Collection Bundle $46.58 (-66% off)\nWarhammer II Collection Bundle $58.14 (-66% off)",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "This is the best Total Warhammer game. You don't need the other two - the best factions are right here. The best campaign map is here. 1 is too small. 3 is too big. 2 is just right.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "[h1] 7.5/10[/h1]\nBest total war warhammer game out of three, turns get really long towards the end game and its a bit too much wait time, but other than that it is fun, its hard to get in to for new players. overall enjoyable total war.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "So I own all 3 games in the TW:Warhammer series and all of the DLC's. I've been playing since the first one launched back in 2016, so buying DLC over the last almost 10 years wasn't as daunting as someone new looking at getting into these games. \r\n\r\nI have recently gone back to this game because I truly believe it is the strongest entry of the series and I only say that because it built upon everything great that the first game already had. TWW 3 at this point just feels like 2 steps back in terms of quality. Every update they push out, 2 or 3 game-breaking bugs pop up. Also, the UI in this game and the 1st installment are impeccable compared to the over-simplified and \"toned-down\" UI in the 3rd game. TWW3 honestly just looks and feels inferior. \r\n\r\nOnto the factions: Yea the different Chaos factions are cool and do I miss not being able to play them? Sometimes. However, Between this game and the first, you get all of the lore-heavy good vs baddie races from the Warhammer universe. \r\n\r\nLet's talk about Immortal/Mortal Empires game mode now. In this game, the map still feels very large - down to regions. The color pallete and textures of the overhead map look great as well. In TWW3, however, the world looks and feels smaller; i.e. regions were shrunk by the developer AND they made the terrain look slightly cartoony almost. Hard to explain but there was definitely an art choice made that makes it look worse IMO. \r\n\r\nI stand by my opinion that if you want the best TW:Warhammer experience, then wait for this game and the 1st to go on a heavy sale and stop there. TW:Warhammer 2 is the best in the series to date.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Best Total War game since Medieval II. Great diversity of factions, runs well and offers a good mix of fun and challenge. Still miles better than Warhammer 1 or 3!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Seeing the state of Warhammer 3 makes me appreciate this game so much more. This game started weak but by the end of it’s development became a truly great experience which I can wholeheartedly recommend. I do recommend waiting for a sale for all the dlc though, costs a small fortune",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The only strategy game where my grand plan to unite the world collapsed because a giant rat pressed the ‘summon nuke’ button.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "After playing 100s of hours of WH3- I can safely say WH2 does a couple of things better:\r\n\r\n1. The campaign is much better as a narrative journey. \r\n2. The campaign map is lovingly brought to life with an artistic flair WH3 lacks. \r\n\r\nJust my 2 cents.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Big improvement over the first game and lots of campaign variety here making it one of the most content rich Total War games in the series history.  Hundreds of hours in addition to the DLC which add another 30+ hours per faction.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Good game you can play fun battles with your friends and on your own. Very high quality.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "It's worth it I guess. \r\n\r\nThe battles are much more fun in this game than they're in TW: WH3 and the simple reason is that, you can actually watch the battles.\r\nIn WH3 it's just a clickfest.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I spent way too much money on this thing. I hate micro payments, but I did it anyways.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Ignoring the fact that it took me like 6 years and 100+ hours to beat one eye of the vortex campaign. This game is, in my opinion, the quintessential total war experience and kind of an excellent entry point for RTS newbs like me. If you like the idea of RTSes but are worried it might be too much for you, give this a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My introduction to grand strategy, well not really the first one was but I played this more. Each DLC is worth it and adds more factions and mechanics to play around with plus some short campaign stories. I always wanted to try grand strategy but most really bored me but I love fantasy and that was the push I needed and this game is worth all the time and money I put into it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Warhammer 2 was my first experience with the Total Warhammer game and I have had a blast with this one. Playing as the Lizardmen (my favourite faction) is fantastic here. The map, UI, graphics, campaign, and battles are arguably the best in the series. The Vortex Campaign is also a great time, I wish Creative Assembly would make more of this sort of scripted and/or quest oriented campaigns. While the sandbox style is fun I enjoy the cinematics and custom feel of each faction here as compared to in Warhammer 3. I think this game will age well and it is still fun today to dive in and play through a campaign.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best of the \"modern\" Total War games. Lacks some mechanics and depth of older titles, but makes up for it by representing the world of Warhammer Fantasy in the best way possible. This game is finished, updated, reasonably polished, runs great, looks great and we even have some nice mods from the community to fix the rough edges.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Tons of fun. Have not even played a multiplayer battle . Would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It has fun, unique game play. The final battle for Vampire Coast in the Eye of the Vortex campaign is magnificent.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "great game. Strategy is good, balance seems decent (only tried a handful of factions) and campaign has high replay value. Could easily put 500+ hours into this without repeating any content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got the Total War formula right and the diversity in play styles gives this game hundreds of hours game play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun gameplay, lots of factions, and once you get the hang of it, fun and challenging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will probably return to this one in the future not a bad game its just i prefer the 3rd one because of more factions and units and mainly because of the multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice variety and change of pace from more traditional total wars. However I wouldn't buy any of it unless it is heavily discounted, the DLCs (from warhammer 1 and 2 -_-) flesh it out and complete it... there are soooooo many and so expensive if you don't wait for a sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very good game, I have played Total War series for a long time, and this is a special edition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Total War game, a lot of variety. I dearly miss the siege battles of previous titles however, missed opportunity to not put the work into doing them right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an amazing game... It can get repetitive, but seeing a dragon set things on fire never gets old!! :-D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best WARHAMMER Fantaasy game ever made (And i played Vermintide 2 on PS4). Probably, my favorite Total War game.\n\nDon't play Dark Elves in your first run by the way...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the vortex campaign and the factions in this game are much more interesting that the factions in warhgammer I in my opinion. Elves unit variety is much spicier than Dwarver early game unit variety. Great game, especially as an expansion to Warhammer III's immortal empire mode (that combines all 3 games)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came into this game near the end of it's life after all DLC's and it is phenomenal. CA historically have ups and downs during the lifespan of their games with iffy DLC's but the final product as a whole is spectacular. The third game in the series will eventually reach this level when CA management finally just let devs do what they need to keep the game healthy but until then, I'll gladly keep playing the second.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its basically the same as the first game. if you like big battles its good. the turn based campaign map is also quite decent, though i would prefer a story based campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game, most TW games are. I just wish they would put more effort into introducing players to the Warhammer Fantasy universe because 99% of the time I've got no idea what's going on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "book of grudges check,axes check,oh yeah its slaying time!-picked up all 3 games on a sale loving it so far i would recommend to all enjoyers of strategy games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still love the warhammer series, yes there are less updates in the 3  at thw moment, but for someone who havebt played before, i think the 2 iand some of its DLC is still a very good starting point, depending on what races interests you! I have played more than 400 hours and i enjoyed all of it, there is a lot of replayability. It is my first big strategy game I have bought and I really don't regret doing the leap. It was hard at first, but once you start understanding the strategies of battle, everything is well. There are often some sales, it's really worth it picking it up on sale. I also recomend the prophet and the warlock DLC for the people that are interested by skaven and lizardmen ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greetings!  Finally getting around to Total War:  Warhammer 2; even though I loved the original I was unsure what the second really provided that the first didn’t.  Did I find this to be true or does this add so much to be worth the new edition?  Let’s Discuss!\n\nGroundhog Day:  Unlike most RTS games this series doesn’t reinvent itself or really change all that much.  With that in mind, I’ll be reviewing this assuming you’ve already the previous title.  Same great game, yes really.  As best I can tell it’s literally the same game.  Maybe there were updated graphics?  Unsure but all the content is here (except one major thing which was addressed by a free DLC).  \n\nAll that Glimmers:  There is a ‘story’ campaign that limits the factions involved and has a story but don’t expect a cinematic masterpiece here.  I’d like to believe playing the other factions has a different perspective from the campaign, I’m sure it does, but I didn’t take the time and probably won’t.  Mainly because I just don’t really like the factions involved (except for the Tomb Kings, which tangentially are, probably because they didn’t want a DLC faction to be excluded from the game).\n\nPointy Ears are Dumb:  I’m just not a fan of the elf factions.  But seriously, the main issue with this is the lack of content.  As best I can tell this is a few faction packs with an expanded map; which adds more focus onto the open sea but lack any real sea combat (you apparently both paddle over to land to fight).  If you think about it pragmatically the game is worth the value with the new factions and the expanded map.  I can just see how someone might be slighted by the lack of a real ‘new game.’  Oh, one thing that really bothers me is you still can't disable DLC.  Or at least let me disable anything post launch.  It's annoying to see all this content I'm playing against but can't play with.   At this point the game should have a checklist type system, maybe even let me pick what factions are even involved.\n\nOverall, it’s worth the purchase.  Chances are if you are a Total War fan you’ll just buy all three of these and call it a day.  I’d recommend waiting for a sale of course as they are often and seem to be 50%+.  Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a reaally fun and interesting game with a lot of replaybility",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game just like the 1st one! however I recommend getting it when its on sale. 59.99$ is a pretty steep price point for a game that has been out for this long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though I don't like fantasy and fiction that much I had plenty of fun while destroying other elfs while playing as a an elf faction. (Elfs are an allegory for leftists and leftist infighting)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a long and great game, fun mechanics, i dont get bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um, yea. Total War. It never stops.\r\nWhen I play other Total War games, there is part of me that want to follow historical accuracy or cultural history. Not with this one.\r\n\r\nAnd that is a pro! Speaking of which:\r\n-Hero characters are done right. They are valuable units but not unstoppable, and their customisation is meaningful to the game-play.\r\n-There is a lot of variety in how you can play. Certain strategies fit certain factions better, but nothing is off the table.\r\n-The battles can be very detailed and immersive. \r\n-Most of the time you'll do better than the autoresolve, even clinching absurd scenarios. Its a fun challenge if not a bit \"ughh I have to fight this one manually no matter what\"\r\n-The story is more than good enough.\r\n\r\nCons:\r\n-It aint the easiest game to run at higher graphical settings, even to this day.\r\n-It's one of those games where a couple of DLC is required to make it truly re-playable and varied. And there's LOTS of DLC.\r\n-If you don't like to read, the learning curve is very steep.\r\n-AI at difficulties other than \"normal\" is either notoriously incompetent or does outright cheating\r\n-Total War: Warhammer III is out with just about the same ammount of DLC. If you like this base game, you are probably better off spending your money there.\r\n\r\nOh and don't bother with the \"Direct X 12\" setting. It's never worked properly!\r\n\r\nHappy conquering :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was skeptical at first about Total War making fantasy games. Truth be told I had no interaction with Warhammer at all. \n\nAfter 830 hours in the game, its ok. I would say you should buy it.\n\nJust my humble, but correct, opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic Warhammer game, the world comes to life. So many armies vying for supremacy and glory. A true masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best total war game ever made, tied with warhammer 3 for the first place, but for different reasons. This game was a passion project for the development team and it shows by the way they treated it. I personaly have the fondest of memories on the 2000 hours i have put in it and will forever be my comfort game when i need it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly awesome! I’ve been playing as the High Elves, and I really enjoy the new mechanic where your general can lead a one-man army. It’s something I’ve never seen in older Total War games like Shogun 2, and it makes battles way more dynamic and personal. At first, I thought sending a single hero into battle was risky, but it’s actually super fun once you get used to it.\n\nWhat I also like is how each faction feels different now — the new systems really push you to play in your own style instead of following the same pattern every campaign.\n\nThat said, I do agree with some other players: city battles still need more work. Fights in unwalled cities don’t really feel like you’re inside a town, unlike Total War: Attila where the urban layout made battles look more immersive. Even without adding full defensive systems, a more city-like environment would make a big difference.\n\nStill, despite that, this is easily one of the best Total War experiences I’ve had so far — and I hope CA keeps improving it in future updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is an amazing games. i would recomend getting 1 and 2 to have access to more factions. overall 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So I got a little frustrated at first with this game. There is a bit of a learning curve but once you kind of get it, it's fun to play through. Had a good time recommend it. I think the secret sauce is finding an enemy close by you can beat up on until you raise your level high enough to just melt face.  Lizzard men are my favorite so far. Their dinosaur armies are so dang OP its almost cheating.  \n\nMy first review: You are being attacked by like 5 different armies from different factions every time you do a god damn ritual. It take s forever to build back up a settlement every damn time you lose one. I don't get the strategy of it unless your just supposed to stay on your damn island and defend the whole time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "view features don't exist in Warhammer 2 unlike Warhammer 3, like giving settlement and probably more idk. but this alone is enough to have a taste of every aspect from total war warhammer series. then, buy Warhammer 1 and 3 when discount",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Only buy when EVERYTHING all the 20 DLCs and the game are available for like 40$",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "60 euro to only be able to play with 4 factions. You need to have Total War Warhammer 1 to be able to play Mortal Empires. EA is having serious competition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tutorials are awful and unhelpful. Auto-resolve is inconsistent and makes zero sense stat and outcome wise. Game just expects you to know every last tactical strategy and even that isn't even correct 90% of the time. I don't care if my review gets jester emotes or whatever, I'm not gonna waste hundreds of hours of my life learning a game from a developer that can't even be asked to insert a linear tutorial that makes any practical sense, and no a geriatric narrator who puts more flare than advice on his directions does not count as sound advice.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Playing for the okrs - my favorite faction. Starting Waaaagh! crash game with 50% chance... Ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I will not be purchasing or playing the 3rd game as the developer is leaning into the demonic way too hard. The latest Total War releases have also shown a significant drop in game quality and I am concerned about Total War: Medieval 3 or Empire 2 which I dream of coming one day. I hope that CA and SEGA can figure things out before development of any other historical Total Wars begin... or any installments for that matter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is an exercise in frustration. It could simply be that I don't have enough experience with it, but man is it difficult to figure out. I don't think I've ever seen a strategy game with this steep a learning curve. Things that should be simple and make sense, do not. Even with an \"easy\" level campaign, my troops always lose to enemy troops that seem to permanently be stronger than anything I can recruit. If I don't expand fast enough, the game punishes me with campaign events that count against me. If I expand too fast,  the enemy factions simply crush any new cities I take.  I have had battles where I bring DOUBLE the troops compared to the enemy, and I still I lose because they magically do 5x as much damage as I do.  The first enemy faction I fought seemed equal to my own, and manually controlling battles meant I would win. However, after that - every enemy faction wiped the floor with my troops like it was nothing. \r\n\r\nI honestly do not understand how some people spend thousands of hours in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best Total War Warhammer experience you can get. However that isn't saying much. If you are a Warhammer fan, like spectacle or/and aren't looking for a game with depth or ambition (maybe you are new to these sorts of games), buy it.  If you are more into strategy/ real time tactics and well thought out game design beyond small stat adjustments between units do not buy it. There's a screaming reason as to why I keep going back to the older titles after buying any of the new ones.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is almost 10 years old and you still askin players to not only buy this game and its dlc, but also the first one and ITS DLC to have a full experience, lmfao, is 3 that bad? jfc just make the first one free at this point, yall made yo daggum money already...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unless you are very speciffically looking for this type of game (total war in general) avoid this. Single most frustrating experience in my life. I came in blind because I love warhammer and oh mygod did I regret it. Watch reviews and live plays before you get it. This is not a relaxing game, you need to inform yorself very well and do a LOT of reading. I made a mistake in not researching before buying. Got ground into dust at every turn, hated it :p.\r\n\r\nI'm sure its a great Total War Tittle though...just turns out I hate Total War games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A couple years ago I bought all 3 Total War: Warhammer games in a decently discounted bundle and started playing them in order. I didn't go through the ups and downs that most people who bought around release went through, so enjoyed all 3 games (in hours, roughly: 50, 100, 1000 - respectively), and each one was better than the last, despite any changes to campaigns, difficulties, skills & technologies. Since TW:WH3 was the beset of the 3 with many \"quality of life\" improvements, I mostly played that after finishing with 1 & 2. After lots of time, and getting fed up with the bugs and other annoyances, I decided to give TW:W2 another try. Let's see.\n\nIt has performance issues like stutters / bad 1% lows. I'm on a 5060 Ti, not high-end, arguable if it's mid-tier, and playing on 4K which is clearly not the best for the hardware, BUT it runs worse compared to TW:W3, even though I have REALLY lowered the settings for TW:W2. The unit counts are smaller even on ultra, and I play on lower settings too (medium/low), compared to every setting being on high for TW:W3 and having nearly double the unit counts.\n\nThere are some nice things though. I like how the campaign maps way more. I only saw two maps (one siege and one field battle) and they were different than the maps I've seen in TW:W3, not sure if I'd say they're better or worse, but I am very tired of the TW:W3 maps, so maybe the old TW:W2 maps are a breath of \"fresh\" air,\n\nThe QoL improvements from TW:W3 are really noticeable too. If you've played TW:W3 and want to try TW:W2, you'll likely be annoyed and may enjoy it less. If you're new, maybe consider getting TW:W3 instead, or better yet look for another game since...\n\nTW:W3 is absolutely riddled with bugs, which why I wanted to try TW:W2 again. Based on what I remembered, TW:W2 didn't have any major bugs and it was pretty smooth, and everyone keeps saying that it is a \"finished game\". Guess my surprise when on turn ~4 I play a siege battle only to discover that some of the same bugs as TW:W3 are here too (siege & gate bug, units dispersing, pathfinding). On one hand, it shouldn't have surprised me, because the same company is developing roughly the same game on roughly the same engine. On the other hand, some of these bugs in TW:W3 didn't seem like they were there 1-2 years ago, so it *feels* (I don't think it actually happened) like these errors were \"backported\" somehow to TW:W2. Obviously, CA doesn't care very much about fixing bugs in TW:W3, so they won't care about TW:W2 having bugs either.\n\nSo definitely don't buy this unless for whatever reason you there is some locked content you want for TW:W3... but again, why give CA your money? I didn't buy any DLCs, and I'm likely never buying another TW game ever again. I *almost* believe Ubisoft deserves your money more than CA. Maybe you can try the latest Anno or Europa Universalis games? Or not, up to you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The world is much bigger compare to TW: Warhamster I. It becomes boring after quite a short while, as the conquering mechanisms stay the same. Auto battles are practically impossible to win, unless your army is fully healed. One is forced to fight even the most meager battles by hand, not to lose an army. I find that extremly tedious.\r\nFor my tast it is much too big, way too clunky to manage 50+ towns each turn. Also, one is forced to pay billions og $ or € to be able to play all fractions available. Can't recommend that kind of policy by Games-Workshop. A big minus in my book. Can't support that kind of a policy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "should have strategic layers like sky/cave/surface.  diplomacy is tragically bad, movement is too high.  wish this was more of a strategy and less of an arcade beat em up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am an avid fan of the Historical titles, I really cannot tell when it was starting to get fun, twice I tried a campaign and got bored of mauling army after army that suddenly appeared on my land, with no prior explanation, without even land, and not even a nomad faction, economy is fucking weird, I want to reestablish an empire, and couldnt even afford 2 armies so I had to run around with the prince or whoever. I'm redownloading rome 2, I'm REALLY tired of mediocre strategy games, this and xcom 2 were my last \"you have to play it is so good\" trash games. Xcom 2 was worse because it's hard, but still, don't bother.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Locks your DLC until you have an Epic games account. fix this then youll get a positive review",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just watched a bullular news video and want to punish this company for their greedy, incompetent decisions. Only way I can is with a negative steam review so I will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried playing Empire. The Skaven will have about 15 Armies on the field all attacking and taking your settlements while you try to do damage control with the three weak armies you can muster with your lack of funds. This game sucks. Warhammer 1 was much better. Hope 3 is as good as 1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wow have to buy every faction to have any fun....i use to like total war fran.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When I play in campaign mode, I can't play the same campaign on two different laptops. \r\nAlso the problem is that after I reach a turn 100 for example in campaign mode the game decides and delete my whole campaign. \r\nMy experience is not very good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CA, per usual, dropping the ball with AI tactics. The ever elusive \"single file flank through un-navigable terrain\" continues through the ages.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "installed the game resntly and all DLC  are unavailable, wont even let me click on the buttons to ''claim them''. Fuck this game, Fuck creative acembly and fick me for paying for this utter trash heap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requiring the 1st game to be able to play as the Empire in the 3rd game, knowing that's what most players want to play as at some point, is incredibly scammy",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "You have to buy all of the games and ALL the DLC (that costs heaps even when on sale) to have a fully usable roster.\nRidiculously scammy.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Only buy when EVERYTHING all the 20 DLCs and the game are available for like 40$",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "the game is fun but It has this issue where if you launch it after a few days it buggs out and doesnt let you play with all your dlcs. I have warhammer 1 so I carried some over to this game, I played the game for 3 days and had a good save or two, I launched it today and it lost all my saves.\n\nWorst of all it wont let me play any other faction that I have through the dlcs, from both the first and second game.\nI tried to reinstall it, check the downloadable content, I checked the download files and nothing,\n\nIt feels so shity having to struggle for a few hours to get your game working just because it bugged out over night.\nIf I get it working again I might change my review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Non-intuitive layers of cruft to get at the good stuff.  Technology and city management are tedious.  Especially at higher resolutions as the game does not scale its UI well at all.  \r\n\r\nQuick battles are fun, that is about it for myself.  I'd rather play Endless Fantasy with less epic battles for a fantasy 4X experience all day, but the detailed battle scenes are pretty epic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its ok except once WH3 released Creative Assembly dropped WH2 like an ugly baby and left at least one seriously bad bug in the game PERMANENTLY.\nThis game really needed one more patch.\n\nThe bug that I'm talking about is the one where the enemy battle AI is inactive when they get ambushed, which completely ruins the gameplay and the challenge for factions that naturally fight lots of ambush battles, for example, skaven.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "All total war games are not playable without A LOT of mods. The AI just cheats and attacks you when you even start to send your army off to conquer anything. To win battles against the AI, it replenishes its armies in 1-2 turns and their stats in battles are just higher than yours. This just makes it so you have to know how each unit does vs each unit. It becomes a \"have you played this game long enough to know all the match ups to win\" check. Feels terrible. Then you need to buy each to get each campaign. CA and Sega made way too many overpriced DLC's to give you 1 or 2 generals per 18 bucks. its the same campaign for each general, they just have a different spot on the map. This has the potential to be the best game made by the company, however it never will be.  Granted this is the best game out of any of the total war games, its not right to charge people 60 bucks 3 times then also have 100 bucks of DLC for each game. It's wrong and you should leave a negative review on all 3 of them to get CA to change.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still runs like garbage, still 5-8 min long loading screens,units/battles and Campaign still not balanced or fun without being so heavily modded its not the same game and adds another 5 min in loading screen, still extreamly over priced, minor bad factions locked behind DLCs years after game has died, Anything Games Workshop touches runs like dog water while still asking for more money for content, do not buy this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Creative assembly is an inherently anti-consumer business and you should avoid it at all opportunities. They delay fixing critical issues, overcharge for lacking content, and will do everything within their power to rob you fucking blind should you let them have the chance to do so.\n\nSave yourself the time, energy, and money and invest in games and developers that actually give a shit about the end-user and customer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It isn't worth it. Not even for the setting. There are better strategy games, there are better warhammer games. Don't support CA because they're just going to keep making garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Should not have had to buy the game 3 times and also separate purchases for all DLC. Game doesnt run well in 2025 even.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After launching, unable to click anything to progress. Don't you miss the days when you bought a game and it always worked...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Copied over from Warhammer III. I own all of them.\nAs of right now, the game is decent. But be well aware of CA's questionable decisions in the past. They did demonstrate that they are not to be trusted. I'm perfectly willing to change this review again if they mess up. Again.\n\nTotal War community says hello.\n\nWell. They screwed up again. Double standards are not acceptable, the same goes for broken factions.\nTime to change positive to negative. Again. This is the last time to change this review.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "When I play in campaign mode, I can't play the same campaign on two different laptops. \r\nAlso the problem is that after I reach a turn 100 for example in campaign mode the game decides and delete my whole campaign. \r\nMy experience is not very good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CA, per usual, dropping the ball with AI tactics. The ever elusive \"single file flank through un-navigable terrain\" continues through the ages.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Playing for the okrs - my favorite faction. Starting Waaaagh! crash game with 50% chance... Ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "installed the game resntly and all DLC  are unavailable, wont even let me click on the buttons to ''claim them''. Fuck this game, Fuck creative acembly and fick me for paying for this utter trash heap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed the game for a few years. You want a decent machine to play on, as the loading between battles (start and finish) was significant. I finally upgraded my machine and the loading is now a non issue.  This made me consider buying WH3 at the last sale and the other expansions I don't have. However, l watched some youtube videos, and legendoftotalwar dropped a video of the state of the game. LOTW got me into the game to start with. All the bugs and issues still in the game made me reconsider, and I did a summary of the the issues I have in WH2.\n\nI play as the dwarfs, but own most of the other DLC to support the game. \n\n- your allies bug out.\n         - you can select targets for your allies to attack. However, my allies bypass the last remaining region they don't have in a province and go attack a region 4 provinces away to stop me claiming it and getting the regional buff. They were not at war with the faction that owned the settlement when they departed, yet at war with the targeted faction.\n         - if your allies are at war with a faction, and the enemy gets confederated, the ally refused my offer to join war against the \"new\" enemy. So now I have an enemy as a neighbour, and my ally does nothing. I can take the settlement, but now I own 1 out of 4 regions. I can abandon the region, but my ally wont take it, and a 3rd party will claim it. I cant do nothing with the settlement as the growth is so slow. I am a top 5 power rank, the enemy and ally are between 40 -> 60 power rank.\n\n- Race legendary lords refuse to confed with me. I have over 400 rating with them, they are down to their last settlement and just get wiped out over the end turn. I had tried to confed them the previous 20 turns when they had 5 settlements and several armies. They kept getting weaker and then just died. I can never get the \"dream team\" going.\n\n- The underway - a 3 way unique feature (dwarves, skaven, orcs). The path is a bumpy road, uneven ground, random small hills. The dwarves cant see over it and you have to check each unit of thunderers / iron drakes line of sight, otherwise they stand there and do nothing if their view is blocked (the units wont advance to attack). There is no way to smooth out the underway = owning the province you're in etc. An army of miners to spend 5 turns clearing up the path etc.\n        - due to the units lack of height, and the line of sight issues, there is no alternative aside from the basic quarrellers and grudge throwers / flame cannon. The humans have mortars. What a weapon this would be in the dwarves roster. \n        - cannons and organ guns - line of sight issues again.\n        - the cannon in some settlement maps - can't shoot over the wall, yet the front gate is right next to the city square. A useless unit.  \n\n- The \"fun\" was removed. I use to enjoy putting several Master Engineers into an army to boost the range of units through their skill tree. Having a few flame cannons out range other artillery was fun. Iron drakes with flame throwers reigning hell down on enemy forces. LOTW did a doom stack video going up against elves with dragons and destroying the army, next patch, the skill tree was reworked. The skaven were still able to stack their range skill buffs.\n\n- skaven summoning - there is no counter other than to have your infantry/heros stand in amongst your artillery. Your front line is standing in your back line, and having a lack of speed, you cant get your front line back to the front line. You need to destroy these summons ASAP, otherwise they can destroy your artillery even while being attacked by your other units.\n\n- skaven settlements - every battle is the same map lay out for a settlement with walls. There are 2 non walled settlement maps with the same issues as underway battles, lumpy ground. \n\n- unit balance - my elite iron breakers can lose to a basic skaven infantry unit. It makes playing a balanced army pointless.\n\nIts a game and I want to have fun. But each patch removed a positive feature to where the game is a grind for the sake of being a grind. If you want the game to be lore friendly, cool, but make the units lore abilities even across the game. \n\nWH3 has a few features, buy settlements to have an alternative with incompetent ally choices. But there are too many bugs and non fun mechanics in the game to want to spend any more money on the franchise.\n\nI would like to continue playing this game, however, in the state it is now, I do not recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was pretty hype coming back to this after discovering some old content and lords like Queek got a patch beefing them up a bit, but I was very disappointed upon discovering \"No, actually, you only get these changes if you buy the game again. Appreciate your business!\"\n\nThe idea of updating content in TWW2 but then only making it available if you play that content in TWW3 is.. baffling. Why not just, yknow, apply that stuff to the game they're in? That seems reasonable to me - much more reasonable than tucking balance patches behind a paywall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Creative Assembly is a trashy company. They don't deserve your money. Furthermore, this game doesn't feel anywhere near as strategic as previous titles like Napoleon and Rome 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could give a positive review, but can't in good conscience. They're still charging for a lot for a game and DLC that they don't maintain meaningfully, put your money elsewhere until they change their corporate practices, which is highly unlikely as they have a long history of this poor behaviour.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Total War and Warhammer more than almost anything in games and fantasy. It's too bad that the companies that make both of these products don't give a florp about my family and I making it financially. The corporate world in modern day views loyal and faithful customers as cash cows and it's disgusting. Be better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is an exercise in frustration. It could simply be that I don't have enough experience with it, but man is it difficult to figure out. I don't think I've ever seen a strategy game with this steep a learning curve. Things that should be simple and make sense, do not. Even with an \"easy\" level campaign, my troops always lose to enemy troops that seem to permanently be stronger than anything I can recruit. If I don't expand fast enough, the game punishes me with campaign events that count against me. If I expand too fast,  the enemy factions simply crush any new cities I take.  I have had battles where I bring DOUBLE the troops compared to the enemy, and I still I lose because they magically do 5x as much damage as I do.  The first enemy faction I fought seemed equal to my own, and manually controlling battles meant I would win. However, after that - every enemy faction wiped the floor with my troops like it was nothing. \r\n\r\nI honestly do not understand how some people spend thousands of hours in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You sell game with broken factions, even DLC. You overprice DLC and expect us to buy it, even if we can suspect it to fail in future patches. Plus the DLC prices in last times are just compensation for HYENAS, FOR FKIN HYENAS!!\n\nSuch a sorry state of game with this much potential. What modders do in a few days you announce to LOOK INTO in future patch??? DO NOT BUY AMY DLC, UNTIL THEY ADJUST THE PRICE NOT TO REFLEXT THEIR FAILURES, OR THE DLC CONTENT HAS THAT PRICE.\n\nWhat do you expect from us CA? All those years of Warhammer 3 being out and you still did not learn anything. If some developers had so much big problems with game, they would apologise and REPAIR IT IN HOTFIX, as much as they could.\n\nSo sad...\n\nEDIT:\n\nYOU LIERS!!! You think, we are dumb? We were talking about unresponsive Lizardman and Tomb Kings AI, NOT THE RECRUITMENT!!\n\nI did not want to talk about it, but it very cruel from you, how you treated lehendoftotalwar. I know very well, it was not just you, but it was also because of you.\n\n\n\n\nBe ashamed of yourselfs managers of CA. I hope Sega will throw you all out of the business. People like you are The Reason we are not living in Utopia yet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I will not be purchasing or playing the 3rd game as the developer is leaning into the demonic way too hard. The latest Total War releases have also shown a significant drop in game quality and I am concerned about Total War: Medieval 3 or Empire 2 which I dream of coming one day. I hope that CA and SEGA can figure things out before development of any other historical Total Wars begin... or any installments for that matter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the best Total War Warhammer experience you can get. However that isn't saying much. If you are a Warhammer fan, like spectacle or/and aren't looking for a game with depth or ambition (maybe you are new to these sorts of games), buy it.  If you are more into strategy/ real time tactics and well thought out game design beyond small stat adjustments between units do not buy it. There's a screaming reason as to why I keep going back to the older titles after buying any of the new ones.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very good game & well made, & an absolute bliss of fantasy of Warhammer gameplay although ever since early 2025 the launcher has been a cancer to log in to, with or without mods/addons.\n(Besides all problems with the TTW  WH3 beside) The curent launcher of CA has been an extreme problem, as an example waiting 7-10min for it to toggle your game....in comparision to  a straight up .exe toggle of ur TTW game like MEDV 2 or others......this all occuring in a \"High-end PC\", when even an \"averavegely old laptop in 2020\" cold run it like butterflly in summer & all of the sudden it's a problem...\nAvoid this Game/Company until they fix themselves....otherwise this game is a BANGER of strategy & bliss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely unbalanced game. All other negative reviews are pretty solid for most part as well. My main complaint is it seems no matter what faction you play, you end up getting steam rolled at some point which bothers me. As undead, i had almost completely destroyed Reikland Empire. and then they confederate with Tala Empire (Tala is short for full name, its a odd name) and then i rolled all those provinces, 5 turns later, they somehow muster 5 armies, 1-2 main ones and 3 small ones, the small ones purposely move within the shady areas of the map making it hard to detect them or follow. Its not just as undead either, you could flip it and i bet same sort of thing would happen. I still dabble in the game, i just generally enjoy both 40k and Warhammer fantasy as a whole despite Franchise being very scummy and schemey. But its because i grew up on tabletop mini's back when the game was way more wholesome. Im not saying dont try it, but i aint saying go out of your way to buy and play it either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Jumping from Rome/Medieval etc to warhammer is not a fluid transition. The layout is completely different and cluttered. Some other mechanics and choices are questionable as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What an unintuitive interface. Playing games for 40 years and so much opportunity wasted here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is almost 10 years old and you still askin players to not only buy this game and its dlc, but also the first one and ITS DLC to have a full experience, lmfao, is 3 that bad? jfc just make the first one free at this point, yall made yo daggum money already...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unless you are very speciffically looking for this type of game (total war in general) avoid this. Single most frustrating experience in my life. I came in blind because I love warhammer and oh mygod did I regret it. Watch reviews and live plays before you get it. This is not a relaxing game, you need to inform yorself very well and do a LOT of reading. I made a mistake in not researching before buying. Got ground into dust at every turn, hated it :p.\r\n\r\nI'm sure its a great Total War Tittle though...just turns out I hate Total War games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Since I do not own Warhammer III, I'll leave a bad review here in protest for my affected fellow gamers because of the unnatended flaws in the third iteration of this game. CA doesn't give a f about player community, they just care about profit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A couple years ago I bought all 3 Total War: Warhammer games in a decently discounted bundle and started playing them in order. I didn't go through the ups and downs that most people who bought around release went through, so enjoyed all 3 games (in hours, roughly: 50, 100, 1000 - respectively), and each one was better than the last, despite any changes to campaigns, difficulties, skills & technologies. Since TW:WH3 was the beset of the 3 with many \"quality of life\" improvements, I mostly played that after finishing with 1 & 2. After lots of time, and getting fed up with the bugs and other annoyances, I decided to give TW:W2 another try. Let's see.\n\nIt has performance issues like stutters / bad 1% lows. I'm on a 5060 Ti, not high-end, arguable if it's mid-tier, and playing on 4K which is clearly not the best for the hardware, BUT it runs worse compared to TW:W3, even though I have REALLY lowered the settings for TW:W2. The unit counts are smaller even on ultra, and I play on lower settings too (medium/low), compared to every setting being on high for TW:W3 and having nearly double the unit counts.\n\nThere are some nice things though. I like how the campaign maps way more. I only saw two maps (one siege and one field battle) and they were different than the maps I've seen in TW:W3, not sure if I'd say they're better or worse, but I am very tired of the TW:W3 maps, so maybe the old TW:W2 maps are a breath of \"fresh\" air,\n\nThe QoL improvements from TW:W3 are really noticeable too. If you've played TW:W3 and want to try TW:W2, you'll likely be annoyed and may enjoy it less. If you're new, maybe consider getting TW:W3 instead, or better yet look for another game since...\n\nTW:W3 is absolutely riddled with bugs, which why I wanted to try TW:W2 again. Based on what I remembered, TW:W2 didn't have any major bugs and it was pretty smooth, and everyone keeps saying that it is a \"finished game\". Guess my surprise when on turn ~4 I play a siege battle only to discover that some of the same bugs as TW:W3 are here too (siege & gate bug, units dispersing, pathfinding). On one hand, it shouldn't have surprised me, because the same company is developing roughly the same game on roughly the same engine. On the other hand, some of these bugs in TW:W3 didn't seem like they were there 1-2 years ago, so it *feels* (I don't think it actually happened) like these errors were \"backported\" somehow to TW:W2. Obviously, CA doesn't care very much about fixing bugs in TW:W3, so they won't care about TW:W2 having bugs either.\n\nSo definitely don't buy this unless for whatever reason you there is some locked content you want for TW:W3... but again, why give CA your money? I didn't buy any DLCs, and I'm likely never buying another TW game ever again. I *almost* believe Ubisoft deserves your money more than CA. Maybe you can try the latest Anno or Europa Universalis games? Or not, up to you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad dlc practices by Creative Assembly. It is unfortunate that talent and creativity left their buildings. Devs and assembly/C wizards like the ones that worked on Shogun and Rome have carried this franchise so far and hard to come by.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I love this game and have played for many hours. However, i most definitely do NOT recommend it to a new player. It is made by what I consider to be a cynical developer with no respect for its player base. For one thing, the difficulty settings mean nothing. I just quit a \"normal\" campaign in disgust after 20 something turns because i was faced with enemies from 3 directions (and others on the way) with major units specifically capable of obliterating my main unit type. That type of scenario is usually reserved for late campaign. not what is really early game. So, stay away from this game. I've had it for years and have only seen it get harder since TW3. It's as if CA is trying to push TW2 players to the newer game (which is actually reckoned to be easier), but i refuse to give CA another dime,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Copied over from Warhammer III. I own all of them.\nAs of right now, the game is decent. But be well aware of CA's questionable decisions in the past. They did demonstrate that they are not to be trusted. I'm perfectly willing to change this review again if they mess up. \n\nTotal War community says hello.\n\nWell. They screwed up again. Double standards are not acceptable, the same goes for broken factions.\nTime to change positive to negative. Again. This is the last time to change this review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Thousands of Hours accross all of Total War franchise. This game sucks Total Ahh. Unforgivable mechanics like, unit upkeep not updating/adjusting to unit amount are a good representation of the elementary level of shits they gave while making this game. \n\nDon't waste your time re-learning a worse version of Total War. For the love of god, they don't even update/adjust unit upkeep based on troop count. Making troop replenishment vital, but you don't replenish troops during turns, unless inconsistent factors are hit (AFTER 15 TURNS, THE GAME DIDN'T TELL ME WHY UNIT REPLENISHMENT JUST WASN'T WORKING MOST TIMES, PLEASE EXPLAIN WHAT THE GAME COULDNT EASILY DO, AND COPE BELOW). Mount and Blade BannerLord 2 unit upkeep adjust with unit count, when they aren't even uniform soldiers but the excel spreadsheet of this game can't keep that up. lol\n\nThis game was fuckin gehh, because I was excited to play it, so just don't have expectation or compare it to any other TOTAL WAR games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The world is much bigger compare to TW: Warhamster I. It becomes boring after quite a short while, as the conquering mechanisms stay the same. Auto battles are practically impossible to win, unless your army is fully healed. One is forced to fight even the most meager battles by hand, not to lose an army. I find that extremly tedious.\r\nFor my tast it is much too big, way too clunky to manage 50+ towns each turn. Also, one is forced to pay billions og $ or € to be able to play all fractions available. Can't recommend that kind of policy by Games-Workshop. A big minus in my book. Can't support that kind of a policy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "should have strategic layers like sky/cave/surface.  diplomacy is tragically bad, movement is too high.  wish this was more of a strategy and less of an arcade beat em up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Finally remembered why I'd only played half an hour of this. Gave it another 2 hours to figure it out... It's RTS not turn-based... and pretty garbage RTS at that. They keep throwing subsystems at you with either way to much or nowhere near enough explanation... and keep telling me to recruit a hero, even though I can't possibly do that at this point. I'm just over it. Crap design, clunky game. Just give me Civilsation instead. I don't need the Warhammer flavor or the lies about RTS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am an avid fan of the Historical titles, I really cannot tell when it was starting to get fun, twice I tried a campaign and got bored of mauling army after army that suddenly appeared on my land, with no prior explanation, without even land, and not even a nomad faction, economy is fucking weird, I want to reestablish an empire, and couldnt even afford 2 armies so I had to run around with the prince or whoever. I'm redownloading rome 2, I'm REALLY tired of mediocre strategy games, this and xcom 2 were my last \"you have to play it is so good\" trash games. Xcom 2 was worse because it's hard, but still, don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just watched a bullular news video and want to punish this company for their greedy, incompetent decisions. Only way I can is with a negative steam review so I will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried playing Empire. The Skaven will have about 15 Armies on the field all attacking and taking your settlements while you try to do damage control with the three weak armies you can muster with your lack of funds. This game sucks. Warhammer 1 was much better. Hope 3 is as good as 1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "60 euro to only be able to play with 4 factions. You need to have Total War Warhammer 1 to be able to play Mortal Empires. EA is having serious competition.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My brain hurts when I play this game. I normally wouldn't have written this review but CA's celebration of their nostalgic hits whilst they abandon the historical playerbase that funded their company is a slap in the face too far. This is especially after they betrayed the 3 kingdoms fanbase\n\nI tried to enjoy Warhammer but the basic... experience I get from this game (immortal empires) is a confused mess. The diplomacy makes no sense, the economy is... pedantic to overpowered to irrelevant, I'm fighting things half in slow motion/pause and my brain just hurts from the color saturation. And to top it all of that, somehow despite being a AAA company the battle AI sucks.\n\nI used to love total war and CA, but short of some significant changes, I don't expect to be returning to this franchise.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Locks your DLC until you have an Epic games account. fix this then youll get a positive review",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "buggy, feel ignores for their heavily monetized new release. :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you need total war warhamer 1 to play all modes? yeah no",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dogshit series ruined by business degrees",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful DLC policy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fuck this company",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requiring the 1st game to be able to play as the Empire in the 3rd game, knowing that's what most players want to play as at some point, is incredibly scammy",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Only buy when EVERYTHING all the 20 DLCs and the game are available for like 40$",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "the game is fun but It has this issue where if you launch it after a few days it buggs out and doesnt let you play with all your dlcs. I have warhammer 1 so I carried some over to this game, I played the game for 3 days and had a good save or two, I launched it today and it lost all my saves.\n\nWorst of all it wont let me play any other faction that I have through the dlcs, from both the first and second game.\nI tried to reinstall it, check the downloadable content, I checked the download files and nothing,\n\nIt feels so shity having to struggle for a few hours to get your game working just because it bugged out over night.\nIf I get it working again I might change my review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Non-intuitive layers of cruft to get at the good stuff.  Technology and city management are tedious.  Especially at higher resolutions as the game does not scale its UI well at all.  \r\n\r\nQuick battles are fun, that is about it for myself.  I'd rather play Endless Fantasy with less epic battles for a fantasy 4X experience all day, but the detailed battle scenes are pretty epic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its ok except once WH3 released Creative Assembly dropped WH2 like an ugly baby and left at least one seriously bad bug in the game PERMANENTLY.\nThis game really needed one more patch.\n\nThe bug that I'm talking about is the one where the enemy battle AI is inactive when they get ambushed, which completely ruins the gameplay and the challenge for factions that naturally fight lots of ambush battles, for example, skaven.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "60 euro to only be able to play with 4 factions. You need to have Total War Warhammer 1 to be able to play Mortal Empires. EA is having serious competition.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "All total war games are not playable without A LOT of mods. The AI just cheats and attacks you when you even start to send your army off to conquer anything. To win battles against the AI, it replenishes its armies in 1-2 turns and their stats in battles are just higher than yours. This just makes it so you have to know how each unit does vs each unit. It becomes a \"have you played this game long enough to know all the match ups to win\" check. Feels terrible. Then you need to buy each to get each campaign. CA and Sega made way too many overpriced DLC's to give you 1 or 2 generals per 18 bucks. its the same campaign for each general, they just have a different spot on the map. This has the potential to be the best game made by the company, however it never will be.  Granted this is the best game out of any of the total war games, its not right to charge people 60 bucks 3 times then also have 100 bucks of DLC for each game. It's wrong and you should leave a negative review on all 3 of them to get CA to change.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still runs like garbage, still 5-8 min long loading screens,units/battles and Campaign still not balanced or fun without being so heavily modded its not the same game and adds another 5 min in loading screen, still extreamly over priced, minor bad factions locked behind DLCs years after game has died, Anything Games Workshop touches runs like dog water while still asking for more money for content, do not buy this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Creative assembly is an inherently anti-consumer business and you should avoid it at all opportunities. They delay fixing critical issues, overcharge for lacking content, and will do everything within their power to rob you fucking blind should you let them have the chance to do so.\n\nSave yourself the time, energy, and money and invest in games and developers that actually give a shit about the end-user and customer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like this game but for the price and expectations it's really underwhelming, the game feels like it been crammed to together for some reason as if the developer never played their game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It isn't worth it. Not even for the setting. There are better strategy games, there are better warhammer games. Don't support CA because they're just going to keep making garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Copied over from Warhammer III. I own all of them.\nAs of right now, the game is decent. But be well aware of CA's questionable decisions in the past. They did demonstrate that they are not to be trusted. I'm perfectly willing to change this review again if they mess up. Again.\n\nTotal War community says hello.\n\nWell. They screwed up again. Double standards are not acceptable, the same goes for broken factions.\nTime to change positive to negative. Again. This is the last time to change this review.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Should not have had to buy the game 3 times and also separate purchases for all DLC. Game doesnt run well in 2025 even.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tutorials are awful and unhelpful. Auto-resolve is inconsistent and makes zero sense stat and outcome wise. Game just expects you to know every last tactical strategy and even that isn't even correct 90% of the time. I don't care if my review gets jester emotes or whatever, I'm not gonna waste hundreds of hours of my life learning a game from a developer that can't even be asked to insert a linear tutorial that makes any practical sense, and no a geriatric narrator who puts more flare than advice on his directions does not count as sound advice.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After launching, unable to click anything to progress. Don't you miss the days when you bought a game and it always worked...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Happy 25 anniversary, Total War! Here's to another 25 years of corporate neglect! Maybe by then you'll actually finish developing the game, after chopping it into little pieces that you sell to us one by one of course.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Playing for the okrs - my favorite faction. Starting Waaaagh! crash game with 50% chance... Ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I enjoyed the game for a few years. You want a decent machine to play on, as the loading between battles (start and finish) was significant. I finally upgraded my machine and the loading is now a non issue.  This made me consider buying WH3 at the last sale and the other expansions I don't have. However, l watched some youtube videos, and legendoftotalwar dropped a video of the state of the game. LOTW got me into the game to start with. All the bugs and issues still in the game made me reconsider, and I did a summary of the the issues I have in WH2.\n\nI play as the dwarfs, but own most of the other DLC to support the game. \n\n- your allies bug out.\n         - you can select targets for your allies to attack. However, my allies bypass the last remaining region they don't have in a province and go attack a region 4 provinces away to stop me claiming it and getting the regional buff. They were not at war with the faction that owned the settlement when they departed, yet at war with the targeted faction.\n         - if your allies are at war with a faction, and the enemy gets confederated, the ally refused my offer to join war against the \"new\" enemy. So now I have an enemy as a neighbour, and my ally does nothing. I can take the settlement, but now I own 1 out of 4 regions. I can abandon the region, but my ally wont take it, and a 3rd party will claim it. I cant do nothing with the settlement as the growth is so slow. I am a top 5 power rank, the enemy and ally are between 40 -> 60 power rank.\n\n- Race legendary lords refuse to confed with me. I have over 400 rating with them, they are down to their last settlement and just get wiped out over the end turn. I had tried to confed them the previous 20 turns when they had 5 settlements and several armies. They kept getting weaker and then just died. I can never get the \"dream team\" going.\n\n- The underway - a 3 way unique feature (dwarves, skaven, orcs). The path is a bumpy road, uneven ground, random small hills. The dwarves cant see over it and you have to check each unit of thunderers / iron drakes line of sight, otherwise they stand there and do nothing if their view is blocked (the units wont advance to attack). There is no way to smooth out the underway = owning the province you're in etc. An army of miners to spend 5 turns clearing up the path etc.\n        - due to the units lack of height, and the line of sight issues, there is no alternative aside from the basic quarrellers and grudge throwers / flame cannon. The humans have mortars. What a weapon this would be in the dwarves roster. \n        - cannons and organ guns - line of sight issues again.\n        - the cannon in some settlement maps - can't shoot over the wall, yet the front gate is right next to the city square. A useless unit.  \n\n- The \"fun\" was removed. I use to enjoy putting several Master Engineers into an army to boost the range of units through their skill tree. Having a few flame cannons out range other artillery was fun. Iron drakes with flame throwers reigning hell down on enemy forces. LOTW did a doom stack video going up against elves with dragons and destroying the army, next patch, the skill tree was reworked. The skaven were still able to stack their range skill buffs.\n\n- skaven summoning - there is no counter other than to have your infantry/heros stand in amongst your artillery. Your front line is standing in your back line, and having a lack of speed, you cant get your front line back to the front line. You need to destroy these summons ASAP, otherwise they can destroy your artillery even while being attacked by your other units.\n\n- skaven settlements - every battle is the same map lay out for a settlement with walls. There are 2 non walled settlement maps with the same issues as underway battles, lumpy ground. \n\n- unit balance - my elite iron breakers can lose to a basic skaven infantry unit. It makes playing a balanced army pointless.\n\nIts a game and I want to have fun. But each patch removed a positive feature to where the game is a grind for the sake of being a grind. If you want the game to be lore friendly, cool, but make the units lore abilities even across the game. \n\nWH3 has a few features, buy settlements to have an alternative with incompetent ally choices. But there are too many bugs and non fun mechanics in the game to want to spend any more money on the franchise.\n\nI would like to continue playing this game, however, in the state it is now, I do not recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was pretty hype coming back to this after discovering some old content and lords like Queek got a patch beefing them up a bit, but I was very disappointed upon discovering \"No, actually, you only get these changes if you buy the game again. Appreciate your business!\"\n\nThe idea of updating content in TWW2 but then only making it available if you play that content in TWW3 is.. baffling. Why not just, yknow, apply that stuff to the game they're in? That seems reasonable to me - much more reasonable than tucking balance patches behind a paywall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Creative Assembly is a trashy company. They don't deserve your money. Furthermore, this game doesn't feel anywhere near as strategic as previous titles like Napoleon and Rome 2.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could give a positive review, but can't in good conscience. They're still charging for a lot for a game and DLC that they don't maintain meaningfully, put your money elsewhere until they change their corporate practices, which is highly unlikely as they have a long history of this poor behaviour.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I will not be purchasing or playing the 3rd game as the developer is leaning into the demonic way too hard. The latest Total War releases have also shown a significant drop in game quality and I am concerned about Total War: Medieval 3 or Empire 2 which I dream of coming one day. I hope that CA and SEGA can figure things out before development of any other historical Total Wars begin... or any installments for that matter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is an exercise in frustration. It could simply be that I don't have enough experience with it, but man is it difficult to figure out. I don't think I've ever seen a strategy game with this steep a learning curve. Things that should be simple and make sense, do not. Even with an \"easy\" level campaign, my troops always lose to enemy troops that seem to permanently be stronger than anything I can recruit. If I don't expand fast enough, the game punishes me with campaign events that count against me. If I expand too fast,  the enemy factions simply crush any new cities I take.  I have had battles where I bring DOUBLE the troops compared to the enemy, and I still I lose because they magically do 5x as much damage as I do.  The first enemy faction I fought seemed equal to my own, and manually controlling battles meant I would win. However, after that - every enemy faction wiped the floor with my troops like it was nothing. \r\n\r\nI honestly do not understand how some people spend thousands of hours in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love Total War and Warhammer more than almost anything in games and fantasy. It's too bad that the companies that make both of these products don't give a florp about my family and I making it financially. The corporate world in modern day views loyal and faithful customers as cash cows and it's disgusting. Be better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Obsolete now due to the 3rd game. This has the same problem the 3rd game has. Horrible balancing across the board, too many DLCs priced way too high that don't offer enough gameplay to be worth it, and CA being CA and not caring about players' desires in favor of churning out slop to appease the shareholders. Don't buy or else you'll go broke getting all 3 games and the DLCs just to try to enjoy the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You sell game with broken factions, even DLC. You overprice DLC and expect us to buy it, even if we can suspect it to fail in future patches. Plus the DLC prices in last times are just compensation for HYENAS, FOR FKIN HYENAS!!\n\nSuch a sorry state of game with this much potential. What modders do in a few days you announce to LOOK INTO in future patch??? DO NOT BUY AMY DLC, UNTIL THEY ADJUST THE PRICE NOT TO REFLEXT THEIR FAILURES, OR THE DLC CONTENT HAS THAT PRICE.\n\nWhat do you expect from us CA? All those years of Warhammer 3 being out and you still did not learn anything. If some developers had so much big problems with game, they would apologise and REPAIR IT IN HOTFIX, as much as they could.\n\nSo sad...\n\nEDIT:\n\nYOU LIERS!!! You think, we are dumb? We were talking about unresponsive Lizardman and Tomb Kings AI, NOT THE RECRUITMENT!!\n\nI did not want to talk about it, but it very cruel from you, how you treated lehendoftotalwar. I know very well, it was not just you, but it was also because of you.\n\n\n\n\nBe ashamed of yourselfs managers of CA. I hope Sega will throw you all out of the business. People like you are The Reason we are not living in Utopia yet.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}