{
  "positive": [
    {
      "review": "An extraction shooter with short rounds, PVE that needs to be managed and PVP which is super intense. No excessive looting or elaborate crafting that needs to be done. I love this game, there's nothing like it. Super atmosphere and great gunplay. See you in the bayou, cowboys.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "One of the better extraction shooters currently available. The unique horror / western setting and the gunplay attached to this is what really sets it apart from the rest. Gunfights in this game tend to be a lot more methodical and slower-paced, with a huge emphasis on good positioning and covering angles in order to land one well-placed shot. \n\nThe sound design is also top-notch, all the way from in-game assets to the music playing in the menu. The sounds also offer important gameplay cues during gameplay, which further immerses you in the experience. \n\nIt should be noted, however, that while this game pegs itself as \"PvPvE\", the emphasis of the gameplay leans heavily into PvP. Any PVE-encounters in the game ultimately serve as vectors for PVP-combat. It used to skew differently in the past (pre-Scrapbeak), which is probably what caused the skewed perception in this aspect of the game, but I would say this is primarily a PVP-game with light PvE-elements. \n\nThe structure of the game is also more objective-based than other extraction shooters in this game. The game goes to great lengths to signpost you towards your next \"goal\", which is usually hunting for bounty tokens. This generally solves a huge issue which tends to plauge extraction games, which is the lack of direction these games elicit, due to their generally Sandboxy-nature of gameplay.  \n\nYou can still extract out at any time during a match, regardless of that rounds current gamestate, which is one of the key features in extraction games. Due to the open vast and open nature of the maps in Hunt, there is some room for \"Sandbox\" style-gameplay, especially during their special events that they've held during the recent years.  \n\nThe economy, which is another key feature in these games, is also vastly simplified compared to other games in the genre. Yes, you lose everything you carry if you die, but it is also very easy to gain it back, as the game gives you multiple avenues of collecting gear without having to break your ingame bank for it. The loadouts in this game also tend to be very simple to put together, as you can only carry a very limited numbers of items with each loadout. In the end, this simplified loadout / inventory system benefits the game, as it makes getting into a new match very quick.\n\nThere is also no player-driven market in the game, which means you don't have to deal with fluctuating loadout values. Everything that your character needs can either be purchased from the in-game vendor or gathered while playing the game. \n\nOverall, if you're looking for a more unique PVP(VE)-experience that isn't as rigid as say, Counter-Strike, Hunt offers a very compelling experience that differs from the usual PVP shooter-offerings.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "great game, sometimes long lobby times as there arent many players but there SHOULD BE",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Hunt: Showdown 1896 — Where Hope Goes to Die (But in a Fun Way)\nHunt: Showdown 1896 is the perfect game for anyone who ever thought, *“You know what would improve my day? Dying in a swamp to a stranger with a rusty shotgun.”*\nEvery match starts with dreams of glory and treasure… and ends with you staring at the respawn screen while some cowboy loots your body like it’s Black Friday.\nThe sound design? Terrifyingly good. I now flinch at crows, creaking wood, and my own footsteps.\nThe atmosphere? So thick you could butter toast with it.\nThe gameplay? A beautiful mix of PvPvE chaos where your biggest enemy is usually your own panic.\nBut when it *works* — when you grab the bounty, escape the map, and feel like a legendary monster slayer instead of a walking donation — that’s the magic that keeps everyone coming back.\n\nVerdict:\n\n10/10 — Will happily return to the swamp, fully aware I won’t last longer than my morning coffee.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Je suis complètement amoureuse du jeu. Très belles mécaniques et une super atmosphère, accompagné d'un lore si bien travaillé. Les musiques, mon Dieu, de manière générale les sons et les visuels du jeu sont juste excellents! \r\nJe recommande vivement Hunt Showdown avec ou sans amis, c'est un régal d'y jouer! \r\n\r\nL'un des plus beaux cadeaux que j'ai pu recevoir :>",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "GOAT of extraction shooters. Atmosphere 5/5, Soundtrack 5/5, Immersion 5/5, Gameplay 5/5.\r\nOnly downside: you’ll run into the occasional cheater or smurf or crash in midgame sometimes, otherwise perfection.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The fact that the gunplay is more aimed towards actually aiming instead of just spraying makes it quite fun",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Hunt is my favourite game, and nothing else really scratches the same itch. It’s a tough, tense PvPvE shooter where you play as a bounty hunter tracking and killing a target in a cursed bayou while other hunters try to stop you. You gather clues, kill and banish the boss, then fight your way out with the bounty, all while every sound you make can give away your position.\n\nThe risk reward loop is incredibly satisfying. Almost everything you do earns cash for future loadouts, but anything you die with is gone for good. Surviving hunters earn traits that make them slightly stronger for the next match. It sounds like a snowball system, but it isn’t: every weapon has strengths, and even the starter gear is competitive if you play to its advantages. Skill and game knowledge matter far more than equipment.\n\nThe real hurdle for new players is the learning curve. The maps are dense with details, sound traps, angles, and interactions you just have to learn. You’ll die a lot at first—often without understanding how. But once you get past that, the game becomes uniquely thrilling. Nothing beats coordinating with a partner to outsmart and outplay another team.\n\nThe devs are another major positive: they’re active, responsive, and constantly adding new content. I’ve bought plenty of cosmetic DLC just to support them.\n\nNo matter what other shooters I try, I keep coming back to Hunt and probably always will, as long as there are hunters left to fight.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Hunt is a good game with many factors that stimulate your sense of survival and alertness, all your senses are engaged, which gives a large dose of emotional charge, however although the game has potential, unfortunately it is not fully used, maybe the developers will wake up and give something that will pull them out of their lazy lethargy. Nevertheless, I can recommend it for both solo and team players.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I never thought I would like this game that much. I had my doubts at first, because I had tried other extraction shooters and the genre hadn't really won me over. \nI have to say that this game is very underrated and deserves more attention.\nIt's really immersive. The locations, the setting, and the character design make me feel like I'm really in the Bayou.\nThe gameplay, the feel of the weapons, and the shootouts are very good, not to mention the sound design, which is fantastic. The soundtrack by the in-house band, Port Sulphyr Band, is also really great. \nHunt has become my favorite game. Certainly, you should give it a try. I could not recommend it enough.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A Once-in-a-Generation Experience - Still Finding Its Way Back\n\nI loved Hunt: Showdown before the 2.0 update.\nI was genuinely hyped for everything that was promised… and then the update hit.\nA catastrophe followed.\n\nThe game has been struggling ever since the engine upgrade. Performance issues, strange design choices, a loss of identity -> Hunt went through a rough phase that many long-time players felt deeply. But today, after several patches and improvements, the game is slowly recovering. It’s not fully back on its feet, but it’s finally starting to feel like Hunt again: creeping back into the very specific niche where it belongs, and where it truly shines.\n\nStill, I fear we may never get the old Hunt back. Corporate influence has clearly tightened its grip. \n\njust look at the rapid release cycle of paid DLCs and in-game microtransactions. There is a stain on the experience that the game can’t completely shake off.\n\nWhat Made Hunt Special\n\nHunt: Showdown was never meant to be a run-and-gun shooter like Call of Duty.\nIt was never designed to be fast-food FPS entertainment.\n\nHunt rewarded something else entirely:\n\nMap knowledge\n\nStealth, patience, and positioning\n\nReading sound cues and predicting enemy behavior\n\nTiming, risk assessment, and tactical decision-making\n\nIt was, unapologetically, a hardcore game.\nA game that did not bend over backwards to be accessible to everyone.\nA game that embraced tension, punishments for mistakes, and high stakes.\nA game where every bullet counted and every noise betrayed you.\n\nThis is what made Hunt unique - and why so many players fell in love with it.\n\nWhere We Stand Now\n\nThe fun is back. The tension is back. The core of Hunt still exists beneath all the turbulence.\nBut the past hangs over it. The identity has shifted, and some of the purity is gone.\n\nStill, after all these years and all these changes, Hunt: Showdown remains an experience you won’t find anywhere else: atmospheric, brutal, tactical, and unforgettable.\n\nIf Crytek continues to steer the game back toward what made it exceptional, Hunt may yet reclaim its full potential.\nFor now, it’s imperfect, but still one of the most unique shooters ever made.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If the candle is burning, it means dinner has been prepared for a long time.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "There are not many games I love to play. And not many of those games I can say I can ALWAYS come back to. Hunt is different, I hop on solo but especially with friends and it's always a blast. The fights are so different in every single bounty match. On top of fight diversity, nearly every single gun in the game feels so good to use, even if it is not a good weapon by the statistics it has. Plus what hooked me on this game years ago was the music and the art style, still to this day the coolest of any game and blows my mind every time looking at each individual trait while waiting for my friends to ready. There are so many good things about hunt, but last big thing that is good is the dev team; they may be small but they do listen. They make mistakes but they learn from them and bring us unique and fun content with every single update.  The downsides are so few and far between that this is the game I can always rely on to have fun. Thank you Crytek, for Hunt: Showdown!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is probably the best extraction shooter I've ever had the pleasure of playing, its such great fun with friends and I highly, HIGHLY recommend this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gunplay feels amazing, in comparison to most modern shooters the old „cowboy“-guns feel slow and one doesn‘t have much ammo. Hitting enemy players is much more rewarding and triggers something in my monkey brain, that i cannot explain. \nAlso my teammates get tilted every game. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game to play with friends. i like this game very much, the style of it, the bosses (not all of them) and it is really funny and time killing game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's really nothing quite like Hunt, one of the best online gameplay loops available today. Rounds are relatively short, the gunplay is super satisfying, and in-game systems encourage player interaction. No crafting, no inventory management, just pick the guns you like and have fun. High learning curve with a high skill ceiling.\n\nMost notable flaw is server performance, it seems to come in waves depending on the event and time of day -- they still haven't implemented ping caps. Matchmaking MMR could use some work.\n\nMicrotransactions are entirely cosmetic and there are ways to obtain (albeit super slow) paid skins for free, the base game on sale is a steal. Highly recommend you find friends to play with as solo queuing is likely miserable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hunt is an PvPvE extraction shooter based in the late 1800s in the American South with a somewhat Resident Evil-style aesthetic. This game is about strategic skill as much as it is about technical skill. Your primary task is to locate and eliminate Boss NPCs and collect their bounty tokens and successfully extract; where this becomes more complicated is when you realize every other player on the map has the same goal. You'll need to be alert at all times and use environmental cues to track/avoid other players positions. Custom loadout options allow for various builds and playstyles, just don't get too attached to your hunters due to permadeath.\n\nOverall, I highly recommend this game. The Hunt giveth and the Hunt taketh.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The only FPS that I consistently keep coming back to thanks to its gripping atmosphere and tense gunfights. Six years later and the game is still updated with new content and unique events that change the world and introduce new mechanics.\n\nUnlike other extraction shooters, this isn't an inventory simulator, so you spend much more time actually playing, although much of it is just walking between compounds to get clues that lead you to the boss. Similarly, gear fear isn't as bad here, though you can't sell anything that you've picked up in the world so there's less reward for looting and extracting.\n\nThe best part of the game are the gunfights. Although most guns one-shot to the head, and may only require two or three to the chest, guns tend to be slow firing so firefights can be long and drawn out, which makes for rewarding gameplay if you win them.\n\nPerformance does leave some to be desired, but is usually serviceable enough - I average around 80-120fps on an (admittedly now 7 year old but only 1 year old when the game released) RTX 2080 and I7-9700K with 24GB of RAM at 1440p on the lowest settings.\n\n[h3]9/10[/h3]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is simply amazing. I highly recommend it.\n\nIt is pretty easy to understand what you have to do from the tutorial, but it gets complicated quickly when you have to take in consideration all the little details, like noise, terrain and which way to approach a situation. Your patience and strategy will also be tested a lot.\n\nThe game usually has a slow build until the battles begin, but the tension is very high. Any mistake may get you killed if you are not paying attention. It is also very rewarding when you win a team/solo battle, the adrenaline rush after a lot of tension feels very good.\n\nI love this game so far and I think for someone who never played it but likes shooters it is worth a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most fun extraction shooter I have played, would recommend this to any one interested in teamplay FPS, best thing about it is the events - genuine fun to be had here. \n\n10/10 would play again and again, even through glitch and jank.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A tactical extraction shooter with high emphasis on using your ears. Very atmospheric and unique, though it has its flaws.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is and will remain a love-hate relationship.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "(European experience based review)\nShort review: Uniquely styled PvPvE Objective Extraction Shooter that hits a niche spot. It has one of the best PvP I've had so far and a steep learning curve. Highly recommended.\n\nLonger review: Since first launching the game until a bit of mastering of the core mechanics and the flow of the game, the game was visually pleasing. From dark death-themed lore to every encounter with the AI and environment, it was a lot of fun. \n\nI saw the rise, the controversies and the so-called fall(s), bugs that were there since day 1 that still aren't addressed, the UI shipwreck and all of its versions, and of course new (sometimes game breaking) bugs with each update, it all stepped aside to the PvP side of this game since it was that good. \n\nIt all sounds minimal, and you'd be right... until I mention that the game has 2 major issues as well and 1 that pairs with them. More precisely, this game has a swarm of ping abusers and bad servers in general. Let me go over the major latter first:\n\nIssue n1: Bad servers. I lived and played this game mostly from Croatia, yet my ping is better on Russian servers than it is on European servers. If you get a single hiccup with the internet connection, the game will kick you out and beat you to the ground. There exists a reconnect button, which is a bigger gamble for the success of its functionality than betting on the green 00 - ten times in a row and winning every time. Even if you are reconnected, you see the environment, just the bare field and you can't play at all, ultimately teasing you, so you gotta try your luck with reconnect, again. It got so bad to the point that I had to pay for a VPN access to play the game on European servers, mind you, Croatia is in Europe.\n\nIssue n2: Ping abusing. This is a wonderful orchestra. You have 1 huge server, which shall not be named, that has more cheaters than regular players and you can go to their own webshop and buy a hardware cheatsso they just gotta connect it and voila; cheats. It got so bad that the regular players have to switch to another server (+ they got higher ping thus ping abuse and are thus more successful in their games), this immigration led the local players of that server to switch to european servers, and the entire cycle continues. Being hit and dying, while behind cover with a bullet that cannot penetrate any surfaces, is just exhausting after a while.\n\nI won't mention cheaters as an issue, since, let's face it, gaming companies are NOT about moral, but about business, and games will always have cheaters of some form or another. \n\nSomewhat of an major issue: MMR. Like any other game, this game has players of all kinds of skills and the gameplay changes based on them. Hunt has its own MMR and it is \"stars\", with lowest being 1 and highest being 6. I've been a 6star for so long that even a week of very long gaming sessions of constant dying didn't bring it down to 5 stars. The gunplay and gameplay at 6star is ridiculus. Everyone is jumping every other second so you not only need to take in the consideration of the velocity of the bullet, the trajectory, its silly \"gravity\", but also the erratic mid-air-direction-changing all you can jump buffet where wanna be alpha-giga-chads can't let anyone hit them in the head. Now try combining this with the 2nd issue of the review and try to work who would win in a fight like that. Mind you, hit-reg is wanky at times so bullets sometimes just go through their body in to the abyss.\n\nAll this being said: the game is pretty good. You have a variety of guns 'n' tools 'n' consumables. Only your imagination is your limit. Although, more general loadouts dominate higher MMRs, and I always went out of my way to avoid the Mosin+Dolch combo for example. I find fun in their confusion of their playstyle when they go against something that isn't often seen.\n\nThey are adding more and more content, from guns, tools and consumables to new events. Man, the events... as of now, an event is when there are NO events. One after another, (obtain premium currency to) unlock the premium side of the event-rewards (mostly skins and miscelaneous item-animations) and grind it. No event is same, since they are always experimenting and navigating the game through data-driven decisions.\n\nHighly recommended for PvP and also PvE side, since that is a \"mental melody\" of sequences that you can visually see and play out. From juking and killing a pack of Hellhounds with the knuckle knife without getting bitten not even once, to juking Grunts and navigating a compound full of AI while killing in front of you and juking behind you, at this point it's a mental stimulation of its own.\n\nAlready long review and I'll stop while I can (and want to, at this point). \nBottom line is: game and gameplay loop and gunplay is good, but it's better if you can convince a buddy or two to get it as well (tho solo experience in the game ties to your skills, you can still do it and you have additional perk advantages). Game won't feel boring after a while, since every event brings a shift. Be it tiny or huge, it makes the game as fresh as it can and it nicely combines with the god-tier PvP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only thing I can say is that it’s a beautiful game. I love its shooting, and although its shooting mechanics aren’t as modern as in other games, this hasn’t affected my enjoyment of it at all.The mix of Western, cowboys, and old guns will make you fall in love with this game if you like those things.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hunt: Showdown is my favorite extraction shooter. Wild West vibes, revolvers, repeaters, and shotguns make every fight feel intense. The game is tough, but fair—you can use any weapon, though some come at a price, and expensive doesn’t always mean better. Mastering its deep mechanics takes time: different types of “zombies,” tactical combat, and rival hunters all hunting the same bounty. The goal? Survive and extract with your prize… if you can. If you’ve got a few hours to invest, crave competition, and love complexity, this game is pure gold. Good luck, Hunter!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The most exciting PvP game I've ever played. The selection of weapons is satisfying - ranging from high damage rifles that reload after every shot to fast firing pistols, bows, auto-shotguns, and more - and each has unique strengths, weaknesses, and ammo types.\r\n\r\nUnlike other extraction shooters, the real point of the game is PvP and the loot is a cool reward, but it's mostly designed to bring players to the same place for fights. Losing your character is only a minor inconvenience, not a big setback because you can rebuy lost characters and equipment before every game, and if you win there are rewards to be had which make life easier in the next game without overpowering you.\r\n\r\nThe learning curve is a bit steep, so jump in and look for PvP fights, and if you lose just jump back in and you'll get the feel for it soon enough.\r\n\r\nThe game is in a healthy place and old issues have been fixed, so the negative reviews from around October 2024 don't reflect the current game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, hard, frustration and compleatly amazine everytime you survive a gunfight.\nSeasons are pretty fun too with the map changing each season and seasonal guns.\nThere is some lobby and UI bugs that changes each update, so thats sad.\n\nAll in all 8/10 game with friends, 7/10 solo (when acting like a sneaky troll).\nAnd the absolutly amazing dark western music is on point and give me chills.\n\nI would give even an 9/10 if they started with more hotfixes to fix the lobby and UI bugs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Before i bought this game it looked very boring and not very appealing to me. My friend forced me to try it and damn this is the greatest multiplayer game ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing hunt is like playing chess if extraction shooters were board games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "260 hours - still addicted. This fills a niche unrivalled by anything.\n\nBuy it.\n\nAlso: regarding performance. Obviously not playing on ultra, but no issues here with my 2060 rtx.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Imagine a game, where the most creepy thing is not a spider, or zombie, that is chillin' in the dark. It is an enemy hunter, who is sitting and waitng with a sniper rifle far away (>200m). You cannot see him, but he sees you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great visuals, really captures the eerieness and is very immersive, PvP is tense and fulfilling and not easy.\r\nI highly recomend giving bit a try.\r\nNew events every 2-3 months keep it fresh and interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Another classic love-hate relationship game. So addicting and feels great when you win or get a few kills but boy can this game can make you wanna deep fry your balls. Wish it was more relevant, criminally underrated.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't play PVP all like that, but for some reason i love the way this game is and how satisfying the kills are. like even if you get one kill it like keeps you hooked. Even with its bugs and stuff i enjoy each time i go into the bayou even when you go in with no traits, tools, consumables, or guns. But that's a brave time.  Game is has a very simple look but it's complex. Most i got to say here is Try not to miss Good luck if you buy this game. It's ither a love or dislike game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my favorite game of all time and I don't care what the haters say about it. Hunt lover forever.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the only games that still gets my adrenalin pumping, extremely unique methodical gameplay, best audio by a mile and each event it just continues to get better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I launch Hunt. Three minutes later I’m burning, bleeding, poisoned, and being chased by dogs — all simultaneously. No other game makes suffering feel like a core mechanic.\n\nThere’s no loot, no armor, no comfort. Yet somehow I still whisper, “One more match,” as if the Bayou didn’t already file a complaint against me.\n\nGuns from 1890… aim like they were calibrated by a drunk scarecrow.\nEvery fight feels like a heart attack with surround sound.\nAnd when someone kills you?\nYou respect the ambush like it was a dissertation.\n\n• Logged in → Immediately on fire.\n• Shot someone → Their friend shot me harder.\n• Still would suffer again. → I sip my tea and queue anyway.\n\nHunt is pain + chaos + addiction.\nIf you love this game… congratulations, the Bayou owns you now.\n\n10/10\n The Bayou slaps me daily and I thank it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game felt pretty weird in terms of fight mechanics bc it's not like any other shooter game. You get the hang of it as you spend more time in fights. (800 hours and I still suck...)\n\nStill I don't want this game to die off easily. Love the passion of dev team!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "played for 10 hrs today somehow yet felt like 3 this game is visually spectacular and addicting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As of November '25, it feels much better compared with the review-bombing period. \r\nFeels much cleaner. UI still needs an overhaul, but even that performs better.\r\n\r\nNothing out there like it. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ok, Hunt Showdown, one of the best games of all time. The psychological aspect, the mind games, the sounds and the object based shooting system, before Crytek started.... \"Fixing\" it, fixing it like you fix a dog... by breaking it. The object based shooting has been changed for \"The best interest of the community\", which has lead to more inconsitencies than pre DeSalle shooting. The sounds now may hide critical crucial key sounds, unlike before. Kill shots might not be counted, misses on your might be called a kill shot. We love to complain about cheaters almost as much as Crytek likes us crying about cheaters, because if we're blaming other players, we're not looking at Crytek. in what world does a company intentionally sabotage their own game? WTF is happening in the industry where Crytek was force to do this a long with many other games and developers. I've been playing since April 2021, PS4, and I'm not the only one to call this shit out. Crytek cut off PS4 for all these amazing improvements and graphics, and shooting system and anti cheat, and blah blah blah.... IT was all garbage, it merely cut off the ps 4 players, adn the game still looks the sme, with the option to make it look better, which makes it harder to see your enemy.... It's RETARDED!!!\r\n\r\nWith all that said, we're sticking around for the abuse, because the game is that good and out of spite. Crytek uses the Cryengine which runs on tears of it's users. \r\n\r\nBest way to think about this game, imagine your dream spouse, they meet your needs in ways you didn't even know they needed met, they're perfect. The problem is, they may kick you in the groin when you're bending over, without warning or a word, might be a critical chop to the throat, or a knee in your special place during sex. Yup, but still meets all your needs and more... But you have to put up with the intentional abuse, that's become a game to see how much abuse can they really get away with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games out there to enjoy with your friends if you are into FPS games. Can get a bit sweaty when you reach 4-5 Star, but still super fun and especially satisfying to get thos clean headshots from far away ^^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "There's nothing quite like Hunt: Showdown. Between the best-in-class sound design, the unique theme, and the genuinely amazing PvP gunplay, this game is easily the best extraction shooter on the market and one of the best FPS experiences your can find.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game brought me and my friends a lot of fun and emotions. Outstanding style and work with the sound",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game with some unique gunplay mechanics i have not seen anywhere else, it's not a sweaty game either. just offers the right balance between casul fun and tense combat.\n\nmatchmaking time is over a minute though, they should just remove the MMR and enable quickplay or something",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game that I've come back to again and again and again when new titles wear out fast. One of the top extraction shooters all time, and with a very unique environment as well. \r\nIt's had its issues, the new UI is weird, but 9/10  over like ten years almost",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My new favorite game. This is the best extraction shooter I've played. The pvp is clever and unique and the pve is challenging and strategic. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. I think it's very creative and unique with some of the most fun and best designed gameplay I've ever experienced in a shooter. I recommend it. This game checks all the marks for me and continues to be a game I know I can come back to and have fun. I think this is one of the best if not the best extraction shooters out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes time to learn the game and can be frustrating at times but overall I'd still recommend this game if you like extraction shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game since it came out, started out on console then PC. This game checks all the marks for me and continues to be a game I know I can come back to and have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best if not the best extraction shooters out there:\r\n- Nice gameplay and dynamics\r\n- Great graphics\r\n- More tactical\r\n- Great playmodes\r\n- Amazing sound effects ... and its important for playing\r\n\r\nJust fun to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love the pvpve sound is crucial but pretty sure there are some hackers so that kills it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An objective extraction shooter. Focus on the OBJECTIVE part of extraction shooter, Loot is almost non existent, and the focus is pvp where everyone dies to a single well placed headshot. \r\n\r\nFor the uninitiated this game starts you on a map with 11 other players and you are all looking for the same bounty target. The target is a pve enemy that you kill, \"banish\" (meaning start a timer that alerts the entire map where the bounty is), once the banish is complete you can grab the bounty and try to extract.\r\n\r\nSince everyone has the same target(s) this inevitably leads to pvp. Which is where the game shines. Almost all of the guns have a relatively slow rate of fire. Meaning you have take time and place your shots because you don't know if the enemy will take cover before you can fire a second shot. Put on top of that the fact that everyone can die in a single headshot and you got yourself some tense pvp!\r\n\r\nThis also mitigates one issue I have with other extraction shooters which is that higher geared players are harder to kill that low gear players. Which feels leads to severely unbalanced fights at times.\r\n\r\nThis isn't to say that Hunt doesn't have gear however. You can out spend your opponents with statistically better weapons (higher bullet velocity, slightly more damage on body shots, faster but not too fast cycling time) but at the end of the day if some hits a clean headshot you're dead like the rest.\r\n\r\nAnother aspect of this game that no other can touch is the audio design. I don't know how they did it, but the audio in this game is the best in the business. You can tell where everyone is just by the sounds of their footsteps and if you listen carefully. Combine this with the fact that the main purpose of the pve enemies is to act as sound queues to give away your positions and even the pve makes for a decent \"avoid the audio queues\" mini game.\r\n\r\nFinally the last aspect of the game that keeps me coming back and that is this. No other game has had me say \"Wow I've never had a fight like that\" with 1300 hours of playtime. I consistent end up in wildly different gunfights almost every time I boot up the game.\r\n\r\nIf that doesn't say something. I don't know what does.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really great. to me one of the best fps game ever. I am sure no one will forget the feeling when you get your 1st kill with a headshot. That sound of headshot make all the difference. And hats off to the devs for keeping it interesting every season.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love cowboys, old west setting, and all that jazz.\r\nBuy Hunt.\r\n\r\nIf you hate cowboys, old west and just want to shoot at it, blow it up and watch it burn.\r\nBuy Hunt.\r\n\r\nThe passion, attention to detail and dare I say love with which this is built...is infectious.\r\n\r\nIt will not disappoint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive game style. You can choose the level of engagement with human enemies most games, which is to say challenge yourself to a dual, or choose to sneak out the bounties.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mechanics are simple but the pvp can be hardcore. There is so much weapon variety and gameplay styles. The atmosphere is one of the best aspects of the game and the sound design is unmatched.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying gunplay and immersive graphics, even in current year.\nThousands of hours replayability. Every scenario and experience is different.\nStill gets updated with new content and delicious cosmetics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, has great shooting but lacks variety in the game modes. Would be great if it had a 1v1 or 5v5 game mode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favoute game\n\nMatchmaking can be gay\nNeeds more players\n\nOverall if you havent played this game you are missing out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very intense gunfights, very fun, very addicting, but asia servers are full of chinese people :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game if your tired of all the cod type/ fast paste shooter games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hunt showdown is a very fun, engaging, and thrilling game. highly recommend it! best played with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hunt: Showdown 1896 is tension in its purest form. Every sound matters, every fight feels personal, and every match turns into a story you won’t forget. The gunplay is sharp, the atmosphere is unmatched, and the chaos is always one misstep away.\r\n\r\nNot perfect — bugs happen — but the adrenaline this game gives is worth every second.\r\n\r\n7.5/10 — A masterpiece of stress, strategy, and “WTF just happened?!” moments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing Hunt on xbox years ago. If you're switching to PC it is definitely worth restarting for. Everything feels better.\n\nGameplay is smooth and I prefer the Hipfire mode over the ADS mode. Only complaint would be the damn water demons damage if they catch you. Otherwise a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm absolutely terrible at this game, but man do I love to pretend to be a cowboy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เกมมีบรรยากาศ ที่สวยงาม ระบบเสียงที่ดีเลิศที่สุดในเกมยิงแต่ว่าหลังๆ gameplay loop เริ่มซ้ำซากคนชอบเล่นแนว META เยอะเกินจนน่าเบื่อ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big John here, Are you a masochist? If so this game is for you.  Really like your current loadout? To bad. You like games that are fun and rewarding? Get lost. Your poor in real life and think that sucks? Try having no hunt dollars on a 5 star mmr and having to budget free hunters. 10/10 best game ive ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. very unique\r\n\r\nYou will hear very mixed things about this game. That's because the game has issues and some of them have been there for a long time. Still the gameplay loop is so good that people just can't get their hands off it. And that is where the reviews come in. Most players start loving this game and become passionate about it, which leeds to frustration over some bugs that seem to be easy fixes from the outside or just have been in the game for too long.\r\n\r\nThe developers are slow at times to fix issues, but they also listen to the community. That is the most important thing for any game and for some reason hard to find these days. Hunt had some bad moments in the past, but overall the game is improving over time more and more.\r\n\r\nSo definitely give it a try. Be ready to have a hard time in your first hours of this game, especially once you leave the noobie protection that the game gives you, because there is much to learn. The reward will be worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun PvPvE shooter which focuses more on fun gunfights than resource looting & crafting. The unique setting is also awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with good visuals, anti cheat isn't great though. Would be fun to have coop PVE game in this setting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played about a year before the 1896 change and really liked it. I stopped after the update because it did feel different with the balancing. Overall what feels like a different game in the genre with decent polish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking for a spray and pray... this game is not for you.  You have to be precise with your shots and thats what makes the gunplay so good in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Hunt: Showdown 1896 might be the best extraction shooter out there right now. It marries weapons and traits into a meaningful character loadouts with solid gameplay mechanics set against a gritty, horrific world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1.Start The Game.\r\n2.Wait 10Years to find a Teammate.\r\n3.press start buttom and wait again to find a match!\r\n4.Die after 2minutes and return to Menu \r\n 10/10 Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything in this fucking game can and will kill you. And you'll keep coming back to let it happen again and again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a PVP player, and this game is the Best PVPVE game in my mind (since EFT is good as well. But I would rather regard EFT as a shooting RPG game). But anyway, I did enjoy a lot in hunt. Solo against trio is the must-try thing here. Recommended everybody to try solo mode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, can be frustrating sometimes till you realise you have free will and can just be a menace and throw hammer at people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game in a while, can't remember the last time I've been so hooked on a game. Played it like a second job, and at 500 hours I felt I was just starting to understand the game and mechanics. I am now writing this at 1000 hours because I feel I have a valid experience of Hunt. I float around 5 star never really 6 star, I don't think I'm any good at the game but I think game knowledge itself has helped me play better. I didn't enjoy the game at 30 hours because there was lots of unfamiliarity but at about 200 I really fell in love. It's an intense hardcore shooter, rewards great discipline with aiming as well as positioning, great gun play with 1-shot headshots, some creative utility uses when in a pinch or to set up, and not your typical loot fest so lots more action. Of course there are some draw backs, as with any live service game, wonky servers, unbalanced patches, broken mechanics, but I feel the experience Hunt Showdown offers triumphs all that, if anything adds to the chaotic nature of the game at times. PvE is just meh but the design of mobs and atmosphere of the maps are unbeatable, just sometimes feels like a chore but I think that's as intended to slow down the game. Music and sound design is also 10/10.\n\nTL:DR game good, can be hard to pick up, but if you like hardcore shooters it is a must try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good. I enjoy playing it with friends rather than solo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If they spent more time with the upkeep on their servers it would be a solid game. Server lag has been terrible as of late. Constant disconnecting, and if you do get in nothing but rubber banding. Reminds me of the first months of RDR2 multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Without a duobt, one of the most unique multiplayer experiences  I've had.\r\nvisually stunning, and very deep-layered gameplay that even veteran say they're still learning new thing after 8 years.\r\n\r\ndon't even get me started on the audio and sound in this game!\r\n\r\nOne of a kind. highly reccommanded.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My main complaint is the constant events and lack of fixes for very much known bugs. Hopefully that will be fixed in the future. I still love this game even after thousands of hours of gameplay (~4k on console included). Even if it makes me mad lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played at least 20 games . it s pretty decent.\r\n\r\nCons-\r\nSome minor bugs\r\nSome guns are just annoying (guess this is prefferenced individualy)\r\nPlayers camping not moving then complaining why you dont make the first move (First grader Romance much )\r\nPros-\r\nUnique interactions with guns ans special ammo\r\nPretty decent off Meta combos \r\nStil able to kill people even without propper weapon and Trait setup\r\nJust FKN FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can be frustrating af, you just keep dying but in the end it's worth it.\r\nHunt giveth and Hunt taketh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10 \nGame is fun with friends and as long as you have a positive attitude you will slowly enjoy it. Tryhards exist everywhere so don't tilt, have fun hunters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best shooter game out there \nGun play is fantastic \nand the extra heartbeat when you´r gun goes ''Click'' is Hunting \n highly recommend this Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is more than another shooter. If you are curious if it is worth to play it, do not hesitate. I've been postponing playing it, thinking it is too much to handle, but I regret nothing. 600 hours later I can only say this - it is worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game plus vibe, the butt burns like hell, and the smelly, sweaty men shoot you in the head like crazy out of fear\noverall, I like the game, the guns are cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is genuinely one of the few games outside of sports that give me the tingles of an adrenaline rush and settling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game with a burning passion but I just cannot stop playing it. \r\n\r\nSeveral kind players have referred this to me as a skill issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excelente jogo pra jogar com um squad, só gostaria que houvesse opção para squads para 4 jogadores",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best FPS games out there (extraction shooter). If you have skill, you can truly outplay your enemies and it is very satisfying. This can be raw aim, or just well placed traps and jebaiting, map knowledge or knowing your equipment.\n\nSome downsides - They've improved the UI countless times but sometimes it is still bugged (as usual) - having to reselect Bounty Clash everytime you load in again after a match, etc. Some of the events are lacklustre, and the battlepass ends at 38+ instead of 50 when the event lasts 3 months. Including the rewards + skins,  they are just meh at times.\n\nAlso, watch Rachta Z/Hornet/Whityyy/Rexnor for inspiration! They've always inspired me to get back into the game whenever I feel \"bored\" of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes your patience would be your worst enemy but sometimes it pays off!\nVery addictive and love the sound tracks\n\nSteam Awards for HUNT! Woop woop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, wish the devs fixed server issues and made chukuno explo a scarce ammo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good batle royale-ish time of game with hard entrance but enjoying at even low level of mastery, but the internet connection code is a total garbage where you have to play with GearUp or some other software to lower your ping if you are not from EU region",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game.\r\n\r\nWhile true there are other great games out there like Arc Raiders. There just nothing like the satisfaction of hearing the headshot land.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game , its like good coop. can play with the old friends. \nAnd if you have to leave you just enter extract or just shut down it , you dont loose mutch.\nSometimes the servers not the best but ye ... :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recently passed the 2000 hour mark in this game.... and yeah, I am still playing.... no I am not going to stop.... why aren't you playing yet?\n\nStop making excuses. Just buy the damned game. If you are reading reviews then this game is for you. Buy it. You'll like it. It's awesome.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I love this game. I think it's very creative and unique with some of the most fun and best designed gameplay I've ever experienced in a shooter. I recommend it. The reason this review is negative is the matchmaking.\n\nI'm okay at this game skillwise. I play it very casually. I'm a four star (out of six). I have just over 600 hours at this time. And every single match, I'm playing against 6 stars, which represent about the top 2% of the game.\n\nI'm not going to complain about how annoying and lame their playstyle is. It works and they're very good at it. I just don't want to play against them, and I shouldn't have to. I should not see a prestige 100 solo sniper every other round. I should not regularly have to play against people with 10 times my playtime. And it's not just me, one of my friends is a 2 star and she has the same problem.\n\nI'm all for skill-based matchmaking, but this is not it. I would love to see this changed.",
      "voted_up": false,
      "votes_helpful": 127
    },
    {
      "review": "This review is a sad one. \n\nBefore 2.0 this was hands down top 5 games on my list, the atmosphere, gun play, tension it was just amazing.\n\nHowever now, the gunplay tweak's, the shift in design with character skins, performance issues still. ( On a GTX 4070).\n\nThis game is just not the same game anymore. I wish 2.0 was a sequel so we didn't lose 1.0",
      "voted_up": false,
      "votes_helpful": 79
    },
    {
      "review": "Hunt showdown is such a good fun game that I wish I could recommend. The only problem is the MMR system. They don't have enough players to fully implement so those who aren't used to the game have to suffer. It doesn't matter if you're ranked as a 2star you WILL be matched with a 6star lobby if they determine there aren't enough players (which there usually isn't). \r\n\r\nOnce the MMR system is fixed or they find a proper way to onboard new players, the game will be a blast. Until then, prepare to be shoot through cracks you didn't even know existed with long ammo.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Two years ago I would recommend this game as amazing and unique shooter game... I was a console player, now I'm PC player. In time so many things changed for the worse in this game... Developers trying to strip this from everything what make this game unique and leave things which make this game similar to other lame shooter games. Unplayable for new players, full of cheaters, main objective of the game not worth going for, technical issues of servers, Europe servers full of Chinese players and Russian... Very sad. There is many other things I could mention but is really wasting the time, because devs listen only to meta players.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "For the love of god make the last game mode you play is the default one, plus dx12 with dlss bs off is unplayable can't yall optimize this shi ?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "crappy game now, used to be great.\r\nAlso, due to anticheat, you get kicked for not cheating, some new bug. All they do is collect bugs over time, fixing very little very late, producing more and more content that more and more ruins the game.\r\nToo bad, loved it two years ago. It's gone now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hunt Showdown is a good and fun game WITH friends but there's plenty good games out there which they are more fun and better in many aspects than this game . just DON'T waste your time in it like what i did",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't waste the time/money...even if on sale. Not a fun experience. Was fun for the first few matches when you are paired against NPCs but after that's done, going into a match is against real people and a good majority exploit or further to win. Attempted to return but had too many hours on it. \n\nI looked into this form searches and threads and apparently this is a common theme. Player's who have had it for some time say that the game has been taken over by those people to the point where it is unplayable for them. \n\nEncourage you to look more into it before buying and if you still intend to do so, good luck and hope it is fun for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game was working perfectly until the major update, and ever since then it refuses to launch. It has been almost six months and I still cannot play. I reinstalled Windows multiple times, tried every fix available online, and even Crytek support could not solve the issue. I am done fighting with this game. Good luck to everyone still playing and I hope you never have to deal with the problems I went through.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An amazing game that is currently being completely ruined by cheaters. I got back into the game for the first time in years when this new event started and for a while everything seemed fine, but now trying to play you will get shot from miles away or shot straight through a wall or two by someone who theoretically shouldn't know you are there. Go on Youtube and you can see how many blatant cheaters there are using ESP and other cheats, and you will have any desire to play the game completely destroyed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely a really great game, but solo players in trios has killed it for me. \n\nFor those that don't know, if you play solo in trios you get a handicap of playing against players several ranks below you. Late night lobbies can sometimes be pretty empty. The last few times I've plated, I end the night just getting smurfed on by some untouchable player that 15 people at my rank still had no chance against. It's really stupid, and leaves a bad taste in my mouth every time I try to play this game. \n\nDon't play it unless you're a top-tier player in other shooters, the base learning curve is too harsh for a game that then punishes you for trying to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If the developers implemented a region lock and an effective non-free-tier anti-cheat system, then maybe I'd consider giving it a positive review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst fucking meta in any game ive ever seen 30 minute session of running across the map just to die to 3 people sitting inside a building with crown and kings and mosins, anything above 4 stars is just the sweatiest shit fest, shake up the meta, remove quartermaster, make bounty clash have free loadouts you can make with quartermaster not available to pick its getting real stale even considering all the new content quartermaster is the sole reason high mmr is unbearable make it so you have downsides for the role you want to play not being able to do everything every time, regen shot is also an abysmal addition to the game makes fights just last longer heals are never a problem running out of heals should be an issue like it used to be and please just delete the crown and king. Mmr system is completely fucked and 6 stars solos should never be a thing the whole system should be solos against solos duos against duos and trios against trios, the whole solo idea is just crytek allowing smurfing straight up. Rant over i died to a team at spawn that died 100 m away from me i didnt even get to be in the game with my duo for 20 seconds nvm rant not over it really fucking hurts seeing the game you played from beta which you have had a on and off relationship just get worse over time, wheres the fun crytek? wheres the lore books? wheres the love you showed us at the start disappear to? was it greed? was it wanting to move on? do you still love the game you made with all your heart? this is still one of the greatest shooters to ever be made but the love the dedication just seems to have disappeared.\n\nI hoped you, the game ive grown up with wouldve also grown.\n\nI love hunt showdown some of my best gaming moments, some of the best lore, some of the best visual design one of the most unique gameplay loops has just devolved into repeat event slop and cash grabs, do you still heed the call of the amercian hunters association? or have you fallen to the comforting whispers of the sculptor? I think i know the answer.\n\nI hope to see you out of the bayou Hunter, I think im going to retire, you should make your own choise of what you want to do with your life.\n\nEDIT: The Quartermaster hate i put out in the review isnt a good take, the problem is having 2 slot shotguns and rifles, quartermaster not being in the game would get rid of some of my favorite loadouts, like dual wield pistols bow and bomb lance etc. Abysmal take, so im correcting here and saying that 2 slot shotguns and rifles are the problem.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Matchmaking in this game is genuinely terrible, you cannot play this game casually and enjoy yourself. Every lobby is consistently comprised of people with 2000+ hours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much like tarkov, never let your friends convince you to try this game, incredibly unfun and an easy way to waste time off your life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great but there are cheaters and poor skills that ruined my hunt dollars, i suggest removing the hunt dollars purchase to choose the loadout you want and be strict with cheaters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It once was one of the best games I ever played. Then they fucked the MMR system sideways. Now I am forever stuck at 6 stars, getting mauled every single game and not dropping. This led to me quite literally quitting the game. Very unfortunate. This game had everything!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game used to be the bee's knees. It really was fun, tense, easy to get into but hard to master. The gunplay was unique and had a certain flair to it but all of that is now gone in favor of making it more similar to everything else on the market which has lead to its steady demise. The game had a myriad of horrid updates that killed the soul of the game including but not limited to the UI changing to make it more controller focused even on PC without an option to toggle the legacy UI, while the UI and menus have improved since the initial update it baffles me that we had a better experience at launch. The gunplay has slowly devolved overtime with the introduction to weapons that go against the original design and balance of the game making any older weapon irrelevant and killing any sort of identity that this game used to have. If you look at the population of the game it is apparent that the decisions being made are killing the game but they do not care as long as they can add new weapon animations and skins that cost extra money. On top of the bad gameplay changes all of these updates have killed the performance of the game as well. This game in its current state is not worth your time as it does still take time to learn and understand all of the mechanics. If the game is on sale for $5 it may be worth a try but as of now the play base is dwindling and the game has nobody to thank but the devs who prioritize battlepasses over their dedicated fan base.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Matchmaking sucks ass I didnt win a single game in all 34 matches how tf am i suppose to learn if im just dying every 3 seconds",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I bought the game in 2020 and have uninstalled it three times after playing a few rounds. Each time I reinstall it, I hope that I might like it, as the idea itself is good and is executed very well. It's just not satisfying to lose permanently and get one-shot. It's just not my type of game ig.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Has a crap UI not only that all of your settings and customization will randomly reset so if you find the exact settings you better screen shot it because the developers dont give a crap about it. YOU better find a work around because they sure wont fix it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's honestly not that great. The basic game loop is entertaining enough to keep you interested the first 1500 hours or so, but after that it gradually starts feeling grindy and you start getting increasingly annoyed by all the bugs and balance issues and sweaty players. This game would easily have potential for 3000 hour enjoyment but it's the little things that end up ruining it for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "15 minutes tutorial and nearly a hour queuing just to get rejected by randoms because my rank is still new, I'll just go back to Stalker then.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "being outclassed by newer games, instead of cosmetics focus on gameplay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loved the game so much, until they added more spiders.\n\nI've grown used to the spider boss but when they added the little creepy crawlies, it was a deal breaker for me... I have arachnophobia.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, enjoyed the game, over hundreds of hours of playing with friends, but over the last couple of years the game has devolved. The community has a constant cheater problem and even through reports and discussions of certain players that are known for cheating on both discord and forums, the devs sweep it all under the rug. They are more worried about making the next event and next batch of skins to keep the microtransactions flowing, than to actually work on their game. The update didnt give me an issue, but it makes a lot of people crash, consistently, and yet after all this time from the major update, it still happens. \n\nI decided to write the review because they have the audacity to send the players for a request vote for \"The Labor of Love\" award, yet all I've seen over the recent time is just greed and unwillingness to help out a majority of their player base.\n\nI, and many of my friends, have uninstalled and moved on. There is great memories, but the lack of content and care after years (but \"new\" events, yet it's the same 3, and a bunch of new microtransaction skins) has pushed many of the people who played for years onto new things. \n\nTLDR: dont bother, the devs no longer care about the players outside of money, and the cheaters are rampant.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted this game to be good. I tried to support it buying skins. But it just makes me angry. Some times I get disconnected. Other times we kill the other player teams then the fat npc with poison maggots kills us. Other times an enemy player is shooting at me and the fat npc is hitting me. Like WTF. Other times I aim at a player's neck and somehow my bullet doesn't even hit him. Other times I shoot another player in the chest twice and somehow he lives and shoots me once and I'm dead. I can't anymore. I get a feeling that someone is messing around with players. You can tell when something is sus. Too many coincidences Because of the timing of disconnections. I'm not in the mood for this shit. Make a fair game. Why the fuck do you interfere with players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to love this game, one of my all time favorites.\n\nThere's just too much bullshit for this game to be fun anymore, but I'm addicted to that hope of \"well, this next match will be a good one\". The matches have too many things that have to go right for it to be a proper match like it used to be.\n\nThe first and luckiest thing you'll have to hope for is that you don't have a cheater in the lobby....but most of the time you will, which is crazy considering there's only 12 people per match. And if you don't have a cheater in the lobby, you better hope the audio occlusion they fucked up will actually let you hear what's going on, and not have someone within arms reach being completely silent even if they're sprinting. And if you don't have to worry about audio problems, you better hope your bullets actually connect and dont disappear into the ether, because the game has servers that are only 30hz if they were at their absolute peak best.....which they are not most of the time. And if it's not the server causing the hit reg problem, it's the people with high pings with 250+ latency playing from countries on the opposite side of the planet because there's no pings limits. Which really fucks with bullet travel time because you will have to lead differently for people with higher pings, which makes it feel like the gunplay and your accuracy is super inconsistent, and turns it into more of a guessing game than it really should be.\n\n\nThere's just so many hoops to jump through just to hope you get a match where the game and players are working/interacting as intended. It doesn't happen often. The VAST majority of matches are marred by the problems I've discussed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game. It's fun, the only shooter game that i actually like.\r\nThe problem are the bugs. The game crashes every 30-40 minutes and i have to rejoin it 2 or 3 times. Sometimes all the other players become invisible and i have to shoot blindly based on sound. I love the game, but the developers refuse to fix the problems with the engine and just continue to add content while some of us can't even play the game we payed for. I can't recommend the game in this state. You might pay for a game to not be able to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's been a while since I played this game, but I always loved the aesthetics. It was a little too sweaty for my friends, but it was always a good time.\n\nI wanted to come back to it, but I won't abide any game where it's better to delete it and redownload it than patch it. Some serious mismanagement of storage with this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ts game just like fornite bale royal shoota and it has the gas cough and die na me te and the shoota gun when shoota the bad poeple :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The servers are fking trash, can´t play a match without server issues, shi is unplayable, Well, I can tolerate a little lag, but not while I'm in the middle of a teamfight. I had rubberbanding and the server kept disconnecting every 10 second (in the middle of a teamfight), so much so that the other team got fed up and left....\n\nNEVER PLAY THIS GAME. \n\nBuenas noches.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game needs to ber fixed, not curated for campers. Fog is trash, bloom is everywhere",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was playing fine a year ago, could see anything from nice looking bushes to overgrown forest to camp in and peak through the blades of grass and branches, until they screwed up the engine, now it it just un-optimized clouds of crap with crashing where u barely can reconnect to the same server without restarting the game over and over and over again. Good job crytek!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do you know what the worst part of Hunt is? how long running to the extract takes. Do you know what they just made more longer? Running to the extract...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Buyer Beware\r\n\r\nIf you are in to extraction shooters, you will like this I am sure. For the rest of us, such amazing lore, graphics, sound, gunplay etc. wasted on one of the worst styles of games possible. I got done playing 8 matches- 1 match I did not even fire my gun, 6 matches lost to a single shot from someone hidden somewhere I did not even see after running around for 20 mins. 1 match had a okay gunfight with another player just to die by someone hiding in the bushes again. 2 hours of gaming for 5 minutes of fun. \r\n\r\nImagine what this game could be, if it was a pve attack/defense style game, with hordes of enemies, bosses, and NPC hunters actually dangerous to you. You, with your friends have to defend or attack certain locations against pve targets with all the amazing production quality this game has. It could be randomized too for insane replayability. Instead we have this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "yea they want you to vote this game for steam awads, but the game crashes a lot, servers are held by ugandan bushpeople, this game is the best game in the category of Hunt: delete now (beta edition). vote R.E.P.O. please , because cry-tech doesnt care to fix the easiest problems like when you played bounty clash, after the round you have to select it again because you would play bounty hunt instead......",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to go back to this game since I was playing it from early access to 2022 only to find out that this game does not support older CPUs anymore. It is dumb that the product I bought and worked perfectly fine is no longer viable for me to use on some arbitrary decision made way later.\n\nOtherwise it's fun game but makes one reconsider gaming if all it takes to not be able to play is one update.\n\n [b]Make sure your CPUs support AVX2**[/b] if you want to play the game and pray that there will be no more changes like this. Maybe I'll be back when I decide to get a new PC but for now I will keep malding on this disregard for hardware developer approach in modern gaming.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is very unfair and cruel. On Paper, it's a game where you will level up, and create a powerful Hunter. But in practice, it's a sweatfest where you will die to either Fire Zombies, Hives or Tryhards camping the exits. I used to play this with a friend of mine and we haven't touched it for a while, I came back after ages and honestly. This game kinda sucks. Unless you play this game religious, this is about as fair as a fight between a coughing baby and a hydrogen bomb.\r\n\r\nUnless you like losing, don't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Want to play against a sweaty bunch of neckbeards that are unemployed and are prob reddit/discord mods THIS GAME IS FOR YOU you shit on a squad of them they get their incel friends to mass report you gets false banned for being too good at the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is good game, Sound effect design really good , but the match making system is so freaking bad. Im new in this game after finish the tutorial , search a game for solo , and i kill 3 in the first match , sec match i kill 6 in he map and survive with the bountry . And my MMR became 2000- 2500 .After this happen i cant even see wheres my enemy are or where they hiding at and i die just a shoot or 2 shoot. in 6 match i only kill 1 enemy . Dude this is unplayerble for me , just wasting my time , start the game miss a shoot and die in 6-10 min and repeat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think the two things that really hold this game back are the mechanics and the gunplay. Movement just feels so stiff and sluggish. The gun play is also just so bad, guns are so slow, rate of fire is so slow. All around the pvp, mechanics and fighting just feels so bad almost like a indie game. If they updated the movement mechanics, made things more fluid this game could be so good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This shit used to be goated. this shit is now the most dookie fucking piece of shit buggy smelly unfun rat infested ugly hideous fucking diarrhea icky pooey dogshit iv'e ever had the displeasure of installing and then deleting and installing and deleting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There's no option to play the game without playing PVP and it's not fun being killed in the beginning of the game.  The load time is so long too.  Did not enjoy this game at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has been showing up recently on tiktok from the animations, but is so incredible boring. I played one game and didnt even want to finish the first half of it. do not recomend",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you want to play against cheaters and chinese/russian ping abusers on EU servers, buy this piece of shit !\nOtherwise, keep your money and buy something else (like BF6).\nThe broken matchmaking system.\nThe ludicrous amount of bugs that keeps poping here and there.\nThe stupid consol-wannabe UI.\nDavid Fifield.\nAnd so many more...\n\nI'm done with this trash.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Biggest waste of many the normal 45 minuts mode is extremly slow and boring and the shorter 15 minutes is just annoying and full of campers plus the fact that your character dies pernamently even in the short mod is just stupid DONT BUY\nAlso started carashing every 10 minutes for some reason",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting game. I love it. But servers ISN'T WORKING!!! Servers in this game are the worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "since crytek is a german developer i just want to point out that this game is yet another project that proves that germans cant code (yes it is a more and more true stereotype in the IT world, germans are so bad at software development, look it up). go back to making cars and cleansing evropa of scum please :rip_tyrone: :rip_tyrone: :rip_tyrone:\n\n\natm im still pretty new to this game but i cant recommend it to other new players in this state. there's no solo queue, you have either duos or trios and playing solo versus teams is impossibly hard. \n\n\nif you played shooters all your life you'll be disappointed to learn that there's a huge skillgap in the playerbase: you either queue up with the dumbest lowest skill people you'll never find in other games or with the dumbest cockiest most selfish pieces of turds that exist to only waste your time by making unnecessary pushes towards the mere hearing of a gunshot and all that to only end up camping in the bushes while you're laying dead cause you turned your back from following the objective to assist these insane bush-psychopaths\n\n\nbut there's not only bad things about the game, below I will list all the pros and other cons i observed throughout playing:\n\npros: \n- good gunplay\n\ncons: \n- sound is trash, you will struggle to hear where sounds come from\n\n- p2w skins that conceal visibility of players\n\n- unnecessary amount of mobs on the map that sometimes can spawn next to you\n\n- communication with the community is almost non-existent, they love to add tons of trash tweaks, gun nerfs and trash general gameplay updates that never make it in the patch notes\n\n- bad/non-existent compensation system for server-side networking issues\n\n- unbalanced guns and weapons: e.g. some guns that are very expensive have a high skill learning curve and mechanics to slow you down a bit which is good but they also have ridiculous nerfs such as obstructing your view by adding some comically large meshes on the weapons. meanwhile you have bows that are the cheapest in the game, have a high rate of fire and can oneshot you in the chest or if you put explosive ammo on it, you can just spam that thing and damage players behind cover... what were you thinking by adding this into the game??? (for the latter, who thought of this brilliant idea to add into the game just start nerfing yourself too and begin by working for free if you somehow still have a job you absolute piece of calcified dog turd)\n\n- night maps and rain maps are a paradise for p2w players, these exist to waste your time because what you want to do when these load into your games is to simply extract and hope to get a normal map next where you can actually see anything and heres a free tip for the developer if you they ever get lucky to read this: you cant have p2w skins and these kind of maps without having a large chunk of your playerbase to simply refuse to play on them\n\nnow for the final score, are you ready? \n*drums rolling*\n1/10, will play again once in a while to pass time with me friends cause I really like the gunplay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "elo mm sucks, matched against 45 prestige players as a beginner....tf?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "id give this a better review if they brought back revive bolts and not make necro one time use. stop pandering to the babies.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you want to play this wonderful game it's better for you if you don't know how to shoot appartently, because if you're shooting too well, maybe because you played a lot of Fpss in your gaming life, then  you get banned. \nNot only that, not only the customer service totally sucks by refusing to tell you why you got banned, but they also wash their hands in the shortest possible time, closing the practice without further investigation. \nToo bad if you're not a streamer sponsored by them, i guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generic team shooter with a somewhat interesting setting and absolutely [b]godawful[/b] twist: when the other player instantly kills you, you lose all your progress and items.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too sweaty matchmaking, you will get paired with veteran who can sense your souls from miles away",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dead servers playing and finding no one at all or hiding in bush with shotgun sim and get 3rd party main menu sim so pog",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really don't enjoy playing vs russians all the time. They have high ping so my shots never registrate. Its a known problem for a long time now. I'm giving this a thumbs down because the dev's keep ignoring this majorly known issue",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "By far my favorite grinding looter shooter however won't launch after last update",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Завораживающий геемплей. \r\nУдалил игру спустя 4 часа.\r\nА мог после первого часа игры возврат оформить.\r\nДелайте выводы.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Such a cool idea and setting. PvP is bad. I wish it had real PvE.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It isn't very fun or good and everybody cheats",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The. dear hunt showdown devs. I have been dealing with the most awful bugs know to man kind, who are you. what are these servers. i have never experenced anything like this before. and i have played GTA online for more than 5 FUCKING YEARS. Yes 5 years of gta is ALOT of bugs. but this game has been out sence 2018 and you cant comprehend to fix a bug that refuses me to play. What do i do. what can i do. this is not a fucking hide and seek game, i lose a survivor each time this happens. Is this fun to torture people by making the server udder dog shit? And this would be a bad concern if you didnt fucking focus on a POST MALONE circus event. Artist is dogshit btw. Fix your game or you know DAMN well im walking to the bank happy,jolly and ready to get my money back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game was great when it was region-locked and not plagued by Eastern European and Asian cheaters.\n\nFix this and it'll be great again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately they have still not fixed numerous UI bugs over a year later after the 1886 update and as fun as the gameplay loop can sometimes be its not worth the buggy UI, the 5+ minutes for queues and the the devs prioritizing cosmetic content over actual gameplay and QOL changes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It already starts to get boring, It feels so incomplete. And in contrast to other titles esp. from crytek is this one a meh. From Gameplay to most important the poor grafic's in comparison. I like the gunhandling tho.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe I'm just bad at the game, or there's a lot of hackers on the west coast servers. Sure feels like a lot of cheaters with fishy snap headshots through walls, and getting domed by a guy dual wielding from a position where he shouldn't have been able to see me. I don't think I'll ever install this game again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has always had a problem with cheaters, but ever since the dogshit renaming of this ass game it seems like now the dogshit devs actively avoid banning clear and obvious cheaters that even a blind person could detect. this game used to be fun but at this point its genuinely painful to run into fuckers that are completely invisible or using clear and obvious aimbot from across the map and yet the anticheat does nothing and the devs dont give a shit. sadly the point of a game should be to have fun and this cheater fill garbage hasnt been fun in a long time. To sum it up dont play this game its not even close to fun anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i play this 2 years ago - it was good\ni played this 1 year ago - it was good with shit intreface\ni played this game 10 minutes ago - it was full trash game cuz i disconnected 4 times. In start, when i changed my resolution and meanwhile i just play thi game\nthx for this, guys, u get it. It became rly one of the worst game rn",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game for about a year and during all that time I have constantly struggled with the same issue: the servers are terrible. I changed internet providers, I upgraded my connection, and I even moved to another country, yet nothing improved. The servers remain unstable. Out of all the games I have played, this one has the worst server performance. It is truly disappointing because the game has potential, but the experience is ruined by these persistent server problems.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for 10$ more you can just get Arc Raiders. Crytek had all the time in the world to make this a product that the consumer can rely on and they failed miserably. Goodbye hunt you had some good moments but we need some competition in this gaming space because you guys clearly do not care about the players as much as you should.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Summary: a great idea in a poorly optimized and bad implemented game. 2000% frustrating.\n\nThe game dynamics is fun. I really enjoy the game. \n\nProblem? The optimization is a joke. It cannot have an update without start crashing again and again, making the game unplayable. It passed to be one of my favorite games to one of the most frustrating experiences. \n\nAnd the support team is just useless. Every time that it starts failing the game, they come over the typical: did you updated drivers? OS? reinstalled game? did you checked file games? etc. etc. Every. Single. Time. \nThey think that reinstalling the game is a normal step to do every time that they update something. \n\nComing back to the internal features. I don't know how they make it... but the development team is incredible. Awesome. Magnificent. Every update, they break something that was working already fine. There's no update without bugs and crashes.\n\nAnd not, let's talk about cheaters and hackers. From dozens of reports that I've sent, none had received a reply. And once in a while you are in the middle of a match where you suddenly die becuse of a shoot from the other side of the map.\n\nIt is really a good game. But it's unplayable. Frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cant play the game sine update it all way say region unavailable and cant find server i can only play 1 game and the problem happen need to restart the game to play another 1 round and region problem happen angain i try every way to fix it but i cant",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trying to start the game now is a waste of time. The match making is horrible and the current player base are all sweats.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Engine throws null memory values, crashes the game. Try to rejoin, Crytek hasn't been able to figure out how to rejoin in 6 years. Game crashes in the rejoining.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm a worm in this game. This game is for a bunch of incompetent people. Buying a game like this is for people who are not as fucked as the creators and their wives are fucked out of the water. It's a game of shame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fine, developement history is shitty.\n\nAfter the last big update there is still no ultrawide support for the ingame-UI. But hey, we got a shitty menu layout for the PS/XBOX-Players (which don´t even make a relevant playerbase in numbers), a big bunch of grinding events and a lot of ingame skins with microtransactions. But there is no time fixing the basics?\n\nThey will never admit it, but they tried to lure in new players via console and fucked it up. The new ones don´t stay long and meanwhile a big part of the old playerbase left the game. See the numbers urself, there are less player then before the big update, which should have functioned as a restart. That´s how u fuck up ur own community.\n\nBeen here since the EA, will still stay around a while, but I don´t see how this game could re-develope the fascination und core gameplay in the future, if it´s just for the cashgrab.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mfs will hype this as the best extraction shooter and then it's just where's waldo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nerf solo necromancer\npost malone skin, buy some more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"15k\" people play this game... They banned 5k in the last ban wave... You do the math on how many cheaters there are X )",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "full of cheaters now rain maps suck it used to be a good",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "gAME doesnt open terrible black screen fix ur gamer riot",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "was such a fun game that got ruined by the rebuild",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too many chinese in asian server\r\nthey all suck...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has turned into a last hail mary cash grab by Crytek.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "everyone is fat and LGBTQ+ in this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Battle pass in paid game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is absolute shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Full of tryhards giving you no chance to do anything at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The servers are so fucking shit its not even funny",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit game written on a shitty engine",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "same engine as warface (mobile game for pc)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "number 1 bu11šit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "probably the worst type of matchmaking in existence",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is not deserve your time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This shit crashes every fuicking time now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be a gem, now it's messed up, and greedy.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i hate the matchmaking in this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "В игре присутствуют большие пауки",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely would rather grind war thunder",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Full of Rats...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad servers",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}