{
  "positive": [
    {
      "review": "I moved on from Civ6 with no regrets. Old World has brilliant AI which knows how to fight wars, making it a real challenge to fight neighbouring empires. I just finished my first game and probably came last, but I was glad just to have survived that long.\r\n\r\nI love the inclusion of Crusader Kings style story lines, they could probably go further along this path.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Can't recommend enough.  Reminds me more of Civ 5 than anything but improves on a ton.  I am really enjoying the game.  Cannot believe more people aren't playing it.  Highly recommended, coming from a player with the most played games being civ 4 through 6",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Sincere props to everybody involved with producing this incredible strategy game. There's so many things Old World does right that sets it apart from the competition.\n\n[list]\n    [*]The #1 thing I want to highlight is the fantastic UI/UX. Strategy games can hide a lot of complexity only emphasizing the need for clear and obvious information. It's here where the game really shines. UI panels are intuitive to read and stuffed with helpful details. Game concepts are written as hyperlinks you can repeatedly SHIFT-CLICK to expose stacking detail panels. The encyclopedia is well written. Boundary lines are clear, unit move distance is apparent, everything just comes together nicely to make the learning experience smooth and engaging.\n    [*]This is the first strategy game I've played offering an undo button. Did you accidentally click the wrong hex when scouting or make a tactical blunder in combat? CTRL-Z to undo. Want to experiment with a few moves and see their impact? Feel free because you can undo an entire turn if things don't work out. I never realized how much I needed this.\n    [*]Old World introduced an orders system that governs how many moves you can execute per turn. This was the thing I was most excited to try out and I'm happy to say it leads to an intriguing puzzle to solve. You have 27 orders this turn...do you want to spend that scouting, engaging in warfare, building up your nation, dealing in politics, or do you instead bank them for extra gold? Some turns you won't have enough orders to do everything you want, others you struggle to even spend them all. Combine that with the undo action and it makes each turn feel truly dynamic.\n    [*]The leaders and politics are fascinating. You're constantly managing reputation and finding ways to effectively utilize these powerful figures from ancient history. Lines of succession get redrawn amidst death, marriage, and children getting born into the family. All your characters visually age over time making you feel connected to them, and some of the choices personal.\n    [*]Throughout the game you're presented with so many rich and satisfying decisions. There's numerous resources to juggle. Technology is randomized each game. Events frequently present themselves with a cause and effect scenario. Leaders level up giving you choices about how to shape your nation. Workers have an abundance of rural and urban improvements to build. Combine all of that with the orders system and it's just endless fun to tickle your brain. I end each round with anticipation, begin new ones with enthusiasm, and find it difficult to deny just one more turn.\n    [*]Combat is actually tactical beyond your standard rock-paper-scissor unit composition. Spearman target enemies in a line, axemen attack multiple units in an arc, cavalry can route (attack again after defeating an enemy), some units benefit from adjacency. Generals can be assigned to units to further enhance their capability while also leveling up.\n    [*]And the music...OMG they chose some real beauties here. You can't go wrong enlisting Christopher Tin. Songs you dislike you can disable from rotation. And in a clever touch the music doesn't actually kick in until you've researched drama, at which point this game soars above the clouds.\n[/list]",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Brilliantly designed, innovative, criminally underrated 4X. Really captures the messy nature of an ancient kingdom without many of the typical strategy-game anachronisms and genuinely feels like you're playing through an alternate history. Civ is the natural comparison and OW improves on it in virtually every way. Bought it on that other store at launch and then bought it again on Steam to support the devs.\n\nIt is *hard* - wildly complex, and the court and events system makes games deeply unpredictable. Incredibly rewarding once you wrap your head around it though.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I hugely enjoyed Civilization V and did not enjoy Civ 6 at all.  This game is the continuation of Civ for me.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Way better than Civ 6 so far. I was hooked right away.\r\n\r\nAdds elements of Crusader Kings like family succession, love, betrayal ect that makes your empire that much more meaningful. Will you leave it to your first born or to your only son? Will your twin brother attempt to assassinate you?",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "complicated and interested.  better the more i play.  always understanding new things.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "As a long time Civilization fanatic who mourns the downfall of my favorite franchise (starting at civ 6), I hereby unofficially nominate Old World as the official standard bearer of the civ like 4X genre. I also officially nominated them for the \"Labor of Love\" steam awards.\n\nPros: \n-Hands down the most well thought out gameplay mechanics of any recent 4X \n-Excellent storytelling ability via its situationally proccing events\n-Meaningful diplomacy that integrates into the event system\n-Strategic combat with good utilization of terrain \n-Outcomes in combat that have overlap with the events system\n-Surprisingly clever AI opponents\n\nCons:\n\n-A half hearted implementation of a CK3 style family tree minigame. It has good bones, but seems to never have really been fleshed out in a way that has a meaningful impact on your gameplay. I want to care about my family members more, but sometimes all the characters just blur together.\n\n-While Old World has many similarities to the Civilization franchise, it lacks a certain kind of charm that Civ has. I think its likely due to the narrow time period in which the game covers. While a game in civ can span from the ancient to the modern, OW really only covers a narrow slice of a specific historical time period. While in theory this focus has some upsides, it kind of translates into bland progression of the technology tree. Most new units are just slightly more powerful versions of their earlier counterparts, but otherwise thematically identical.\n\n-Poor end game experience despite good intentions. In an attempt to remedy the end game grind that other 4X games are plagued by, the OW implemented an \"ambitions\" mechanic which essentially finishes the game after meeting a set number of smaller incremental goals (similar to a light version of victory conditions in Civ). While I enjoy this mechanic throughout the game as a fun incentive for accomplishing specific actions, I find it to be both an unsatisfying and anticlimactic way to finish a game. Instead of rethinking the end-game grind, OW devs seemed to have tried to sidestep the end-game all together. But if you're like me in that you enjoy long drawn out domination victories, OW suffers from the usual late-game fatigue involving tedious levels of micromanagement. Do you enjoy dragging 50 units across a large map one-by-one? Me neither. And while technically you can automate workers and cities, the bad AI for this renders it practically un-useable (in stark contrast to the excellent combat and diplomacy AI). Conversely, I feel like there could be some innovative event based solutions to these issues, but surfacing them would require a handful of outside-of-the-box brainstorming sessions (with possible chemical enhancement required for increased lateral thinking).\n\nOverall:\n\nDespite some glaring flaws, Old World does so much right that others in the 4X genre could really learn from. As evidenced by my playtime, it is objectively one of my favorite games. If you enjoy the 4X genre, it might just become one of your favorites too.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Old world has been one of the greatest 4x games iv ever played, stacked against civilization 6, 40k gladius relics of war, Humankind, civilization 5, zephon, its still one of my all time favorites and eventually  my most played game on steam. The developers of this game are so far and hopefully for the future the most caring team for a game iv played yet, they roll out updates, fixes and feed back like no one else in the industry. Im positively floored all the time when i open steam, always something in my news feed for this game, iv come to expect nothing less of Mohwak games. As of this review i am nominating Old world for the labor of love award because of much care they still put into this game after 3 and half year. \n\nim not the best at describing games but for me, old world is a mix of games, its like if civ 6 and total war rome 2 had direct control of its people in power, shaping its inner dynesties and  ruler's  with random events and encounters to shape those people, more in depth diplomacy with nations and other characters of intrigue.\none day i hope to see more games use this style of 4x and story building.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of my favorite games. You wont even realize just how deep it is before you at least have 25 hours in the game. Many people want to compare this game to the Civ series and while the graphics LOOK similar.......this aint Civ. Civ is but a children's game compared to OW. I highly HIGHLY recommend this game to everyone who wants something more than graham crackers and milk.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent game, focused and great experience",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best 4x game i've ever played. Game mechanics, the music and the art style is really good. Games like this gets boring after few hours doing samething like a lunatic, but the random events makes it fresh,makes it fun just like in the crusader kings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven'y played enough to give a proper review, first impression is good.\n\n- nice polished UI and visuals\n- incredible music\n- great depth\n- uses the engaging formula similar to civ games\n- good tutorials",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought this for a friend to play multiplayer.............the multiplayer interface is the dumbest interface I've ever seen and \ninstantly turned us off from playing.. it was his first time playing and its unlikely he will ever return after that\n\nSingle player is quite awesome, however and I do recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best depiction of the bronze ages, ever.\r\nReally sends you to Troy, so nice to be the Priam and the Hector both at once.\r\nThis game might as well be the first on my list, of which games I would bring to an uninhabited island. \r\nTo experience something so dear, that was lost to time so near totally, hits me in the feelings.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Highly replayable and historically fascinating 4x civ-builder based on playing some of the most legendary and powerful civilizations of classical antiquity. The game developers have striven above all to create a fun, challenging and rewarding, integrated *game*, where any mechanic that doesn't contribute to creating an interesting and enjoyable experience is jettisoned.  This is one of those rare games that is based on a (shared) vision of what makes a 4x civ-type game great, rather than a dreary corporate hodgepodge of amalgamated game trappings masking a dull and hollow care. Tight, interlocking systems with some novel 4x mechanics, such as the order system and deeply-integrated roleplay elements. Old World is the gem, the 4x game for the cultivated 4x gamer...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Maaaan, this game made me fall in love with 4X gaming again. Heavy Comparisons to Civilization with MASSIVE differences. Everything about Old World feels so refreshing. The fact that your unique units are always relevant (remember how they become obsolete in Civ?), the order system is such a joy to navigate and dominate, city state settling and event based character development are all really solid choices for a 4X title. \n\nThe music is relaxing, the wars are not. The tech tree makes you feel like you're gaining an edge over your opponents. I'm playing a lot of this game lately.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old World is a great game that is keep improving after all these years. I can definitely recommend it! Looking forward to the future DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game combines the itch of Civ like games with Crusader Kings like character building. I find very enjoyable and I keep coming back to it. It also deals with my major personal irk with CIV games where certain factions feel completely out of place (United States or Australia being around during the bronze ages).\r\n\r\nI keep coming back to it and I recommend it to anyone who likes these types of games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finaly an amazing alternative to Civ games.. I don' t mind it staying in one era, but overall devs have pulled off an amazing evolution to the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it. For 10 $  this is just great bargain. It is like Civ but more natural. Clean and great performance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is like a cross-over between Civ 6 and Crusader Kings 3, but a lighter version of each. It's more focused than Civilization 6, spanning from about 800 BC to 500 AD and only including civs from the Mediterranean/Levant regions of the world. It has events involving your player character and their court/family, with light role play elements. Pacing is good and more realistic than Civ where training a scout may take 1000 in-game years (one turn = one year in Old World). The graphics are good, nothing to get too excited about but good enough that I don't mind looking at the map and features are discernible and distinct. The interface is decent but a little crowded, it's helpful to play the tutorial just to know where things are located. I'm taking time off for the first time this year, finally, and I've got my wife playing one session with me, my son playing another, and I've got my own solo campaign I'm playing. I haven't gotten hooked like this in years, I hope you have a similar experience. For $10 and 3GB on my hard drive this is an insane value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing Turn Based Strategy games since Civ2, and I am rarely as impressed as I have been with Old World.   It has layers of depth not seen in many games and takes hours to master.  I learn something new every single time I play.  The intrigue and politics give this game depth and interactivity that make you honestly care about your leaders and create interest.  One of the best games I've played ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Old World! This game is more fun than Civ to me nowadays, because the random events (based on actual historical events) and the character system create much more variety from game to game. They also create frustration^^, because there are negative events, characters can be insubordinate, etc. but on the other hand that's funny (mind the mischievous pet monkey!) and makes the game more challenging 'cause it doesn't always go to plan (like in Civ, where it's the same all over again every game after some time).\n\nThe order system needs getting used to at first (but you can revert your actions when playing single player, which is quite cool), but I find it prevents you from snowballing too hard (like in Civ), where the game is just over in mid-game and I never finish my games 'cause it gets boring. Also cool in Old World is the setting that makes the AI hate you more and more the closer you get to winning, which simulates a multiplayer FFA lobby quite well imho and keeps the game interesting until the end, when the AI will mass war you to stop you from winning (because of course eventually you would snowball here, too).\n\nDisclaimer: I only play random maps either against the AI or with friends, but there are also scenarios (which are supposed to be quite good). The vanilla multiplayer balancing is very good (actually A LOT better than Civ) and the devs are really giving a lot of attention to the multiplayer mode. FYI, I have >3000 hours in Civ V and VI combined and still love these games. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a veteran of 4X games, playing since ancient times of first Civilization I am very intrigued by Old World.\nRandom event and aspect of leading dynasty are adding some tactical preassure.\nGraphic and music are great. Instead of leading civilization across all the times, we are managing ancient nations at short time of it's history. That's for pros. \nAbout cons - because of game gendre each game session demands few hours. Unique mechanics of Dynasty relationship and special abilities happens to be overwhelming same as too much of randomness of events makes game harder to predict. Unexpected end of game is something to be expected.\nAt the end of day I am very satisfied by the game even if i am sometimes overwhelmed and giving up that day, i am coming back another day.\n[h1]Overall rate 7,5/10[/h1]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "36 of the last 72 hours tells me how addictive this game is, lucky my old laptop is still holding it together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much more story and depth than in Civilizations, which I grew up with since the first part. Events, intrigues, personalities, and surprising situations that can change the direction of the game. The game developers listen to the players, and update the game regularly. New DLCs arrives at a suitable pace, which adds spice to the soup. The only downside is the warfare between nations, which feels unnecessarily difficult against the AI. On the other hand, the fault is probably with the player. ;)\r\nA strong recommendation for everyone who is even somewhat interested in this game genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Civ and Crusader Kings had a baby, this is the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. To those that say it is a Civ clone, NOT!!!!!!!!!! If you try playing this like you would CIv you will lose.  \nMany subtle differences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: remarkable in every way! the feud of oldworld x civ x humandkind continues :D\n\nI love it and especially appreciate even with a small team they are competing with AAA\n((a small opinion in improvement, when the game goes on above turn 80+; I think due to the amount of information (characters units buildings and whatnot) are huge, it slows down the performance even when I change the graphics to extremely low), hope devs continue in solving this))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Previous to playing Old World I'd played Civ 5 & 6 extensively, which are relatively similar titles. Unlike Civ, I feel like coming back to Old World. Each playthrough with AI feels fresh and unpredictable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reminds me of civ but with some rpg elements. I like the combat, progression, and dynasty mechanics. I've enjoyed single player, I still need to try multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Something like old school Civ but with the addition of dynasty management. Historical and doesn't stretch to the modern era or anything fantastical but that makes it more realistic than having 1000 year old warriors alive during the space age.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game, more fun than Civ IMO. Very moddable, I wish the community was even bigger. No complaints.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Superbly designed and refreshing alternative to the Civ series, packed with good ideas and innovations to the genre. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Crusader Kings/Hearts of Iron is too much of a headache for you but Civilization is too bland for you, this is the game for you. It's just a smidge above in complexity over Civ but the mechanics are easy to understand.\n\nDon't get me wrong, Civ and Crusader Kings are great games but this game is just that type middle ground that hits just the right spot between complexity, ease of understanding and casual kingdom management.\n\nYou can ignore the reviews that say \"bad UI\" or similar, the game got Quality of Life updates all the time since I purchased it and the base UI is up to par for Civ WITH mods.\n\nSome drawbacks: game feels pointless in the late game (for me), you're forced to engage in combat in the early game to get an edge, the city automation is pretty braindead and comes in very late.\n\nThe minuses are very small, the core game is good. Worth full price, buy and play later on a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A successful fusion of the Crusader Kings series and the Civilization series. (It leans more into Civ than CK.) One thing I appreciate here, is that like Civ, it's a 4X game with multiple win conditions such that you don't have to end it by conquering everyone.\n\nOne neat mechanic is that each turn you have a set amount of \"Orders\" to work with, which you get based on what you've done in game. You can divvy these up as you want between your units, such that you can have turns where some units move extra, and other's don't move. Another interesting mechanic is that the technologies you research are a deck. When you unlock a new tech and new options open up, those new options go to your discard pile. When you get the option to research, you get dealt a hand to choose from. (there are also some one-shot effects on cards that you can mix in as well.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than CIV 7.\r\n\r\nKind of similar to CIV 5, but handles religion much better, has its own fresh unique mechanics etc. \r\n\r\nI love Old World.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game deserves more attention. Way better than Civ 7. I have CIV 7 and i would rather play this which is an older game, that costs far less and is miles ahead ini terms of gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great deep strategy game. Love the art and music. Managing your kingdom is hands on until the very last turn. Every event and decision feels impactful. I strongly recomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like so many other games of this type, it's almost impossible to win but, with the variety of units available, It's great fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started properly enjoying Old World after i stopped playing it as if it was Civilization.\nAnd i get it, that's not easy, because initially it basically screams Civ at you.\nIt took me quite some time.\nFor anyone who persists, there's a rock solid game here with a lot of mileage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took a while to get into but its getting better nonetheless after 10 hours, don't expect to rule a kingdom your first play-through, if this is your introduction to these type of games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review after playing this game for 145 hours, i'd recommend this game for players who like to play Civ-kinda-games because;\r\n\r\nit was an experience to search how the game works worthy to be played by people who like this genre.\r\n\r\n\r\nSome minor things that could've created a more worthy experience (but i insist to write to myself & others these minor things are unworthy atm because i do not know how difficult and more challenging it would've been for the creators to implement them);\r\n* no fixed places for cities (it was a problem at the start for me but in a second gameplay in the-guys-with-elephant-units-story-wise game that i haven't finished yet, i was told not to build too many cities.... and halfway trying to use to rules to adapt a 'city-spot' to my capital... it turned out to be impossible or even build infrastructure that required 2 culture based spots on the map... & i even couldn't adapt them to my capital... so i had to send a settler to those spots to make their culture spots available to be used as described what they are).\r\n* multiple army units on the same time like 3 - 5 would make it more 'realistic'\r\n* the music... i think i skipped & clicked about 80% of the music to never wanted to be heared again by me (this option is great tbh because some music songs are realy nice)\r\n\r\n\r\n\r\nGreat game that stand above the minor things i noted down above.\r\n\r\n\r\n\r\nThank you & good luck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tl;dr: If you are into strategy/civ-style games, buy it. If you aren't, but want to try one, buy it. If you like history, buy it. 10/10, love this game.\r\n\r\nI've been a longtime player of the Civ games, but have been disappointed with recent iterations and the game overall feeling to \"same-y.\" I found Old World kind of by accident on Steam one day, and it sat on my wishlist for YEARS, and I finally caved and bought it recently: SUCH a good decision.\r\n\r\nI've had so much fun playing this game, and even after 2 full playthroughs, I feel like I've only scratched the surface in terms of what the game can offer. There is a lot of information to start with, but the game feels like it builds very naturally, and each new playthrough is an opportunity to explore more features.\r\n\r\nI absolutely LOVE the amount of research and care that has gone into historical accuracy and tying in real-life leaders with the in-game characters. Even the links to the Wikipedia articles blew my mind a little. This game is such a product of love, and I can't stop recommending it to friends. Absolutely blown away by the quality and can't wait for more DLC and updates.\r\n\r\nIf there was one thing I wish we could explore more it would be family and romantic relationships. There are events for randomly taking a mistress or second spouse, but I wish there were more direct ways to initiate these directly, especially for characters with the Bi/Gay traits.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting game with new and fresh mechanics in a world where everyone is cloning the civ franchise. \nI really like the small details in combat like how it is harder to shoot into the forest. \n\nWould definitely not recommend as the first 4X game or for people who dislike the time period and technologies.\nAs you are limited in scope and wont be able to build nukes or guns and such",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I saw this game mentioned once in a PotatoMcWhiskey video years ago, then didn't think about it again until I saw it on sale for $5 a couple weeks ago.\r\n\r\n40 hours later I'm hooked, and got all the dlc.\r\n\r\nIt's such a good game! The 4x elements, the families, the stories, I love it. I'll be sticking with this one for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This blends Civilization with elements from Crusader Kings that revolve more around characters and personalities. There are family members and heirs to worry about and important figures of authority to please. On the strategy and management side, you can research technologies only from a drawn lot and build settlements only on a limited number of random locations, so the gameplay is less predictable and more challenging. Almost everything you do uses up orders or command points, which comes with a cap depending on how well your game is progressing. This adds some realism to the game as if you were actually a ruler in charge of a complex nation, not just an abstract administrative entity.\n\nI think these are good features to add to the more typical Civ experience, even if they are not radically new.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Civilization-style games, then you will probably like Old World too. It runs well on my PC without any crashes.\n\nI have some minor criticisms:\n  ðŸ¢– No much genuine innovation in the game design.\n  ðŸ¢– Slow gameplay progression due to multiple game mechanics that only offer marginal progress.\n  ðŸ¢– Little true strategy. It is mostly a city builder with some wargame functionality added to it.\n  ðŸ¢– Too many game mechanic layers such as the royal family that is just tedious.\n\nConsidering that this is the first historical strategy game from this developer, it is a very good effort. If there is a follow up to this game, it should include less but more impactful game mechanics with real strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely good, hardcore, 4X strategy. The orders mechanic, while complex, is a brilliant way to balance action economy. I frequently find myself making nuanced high impact decisions each turn due to the orders system. Max difficulty is a genuine challenge. Unlike Civ, archers aren't the ultimate unit because they do lower damage per order spent than melee units, which encourages using a diversified army composition.\n\nSome things I think can be done better (around 1 year old advice, so it may have already been fixed):\n1. Buying unit upgrades with money is abuse-able since it is far cheaper overall to build the cheaper unit and upgrade it rather than building the upgraded unit directly. For example, building 10-20 of the cheapest horse units, getting the tech for their upgrade, and upgrading all of them at once and storming the enemy is extremely powerful and may want to be nerfed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Challenging to master, but always fun to play.  I think this is the best of the current offerings in the 4x category, and I am eager to see what comes next from Soren and his team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "complicated as fuck, but really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was debating on getting this or civ 7, I'm so glad i got this. The tutorial is helpful while letting you do thing at your own pace. there so much to this game. OH and the UI OMG its one of the best in the genre!!!! Only a 100 turns into my first save file, and holy smokes I'm addicted",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good. Underrated 4x strategy\nI appreciate the historical value and the interesting character interaction mechanics (families, rulers, advisors, and others). However, certain elements, such as religion and relations with tribes, are underdeveloped. Many interesting historical events and storylines require the purchase of DLC.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i didnt play at launch so this review is based on it today  but as of right now im hooked on it, just crusader kings although less complex and civ but more complex than that,  just get this over civ 7, its really good, hoping more civilizations are added but its not needed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid, perhaps lighter, mixture of civ and crusader kings set in specific era.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has basically ruined the genre for me, every other 4x that's come out in the last say 19 years feels completely packed with tedious nonsense in comparison. I doubt I'll ever be able to enjoy a new 4x again but I also doubt I'll need to.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fantastic blend of 4X and RPG style dynasty building",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit they made Civ IV again and it's even better this time around because they put Crusader Kings in there.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just excellent. Don't think I can go back to Civ after this one. The traditional civilization building mechanics and all are well done and enjoyable with a host of improvements on the formula, but it's the RPG-style simulation of your court/dynasty that's been the surprise highlight for me. \n\nIt's simultaneously incredibly cool and bittersweet seeing children born, growing into roles, finding success/failure, aging, and inevitably dying. Some have tragic fates, some become absolute legends (RIP King Bostar the Magnificent), some are rebellious, backstabbing shitheads (looking at you, Queen Consort Fairuz...). Some may die in their 20s, and a lucky few will defy the odds and live into their 100s. You never know, and it's always exciting watching their stories unfold. This aspect hooked me on the game more than anything and I really really love it, it added so much flavor to my playthrough and made it a lot more memorable.\n\nNow, time to buy all the DLC...",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I bought this last year and only now have started to play. I should have played it more. It's a great game and I'm quite enjoying it. It's sort of a CK-lite and Civ cross. More Civ than CK but it has it's on twists on the Civ game play that is very enjoyable.  I give it an 8/10.  :-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice visuals and good mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The highest level of recommendation for any 4X fan out there, just to get out of the repetitive cycle that CIV iterations go through in every instalment.\n\nWhile the game is a bit harder to navigate on Steam Deck, trackpads come to the rescue.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old World is a game I come back to regularly when I need to scratch that TBS 4x itch and it never disappoints. The RPG elements are good, the TBS elements are a good blend of innovation and tried-and-true (the houses system is particularly good), and the one-more-turn-ness is out of this world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the mix of politics and succession with civ and world building is extremely appealing to me. It melds really well!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played the original Civilization when it came out and have played every iteration since. I decided to try Old World as an alternative and have been absolutely thrilled at the experience. Civ tends to play through in a very similar fashion every game, with a lot of repetitive actions. Old World has a lot of these same actions, but it offers something much more. Every turn is deeply engrossed in story driven decisions that change with every playthrough. You are not just some King/Queen, you have heirs, ambassadors, ruling class families, advisors, generals, and many others. They are not just there in name, but you take part in their development and decision making. This makes every character in the game feel much more alive. Maybe you marry off your son to another empires daughter in order to broker peace. You can abdicate the throne or chose to be a general in one of your armies. All of this makes each play through a completely new experience, and this is something Civ has never been able to do. If you like Civ or have friends that do and you are looking for a better alternative to the new expensive and problem ridden Civ 7, then tell them this game is worth every dollar. I got it while it was 75% off but would have happily paid full price. You can rename most names in the game and even be the first to explore and name landmarks. The game can be funny or dark or serious depending on how you make decisions. Do not pass this game up and do the world a favor by supporting this game that could truly push new innovation in this genre. You will not regret it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a fantastic game. The story is immersive, the gameplay is interesting, and the graphics and music are breathtaking. It's like a mix between Civ and Crusader Kings. It's like if Civ was a visual novel. It's so much fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game, as a long time player of Civ 5 and 6, plus CK3, I find this game takes the best aspects of each and created something challenging, beautifully laid out and a treat to play. The UI is good, the nested tool tips are a big help and the soundtrack is worth the price alone. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "well designed game.\r\nI play without DLCs and it already feels more deep & well-thought then the CIV series.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: I became aware of the game some months ago and it soon developed into one of my favourite games. Thus, I can really recommend it. The complexity, level of strategy depth and historical flavour of this strategy game are really outstanding.\n\nThe Good:\n\n- The game has a level of complexity and interconnectedness of game mechanics that are rarely found in gaming. This is one of the few examples of games that still try to simulate a world instead of streamlining the mechanics to the point that it could also be a board game. (Don't get me wrong: I really like board games. But if you can use the processing power of a computer to simulate a world, you should do that.)\n\n- The AI in this game is really good, one of the best I have ever played against. (I do not consider myself a hardcore gamer and winning an epic victory in scenario 3 of the Carthage Campaign really makes me proud.)\n\n- This game ouzes historical flavour. This already shows in normal games, but the campaigns are really great! Not only have I had lots of fun, I also learned a lot.\n\n- The soundtrack is great. (You have to research \"Drama\" ingame for the music to start, which is a nice detail)\n\n- The long term support for the game is great. Many larger companies should take note how regularly and transparently this small indie company supports their game.\n\n- The base game is really good as a standalone and the DLCs really are optional. I own each DLC and I love all of them, but I cannot stress this enough: This game is not the typical jigsaw puzzle which is unplayable without buying each DLC, but a really good game all on its own. You can have lots of fun just with the base game and later add in all the DLC you like to get more content (like new campaigns) or deepen certain game mechanics.\n\nThe Bad:\n\n- The good AI comes with a price and the price is payed in computational ressources. Even on newer computers turns in the late game can take some time due to all the background computations that need to be made in order to get such a competent AI.\n\nThe Up to Taste:\n\n- Due to the complexity of the game, it comes with a considerable learning curve. You should consider the first 50 to 100 hours of play as your tutorial and should not get discouraged if you get your behind handed to you by the AI, especially in warfare. After this learning phase, the fun really starts. It is worth it.\n\n- The game is made by a very small studio and they achieved this great game by really focussing on a specific timeframe (classical antiquity) and geographic region (middle east and mediterranean sea). I for mine love it.\n\nAll in all, a solid 9.5 out of 10 and one of my favourite games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice alternative to Civ, particularly after Civ VII debacle. Good immersion too",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Crazy good! Base game has a ton of depth by itself, and the DLCs are all awesome. Best of all... its cheap! Try it out, especially if you enjoy ancient history.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If only all 4X games were designed as well as this one. I strongly recommend it if you enjoy this genre of game. \r\n\r\nOld World takes the familiar 4X formula and tweaks it in all the best ways. The game looks beautiful, the music and sound effects are great, the UI is extremely user friendly, the game ran flawlessly for me, and it quite possibly has the most clever AI I have seen in any 4X game. After playing civ games all these years, I was shocked to see AI using actual tactics to counter strikes into its territory. \r\n\r\nI originally gave Old World a hard pass when it was released for three reasons. Firstly, I was waiting for Civ 7 but, like many others, I decided not to support their new business model of fleecing their fans which got me taking another look at Old World. Secondly, I read reviews indicating that Old World had a 200 turn-limit which was a deal breaker for me. However, I have since learned that you can set your own victory conditions with or without turn limits. And thirdly, I enjoy playing 4X games that span the breath of human history so I was unsure whether I would enjoy being restrained to the Classical era. However, Old World is a good example of how compromising breath for depth can allow for greater immersion which I enjoyed more than I thought I would. \r\n\r\nKeep in mind however that Old World is coming from a relatively small development team which is reflected in a game that does not quite match the grandeur of some of the big players like Amplitude, Firaxis, or Paradox. Nonetheless, what Old World might lack in quantity, it more than makes up for in quality with some of the best UI, AI, and game mechanics I have seen for 4X games. \r\n\r\nI am so glad I gave this game a chance and I dont think you will regret it either.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Jeu cool et r/fl/chi.  Meilleur qiue CIV et compagnie 'a mon humble avis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well balanced game.  Very enjoyable for Civ fans.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "civ meets paradox in the ancient world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very similiar to civ but much cheaper",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ever strategy game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "very fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best 4X game I played since Civ 6",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "better than other sims",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't support Firaxis.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More fun than Civ.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More fun than Civ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid Civ clone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Your decisions matter and you are faced with many of them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Replaced CIV for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my top 3 favorite games",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Odd game, everything is in order, has ton of content, QoL and all of it in functional great looking package...\r\n\r\nbut it is simply not fun. What kept me playing was curiosity, not the gameplay. And I ran out of the curiosity.\r\n\r\nThe issue is, the game tries to look on surface like more complex Civilization, but is in fact much less complex and intriguing than any Civ I played (3-6). On surface all looks complex - dynastic relationships, court, generals, activities, decisions... but it is a front for many systems, that do not feel deep or meaningful to interact with.\r\n\r\nSomehow, this game has worse diplomacy than Civ Beyond Earth, somehow it has a dynasty system from CK3 that feels like it does jack shit, and reduces many instances of strategy to choose one of three/four options (as if this was one of those brain dead Survivors clones), making the game just kind of not exciting the play. It drags, not much happens, no choice feels meaningful. You can build cities, guess what, only on city sites, further taking away from one of the most important aspects of Civ, looking for a good city spots, analysing terrain... and more, these are my main takeaways.\r\n\r\nMaybe there is more, but honestly, I have spent 6 hours of my life already and it was not getting any better, so I cut this lose.\r\n\r\nFor devs, you are talented and did great job, the game is just not that fun to play, is all, kinda meh, alright for a slow day... But get a strong design in your hands and you can do bangers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have enjoyed it. I feel its better and more intuitive step by step that CK3. \r\n\r\nIts just when you atack other nations you need usually like 6 or 15 units realistically late game to win against one city and keep it. My experience. \r\nAnd to much micromanagement. Always sending your ruler and council out on the same repetive jobs for temporary gain.\r\nAnd you might have lost 50 too 100 turns in , but you wont know for sure befor 180 turns gone by...\r\n\r\nSo i lost interest",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I love CIV pre CIV 5 (CIV 5 was bad and CIV 6 was junk). I hated Crusader Kings. So coming in I looked at the game as a mixed bag. \nThen I started playing it. First problem right off the bad is information overload. There is too much going on and no helpful help system to explain anything. At least with CIV, everything made sense. If you want to produce something, you know what affected producing things. With this game, it's more of magic behind the scenes affects producing.\nThen I tried out battling. I found out really quick that this game's biggest weakness was battling. First, AI units are inherently stronger even if you have more advanced units. They will send in 3 units and make mince meat of anything you have. If you try to attack them, expect to waste actions cause it will take 5-7 of of your units to hopefully kill one of their units. On top of that, the AI produces units faster than roaches multiply. With the AI set up to be somewhat weaker than you are, you will find that by the time you can produce enough settlers to create 3 cites, they will be on their 4th with an army of units already. \nThen there is the annoyance that you can't really do anything cause of orders. You set workers and your one scout to automate and find they just sit there doing nothing all game. Meanwhile the AI system is chugging away and somehow has double your order count. Seems the can reproduce orders as fast as they can units. \nJust this minute, I had an enemy archer completely surrounded by 6 units. It took all 6 to defeat a single archer. Something is messed up when it takes that much work for a single weak unit when they could have easily taken out my strongest unit with just 3 units. I ended up keeping that from happening by opening the editor and blocking their territory with mountains so I didn't have the AI swarming me with super humans anymore.\n\nOverall, it was a good concept of a game but falls way short of being good. Unless you open up the game editor and periodically erase AI units to even the playing field. \n\nI see other people mention things that are a problem and the common reply is that you can just turn off this or that feature. But what's the point of playing a game if you have to turn off all the features to make it playable?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I can only imagine the pitch meeting for this game going something like this. \"let's take tried and true game mechanics, overcomplicate them, and sell it as a new game\". If you're of the opinion \"less is more\", DON'T BUY THIS GAME. It's trying too hard to be a grand strategy game in a 4X setting and the blend leaves it with an identity crisis.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fine I guess. Bought this becauase I love Civ, and it's kinda of similar. There are neat aspects like the individual side quests from your family, but nothing about this game is straight forward or intuitive. On top of the learning curve, there is so much information on the screen at all times that the font size for your information is tiiiiiiiny, making the screen a pain in the ass to read. \r\nNot for me. Civ 5 is still the GOAT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the most precise Civ ripoff anyone could make. A part of me has to admire the effort that went in to copying Civilization bit for bit.\n\nWhy anyone would want to make a 1:1 copy of a clunky, bloated, pointless mess that wastes your time like a Facebook game is beyond me, but they did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mediocre civ clone, it's okay but nothing great",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried many, many times to enjoy playing this game, and I have never succeeded. The event system is simply too irritating. There is no such thing as \"immersion\" in this game whatsoever, and it never succeeds at creating fun stories where this empire and that empire are fighting each other, etc. Instead you are constantly fighting against the event system and ONLY against the event system. There is nothing to fight against in this game other than the event system, and this becomes both extremely irritating and extremely boring at the same time. Many of the event systems in this game have choice structures that go like this: Choice 1) Do this quest, build these ten farms, whatever (this is irritating) OR Choice 2: Lots of enemy raiders spawn in your terrority (this is extremely irriitation). \r\n\r\nIf you enjoy games where you get to choose between one thing that is irritating and another thing that is also irritating, this is exactly the game for you. If your idea of a good time on a Friday night is to be asked the question \"would you like 50 gold, 100 lumber, or 200 civics?\" this is exactly the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Multiplayer Wargame With 4X Foundation[/h1]\n\n[h2]Fatigue, Information Overload and Ugliness Earn Old World A 2 Out of 5[/h2]\n\n[b]THE GOOD: Cities and specialists; Pings; Undo; Orders; Vassal Families[/b]\n\n[b]THE BAD: Diplomacy; Religion; Espionage; Influence Actions[/b]\n\n[b]THE UGLY: Neverending text; Everything looks the same; Data displays are crude and ugly; A very rough UI[/b]\n\nOld World is for lawyers and gamblers, not for engineers or accountants. It has some interesting concepts which enhance gameplay by exploiting the natural tension between freedom and constraints. I hope others duplicate the conceptual innovations in Old World and improve upon them in other 4X titles.\n\nOld World's user interface is text- and number-dense. Playing beyond about four hours leads to a sense of fatigue and information overload. Things one might like to plan ahead of time, e.g. technological research or military unit promotions, are wrapped in random processes that appeal to devil-may-care gamblers but drive deliberate strategists mad. Frustration sets in when one tries to learn one's lessons from previous losses, only to be stymied because one can't make long-term plans for structural reasons intrinsic to the game. These structural aspects aggravate the information overload precisely because they make long-term strategic planning so exasperating.\n\nOld World's intended audience is players seeking a Multiplayer Wargaming experience with a 4X foundation. Many (most?) experienced Old World players value the developers' attention to aspects of Multiplayer gameplay that were absent from or very poorly implemented in other 4X titles. I exclusively play Single Player, and though I enjoy stomping my annoying neighbors' guts out as much as anyone, that's not the only way I play 4X games. The victory conditions are boring, especially the Ambitions Victory, which, for structural reasons described previously, is challenging for all the wrong reasons.\n\nMany positive reviewers on Steam reveal themselves to be unserious, as they are enthusiasts, fanbois and gatekeepers who abandon their critical faculties in defense of a game they believe is under-appreciated and not well publicized. Both of these things may be true of Old World but reviews don't settle scores. \"Historical\" justifications of Old World come either from fools or charlatans. The game's many grossly ahistorical elements are documented and criticized in detail elsewhere. Old World is \"history based,\" at best. It is [i]not[/i] \"historical.\" There's nothing wrong with that! But don't try to church up Old World with assertions of historicity.\n\n[b]THE GOOD:[/b]\n[b]1. City limits, workable tiles and specialists.[/b] There's usually a way to get what you want where you want it, though not necessarily when you need it. Borders can grow stupidly, which should be fixed, e.g., don't give that unincorporated wheat to my Champions city when my Landowners city is within equal range.\n\n[b]2. The Ping system[/b] is great for planning improvements. Reminder pings need improvement. Setting a reminder ping to, say, promote a military unit on turn X will cause the ping message to post in the long list of messages delivered at the start of turn X, but the map pin is immediately removed! Leave time-sensitive pings on the map until they're acknowledged or removed manually.\n\n[b]3. Undo is wonderful![/b] Make the Actions Stack viewable so that the player can easily select the last event they want to \"keep\" when they undo Actions.\n\n[b]4. The Orders concept[/b] is an interesting constraint on player actions. Are the computer players also so constrained? The need for the player to decide which actions to take this turn (vs. later or maybe never) limits one's horizons, but it presents a challenge that's interesting to deal with.\n\n[b]5. The Vassal Families system[/b] presents interesting challenges. Why aren't all 10 vassal families available to every civilization? Keep the limit of only three Families per empire. There's no good reason to arbitrarily make it impossible for a particular civilization to incorporate any of the different Vassal Families, so long as there are never more than three Families present in the empire.\n\n[b]THE BAD:[/b]\n[b]1. The Diplomacy system stinks.[/b] It's too limited and it's lame that an Ambassador is required in order to take any diplomatic action. It's reasonable to require an Ambassador to conduct diplomacy with other Civilizations. It's unreasonable to require an Ambassador to conduct diplomacy with Tribes. The few Ambassador Actions available suggest that the Diplomacy system was just bolted onto the game rather than developed right from the beginning. My Orders are better spent elsewhere.\n\n[b]2. The Religion system stinks.[/b] Like Diplomacy, Religion seems like an afterthought. Civilizations without Clerics Families or that don't start the game with the Divination technology or with the Husbandry technology will almost never found a World Religion except by sheer accident due to a random Event. Pagan Religions are second-class to World Religions, making them a short-term sink of one's precious Orders, so why bother?\n\n[b]3. The Espionage system is weak.[/b] It's reasonable to require a Spymaster to conduct Espionage Missions against other Civilizations. It's unreasonable to require a Spymaster to, e.g., \"deal with\" my rotten jealous scheming twin brother who lives forever and is an irredeemable nuisance and DEFCON 1 threat to my Rule and my household. It's completely arbitrary that all the nasty things one might need to do without being noticed within one's own civilization are off limits until one reaches the developmental stage at which it is also possible to foment unrest in foreign lands or steal technologies from adversaries. And Spymasters can't stir up the Tribes.\n\n[b]4. Influence Actions are too limited.[/b] One Character can only attempt to Influence (\"A chats up B\") another Character exactly one time, ever, throughout the entire lives of both Characters (A and B). One Character can only be Interceded For (\"C chats up B on A's behalf\") one time, ever, throughout the entire lives of both principal Characters (A and B). And during Leadership transitions, womp womp Legitimacy tanks! Good luck getting all your VIPs happily in line. You get one shot and one shot only per Influence target. What am I, made of Orders? Better to spend them on sure things.\n\n[b]THE UGLY:[/b]\n[b]1. \"Yo I heard you like reading.\"[/b] Everything that's not the map terrain itself is text. Tiny icons and tiny text litter the map, every notification is text... you'll do so much reading and clicking through menus in Old World that you'll suffer eye strain. Tooltips and text labels need different typefaces to separate and highlight different bits of information. The net effect is information overload. Animations and voice acting for Events would do wonders to liven things up.\n\n[b]2. All the improvements look the same.[/b] Each improvement type looks identical across all Civilizations, lacking any national or regional character. Is it all made out of ticky-tacky?\n\n[b]3. Tables, charts and graphs are more crude and ugly than useful.[/b] For example, the Family Opinion chart. One sees three traces plotted vs. time. Three numbers, that's it! Information, especially numerical data, is presented in a very limited and visually unappealing way that screams \"SuSE Linux, circa 2003.\"\n\n[b]4. The UI is fiddly and sticky.[/b] Tooltips with tooltips on their tooltips make for a very fiddly experience. There's a lot of clicking this and clicking that and having to drag the map this way and that, which worsens player fatigue caused by turn after turn of textalanche. Units cycle in a fixed order, bouncing from one end of the map to the other. One can automate Scouts and Workers, but military units need their hands held every step they take.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's weird. The game looks better than Civilization, but after all it's boring. I even can't say what's wrong. Too much micromanagement, so much that you don't remember where, who and what. Too much variety of unit upgrades, but you don't remember which unit is better for what. You want fight, but you find yourself in never ending hex upgrades. The game is so complex that than you see it the first time you think: \"Wow, it's cool. Those orders must be used wisely\". And then you find yourself in constant orders restrictions in a way that if you want do something - don't do it, better check - maybe is there something more urgent? It sound deep, but in practice feel yourself limping. I really wanted to like this game, but I can't.",
      "voted_up": false,
      "votes_helpful": 146
    },
    {
      "review": "It is a good game, dont take me wrong, but I cannot recommend it to anyone like myself. I wont play it past achievements, because the heavy involvement of RNG in every aspect of the game, which removes the only reason why I love strategy games: roleplay and control. \n\nPROS\n+ constant updates\n+ looks and plays good\n\nCONS\n- RNG - Eevery aspect of the game is riddled with RNG. You cannot achieve specific character traits because they are locked behind RNG, you cannot foster relationships with other factions because they are locked behind RNG, you cannot specialize your faction in any way because research is locked behind RNG. \nRNG makes any form of roleplay or controll (both things I love and seek in games) simply impossible, and it is the single one thing that bars me from fully enjoying the game fully.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "It's pretty good but the way armies work is obnoxious. Even with scouting you can have armies do the Civ equivalent of five moves, and then attack. Multiple of them. So an entire army can appear out of absolutely nowhere and surround/kill your units out of nowhere. Frustrating, no real counters, very annoying.\n\nOtherwise, it's alright, but given its narrow scope the lack of nation-specific techs and units is really disappointing.\n\nToo thin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Basically Civ with some elements of Crusader Kings, but I really didnt care about taking care of your royal family, building relationships and intrigue, it was distracting and tiresome. The Civ elements are little bit better, but a lot of things made me not recommend this one, like you can only build new cities on predisposed places, a lot of RNG and enemy movement is just so quick that I ended up surrounded by enemy armies that I didnt see at all previous turn, feels like AI is cheating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[h1]A Beautiful Disappointment: Ambition Without Execution[/h1]\r\nI'm a history buff and a fan of 4X games, so Old World should have been perfect for me. The concept is compelling - a 4X game set in antiquity with dynastic mechanics and character-driven narratives. The art direction is beautiful, and I think the developers had good intentions. Unfortunately, that doesn't make up for the game's problems.\r\n[hr][/hr]\r\n[b]The Identity Crisis[/b]\r\nOld World feels like it's trying to be three different games at once: Civilization's empire-building, Europa Universalis' depth, and Hearts of Iron's strategic complexity. It doesn't succeed at being any of them. It's stuck in an awkward middle ground where it's too shallow for grand strategy enthusiasts but too convoluted for casual 4X players.\r\n[hr][/hr]\r\n[b]Forced Ideology and Limited Agency[/b]\r\nOne of my biggest frustrations is how the game pushes contemporary cultural expectations and ideals into your face during gameplay. Mods can fix this (thankfully), but it shouldn't require community intervention to make a historical game feel less like social commentary. I play these games to engage with history on its own terms, not to have modern sensibilities imposed on ancient civilizations.\r\n[hr][/hr]\r\n[b]Shallow Systems[/b]\r\nThe problem-solving paths are severely gated and limited compared to what Europa Universalis offers. When challenges arise, you're forced down narrow story-driven solutions rather than having real strategic options. The economics feel underbaked, and production times are painfully long without the depth to justify it. Everything takes forever, but nothing feels particularly rewarding when completed.\r\n[hr][/hr]\r\n[b]Better Options Exist[/b]\r\nI wanted this to work, but there are simply better games out there. If you want accessible 4X gameplay, Civilization V (or earlier) does it better. For grand strategy depth, Europa Universalis IV is superior. For character-driven narratives, Crusader Kings III excels. Even older games like Endless Legend or Endless Space offer more satisfying experiences.\r\nOld World falls short in nearly every category it attempts. I can't recommend it when superior alternatives exist at similar or lower price points.\r\n[b]Not Recommended[/b] âŒ",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: This is an overcomplicated Civilization.\r\nIt has good mechanics but nothing extraordinary.\r\nSpying is a joke and doesn't really have any major effect on the gameplay.\r\nAI use of \"forced march\" is a joke, it feels like the game is cheating non-stop.\r\nYou attack someone and AI just pulls out 15+ units from the fog in one turn... (even if you installed multiple scouts)\r\nMicro-managing the micromanaged things over and over again, just dreadful.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First impression was very positive.  The core mechanics are familiar, with some things more fleshed out compared to Civ and other things simplified.  Within a few hours the cracks were showing though.  \n\nOne of the areas the game focuses on is characters - individual people who get older with each turn and have roles in your court or line of succession and so on.  IMO this aspect is far too fiddly for very little benefit.  They broke it into a bunch of little pieces that are not fun to micromanage.  You get spammed constantly with notifications that certain people are getting ill, enough that it started to feel comical, which contributed to the feeling of the whole people aspect quickly turning into a list of random names that mean nothing.  There's a bunch of them there on the right side of the screen, and they all have opinions and those opinions are influenced by a lot of things and their opinions in turn influence a lot of other things.  I don't know who they are or why but they sure do get sick and die a lot and randomly acquire traits that do something to their stats.  I think they got a little carried away with developing the people part of the game but tbf I'm more of a Civ person than a Crusader Kings person so maybe you like that stuff.  It just felt to me like I'm trying to put some Legos together and when I pick up a Lego it turns out to be a pile of ants instead of a Lego piece - too much granularity with too much randomness and chaos, and it just didn't need to be that way because the work to benefit ratio of staying on top of these people seems poor.  Just seems very fiddly and random for no good reason.\n\nAlso a religion formed spontaneously in one of my cities, I don't know where it came from or how to deal with it but it made a bunch of people unhappy with me for not being that new thing.  The music is great but the vocals are a bit much, I wish I could get an instrumental track because the singers, while talented, need to chill for being a background soundtrack for a game.  I'm not mad though, I got it 90% off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A nice looking game with poor user interface. Tech advancement is random card based on your tech level. Anything you dont pick is discarded. So if you pick stone working instead of animal husbandry, then you dont see that tech again until you have run out things to research and the discards are shuffled back in. Since whatever you pick unlocks new tech that you have to choose from, and then that tech leads to more.......... Well..... you might end up researching a level 8 tech branch before you even get the option to return to important level 1 tech. Add in the fact that cities are already randomly placed on the map, most poorly optimized. This game is like CIV series weaker, dumber cousin who tries to take his place and fails.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have enjoyed it. I feel its better and more intuitive step by step that CK3. \r\n\r\nIts just when you atack other nations you need usually like 6 or 15 units realistically late game to win against one city and keep it. My experience. \r\nAnd to much micromanagement. Always sending your ruler and council out on the same repetive jobs for temporary gain.\r\nAnd you might have lost 50 too 100 turns in , but you wont know for sure befor 180 turns gone by...\r\n\r\nSo i lost interest",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really was enjoying this game and marveling how identical it is to Civilization, (I was there as a kid for OG Civ1, played a ton of 5 and 6 when my kids were babies) but Old World had it's own little twist.\r\nNot kidding, at all, it's almost a total ripoff of Civ mechanics. In almost every. single. way.\r\nThe family dynamics twist seemed kind of intriguing to me, though. \r\nIt was something new, and I was liking what I was seeing.\r\nThe interface was good, the mechanics all seemed to be there.\r\nThe different families for each nation, and the members of each family and their feelings about each other and their traits and how that all affects the nation was new to me and right up my alley.\r\nI was making choices and doing researches and building tile improvements and really getting a feel for the game.\r\nI had met another nation and some city states and was making peace and diplomacy.\r\nMy step-son was mad initially he wasn't the heir, but I gave him a job and made him an advisor and felt we were getting along and I even forgave him when he go caught being a traitor.\r\nMy heir, my daughter married a prince from a City-state and I had a granddaughter and I was like, this is awesome. I am totally digging this family dynamic mixed into the good old Civ gameplay.\r\nSuddenly, in under 30 total turns, I became ill, then gravely ill, then doomed, and then died within 4 turns.\r\nAll my plans, diplomacy, relations went to hell, but I'm like, ok it's cool people get old and die, that's this game's mechanic to keep you challenged. My daughter will step in and take over control of the empire and I'll hopefully have another 30 turns or longer trying to make some progress before she dies too.\r\nWithin 4 turns, I'm not even kidding, ill, gravely ill, doomed.\r\nI rage quit right there, and it will likely be a long time, if ever, I come back to this game.\r\nWhy did they get sick? NO REASON GIVEN. I had so many farms and so much food, I was killing it.\r\nI would understand if there was like a famine or some game mechanic that would have instigated the illness.\r\nWhy couldn't I do anything to try and improve their health to keep them alive? BECAUSE.\r\nNo medicine, no obligatory rest, no options at all to try and rectify the illness. Just dead.\r\nMy mom died of cancer pretty suddenly a few years back, I don't need my games to mimic that trauma and make me feel helpless and powerless, life does that well enough, thank you.\r\nGames are supposed to be an escape from reality. An opportunity to use your intellect and your choice to affect a favorable outcome in a controlled environment. Hell, I even played Darkest Dungeon and enjoyed it.\r\nI gotta leave a negative review, and I hate to do that, but I play a lot of different games and it's rare that I get as frustrated as that. Maybe this is not normal for this game and I just had a really bad RNG luck, but it was my very first play-through, so go figure how that's even likely. Maybe you can load it and the RNG won't hit again and you won't get sick, but I'm not loading and saving and going through all that wasted time just to get around this game wrecking mechanic.\r\nI'm not down for uncontrolled, unexplained, run ruining chaos in my 4x game. Sorry, not sorry.\r\nGlad I got the game on sale, I'd be pissed if I payed full price for this carbon copy.\r\nAlright, well cool, there are plenty of other awesome games to play. Thanks for listening!",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Not a bad Civ clone. However I find the gameplay tedious due to micro management. At some point one just wanna go on a crusade and worry less about tutoring some 10 year old who is 17th in line for the crown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "In some ways, it's better than Sid Meier's Civilisation, but in some ways, it's inferior.\nThe good: leaders age & die, don't have Caesar for 5000 years. You need to get an heir & a clear line of succession, lest you face succession war.\nThe bad: you can't settle a new city. Just can't. Wanted to build my second city on the coast, near to Gold & Gems, but you can't. Has to be on an urban tile. Found one & moved settler there, but needs to be connected to capital. Built road from capital to there, still won't do it. I give up.\nAlso, didn't get a Settler for ages. \nYou need to research a tech to get game music playing, which I get is nice, but kinda BS, I want something to listen to. \nTribal camps, whilst an interesting mechanic, spawned a stupid amount of units & raiders on me, over & over.\nCombat was a little more interesting at least, but gonna be honest, I'd rather just play CIV V again. \nI know it has mods, but I can't be arsed.\n\nEdit: Ah, okay, thanks, I'll give this another try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Odd game, everything is in order, has ton of content, QoL and all of it in functional great looking package...\r\n\r\nbut it is simply not fun. What kept me playing was curiosity, not the gameplay. And I ran out of the curiosity.\r\n\r\nThe issue is, the game tries to look on surface like more complex Civilization, but is in fact much less complex and intriguing than any Civ I played (3-6). On surface all looks complex - dynastic relationships, court, generals, activities, decisions... but it is a front for many systems, that do not feel deep or meaningful to interact with.\r\n\r\nSomehow, this game has worse diplomacy than Civ Beyond Earth, somehow it has a dynasty system from CK3 that feels like it does jack shit, and reduces many instances of strategy to choose one of three/four options (as if this was one of those brain dead Survivors clones), making the game just kind of not exciting the play. It drags, not much happens, no choice feels meaningful. You can build cities, guess what, only on city sites, further taking away from one of the most important aspects of Civ, looking for a good city spots, analysing terrain... and more, these are my main takeaways.\r\n\r\nMaybe there is more, but honestly, I have spent 6 hours of my life already and it was not getting any better, so I cut this lose.\r\n\r\nFor devs, you are talented and did great job, the game is just not that fun to play, is all, kinda meh, alright for a slow day... But get a strong design in your hands and you can do bangers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love CIV pre CIV 5 (CIV 5 was bad and CIV 6 was junk). I hated Crusader Kings. So coming in I looked at the game as a mixed bag. \nThen I started playing it. First problem right off the bad is information overload. There is too much going on and no helpful help system to explain anything. At least with CIV, everything made sense. If you want to produce something, you know what affected producing things. With this game, it's more of magic behind the scenes affects producing.\nThen I tried out battling. I found out really quick that this game's biggest weakness was battling. First, AI units are inherently stronger even if you have more advanced units. They will send in 3 units and make mince meat of anything you have. If you try to attack them, expect to waste actions cause it will take 5-7 of of your units to hopefully kill one of their units. On top of that, the AI produces units faster than roaches multiply. With the AI set up to be somewhat weaker than you are, you will find that by the time you can produce enough settlers to create 3 cites, they will be on their 4th with an army of units already. \nThen there is the annoyance that you can't really do anything cause of orders. You set workers and your one scout to automate and find they just sit there doing nothing all game. Meanwhile the AI system is chugging away and somehow has double your order count. Seems the can reproduce orders as fast as they can units. \nJust this minute, I had an enemy archer completely surrounded by 6 units. It took all 6 to defeat a single archer. Something is messed up when it takes that much work for a single weak unit when they could have easily taken out my strongest unit with just 3 units. I ended up keeping that from happening by opening the editor and blocking their territory with mountains so I didn't have the AI swarming me with super humans anymore.\n\nOverall, it was a good concept of a game but falls way short of being good. Unless you open up the game editor and periodically erase AI units to even the playing field. \n\nI see other people mention things that are a problem and the common reply is that you can just turn off this or that feature. But what's the point of playing a game if you have to turn off all the features to make it playable?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It doesn't feel weighty or impactful. It's very unclear what's happening as 17 things are happening every turn. The tutorial was either 'baby's first 4x' or 'we explain nothing, until after you've done the thing' (eg: nested tool-tips exist, but the game doesn't tell you about it until several turns in... I needed that on turn 1!).\n\nBought it on sale for <CA$6, and still applied for a refund.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Has the same problem all of these games have, AI cheats, can build insane amounts of military units early on making early game frustrating. I already know how this plays out, if I survive the early game I eventually become unstoppable, Its an old and tired game style of these types of games, and one day I hope to find one that is balanced throughout instead of insanely front loaded when it comes to difficulty.\n\nI'm not even going to bother pushing onwards, because if it doesn't work like that, then the entire game will be fighting against overwhelming odds and that I don't find fun either.\n\nHonestly, the anti player bias in these style of games (and total war, one of my favorite series suffers this too) is about half the problem. Bandit/barbarian whatever else will walk past the AI to attack the player.\n\nIf this hadn't been the case, I wouldn't be slogged down in a 2 front war which would have made fighting the enemies I had on my eastern front a lot more fun, even though they were annoyingly over stacked. Instead I had to split my already undersized compared to my enemies forces in half because of a never ending onslaught of random spawn bandit enemies on me western flank, which was otherwise secure with only friendly AI (that they of course ignored and walked past to attack me) in that direction.\n\nI finally alt F4'd and uninstalled when a 3rd front opened by even more random spawn enemies to my south, making the situation completely untenable. \n\nI have no interest in restarting over and over trying to get the right circumstances and force counts to 'win' the early game, Because like civ before it, I already know how this plays out. Same old tired trope of annoying start and way too easy late game.\n\nI don't know why devs think anti player bias is fun, but I wish they would get it through their thick skulls it just isn't. It makes the world feel inorganic, which in this style of game, I think just ruins the experience. \n\nSome day, one developer will figure out that most people hate this, and they will add a slider, so people who do want to be swarmed can crank it up, and people who want a more organic world growth can turn it down or off. Until then, I think this will be my last 'civilization style' game for awhile.\n\nP.S. butthurt fanboys throwing me points isn't going to change the review lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can only imagine the pitch meeting for this game going something like this. \"let's take tried and true game mechanics, overcomplicate them, and sell it as a new game\". If you're of the opinion \"less is more\", DON'T BUY THIS GAME. It's trying too hard to be a grand strategy game in a 4X setting and the blend leaves it with an identity crisis.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fine I guess. Bought this becauase I love Civ, and it's kinda of similar. There are neat aspects like the individual side quests from your family, but nothing about this game is straight forward or intuitive. On top of the learning curve, there is so much information on the screen at all times that the font size for your information is tiiiiiiiny, making the screen a pain in the ass to read. \r\nNot for me. Civ 5 is still the GOAT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the most precise Civ ripoff anyone could make. A part of me has to admire the effort that went in to copying Civilization bit for bit.\n\nWhy anyone would want to make a 1:1 copy of a clunky, bloated, pointless mess that wastes your time like a Facebook game is beyond me, but they did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mediocre civ clone, it's okay but nothing great",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried many, many times to enjoy playing this game, and I have never succeeded. The event system is simply too irritating. There is no such thing as \"immersion\" in this game whatsoever, and it never succeeds at creating fun stories where this empire and that empire are fighting each other, etc. Instead you are constantly fighting against the event system and ONLY against the event system. There is nothing to fight against in this game other than the event system, and this becomes both extremely irritating and extremely boring at the same time. Many of the event systems in this game have choice structures that go like this: Choice 1) Do this quest, build these ten farms, whatever (this is irritating) OR Choice 2: Lots of enemy raiders spawn in your terrority (this is extremely irriitation). \r\n\r\nIf you enjoy games where you get to choose between one thing that is irritating and another thing that is also irritating, this is exactly the game for you. If your idea of a good time on a Friday night is to be asked the question \"would you like 50 gold, 100 lumber, or 200 civics?\" this is exactly the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Multiplayer Wargame With 4X Foundation[/h1]\n\n[h2]Fatigue, Information Overload and Ugliness Earn Old World A 2 Out of 5[/h2]\n\n[b]THE GOOD: Cities and specialists; Pings; Undo; Orders; Vassal Families[/b]\n\n[b]THE BAD: Diplomacy; Religion; Espionage; Influence Actions[/b]\n\n[b]THE UGLY: Neverending text; Everything looks the same; Data displays are crude and ugly; A very rough UI[/b]\n\nOld World is for lawyers and gamblers, not for engineers or accountants. It has some interesting concepts which enhance gameplay by exploiting the natural tension between freedom and constraints. I hope others duplicate the conceptual innovations in Old World and improve upon them in other 4X titles.\n\nOld World's user interface is text- and number-dense. Playing beyond about four hours leads to a sense of fatigue and information overload. Things one might like to plan ahead of time, e.g. technological research or military unit promotions, are wrapped in random processes that appeal to devil-may-care gamblers but drive deliberate strategists mad. Frustration sets in when one tries to learn one's lessons from previous losses, only to be stymied because one can't make long-term plans for structural reasons intrinsic to the game. These structural aspects aggravate the information overload precisely because they make long-term strategic planning so exasperating.\n\nOld World's intended audience is players seeking a Multiplayer Wargaming experience with a 4X foundation. Many (most?) experienced Old World players value the developers' attention to aspects of Multiplayer gameplay that were absent from or very poorly implemented in other 4X titles. I exclusively play Single Player, and though I enjoy stomping my annoying neighbors' guts out as much as anyone, that's not the only way I play 4X games. The victory conditions are boring, especially the Ambitions Victory, which, for structural reasons described previously, is challenging for all the wrong reasons.\n\nMany positive reviewers on Steam reveal themselves to be unserious, as they are enthusiasts, fanbois and gatekeepers who abandon their critical faculties in defense of a game they believe is under-appreciated and not well publicized. Both of these things may be true of Old World but reviews don't settle scores. \"Historical\" justifications of Old World come either from fools or charlatans. The game's many grossly ahistorical elements are documented and criticized in detail elsewhere. Old World is \"history based,\" at best. It is [i]not[/i] \"historical.\" There's nothing wrong with that! But don't try to church up Old World with assertions of historicity.\n\n[b]THE GOOD:[/b]\n[b]1. City limits, workable tiles and specialists.[/b] There's usually a way to get what you want where you want it, though not necessarily when you need it. Borders can grow stupidly, which should be fixed, e.g., don't give that unincorporated wheat to my Champions city when my Landowners city is within equal range.\n\n[b]2. The Ping system[/b] is great for planning improvements. Reminder pings need improvement. Setting a reminder ping to, say, promote a military unit on turn X will cause the ping message to post in the long list of messages delivered at the start of turn X, but the map pin is immediately removed! Leave time-sensitive pings on the map until they're acknowledged or removed manually.\n\n[b]3. Undo is wonderful![/b] Make the Actions Stack viewable so that the player can easily select the last event they want to \"keep\" when they undo Actions.\n\n[b]4. The Orders concept[/b] is an interesting constraint on player actions. Are the computer players also so constrained? The need for the player to decide which actions to take this turn (vs. later or maybe never) limits one's horizons, but it presents a challenge that's interesting to deal with.\n\n[b]5. The Vassal Families system[/b] presents interesting challenges. Why aren't all 10 vassal families available to every civilization? Keep the limit of only three Families per empire. There's no good reason to arbitrarily make it impossible for a particular civilization to incorporate any of the different Vassal Families, so long as there are never more than three Families present in the empire.\n\n[b]THE BAD:[/b]\n[b]1. The Diplomacy system stinks.[/b] It's too limited and it's lame that an Ambassador is required in order to take any diplomatic action. It's reasonable to require an Ambassador to conduct diplomacy with other Civilizations. It's unreasonable to require an Ambassador to conduct diplomacy with Tribes. The few Ambassador Actions available suggest that the Diplomacy system was just bolted onto the game rather than developed right from the beginning. My Orders are better spent elsewhere.\n\n[b]2. The Religion system stinks.[/b] Like Diplomacy, Religion seems like an afterthought. Civilizations without Clerics Families or that don't start the game with the Divination technology or with the Husbandry technology will almost never found a World Religion except by sheer accident due to a random Event. Pagan Religions are second-class to World Religions, making them a short-term sink of one's precious Orders, so why bother?\n\n[b]3. The Espionage system is weak.[/b] It's reasonable to require a Spymaster to conduct Espionage Missions against other Civilizations. It's unreasonable to require a Spymaster to, e.g., \"deal with\" my rotten jealous scheming twin brother who lives forever and is an irredeemable nuisance and DEFCON 1 threat to my Rule and my household. It's completely arbitrary that all the nasty things one might need to do without being noticed within one's own civilization are off limits until one reaches the developmental stage at which it is also possible to foment unrest in foreign lands or steal technologies from adversaries. And Spymasters can't stir up the Tribes.\n\n[b]4. Influence Actions are too limited.[/b] One Character can only attempt to Influence (\"A chats up B\") another Character exactly one time, ever, throughout the entire lives of both Characters (A and B). One Character can only be Interceded For (\"C chats up B on A's behalf\") one time, ever, throughout the entire lives of both principal Characters (A and B). And during Leadership transitions, womp womp Legitimacy tanks! Good luck getting all your VIPs happily in line. You get one shot and one shot only per Influence target. What am I, made of Orders? Better to spend them on sure things.\n\n[b]THE UGLY:[/b]\n[b]1. \"Yo I heard you like reading.\"[/b] Everything that's not the map terrain itself is text. Tiny icons and tiny text litter the map, every notification is text... you'll do so much reading and clicking through menus in Old World that you'll suffer eye strain. Tooltips and text labels need different typefaces to separate and highlight different bits of information. The net effect is information overload. Animations and voice acting for Events would do wonders to liven things up.\n\n[b]2. All the improvements look the same.[/b] Each improvement type looks identical across all Civilizations, lacking any national or regional character. Is it all made out of ticky-tacky?\n\n[b]3. Tables, charts and graphs are more crude and ugly than useful.[/b] For example, the Family Opinion chart. One sees three traces plotted vs. time. Three numbers, that's it! Information, especially numerical data, is presented in a very limited and visually unappealing way that screams \"SuSE Linux, circa 2003.\"\n\n[b]4. The UI is fiddly and sticky.[/b] Tooltips with tooltips on their tooltips make for a very fiddly experience. There's a lot of clicking this and clicking that and having to drag the map this way and that, which worsens player fatigue caused by turn after turn of textalanche. Units cycle in a fixed order, bouncing from one end of the map to the other. One can automate Scouts and Workers, but military units need their hands held every step they take.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's weird. The game looks better than Civilization, but after all it's boring. I even can't say what's wrong. Too much micromanagement, so much that you don't remember where, who and what. Too much variety of unit upgrades, but you don't remember which unit is better for what. You want fight, but you find yourself in never ending hex upgrades. The game is so complex that than you see it the first time you think: \"Wow, it's cool. Those orders must be used wisely\". And then you find yourself in constant orders restrictions in a way that if you want do something - don't do it, better check - maybe is there something more urgent? It sound deep, but in practice feel yourself limping. I really wanted to like this game, but I can't.",
      "voted_up": false,
      "votes_helpful": 146
    },
    {
      "review": "It is a good game, dont take me wrong, but I cannot recommend it to anyone like myself. I wont play it past achievements, because the heavy involvement of RNG in every aspect of the game, which removes the only reason why I love strategy games: roleplay and control. \n\nPROS\n+ constant updates\n+ looks and plays good\n\nCONS\n- RNG - Eevery aspect of the game is riddled with RNG. You cannot achieve specific character traits because they are locked behind RNG, you cannot foster relationships with other factions because they are locked behind RNG, you cannot specialize your faction in any way because research is locked behind RNG. \nRNG makes any form of roleplay or controll (both things I love and seek in games) simply impossible, and it is the single one thing that bars me from fully enjoying the game fully.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "It's pretty good but the way armies work is obnoxious. Even with scouting you can have armies do the Civ equivalent of five moves, and then attack. Multiple of them. So an entire army can appear out of absolutely nowhere and surround/kill your units out of nowhere. Frustrating, no real counters, very annoying.\n\nOtherwise, it's alright, but given its narrow scope the lack of nation-specific techs and units is really disappointing.\n\nToo thin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Basically Civ with some elements of Crusader Kings, but I really didnt care about taking care of your royal family, building relationships and intrigue, it was distracting and tiresome. The Civ elements are little bit better, but a lot of things made me not recommend this one, like you can only build new cities on predisposed places, a lot of RNG and enemy movement is just so quick that I ended up surrounded by enemy armies that I didnt see at all previous turn, feels like AI is cheating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[h1]A Beautiful Disappointment: Ambition Without Execution[/h1]\r\nI'm a history buff and a fan of 4X games, so Old World should have been perfect for me. The concept is compelling - a 4X game set in antiquity with dynastic mechanics and character-driven narratives. The art direction is beautiful, and I think the developers had good intentions. Unfortunately, that doesn't make up for the game's problems.\r\n[hr][/hr]\r\n[b]The Identity Crisis[/b]\r\nOld World feels like it's trying to be three different games at once: Civilization's empire-building, Europa Universalis' depth, and Hearts of Iron's strategic complexity. It doesn't succeed at being any of them. It's stuck in an awkward middle ground where it's too shallow for grand strategy enthusiasts but too convoluted for casual 4X players.\r\n[hr][/hr]\r\n[b]Forced Ideology and Limited Agency[/b]\r\nOne of my biggest frustrations is how the game pushes contemporary cultural expectations and ideals into your face during gameplay. Mods can fix this (thankfully), but it shouldn't require community intervention to make a historical game feel less like social commentary. I play these games to engage with history on its own terms, not to have modern sensibilities imposed on ancient civilizations.\r\n[hr][/hr]\r\n[b]Shallow Systems[/b]\r\nThe problem-solving paths are severely gated and limited compared to what Europa Universalis offers. When challenges arise, you're forced down narrow story-driven solutions rather than having real strategic options. The economics feel underbaked, and production times are painfully long without the depth to justify it. Everything takes forever, but nothing feels particularly rewarding when completed.\r\n[hr][/hr]\r\n[b]Better Options Exist[/b]\r\nI wanted this to work, but there are simply better games out there. If you want accessible 4X gameplay, Civilization V (or earlier) does it better. For grand strategy depth, Europa Universalis IV is superior. For character-driven narratives, Crusader Kings III excels. Even older games like Endless Legend or Endless Space offer more satisfying experiences.\r\nOld World falls short in nearly every category it attempts. I can't recommend it when superior alternatives exist at similar or lower price points.\r\n[b]Not Recommended[/b] âŒ",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: This is an overcomplicated Civilization.\r\nIt has good mechanics but nothing extraordinary.\r\nSpying is a joke and doesn't really have any major effect on the gameplay.\r\nAI use of \"forced march\" is a joke, it feels like the game is cheating non-stop.\r\nYou attack someone and AI just pulls out 15+ units from the fog in one turn... (even if you installed multiple scouts)\r\nMicro-managing the micromanaged things over and over again, just dreadful.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First impression was very positive.  The core mechanics are familiar, with some things more fleshed out compared to Civ and other things simplified.  Within a few hours the cracks were showing though.  \n\nOne of the areas the game focuses on is characters - individual people who get older with each turn and have roles in your court or line of succession and so on.  IMO this aspect is far too fiddly for very little benefit.  They broke it into a bunch of little pieces that are not fun to micromanage.  You get spammed constantly with notifications that certain people are getting ill, enough that it started to feel comical, which contributed to the feeling of the whole people aspect quickly turning into a list of random names that mean nothing.  There's a bunch of them there on the right side of the screen, and they all have opinions and those opinions are influenced by a lot of things and their opinions in turn influence a lot of other things.  I don't know who they are or why but they sure do get sick and die a lot and randomly acquire traits that do something to their stats.  I think they got a little carried away with developing the people part of the game but tbf I'm more of a Civ person than a Crusader Kings person so maybe you like that stuff.  It just felt to me like I'm trying to put some Legos together and when I pick up a Lego it turns out to be a pile of ants instead of a Lego piece - too much granularity with too much randomness and chaos, and it just didn't need to be that way because the work to benefit ratio of staying on top of these people seems poor.  Just seems very fiddly and random for no good reason.\n\nAlso a religion formed spontaneously in one of my cities, I don't know where it came from or how to deal with it but it made a bunch of people unhappy with me for not being that new thing.  The music is great but the vocals are a bit much, I wish I could get an instrumental track because the singers, while talented, need to chill for being a background soundtrack for a game.  I'm not mad though, I got it 90% off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A nice looking game with poor user interface. Tech advancement is random card based on your tech level. Anything you dont pick is discarded. So if you pick stone working instead of animal husbandry, then you dont see that tech again until you have run out things to research and the discards are shuffled back in. Since whatever you pick unlocks new tech that you have to choose from, and then that tech leads to more.......... Well..... you might end up researching a level 8 tech branch before you even get the option to return to important level 1 tech. Add in the fact that cities are already randomly placed on the map, most poorly optimized. This game is like CIV series weaker, dumber cousin who tries to take his place and fails.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have enjoyed it. I feel its better and more intuitive step by step that CK3. \r\n\r\nIts just when you atack other nations you need usually like 6 or 15 units realistically late game to win against one city and keep it. My experience. \r\nAnd to much micromanagement. Always sending your ruler and council out on the same repetive jobs for temporary gain.\r\nAnd you might have lost 50 too 100 turns in , but you wont know for sure befor 180 turns gone by...\r\n\r\nSo i lost interest",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really was enjoying this game and marveling how identical it is to Civilization, (I was there as a kid for OG Civ1, played a ton of 5 and 6 when my kids were babies) but Old World had it's own little twist.\r\nNot kidding, at all, it's almost a total ripoff of Civ mechanics. In almost every. single. way.\r\nThe family dynamics twist seemed kind of intriguing to me, though. \r\nIt was something new, and I was liking what I was seeing.\r\nThe interface was good, the mechanics all seemed to be there.\r\nThe different families for each nation, and the members of each family and their feelings about each other and their traits and how that all affects the nation was new to me and right up my alley.\r\nI was making choices and doing researches and building tile improvements and really getting a feel for the game.\r\nI had met another nation and some city states and was making peace and diplomacy.\r\nMy step-son was mad initially he wasn't the heir, but I gave him a job and made him an advisor and felt we were getting along and I even forgave him when he go caught being a traitor.\r\nMy heir, my daughter married a prince from a City-state and I had a granddaughter and I was like, this is awesome. I am totally digging this family dynamic mixed into the good old Civ gameplay.\r\nSuddenly, in under 30 total turns, I became ill, then gravely ill, then doomed, and then died within 4 turns.\r\nAll my plans, diplomacy, relations went to hell, but I'm like, ok it's cool people get old and die, that's this game's mechanic to keep you challenged. My daughter will step in and take over control of the empire and I'll hopefully have another 30 turns or longer trying to make some progress before she dies too.\r\nWithin 4 turns, I'm not even kidding, ill, gravely ill, doomed.\r\nI rage quit right there, and it will likely be a long time, if ever, I come back to this game.\r\nWhy did they get sick? NO REASON GIVEN. I had so many farms and so much food, I was killing it.\r\nI would understand if there was like a famine or some game mechanic that would have instigated the illness.\r\nWhy couldn't I do anything to try and improve their health to keep them alive? BECAUSE.\r\nNo medicine, no obligatory rest, no options at all to try and rectify the illness. Just dead.\r\nMy mom died of cancer pretty suddenly a few years back, I don't need my games to mimic that trauma and make me feel helpless and powerless, life does that well enough, thank you.\r\nGames are supposed to be an escape from reality. An opportunity to use your intellect and your choice to affect a favorable outcome in a controlled environment. Hell, I even played Darkest Dungeon and enjoyed it.\r\nI gotta leave a negative review, and I hate to do that, but I play a lot of different games and it's rare that I get as frustrated as that. Maybe this is not normal for this game and I just had a really bad RNG luck, but it was my very first play-through, so go figure how that's even likely. Maybe you can load it and the RNG won't hit again and you won't get sick, but I'm not loading and saving and going through all that wasted time just to get around this game wrecking mechanic.\r\nI'm not down for uncontrolled, unexplained, run ruining chaos in my 4x game. Sorry, not sorry.\r\nGlad I got the game on sale, I'd be pissed if I payed full price for this carbon copy.\r\nAlright, well cool, there are plenty of other awesome games to play. Thanks for listening!",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Not a bad Civ clone. However I find the gameplay tedious due to micro management. At some point one just wanna go on a crusade and worry less about tutoring some 10 year old who is 17th in line for the crown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "In some ways, it's better than Sid Meier's Civilisation, but in some ways, it's inferior.\nThe good: leaders age & die, don't have Caesar for 5000 years. You need to get an heir & a clear line of succession, lest you face succession war.\nThe bad: you can't settle a new city. Just can't. Wanted to build my second city on the coast, near to Gold & Gems, but you can't. Has to be on an urban tile. Found one & moved settler there, but needs to be connected to capital. Built road from capital to there, still won't do it. I give up.\nAlso, didn't get a Settler for ages. \nYou need to research a tech to get game music playing, which I get is nice, but kinda BS, I want something to listen to. \nTribal camps, whilst an interesting mechanic, spawned a stupid amount of units & raiders on me, over & over.\nCombat was a little more interesting at least, but gonna be honest, I'd rather just play CIV V again. \nI know it has mods, but I can't be arsed.\n\nEdit: Ah, okay, thanks, I'll give this another try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Odd game, everything is in order, has ton of content, QoL and all of it in functional great looking package...\r\n\r\nbut it is simply not fun. What kept me playing was curiosity, not the gameplay. And I ran out of the curiosity.\r\n\r\nThe issue is, the game tries to look on surface like more complex Civilization, but is in fact much less complex and intriguing than any Civ I played (3-6). On surface all looks complex - dynastic relationships, court, generals, activities, decisions... but it is a front for many systems, that do not feel deep or meaningful to interact with.\r\n\r\nSomehow, this game has worse diplomacy than Civ Beyond Earth, somehow it has a dynasty system from CK3 that feels like it does jack shit, and reduces many instances of strategy to choose one of three/four options (as if this was one of those brain dead Survivors clones), making the game just kind of not exciting the play. It drags, not much happens, no choice feels meaningful. You can build cities, guess what, only on city sites, further taking away from one of the most important aspects of Civ, looking for a good city spots, analysing terrain... and more, these are my main takeaways.\r\n\r\nMaybe there is more, but honestly, I have spent 6 hours of my life already and it was not getting any better, so I cut this lose.\r\n\r\nFor devs, you are talented and did great job, the game is just not that fun to play, is all, kinda meh, alright for a slow day... But get a strong design in your hands and you can do bangers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love CIV pre CIV 5 (CIV 5 was bad and CIV 6 was junk). I hated Crusader Kings. So coming in I looked at the game as a mixed bag. \nThen I started playing it. First problem right off the bad is information overload. There is too much going on and no helpful help system to explain anything. At least with CIV, everything made sense. If you want to produce something, you know what affected producing things. With this game, it's more of magic behind the scenes affects producing.\nThen I tried out battling. I found out really quick that this game's biggest weakness was battling. First, AI units are inherently stronger even if you have more advanced units. They will send in 3 units and make mince meat of anything you have. If you try to attack them, expect to waste actions cause it will take 5-7 of of your units to hopefully kill one of their units. On top of that, the AI produces units faster than roaches multiply. With the AI set up to be somewhat weaker than you are, you will find that by the time you can produce enough settlers to create 3 cites, they will be on their 4th with an army of units already. \nThen there is the annoyance that you can't really do anything cause of orders. You set workers and your one scout to automate and find they just sit there doing nothing all game. Meanwhile the AI system is chugging away and somehow has double your order count. Seems the can reproduce orders as fast as they can units. \nJust this minute, I had an enemy archer completely surrounded by 6 units. It took all 6 to defeat a single archer. Something is messed up when it takes that much work for a single weak unit when they could have easily taken out my strongest unit with just 3 units. I ended up keeping that from happening by opening the editor and blocking their territory with mountains so I didn't have the AI swarming me with super humans anymore.\n\nOverall, it was a good concept of a game but falls way short of being good. Unless you open up the game editor and periodically erase AI units to even the playing field. \n\nI see other people mention things that are a problem and the common reply is that you can just turn off this or that feature. But what's the point of playing a game if you have to turn off all the features to make it playable?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It doesn't feel weighty or impactful. It's very unclear what's happening as 17 things are happening every turn. The tutorial was either 'baby's first 4x' or 'we explain nothing, until after you've done the thing' (eg: nested tool-tips exist, but the game doesn't tell you about it until several turns in... I needed that on turn 1!).\n\nBought it on sale for <CA$6, and still applied for a refund.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Has the same problem all of these games have, AI cheats, can build insane amounts of military units early on making early game frustrating. I already know how this plays out, if I survive the early game I eventually become unstoppable, Its an old and tired game style of these types of games, and one day I hope to find one that is balanced throughout instead of insanely front loaded when it comes to difficulty.\n\nI'm not even going to bother pushing onwards, because if it doesn't work like that, then the entire game will be fighting against overwhelming odds and that I don't find fun either.\n\nHonestly, the anti player bias in these style of games (and total war, one of my favorite series suffers this too) is about half the problem. Bandit/barbarian whatever else will walk past the AI to attack the player.\n\nIf this hadn't been the case, I wouldn't be slogged down in a 2 front war which would have made fighting the enemies I had on my eastern front a lot more fun, even though they were annoyingly over stacked. Instead I had to split my already undersized compared to my enemies forces in half because of a never ending onslaught of random spawn bandit enemies on me western flank, which was otherwise secure with only friendly AI (that they of course ignored and walked past to attack me) in that direction.\n\nI finally alt F4'd and uninstalled when a 3rd front opened by even more random spawn enemies to my south, making the situation completely untenable. \n\nI have no interest in restarting over and over trying to get the right circumstances and force counts to 'win' the early game, Because like civ before it, I already know how this plays out. Same old tired trope of annoying start and way too easy late game.\n\nI don't know why devs think anti player bias is fun, but I wish they would get it through their thick skulls it just isn't. It makes the world feel inorganic, which in this style of game, I think just ruins the experience. \n\nSome day, one developer will figure out that most people hate this, and they will add a slider, so people who do want to be swarmed can crank it up, and people who want a more organic world growth can turn it down or off. Until then, I think this will be my last 'civilization style' game for awhile.\n\nP.S. butthurt fanboys throwing me points isn't going to change the review lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can only imagine the pitch meeting for this game going something like this. \"let's take tried and true game mechanics, overcomplicate them, and sell it as a new game\". If you're of the opinion \"less is more\", DON'T BUY THIS GAME. It's trying too hard to be a grand strategy game in a 4X setting and the blend leaves it with an identity crisis.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fine I guess. Bought this becauase I love Civ, and it's kinda of similar. There are neat aspects like the individual side quests from your family, but nothing about this game is straight forward or intuitive. On top of the learning curve, there is so much information on the screen at all times that the font size for your information is tiiiiiiiny, making the screen a pain in the ass to read. \r\nNot for me. Civ 5 is still the GOAT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the most precise Civ ripoff anyone could make. A part of me has to admire the effort that went in to copying Civilization bit for bit.\n\nWhy anyone would want to make a 1:1 copy of a clunky, bloated, pointless mess that wastes your time like a Facebook game is beyond me, but they did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mediocre civ clone, it's okay but nothing great",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried many, many times to enjoy playing this game, and I have never succeeded. The event system is simply too irritating. There is no such thing as \"immersion\" in this game whatsoever, and it never succeeds at creating fun stories where this empire and that empire are fighting each other, etc. Instead you are constantly fighting against the event system and ONLY against the event system. There is nothing to fight against in this game other than the event system, and this becomes both extremely irritating and extremely boring at the same time. Many of the event systems in this game have choice structures that go like this: Choice 1) Do this quest, build these ten farms, whatever (this is irritating) OR Choice 2: Lots of enemy raiders spawn in your terrority (this is extremely irriitation). \r\n\r\nIf you enjoy games where you get to choose between one thing that is irritating and another thing that is also irritating, this is exactly the game for you. If your idea of a good time on a Friday night is to be asked the question \"would you like 50 gold, 100 lumber, or 200 civics?\" this is exactly the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Multiplayer Wargame With 4X Foundation[/h1]\n\n[h2]Fatigue, Information Overload and Ugliness Earn Old World A 2 Out of 5[/h2]\n\n[b]THE GOOD: Cities and specialists; Pings; Undo; Orders; Vassal Families[/b]\n\n[b]THE BAD: Diplomacy; Religion; Espionage; Influence Actions[/b]\n\n[b]THE UGLY: Neverending text; Everything looks the same; Data displays are crude and ugly; A very rough UI[/b]\n\nOld World is for lawyers and gamblers, not for engineers or accountants. It has some interesting concepts which enhance gameplay by exploiting the natural tension between freedom and constraints. I hope others duplicate the conceptual innovations in Old World and improve upon them in other 4X titles.\n\nOld World's user interface is text- and number-dense. Playing beyond about four hours leads to a sense of fatigue and information overload. Things one might like to plan ahead of time, e.g. technological research or military unit promotions, are wrapped in random processes that appeal to devil-may-care gamblers but drive deliberate strategists mad. Frustration sets in when one tries to learn one's lessons from previous losses, only to be stymied because one can't make long-term plans for structural reasons intrinsic to the game. These structural aspects aggravate the information overload precisely because they make long-term strategic planning so exasperating.\n\nOld World's intended audience is players seeking a Multiplayer Wargaming experience with a 4X foundation. Many (most?) experienced Old World players value the developers' attention to aspects of Multiplayer gameplay that were absent from or very poorly implemented in other 4X titles. I exclusively play Single Player, and though I enjoy stomping my annoying neighbors' guts out as much as anyone, that's not the only way I play 4X games. The victory conditions are boring, especially the Ambitions Victory, which, for structural reasons described previously, is challenging for all the wrong reasons.\n\nMany positive reviewers on Steam reveal themselves to be unserious, as they are enthusiasts, fanbois and gatekeepers who abandon their critical faculties in defense of a game they believe is under-appreciated and not well publicized. Both of these things may be true of Old World but reviews don't settle scores. \"Historical\" justifications of Old World come either from fools or charlatans. The game's many grossly ahistorical elements are documented and criticized in detail elsewhere. Old World is \"history based,\" at best. It is [i]not[/i] \"historical.\" There's nothing wrong with that! But don't try to church up Old World with assertions of historicity.\n\n[b]THE GOOD:[/b]\n[b]1. City limits, workable tiles and specialists.[/b] There's usually a way to get what you want where you want it, though not necessarily when you need it. Borders can grow stupidly, which should be fixed, e.g., don't give that unincorporated wheat to my Champions city when my Landowners city is within equal range.\n\n[b]2. The Ping system[/b] is great for planning improvements. Reminder pings need improvement. Setting a reminder ping to, say, promote a military unit on turn X will cause the ping message to post in the long list of messages delivered at the start of turn X, but the map pin is immediately removed! Leave time-sensitive pings on the map until they're acknowledged or removed manually.\n\n[b]3. Undo is wonderful![/b] Make the Actions Stack viewable so that the player can easily select the last event they want to \"keep\" when they undo Actions.\n\n[b]4. The Orders concept[/b] is an interesting constraint on player actions. Are the computer players also so constrained? The need for the player to decide which actions to take this turn (vs. later or maybe never) limits one's horizons, but it presents a challenge that's interesting to deal with.\n\n[b]5. The Vassal Families system[/b] presents interesting challenges. Why aren't all 10 vassal families available to every civilization? Keep the limit of only three Families per empire. There's no good reason to arbitrarily make it impossible for a particular civilization to incorporate any of the different Vassal Families, so long as there are never more than three Families present in the empire.\n\n[b]THE BAD:[/b]\n[b]1. The Diplomacy system stinks.[/b] It's too limited and it's lame that an Ambassador is required in order to take any diplomatic action. It's reasonable to require an Ambassador to conduct diplomacy with other Civilizations. It's unreasonable to require an Ambassador to conduct diplomacy with Tribes. The few Ambassador Actions available suggest that the Diplomacy system was just bolted onto the game rather than developed right from the beginning. My Orders are better spent elsewhere.\n\n[b]2. The Religion system stinks.[/b] Like Diplomacy, Religion seems like an afterthought. Civilizations without Clerics Families or that don't start the game with the Divination technology or with the Husbandry technology will almost never found a World Religion except by sheer accident due to a random Event. Pagan Religions are second-class to World Religions, making them a short-term sink of one's precious Orders, so why bother?\n\n[b]3. The Espionage system is weak.[/b] It's reasonable to require a Spymaster to conduct Espionage Missions against other Civilizations. It's unreasonable to require a Spymaster to, e.g., \"deal with\" my rotten jealous scheming twin brother who lives forever and is an irredeemable nuisance and DEFCON 1 threat to my Rule and my household. It's completely arbitrary that all the nasty things one might need to do without being noticed within one's own civilization are off limits until one reaches the developmental stage at which it is also possible to foment unrest in foreign lands or steal technologies from adversaries. And Spymasters can't stir up the Tribes.\n\n[b]4. Influence Actions are too limited.[/b] One Character can only attempt to Influence (\"A chats up B\") another Character exactly one time, ever, throughout the entire lives of both Characters (A and B). One Character can only be Interceded For (\"C chats up B on A's behalf\") one time, ever, throughout the entire lives of both principal Characters (A and B). And during Leadership transitions, womp womp Legitimacy tanks! Good luck getting all your VIPs happily in line. You get one shot and one shot only per Influence target. What am I, made of Orders? Better to spend them on sure things.\n\n[b]THE UGLY:[/b]\n[b]1. \"Yo I heard you like reading.\"[/b] Everything that's not the map terrain itself is text. Tiny icons and tiny text litter the map, every notification is text... you'll do so much reading and clicking through menus in Old World that you'll suffer eye strain. Tooltips and text labels need different typefaces to separate and highlight different bits of information. The net effect is information overload. Animations and voice acting for Events would do wonders to liven things up.\n\n[b]2. All the improvements look the same.[/b] Each improvement type looks identical across all Civilizations, lacking any national or regional character. Is it all made out of ticky-tacky?\n\n[b]3. Tables, charts and graphs are more crude and ugly than useful.[/b] For example, the Family Opinion chart. One sees three traces plotted vs. time. Three numbers, that's it! Information, especially numerical data, is presented in a very limited and visually unappealing way that screams \"SuSE Linux, circa 2003.\"\n\n[b]4. The UI is fiddly and sticky.[/b] Tooltips with tooltips on their tooltips make for a very fiddly experience. There's a lot of clicking this and clicking that and having to drag the map this way and that, which worsens player fatigue caused by turn after turn of textalanche. Units cycle in a fixed order, bouncing from one end of the map to the other. One can automate Scouts and Workers, but military units need their hands held every step they take.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's weird. The game looks better than Civilization, but after all it's boring. I even can't say what's wrong. Too much micromanagement, so much that you don't remember where, who and what. Too much variety of unit upgrades, but you don't remember which unit is better for what. You want fight, but you find yourself in never ending hex upgrades. The game is so complex that than you see it the first time you think: \"Wow, it's cool. Those orders must be used wisely\". And then you find yourself in constant orders restrictions in a way that if you want do something - don't do it, better check - maybe is there something more urgent? It sound deep, but in practice feel yourself limping. I really wanted to like this game, but I can't.",
      "voted_up": false,
      "votes_helpful": 146
    },
    {
      "review": "It is a good game, dont take me wrong, but I cannot recommend it to anyone like myself. I wont play it past achievements, because the heavy involvement of RNG in every aspect of the game, which removes the only reason why I love strategy games: roleplay and control. \n\nPROS\n+ constant updates\n+ looks and plays good\n\nCONS\n- RNG - Eevery aspect of the game is riddled with RNG. You cannot achieve specific character traits because they are locked behind RNG, you cannot foster relationships with other factions because they are locked behind RNG, you cannot specialize your faction in any way because research is locked behind RNG. \nRNG makes any form of roleplay or controll (both things I love and seek in games) simply impossible, and it is the single one thing that bars me from fully enjoying the game fully.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "It's pretty good but the way armies work is obnoxious. Even with scouting you can have armies do the Civ equivalent of five moves, and then attack. Multiple of them. So an entire army can appear out of absolutely nowhere and surround/kill your units out of nowhere. Frustrating, no real counters, very annoying.\n\nOtherwise, it's alright, but given its narrow scope the lack of nation-specific techs and units is really disappointing.\n\nToo thin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Basically Civ with some elements of Crusader Kings, but I really didnt care about taking care of your royal family, building relationships and intrigue, it was distracting and tiresome. The Civ elements are little bit better, but a lot of things made me not recommend this one, like you can only build new cities on predisposed places, a lot of RNG and enemy movement is just so quick that I ended up surrounded by enemy armies that I didnt see at all previous turn, feels like AI is cheating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[h1]A Beautiful Disappointment: Ambition Without Execution[/h1]\r\nI'm a history buff and a fan of 4X games, so Old World should have been perfect for me. The concept is compelling - a 4X game set in antiquity with dynastic mechanics and character-driven narratives. The art direction is beautiful, and I think the developers had good intentions. Unfortunately, that doesn't make up for the game's problems.\r\n[hr][/hr]\r\n[b]The Identity Crisis[/b]\r\nOld World feels like it's trying to be three different games at once: Civilization's empire-building, Europa Universalis' depth, and Hearts of Iron's strategic complexity. It doesn't succeed at being any of them. It's stuck in an awkward middle ground where it's too shallow for grand strategy enthusiasts but too convoluted for casual 4X players.\r\n[hr][/hr]\r\n[b]Forced Ideology and Limited Agency[/b]\r\nOne of my biggest frustrations is how the game pushes contemporary cultural expectations and ideals into your face during gameplay. Mods can fix this (thankfully), but it shouldn't require community intervention to make a historical game feel less like social commentary. I play these games to engage with history on its own terms, not to have modern sensibilities imposed on ancient civilizations.\r\n[hr][/hr]\r\n[b]Shallow Systems[/b]\r\nThe problem-solving paths are severely gated and limited compared to what Europa Universalis offers. When challenges arise, you're forced down narrow story-driven solutions rather than having real strategic options. The economics feel underbaked, and production times are painfully long without the depth to justify it. Everything takes forever, but nothing feels particularly rewarding when completed.\r\n[hr][/hr]\r\n[b]Better Options Exist[/b]\r\nI wanted this to work, but there are simply better games out there. If you want accessible 4X gameplay, Civilization V (or earlier) does it better. For grand strategy depth, Europa Universalis IV is superior. For character-driven narratives, Crusader Kings III excels. Even older games like Endless Legend or Endless Space offer more satisfying experiences.\r\nOld World falls short in nearly every category it attempts. I can't recommend it when superior alternatives exist at similar or lower price points.\r\n[b]Not Recommended[/b] âŒ",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: This is an overcomplicated Civilization.\r\nIt has good mechanics but nothing extraordinary.\r\nSpying is a joke and doesn't really have any major effect on the gameplay.\r\nAI use of \"forced march\" is a joke, it feels like the game is cheating non-stop.\r\nYou attack someone and AI just pulls out 15+ units from the fog in one turn... (even if you installed multiple scouts)\r\nMicro-managing the micromanaged things over and over again, just dreadful.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First impression was very positive.  The core mechanics are familiar, with some things more fleshed out compared to Civ and other things simplified.  Within a few hours the cracks were showing though.  \n\nOne of the areas the game focuses on is characters - individual people who get older with each turn and have roles in your court or line of succession and so on.  IMO this aspect is far too fiddly for very little benefit.  They broke it into a bunch of little pieces that are not fun to micromanage.  You get spammed constantly with notifications that certain people are getting ill, enough that it started to feel comical, which contributed to the feeling of the whole people aspect quickly turning into a list of random names that mean nothing.  There's a bunch of them there on the right side of the screen, and they all have opinions and those opinions are influenced by a lot of things and their opinions in turn influence a lot of other things.  I don't know who they are or why but they sure do get sick and die a lot and randomly acquire traits that do something to their stats.  I think they got a little carried away with developing the people part of the game but tbf I'm more of a Civ person than a Crusader Kings person so maybe you like that stuff.  It just felt to me like I'm trying to put some Legos together and when I pick up a Lego it turns out to be a pile of ants instead of a Lego piece - too much granularity with too much randomness and chaos, and it just didn't need to be that way because the work to benefit ratio of staying on top of these people seems poor.  Just seems very fiddly and random for no good reason.\n\nAlso a religion formed spontaneously in one of my cities, I don't know where it came from or how to deal with it but it made a bunch of people unhappy with me for not being that new thing.  The music is great but the vocals are a bit much, I wish I could get an instrumental track because the singers, while talented, need to chill for being a background soundtrack for a game.  I'm not mad though, I got it 90% off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A nice looking game with poor user interface. Tech advancement is random card based on your tech level. Anything you dont pick is discarded. So if you pick stone working instead of animal husbandry, then you dont see that tech again until you have run out things to research and the discards are shuffled back in. Since whatever you pick unlocks new tech that you have to choose from, and then that tech leads to more.......... Well..... you might end up researching a level 8 tech branch before you even get the option to return to important level 1 tech. Add in the fact that cities are already randomly placed on the map, most poorly optimized. This game is like CIV series weaker, dumber cousin who tries to take his place and fails.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have enjoyed it. I feel its better and more intuitive step by step that CK3. \r\n\r\nIts just when you atack other nations you need usually like 6 or 15 units realistically late game to win against one city and keep it. My experience. \r\nAnd to much micromanagement. Always sending your ruler and council out on the same repetive jobs for temporary gain.\r\nAnd you might have lost 50 too 100 turns in , but you wont know for sure befor 180 turns gone by...\r\n\r\nSo i lost interest",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really was enjoying this game and marveling how identical it is to Civilization, (I was there as a kid for OG Civ1, played a ton of 5 and 6 when my kids were babies) but Old World had it's own little twist.\r\nNot kidding, at all, it's almost a total ripoff of Civ mechanics. In almost every. single. way.\r\nThe family dynamics twist seemed kind of intriguing to me, though. \r\nIt was something new, and I was liking what I was seeing.\r\nThe interface was good, the mechanics all seemed to be there.\r\nThe different families for each nation, and the members of each family and their feelings about each other and their traits and how that all affects the nation was new to me and right up my alley.\r\nI was making choices and doing researches and building tile improvements and really getting a feel for the game.\r\nI had met another nation and some city states and was making peace and diplomacy.\r\nMy step-son was mad initially he wasn't the heir, but I gave him a job and made him an advisor and felt we were getting along and I even forgave him when he go caught being a traitor.\r\nMy heir, my daughter married a prince from a City-state and I had a granddaughter and I was like, this is awesome. I am totally digging this family dynamic mixed into the good old Civ gameplay.\r\nSuddenly, in under 30 total turns, I became ill, then gravely ill, then doomed, and then died within 4 turns.\r\nAll my plans, diplomacy, relations went to hell, but I'm like, ok it's cool people get old and die, that's this game's mechanic to keep you challenged. My daughter will step in and take over control of the empire and I'll hopefully have another 30 turns or longer trying to make some progress before she dies too.\r\nWithin 4 turns, I'm not even kidding, ill, gravely ill, doomed.\r\nI rage quit right there, and it will likely be a long time, if ever, I come back to this game.\r\nWhy did they get sick? NO REASON GIVEN. I had so many farms and so much food, I was killing it.\r\nI would understand if there was like a famine or some game mechanic that would have instigated the illness.\r\nWhy couldn't I do anything to try and improve their health to keep them alive? BECAUSE.\r\nNo medicine, no obligatory rest, no options at all to try and rectify the illness. Just dead.\r\nMy mom died of cancer pretty suddenly a few years back, I don't need my games to mimic that trauma and make me feel helpless and powerless, life does that well enough, thank you.\r\nGames are supposed to be an escape from reality. An opportunity to use your intellect and your choice to affect a favorable outcome in a controlled environment. Hell, I even played Darkest Dungeon and enjoyed it.\r\nI gotta leave a negative review, and I hate to do that, but I play a lot of different games and it's rare that I get as frustrated as that. Maybe this is not normal for this game and I just had a really bad RNG luck, but it was my very first play-through, so go figure how that's even likely. Maybe you can load it and the RNG won't hit again and you won't get sick, but I'm not loading and saving and going through all that wasted time just to get around this game wrecking mechanic.\r\nI'm not down for uncontrolled, unexplained, run ruining chaos in my 4x game. Sorry, not sorry.\r\nGlad I got the game on sale, I'd be pissed if I payed full price for this carbon copy.\r\nAlright, well cool, there are plenty of other awesome games to play. Thanks for listening!",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Not a bad Civ clone. However I find the gameplay tedious due to micro management. At some point one just wanna go on a crusade and worry less about tutoring some 10 year old who is 17th in line for the crown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "In some ways, it's better than Sid Meier's Civilisation, but in some ways, it's inferior.\nThe good: leaders age & die, don't have Caesar for 5000 years. You need to get an heir & a clear line of succession, lest you face succession war.\nThe bad: you can't settle a new city. Just can't. Wanted to build my second city on the coast, near to Gold & Gems, but you can't. Has to be on an urban tile. Found one & moved settler there, but needs to be connected to capital. Built road from capital to there, still won't do it. I give up.\nAlso, didn't get a Settler for ages. \nYou need to research a tech to get game music playing, which I get is nice, but kinda BS, I want something to listen to. \nTribal camps, whilst an interesting mechanic, spawned a stupid amount of units & raiders on me, over & over.\nCombat was a little more interesting at least, but gonna be honest, I'd rather just play CIV V again. \nI know it has mods, but I can't be arsed.\n\nEdit: Ah, okay, thanks, I'll give this another try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Odd game, everything is in order, has ton of content, QoL and all of it in functional great looking package...\r\n\r\nbut it is simply not fun. What kept me playing was curiosity, not the gameplay. And I ran out of the curiosity.\r\n\r\nThe issue is, the game tries to look on surface like more complex Civilization, but is in fact much less complex and intriguing than any Civ I played (3-6). On surface all looks complex - dynastic relationships, court, generals, activities, decisions... but it is a front for many systems, that do not feel deep or meaningful to interact with.\r\n\r\nSomehow, this game has worse diplomacy than Civ Beyond Earth, somehow it has a dynasty system from CK3 that feels like it does jack shit, and reduces many instances of strategy to choose one of three/four options (as if this was one of those brain dead Survivors clones), making the game just kind of not exciting the play. It drags, not much happens, no choice feels meaningful. You can build cities, guess what, only on city sites, further taking away from one of the most important aspects of Civ, looking for a good city spots, analysing terrain... and more, these are my main takeaways.\r\n\r\nMaybe there is more, but honestly, I have spent 6 hours of my life already and it was not getting any better, so I cut this lose.\r\n\r\nFor devs, you are talented and did great job, the game is just not that fun to play, is all, kinda meh, alright for a slow day... But get a strong design in your hands and you can do bangers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love CIV pre CIV 5 (CIV 5 was bad and CIV 6 was junk). I hated Crusader Kings. So coming in I looked at the game as a mixed bag. \nThen I started playing it. First problem right off the bad is information overload. There is too much going on and no helpful help system to explain anything. At least with CIV, everything made sense. If you want to produce something, you know what affected producing things. With this game, it's more of magic behind the scenes affects producing.\nThen I tried out battling. I found out really quick that this game's biggest weakness was battling. First, AI units are inherently stronger even if you have more advanced units. They will send in 3 units and make mince meat of anything you have. If you try to attack them, expect to waste actions cause it will take 5-7 of of your units to hopefully kill one of their units. On top of that, the AI produces units faster than roaches multiply. With the AI set up to be somewhat weaker than you are, you will find that by the time you can produce enough settlers to create 3 cites, they will be on their 4th with an army of units already. \nThen there is the annoyance that you can't really do anything cause of orders. You set workers and your one scout to automate and find they just sit there doing nothing all game. Meanwhile the AI system is chugging away and somehow has double your order count. Seems the can reproduce orders as fast as they can units. \nJust this minute, I had an enemy archer completely surrounded by 6 units. It took all 6 to defeat a single archer. Something is messed up when it takes that much work for a single weak unit when they could have easily taken out my strongest unit with just 3 units. I ended up keeping that from happening by opening the editor and blocking their territory with mountains so I didn't have the AI swarming me with super humans anymore.\n\nOverall, it was a good concept of a game but falls way short of being good. Unless you open up the game editor and periodically erase AI units to even the playing field. \n\nI see other people mention things that are a problem and the common reply is that you can just turn off this or that feature. But what's the point of playing a game if you have to turn off all the features to make it playable?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It doesn't feel weighty or impactful. It's very unclear what's happening as 17 things are happening every turn. The tutorial was either 'baby's first 4x' or 'we explain nothing, until after you've done the thing' (eg: nested tool-tips exist, but the game doesn't tell you about it until several turns in... I needed that on turn 1!).\n\nBought it on sale for <CA$6, and still applied for a refund.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Has the same problem all of these games have, AI cheats, can build insane amounts of military units early on making early game frustrating. I already know how this plays out, if I survive the early game I eventually become unstoppable, Its an old and tired game style of these types of games, and one day I hope to find one that is balanced throughout instead of insanely front loaded when it comes to difficulty.\n\nI'm not even going to bother pushing onwards, because if it doesn't work like that, then the entire game will be fighting against overwhelming odds and that I don't find fun either.\n\nHonestly, the anti player bias in these style of games (and total war, one of my favorite series suffers this too) is about half the problem. Bandit/barbarian whatever else will walk past the AI to attack the player.\n\nIf this hadn't been the case, I wouldn't be slogged down in a 2 front war which would have made fighting the enemies I had on my eastern front a lot more fun, even though they were annoyingly over stacked. Instead I had to split my already undersized compared to my enemies forces in half because of a never ending onslaught of random spawn bandit enemies on me western flank, which was otherwise secure with only friendly AI (that they of course ignored and walked past to attack me) in that direction.\n\nI finally alt F4'd and uninstalled when a 3rd front opened by even more random spawn enemies to my south, making the situation completely untenable. \n\nI have no interest in restarting over and over trying to get the right circumstances and force counts to 'win' the early game, Because like civ before it, I already know how this plays out. Same old tired trope of annoying start and way too easy late game.\n\nI don't know why devs think anti player bias is fun, but I wish they would get it through their thick skulls it just isn't. It makes the world feel inorganic, which in this style of game, I think just ruins the experience. \n\nSome day, one developer will figure out that most people hate this, and they will add a slider, so people who do want to be swarmed can crank it up, and people who want a more organic world growth can turn it down or off. Until then, I think this will be my last 'civilization style' game for awhile.\n\nP.S. butthurt fanboys throwing me points isn't going to change the review lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can only imagine the pitch meeting for this game going something like this. \"let's take tried and true game mechanics, overcomplicate them, and sell it as a new game\". If you're of the opinion \"less is more\", DON'T BUY THIS GAME. It's trying too hard to be a grand strategy game in a 4X setting and the blend leaves it with an identity crisis.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fine I guess. Bought this becauase I love Civ, and it's kinda of similar. There are neat aspects like the individual side quests from your family, but nothing about this game is straight forward or intuitive. On top of the learning curve, there is so much information on the screen at all times that the font size for your information is tiiiiiiiny, making the screen a pain in the ass to read. \r\nNot for me. Civ 5 is still the GOAT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the most precise Civ ripoff anyone could make. A part of me has to admire the effort that went in to copying Civilization bit for bit.\n\nWhy anyone would want to make a 1:1 copy of a clunky, bloated, pointless mess that wastes your time like a Facebook game is beyond me, but they did.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mediocre civ clone, it's okay but nothing great",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried many, many times to enjoy playing this game, and I have never succeeded. The event system is simply too irritating. There is no such thing as \"immersion\" in this game whatsoever, and it never succeeds at creating fun stories where this empire and that empire are fighting each other, etc. Instead you are constantly fighting against the event system and ONLY against the event system. There is nothing to fight against in this game other than the event system, and this becomes both extremely irritating and extremely boring at the same time. Many of the event systems in this game have choice structures that go like this: Choice 1) Do this quest, build these ten farms, whatever (this is irritating) OR Choice 2: Lots of enemy raiders spawn in your terrority (this is extremely irriitation). \r\n\r\nIf you enjoy games where you get to choose between one thing that is irritating and another thing that is also irritating, this is exactly the game for you. If your idea of a good time on a Friday night is to be asked the question \"would you like 50 gold, 100 lumber, or 200 civics?\" this is exactly the game for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "don't play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blah",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Multiplayer Wargame With 4X Foundation[/h1]\n\n[h2]Fatigue, Information Overload and Ugliness Earn Old World A 2 Out of 5[/h2]\n\n[b]THE GOOD: Cities and specialists; Pings; Undo; Orders; Vassal Families[/b]\n\n[b]THE BAD: Diplomacy; Religion; Espionage; Influence Actions[/b]\n\n[b]THE UGLY: Neverending text; Everything looks the same; Data displays are crude and ugly; A very rough UI[/b]\n\nOld World is for lawyers and gamblers, not for engineers or accountants. It has some interesting concepts which enhance gameplay by exploiting the natural tension between freedom and constraints. I hope others duplicate the conceptual innovations in Old World and improve upon them in other 4X titles.\n\nOld World's user interface is text- and number-dense. Playing beyond about four hours leads to a sense of fatigue and information overload. Things one might like to plan ahead of time, e.g. technological research or military unit promotions, are wrapped in random processes that appeal to devil-may-care gamblers but drive deliberate strategists mad. Frustration sets in when one tries to learn one's lessons from previous losses, only to be stymied because one can't make long-term plans for structural reasons intrinsic to the game. These structural aspects aggravate the information overload precisely because they make long-term strategic planning so exasperating.\n\nOld World's intended audience is players seeking a Multiplayer Wargaming experience with a 4X foundation. Many (most?) experienced Old World players value the developers' attention to aspects of Multiplayer gameplay that were absent from or very poorly implemented in other 4X titles. I exclusively play Single Player, and though I enjoy stomping my annoying neighbors' guts out as much as anyone, that's not the only way I play 4X games. The victory conditions are boring, especially the Ambitions Victory, which, for structural reasons described previously, is challenging for all the wrong reasons.\n\nMany positive reviewers on Steam reveal themselves to be unserious, as they are enthusiasts, fanbois and gatekeepers who abandon their critical faculties in defense of a game they believe is under-appreciated and not well publicized. Both of these things may be true of Old World but reviews don't settle scores. \"Historical\" justifications of Old World come either from fools or charlatans. The game's many grossly ahistorical elements are documented and criticized in detail elsewhere. Old World is \"history based,\" at best. It is [i]not[/i] \"historical.\" There's nothing wrong with that! But don't try to church up Old World with assertions of historicity.\n\n[b]THE GOOD:[/b]\n[b]1. City limits, workable tiles and specialists.[/b] There's usually a way to get what you want where you want it, though not necessarily when you need it. Borders can grow stupidly, which should be fixed, e.g., don't give that unincorporated wheat to my Champions city when my Landowners city is within equal range.\n\n[b]2. The Ping system[/b] is great for planning improvements. Reminder pings need improvement. Setting a reminder ping to, say, promote a military unit on turn X will cause the ping message to post in the long list of messages delivered at the start of turn X, but the map pin is immediately removed! Leave time-sensitive pings on the map until they're acknowledged or removed manually.\n\n[b]3. Undo is wonderful![/b] Make the Actions Stack viewable so that the player can easily select the last event they want to \"keep\" when they undo Actions.\n\n[b]4. The Orders concept[/b] is an interesting constraint on player actions. Are the computer players also so constrained? The need for the player to decide which actions to take this turn (vs. later or maybe never) limits one's horizons, but it presents a challenge that's interesting to deal with.\n\n[b]5. The Vassal Families system[/b] presents interesting challenges. Why aren't all 10 vassal families available to every civilization? Keep the limit of only three Families per empire. There's no good reason to arbitrarily make it impossible for a particular civilization to incorporate any of the different Vassal Families, so long as there are never more than three Families present in the empire.\n\n[b]THE BAD:[/b]\n[b]1. The Diplomacy system stinks.[/b] It's too limited and it's lame that an Ambassador is required in order to take any diplomatic action. It's reasonable to require an Ambassador to conduct diplomacy with other Civilizations. It's unreasonable to require an Ambassador to conduct diplomacy with Tribes. The few Ambassador Actions available suggest that the Diplomacy system was just bolted onto the game rather than developed right from the beginning. My Orders are better spent elsewhere.\n\n[b]2. The Religion system stinks.[/b] Like Diplomacy, Religion seems like an afterthought. Civilizations without Clerics Families or that don't start the game with the Divination technology or with the Husbandry technology will almost never found a World Religion except by sheer accident due to a random Event. Pagan Religions are second-class to World Religions, making them a short-term sink of one's precious Orders, so why bother?\n\n[b]3. The Espionage system is weak.[/b] It's reasonable to require a Spymaster to conduct Espionage Missions against other Civilizations. It's unreasonable to require a Spymaster to, e.g., \"deal with\" my rotten jealous scheming twin brother who lives forever and is an irredeemable nuisance and DEFCON 1 threat to my Rule and my household. It's completely arbitrary that all the nasty things one might need to do without being noticed within one's own civilization are off limits until one reaches the developmental stage at which it is also possible to foment unrest in foreign lands or steal technologies from adversaries. And Spymasters can't stir up the Tribes.\n\n[b]4. Influence Actions are too limited.[/b] One Character can only attempt to Influence (\"A chats up B\") another Character exactly one time, ever, throughout the entire lives of both Characters (A and B). One Character can only be Interceded For (\"C chats up B on A's behalf\") one time, ever, throughout the entire lives of both principal Characters (A and B). And during Leadership transitions, womp womp Legitimacy tanks! Good luck getting all your VIPs happily in line. You get one shot and one shot only per Influence target. What am I, made of Orders? Better to spend them on sure things.\n\n[b]THE UGLY:[/b]\n[b]1. \"Yo I heard you like reading.\"[/b] Everything that's not the map terrain itself is text. Tiny icons and tiny text litter the map, every notification is text... you'll do so much reading and clicking through menus in Old World that you'll suffer eye strain. Tooltips and text labels need different typefaces to separate and highlight different bits of information. The net effect is information overload. Animations and voice acting for Events would do wonders to liven things up.\n\n[b]2. All the improvements look the same.[/b] Each improvement type looks identical across all Civilizations, lacking any national or regional character. Is it all made out of ticky-tacky?\n\n[b]3. Tables, charts and graphs are more crude and ugly than useful.[/b] For example, the Family Opinion chart. One sees three traces plotted vs. time. Three numbers, that's it! Information, especially numerical data, is presented in a very limited and visually unappealing way that screams \"SuSE Linux, circa 2003.\"\n\n[b]4. The UI is fiddly and sticky.[/b] Tooltips with tooltips on their tooltips make for a very fiddly experience. There's a lot of clicking this and clicking that and having to drag the map this way and that, which worsens player fatigue caused by turn after turn of textalanche. Units cycle in a fixed order, bouncing from one end of the map to the other. One can automate Scouts and Workers, but military units need their hands held every step they take.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's weird. The game looks better than Civilization, but after all it's boring. I even can't say what's wrong. Too much micromanagement, so much that you don't remember where, who and what. Too much variety of unit upgrades, but you don't remember which unit is better for what. You want fight, but you find yourself in never ending hex upgrades. The game is so complex that than you see it the first time you think: \"Wow, it's cool. Those orders must be used wisely\". And then you find yourself in constant orders restrictions in a way that if you want do something - don't do it, better check - maybe is there something more urgent? It sound deep, but in practice feel yourself limping. I really wanted to like this game, but I can't.",
      "voted_up": false,
      "votes_helpful": 146
    },
    {
      "review": "It is a good game, dont take me wrong, but I cannot recommend it to anyone like myself. I wont play it past achievements, because the heavy involvement of RNG in every aspect of the game, which removes the only reason why I love strategy games: roleplay and control. \n\nPROS\n+ constant updates\n+ looks and plays good\n\nCONS\n- RNG - Eevery aspect of the game is riddled with RNG. You cannot achieve specific character traits because they are locked behind RNG, you cannot foster relationships with other factions because they are locked behind RNG, you cannot specialize your faction in any way because research is locked behind RNG. \nRNG makes any form of roleplay or controll (both things I love and seek in games) simply impossible, and it is the single one thing that bars me from fully enjoying the game fully.",
      "voted_up": false,
      "votes_helpful": 180
    },
    {
      "review": "It's pretty good but the way armies work is obnoxious. Even with scouting you can have armies do the Civ equivalent of five moves, and then attack. Multiple of them. So an entire army can appear out of absolutely nowhere and surround/kill your units out of nowhere. Frustrating, no real counters, very annoying.\n\nOtherwise, it's alright, but given its narrow scope the lack of nation-specific techs and units is really disappointing.\n\nToo thin.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Basically Civ with some elements of Crusader Kings, but I really didnt care about taking care of your royal family, building relationships and intrigue, it was distracting and tiresome. The Civ elements are little bit better, but a lot of things made me not recommend this one, like you can only build new cities on predisposed places, a lot of RNG and enemy movement is just so quick that I ended up surrounded by enemy armies that I didnt see at all previous turn, feels like AI is cheating.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[h1]A Beautiful Disappointment: Ambition Without Execution[/h1]\r\nI'm a history buff and a fan of 4X games, so Old World should have been perfect for me. The concept is compelling - a 4X game set in antiquity with dynastic mechanics and character-driven narratives. The art direction is beautiful, and I think the developers had good intentions. Unfortunately, that doesn't make up for the game's problems.\r\n[hr][/hr]\r\n[b]The Identity Crisis[/b]\r\nOld World feels like it's trying to be three different games at once: Civilization's empire-building, Europa Universalis' depth, and Hearts of Iron's strategic complexity. It doesn't succeed at being any of them. It's stuck in an awkward middle ground where it's too shallow for grand strategy enthusiasts but too convoluted for casual 4X players.\r\n[hr][/hr]\r\n[b]Forced Ideology and Limited Agency[/b]\r\nOne of my biggest frustrations is how the game pushes contemporary cultural expectations and ideals into your face during gameplay. Mods can fix this (thankfully), but it shouldn't require community intervention to make a historical game feel less like social commentary. I play these games to engage with history on its own terms, not to have modern sensibilities imposed on ancient civilizations.\r\n[hr][/hr]\r\n[b]Shallow Systems[/b]\r\nThe problem-solving paths are severely gated and limited compared to what Europa Universalis offers. When challenges arise, you're forced down narrow story-driven solutions rather than having real strategic options. The economics feel underbaked, and production times are painfully long without the depth to justify it. Everything takes forever, but nothing feels particularly rewarding when completed.\r\n[hr][/hr]\r\n[b]Better Options Exist[/b]\r\nI wanted this to work, but there are simply better games out there. If you want accessible 4X gameplay, Civilization V (or earlier) does it better. For grand strategy depth, Europa Universalis IV is superior. For character-driven narratives, Crusader Kings III excels. Even older games like Endless Legend or Endless Space offer more satisfying experiences.\r\nOld World falls short in nearly every category it attempts. I can't recommend it when superior alternatives exist at similar or lower price points.\r\n[b]Not Recommended[/b] âŒ",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: This is an overcomplicated Civilization.\r\nIt has good mechanics but nothing extraordinary.\r\nSpying is a joke and doesn't really have any major effect on the gameplay.\r\nAI use of \"forced march\" is a joke, it feels like the game is cheating non-stop.\r\nYou attack someone and AI just pulls out 15+ units from the fog in one turn... (even if you installed multiple scouts)\r\nMicro-managing the micromanaged things over and over again, just dreadful.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "First impression was very positive.  The core mechanics are familiar, with some things more fleshed out compared to Civ and other things simplified.  Within a few hours the cracks were showing though.  \n\nOne of the areas the game focuses on is characters - individual people who get older with each turn and have roles in your court or line of succession and so on.  IMO this aspect is far too fiddly for very little benefit.  They broke it into a bunch of little pieces that are not fun to micromanage.  You get spammed constantly with notifications that certain people are getting ill, enough that it started to feel comical, which contributed to the feeling of the whole people aspect quickly turning into a list of random names that mean nothing.  There's a bunch of them there on the right side of the screen, and they all have opinions and those opinions are influenced by a lot of things and their opinions in turn influence a lot of other things.  I don't know who they are or why but they sure do get sick and die a lot and randomly acquire traits that do something to their stats.  I think they got a little carried away with developing the people part of the game but tbf I'm more of a Civ person than a Crusader Kings person so maybe you like that stuff.  It just felt to me like I'm trying to put some Legos together and when I pick up a Lego it turns out to be a pile of ants instead of a Lego piece - too much granularity with too much randomness and chaos, and it just didn't need to be that way because the work to benefit ratio of staying on top of these people seems poor.  Just seems very fiddly and random for no good reason.\n\nAlso a religion formed spontaneously in one of my cities, I don't know where it came from or how to deal with it but it made a bunch of people unhappy with me for not being that new thing.  The music is great but the vocals are a bit much, I wish I could get an instrumental track because the singers, while talented, need to chill for being a background soundtrack for a game.  I'm not mad though, I got it 90% off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A nice looking game with poor user interface. Tech advancement is random card based on your tech level. Anything you dont pick is discarded. So if you pick stone working instead of animal husbandry, then you dont see that tech again until you have run out things to research and the discards are shuffled back in. Since whatever you pick unlocks new tech that you have to choose from, and then that tech leads to more.......... Well..... you might end up researching a level 8 tech branch before you even get the option to return to important level 1 tech. Add in the fact that cities are already randomly placed on the map, most poorly optimized. This game is like CIV series weaker, dumber cousin who tries to take his place and fails.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I have enjoyed it. I feel its better and more intuitive step by step that CK3. \r\n\r\nIts just when you atack other nations you need usually like 6 or 15 units realistically late game to win against one city and keep it. My experience. \r\nAnd to much micromanagement. Always sending your ruler and council out on the same repetive jobs for temporary gain.\r\nAnd you might have lost 50 too 100 turns in , but you wont know for sure befor 180 turns gone by...\r\n\r\nSo i lost interest",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really was enjoying this game and marveling how identical it is to Civilization, (I was there as a kid for OG Civ1, played a ton of 5 and 6 when my kids were babies) but Old World had it's own little twist.\r\nNot kidding, at all, it's almost a total ripoff of Civ mechanics. In almost every. single. way.\r\nThe family dynamics twist seemed kind of intriguing to me, though. \r\nIt was something new, and I was liking what I was seeing.\r\nThe interface was good, the mechanics all seemed to be there.\r\nThe different families for each nation, and the members of each family and their feelings about each other and their traits and how that all affects the nation was new to me and right up my alley.\r\nI was making choices and doing researches and building tile improvements and really getting a feel for the game.\r\nI had met another nation and some city states and was making peace and diplomacy.\r\nMy step-son was mad initially he wasn't the heir, but I gave him a job and made him an advisor and felt we were getting along and I even forgave him when he go caught being a traitor.\r\nMy heir, my daughter married a prince from a City-state and I had a granddaughter and I was like, this is awesome. I am totally digging this family dynamic mixed into the good old Civ gameplay.\r\nSuddenly, in under 30 total turns, I became ill, then gravely ill, then doomed, and then died within 4 turns.\r\nAll my plans, diplomacy, relations went to hell, but I'm like, ok it's cool people get old and die, that's this game's mechanic to keep you challenged. My daughter will step in and take over control of the empire and I'll hopefully have another 30 turns or longer trying to make some progress before she dies too.\r\nWithin 4 turns, I'm not even kidding, ill, gravely ill, doomed.\r\nI rage quit right there, and it will likely be a long time, if ever, I come back to this game.\r\nWhy did they get sick? NO REASON GIVEN. I had so many farms and so much food, I was killing it.\r\nI would understand if there was like a famine or some game mechanic that would have instigated the illness.\r\nWhy couldn't I do anything to try and improve their health to keep them alive? BECAUSE.\r\nNo medicine, no obligatory rest, no options at all to try and rectify the illness. Just dead.\r\nMy mom died of cancer pretty suddenly a few years back, I don't need my games to mimic that trauma and make me feel helpless and powerless, life does that well enough, thank you.\r\nGames are supposed to be an escape from reality. An opportunity to use your intellect and your choice to affect a favorable outcome in a controlled environment. Hell, I even played Darkest Dungeon and enjoyed it.\r\nI gotta leave a negative review, and I hate to do that, but I play a lot of different games and it's rare that I get as frustrated as that. Maybe this is not normal for this game and I just had a really bad RNG luck, but it was my very first play-through, so go figure how that's even likely. Maybe you can load it and the RNG won't hit again and you won't get sick, but I'm not loading and saving and going through all that wasted time just to get around this game wrecking mechanic.\r\nI'm not down for uncontrolled, unexplained, run ruining chaos in my 4x game. Sorry, not sorry.\r\nGlad I got the game on sale, I'd be pissed if I payed full price for this carbon copy.\r\nAlright, well cool, there are plenty of other awesome games to play. Thanks for listening!",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Not a bad Civ clone. However I find the gameplay tedious due to micro management. At some point one just wanna go on a crusade and worry less about tutoring some 10 year old who is 17th in line for the crown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "In some ways, it's better than Sid Meier's Civilisation, but in some ways, it's inferior.\nThe good: leaders age & die, don't have Caesar for 5000 years. You need to get an heir & a clear line of succession, lest you face succession war.\nThe bad: you can't settle a new city. Just can't. Wanted to build my second city on the coast, near to Gold & Gems, but you can't. Has to be on an urban tile. Found one & moved settler there, but needs to be connected to capital. Built road from capital to there, still won't do it. I give up.\nAlso, didn't get a Settler for ages. \nYou need to research a tech to get game music playing, which I get is nice, but kinda BS, I want something to listen to. \nTribal camps, whilst an interesting mechanic, spawned a stupid amount of units & raiders on me, over & over.\nCombat was a little more interesting at least, but gonna be honest, I'd rather just play CIV V again. \nI know it has mods, but I can't be arsed.\n\nEdit: Ah, okay, thanks, I'll give this another try.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Odd game, everything is in order, has ton of content, QoL and all of it in functional great looking package...\r\n\r\nbut it is simply not fun. What kept me playing was curiosity, not the gameplay. And I ran out of the curiosity.\r\n\r\nThe issue is, the game tries to look on surface like more complex Civilization, but is in fact much less complex and intriguing than any Civ I played (3-6). On surface all looks complex - dynastic relationships, court, generals, activities, decisions... but it is a front for many systems, that do not feel deep or meaningful to interact with.\r\n\r\nSomehow, this game has worse diplomacy than Civ Beyond Earth, somehow it has a dynasty system from CK3 that feels like it does jack shit, and reduces many instances of strategy to choose one of three/four options (as if this was one of those brain dead Survivors clones), making the game just kind of not exciting the play. It drags, not much happens, no choice feels meaningful. You can build cities, guess what, only on city sites, further taking away from one of the most important aspects of Civ, looking for a good city spots, analysing terrain... and more, these are my main takeaways.\r\n\r\nMaybe there is more, but honestly, I have spent 6 hours of my life already and it was not getting any better, so I cut this lose.\r\n\r\nFor devs, you are talented and did great job, the game is just not that fun to play, is all, kinda meh, alright for a slow day... But get a strong design in your hands and you can do bangers.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love CIV pre CIV 5 (CIV 5 was bad and CIV 6 was junk). I hated Crusader Kings. So coming in I looked at the game as a mixed bag. \nThen I started playing it. First problem right off the bad is information overload. There is too much going on and no helpful help system to explain anything. At least with CIV, everything made sense. If you want to produce something, you know what affected producing things. With this game, it's more of magic behind the scenes affects producing.\nThen I tried out battling. I found out really quick that this game's biggest weakness was battling. First, AI units are inherently stronger even if you have more advanced units. They will send in 3 units and make mince meat of anything you have. If you try to attack them, expect to waste actions cause it will take 5-7 of of your units to hopefully kill one of their units. On top of that, the AI produces units faster than roaches multiply. With the AI set up to be somewhat weaker than you are, you will find that by the time you can produce enough settlers to create 3 cites, they will be on their 4th with an army of units already. \nThen there is the annoyance that you can't really do anything cause of orders. You set workers and your one scout to automate and find they just sit there doing nothing all game. Meanwhile the AI system is chugging away and somehow has double your order count. Seems the can reproduce orders as fast as they can units. \nJust this minute, I had an enemy archer completely surrounded by 6 units. It took all 6 to defeat a single archer. Something is messed up when it takes that much work for a single weak unit when they could have easily taken out my strongest unit with just 3 units. I ended up keeping that from happening by opening the editor and blocking their territory with mountains so I didn't have the AI swarming me with super humans anymore.\n\nOverall, it was a good concept of a game but falls way short of being good. Unless you open up the game editor and periodically erase AI units to even the playing field. \n\nI see other people mention things that are a problem and the common reply is that you can just turn off this or that feature. But what's the point of playing a game if you have to turn off all the features to make it playable?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It doesn't feel weighty or impactful. It's very unclear what's happening as 17 things are happening every turn. The tutorial was either 'baby's first 4x' or 'we explain nothing, until after you've done the thing' (eg: nested tool-tips exist, but the game doesn't tell you about it until several turns in... I needed that on turn 1!).\n\nBought it on sale for <CA$6, and still applied for a refund.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Has the same problem all of these games have, AI cheats, can build insane amounts of military units early on making early game frustrating. I already know how this plays out, if I survive the early game I eventually become unstoppable, Its an old and tired game style of these types of games, and one day I hope to find one that is balanced throughout instead of insanely front loaded when it comes to difficulty.\n\nI'm not even going to bother pushing onwards, because if it doesn't work like that, then the entire game will be fighting against overwhelming odds and that I don't find fun either.\n\nHonestly, the anti player bias in these style of games (and total war, one of my favorite series suffers this too) is about half the problem. Bandit/barbarian whatever else will walk past the AI to attack the player.\n\nIf this hadn't been the case, I wouldn't be slogged down in a 2 front war which would have made fighting the enemies I had on my eastern front a lot more fun, even though they were annoyingly over stacked. Instead I had to split my already undersized compared to my enemies forces in half because of a never ending onslaught of random spawn bandit enemies on me western flank, which was otherwise secure with only friendly AI (that they of course ignored and walked past to attack me) in that direction.\n\nI finally alt F4'd and uninstalled when a 3rd front opened by even more random spawn enemies to my south, making the situation completely untenable. \n\nI have no interest in restarting over and over trying to get the right circumstances and force counts to 'win' the early game, Because like civ before it, I already know how this plays out. Same old tired trope of annoying start and way too easy late game.\n\nI don't know why devs think anti player bias is fun, but I wish they would get it through their thick skulls it just isn't. It makes the world feel inorganic, which in this style of game, I think just ruins the experience. \n\nSome day, one developer will figure out that most people hate this, and they will add a slider, so people who do want to be swarmed can crank it up, and people who want a more organic world growth can turn it down or off. Until then, I think this will be my last 'civilization style' game for awhile.\n\nP.S. butthurt fanboys throwing me points isn't going to change the review lol",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can only imagine the pitch meeting for this game going something like this. \"let's take tried and true game mechanics, overcomplicate them, and sell it as a new game\". If you're of the opinion \"less is more\", DON'T BUY THIS GAME. It's trying too hard to be a grand strategy game in a 4X setting and the blend leaves it with an identity crisis.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}