{
  "positive": [
    {
      "review": "https://steamcommunity.com/sharedfiles/filedetails/?id=3196453897\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3188626285\nI’m honestly a bit scared for DMC6(soooon?!) . They don’t need to reinvent anything, just polish what’s already there and add real co-op without mods. That alone would be pure cinema. The DLC Playable Character: Vergil is a must-have and now I’m taking a break on the legendary white plastic chair.\nCheers! ~",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "No nonsense pure styling boss fight experiences i completed it in Devil hunter Difficulty totally worth to play and to enjoy amazing hardcore boss fights. Devil May Cry 5 Cheers !!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "DEATH BATTLE Dante Vs Clive was rigged! Dante has acces to every weapon Dante ever has but he still lost to some final fantasy Twink. If they people did the death battle that actually played the games Dante would smoke Clive in the first 2 minutes.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Out of all the DMC games, I've enjoyed this game's first playthrough the most.\r\nOut of all the playable DMC characters, I've enjoyed this game's Vergil the most.\r\nOut of all the DMC boss fights, I've enjoyed this game's final fights the most.\r\n\r\nHowever, there's a lot to complain about too.\r\n - The main cast characters play very differently and you'll dislike at least one of them.\r\n - Hell Judeccas are the worst DMC enemy ever, and they're in almost every mission on higher difficulties.\r\n - The lock-on system almost always picks the enemy that you want to lock-on the least.\r\n - Dante's battle theme doesn't do him justice.\r\n - Platforming, camera issues, controller disconnects, loading screens, blah blah.\r\n\r\nIf you haven't played any other of the DMC games, you'll be fine. This one's on the easier side for sure.\r\nUnless you're looking for a 100% experience. That boils down to S-ranking all missions on all difficulties with the main cast (can't do it on Vergil, which is a huge shame) - this S rank grind is very tough and extremely demanding at times. But it's not boring; gotta give it that much.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This is a masterpiece I recommend this to anyone who has not played DMC 5 or any of the DMC games this game is just perfection with the amazing feeling of when you land a combo and when you hit multiple enemies and grab someone as Nero. 10/10 gameplay and one of the best games I've ever played in my life and if not THE BEST game I've ever played until Devil May Cry 6 if it even comes out 😭. \nBest game ever made\n10/10 conclusion\n10/10 gameplay\n10/10 fun\n10/10 difficulty if you play hell and hell.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Had a lot of fun playing it. The beginning and the ending were peak kino, but the middle section was just meh, the pacing could be done better imo. All the movesets are flawless and really satisfying to watch. The boss designs, characters, dialogues, music and story are all great except for the level design. The level design was absolute dog water. Overall, I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best DMC game in the series its just so peak Nero could be better but Dante makes up for it 100% worth the money",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Trish and Lady aren't playable in this game. That is the only negative thing I have to say about it.\r\nEverything else is PHENOMENAL. A beautiful return of a newcomer hero and a beloved villain in the same story that ties the family together in a neat little bow. Combine that with ridiculous gameplay that I could never hope to master and you have something that feels almost too good to be true.\r\nBut true it is, and you shall know this devil's power.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ive got nearly 300 hours on my ps4 on DMC5, first time with keyboard and mouse. but still this is a great game, you should definetly play this game but i do suggestplaying DMC3 first. then play DMC1 and DMC2 (just so you understand whats happening) then play DMC4 before finally getting to the 5th. but either way, its still up to you, but in my own opinion. play the games in the order i have provided, i wish you luck on this stylish masterpiece",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Most of my hours are on console, got the game on PC to test out multiplayer mods, but either way I can't recommend this game enough (on controller! This game is designed for controller, a lot of stuff just feels wrong or is uncomfortable on keyboard). The story feels like a mostly natural continuation of the previous game (given that it was ten years after the initial release of DMC 4), while the gameplay is a large step up. If you've played any DMC games, it's likely you've played this one, but if you've been holding out, it's my pick for best game in the series. I understand there's a lot of contention for that title when it comes to DMC, however, it evolves the changes made in DMC 4 for the better, there's more variety in gameplay with there being 3 playable characters in the base game, all who have entirely different playstyles from each other, and it removes the issue of level design that DMC 4 had, with each level being specifically meant for one character, even the ones that you play as multiple have different variations for that character. There are more weapons to use on Dante (including both guns and devil arms there's 8 (going off the 'finished\" version of each weapon without the parts), the gauntlet type weapon that's appeared in every game that's not DMC 2 has changed completely and for the better, I'd always thought the charge mechanic didn't work for the pace of DMC, and the unique charge/level sort of thing Balrog does is way more manageable for the pace of fights, you can swap styles again, with some extra improvements from DMC 4, and you use red orbs to upgrade everything again, meaning they have an actual use for serious play (even if they really just become a number once you have everything). \r\n\r\nNero's changed a lot too, while his gun and sword stay mostly the same, his demon arm gimmick has been almost completely changed, you still have the enemy grappling hook think going on, but there are a ton of new 'Devil Breakers', which each give their own sort of playstyle to Nero, while also being best utilized by swapping fluidly between them with their high damaging finishers in the 'breakage' attacks, though sticking to one in specific arm isn't something that's punished if you want to keep your favorite through a level (though the damage will almost certainly be missed on bosses).\r\n\r\nV is something completely new to the series, he's a sort of summoner, relying on familiars (which happen be bosses from DMC 1) to deal damage for him, and even act as his dodges, while he has to finish enemies off himself, meaning he isn't completely risk free. I've had plenty of fun playing V, however, he's certainly a bit of a snag in the flow of the gameplay, he's not nearly as satisfying as Dante or Nero as it feels like YOU aren't doing the combos, and he deals a bit less damage than the other two, making fights drag on against tougher enemies, especially on higher difficulties, and his bosses aren't particularly enjoyable given just how little control you really have over your damage if you spend a lot of time dodging the way I do, however it's a unique playstyle I'm glad they touched on, even if it's not something I'd want to see return.\r\n\r\nAll in all, I spoke a little too much about the specifics because I'm super passionate about this game. It's my game of 2019, and it's seriously worth a try if you like ANY character action game, be it Metal Gear Rising, Bayonetta, or whatever else.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]PEAK STYLISH[/h1]\n\nThis game was my first Devil May Cry game and it was peak. The gameplay is absolutely really great, and the characters are very interesting except V.. The villains in this game or bosses are really great aswell. Nero and Vergil has to be my favorite characters from this game. Dante was cool but he became a bit old now.. The other characters like Nico, Lady and Trish were great too. The Story was kinda confusing me but I did understand most of it at the end. I really liked this game,\n Overall Rating – ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️☆☆ (8/10)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "[h1] 10 / 10 [/h1]\n★ = Story\n★ = Content\n★ = Gameplay\n★ = Difficulty\n★ = Music\n★ = Sound\n★ = Graphics\n★ = Performance\n★ = Support\n★ = Replayability",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bom! só muito curto fica com um gostinho de quero mais que nesse caso incomoda (modo humano extremamente fácil não escolha!) nunca tinha jogado nenhum dmc mas achei muito bom a historia o humor os personagens jogáveise e principalmente a gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DMC is amazing as a series and this is one of the best entries. While not perfect, definitely worth the money. Enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the game hack and slash ,best in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Melhor jogo que já joguei melhor DmC, fiquei com tanta emoção que bati na minha vó, Recomendo👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trish and Lady aren't playable in this game. That is the only negative thing I have to say about it.\nEverything else is PHENOMENAL. A beautiful return of a newcomer hero and a beloved villain in the same story that ties the family together in a neat little bow. Combine that with ridiculous gameplay that I could never hope to master and you have something that feels almost too good to be true.\nBut true it is, and you shall know this devil's power.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This video game is a masterpiece combining style and combat with the occasional humorous insult to boss fights. The graphics are amazing, the story is well put together. There is a lot of fun to be had with this game, and many demons to be slain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dynamic music along with the insane combos you can pull off makes you awesome. If you haven't tried this game out, you are missing out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely good game with beautiful graphics and superb music, 10/10 will play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was my first pc game and it really was great and would recommend it to anyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, amazing graphics and soundtrack",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a bunch of cool dudes with white hair fight demons with swords and eat pizza. perfect video game.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "The story and attention to detail is phenomenal and exceeded my expectations. The gameplay to even the graphics is just cinematic putting Devil May Cry as a top game. I'm surprised it's not nominated game of the year. Criminally underrated and definitely would give this Capcom title a try if you haven't already !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DMC5 offers the best gameplay the series has yet and entices you to do another run with Vergil in which I highly recommend doing. Idk man its just fun. They made Nero an actually good written character and gave him some incredible abilities that just keep you hooked from start to finish. While the story isn't all that with its general premise (especially how the game ends), the gameplay is just too good to let go. 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game, only complaint is that locking on isnt just a toggle and you have to hold it, but otherwise its great, the combats fun and i like to bully things as vergil :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty solid, not for me personally but it had its moments. I actually wish there were more cutscenes, those were funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PEAK very good gameplay fun good mechanics 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly a great gameplay loop, and the story is amazing too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not only this is one of the best Action games, this is also a love letter to Devil May Cry franchise and its fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics, story and it's a good choice even if you haven't played the previous games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played the series in order (although fairly late), from DMC1 to 5. And what a bang to close the series with, if we are never to see a DMC episode again. Fantastic gameplay, good looks, although it has almost completely lost the Resident Evil-esque aspect to become near fully combat oriented. Cathartic story, great graphics and optimization, the best Dante gameplay of the series (also, I'm in the team that enjoys V). And in the name of Sparda, they went full bananas on the soundtrack. The dynamic combat tracks synching to rank actually fill you with [b]motivation[/b] to get good.\r\n\r\nThe only downside, which is a great one, is no playable Lady & Trish DLC. They were super fun to play in 4 ([spoiler] and with the ending cutscene, you'd think they had planned to release one. Come on, Capcom, you're even selling a DLC to modify their outfits but they're NOT playable? [/spoiler]) I suppose Capcom never wants to release a perfect DMC game... but damn, it went really close with DMC5.\r\n\r\ntldr absolute banger, a must buy even for those new to the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Taking the time to learn the combos makes the game really fun, plus all the music are bangers that I listen to often.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "writing this specifically because someone i knew actually thought this game (that has sold over 10 million units, has overwhelmingly positive reviews, and tons of hours put into it on my end.) was unsuccessful, this is my middle finger to them.\n\nI've lost track of how many times i keep coming back to this game, it's so much fun.\n\nstuff like the story isn't all that mindblowing in my eyes. that said, it's Devil May Cry 5.\n\nyou don't come to DMC for masterclass storytelling. you come here to Kick Demons 365 ways from Sunday. the snarky comments, the soundtrack, the weapons and playstyles that feel varied and fully realized next to some well needed updates to mechanics of the past (Dante's switching & Nero's Exceed for instance), getting higher grades than what teachers gave in school, and just the full on fun to be seen and played in the game.\n\nthe story itself is actually pretty good, it's continuing the story of 4 with Nero, with plenty of callbacks to 1 & 3, both major and minor, and a conclusion that feels pretty satisfying for people who love Dante & Vergil next to giving Nero alot more time to come into his own. lots of the reveals are going to be expected IMO, but expected in a good way.\n\nit even has a recap story in case you're new and have never played a DMC game before or need a refresher.\n\none criticism i do have is the \"multiplayer\". or rather, lack there of. yeah, if you're expecting to play with 1-2 other people in game, you'll be disappointed, it might as well not even be there to begin with. i would like to see a future DMC title if possible go more for Co-op encouragment, but for this it's basically just a single player game. which...honestly is just fine, considering how many games are live service and basically enforce you to play with others constantly nowadays.\n\noverall, DMC 5 is such a great time sink, plenty of fun to be had, Live Action Cutscenes available to grab and use for key moments in every level, and a difficulty curve that feels satisfying the more you learn and get used to playing as characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i had fun play it and it was in my library for like 3y now because my pc didn't run it good but now play did it was worth it to not get a refund loved the music and the game play i recommended buy it   \n（＾◇＾）",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really really fun. Tho my only complaint is that the cut scenes are 3 hours and the gameplay is around 5 to 6 hours depending on how you play. The cut scenes are awesome tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this 20+ hours, still it's not enough. This game is so cool, after I played all the devil may cry games, this feels like heaven, mostly if you play it on pc and not on ps4/ps5. I seriously need devil may cry 6 now, after I played all the games I just keep replaying this one over and over.\nPlay it, trust\n\n\n\n(by the way I got a huge crush on Dante Sparda, playing as him in this game it's just too good to be real, feels like a dream)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game so beautiful even a Devil May Cry. An absolute JACKPOT!. As a lore fan, I have to admit this is one of the best instalments in the franchise. Everything from story to game play to character design is spot on. I especially love the fact that the story goes back and forth with flashbacks which keeps things interesting. The gallery also provides cool side stuff. Whether you're an old fan or a new gamer just looking for things to try out, this is the ONE you CANNOT MISS. I hope they make a 6th one. Till then, LETS ROCK BABY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Devil May Cry 5 were a person, I’d probably marry it. But since it’s a game, I’ll settle for writing poetry about it in the dead of night. This masterpiece not only shreds demons.....it shreds my heart. Why? Two words: Dante and Vergil. Yes, I’m down so astronomically bad that NASA could use me as a case study.\nLet’s start with Dante. The man ages like the finest demon-hunting wine: full-bodied, spicy, and with a hint of chaos. He’s effortlessly cool, dangerously flirty, and handles a sword like he’s telling gravity to sit down and shut up. Every time he flips that coat and fires Ebony & Ivory, I swear I hear wedding bells.\nAnd then there’s Vergil... Vergil. The man who could stare into your soul, break it in half, and you'd still say, “Thank you, Daddy.” Cold? Sure. Stoic? Absolutely. Emotionally repressed? Sign me up. Nothing screams romance like a brooding swordsman who's terrible with feelings but great with Yamato. If he offered me a whisper of a “hm,” I’d write sonnets.\nGameplay? Slick. Story? Heart-wrenching. Devil Trigger? Activated in more ways than one. I laughed, I cried, I simped. And I’m still not okay.\n10/10 would sell my soul for a half-smirk from either of them. Mission accomplished, Capcom. My heart is in the Underworld and I’m not asking for it back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most stylish game ever. Man the combat is just pure bliss and story of the two brothers is just emotional. Both dante and vergil are my favorite characters in this game, and the diversity in the combat is just incredible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i regret not playing this sooner, this masterpiece makes me want to play the other dmc games now.\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great hack and slash game, amazing graphics, fun characters, cool and fun combat, but slightly repetitive when i comes to the missions it kind of feels like the vast majority of them felt the exact same",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No nonsense pure styling boss fight experiences i completed it in Devil hunter Difficulty totally worth to play and to enjoy amazing hardcore boss fights. Devil May Cry 5 Cheers !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool graphics, combined with multiple cool weapons and skill, and using elements like ice, fire, lightning. It has multiple characters too each with different playstyles. And I really love the double kalina ann, shooting rockets and laser beam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of, if not the best character action game ever made, from one of the most fun and iconic franchises. Just play it and enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not really sure where to start here.\r\nDevil May Cry 5 is a must have for any fan of the series as well as new players who enjoy the genre. 9 hours in and I have not beaten it yet, but from what I've played so far, its definitely one of, if not the best, game in the series story, graphics, and gameplay wise.\r\nI will update this review in the future to make it more detailed but i just wanted to put this out there for now yayay.\r\nMy first time opening the game I ended up playing for 7 hours straight, it's addicting. Compared to previous games in the series it definitely features less puzzles but I didn't mind it all that much, it still felt amazing to play. Also, for the record, I've been playing with a ps4 controller and I love it :33",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty solid action game with an awesome soundtrack. Definitely get it on sale, as it often goes for like $15. \n\nMy only complaint is that one of the characters, V, is an absolute nightmare to play as. I like the idea of summoning in monsters to fight for you, but it feels like they're never where you need them to be. Reminds me of TOTK.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good story , great boss's, funny, u dont have to be good at it to finish it, idk about the gamplay im bad at combo's but it looks good and i had fun in it even that i was only hitting 2 buttons (no combo),\r\nif u r bad at combo's dont get it unless there is big discount, I really regret buying it.(I spent too much money) .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I didn't notice how time went, the boss fights were so fun. At the begimning fight felt short and I couldn't ger more than S style. Enimies died so easly, for me at least.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only word I would use to describe this game is \"cool\", so unreasonably fucking cool, everything about it is just perfection in my opinion, the gameplay, the soundtrack, the graphics, did i also mention the gameplay and oh yeah, forgot about the gameplay, the story is cool but everything else overshadows it, i like the gruesome asthetic and the memes, the memes are glorius.\r\n\r\nif i had to rank the characters gameplay it would be:\r\n1) vergil, extremely overpowered, fun, and looks visually stunning\r\n2) nero, incredibly satisfying and fun to pull off, the devil breakers are also overpowered af\r\n3) dante, by far the most complex moveset in the game, but takes a while to get use to\r\n4) v, the most visually impressive moveset but lacks speed and not as satisfying to pull off\r\n\r\noverall, this game is a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've gotten into Devil May Cry Series after I saw the Netflix Adaptation. After playing this game and learning about the entire lore of Devil May Cry, the games put the Adaptation to shame. After knowing about Capcom for a long time (lots of exposure to Megaman Series), since it was a Capcom game, I decided to try it. BEST GAME EVER. As of now I'm still trying to 100% the game, after which I will focus on Vergil's campaign, and try to master him too. The entire experience was beautiful, with the best Soundtracks ever, best action, combos, gameplay as a whole is an unforgettable experience. Some funny bits here and there, which do not fell forced at all (Nero and Nico's dialogues, Dante himself etc). Amazing story as well. There are some things that I did not like (Dante's Soundtrack, V's Campaign, Mission 10 and 8 being annoyingly hard to S rank, even in SOS, Bloody Palace 97) but they barely bring the experience down, as the rest of the game with blast your ears and eyes with MOTIVATION. The game reaches its peak after Mission 14, so Mission 15-20 are my favorite to revisit. *MAYBE* in the future I will try the DMC Collection and DMC4, but I am having so much fun with the 5(?)th entry (\"?\" because DMC Reboot is technically the 5th game, but canonically this is the 5th game) of the series that I don't think I will play the others. If you are looking for a fighting 3d game with combos, look no further, Devil May Cry 5 is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game to death but modding this game can be an utter fucking nightmare lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic. Incredible gameplay and beautiful graphics. It feels great to have such a high quality single player action game in this day and age. It's like a PS2 game, but with modern production quality.\n\nUnfortunately, somebody spoiled the end of this game for me while I was playing so I lost all desire to finish it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vergil is the best character ever made in game industry. Must play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good gameplay is pretty good and best graphics in a devil may cry game.plus you can listen bury the light while battle demons with vergil or jukebox to dante and nero and v. dlc are fine expect for pay to win ones like red orbs and blue orbs honestly play the game to earn them. soundtrack is masterclass like bury the light,subhuman,crimison cloud. devil trigger kinda grown on me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a first foray into the series, Devil May Cry 5 is an absolute triumph and a fantastic surprise. The game's dynamic and spectacularly frenetic action instantly hooks you, perfectly executing its signature blend of hack-and-slash chaos. The core loop of stylish, high-octane combat is immensely satisfying and easy to enjoy, even without prior knowledge of the series' deep mechanics. It's a hugely enjoyable, visually stunning, and endlessly exhilarating ride that fully delivers on its promise of adrenaline-fueled fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. I love this game a lot. It's got the best game soundtrack i've ever heard in my whole life, got the most coolest moves and attacks, got the best and most satisfying gameplay i've ever seen, and surely the best cutscenes and lines i've ever heard too. I love just about everything of this game completely and I don't know I would've progressed in some places of life without it. However, there are still some infuriating things about it, such as Nero's trick dodge requiring timing for it, like WHY?!?!?! Maybe I'm just bad at Nero though. But also, why the fuck does multi-Judgement cuts need to be so hard?!?! Hell, I can't even use judgement cut end against Dante in mission 20 nor most other boss fights, and I promise you that i'am using SDT and exactly pressing the inputs. Wtf is happening??!?! WHY?!?! There's also times where my keyboard will just stop working if i exit the game to go to another window, and then I have to unplug and plug it back in every time, infuriating af. But overall, this game is still great for the most part either way, got a cool story, cool gameplay, and a banger soundtrack surely. \r\n\r\n9.25/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arguably the best Devil May Cry game in the series to date. There are microtransactions for some reason, but those can be easily ignored. If you are a fan of spectacle fighters, grab this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably THE best game I've ever played in my life, Would recommend it to everyone(Even if you have played these types if games) who hasn't tried the \"solo and older\" hack and slash games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so good it makes even a devil cry\r\n\r\n(game is fast paste, easiest game in the frances overall but game feels the balanced overall between all the charaters and doesnt feel like its made for 1 charrator and then another was added after. i give it a 10)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Number 1 hack and slash of all time.\nPeak soundtracks.\nIconic unforgettable characters.\nEasily top 3 fandom out there.\nTakes real skill and patience to master.\nCrazy fun to replay.\nCutscenes that are designed with Smoking Sexy Style .\nA wild arsenal of weapons and abilities.\nPut it all together and yeah… this game is truly one of the greatest of all time.\nPlayed it 6 years ago and still till this day this game holds absolute peak excitement.\nJACKPOT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "despite the flaws, the game is fun and definitely worth a try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so good that even thought i could easily use my brother's steam with all DLC's to play it.. i chose to buy it with all its DLCs simply to show  credit to the dmc team that made my childhood amazing with dmc3 .\nupdate : also i wish CAPCOM actually adds co-op mode to bloody palace .. the game still have alot of potention and closed doors .. people are forced to get mods and do the devs work ..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who grew up playing the original DMC titles back in the PS2 days, this game feels like a love letter from Capcom to the series' fans. It's somewhat of an amalgamation of everything that made 1 and 3 great with a few new twists and new mechanics here and there. It feels extremely satisfying to play and is absolutely gorgeous to look at. I gotta say this game boasts some of the best cutscene direction I've ever seen in any game ever too. The choreography and cinematography are spectacular, and the writing is genuinely laugh out loud funny at times.\n\nIt does feel more straightforward compared to the previous titles, though that's just me being nitpicky because I really enjoyed the puzzles and exploration from the first few titles. You can't really expect that level of exploration from a mainstream AAA game released in 2019 though, so it's more of a modern game design quirk than anything else and again, just a minor nitpick.\n\nThe only real downside is just how short the first playthrough is, especially for a major release that happens to be very pricey in my region. I completed my first playthrough in 10 hours. That's...not what I expected. At all. It feels as though that just when the game and story are starting to get really good, it ends abruptly and you're presented with a credits screen. You are treated to a lot of additional content once you beat the game though, but still...10 hours for a first playthrough is very disappointing.\n\nAll in all, this is a very solid entry in the series. Despite how short the campaign is, I'd recommend it to anyone who either grew up playing these games and newcomers alike. It's a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a Devil May Cry Game\n\nIt is the epiphany of all things teenager...\nThe game-play is fun.\nThe story is stupid but not distracting from the fun game-play.\nThe movie scenes that play before every boss battle will make you squeal from joy on account of their genius choreography and clever humor.\nBosses are repeated but they're so good that it can be forgiven.\n\nThe Beginning is a bit slow but it is for introductions.\nThe middle is incredible (would be given 5 stars if not for the ending)\nI hate the ending -don't finish this game; everything after mission 17 is putrid.\n\nI will explain what I don't like about the game in reverse so it doesn't get spoiled for you.\n\n?!yhw !!!!emag eht sniur ti !elbaveilebnu ????!!!TAHW\n!kcohs larecsiv ni stiderc eht gnihctaw hsinif ot evah uoy dna kcalb og lliw neercs eht ,reh tih snomed eht fo eno fi dna meht ot txen thgir si dneirf/dneirflriG s'oreN taht si ,revewoh ,melborp ehT  .og yeht elihw snomed thgif ot evah uoy dna gnillor trats stiderc eht ,gniht citamenic a neve t'nsi tI  !!!SEID GNIKCUF EHS\nssik neve t'nod yeht dna reve enecs ssik drawkwa tsom eht evah dneirf/dneirflriG s'oreN dna oreN\n...oreN ot eybdoog yas t'nseod etnaD\n.noitcaer deifirret yllarutan a evah t'nseod ehs dna seye s'dneirf/dneirflrig sih fo tnorf ni thgir snomed fo hcnub a dna ssob eutats eht sthgif oreN\n.dehsinifnu ylraelc s'ti dna eutats tnaig a thgif ot evah uoy erehw elttab ssob a si erehT\n.setircopyh dna sreredrum meht sekam fo dnik hcihw emag siht ni ,snamuh lautca ,elpoep llik sretcarahc niam ehT\nლ(ಠ益ಠლ)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is awesome, I had a lot of fun with it. I'm pleasantly surprised, I did not like Dragon's Dogma, but this is a good Capcom game. The graphics are weird, sometimes they are incredible and sometimes they look like a 2008 game. I don't know what's going on there, maybe the color filter? Anyway great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5/5 Stars\n\nEven as somebody that enjoyed DMC4, DMC5 feels like a really great return to form for the franchise. Some of the best combat in the series, with whole bunch of weapon variety between the 3/4 characters. \n\nMusic is a real standout in this one as well, with what I think is the best soundtrack of the franchise.\n\nOverall a great experience, would recommend getting whether it's your first DMC or your fifth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devil Trigger was the first song I heard from this franchise, it introduced me to a whole new series of games that I am forever grateful to have played. Please, go play this game and it's predecessors. 10/10, 10 out of 10, ten out of ten.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is THE action game. the peak of the genre. gameplay wise? peak of the series, probably the best in the genre but that's opinionated. unfortunately the cutscenes aren't as silly as the older games because the line delivery isn't cheesy but they did ad a pre-visualization mode you can get for a couple extra bucks where all the cutscenes are extra silly mode. i got this game on a recommendation from unc and picked up the rest of the series shortly after. play all these games, then play them again, accept that dmc3 will always be the most lovable despite it's annoyances and the bad boss fights, unlock the super costumes, and never go back and play on yellow mode. also, when you watch the anime watch the old one from 2007, it's canon to the games, faithful to the characters, and isn't doo doo from a butt like the netflix one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mastery curve seems endless, the battles and the music are epic, and the game itself looks pretty good. It's a good Devil May Cry game, but you may cry yourself while learning how to get good at it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Devil May Cry 5 is an absolute thrill ride — stylish, fast-paced, and packed with personality. The combat feels incredibly fluid, each character offers a unique playstyle, and the visuals are stunning. It’s a perfect blend of over-the-top action and polished gameplay that makes every battle feel epic.\n\n10/10, now give us Devil May Cry 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want a game that has absolute replay ability, Go for this game. Even though it might seem \"pricy\", Im telling you: it is so so so worth it to get especially if you are a completionist for every game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't be a twat who doesnt even beat the game. play the game beat it cause its phenomenal. if its too hard idk just like get good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was an okay game. I finished it. Thumbs up overall. But here is a list of my opinions, some of them probably unpopular, but whatev:\r\n\r\n- Cutscenes and animations look great, but the whole game's landscape is pretty bland.\r\n- The telephone scenes were so funny, I used them only to see the cutscenes. Kinda sad didn't have more.\r\n- I liked V a lot. And I found his style the best to play. Interactions with his familiars are interesting.\r\n- At the start I found Nero super annoying. Although, he improves a lot and his gameplay as well. The Red Queen feels nice when fully upgraded, Tomboy is fun, Gerbera is mandatory.\r\n- Dante is... Dante. Kinda ignorant about anything but Vergil. His gameplay offers a lot of variety though.\r\n- Vergil is overhyped. I kinda liked him more, as... \r\n- Dante and Vergil are truly brothers. Nero said about them: Idiots. Yup.\r\n- I was honestly sad at a specific scene that involves the familiars. \r\n- So... at the end we are just totally okay with so many people died and we ride into the sunset o.o?\r\n- Playable ending credits are cool. (And the animated menus too, specially after finishing the story)\r\n- DmC DMC (ya know, the game that we don't talk about) has actually has a better weaponry system and usage.\r\n- Nico is the best girl. Obviously.\r\n\r\nSummary:\r\nI'm probably going to play more, because as I said, I liked V's gameplay, but I kind of wish I would have just watched this as a movie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a banger game, its very fun to play, i recommend everyone to play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O que falar de devil may cry 5, é simplesmente umas das melhores experiências de games que eu ja tive, depois de devil may cry 3, os personagens são muito daora a história é legalzinha a gameplay é o ponto forte compre a franquia inteira simplesmente esse jogo é peak of combat 🔥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good graphics and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay 9,8/10\nStory 9,5/10\nWorld Design 9/10\nSound effect / design 9/10\nOverall 9,3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best action game I've ever played, including the recent Ninja Gaiden 4 (which I also really like). The 3 characters (4 with DLC) are all very distinct. Bosses and enemies are varied and fun. Environments aren't the best, but the combat is unmatched.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent entry to DMC franchise. Good story, great characters. playing with Vergil (DLC) is a must, in my opinion. If it's on sale, GRAB IT. Plenty of hours of fun.\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combat. Good variety between the different characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game taught me that W+M1 is not the answer.\r\nits either M1,M1, delay, M1,M1,M1 ( Nero )\r\nlock + W + M1 hold ( Dante )\r\ndo combo by eating the mice and randomly tapping WASD ( V )\r\n\r\nshort ver.\r\n\r\nfind some combo online and let muscle memory take the wheel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I AM THE STORM THAT IS APPROACHING, REVOKING BLACK CLOUDS AND ISOLATION, I AM RECLAIMER OF MY NAAAAAAME!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My controller is now legally classified as “abused”, it vibrated once\r\nand my entire desk developed a six-pack. Also I mashed buttons randomly\r\nand accidentally summoned a hurricane in my living room 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Muy gran juego, la verdad me gustó mucho y lo mas seguro es que lo seguire rejugando debes en cuando",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WE LOST CONTROLLLLLL, ANGELS WITH BELLS DO TOOOOOLLLL,\r\nNO WE CAN'T HIIIDEEEE \r\nTHE FIIIIIREEE IINSIIDEEEEEEEE\r\n\r\nWould recommend to thrill seekers, over the top action enjoyers, beat 'em up enthusiasts and fighting game consumers alike \r\nStill looks and plays great even though it's been a little over 7 years, lot of things to learn if you wanna dig deep in not only the characters gameplay but the enemy behaviours too(which adds a shitton of replayability), cool ass soundtrack, good enough story, good training modes as well \r\n\r\nJust get it dawg, even if you think you suck at these type of games, 5 is the most forgiving in the series (alongside DmC reboot) try learning simple combos, watch some guides, if you put the effort the game will feel 100x more rewarding than if you just went through it by using gold orbs and mashed charged shot & R1 + ↑ + melee\r\n\r\nNow if only the Taunt buttons could be remapped...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "muy buen juego apesar de los años la jugabilidad y la historia siguen siendo excelentes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vergil hiring Vergil's son and Vergil's brother to kill Vergil so Vergil ccan become Vergil again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am reclaimer of my name...\nforsakened, I am awakened...\nbury the light within..\n~ probably Beethoven\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was fun and charming to turn the mind off to in a 1990s action film kind of way.\r\n\r\nLady resembles my Wife.\r\nI liked the part where we saw her ass <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Story is bad, game play is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game to ever grace this earth i would bear this games children but capcom would not let me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DANTE IS BROKE AS SHIT AGAIN, THIS TIME HE WAS HIRED BY CHILD PROTECTIVE SERVICES TO CONFRONT HIS BROTHER ABOUT PAYING CHILD SUPPORT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is só god, i dont have Words tô discribe how happy i stay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game helped me fight the demon Fundus who kept stealing shit from my fridge thank you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10000000/10 best game i play and i really enjoy the whole story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only bad thing about this game is that it's going to take Capcom another 100 years to make a sequel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Привет, анон! \r\nЯ обожаю серию Devil May Cry, и даже ее всратого родственника в виде DMC 2013, но вот пятерка, как бы это сказать...\r\nПятая часть серии просто прекрасна, от и до. Все в ней чудесно, от визуала, звукового сопровождения, и до боевой системы, которая отличается от персонажа к персонажу\r\nА персонажей тут целых 4, и у каждого свой мувсет, свое оружие и почти за каждого из них (да V, за тебя не так интересно играть) очень классно играть. \r\nОтличный левел дизайн, файты, боссы, все прекрасно, однозначно советую анон!\r\nBoost your motivation",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pinnacle of gaming. 10/10. MUST HAVE (I don't even like hack n slash)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak game. but fuck V holy boring ass fucker",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "the game is kinda overrated, very short story and you need to have context from previous games to understand anything. the game is very easy like literally dumb enemy but the only the end boss is difficult.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Devil May Cry, and the visuals for this game look very pretty. It's also amazing how they face scan real people for the character models, so it truly feels like a movie. Soundtrack is amazing, orbs and gold orbs are much easier to obtain this time around, However, this game gets a no from me.\r\n\r\nThe story is very boring and doesn't get interesting 'til the very end. The areas are very linear, and you're just going from one area straight forward to the next without much thought. You also cannot go back if you missed something. The combat can feel very smooth, then at times, it can also feel oddly clunky.\r\n\r\nThe Playable Vergil DLC is whatever, you're just retracing the story mode Nero's steps as Vergil. He has 3 weapons, one of them being the Mirage Edge which just plays identical to Dante's sword, which is pretty lazy.\r\n\r\nI would also like to add that the story just feels like rushed fan service for long time players through references of DMC 1 to 4, and basically a \"sorry we've been gone so long\" since DMC4 released in 2008. Like okay, here's Nero from DMC4, the story continues with him, then 9 chapters later, Dante finally shows up, and you're already fighting Vergil a couple chapters later. If you're a long time fan and curious on how the story continues, it's a must buy. If you're new/curious to the series, you're better off playing older titles from the HD Collection.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has astonishing visuals and a good reputation so I gave it a try, but good god it's a terrible play experience for me and I really just didn't enjoy it, and once enemy health bars got a bit longer I couldn't bare to continue playing.\r\nThere're several issues with this game that makes it unfun for me:\r\n1) janky controls: \r\nThis game's attack tracking is extremely awkward, because locking-on to enemies isn't actually something to help you see and target, but actually a \"mode/stance“ switch used to allow various combat moves to be performed. I don't know why any modern game should do this, instead of actually implementing a stance system.\r\n2) defense feels strange:\r\nThe characters you can play as are all extremely mobile on the offense, capable of dashing across half the screen in one move, but there's not really a lot of good defensive options. There's rolling, technically, but its range is incredible small and its movement is slow, and it can only be triggered in the \"locked on\" stance/mode and requires pressing 3 keys simultaneously to be performed (lock-on, direction, and the jump key) and it's just incredibly annoying that this is how the game wants to handle roll. If you played other action games (fromsoft ones, witcher 3, gow...) the muscle memory just makes it unbearable here.\r\nYou can also jump to evade attacks but it just feels very awkward to me because the amount of horizontal change is limited and thus the game's camera makes it difficult to eyeball how much vertical displacement is needed to jump over an attack rather than be caught in it.\r\n3) spongy enemy:\r\nthe game isn't that hard in terms of \"you will die 50+ times\" but it's a bit grindy and gets boring quickly in the Dynasty Warriors sense because there're a lot of enemies that cannot put up a fight against you and can be stun locked endlessly, but these same enemies require you to keep slashing them for a few dozen strikes before they die, and it's just a waste of time in my personal experience. There's not really any challenge other than trying to look stylish, but how stylish is it when the enemy is just a piece of meat you can juggle endlessly without resistance? \r\nso the game kinda just swings between \"beat-em-up 3d with air combos\" and \"bosses immune to juggles that you have to jump over rather than dodge\" and it's just a very unintuitive way to play, and then the janky controls just push it beyond my range of enjoyment.\r\nI really like the vibe, the stylishness, the music, the characters, the tone... I just don't like this game's game part. If even just one of my main complaints was avoided, such as:\r\n1) a bit more modern and intuitive control, and less attacks that require timings so precise that plenty of guides feature failed takes (\"opps, even I the guide maker can't reliably perform this acion when filming in \r\nthe training room, guess it must be fun to try to perform it while doing a dozen other things in game huh?\"\r\n2) a typical defense system (parry, block, and/or dodge, I prefer dodge but will accept parry and block systems) rather than this weird jumping situation\r\n3) less spongy enemies that you can obviously beat no problem but nevertheless requires you to combo them for half a minute before they die",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a good experience for me. The game just feels to stiff with the move set and the characters are not very interesting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, the game is fun, is beautiful and all that\n\nBUT\n\nit takes 18 seconds to retry after death without reviving.\n\nCTRL+ALT+DEL and restart feels less frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Watching this game is sick, playing this game is just kinda meh. I think for people who really like combo orientated or fighting games will like this game but I hate memorizing combos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat just feels horriable and is impossible to play on pc game itself loots cool just fighting isnt a good expericance when you have to wrangle a camera 90% of the time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dante's combat is good everything else is pure garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Who is Vergil?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DMC 5 has a lot to like, but I cannot call this a good game.\n\nFirst, the positives.\nAmazing music.\nSuperb high-production cutscenes.\nAmazing optimisation, my PC is below the recommended requirements, yet on the maximum graphics it ran super smoothly, not once did it lag or stutter.\nThe combat is great even if awkward. The variety of weapons, skills and moves is stellar. They finally fixed the issue I had with 3rd and 4th game that Dante can only use one style at a time, well now you can use all styles at the same time! And there are many different characters and they all have distinct skills, moves and weapons. And all are fun to play. The only issue though, which is a major issue is that enemes can get away so fast and you move so slow... There are skills where you can dash to the enemy fast if they are close, but other than that I wish that you ran way faster during the combat.\n\nNow, as for the negatives. The game shares a lot of identical skills from DMC 4 and you have to rebuy/relearn them all over again... It's lazy. At least, they could've tried giving some plot-related reason like in Deus Ex Mankind Divided why you have to relearn all those same skills all over again.\n\nThe auto-mode can perform some moves well, but it also blocks you from using half the styles and numerous moves and skills the very least, so avoid using it, unless you're fine to be stuck with just a few moves. I can't understand how come DMC 1 had such a fantastic auto-mode which did wonders, yet all the later games have this mixbag of an auto-mode.\n\nAlso, what the hell is this CO-OP attempt? Yes, attempt. It randomly connects random people to my game or vice-versa, and most of the levels we do not even meet as we're in separate areas, but we may meet in one or two rooms, but only if we played at the same pace and reached that place at the same time... What kind of crap is this? To think of it, it's such a wasted opportunity... They could've made an actual proper CO-OP in this game since you already have numerous different playable characters with different skillsets and it's already possible to play with other players... What a waste!\n\nThe biggest issue I have with this game which is a deal breaker for me is that the majority of the levels are so bland and uninspired. The first few levels are in the city and they are highly varied, then almost all of the rest of the levels are in this single setting of purple void world. They have simple designs and just feature the same environments over and over and over again. This is a massive lack of variety and I simply cannot imagine myself ever replaying this game, especially since I found most of the levels too repetitive and dull the first time already. There is even that one boss rush level where you fight the same bosses again... This is becoming a trend in DMC games and it is mega lazy. Even a good combat is not enough to save it.\n\nOverall, it is an okay game, a lot better than DMC 4, but it had the potential to be way better than what it is.\n\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I think the review section of this game is an echo chamber of people who love it for some reason and this might make you think that this is generally a good game, which I think it isn't.\nI'll start with the positives: the combat is really good. The way you can chain combos and different attack types is amazing. \nNow, to the negatives:\n- the environments are extremely bland. If you go ask chatgpt to generate you a list of example scifi fantasy settings it'd probably cover half the game locations.\n- dialogues are extremely cheesy, uninteresting and cliche.\n- the easy game mode is too easy, the hard is too hard.\n- the upgrade system is nothing phenomenal. Japanese game developers have been pulling the same tricks since 30 years,\n- you play different characters during the course of the game and it is evident that some are better designed than others, ofc this quickly feels uninspiring, since you never really attach to your character,\n- the missions are mostly linear, no new mechanics exist that make them different from the hundreds of action games that you might have already played.\n\nTo put it shortly, this is a MID game at BEST. If this is, according to many, the best DMC game, then I doubt that the DMC series was ever good to begin with.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the game is kinda overrated, very short story and you need to have context from previous games to understand anything. the game is very easy like literally dumb enemy but the only the end boss is difficult.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Devil May Cry, and the visuals for this game look very pretty. It's also amazing how they face scan real people for the character models, so it truly feels like a movie. Soundtrack is amazing, orbs and gold orbs are much easier to obtain this time around, However, this game gets a no from me.\r\n\r\nThe story is very boring and doesn't get interesting 'til the very end. The areas are very linear, and you're just going from one area straight forward to the next without much thought. You also cannot go back if you missed something. The combat can feel very smooth, then at times, it can also feel oddly clunky.\r\n\r\nThe Playable Vergil DLC is whatever, you're just retracing the story mode Nero's steps as Vergil. He has 3 weapons, one of them being the Mirage Edge which just plays identical to Dante's sword, which is pretty lazy.\r\n\r\nI would also like to add that the story just feels like rushed fan service for long time players through references of DMC 1 to 4, and basically a \"sorry we've been gone so long\" since DMC4 released in 2008. Like okay, here's Nero from DMC4, the story continues with him, then 9 chapters later, Dante finally shows up, and you're already fighting Vergil a couple chapters later. If you're a long time fan and curious on how the story continues, it's a must buy. If you're new/curious to the series, you're better off playing older titles from the HD Collection.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has astonishing visuals and a good reputation so I gave it a try, but good god it's a terrible play experience for me and I really just didn't enjoy it, and once enemy health bars got a bit longer I couldn't bare to continue playing.\r\nThere're several issues with this game that makes it unfun for me:\r\n1) janky controls: \r\nThis game's attack tracking is extremely awkward, because locking-on to enemies isn't actually something to help you see and target, but actually a \"mode/stance“ switch used to allow various combat moves to be performed. I don't know why any modern game should do this, instead of actually implementing a stance system.\r\n2) defense feels strange:\r\nThe characters you can play as are all extremely mobile on the offense, capable of dashing across half the screen in one move, but there's not really a lot of good defensive options. There's rolling, technically, but its range is incredible small and its movement is slow, and it can only be triggered in the \"locked on\" stance/mode and requires pressing 3 keys simultaneously to be performed (lock-on, direction, and the jump key) and it's just incredibly annoying that this is how the game wants to handle roll. If you played other action games (fromsoft ones, witcher 3, gow...) the muscle memory just makes it unbearable here.\r\nYou can also jump to evade attacks but it just feels very awkward to me because the amount of horizontal change is limited and thus the game's camera makes it difficult to eyeball how much vertical displacement is needed to jump over an attack rather than be caught in it.\r\n3) spongy enemy:\r\nthe game isn't that hard in terms of \"you will die 50+ times\" but it's a bit grindy and gets boring quickly in the Dynasty Warriors sense because there're a lot of enemies that cannot put up a fight against you and can be stun locked endlessly, but these same enemies require you to keep slashing them for a few dozen strikes before they die, and it's just a waste of time in my personal experience. There's not really any challenge other than trying to look stylish, but how stylish is it when the enemy is just a piece of meat you can juggle endlessly without resistance? \r\nso the game kinda just swings between \"beat-em-up 3d with air combos\" and \"bosses immune to juggles that you have to jump over rather than dodge\" and it's just a very unintuitive way to play, and then the janky controls just push it beyond my range of enjoyment.\r\nI really like the vibe, the stylishness, the music, the characters, the tone... I just don't like this game's game part. If even just one of my main complaints was avoided, such as:\r\n1) a bit more modern and intuitive control, and less attacks that require timings so precise that plenty of guides feature failed takes (\"opps, even I the guide maker can't reliably perform this acion when filming in \r\nthe training room, guess it must be fun to try to perform it while doing a dozen other things in game huh?\"\r\n2) a typical defense system (parry, block, and/or dodge, I prefer dodge but will accept parry and block systems) rather than this weird jumping situation\r\n3) less spongy enemies that you can obviously beat no problem but nevertheless requires you to combo them for half a minute before they die",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a good experience for me. The game just feels to stiff with the move set and the characters are not very interesting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, the game is fun, is beautiful and all that\n\nBUT\n\nit takes 18 seconds to retry after death without reviving.\n\nCTRL+ALT+DEL and restart feels less frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Watching this game is sick, playing this game is just kinda meh. I think for people who really like combo orientated or fighting games will like this game but I hate memorizing combos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat just feels horriable and is impossible to play on pc game itself loots cool just fighting isnt a good expericance when you have to wrangle a camera 90% of the time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dante's combat is good everything else is pure garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Who is Vergil?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DMC 5 has a lot to like, but I cannot call this a good game.\n\nFirst, the positives.\nAmazing music.\nSuperb high-production cutscenes.\nAmazing optimisation, my PC is below the recommended requirements, yet on the maximum graphics it ran super smoothly, not once did it lag or stutter.\nThe combat is great even if awkward. The variety of weapons, skills and moves is stellar. They finally fixed the issue I had with 3rd and 4th game that Dante can only use one style at a time, well now you can use all styles at the same time! And there are many different characters and they all have distinct skills, moves and weapons. And all are fun to play. The only issue though, which is a major issue is that enemes can get away so fast and you move so slow... There are skills where you can dash to the enemy fast if they are close, but other than that I wish that you ran way faster during the combat.\n\nNow, as for the negatives. The game shares a lot of identical skills from DMC 4 and you have to rebuy/relearn them all over again... It's lazy. At least, they could've tried giving some plot-related reason like in Deus Ex Mankind Divided why you have to relearn all those same skills all over again.\n\nThe auto-mode can perform some moves well, but it also blocks you from using half the styles and numerous moves and skills the very least, so avoid using it, unless you're fine to be stuck with just a few moves. I can't understand how come DMC 1 had such a fantastic auto-mode which did wonders, yet all the later games have this mixbag of an auto-mode.\n\nAlso, what the hell is this CO-OP attempt? Yes, attempt. It randomly connects random people to my game or vice-versa, and most of the levels we do not even meet as we're in separate areas, but we may meet in one or two rooms, but only if we played at the same pace and reached that place at the same time... What kind of crap is this? To think of it, it's such a wasted opportunity... They could've made an actual proper CO-OP in this game since you already have numerous different playable characters with different skillsets and it's already possible to play with other players... What a waste!\n\nThe biggest issue I have with this game which is a deal breaker for me is that the majority of the levels are so bland and uninspired. The first few levels are in the city and they are highly varied, then almost all of the rest of the levels are in this single setting of purple void world. They have simple designs and just feature the same environments over and over and over again. This is a massive lack of variety and I simply cannot imagine myself ever replaying this game, especially since I found most of the levels too repetitive and dull the first time already. There is even that one boss rush level where you fight the same bosses again... This is becoming a trend in DMC games and it is mega lazy. Even a good combat is not enough to save it.\n\nOverall, it is an okay game, a lot better than DMC 4, but it had the potential to be way better than what it is.\n\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Devil May Cry, and the visuals for this game look very pretty. It's also amazing how they face scan real people for the character models, so it truly feels like a movie. Soundtrack is amazing, orbs and gold orbs are much easier to obtain this time around, However, this game gets a no from me.\r\n\r\nThe story is very boring and doesn't get interesting 'til the very end. The areas are very linear, and you're just going from one area straight forward to the next without much thought. You also cannot go back if you missed something. The combat can feel very smooth, then at times, it can also feel oddly clunky.\r\n\r\nThe Playable Vergil DLC is whatever, you're just retracing the story mode Nero's steps as Vergil. He has 3 weapons, one of them being the Mirage Edge which just plays identical to Dante's sword, which is pretty lazy.\r\n\r\nI would also like to add that the story just feels like rushed fan service for long time players through references of DMC 1 to 4, and basically a \"sorry we've been gone so long\" since DMC4 released in 2008. Like okay, here's Nero from DMC4, the story continues with him, then 9 chapters later, Dante finally shows up, and you're already fighting Vergil a couple chapters later. If you're a long time fan and curious on how the story continues, it's a must buy. If you're new/curious to the series, you're better off playing older titles from the HD Collection.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is kinda overrated, very short story and you need to have context from previous games to understand anything. the game is very easy like literally dumb enemy but the only the end boss is difficult.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not a good experience for me. The game just feels to stiff with the move set and the characters are not very interesting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has astonishing visuals and a good reputation so I gave it a try, but good god it's a terrible play experience for me and I really just didn't enjoy it, and once enemy health bars got a bit longer I couldn't bare to continue playing.\r\nThere're several issues with this game that makes it unfun for me:\r\n1) janky controls: \r\nThis game's attack tracking is extremely awkward, because locking-on to enemies isn't actually something to help you see and target, but actually a \"mode/stance“ switch used to allow various combat moves to be performed. I don't know why any modern game should do this, instead of actually implementing a stance system.\r\n2) defense feels strange:\r\nThe characters you can play as are all extremely mobile on the offense, capable of dashing across half the screen in one move, but there's not really a lot of good defensive options. There's rolling, technically, but its range is incredible small and its movement is slow, and it can only be triggered in the \"locked on\" stance/mode and requires pressing 3 keys simultaneously to be performed (lock-on, direction, and the jump key) and it's just incredibly annoying that this is how the game wants to handle roll. If you played other action games (fromsoft ones, witcher 3, gow...) the muscle memory just makes it unbearable here.\r\nYou can also jump to evade attacks but it just feels very awkward to me because the amount of horizontal change is limited and thus the game's camera makes it difficult to eyeball how much vertical displacement is needed to jump over an attack rather than be caught in it.\r\n3) spongy enemy:\r\nthe game isn't that hard in terms of \"you will die 50+ times\" but it's a bit grindy and gets boring quickly in the Dynasty Warriors sense because there're a lot of enemies that cannot put up a fight against you and can be stun locked endlessly, but these same enemies require you to keep slashing them for a few dozen strikes before they die, and it's just a waste of time in my personal experience. There's not really any challenge other than trying to look stylish, but how stylish is it when the enemy is just a piece of meat you can juggle endlessly without resistance? \r\nso the game kinda just swings between \"beat-em-up 3d with air combos\" and \"bosses immune to juggles that you have to jump over rather than dodge\" and it's just a very unintuitive way to play, and then the janky controls just push it beyond my range of enjoyment.\r\nI really like the vibe, the stylishness, the music, the characters, the tone... I just don't like this game's game part. If even just one of my main complaints was avoided, such as:\r\n1) a bit more modern and intuitive control, and less attacks that require timings so precise that plenty of guides feature failed takes (\"opps, even I the guide maker can't reliably perform this acion when filming in \r\nthe training room, guess it must be fun to try to perform it while doing a dozen other things in game huh?\"\r\n2) a typical defense system (parry, block, and/or dodge, I prefer dodge but will accept parry and block systems) rather than this weird jumping situation\r\n3) less spongy enemies that you can obviously beat no problem but nevertheless requires you to combo them for half a minute before they die",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had my brightness to brightest but for some reason the screen was still very dark... Don't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Watching this game is sick, playing this game is just kinda meh. I think for people who really like combo orientated or fighting games will like this game but I hate memorizing combos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dante's combat is good everything else is pure garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sciek dla dzieci lubiacych somehow enjoyable combat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who is Vergil?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DMC 5 has a lot to like, but I cannot call this a good game.\n\nFirst, the positives.\nAmazing music.\nSuperb high-production cutscenes.\nAmazing optimisation, my PC is below the recommended requirements, yet on the maximum graphics it ran super smoothly, not once did it lag or stutter.\nThe combat is great even if awkward. The variety of weapons, skills and moves is stellar. They finally fixed the issue I had with 3rd and 4th game that Dante can only use one style at a time, well now you can use all styles at the same time! And there are many different characters and they all have distinct skills, moves and weapons. And all are fun to play. The only issue though, which is a major issue is that enemes can get away so fast and you move so slow... There are skills where you can dash to the enemy fast if they are close, but other than that I wish that you ran way faster during the combat.\n\nNow, as for the negatives. The game shares a lot of identical skills from DMC 4 and you have to rebuy/relearn them all over again... It's lazy. At least, they could've tried giving some plot-related reason like in Deus Ex Mankind Divided why you have to relearn all those same skills all over again.\n\nThe auto-mode can perform some moves well, but it also blocks you from using half the styles and numerous moves and skills the very least, so avoid using it, unless you're fine to be stuck with just a few moves. I can't understand how come DMC 1 had such a fantastic auto-mode which did wonders, yet all the later games have this mixbag of an auto-mode.\n\nAlso, what the hell is this CO-OP attempt? Yes, attempt. It randomly connects random people to my game or vice-versa, and most of the levels we do not even meet as we're in separate areas, but we may meet in one or two rooms, but only if we played at the same pace and reached that place at the same time... What kind of crap is this? To think of it, it's such a wasted opportunity... They could've made an actual proper CO-OP in this game since you already have numerous different playable characters with different skillsets and it's already possible to play with other players... What a waste!\n\nThe biggest issue I have with this game which is a deal breaker for me is that the majority of the levels are so bland and uninspired. The first few levels are in the city and they are highly varied, then almost all of the rest of the levels are in this single setting of purple void world. They have simple designs and just feature the same environments over and over and over again. This is a massive lack of variety and I simply cannot imagine myself ever replaying this game, especially since I found most of the levels too repetitive and dull the first time already. There is even that one boss rush level where you fight the same bosses again... This is becoming a trend in DMC games and it is mega lazy. Even a good combat is not enough to save it.\n\nOverall, it is an okay game, a lot better than DMC 4, but it had the potential to be way better than what it is.\n\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Devil May Cry, and the visuals for this game look very pretty. It's also amazing how they face scan real people for the character models, so it truly feels like a movie. Soundtrack is amazing, orbs and gold orbs are much easier to obtain this time around, However, this game gets a no from me.\r\n\r\nThe story is very boring and doesn't get interesting 'til the very end. The areas are very linear, and you're just going from one area straight forward to the next without much thought. You also cannot go back if you missed something. The combat can feel very smooth, then at times, it can also feel oddly clunky.\r\n\r\nThe Playable Vergil DLC is whatever, you're just retracing the story mode Nero's steps as Vergil. He has 3 weapons, one of them being the Mirage Edge which just plays identical to Dante's sword, which is pretty lazy.\r\n\r\nI would also like to add that the story just feels like rushed fan service for long time players through references of DMC 1 to 4, and basically a \"sorry we've been gone so long\" since DMC4 released in 2008. Like okay, here's Nero from DMC4, the story continues with him, then 9 chapters later, Dante finally shows up, and you're already fighting Vergil a couple chapters later. If you're a long time fan and curious on how the story continues, it's a must buy. If you're new/curious to the series, you're better off playing older titles from the HD Collection.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is kinda overrated, very short story and you need to have context from previous games to understand anything. the game is very easy like literally dumb enemy but the only the end boss is difficult.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not a good experience for me. The game just feels to stiff with the move set and the characters are not very interesting.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has astonishing visuals and a good reputation so I gave it a try, but good god it's a terrible play experience for me and I really just didn't enjoy it, and once enemy health bars got a bit longer I couldn't bare to continue playing.\r\nThere're several issues with this game that makes it unfun for me:\r\n1) janky controls: \r\nThis game's attack tracking is extremely awkward, because locking-on to enemies isn't actually something to help you see and target, but actually a \"mode/stance“ switch used to allow various combat moves to be performed. I don't know why any modern game should do this, instead of actually implementing a stance system.\r\n2) defense feels strange:\r\nThe characters you can play as are all extremely mobile on the offense, capable of dashing across half the screen in one move, but there's not really a lot of good defensive options. There's rolling, technically, but its range is incredible small and its movement is slow, and it can only be triggered in the \"locked on\" stance/mode and requires pressing 3 keys simultaneously to be performed (lock-on, direction, and the jump key) and it's just incredibly annoying that this is how the game wants to handle roll. If you played other action games (fromsoft ones, witcher 3, gow...) the muscle memory just makes it unbearable here.\r\nYou can also jump to evade attacks but it just feels very awkward to me because the amount of horizontal change is limited and thus the game's camera makes it difficult to eyeball how much vertical displacement is needed to jump over an attack rather than be caught in it.\r\n3) spongy enemy:\r\nthe game isn't that hard in terms of \"you will die 50+ times\" but it's a bit grindy and gets boring quickly in the Dynasty Warriors sense because there're a lot of enemies that cannot put up a fight against you and can be stun locked endlessly, but these same enemies require you to keep slashing them for a few dozen strikes before they die, and it's just a waste of time in my personal experience. There's not really any challenge other than trying to look stylish, but how stylish is it when the enemy is just a piece of meat you can juggle endlessly without resistance? \r\nso the game kinda just swings between \"beat-em-up 3d with air combos\" and \"bosses immune to juggles that you have to jump over rather than dodge\" and it's just a very unintuitive way to play, and then the janky controls just push it beyond my range of enjoyment.\r\nI really like the vibe, the stylishness, the music, the characters, the tone... I just don't like this game's game part. If even just one of my main complaints was avoided, such as:\r\n1) a bit more modern and intuitive control, and less attacks that require timings so precise that plenty of guides feature failed takes (\"opps, even I the guide maker can't reliably perform this acion when filming in \r\nthe training room, guess it must be fun to try to perform it while doing a dozen other things in game huh?\"\r\n2) a typical defense system (parry, block, and/or dodge, I prefer dodge but will accept parry and block systems) rather than this weird jumping situation\r\n3) less spongy enemies that you can obviously beat no problem but nevertheless requires you to combo them for half a minute before they die",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had my brightness to brightest but for some reason the screen was still very dark... Don't recommend it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Watching this game is sick, playing this game is just kinda meh. I think for people who really like combo orientated or fighting games will like this game but I hate memorizing combos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dante's combat is good everything else is pure garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "sciek dla dzieci lubiacych somehow enjoyable combat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who is Vergil?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DMC 5 has a lot to like, but I cannot call this a good game.\n\nFirst, the positives.\nAmazing music.\nSuperb high-production cutscenes.\nAmazing optimisation, my PC is below the recommended requirements, yet on the maximum graphics it ran super smoothly, not once did it lag or stutter.\nThe combat is great even if awkward. The variety of weapons, skills and moves is stellar. They finally fixed the issue I had with 3rd and 4th game that Dante can only use one style at a time, well now you can use all styles at the same time! And there are many different characters and they all have distinct skills, moves and weapons. And all are fun to play. The only issue though, which is a major issue is that enemes can get away so fast and you move so slow... There are skills where you can dash to the enemy fast if they are close, but other than that I wish that you ran way faster during the combat.\n\nNow, as for the negatives. The game shares a lot of identical skills from DMC 4 and you have to rebuy/relearn them all over again... It's lazy. At least, they could've tried giving some plot-related reason like in Deus Ex Mankind Divided why you have to relearn all those same skills all over again.\n\nThe auto-mode can perform some moves well, but it also blocks you from using half the styles and numerous moves and skills the very least, so avoid using it, unless you're fine to be stuck with just a few moves. I can't understand how come DMC 1 had such a fantastic auto-mode which did wonders, yet all the later games have this mixbag of an auto-mode.\n\nAlso, what the hell is this CO-OP attempt? Yes, attempt. It randomly connects random people to my game or vice-versa, and most of the levels we do not even meet as we're in separate areas, but we may meet in one or two rooms, but only if we played at the same pace and reached that place at the same time... What kind of crap is this? To think of it, it's such a wasted opportunity... They could've made an actual proper CO-OP in this game since you already have numerous different playable characters with different skillsets and it's already possible to play with other players... What a waste!\n\nThe biggest issue I have with this game which is a deal breaker for me is that the majority of the levels are so bland and uninspired. The first few levels are in the city and they are highly varied, then almost all of the rest of the levels are in this single setting of purple void world. They have simple designs and just feature the same environments over and over and over again. This is a massive lack of variety and I simply cannot imagine myself ever replaying this game, especially since I found most of the levels too repetitive and dull the first time already. There is even that one boss rush level where you fight the same bosses again... This is becoming a trend in DMC games and it is mega lazy. Even a good combat is not enough to save it.\n\nOverall, it is an okay game, a lot better than DMC 4, but it had the potential to be way better than what it is.\n\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Devil May Cry, and the visuals for this game look very pretty. It's also amazing how they face scan real people for the character models, so it truly feels like a movie. Soundtrack is amazing, orbs and gold orbs are much easier to obtain this time around, However, this game gets a no from me.\r\n\r\nThe story is very boring and doesn't get interesting 'til the very end. The areas are very linear, and you're just going from one area straight forward to the next without much thought. You also cannot go back if you missed something. The combat can feel very smooth, then at times, it can also feel oddly clunky.\r\n\r\nThe Playable Vergil DLC is whatever, you're just retracing the story mode Nero's steps as Vergil. He has 3 weapons, one of them being the Mirage Edge which just plays identical to Dante's sword, which is pretty lazy.\r\n\r\nI would also like to add that the story just feels like rushed fan service for long time players through references of DMC 1 to 4, and basically a \"sorry we've been gone so long\" since DMC4 released in 2008. Like okay, here's Nero from DMC4, the story continues with him, then 9 chapters later, Dante finally shows up, and you're already fighting Vergil a couple chapters later. If you're a long time fan and curious on how the story continues, it's a must buy. If you're new/curious to the series, you're better off playing older titles from the HD Collection.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}