{
  "positive": [
    {
      "review": "Faster pace than Master Duel, suitable for someone who is not into PvP that much. Harder to build a deck because the crafting system is depend on the card trader and not every card is craftable like Master Duel. Somehow the rate of UR in packs is worse than Master Duel lmao. Overall, still great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love yugioh because all it cares about is \"rule of cool\". it is very hand holdy until a certain point, and the constant pop ups until you're farther in the tutorial are annoying, but the game play is fun and Seto Kaiba is the coolest",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I never was a Yugioh fan at first but now that I have been playing the game I watched tons of the anime and even started to learn how to play irl still not the best but this game is a very good game for those that like to play TCG card games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An easy version of Yu-Gi-Oh! 20-30 cards in the main deck are quick to finish a duel for fun and strategy. Build your own deck, choose your favourite skills, character, card covers and mat. The system is easy for beginners to learn. Rush has been introduced for more than 1 year, quicker to finish and you can normal, tribute and special summon as many as allowed. There are many active players online. You can always have fun.\nI wish to play with new players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you used to play this card game growing up, you know how fun it is. Just a wholesome card game that brings back childhood memories, for those who know. passed the game on mobile now to do the same on pc. Great game to play with coworkers on your lunch break or smoke break.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ngl i thought this will save me from the other sweat games where everything ends in one turn but sadly this one has the opposite problem, still a fun game though i hope it gets harder later on",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite being a different format than normal Yu-Gi-Oh, this is genuinely one of the best Yu-Gi-Oh games. It has a good banlist unlike Master Duel, and it makes all your favorite old decks from the Duel Monster days actually viable for PVP. Overall, this is a great game. Easily a 4.5 out of 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing Duel Links on and off since February 2017. I played mostly on iOS but recently also took advantage of the steam client. Honestly compared to other TCG games that are almost exclusively pvp oriented, this one has a good frequency of limited time pve events as well as a good amount of non-limited time pve content requiring you to do several tasks to level up each “gate” (basically you have one per different Yu-Gi-OH iteration and they are levelled up separately). Another thing I like in this game that isn’t present in most, is each character having a set of unique abilities which give you additional things you can do in a duel apart from “just the standard duelling actions”. This can vary from adding specific cards to your hand or deck, summoning, different attacks, ect. It adds a nice little “extra something”. \nThe format of Duel Links is different to normal Yu-Gi-Oh, in that you can summon less cards in front of you, you have less time per turn and you have less life points. Overall I think this is good, it makes for more fast paced duels. \nI will say additionaly that as far as Gatcha games go, this is one of the more f2p ones I’ve encounterd. The crystals are given quite frequently for free and I was able to build many decks without spending any money. I’ll put a disclaimer here by saying that when I last logged in to the game after a long period of inactivity, I noticed that they had changed the crystal currency to seperate free crystals amd paid crystals so we will have to see what happens with that but I fear this will inevitably lead to it being less f2p than before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Yu-Gi-Oh! games ever made \nit has all characters and the soundtrack is really great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always enjoyed the spin-off games more than the actual. This is a perfect blend between the actual game and anime. Even though the gotcha can be frustrating at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is slowly but surely turning into Master Duel, but it's much better as of now and the new player experience is ways better. Might be a hot take, since it's not perfect, but I'd call it the best Yu-Gi-Oh game we've got",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not Yu-Gi-Oh for beginners anymore.\n\nThis is not F2P Yu-Gi-Oh anymore.\n\nThis is not \"grind for whatever deck you want\" anymore.\n\nThis is not \"a more balanced metagame than Master Duel\" anymore.\n\nIf this doesn't bother you, Duel Links is a perfectly okay Yu-Gi-Oh! game with a limited field.  Try not to spend too much money.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "~ DIFFICULTY ~\r\n✅ My 90 year old grandma could play it\r\n🔲 Easy\r\n🔲 Normal\r\n🔲 Hard\r\n🔲 Dark Souls\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n✅ Meh\r\n🔲 Graphics dont matter in this game\r\n🔲 Good\r\n🔲 Beautiful\r\n\r\n~ MUSIC ~\r\n🔲 Bad\r\n✅ Not special\r\n🔲 Good\r\n🔲 Eargasm\r\n\r\n~ STORY ~\r\n✅ This game has no story\r\n🔲 Like playing Temple Runners for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n🔲 Epic story\r\n\r\n~ PRICE ~\r\n✅ Free\r\n🔲 Underpriced\r\n🔲 Perfect Price\r\n🔲 Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n✅ Average\r\n🔲 High end\r\n🔲 NASA computer\r\n\r\n~ LENGTH ~\r\n🔲 Very Short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n🔲 Average (15-50 hours)\r\n🔲 Long (50-90 hours)\r\n✅ Extremely long (90-110 hours)\r\n🔲 No ending\r\n\r\n~ FUN ~\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n✅ Repetitive\r\n🔲 Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n~ REPLAYABILITY~\r\n🔲 It's a one-time experience\r\n🔲 Only for achievements\r\n🔲 If you wait a few months/years\r\n✅ Definitely\r\n🔲 Infinitely replayable\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n🔲 Wait for sale\r\n✅ Yes\r\n\r\n----------------\r\n\r\nYu-Gi-Oh! Duel Links delivers a streamlined yet engaging adaptation of the long-running card game series, providing an accessible entry point for newcomers while keeping established fans invested. The mobile format suits its fast-paced structure, with duels designed to be concise without sacrificing tactical depth. Its presentation captures the spirit of the franchise, offering a nostalgic experience for those familiar with the original anime and card game. The overall tone remains energetic and inviting throughout.\r\nGameplay stands out through its simplified Speed Duel mechanics, making strategic battles easier to grasp while still rewarding clever deck building. Regular events, card releases and themed challenges maintain a steady sense of progression. The duel flow is responsive and polished, with well-balanced pacing that keeps matches tense yet accessible. The free-to-play model introduces some grind, but a wealth of earnable cards helps maintain fairness.\r\nVisually, the game remains faithful to the trademark style of the franchise, with bright colours and crisp card artwork that looks excellent on mobile screens. Character models and animations add flair without overwhelming the play area. Special summon sequences and signature monster cut-ins give battles a dynamic feel. The polished interface complements the fast duel structure and remains intuitive throughout.\r\nOverall, Yu-Gi-Oh! Duel Links offers a vibrant and engaging experience that successfully translates the spirit of the card game into a mobile format. Its simplified ruleset, frequent events and polished presentation create an accessible yet satisfying duelling environment. While its storytelling remains fairly light and its progression occasionally grind-heavy, the core gameplay loop remains compelling. Fans of the franchise and strategic card games alike will find plenty to enjoy.\r\nYu-Gi-Oh! Duel Links gets a 6/10.\r\n\r\nFor more reviews check my Steam profile\r\nHope you enjoyed my review, god bless you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is a good game, just lots of time and grinding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are nostalgic about the Yu-Gi-Oh anime and manga but still want to duel with people worldwide. Then this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting back into Yu-Gi-Oh! always feels like a blast to me because I have childhood memories attached to it, so this game was fun. The 100%, however, was not—and neither is the online mode nowadays, with all the Pendulum summons and other BS that make you wait an eternity for your turn. I recommend the game for its gameplay, but not for going for 100%.\n\nGame 7/10\n100% 2/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game .  plenty of content to play solo and competitive to fit my mood, not always in the mood for pvp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty fun online card game with lot's of character to play as with specific skills for certain decks to make them more playable and the game overall more exciting but they usually give them to already op decks. however the game is heavily focused on micro transactions almost trying to force you to spend money on gems, but it's kind of expected in games like this. still a fun game you could easily spend many more hours than you'd think playing.\n\n7/10 Very fun card game, just tries too hard to push microtransactions.\n\nRed-Eyes Black Dragon is peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game i only hope theyre gonna add more cards in it and maybe even change the deck settings and the deck editor otherwise really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun and great game with amazing characters and good event.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game with cool events and story lines :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "con esto confirmo que mi nicotina son los juegos por turnos, sin palabras",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still some gotcha elements but this seems like an improved version of yugioh I recommend this over the other one over MD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun version of a game i enjoyed as a kid also can play on your phone anywhere so you can dual anytime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you play a lot, or spend money, probably quite good. I do like the visuals of this one as well, but as someone who hasn't really been into YuGiOh since I was around 8, so getting back into it is A LOT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Konami, we NEED a Yu-Gi-Oh! Tag Force remake! Or a collection with an improved Tag Force!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect for beginners of the series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yea good for jp voice.i want it for ios too",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's alright. Haven't played it too much yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game and its free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best coin flip simulator ive ever played 10 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "can cost a lot of money to make a deck but it does have rush duels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game better than Arc raiders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool game, i crashed out only 1 times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever created",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goodness gracious I love the alt style kaiba",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never need a shower again with how much I play this on my phone so time to go to a compitin and not shower for a month before hand and I am ready",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after 666 hours I summoned Exodia in real life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play It if you love yu gi oh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yu-Gi-Oh! Duel Links",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "games good now theyre adding dartz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MY MOM SAID IM WEALLY STWONG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "konami kikir",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mirror force Go brrrr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "time to dddduel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EYE'S",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "qdwddwdidiauaisduiasduiasduiasduiasduiasuiSDUASIDUIduyiasduaisduasidasid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People need to stop hating on Duel Links just because it looks like a tutorial version of Master Duel, and they need to remember that this game is a whole different TCG format than Master Duel, this game got has its own world of balancing and banlist. I rather play DuelLinks than sit there and watch my opponent set up their board for 8 mins in Master Duel.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Faster pace than Master Duel, suitable for someone who is not into PvP that much. Harder to build a deck because the crafting system is depend on the card trader and not every card is craftable like Master Duel. Somehow the rate of UR in packs is worse than Master Duel lmao. Overall, still great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love yugioh because all it cares about is \"rule of cool\". it is very hand holdy until a certain point, and the constant pop ups until you're farther in the tutorial are annoying, but the game play is fun and Seto Kaiba is the coolest",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I never was a Yugioh fan at first but now that I have been playing the game I watched tons of the anime and even started to learn how to play irl still not the best but this game is a very good game for those that like to play TCG card games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An easy version of Yu-Gi-Oh! 20-30 cards in the main deck are quick to finish a duel for fun and strategy. Build your own deck, choose your favourite skills, character, card covers and mat. The system is easy for beginners to learn. Rush has been introduced for more than 1 year, quicker to finish and you can normal, tribute and special summon as many as allowed. There are many active players online. You can always have fun.\nI wish to play with new players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you used to play this card game growing up, you know how fun it is. Just a wholesome card game that brings back childhood memories, for those who know. passed the game on mobile now to do the same on pc. Great game to play with coworkers on your lunch break or smoke break.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ngl i thought this will save me from the other sweat games where everything ends in one turn but sadly this one has the opposite problem, still a fun game though i hope it gets harder later on",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best Yu-Gi-Oh! games ever made \nit has all characters and the soundtrack is really great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "~ DIFFICULTY ~\r\n✅ My 90 year old grandma could play it\r\n🔲 Easy\r\n🔲 Normal\r\n🔲 Hard\r\n🔲 Dark Souls\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n✅ Meh\r\n🔲 Graphics dont matter in this game\r\n🔲 Good\r\n🔲 Beautiful\r\n\r\n~ MUSIC ~\r\n🔲 Bad\r\n✅ Not special\r\n🔲 Good\r\n🔲 Eargasm\r\n\r\n~ STORY ~\r\n✅ This game has no story\r\n🔲 Like playing Temple Runners for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n🔲 Epic story\r\n\r\n~ PRICE ~\r\n✅ Free\r\n🔲 Underpriced\r\n🔲 Perfect Price\r\n🔲 Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n✅ Average\r\n🔲 High end\r\n🔲 NASA computer\r\n\r\n~ LENGTH ~\r\n🔲 Very Short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n🔲 Average (15-50 hours)\r\n🔲 Long (50-90 hours)\r\n✅ Extremely long (90-110 hours)\r\n🔲 No ending\r\n\r\n~ FUN ~\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n✅ Repetitive\r\n🔲 Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n~ REPLAYABILITY~\r\n🔲 It's a one-time experience\r\n🔲 Only for achievements\r\n🔲 If you wait a few months/years\r\n✅ Definitely\r\n🔲 Infinitely replayable\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n🔲 Wait for sale\r\n✅ Yes\r\n\r\n----------------\r\n\r\nYu-Gi-Oh! Duel Links delivers a streamlined yet engaging adaptation of the long-running card game series, providing an accessible entry point for newcomers while keeping established fans invested. The mobile format suits its fast-paced structure, with duels designed to be concise without sacrificing tactical depth. Its presentation captures the spirit of the franchise, offering a nostalgic experience for those familiar with the original anime and card game. The overall tone remains energetic and inviting throughout.\r\nGameplay stands out through its simplified Speed Duel mechanics, making strategic battles easier to grasp while still rewarding clever deck building. Regular events, card releases and themed challenges maintain a steady sense of progression. The duel flow is responsive and polished, with well-balanced pacing that keeps matches tense yet accessible. The free-to-play model introduces some grind, but a wealth of earnable cards helps maintain fairness.\r\nVisually, the game remains faithful to the trademark style of the franchise, with bright colours and crisp card artwork that looks excellent on mobile screens. Character models and animations add flair without overwhelming the play area. Special summon sequences and signature monster cut-ins give battles a dynamic feel. The polished interface complements the fast duel structure and remains intuitive throughout.\r\nOverall, Yu-Gi-Oh! Duel Links offers a vibrant and engaging experience that successfully translates the spirit of the card game into a mobile format. Its simplified ruleset, frequent events and polished presentation create an accessible yet satisfying duelling environment. While its storytelling remains fairly light and its progression occasionally grind-heavy, the core gameplay loop remains compelling. Fans of the franchise and strategic card games alike will find plenty to enjoy.\r\nYu-Gi-Oh! Duel Links gets a 6/10.\r\n\r\nFor more reviews check my Steam profile\r\nHope you enjoyed my review, god bless you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always enjoyed the spin-off games more than the actual. This is a perfect blend between the actual game and anime. Even though the gotcha can be frustrating at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game less headache than MD but the crafting system and gacha is horrendous",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a pretty big fan of the game. I know its a gacha game, but I'm still having fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Noticed my playtime was 3,333.3 hours so I'll finally say it's a great free game full of really nice QoL features that I'm still discovering to this day. It's very grindy but has a lot of things to make that grind interesting. It's also a constant brain trainer which cannot be said for most things on Steam.\r\n\r\nI will say I'm not at all a fan of art styles like this in games(asian cartoon type stuff), but I played the card game in my teenage years and loved it so I couldn't resist trying this out and I'm glad I did.\r\n\r\nBasically everything in the game is available for ingame currency at some point, so there isn't really pay2win unless you are using the absolute newest deck(which later becomes free, or rather available for ingame currency/tickets to get 3 copies of every card). There are also nigh endless amounts of easy or free rewards in the game to keep you progressing and building your favourite deck(s).\r\n\r\nI'd recommend this game to anyone(just try it for a while and see what you think). Also try to experiment a bit with the game settings and clicking random buttons on the UI because there are a LOT of hidden little features that make the whole experience so much better. I'm personally a huge fan of the top down view for dueling for example, but there is far more. Auto-dueling(and auto-deckbuilding for events/farmdecks) is nice too to farm for items, which you will do a lot.\r\n\r\nI can say the ranked duels can get pretty serious and stressful at high level play so I try to avoid that as much as possible. There are really people out there that live and breathe this game and just seem to play one deck their whole life and usually just copy decks that others are using. If you make one tiny mistake against these players or draw one wrong card it can often mean defeat.\r\n\r\nIt's clear there have been some great developers/managers at work with the game. It's built solidly and fairly from my experience. I have personally never paid money but have dueled plenty at the highest possible levels. It all depends on how you duel... not your wallet.\r\n\r\nFor what it is, I'd rate it a 8/10. One point taken away because the grind(if you want at least 3 copies of every card) is absolutely insane, and there is no auto-dueling option at the gate(where you farm many cards from 'legendary' duellists). They did relatively recently add it for events but not for all existing duellists. Another point taken off because I simply don't like the art style including some sexualised designs.\r\n\r\nAll in all it's really addictive and remains interesting with new cards and things constantly added to the game keeping things fresh while also updating older deck types to become usable again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very great game and close to the actual series when playing. \r\nI had lots of fun building my deck.\r\nThe only major Downside is in order for them to make money they kept making cards and decks where basically you lose on your very first turn. We (the normal players) have to wait 5 to 10 minute so that the opponent finish his first turn and after all that wait we are losing the game because he kicked all our defence  or whatever and wipe all our life points.\r\nIf you can get past that and play vs normal opponents, the game is actually good and I still play every now and then. And I watch the series every now and then. I grew up with Yu-Gi-Oh series\r\nI do recommend the game it is very good. But as I said , be weary about them opponents that take 10 minutes to end his first turn and you simply lose. My advice is to just forfeit and skip to next opponent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is not Yu-Gi-Oh for beginners anymore.\n\nThis is not F2P Yu-Gi-Oh anymore.\n\nThis is not \"grind for whatever deck you want\" anymore.\n\nThis is not \"a more balanced metagame than Master Duel\" anymore.\n\nIf this doesn't bother you, Duel Links is a perfectly okay Yu-Gi-Oh! game with a limited field.  Try not to spend too much money.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I get to see my favorite GX, 5D's, and VRAINS characters and that's enough to be a good game on its own. It's also fun in the way that most YGO games are and I appreciate the really clear UI during duels.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "eh.... I mean, it's fun... I had to stop because there is no end to this game, like every other gatcha or card game. 7.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun and accessible entry point into the world of card dueling! The simplified ruleset makes it easy to pick up and play, while still offering a surprising amount of strategic depth. Grinding can be a bit much, but overall it's a solid free-to-play experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BUEN JUEGO... Con cicatrices\n\n\nEn si, es un buen juego, perfecto para quienes solo quieren jugar yugioh por nostalgia o porque njnca han tocado algo referente a la saga, jugar contra los bots, haces misiones de fase y armarte tus mazos de la niñez, con un sistema de habilidades (luego detallare más ese problema), sistema pay to fast pero que farmeando y dedicándole unas cuantas horas puedes armarte mazos suber rápidos y encima competitivos qué poco o casi nada tienen que envidiar a mazos nuevos y de próximas actualizaciones siendo ojos azules y magos oscuros los mazos nostalgia meta más usados, el juego tiene buena banda sonora, buenas ilustraciones, mecánicas simples y entendibles, además de tener actualizaciones y eventos constantes, regalando no solo cartas premium de forma gratuita a través de tickets sino también dándote la posibilidad de desbloquear personajes de forma instantánea (de eventos pasados y de evento actual a base de farmeo), desbloquear una carta de la mayoría de cajas de sobres y encima teniendo la posibilidad de poder customizar la carta que quieras con el efecto que o te den de forma gratis por evento o consigas de forma aleatoria con el cambia carta.... Listo juego para la nostalgia y para primerizos y nuevos conocedores o del tcg o del anime como tal.....\n\n\nAhora, el elefante en la habitación, las habilidades, si, las habilidades son parte del meta, habilidades rotas, habilidades anti-brick o directamente habilidades tan absurdamente hechas qué sin abusables y incluso darte la victoria con solo presionar un mísero botón, en si, la mayoría de decks con habilidades rotas son o nerfeados o baneados, pero eso no quita que tuvieron su mes o incluso su año de caos y destrucción en ámbitos competitivos llegando a ser el único mazo jugable y que se verdad da pelea en las partes más altas del sistema competitivo, personajes que tienen habilidades únicas de ellos que si no lo tienes te jodes y te toca ser el saco de boxeo de jugadores de nivel bajo, medio y alto, solo porque o no tienes esa habilidad o no tienes ese personaje específico qué la tiene, puedes ganarles, si, pero si no sabes como funciona su mazo, su habilidad o si quiera que debes meter a tu mazo qué no te briquee y de paso que te sea útil contra ese meta especifico... Nos vemos en el otro lado.\n\nEn resumen, buen juego, buenas mecánicas, horrible balanceo y un hermoso lugar donde todos los duelistaa de todo el mundo pueden reunirse a una red neuronal donde poder librar grandes y emocionantes duelos.... A no ser que nadie te recuerde... Y solo vivas en el vacío, ese vacío digital del cual nunca saldrás.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was super fun playing when it first came out, now its own game and you should go in thinking that this is speed duels, if you dont know what that is. this isnt real yugioh. closer to an anime experience. also building decks is going to get expensive, so just like real life ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The grind is bad, so only play if you want to get a sense of the story of the anime, and play as an anime character. The ranked system requires far too much invesntment to get to a high rank in any kind of reasonable (40+hrs) per season in your chosen format.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is a good game, just lots of time and grinding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are nostalgic about the Yu-Gi-Oh anime and manga but still want to duel with people worldwide. Then this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Getting back into Yu-Gi-Oh! always feels like a blast to me because I have childhood memories attached to it, so this game was fun. The 100%, however, was not—and neither is the online mode nowadays, with all the Pendulum summons and other BS that make you wait an eternity for your turn. I recommend the game for its gameplay, but not for going for 100%.\n\nGame 7/10\n100% 2/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game .  plenty of content to play solo and competitive to fit my mood, not always in the mood for pvp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty fun online card game with lot's of character to play as with specific skills for certain decks to make them more playable and the game overall more exciting but they usually give them to already op decks. however the game is heavily focused on micro transactions almost trying to force you to spend money on gems, but it's kind of expected in games like this. still a fun game you could easily spend many more hours than you'd think playing.\n\n7/10 Very fun card game, just tries too hard to push microtransactions.\n\nRed-Eyes Black Dragon is peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game i only hope theyre gonna add more cards in it and maybe even change the deck settings and the deck editor otherwise really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun and great game with amazing characters and good event.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game with cool events and story lines :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve gotten pretty bored of Yu-Gi-Oh over the past few years, mainly because of how stale and competitive the meta has become. However, Duel Links is a refreshing and well-made take on the game. It’s genuinely fun to play and captures the spirit of Yu-Gi-Oh in a more balanced way.\r\n\r\nMy only real complaint is how long it takes to get good cards. Since cards come from booster packs, luck plays a huge role, and grinding for the ones you want can take a while. Still, aside from that, Duel Links offers a great experience. The meta feels more lenient and balanced compared to Master Duel or even the physical TCG.\r\n\r\nOne of my favorite parts is being able to play as iconic anime characters like Yugi, Kaiba, and Jaden, complete with their original voice lines. There are also plenty of ways to duel: you can battle friends, face off against other players online, or take on AI duelists in the world. Completing stage missions to unlock rewards and earn new cards adds even more to do.\r\n\r\nThere’s a lot more depth to Duel Links, but that’s the core of what makes it great. Overall, it’s a fantastic and accessible way to enjoy Yu-Gi-Oh again. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game at least care about the concept of having fun \nthough I hate that I stopped playing for a long time\nI heard this is the best time to get back so maybe...\n\nby the way I have like 5000 hours on this game. it's just I played on the phone every day from waking up till sleeping\nI ruined my childhood playing this game\n100% worth it \nreal life sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game on and off again almost since it first came out. This is one of the free yugioh games on the market so the entrypoint is easy for newcomers to the series or those that don't have alot of money to spend. Duel links while is a fun game, does feel like a very 'diet' version of the actual game. There are things that are exclusive to duel links such as their own unique cards, sometimes they changed the effects of pre existing cards, and characters can acquire skills to use in duels which do various things. Another main difference is the smaller zones for cards, 3 for spell and trap and 3 for monsters (or 4ish? if you summon something from the extra deck) instead of the usual 5 that alongside the life points being 4000 for each player means the duels last alot shorter then your normal average match would.  While I don't think these are necasarily bad things, especially since duel links is also a mobile game which caters to the faster duels, it is something to be aware of. The whole time you are playing this, it does feel like you're not getting the full true experience. The game has many events that pop up every now and then, and various playable characters from alot of (if not all)  the different animes, even some of the less popular side characters that only showed up for an episode or two. Ultimately this game is very good and offers alot of fanservice but it's not perfect and does have it's  flaws. Personally I wish you could use whatever cards you wanted to against the A.I and have it just  be  restricted during PvP like how Legacy of the Duelist works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Has a steep learning curve for new players (particularly those not familiar with the Yu-Gi-Oh franchise), but learning and persevering will be worth it. Collecting new cards and building new decks somehow still remains captivating even after 4000+ hours of playtime.\r\nWould really love to see additional uses for Gold though. It's just not a useful commodity for veteran players (I myself have accumulated over 21 million gold). Perhaps allowing veteran players to trade Gold for Gems / Dream Tickets could be the answer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yu-Gi-Oh! Duel Links is a fantastic mix of nostalgia and strategy. Playing as Yugi, Kaiba, and other classic characters with their original voices makes duels feel authentic. The controls are easy for beginners, but deck-building and ranked matches keep things challenging for veterans. Dynamic monster animations and constant new card updates make it super addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anyone remember Yugioh Bam? Like, the Facebook Yugioh Bam?\r\n\r\nThat game walked so this one can run. If you like Gacha and Yugioh, this scratches an itch that lasted me a good week or two, but might last you a bit longer if you're really into it.\r\n\r\nEspecially so If you're into GOAT format or really like the anime, as this one lets you assign characters from all the animes to each deck, each with their own voicelines, but also their own special abilities that make older, weaker archetypes viable. Not to mention a lot of the more modern floodgatey stuff isn't in this game.\r\n\r\nSo, If you want to play Yugioh and Master Duel scares you, try this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "con esto confirmo que mi nicotina son los juegos por turnos, sin palabras",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра 'Yu-Gi-Oh! Duel Links' – это отличный способ окунуться в мир дуэлей, известный многим по аниме и карточной игре. Она предлагает динамичные и быстрые матчи, что идеально подходит для игры на мобильных устройствах. В начале легко освоиться, благодаря понятным обучающим заданиям. Собирать колоду интересно, и игра постоянно подкидывает новые карты и персонажей, что поддерживает мотивацию.\n\nОднако, со временем игра может стать немного \"pay-to-win\", особенно при достижении высоких рангов. Свободных ресурсов на топовые колоды становится недостаточно, и приходится или долго фармить, или вкладывать деньги. Тем не менее, даже бесплатные колоды могут быть конкурентоспособными, если грамотно их собрать.\n\nВ целом, Duel Links – захватывающая игра, которая хорошо оптимизирована для мобильных устройств. Она подойдет как новичкам, так и опытным дуэлянтам. Главное, помнить о балансе между желанием быстро получить все и удовольствием от самого процесса построения колоды и оттачивания навыков.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still some gotcha elements but this seems like an improved version of yugioh I recommend this over the other one over MD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just made a new account yesterday. have 88+ hours ingame and have restarted multiple times. Kaiba will always be my fave lol.WHITE LIGHTNINNNNNNNNNG! 10/10 baby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1095 hrs and only spent 10 bucks on booster paks. it probably be wise to have bought a starter deck but u dont know that when you start. anyway point is i got my moneys worth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun version of a game i enjoyed as a kid also can play on your phone anywhere so you can dual anytime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you play a lot, or spend money, probably quite good. I do like the visuals of this one as well, but as someone who hasn't really been into YuGiOh since I was around 8, so getting back into it is A LOT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game's alr, master duel is better tho.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Used to love this game but similar to Master Duel this is a game that makes me hate myself for the  idea of spending time and money on a franchise based solely on sentiment. I could bring up multiple reasons I won't recommend this to others but I'll stick with the most recent. They used to have the ability to buy packs/decks/cosmetics etc for cash and you could see the price directly however they have switched to another currency thereby clouding how much you actually spend. You now have to take the extra step to calculate how much you will spend and even if the prices now are equal to what they would have been otherwise it opens the door for them to later increase the cost so that you don't realize how much you are spending. This is not uncommon in today's games but I personally find this shady and vile for any company to do. To top it off Yugioh is rife with controversy these days at every level. Ocg, Tcg, Master Duel and Duel Links and the majority of it can be traced to corporate greed and shareholder profits being placed so far above the consumer as to be downright insulting. I will likely play this sporadically much like Master Duel without spending money ever again on it until one day I realize my love for the franchise has finally died after having been diminished for years much like my love for games like world of warcraft.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "I remember back when this was the funny anime card game now it's just master duel with 2 less zones and cheat skills.\nalso gotta say I love that auto battle AI will summon a 0 attack point tuner from my hand in attack position then proceed to end turn instead of synchro summoning with it causing me to lose, or when I have lethal on board but the auto duel AI decides that I need to link into Knightmare unicorn and not even activate its effect.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Trash gatcha game with terrible monetization, play master duel instead, game was fun when it was old yugioh formats with some minor buffs to anime decks, now it's an abusive trash skill simulator that will wring you dry just to play the same shit you're playing in master duel but with more limitations,\r\n\r\nPlay any other card g ame.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As someone who has played this game FOR SO LONG... No. It's not a good game. It's sadly the best \"Anime\" Yu-Gi-Oh game (the other is Legacy but both inferior to Tag Force) but Konami made it so PAY-TO-WIN that it doesn't feel worth playing. I had my ups and downs but this year in 2025 was the worse era for this game. It became Skill Links (basically you need a broken skill to compete), pay real money to get what you need and the meta is unfair. This game is very unfriendly to Free-To-Play users.\n\nIf you want to play this \"game\", give it a try... but you'll slowly not enjoy it. Trust me, I will uninstall soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A friend asked me to download this game as he has gotten back into Yu-Gi-Oh, so I did.\nKnowing from my experience with Master Duel with him, the download is in-game, not Steam, so I loaded the game up. Then I went through the tutorial. It had me play as either Yugi or Kaiba as they duel each other. It was very basic and the voice acting was very stiff, to the point where I thought they were using AI.\n\nThen it took me to Duel World and told me I had to duel someone else, but I was allowed to skip it. This whole time, I am thinking, \"Hey, when can I set the game to fullscreen? I'm stuck in windowed mode.\"\nBy the time I got to a menu, it wouldn't let me click on the settings and made me do duels first. \n\nAfter skipping the first duel, it had me go into a mission tab and redeem points that I had to use to buy come cards. Then it started a cutscene that introduced Joey Wheeler into the game. Then it told me I had to redeem more points and do more tutorials before letting me do anything else. All the while, I am still stuck in windowed mode.\n\nThat's when I stopped. I have fond memories of Yu-Gi-Oh as a kid, but That was over 20 years ago. I simply don't care anymore, and I definitely don't care enough to play this PC port of a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they tied to pull a nintendo and sue cygames uma musume for game mechanics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried adding my account to my phone and accidentally linked the phone account to my PC. Explained and answered the questions they asked to recover my account. They replied with couldn't verify the user but you can start a new account. Hope they go bankrupt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actually embarrassing what they have done to this game since 2021",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i just wanted to play cards not get a 10 hour story line",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fucking abysmal dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many micro transactions",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "definitly not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they changed their monetization to a premium stupid currency instead of just letting you buy gems; now you have to pay for crap. Wow, way to destroy the game, you incompetent turds",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I am posting a review of this game today after nearly 600 hours to say that while the game is good, a recent change has made it too predatory and disrespectful to be considers so, for me, any more.\n\nThe developers have recently introduced Crystals (yet another of 14 or so different metacurrencies) whose sole purpose is to hide the real-world value of what is being spent.\n\nPrior to this update; pack prices were very clear and in readable currency (e.g £3.99). Now they are '300 Crystals' and of course you cannot purchase exactly 300 crystals.\n\nThis is called currency obfuscation and is explicitly designed to make the player pay more and have leftovers to tempt them into paying more still.\n\nI do not support or respect it and thus will no longer spend any money on this game. I recommend anyone with an ounce of dignity also boycott any spending in this game.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "this game was such a blast back in days, but a major fall from grace. with greedy monetization, not listening to the community and a lack of of respect for the players yu-gi-oh duel links get worse every day. never change konami<3 (all this can also be said for the TCG and master duel as well)",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "655 hours in and PVP is unplayable. Go first or lose. Now there are about a dozen FTK decks that lock you out of everything and give +4 cards per use of skill. And Konami's response is to ban cards that you spent resources on instead of nerfing their ridiculous, broken skills.\r\nYou CAN still play against the AI, but you'll miss a ton of stuff that you can only get in PVP.\r\nAnd I hear Master Duel is even worse.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Used to love this game but similar to Master Duel this is a game that makes me hate myself for the  idea of spending time and money on a franchise based solely on sentiment. I could bring up multiple reasons I won't recommend this to others but I'll stick with the most recent. They used to have the ability to buy packs/decks/cosmetics etc for cash and you could see the price directly however they have switched to another currency thereby clouding how much you actually spend. You now have to take the extra step to calculate how much you will spend and even if the prices now are equal to what they would have been otherwise it opens the door for them to later increase the cost so that you don't realize how much you are spending. This is not uncommon in today's games but I personally find this shady and vile for any company to do. To top it off Yugioh is rife with controversy these days at every level. Ocg, Tcg, Master Duel and Duel Links and the majority of it can be traced to corporate greed and shareholder profits being placed so far above the consumer as to be downright insulting. I will likely play this sporadically much like Master Duel without spending money ever again on it until one day I realize my love for the franchise has finally died after having been diminished for years much like my love for games like world of warcraft.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "It can be fun if you're a fan of the Yu-Gi-Oh anime, but the monetization is awful. This game desperately needs a way to craft cards.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Despite its initial promise as a streamlined and mobile-friendly adaptation of the classic trading card game, Yu-Gi-Oh! Duel Links has unfortunately devolved into a frustratingly unbalanced and increasingly predatory experience. I cannot in good faith recommend this title to prospective players.\n\nThe game’s progression model is overwhelmingly pay-to-win, with competitive viability largely contingent on either substantial monetary investment or an exhausting grind for in-game gems. Acquiring essential cards requires either spending considerable sums or dedicating countless hours to repetitive farming—a system that disincentivizes casual engagement and alienates newcomers.\n\nRanked play, which should be the pinnacle of competitive enjoyment, is marred by glacial pacing and excessively convoluted deck strategies. Many players spend inordinate amounts of time executing combo-heavy sequences, reducing the opponent to a passive spectator. Furthermore, success is virtually unattainable without aligning oneself with the current meta, as any deviation is swiftly punished.\n\nEvents, once a potential highlight, have descended into monotonous repetition. The lack of innovation or meaningful variety underscores the developers’ reliance on recycled content rather than offering players fresh challenges.\n\nCompounding these issues is the ephemeral nature of investments: decks that require significant time or money to assemble are often rendered obsolete by rapid restrictions or the release of more powerful archetypes. This treadmill ensures that players are perpetually chasing relevance while rarely feeling rewarded.\n\nLastly, the Skill system, once intended to enhance strategic depth, has become an overbearing mechanic that frequently dictates the flow of duels. Skills often act as automatic combo enablers or direct win conditions, eliminating meaningful counterplay and stripping away genuine tactical decision-making.\n\nIn sum, while Yu-Gi-Oh! Duel Links retains a nostalgic veneer and remains accessible on a surface level, its underlying design fosters frustration, monotony, and a near-compulsory reliance on financial investment. The game exemplifies the pitfalls of a free-to-play ecosystem that prioritizes monetization over long-term player satisfaction.\n\nYu-Gi-Oh! Duel Links is best avoided by those seeking a fair, engaging, or enduring card game experience.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Played on ios a few years ago and thought I'd bring my old account here to get some fun an easy steam achievements, now my old account doesn't exist, and my friends account was also apparently nuked. I put tens of hours into this game during the pandemic and now its all gone.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I remember back when this was the funny anime card game now it's just master duel with 2 less zones and cheat skills.\nalso gotta say I love that auto battle AI will summon a 0 attack point tuner from my hand in attack position then proceed to end turn instead of synchro summoning with it causing me to lose, or when I have lethal on board but the auto duel AI decides that I need to link into Knightmare unicorn and not even activate its effect.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this game for a long time on IOS. All of Duel Links is just premium packs and recycled events, and those events are worth nothing but a little of the premium currency. The cards they give in the events are useless. I recommend investing your time into Master Duel rather than this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too many broken skills that ruin the game.\r\n\r\nThere's no more fun in Duel Links just suffering and addiction.\r\n\r\nSend help.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Downloaded the game, which was actually a launcher.\n\nAdditional download of 4gb... okay...\n\nDownload additional data and start game thinking I can duel with other players.\n\nMandatory tutorial after mandatory tutorial and then a forced shop screen with micro-transactions.\n\nAnother tutorial... Okay... Finish tutorial thinking I can finally duel other players.\n\nAdditional data needs to be downloaded before playing ->. Nope. Goodbye.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad monetization, horrible skill design, combined with the mountain of mechanics that is current yugioh make this a hard recommendation. I wish i could just collect and play speed duels in peave",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trash gatcha game with terrible monetization, play master duel instead, game was fun when it was old yugioh formats with some minor buffs to anime decks, now it's an abusive trash skill simulator that will wring you dry just to play the same shit you're playing in master duel but with more limitations,\r\n\r\nPlay any other card g ame.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Really late to review this old game that was pretty much succeeded by Master Duel which is also in a pitiful state. This game... isn't good it use to be and it was great for those who truly grew up with the anime as it allows you to play with those character and use some of their iconic decks or at least that was the idea.\r\n\r\nThis game has plenty of issues. Cheating, pitiful balance and predatory tactics. I can't in good faith recommend this game to anyone it's genuinely horrible. See this game also has \"skills\" and these skills use to be a hot button topic back in the day but now? There is no denying what Konami has done to skills. They're utterly broken and cheat skills they are just straight cheating. \r\n\r\nYou could be on the verge of victory but thanks to a cheat skill they get a free monster 3 free cards to draw and you lose but that's the issue a lot of these decks that do this aren't even the strongest in the game this game has a very clear meta and it wants you to constantly chase building these meta decks and farm broken skills that result in a pretty unfun and tired loop. \r\n\r\nDuels are decided turn 1 and no you can't choose your side it's a coin flip you go first you better set up a board if you don't surrender the enemy does have an FTK if not an OTK most decks do this if not all especially now in the meta and it's also extremely negate heavy so going second is also suicide and honestly? This game is just too power crept to hell. Go buy legacy of a duelist or go play something else there is nothing for you here but a money sink hoping to take advantage of your nostalgia.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have love and hate relationship with this game. for start, I love the concept, and it's addicting, I have been play this game on - off since 2016, this is my second account on this game because I forgot my first account. but the currency and the grind are very hard for free to play  users, so if you want to be competitive, you have to spend money. but for casual FTP players like me who likes nostalgia and simple way to play yugioh, this is good.\n\nI will recommended this game only for the nostalgia sake, for new player or people that doesn't grow up with this, don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game play was fun during it's peak, imo, 2017-2019. however, free 2 play is nearly impossible since you can't craft cards from box sets and can't dust cards you aren't using to craft cards you want. they'll to give \"ur tickets\" to create 1 ur from a non-current box set. unless they change that, i can't see this game growing anymore. also, since the release of master duel the game lost their biggest streamer. i miss the peak of this game sometimes and hope they do something to make it good again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs formats (such as only DM duels and etc.) and drafting. Rush Duels against other players is great but Speed Duels is just murder right now for some of the more casual players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Duel Links is such an interesting and unique spin on the base YGO game. At its core the game is a lighter version of TCG, with more consistent and quicker games. Meta is also very interesting to say, quite unique decks that seem fun to play. Addition of skills is really a double edged sword, on one hand they do make some archetypes actually work, they also make your deck extremely consistent (especially nowdays) which results in games often feeling monotonous. \n\nWhere the problem lies is that the game is extremely expensive and grindy. Skills are often locked behind a grindy time limited event. Cards are obtained through literal gacha, with no option to craft them, and inherently because of how YGO works, no replacements. Sometimes packs cannot even be opened for in game currency but need to be purchased with money and cards inside are not obtainable any other way (the true p2w). \n\nRelease of Master Duel also killed a huge chunk of the player base, although the whales still keep the lights on. It is quite sad to think of what the game could have been. So yeah, game play good, but monetization kills it\n\n3/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "linked my Steam account to the wrong Konami ID, and now I cannot access my original Duel Links account. i contact the support many times and always get the same email it's impossible the only way to access my account is android",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this use to be grate but now all the problem with old yugioh are here trun to long unfare efficts the game just sucks now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A friend asked me to download this game as he has gotten back into Yu-Gi-Oh, so I did.\nKnowing from my experience with Master Duel with him, the download is in-game, not Steam, so I loaded the game up. Then I went through the tutorial. It had me play as either Yugi or Kaiba as they duel each other. It was very basic and the voice acting was very stiff, to the point where I thought they were using AI.\n\nThen it took me to Duel World and told me I had to duel someone else, but I was allowed to skip it. This whole time, I am thinking, \"Hey, when can I set the game to fullscreen? I'm stuck in windowed mode.\"\nBy the time I got to a menu, it wouldn't let me click on the settings and made me do duels first. \n\nAfter skipping the first duel, it had me go into a mission tab and redeem points that I had to use to buy come cards. Then it started a cutscene that introduced Joey Wheeler into the game. Then it told me I had to redeem more points and do more tutorials before letting me do anything else. All the while, I am still stuck in windowed mode.\n\nThat's when I stopped. I have fond memories of Yu-Gi-Oh as a kid, but That was over 20 years ago. I simply don't care anymore, and I definitely don't care enough to play this PC port of a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ONLINE IS DOGSHIT + GETTING GEMS \n\n\nNEW PLAYERS!! dont touch this shi , u need to be paying money lol, game events used to give alot and boxes used to give at least one ultra rare each 10 pulls but now KONAMI MISS GREEDY wants ur bank cards, and dont touch master duel too, bcs master duel wants ur master card too LMAOOOOO , i played the game for years and i made many decks as an F2P, vreins zexal and arc-v, yeah the game is fun if u like to watch cutscenes of summoning and transformations , there are alot of unique things but TF U MEAN U WANNA PLAY PVP ???? the game only filled of mentally instable people wants just to win and summon their intire deck from  the first phase soooooooooooo\n\n\nw less words:\n-players are shit\n-bulding a new deck is hard for new players\n-U NEED MONEY!!\n-and yeah players are shit again\n\n\n\nI GUESS it will be better just if they made duel links for buying and then be easy on players while playing cuz im not letting this game suck any dollar of my bank acc\n\n\nI F FORGOT TO SAY FUCK THE ARCHTYPE DECKS FR SOOOOO NERFED EVEN MORE THAN THE MAIN CHARACTERS CARDS AND WHAT THE FUCK U MEAN I HAVE TO OPEN 160 PACK TO GET THE NEGATE MOSTER AND ANOTHER 160 TO GET ONE FORBIDDENT DROPLET!!!!! AND REOPEN THEM AGAIN!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Took me way too long to figure out I was hooked on a tiny freemium dopamine booster stuffed with gambling and microtransactions. Regret level: max.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much of a whale game where the chance of getting the cards you want is super slime",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yu gi oh Duel Links suffers from the same problems Yu GI Oh has in general:\n\nMost games can be won within 1-4 turns with cookie cutter builds. When they introduced the latest cards, it was no longer really about strategy. Just learning the combos and what other cookie cutters came out to counter yours. But this isn't restricted to Yu Gi Oh Only, games like Pokemon TCG Pocket have this same problem. Duel Links just had a time where it didn't have this problem.\n\nWe know the reasoning behind this is because better cards mean more sales though, thats sort of a given with most tcg.\n\nThe problem with Yu Gi Oh Duel Links though, is the predatory nature of gacha to obtain the latest cards to make the latest decks. Sure you can run with a Maldoche Deck and get away with some games, but if you are looking to make a Live Twin Deck, it'll take a lot of grinding to get the currency to spam the packs.\n\nBecause there is no restrictions on modes or pvp, you can basically go ham.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played since 2018.. in 2020 they did a major update that FORCED synced accounts. Since then i've tried everything to get my account returned but, they'll just ask you for more and more obscur information about your account until you finally don't have an answer, then they'll claim they can't help. Bro, I sent you over 15 receipts from my Gmail from 2018 - 2022, account start date, last character used, etc. Konami is no help.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please fix the connection. I can run other apps or games smoothly, but this game is often get error connection",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Underworld godness of closed world บ้านบิดามารดามันนะ +4 Effect Monster 1 ตัวของฟั่งตรงข้าม เช็ดกระจกรถจระเข้",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its not hard to do a good yu gi oh game. U somehow managed to make it bad. eventhough i told the game i already played much yu gi oh i have to go through a unneccassary tutorial FOR AGES!!!! STOP THAT PLEASE!!! Its sooooo annoying... not 1.. not 2... and not 3,4,5,6,7 or 8 tutorial steps. no it are way more and you just waste my time! stop all the explainations and shit if i KNOW HOW TO PLAY!!! Stop stalling me or other players. ask yourself why people download this game. we want to create our dreamdecks and just play yu gi oh. NOBODY wants to be torrchered by your annoying tutorials for 2 years!\nFIX THIS SHIT!!!!\n\nand then its the easiest fckn duells.. wow.. you really invested to waste my time and annoy me, GOOD JOB!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything designed around this game was made to waste your time and money, like any other gacha. Everything you do feels like a chore and revolves around grinding for whatever you need, whether it's a character you want, a skill for said character, or cards and staples necessary to improve your deck. Touching more on the process behind obtaining certain cards you'll need when making a deck, you'll have a few options for when you try and get them. Firstly, if the card is a level up reward from a certain character, you'll be forced to grind using that specific character in order to gain enough exp and levels for said card. The cpus you'll find around the world are extremely repetitive and limited. It's possible to spend hours up to days and in some cases even weeks trying to get whatever you need for your deck, grinding endlessly against the same cardboard cutout c*ck heads who wear the most basic and uninspiring outfits known to man, looking like the type of people you'd see on those job hiring posters around public areas talking about some \"Join today! We're looking for people like you, who have the skills to dig in your ass and pick the pubes out of your crack\". Many of the important cards and staples used for basic combos in decks are stashed away in mini boxes that you'll have to spend in-game currency on just for a chance at getting whatever you're looking for. Not to mention those mini boxes are bloated with other cards of the same rarity that are useless or completely unrelated that you'll probably never end up using, added in just to make the pulling rates for those cards lower. If you end up running out of currency from trying to pull on the mini box with the cards you want, either you'll have to grind against the previously stated cpus for a portion of that currency so small it would make even a poor and starving victorian child ungrateful, or give into what the developers WANT you to do and spend real life money yay!!! All so that you can PLAY THE GAME LESS. Another atrocious example of the game's design are character skills. Character skills are basically abilities you can use during the duel by fulfilling certain requirements within that duel or activate immediately upon starting. Some of these skills can straight up give you cards for free, cards that you didn't even have in your deck, opening up a whole new world of bullsh*t waiting to happen. Skills are such a huge monopoly in the game that in many cases that you might not be building decks that can play on their own without having to use them, you'll be building decks AROUND the skills in the game. When dueling online it doesn't feel like you're using any real strategy to outwit your opponent, using your deck's capabilities to their fullest in order to lock down on that win, it feels like who can activate their skills first in order to gain an unfair advantage and set up their endgame boards on turn one. \n\nSome of the few positives I do hold for this game are in its concepts and vibe. This game is a very simplistic and much more laid back version of Yugioh's main tcg counterpart. You'll usually be playing a 20 card deck, half of what the minimum is for regular Yugioh and there are only three monster and spell/trap zones available versus the usual six. Games go by so much quicker than how long they'd usually take in real life and offers newer players trying to get into the franchise a a warmer welcome to the game and its mechanics. The rest of my praise goes to being able to play as the characters from the Anime. There are so many god d*mn characters that you can play as in the game, all with their own voicelines and card animations. No matter how basic the voicelines may be after hearing them so many times, I still find them adding that little charm that makes the game worth playing sometimes. In the modern day and age of Yugioh games, not many, if any at all, offer you to play the actual characters from the series. Mostly having a main focus on the tcg aspects rather than fan service, making Duel Links one of the few games that does which I find that it makes the game stand out more and gives the players something that would be hard to find anywhere else.\n\nOverall, I think this game is a sh*tty titty piece of ass that wants to eat your money and offers a boring experience in return, involving endless grinding just to build and complete a deck to eventually use in online play where your opponent might win just because they picked a character with a better skill than you that makes your efforts completely useless. Although the game still offers you an experience that you can't find in many other places, being able to play as your favorite characters from the Manga and Anime in a nice and much more simplistic style of the physical card game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't care if mirror force doesn't \"target\" obelisk directly.\nIf obelisk description says cannot be targeted by spells/effects etc.\n\nif I go trough 50 games and get to summon obelisk once.. it should OBLITERATE.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately another pay to win game. As a new player in 2025 and a returning play from early 2000s. I can say the meta decks are clearly priced to make you feel like you have to spend money and there are a plenty of resources online describing the F2P grind. And it is grindy. For example those who like to know more, If you want to buy a pack of cards for a deck with your rewards. Great idea. lots of staples to be had early on. Unless they are on say 5 to 10 packs depending what box may sent you back 1000 crystals ok no big deal. As you progress you will realize just how few crystals they give you for any sort of reward. 10 to 50 being the majority. No revist your previous purchase early on. Is it worth playing if you like the game Yes surely you will build a fun deck or comp one and have some good fun. Is it designed to make you think you have to spend money. YES. Dont do it. Use AI to build a good deck with your early rewards I ended up with a utopia deck. Dont blindly spend a penny until they learn a lesson like all others. Great game well designed good graphics but too much predatory nonsense.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they tied to pull a nintendo and sue cygames uma musume for game mechanics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just wanted to play some old-school Yu-Gi-Oh online, but Duel Links has become a complete mess. The title screen alone bombards you with menus, pop-ups, and way too many currencies. I swear there are at least five different ones, and I still don’t even know what half of them do. Everything feels overcomplicated for no reason.\n\nThen you get into a duel and it’s even worse. Every single card has three or more effects, chains go on forever, and it’s impossible to keep track of what’s happening. I stopped playing in real life around the XyZ era, and coming back now just feels like stepping into chaos.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Paid currency? After all these years? Greedy greedy devs. The new system is designed to squeeze even more cash out of the now diminshing fan base. What an own goal.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Step one  - Build a really \"Good Deck\" and make your move against your opponent\n\nStep two - Waiting for your opponent to Synchro, Xyx, Pendulum, Special, Normal, Tribute, Activate, Negate, Set... forgot the rest because I was making a coffee\n\nStep three - Lose without knowing until you analyse and realise \"I don't have time for that\"\n\nI got to the end of platinum rank back when it came out with multiple F2P half baked decks but now I can't break much past novice with these new cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They added a garbage paid currency instead of just showing prices properly in the shop.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not like the real Card Game, more a minimalistic Version of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked it while the pay to win elements were a lot less prevalent. I dropped it after they nerfed my f2p deck into obscurity and then made the expansion that would make it competitive again PAID ONLY. I'm also sad that game got power crept so fast.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The level of grind this game is putting me through to scrape together gems genuinely makes me uncomfortable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is cash grab they release broke deck to cashgrab then nerf it to unplayable shit and loop just go on... unlike master duel this doesnt have craft system",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only slightly less expensive than gunpla or warhammer, and just as unbalanced.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tried adding my account to my phone and accidentally linked the phone account to my PC. Explained and answered the questions they asked to recover my account. They replied with couldn't verify the user but you can start a new account. Hope they go bankrupt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "KONAMI ID sucks... Improve this simple design thing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actually embarrassing what they have done to this game since 2021",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fa**ot ass devs keep ruining the game, trash pay to win garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty much Master Duels 2 at this point. Man ... what has the franchise turned into",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Thanks komoney you helped break me of this filthy habit with the switch to the gem nonsence",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A paid currency was added recently making it P2W.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i just wanted to play cards not get a 10 hour story line",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "used to be ok, it's pay to win now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fucking abysmal dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many micro transactions",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "definitly not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "paid to win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "they changed their monetization to a premium stupid currency instead of just letting you buy gems; now you have to pay for crap. Wow, way to destroy the game, you incompetent turds",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "I am posting a review of this game today after nearly 600 hours to say that while the game is good, a recent change has made it too predatory and disrespectful to be considers so, for me, any more.\n\nThe developers have recently introduced Crystals (yet another of 14 or so different metacurrencies) whose sole purpose is to hide the real-world value of what is being spent.\n\nPrior to this update; pack prices were very clear and in readable currency (e.g £3.99). Now they are '300 Crystals' and of course you cannot purchase exactly 300 crystals.\n\nThis is called currency obfuscation and is explicitly designed to make the player pay more and have leftovers to tempt them into paying more still.\n\nI do not support or respect it and thus will no longer spend any money on this game. I recommend anyone with an ounce of dignity also boycott any spending in this game.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "this game was such a blast back in days, but a major fall from grace. with greedy monetization, not listening to the community and a lack of of respect for the players yu-gi-oh duel links get worse every day. never change konami<3 (all this can also be said for the TCG and master duel as well)",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "655 hours in and PVP is unplayable. Go first or lose. Now there are about a dozen FTK decks that lock you out of everything and give +4 cards per use of skill. And Konami's response is to ban cards that you spent resources on instead of nerfing their ridiculous, broken skills.\r\nYou CAN still play against the AI, but you'll miss a ton of stuff that you can only get in PVP.\r\nAnd I hear Master Duel is even worse.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Used to love this game but similar to Master Duel this is a game that makes me hate myself for the  idea of spending time and money on a franchise based solely on sentiment. I could bring up multiple reasons I won't recommend this to others but I'll stick with the most recent. They used to have the ability to buy packs/decks/cosmetics etc for cash and you could see the price directly however they have switched to another currency thereby clouding how much you actually spend. You now have to take the extra step to calculate how much you will spend and even if the prices now are equal to what they would have been otherwise it opens the door for them to later increase the cost so that you don't realize how much you are spending. This is not uncommon in today's games but I personally find this shady and vile for any company to do. To top it off Yugioh is rife with controversy these days at every level. Ocg, Tcg, Master Duel and Duel Links and the majority of it can be traced to corporate greed and shareholder profits being placed so far above the consumer as to be downright insulting. I will likely play this sporadically much like Master Duel without spending money ever again on it until one day I realize my love for the franchise has finally died after having been diminished for years much like my love for games like world of warcraft.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I remember back when this was the funny anime card game now it's just master duel with 2 less zones and cheat skills.\nalso gotta say I love that auto battle AI will summon a 0 attack point tuner from my hand in attack position then proceed to end turn instead of synchro summoning with it causing me to lose, or when I have lethal on board but the auto duel AI decides that I need to link into Knightmare unicorn and not even activate its effect.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Despite its initial promise as a streamlined and mobile-friendly adaptation of the classic trading card game, Yu-Gi-Oh! Duel Links has unfortunately devolved into a frustratingly unbalanced and increasingly predatory experience. I cannot in good faith recommend this title to prospective players.\n\nThe game’s progression model is overwhelmingly pay-to-win, with competitive viability largely contingent on either substantial monetary investment or an exhausting grind for in-game gems. Acquiring essential cards requires either spending considerable sums or dedicating countless hours to repetitive farming—a system that disincentivizes casual engagement and alienates newcomers.\n\nRanked play, which should be the pinnacle of competitive enjoyment, is marred by glacial pacing and excessively convoluted deck strategies. Many players spend inordinate amounts of time executing combo-heavy sequences, reducing the opponent to a passive spectator. Furthermore, success is virtually unattainable without aligning oneself with the current meta, as any deviation is swiftly punished.\n\nEvents, once a potential highlight, have descended into monotonous repetition. The lack of innovation or meaningful variety underscores the developers’ reliance on recycled content rather than offering players fresh challenges.\n\nCompounding these issues is the ephemeral nature of investments: decks that require significant time or money to assemble are often rendered obsolete by rapid restrictions or the release of more powerful archetypes. This treadmill ensures that players are perpetually chasing relevance while rarely feeling rewarded.\n\nLastly, the Skill system, once intended to enhance strategic depth, has become an overbearing mechanic that frequently dictates the flow of duels. Skills often act as automatic combo enablers or direct win conditions, eliminating meaningful counterplay and stripping away genuine tactical decision-making.\n\nIn sum, while Yu-Gi-Oh! Duel Links retains a nostalgic veneer and remains accessible on a surface level, its underlying design fosters frustration, monotony, and a near-compulsory reliance on financial investment. The game exemplifies the pitfalls of a free-to-play ecosystem that prioritizes monetization over long-term player satisfaction.\n\nYu-Gi-Oh! Duel Links is best avoided by those seeking a fair, engaging, or enduring card game experience.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Played on ios a few years ago and thought I'd bring my old account here to get some fun an easy steam achievements, now my old account doesn't exist, and my friends account was also apparently nuked. I put tens of hours into this game during the pandemic and now its all gone.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I played this game for a long time on IOS. All of Duel Links is just premium packs and recycled events, and those events are worth nothing but a little of the premium currency. The cards they give in the events are useless. I recommend investing your time into Master Duel rather than this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too many broken skills that ruin the game.\r\n\r\nThere's no more fun in Duel Links just suffering and addiction.\r\n\r\nSend help.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Downloaded the game, which was actually a launcher.\n\nAdditional download of 4gb... okay...\n\nDownload additional data and start game thinking I can duel with other players.\n\nMandatory tutorial after mandatory tutorial and then a forced shop screen with micro-transactions.\n\nAnother tutorial... Okay... Finish tutorial thinking I can finally duel other players.\n\nAdditional data needs to be downloaded before playing ->. Nope. Goodbye.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad monetization, horrible skill design, combined with the mountain of mechanics that is current yugioh make this a hard recommendation. I wish i could just collect and play speed duels in peave",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Trash gatcha game with terrible monetization, play master duel instead, game was fun when it was old yugioh formats with some minor buffs to anime decks, now it's an abusive trash skill simulator that will wring you dry just to play the same shit you're playing in master duel but with more limitations,\r\n\r\nPlay any other card g ame.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really late to review this old game that was pretty much succeeded by Master Duel which is also in a pitiful state. This game... isn't good it use to be and it was great for those who truly grew up with the anime as it allows you to play with those character and use some of their iconic decks or at least that was the idea.\r\n\r\nThis game has plenty of issues. Cheating, pitiful balance and predatory tactics. I can't in good faith recommend this game to anyone it's genuinely horrible. See this game also has \"skills\" and these skills use to be a hot button topic back in the day but now? There is no denying what Konami has done to skills. They're utterly broken and cheat skills they are just straight cheating. \r\n\r\nYou could be on the verge of victory but thanks to a cheat skill they get a free monster 3 free cards to draw and you lose but that's the issue a lot of these decks that do this aren't even the strongest in the game this game has a very clear meta and it wants you to constantly chase building these meta decks and farm broken skills that result in a pretty unfun and tired loop. \r\n\r\nDuels are decided turn 1 and no you can't choose your side it's a coin flip you go first you better set up a board if you don't surrender the enemy does have an FTK if not an OTK most decks do this if not all especially now in the meta and it's also extremely negate heavy so going second is also suicide and honestly? This game is just too power crept to hell. Go buy legacy of a duelist or go play something else there is nothing for you here but a money sink hoping to take advantage of your nostalgia.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have love and hate relationship with this game. for start, I love the concept, and it's addicting, I have been play this game on - off since 2016, this is my second account on this game because I forgot my first account. but the currency and the grind are very hard for free to play  users, so if you want to be competitive, you have to spend money. but for casual FTP players like me who likes nostalgia and simple way to play yugioh, this is good.\n\nI will recommended this game only for the nostalgia sake, for new player or people that doesn't grow up with this, don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game play was fun during it's peak, imo, 2017-2019. however, free 2 play is nearly impossible since you can't craft cards from box sets and can't dust cards you aren't using to craft cards you want. they'll to give \"ur tickets\" to create 1 ur from a non-current box set. unless they change that, i can't see this game growing anymore. also, since the release of master duel the game lost their biggest streamer. i miss the peak of this game sometimes and hope they do something to make it good again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs formats (such as only DM duels and etc.) and drafting. Rush Duels against other players is great but Speed Duels is just murder right now for some of the more casual players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Duel Links is such an interesting and unique spin on the base YGO game. At its core the game is a lighter version of TCG, with more consistent and quicker games. Meta is also very interesting to say, quite unique decks that seem fun to play. Addition of skills is really a double edged sword, on one hand they do make some archetypes actually work, they also make your deck extremely consistent (especially nowdays) which results in games often feeling monotonous. \n\nWhere the problem lies is that the game is extremely expensive and grindy. Skills are often locked behind a grindy time limited event. Cards are obtained through literal gacha, with no option to craft them, and inherently because of how YGO works, no replacements. Sometimes packs cannot even be opened for in game currency but need to be purchased with money and cards inside are not obtainable any other way (the true p2w). \n\nRelease of Master Duel also killed a huge chunk of the player base, although the whales still keep the lights on. It is quite sad to think of what the game could have been. So yeah, game play good, but monetization kills it\n\n3/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "linked my Steam account to the wrong Konami ID, and now I cannot access my original Duel Links account. i contact the support many times and always get the same email it's impossible the only way to access my account is android",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this use to be grate but now all the problem with old yugioh are here trun to long unfare efficts the game just sucks now",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No inicio era um fodendo web-cardgame, porém a Komoney resolveu cagar o game com skills quebradas e powercreep, não vale mais a pena...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has played this game FOR SO LONG... No. It's not a good game. It's sadly the best \"Anime\" Yu-Gi-Oh game (the other is Legacy but both inferior to Tag Force) but Konami made it so PAY-TO-WIN that it doesn't feel worth playing. I had my ups and downs but this year in 2025 was the worse era for this game. It became Skill Links (basically you need a broken skill to compete), pay real money to get what you need and the meta is unfair. This game is very unfriendly to Free-To-Play users.\n\nIf you want to play this \"game\", give it a try... but you'll slowly not enjoy it. Trust me, I will uninstall soon.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A friend asked me to download this game as he has gotten back into Yu-Gi-Oh, so I did.\nKnowing from my experience with Master Duel with him, the download is in-game, not Steam, so I loaded the game up. Then I went through the tutorial. It had me play as either Yugi or Kaiba as they duel each other. It was very basic and the voice acting was very stiff, to the point where I thought they were using AI.\n\nThen it took me to Duel World and told me I had to duel someone else, but I was allowed to skip it. This whole time, I am thinking, \"Hey, when can I set the game to fullscreen? I'm stuck in windowed mode.\"\nBy the time I got to a menu, it wouldn't let me click on the settings and made me do duels first. \n\nAfter skipping the first duel, it had me go into a mission tab and redeem points that I had to use to buy come cards. Then it started a cutscene that introduced Joey Wheeler into the game. Then it told me I had to redeem more points and do more tutorials before letting me do anything else. All the while, I am still stuck in windowed mode.\n\nThat's when I stopped. I have fond memories of Yu-Gi-Oh as a kid, but That was over 20 years ago. I simply don't care anymore, and I definitely don't care enough to play this PC port of a phone game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ONLINE IS DOGSHIT + GETTING GEMS \n\n\nNEW PLAYERS!! dont touch this shi , u need to be paying money lol, game events used to give alot and boxes used to give at least one ultra rare each 10 pulls but now KONAMI MISS GREEDY wants ur bank cards, and dont touch master duel too, bcs master duel wants ur master card too LMAOOOOO , i played the game for years and i made many decks as an F2P, vreins zexal and arc-v, yeah the game is fun if u like to watch cutscenes of summoning and transformations , there are alot of unique things but TF U MEAN U WANNA PLAY PVP ???? the game only filled of mentally instable people wants just to win and summon their intire deck from  the first phase soooooooooooo\n\n\nw less words:\n-players are shit\n-bulding a new deck is hard for new players\n-U NEED MONEY!!\n-and yeah players are shit again\n\n\n\nI GUESS it will be better just if they made duel links for buying and then be easy on players while playing cuz im not letting this game suck any dollar of my bank acc\n\n\nI F FORGOT TO SAY FUCK THE ARCHTYPE DECKS FR SOOOOO NERFED EVEN MORE THAN THE MAIN CHARACTERS CARDS AND WHAT THE FUCK U MEAN I HAVE TO OPEN 160 PACK TO GET THE NEGATE MOSTER AND ANOTHER 160 TO GET ONE FORBIDDENT DROPLET!!!!! AND REOPEN THEM AGAIN!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Took me way too long to figure out I was hooked on a tiny freemium dopamine booster stuffed with gambling and microtransactions. Regret level: max.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much of a whale game where the chance of getting the cards you want is super slime",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yu gi oh Duel Links suffers from the same problems Yu GI Oh has in general:\n\nMost games can be won within 1-4 turns with cookie cutter builds. When they introduced the latest cards, it was no longer really about strategy. Just learning the combos and what other cookie cutters came out to counter yours. But this isn't restricted to Yu Gi Oh Only, games like Pokemon TCG Pocket have this same problem. Duel Links just had a time where it didn't have this problem.\n\nWe know the reasoning behind this is because better cards mean more sales though, thats sort of a given with most tcg.\n\nThe problem with Yu Gi Oh Duel Links though, is the predatory nature of gacha to obtain the latest cards to make the latest decks. Sure you can run with a Maldoche Deck and get away with some games, but if you are looking to make a Live Twin Deck, it'll take a lot of grinding to get the currency to spam the packs.\n\nBecause there is no restrictions on modes or pvp, you can basically go ham.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played since 2018.. in 2020 they did a major update that FORCED synced accounts. Since then i've tried everything to get my account returned but, they'll just ask you for more and more obscur information about your account until you finally don't have an answer, then they'll claim they can't help. Bro, I sent you over 15 receipts from my Gmail from 2018 - 2022, account start date, last character used, etc. Konami is no help.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please fix the connection. I can run other apps or games smoothly, but this game is often get error connection",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}