{
  "positive": [
    {
      "review": "I would let GlaDoS run experiments on me forever, god she's perfect.....\r\n\r\nOH and also the game was pretty decent I suppose",
      "voted_up": true,
      "votes_helpful": 46
    },
    {
      "review": "[i]Happiness consists in frequent repetition of pleasure[/i]\n\nSuch as when GlaDoS is constantly experimenting on me",
      "voted_up": true,
      "votes_helpful": 62
    },
    {
      "review": "A timeless experience.  Edit: Updated for valve's silly game awards credit.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great sequel to the original Portal game. I liked the humor in the previous game better, but this one is still funny. The gameplay improvements and new additions are welcome. The puzzles are more complex and clever, making them very satisfying to solve, even though some levels may feel a bit drawn-out or unnecessarily large.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Probably the BEST story i experienced in the last few years. Puzzles arent repetitive, voice acting is a gem, great humour, awesome game mechanics and worldbuilding. 10/10 game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "GLaDOS roasts my intelligence, Wheatley destroys the facility, and I’m just standing there happy that my cube still loves me. A masterpiece.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Probably the best videogame of all time bar none\nNot my subjective favourite but\nthe best videogame of all time",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just finished it after completing the first one, and it does what a sequel usually does: the same core mechanic, but with some new features such as different coloured gels to keep you interested. Stephen Merchant really adds some life and humour to proceedings, and it definitely feels like a fuller game than the first one. I still recommend playing Portal first, but there's no reason not to play both in sequence.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's hella more adventurous and a lot more expanded when It comes to mechanics than previous title. Well written Main Antagonists, expanded lore, absolute cinematic story and puzzles that some feel very simple but will tickle your braincells a little and some which feel tiresome but those are mostly puzzles during the end game and after completion You will feel a need for another game that We will probably never get. It's this good.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It has portals in it \r\n\r\nIdk bro\r\n\r\nAlso some british fuck\r\n\r\nLove to see it\r\n\r\nGLADOS kinda a baddie tho..\r\n\r\nExcept the fat jokes\r\n\r\nYou're adopted",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "They really made a worthy sequel to the series. The stages were more complex, new ways to traverse and use the map with, really genius use of jump, fast, water and portal liquid just made the stages really awesome. Loved the story progression and frequent dialogue between really made it worthwhile. Wheatley really made the story fun and hearing Glados bickering was really fun. Definitely Worth the price. But do play the first part first as you’ll understand the story and mechanics much better.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've said this before but there was a solid period of time from like 1998 to 2013 where Valve was just making banger after banger. This game is some of their finest work from their peak.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "after playing run (btw each run is about 6 hours) portal 2 is one of the best games I've played on steam. when you get the end, one of my favorite parts happen (sorry no spoilers :P). the story is great and should also get portal 1 to get more of the story but overall its a good game and try out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun and enjoyable. It’s simple, smooth, and entertaining, with great gameplay and good vibes all around. Addictive and satisfying, I keep coming back for more. Overall, a solid game that’s fun, relaxing, and has just the right amount of challenge.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "pls remove glados' degrading voicelines from the game icant play without gwtting a boner",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty sure 80% of my adult personality has been formed around exposure to this game since the age of 8",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "need i say less? just a great game with alot of charm and love put into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, silly humor, love the portal franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great. At some times it can get confusing, but after a few minutes you always figure it out. The The puzzles are great, the physics are amazing, and the story is incredible. 10/10 one of the best games I've played in years! And for only 10 USD, this game is absolutely beyond worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game aged incredibly well.  For someone looking for a short story and interesting puzzles, this game is for you.  The dialogue and banter that occurred while progressing through the levels was like a treat for progressing through the game.  I only had to look up two levels for assistance on how to solve a couple rooms, but it was really just forgetting old mechanics from previous levels. It never felt like the challenge was cheap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice(great) game, Wheatly might get annoying, i did not beat the game yet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bad games are boring. Good games are fun. Great games? They teach you something. Portal 2 taught me that I’m stupid…and a little short-tempered. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still remember playing Portal 2 on my Xbox 360 when I was younger. Coming back to it after all these years felt like a real trip down memory lane. At first, I wasn’t sure if it would live up to my memories, but as soon as I started playing, it was clear. \r\n\r\n[b]This game is still a masterpiece![/b]\r\n\r\nThe puzzles and levels are brilliantly designed, and the story is captivating from start to finish. Every detail, from the voice acting to the level design, is carefully crafted. Even after all this time, Portal 2 holds up perfectly and fully deserves all the praise it has ever gotten.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a true classic of a puzzle game, and considerably higher intensity than the first. i can't say enough good things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game ever invented, Best story ever written, Best Voice overs ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's brilliant even over a decade on it's still as fun as it was when it first came out. The community are awesome and keep making maps of their own meaning testing never has to end. GLaDOS would be proud!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game, pretty old but still beautiful, great game, still waiting for portal 3. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is brilliant solo, it's even better when playing co-op!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfectly paced, wittily written, polished to absolute perfection. Puzzles are easy enough for anyone to pickup and play--and they should--everyone should play this at least once in their life. One of the best games of all time, even to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would highly recommend this game for anyone. This game has a very humorous story. When you finish the game, you can create some of your own test chambers. I use a mod called beemod that expands the editor in so many ways. Overall great game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this with bro has been some of the most memorable gaming moments of my life. I extremely recommend doing coop with others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is crazy it looks like a movie and the acting and animations are top tier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The co-op is very good with friends. \r\nSingle player is also good but I am too dumb.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always wanted to play this game when I was 7. Played it 11 years later and I don't feel like I missed a single thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game (reccomend it for everyone). So story rich and if you wanna play portal 2 first play portal 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a masterpiece. This came out 15 years ago, and stacks up against most games today. Making a really good game isn't about a 100 hour experience that costs 70$ and looks better than real life, it's about fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the puzzles with the portal gun, simply love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "saying i love this game is an understatment. I think this game is a base for people trying out steam, i cannot describe with words how much i love this fricking game my profile picture is atlas from the aperture science perpetual co - op testing inicitive and i am rushing this review which is why im not spelling good anyway BUY THIS GAME and if you dont like portal you have a very minor case of.. serious brain damage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best, complete, funny, interesting game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hot robot lady is back and she wants to test you more and more... Game of the decade every decade, glory to Valve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly the best game i've ever played. it's not just about the first playthough but also the aestethic and the lore behind it all and the connection to half life. everything about this game is kinda unpredictable and fun in different ways. i never thought i would like a single player this much. worth the money and worth the time. please dont miss out on this experience mr reader",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is on my top 10 games, just because it made me look dumb like 30 times and I insulted my self every time i figured out the answer\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To say I am obsessed with Portal 2 is an understatement. This game is a work of art, truly, and if you haven't played this yet, you're seriously missing out. It's a masterpiece that still holds up super well with (and IMO even beats) today's games. The graphics are beautiful, the story is wonderful, and the chambers are endlessly re-playable. Play this for the sake of an artistic experience and your health.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest game ever hands down. If I could I would whip my memory of this game to experience it for the fist time again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The is one of the all time greatest puzzle games. Fresh mechanics and a gripping story through line. One of the rare games that respects your time as a gamer. Would recommend to anyone. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly, best game i have ever played and will ever play. perfect end to a story, the puzzles were challenging yet fun and intuitive, and it is just the perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first Playthrough of this game was thanks to the Seas. But i loved it so much i bought a copy. Best game i have played lowkey i dont buy games i bought this one must mean something ig. The gameplay loop is fantastic and feels like a natural progression from Portal 1. Valve Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is lit just the best game ever. peak story peak gameplay cheap a good amount of content and also character development",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the story is so good I  am just sad i bought the 2 one before the 1st one i should of done it in order",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What else to say. One of the best games ever made. Much better than the first one. A masterpiece of puzzles and story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is cool, fun portal on moon i want to commit homicide because of how good the turret opera is :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games made of all time, would play this game again for the first time a bunch of times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The nostalgia of this game still holds up, and for a game that was released 14 years ago, the graphics are still amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so good. Wheatley is one of my favorite video game characters. He makes me wish British people were real. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite how old the game is, It's still one of (if not) the best damn game ever. The UI is magnificent, the story is nice, the puzzles are nice aswell, and the co-op is a godsend. 10/10, would replay for the 30th time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game but The multiplayer mode (Cooperate Mode), Is the Most fun. all tho not enough people play it. Its hard to Find another player connecting at the same time. they should Make it more popular Somehow. idk how tho, but if anyone sees this review you should try Playing co op more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played it as a kid, and to this day its my favourite game. The story, the mechanics everythiing is perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Puzzle-type game where you move your character around and figure out how to get out of \"test\" areas by manipulating things like lasers, transporter beams, jump-pads, bounce slicks, speed slicks, and of course, portals.  It starts easy and progressively gets harder.  Some danger elements of heights/falling and bullets/beams are enough to get your heart pumping at times.  Can go at your own speed. Very rewarding when you figure out/conquer a challenging level. Great game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first played this game I thought \"Oh wow! I wonder how games might be as enjoyable as this one in the future!\"\nI am still waiting for a game that tops this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truely a masterpiece, great story, amazing graphics, perfect voicelines, just peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "portal 2 is a VERY cool game, you can fight a boss PS-its not a very hard boss fight in the game for me. PSS-its still very fun. you can play with friends it was also FREE but my friends said that the game cost 9$?\r\nand you can make your own test chambers for people public or hidden.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timeless Experiences. Amazing story and gameplay mechanics.\nGLaDOS is too cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☑ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☑ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good improvement to the first one. The puzzles are still really good, all the additional mechanics are used to their most fun extent, and the dialogue is still great. Really good time, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so so so so good like portal 2 has good graf better then portal 1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, I had a fun time with all the memes and jokes there.  also the soundtracks are out of the world/ 100/10 would replay from the start",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game brought me to tears, i love this game soo much. a must play if u love puzzle solving with a goodass story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorite games, possibly the best game ever? excellent story and gameplay, portal and portal 2 are a must-play for everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another classic by valve, have played this game several times before i just bought this to add to my collection",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plz, PLZ try dis gaem! is rlly gud! Ovrall, Id giv dis gaem 10 :steamthumbsup:s out of 10! Try it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty cool. the fat jokes aren't great in the year of our lord 2025 but there's only a couple and otherwise the dialogue is neat. i do not know how many times i have played this game across PC, xbox and nintendo switch but it's a lot lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have completed this game on xbox multiple times on both modes. Portal 2 is the best puzzle game ever created, Its not repetitive whatsoever and I love making my co-op partner explode. I love Atlas and P-body. You can tell there is something more to them then just being robots. The story mode is absolutely amazing, I love all the humor in it and GLaDOS is easily my favorite charecter once again, not to say the other characters are bad, I like all of them. The expanded lore is also really good. One of my favorites for sure. If you somehow haven't played this before it should be an instant purchase because $10 is the biggest steal I've ever seen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wheatley isn't funny. Some of the puzzles made me want to blow my brains out (skill issue). Much time spent walking or listening to characters without doing anything. GLaDOS makes me feel a certain way. Great game. Valve should make a third.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Late to the party on this one. Like 14 years too late. Ah well. The game's still brilliant and looks great. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cave jonson is so funey I like him so much like he tells us warnings after the test",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7 year old me couldn't get past chapter 2, but 11 years later, I've found it's pretty easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When you first play the coop with somene, make sure they havn't played it before (or its been so long they forgot) you will strangle the to death otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10! My life now revolves around placing portals, as it should.\nCo-op experience is top tier, especially with community maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was the first co-op game for me and my friend. We both had so much fun solving the puzzles. No other co-op game looks as fun as this. Common Valve W.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i have played easier that the first gaem for some reason .It does however have a great story and funny charecter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will certainly say that the hype around this game is not undeserved. This game has good visuals and intelligently designed puzzles that are never too difficult to be enjoyable. The story this time has more characters than portal 1 but is not overemphasized. This is a W game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An outstanding sequel to an excellent classic game. HIghly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game brings me back to my childhood playing this on the 360, It is still one of my favorite puzzle games, This game was always so good I tried to play the co-op by myself (to minimal success) and all I need to do now is find someone to play multiplayer with to finish getting the whole experience of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Portal 2 is an amazing sequal of the already amazing Portal. It's mechanics and the story follows the first game perfectly. And the fact that Valve made this game is absolutely insane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Portal 2 is one of my favorite games of all time. Its full of mildly challenging test chambers, great gameplay, and has such good characters! Coming from someone who hasn't played Portal 1, this game is amazing, right behind Boneworks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Growing up playing this game was a blessing. Playing it again and again after all the fond memories is an even greater blessing. One of (if not) my favorite games of all time, hands down. Lovely story, amazing tests and an engaging, hilarious yet serious story. If you haven't played it yet, you truly are missing out on something very special.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literal 10/10\n\nThe story , the polish , the graphics , the animations , the optimization.\n\nI LOVE this game, especially all of the end credits.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game fun puzzles, definitely get it, its an old skool classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ahead of its time, one of THE BEST puzzle games! does everything the first game did, but better!\nit's source, wallace wells can be modded in if yk how.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Классная игра, перепроходил кооп несколько раз с кучей разных людей. Основной сюжет также отличный, трогательный по своему. Вальв удалось создать живых персонажей. Конечно, ключевая механика с порталами это класс. По своему революционно. На самом деле даже сейчас не то, чтобы распространенная механика, хотя казалось бы - какой потенциал? Уизли этот предал нас илои как его эжтот шарик - ну короче, знайте, что он плохой - не верьте ему.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still a classic in 2025. \r\nStill going to be a classic for years to come.\r\nIf you somehow haven't played this game, give it a run. It's an experience that at the very least will make you smile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A truly excellent sequel to one of my favorite games of all time. Portal 2 builds on so much of the original Portal and provides a much more grandiose experience, especially in the game's second half.\n\nI love the Portal franchise so much, along with its spin-offs and fan games. One of the best $1 I've spent on anything.\n\nOh, and multiplayer is fun as hell, too. Get someone equally as dumb as you and laugh your asses off for hours as you sabotage each other.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is just amazing, the writing, the puzzles, the science, and that damn puzzle maker and community is just everything, still holds good to this day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 for some reason the game always crashes after the credits and I can't finish the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game SO much!! I beat the full game under 7 hours, (Don't judge-) and it was amazing!\n\nHighly recommend this game to anyone that wants comedy, very good story, and challenging puzzles!\n\n11/10 would save wheatley from the moon :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i have ever played super fun but if you are going to play this game play the first one first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This masterpiece being only 10 dollars is still amazing. This and Portal two are probably the only puzzle games I like, and not only this, they are tied at the top for my favorite games ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have seen portal around for such a long time and i never really got to it before now and dang i have hugh regreats that i havent come to it before now i just hope that valve might one day maybe a countines of the series maybe where wheatly come back. Honestly this game mind blew me great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a continuation of the great portal game! its both fun and a great time. its worth the play you can finish it and then wait an undetermined amount of time and hope there could be continuation but you know how most games go after 2 with this company... 3 is just a dream and will more then likely not happen but even still you should try this game out both in the solo story and the multiplayer with a friend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, This might be the best sequel In Valve history.\nGreat game, Love the new intro, Love the new UI\nThe fact you have a multiplayer option Is insane!\nChallenging puzzles, a bit like Portal 1, \nI love how characters can't always say serious, \nWheatley is amazing too. Made me jump of my chair and laugh so hard when GLaDOS says:\n\"I'm a potato\"\nOverall, almost the best game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Easily one of my favorite games of all time. Showed it to my partner for the fist time and had a blast playing it together. When i was a kid i remember playing it on my handmedown mac laptop so i figured we could have a lot of fun playing the co-op campaign together since i got rid of my gaming pc when i moved out of my parents house. But sadly valve in their infinite wisdom decided to cancel supporting macOS. Its not difficult to update it to work on a 62 bit system for the non intel macs. \nJust please for the love of god gamemakers keep your games playable its all i ask",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "played friday the 13th the game and I DIDN'T spawn in as a counselor, I was instead a spectator, REPLACED BY A BOT CALLED GLADOS. this is very disappointing. will not be playing. bad. bad game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game that ruined the best puzzle game ever for me. It explicitly characterises alot of details that were better left unknown from the first game. Because thats what kept me wondering and engaged.\r\n\r\nThe puzzles are still great, however the short and sweet simplicity of the first game is lost, and usually to shed light on details that do not justify more from this universe through Portal 2's much longer and more spacious level design. \r\n\r\nThis game does not justify it's existence, and It snuffed most of the mystery that I loved from the first game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game, but highly overrated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "STOP READING NEGATIVE REVIEWS AND PLAY THE DAMN GAME IT'S A 10/10",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "valve hates adding key no brainer features to games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Weatly is British. otherwise really good gaem",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Говнище игра зря деньги потратил",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY IS IT NOT LETTING ME PLAY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant get past the puzzle too hard :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Super boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im too dumb for this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst Fucking game ever part 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "VSync does not work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rage quitted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "valve is trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "100 reasons as to why i hate Portal 2:\n\n1: Wheatley\n2: Wheatley\n3: Wheatley\n4: Wheatley\n5: Wheatley\n6: Wheatley\n7: Wheatley\n8: Wheatley\n9: Wheatley\n10: Wheatley\n11: Wheatley\n12: Wheatley\n13: Wheatley\n14: Wheatley\n15: Wheatley\n16: Wheatley\n17: Wheatley\n18: Wheatley\n19: Wheatley\n20: Wheatley\n21: Wheatley\n22: Wheatley\n23: Wheatley\n24: Wheatley\n25: Wheatley\n26: Wheatley\n27: Wheatley\n28: Wheatley\n29: Wheatley\n30: Wheatley\n31: Wheatley\n32: Wheatley\n33: Wheatley\n34: Wheatley\n35: Wheatley\n36: Wheatley\n37: Wheatley\n38: Wheatley\n39: Wheatley\n40: Wheatley\n41: Wheatley\n42: Wheatley\n43: Wheatley\n44: Wheatley\n45: Wheatley\n46: Wheatley\n47: Wheatley\n48: Wheatley\n49: Wheatley\n50: Wheatley\n51: Wheatley\n52: Wheatley\n53: Wheatley\n54: Wheatley\n55: Wheatley\n56: Wheatley\n57: Wheatley\n58: Wheatley\n59: Wheatley\n60: Wheatley\n61: Wheatley\n62: Wheatley\n63: Wheatley\n64: Wheatley\n65: Wheatley\n66: Wheatley\n67: Wheatley\n68: Wheatley\n69: Wheatley\n70: Wheatley\n71: Wheatley\n72: Wheatley\n73: Wheatley\n74: Wheatley\n75: Wheatley\n76: Wheatley\n77: Wheatley\n78: Wheatley\n79: Wheatley\n80: Wheatley\n81: Wheatley\n82: Wheatley\n83: Wheatley\n84: Wheatley\n85: Wheatley\n86: Wheatley\n87: Wheatley\n88: Wheatley\n89: Wheatley\n90: Wheatley\n91: Wheatley\n92: Wheatley\n93: Wheatley\n94: Wheatley\n95: Wheatley\n96: Wheatley\n97: Wheatley\n98: Wheatley\n99: Wheatley\n100: Wheatley",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "played friday the 13th the game and I DIDN'T spawn in as a counselor, I was instead a spectator, REPLACED BY A BOT CALLED GLADOS. this is very disappointing. will not be playing. bad. bad game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "played friday the 13th the game and I DIDN'T spawn in as a counselor, I was instead a spectator, REPLACED BY A BOT CALLED GLADOS. this is very disappointing. will not be playing. bad. bad game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game that ruined the best puzzle game ever for me. It explicitly characterises alot of details that were better left unknown from the first game. Because thats what kept me wondering and engaged.\r\n\r\nThe puzzles are still great, however the short and sweet simplicity of the first game is lost, and usually to shed light on details that do not justify more from this universe through Portal 2's much longer and more spacious level design. \r\n\r\nThis game does not justify it's existence, and It snuffed most of the mystery that I loved from the first game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game, but highly overrated",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "STOP READING NEGATIVE REVIEWS AND PLAY THE DAMN GAME IT'S A 10/10",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "valve hates adding key no brainer features to games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Weatly is British. otherwise really good gaem",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Говнище игра зря деньги потратил",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHY IS IT NOT LETTING ME PLAY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cant get past the puzzle too hard :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Super boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im too dumb for this game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}