{
  "positive": [
    {
      "review": "When I started playing Stoneshard, I regretted having sat on it for 5 years. Then I was happy that I had sat on it for 5 years. And then I realized that its biggest problem is that it has been in development for 5 years.\n\nIf you are intrigued by the game, and you want to discover it fully by itself, my cliff notes are: the most common complaints about it are really not that big of a deal, the game is delightful, and you will handily get more hours out of it than bucks you paid for, so for me it's a home-run of a recommendation, with the caveat that an otherwise addictive and super fun experience will arbitrarily nosedive around the halfway point in such a fascinating way that I feel compelled to expand upon it.\n\nI've been mulling it over, and I think the best way to categorize this kind of game is to call it a \"quicksand survival\". Stoneshard, much like Qud or Outward, are games with survival elements on which the fact of [i]surviving[/i] requires little to no effort, just as if you were floating in quicksand: You will have no problem to keep up with food, hydration, shelter and basic upkeep, but any progress will require methodical and consistent effort, and any sudden moves will only make things worse.\n\nThe most common complaint about this game is that dying is extremely easy, and that doing so can set you back a table flippingly large amount of time. From the outset you will need to be very careful, as each skill tree will require a decent amount of investment to see returns on and an enemy getting a lucky hit is all it takes to go from a routine fight to staring at your monitor in disbelief knowing that you are going to die on the next move, and there's nothing you can do about it. When was the last time you slept by the way? Oh, 2 hours ago?\n\nRanged combat is something you will quickly learn to love in Stoneshard. Not only it will help you kite enemies and retain control of fights, but it also will secure a steady supply of money, food, and components for your character. In particular, pelts, which can be used to make bedrolls, which is how you save in this game, so, it's not about cramming all you'll need in a backpack, but if you're smart and patient, you can obtain, craft and utilize what's around you to make your game easier and more convenient, including more frequent saving.\n\nThe game wants to hammer into you that it wants you to play it safe, take your time and plan ahead, and once you understand this, it becomes a satisfying and addicting masterpiece. Gathering supplies, making preparations, taking contracts, heading back to town to cash them in and expanding your caravan, gaining levels and advancing skills will become a comfy and addictive loop that will keep you hooked for anywhere between 20 to 40 hours.\n\nAnd then you will hit level 10. The best analogy I could put to hitting level 10 in Stoneshard is being softly stirred from the best dream ever by the steady tone of the emergency broadcast system.\n\nYou see, the game has a very strict tier system, meaning that, for all the variety in types of gear and weapons, you will unlock new gear types based on your character's level. In this case, level 10 means you will start seeing enemies with tier 3 gear, which is much better than the tier 2 stuff you have on you but is also much more expensive, which will, in turn, compel you to move to the next major area in search of more money, so you can keep up with the game's reactive difficulty. Makes sense, yeah?\n\nThe problem is that, while doing it, you will accumulate experience. This will increase your level. The next tier cutout is at level 15. Oh, look, you're already level 12. And just like that the realization will start creeping in that this game was not rewarding being patient and methodical, but that it wants you to budget a play time that, up to now, you had taken for granted. Leveling up goes from being excited at unlocking new skills and feeling powerful, to something to actively dread and avoid, because doing so will only mean making it more difficult and frustrating. Oh look, you're level 13!\n\nIt's not just the gear, though, as tier 3 enemies will come with their own set of skills. Suddenly keeping your distance and kiting will become increasingly difficult against groups of enemies that can dash half a screen and are immune to the crowd control you have been relying on up to now. Archery duels will consistently end with you on the losing side of an enemy that can dodge every shot while nailing every one of theirs thanks to increased stats and-- heeey, congratulations! You're level 14! Ah, don't worry, at least now you have enough to buy a full set of tier 4 armor right? What's that, you spent it all repairing the tier 3 armor that you thrashed fighting against them? Man, maybe you should go back and grind some money to-- [b]OH WOULD YOU LOOK AT THAT EXPERIENCE BAR GOING UP![/b]\n\nStoneshard is a game with impeccable foundations and a rock solid game loop whose extremely jagged progression is liable to leave you in an extremely unpleasant \"fucked if you do fucked if you don't\" situation through no fault of the player and even while playing in the game's own terms. I am still unsure how salvageable one such situation is, but I hope you understand how hopeless and unpleasant the game becomes once such a realization sinks in. This is probably the most egregious and by-design way the game can screw you over, but it is by no means the only one, as unfocused or even simply mistimed character progression can greatly hamper if not completely cripple your playthrough.\n\nAll of the above comes to mean there is only one viable (or at least, greatly preferred) way to go about Stoneshard: to metagame the fuck out of it. The developers themselves have stated that they expect someone to do multiple runs of the game, and, at first blush, it does not seem like a terrible idea, since missions will be different, POIs will be on different spots, and certain special events may cause you to adjust your playstyle, but the story will be the same, major locations will be in the same place, the steps will be the same, hell, character progression will be the same, at least if you know what's good for you. You'll fight the same enemies the same way, only more optimized and stringent, closer to the very specific answer that this given puzzle requires; none of the zippy, wacky and freeform progression of Qud, none of the (mostly) pressure free \"try again\" nature of Outward.\n\nStoneshard will punish you if you go too quick, and will punish you if you go too slow, in such a way that the amount of challenge is no longer decided by how hard the player wants to push, but imposed in such a jarring way that you can't help but wonder if it is just a product of being in Early Access for 5 years and the developers trying to develop a game for the people who have been that long playing it instead of considering that someone might not want to basically play the same game several times until they play it \"right\".\n\nFirst half of the game is a 9/10, past the mid-game, a 4. I absolutely recommend it, with the caveat that you'll probably grow sick of it past the first act. 7/10.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "This game is nothing less than phenomenal. I've poured over 1000 hours into it since the initial release over 5 years ago and i have to say a few things. The level of immersion into the life of a mercenary, more than the killing and looting, but the hunting/gathering and healing. The morale and sanity management and even the budding reputation gain together create a fatally attractive world in which, you don't necessarily get to be the hero. This  game can be incredibly difficult without taking the time to thoroughly understand your skills and attributes but also, the environment, type of enemy you're facing, equipment on hand etc. The developers have provided us with nigh endless possibilities to approach these obstacles and the replayability factor is incredibly high. I thoroughly appreciate the games challenges and am eagerly anticipating each next installment as things develop with each time new biomes are added, enemies become more varied and dangerous, the world grows and feels more alive. The lore alone hidden in the skill books you find or purchase are little gems on their own. SO much depth here to explore and enjoy for many more years to come. Developers....here's to you and the future of Stonehard.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I am in such a love-hate relationship with this Rogue-lite game.  The level of details is astounding and THIS GAME IS FUN, I can tell you that with great confidence. Is the game as hard and unfinished as the others said? Absolutely.\n\nBut here is the thing: Even with the entire Steam store flooded with Rogue-likes, there is not a single game that can replace Stone Shard. So you end up coming back for more, hoping for updates.\n\nEnjoy your very own purgatory, guys.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Slow-paced, deep, hardcore survival game. Enjoyable in early access. Can't wait for full release. \r\nP.S. Don't forget to sleep often to save you game ;)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't understand how people can have 300+ hours on this game and still give it a thumbs down. There is obviously something good about it that warrants people putting so much time into it. Anyway...This game is pretty awesome so far.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you are thrilled by a game that is hard, punishing, and challenging, this game is for you.\nYou have a variety of skill trees to choose from, a variety of skill points to use on different attributes that create an exponentially large number of builds and characters to make.\nYou can play any style that you want.\n\nAdd this to a game where every choice matters in combat and a false step can lead to a game over, and it gives real impact to your choices.\n\nI wasn’t expecting to like the caravan system so much, but in reality it is amazing. In addition, buying and selling goods depending on the market is a very nice touch that, personally, I haven’t seen anywhere else.\n\nOverall, the game is very good. Highly recommend it, you even have a demo to try and see if you would like the game, and there have been very good updates coming from the devs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a good game, unforgiving while welcoming with its exceedingly easy to learn UI and controls, but painful difficulty. I recommend always playing on permadeath and learn the game just by playing (no guides), it'll hurt but it's worth it. Yeah, that's so.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Challenging yet rewarding game, still at early access phase (even though it already offers a complete experience)\n\nThe development roadmap is well defined and new content is being delivered quite consistently\n\nHighly recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has a lot of mechanics, especially from when I first bought it and I can tell its going to be big and extensive which I like but I will warn you before you get this game. only 1/4th of the game is really here and its not even finished, I can tell this because there is only 1 empire you can interact with and you only find settlements belonging to that empire. Not just that but looking in the files we can find legendary weapons and relics that aren't even obtainable in the game yet and there are other things like skill trees that appear but you cant access them because theyre not out yet. but even saying that its not fully finished yet and every mechanic on this game will be changed I think. When it is done it will be great I can tell you that much, but dont buy it expecting it to be a finished product.\r\n\r\nit is a very challenging game as well, I died about 12 times before I even managed to beat the first mission the game gives you, it is not forgiving and quite realistic. there will be times where against all odds you prevail in an unwinnable situation but they are rare and there are times where you are going to be destroyed by nothing which are more common than the latter x3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Every skill tree seems viable and good.\r\nSmall tip: Even if you take a 1 day contract thats like 6 screeens away, you can travel with the caravan, sleep for full vigor and have a checkpoint and buff before it, no need to run MINUTES back and forth. \r\n\r\nI didnt find it too slow for a turn based game, but some things could surely made be less slow, diagonal tile travel for example taking 2 clicks. About 20 seconds per map tile is okay overall. Use caravan.\r\nAlso Diet Morale drops WAY too fast, eating seasoned food and eating like a pig in every town should not be required AND still not be enough. Well, you can ignore the whole diet morale if you really want.\r\nMoney and space wasnt really a problem, just take the best stuff.\r\nEnemy composition was fair and clear. Tho baiting single enemies seems to be required at times.\r\nManticore was peak.\r\nItems and consumables just in the right spot.\r\nNo autosave makes for buttclenching, just be smart and its fine.\r\nWill prob try an archer next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stoneshard is a tough, turn-based RPG focused on survival and careful decision-making. It offers atmospheric pixel art, flexible character builds, and an open world, but it can feel punishing and unforgiving. Great for players who enjoy challenge and strategy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This scratches that old school itch with just the right balance of a fresh coat of paint. If I can offer any advice, its to not fall in love with your playthrough at any time and be willing to start afresh. It will be okay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. The game is not easy when you start and you learn quickly that the game is quite unforgiving. You need to prepare for every adventure and quest, there is no such thing as being overprepared. Being underpepared hower will quickly cost you your life.\nWith every update the Devs bring more love to this game. New skill tree's, quests and additions. I would recommend this game highly if you like the high fantasy setting, turn based games, a high difficulty and exploration.\nThe only critasism I currently have is that really early on it is really difficult making somewhat annoying leveling up the first few levels since almost everything will kill you and it's hard to get enough money to prepare. And later on (level 25 and higher) you become so powerfull that you can clear out entire dungeons without much danger if you know what your doing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is insanely addictive and brutally hard. I wanted to show this gem some love and support with a thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From trying the demo to diving into the full Early Access, Stoneshard has become my go-to for that perfect mix of agony and triumph. There's something special about building a character in this unforgiving world that just clicks for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Would get molested by a rockeater party as a max level 2h mace Arna again! Get confident and this game will make sure you know your place :) Fun and addictive i would recommend it to any pixel style lover as well as any hardcore gamer (this game will test ur mental health :D ).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing brutal pixel art game, the best combat sistem and continued updates and support for the game from the devs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Difficult, but played tactically can ensure a victory. \n\nLove the art style, the items in the game and enemies too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A delightful, complex, and evocative game with a developer who continues to work on it and pushout meaningful updates and consistent communication, through literal war in their country.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game and really enjoyable with all the different character playstyles. Cant wait for the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game. love the old style graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People who cry about the difficulty of this game suck at video games. The love put into this game and the constant updates from the team is awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well, the game is in early access, there is still a lot to play with and each update give even more to explore.  a lot of strategy go into each run, every failure give you something to learn from, it a brutal and hard game that make you feel like every success is one that is earned.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stoneshard is one of those games that grabs you by the cloak and drags you straight into its grim, medieval misery—in the best way possible. The atmosphere is fantastic, the combat feels weighty, and every step into the wilderness has that “I really shouldn’t be out here but here I am” energy. The world is dangerous, enemies are rude, and the loot is… well, mostly onions and the like and broken to bits items, but somehow it’s still fun.\n\nBut despite all that charm, the game still feels like a beautifully constructed wagon missing a few wheels. Progression is thin, content runs out quicker than you expect, and we’re still waiting on things like proper character creation, which has been requested for so long it might as well qualify for veteran status. I'm bored of playing Mahir for the sixth time and I just want to design my own soon-to-be-mangled adventurer—is that too much to ask?\n\nSaving is also an adventure of its own. Want to stop playing? Easy—just walk back to town, find a bed, and pray nothing eats you on the way (I know there's a bedroll or camps, this is a hyperbole). The RNG doesn’t help either; every fight feels like rolling dice with a trickster god. One moment you’re a tactical genius, the next your sword misses three times in a row and you get mauled by a small ghoul (jk I never got mauled by a small ghoul, but you get the gist of it). It keeps things interesting… in the same way that juggling chainsaws keeps things interesting.\n\nStill, Stoneshard’s potential is undeniable. It’s fun, it’s atmospheric, and it feels so close to becoming something truly special. I’m really looking forward to the next update—hopefully soon—and hoping it brings enough new content that I can stop harvesting XP from woodland critters.\n\nPersonal scores:\n\nAtmosphere: 9/10 (grim, immersive, and delightfully miserable)\n\nGameplay: 7/10 (fun but held hostage by RNG chaos)\n\nProgression: 4/10 (needs expansion and polish)\n\nContent: 5/10 (solid foundation, but the world still feels half-built)\n\nQoL / Saving System: 3/10 (please… just let me save my game or make bedrolls smaller because why is it so big in my inventory)\n\nOverall: 6.5/10 – A rough but lovable gem with serious potential. Looking forward to what’s next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, would love to see more content for it. The art is fantastic. Perhaps a bit generic looking in some parts landscape wise, but the attention to detail is second to none. The TLC the art team does here with the details on the NPC animations is amazing. The Inn you're at may be generic looking but the detail is amazing, the lady sweeping the floor while the cat sleeps in the basket, that kind of thing, brings the game to life. \r\n\r\nThe gameplay is fantastic as well, and hence why I have so many hours logged. Tons of obvious inspiration from \"Battle Brothers\", and everything they did here that will remind of BB was done well, big win. I'm also detecting much inspiration from games like \"Darkest Dungeon\" as well as a splash of \"Caves of Qud\" and \"Diablo 2\". Again, all well implemented. \r\n\r\nVery stable, in 332 hours I have zero hard crashes and pretty solid performance on my potato here with literal \"on-board graphics\" lol.\r\n\r\nLove the game, just want more of it. Still, I paid $20 for this and I feel I've gotten way more than $20 of value for what's here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a rule, I don't buy early access games. But when I do, it's games like this one.\n\nHad it on my radar for a long time. \"Mostly positive\" reviews... but why so many of them, I thought. Finally decided to try it, and oh boy.\n\nHere my brief summary:\n\n1. If you love difficulty, high stakes, resource management, strategic combat, good writing, a world that feels authentic and alive - this is a game for you.\n2. If, on the other hand, you want to feel like an unstoppable deity, slaughtering thousands with every swing of your hand, you might be better off playing something else.\n3. The game is far from being finished, but I definitely got my money's worth already. Kudos to the developers.\n4. Special shoutout to whoever is doing the writing part. The quality of world presentation is top notch - this is how you bloody do it. No exposition devices, just little pieces of information here and there, slowly forming the big picture.\n5. I'm generally somewhat indifferent to pixel art, but I love it when it goes the non-goofy, realistic way.\n6. The aforementioned high-stakes part is no joke. I mean you can get killed even on the way back from a dungeon, quite easily in fact if you make a few wrong steps, loosing you a good chunk of time. But for me personally this is not frustrating - it just just adds to excitement. \n7. Playstyle variety is great. So far I went pure electromancer and I'm loving it, but I can see so many viable and completely different options available that I'm already planning my next playthrough even though I'm far from completing the current one.\n\nAll in all, a great catch for me. My heartfelt thanks to the developers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautifully polished pixel excellence, with a old timey tough as nails feeling. The game is coming out very slowly in chunks because they refuse to abandon the scale of their original vision. Painfully good challenging fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ever made, really good fighting mechanics, most of the time you feel on the edge, most fights are grueling, and winnig an encounter feels well deserved, there is a lot to explore, the atmosphere of the game is spot on. Of course there is a caveat, the game is not fully completed, there is no alchemy for the moment and the main quest isn't quite done. The devs are hardworking and update the game quite often.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "91/100\n\nStoneshard is a very fun, hardcore, turn-based pixel art survival game in Early Access that pulls you deep into a medieval fantasy atmosphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, good depth, great replayability. Support the devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "La ambientación del juego es espectacular y tiene una cantidad de detalles impresionante. La dificultad es elevada y cualquier enemigo te puede matar, pero con la práctica se van aprendiendo estrategias para salir airoso (por ejemplo, evitar el enfrentamiento o dirigir a los enemigos hacia trampas o animales salvajes). También hay una gran variedad de misiones y las mazmorras se generan de forma procedural, por lo que no se hacen repetitivas. Los diálogos están bien escritos y van al grano, cosa que se agradece. La versión con acceso anticipado ofrece muchas horas de contenido y no he encontrado bugs hasta el momento. De lo mejor que he jugado en su género.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idk. I like looting anything I find in a dungeon. Sometimes the difficulty feels so unfair, but if you know or learn how to play, it’s fun. I hope for more new content, and that i can finally make a build that doesnt requires focusing on only one skill branch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you hate yourself?\n-No? You should. -> Buy the game.\n-Yes? Buy the game.\n----------------------\nDo you like hurting people?(Including yourself?)\n-No? You should. Buy the game.\n-Yes? Buy the game.\n10/10 Masochism simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! The graphics aren’t exactly beautiful, but they’re perfectly serviceable — and the gameplay more than makes up for it. This is honestly the game I’ve been looking for without knowing it. Brutal combat, straightforward survival mechanics, and a huge, fully explorable map that feels neither overcrowded nor empty. Just wonderful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm honestly not sure y there were complaints about 30 minutes to go back and forth to a maze... maybe it includes the fighting? anyway, for me I find it going on in a very nice pace and so far so good with the game (I really like it :))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Update: Mid game balance is.. weird.. to not say bad. I spent ~7k gold I had amassed throughout my playthrough to upgrade most of my gear to Tier 3, and reached level 10, unlocking some strong perks. I should feel stronger, yeah? But instead I feel weaker, because I went to the new zone seemingly recommended for level 10 and tried a Tier 3 contract quest. Oh man, I got my teeth kicked in by just random bandits ON THE WAY to the quest. lol\nIn tier 2 dungeons even before the gear upgrades I was cleaning house no problem, but suddenly I feel even weaker than at the start of the game, as I'm having life-and-death struggles with any 2 random bandits on the road where I just BARELY survive and a dice roll or two going differently would have meant death.\nLike I said.. this is.. weird. I don't think that I like it. Yeah no.. I don't like it. Now I have to go back to earlier zones to farm exp and.. idk what.. because I can't even get T3 gear from T2 dungeons, and most of my gear is already T3 anyway.. so I am not sure what grinding T2s will give me.. more skill points, I guess?\nDefinitely disappointing that I cannot progress to the T3 dungeons.\n\nOhhh man.. this game is dangerous. It you are the sort of person it is meant for, this can make time disappear for you. I got it and sank almost 9 hours into my first session without realizing it..\n\nIt's brutal and unforgiving. Basically single-player Battle Brothers. At times you think you are on top of the world because you cleared out a bandit den. But then you get destroyed in the woods by two not-so-good boys.. (wolves are stronger than bandit leaders, for some reason). You can only save by resting at a bed or bedroll, so make sure that you do and as often as you can..\n\nYou can also steal everything that's not bolted to the ground as long as nobody is watching, but you gotta stash the goods and wait for them to not be flagged as stolen. And this reminds me of Skyrim in that you can get arrested for killing a chicken in town.. and the guards will happily murder you if you resist arrest. lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just gotta leave a positive review for this one. Cause it deserves it.\nThanks for a GREAT game so far. Had so much joy (and misery).\nCan't wait for 1.0 so I can start a new playthrough again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OK, so I'm debating whether or not this game is ass or a decent rogue-like.\r\n\r\nThe fact that I'm debating after playing for 13 hours means: it did the job. It kept me playing.\r\n\r\nImbalanced, RNG heavy, stupidly designed? All of that, true. The save system blows and is antagonistic to your time and to fun generally.\r\n\r\nBUT. A fascinating world, lovingly crafted, enough to the combat where it *almost* doesn't feel like a stupid left-click-fest.\r\n\r\nMy recommendation: Play it for 10 hours. Decide for yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game, the save system is exhausting though.  Definitely too much boring travel time too, any chance of being able to travel faster than 1 tile at a time?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: A game that requires tactics and is very rough in the beginning.\n\nAs in the TLDR, this game isn't really for those that cannot commit. it requires quite a bit of playing around and figuring stuff out to really understand some of the mechanics and all that you can do. \n\nI really love this game and what the future holds for this game as the devs keep adding more content, items, and different ways to play the game. I cannot recommend this game for everyone because it does require some getting use to and it can be frustrating when you get hit by a few more bleeds then the amount of bandages you hold but once you get a decent build figured out, and you have the skills thoughtfully allocated, you can be very strong! you might be a glass cannon or maybe you hit like a wet napkin but you are thiccc in the hp and defense dept. Experiment. Try a new build out. \n\nI will say this thought, The game is Early Access and with most or all games like this, there will be bugs. balancing issues or something you wholeheartedly dislike. But nothing like good ole Stockholm Syndrome when the game is holding you at arrowpoint after you died and havent saved for 5 hours. The plus side? at least you didn't turn on permadeath mode. If you did? Well, good luck. \n\nNow as i said, the game requires tactics and loads of prep. Especially in the beginning when you are squishy and can be blown away by a stiff breeze. or a boar charge. or a wolf pack. or that time when you stumbled upon a bea- you know what. just make sure you are prepped. \n\nThe game will go through rebalancing as they drop more content and skill trees so do not be too comfortable with your builds. For the time being though, read the character before playing, have an idea of what their strengths are and go through the skill trees and kinda plan 2 or 3 levels ahead. \n\nI think i rambled on for too long about random stuff but dont be afraid to try out the game if you haven't yet. I appreciate it for you reading this far and if you have any critiques for me then leave it in the comment. Won't get better if i dont learn from my faults. \n<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still ways to go, the game really slogs and bashes you down end game, mods are nice but devs keep breaking them for no reason than being petty, okay to play but wait for sale and full release to see if it both becomes a good game or finished",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im playing ranger and I personally cannot understand the critique of this game being hard; at least its not hard after 3 hours, when you get the hang of it. Its so easy to kite enemies, you just need to be careful not to run into the full group at once.\nOne thing that feels really weird to me is how easy it is to scum dungeons tho. Just kite enemies towards the door, and if things get precarious, click it - no one follows...\n\nOverall really good game, will definitely keep playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the prologue and I was so amazed by it, the storytelling and game play even the semi-realism of bandaging specific limbs! The only thing that bothers me is waiting for character customization! I feel like a lot of, if not most RPG players like to create their own characters in games like these. The characters are awesome though so it'll get you through until it's implemented.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is punishing I cant get past my first quest. If you want a super hard game this is it hopefully one day i get lucky and progress through the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is incredibly fun and addictive! However, it still needs work. Balancing is an issue: Bows builds are weak. Skill tomes are rare, and equipment damage/repair is costly and frequent, making funds hard to stockpile. Used loot from your kills are pointless to try and sell because they aren't accepted unless repaired and the repair cost is astronomical compared to the sale price making nothing worth looting. That leaves your only income coming from contracts, which is good when it's good, but you struggle so much to fight everything, you end up spending all your funds to keep from dying. It gets rough. Intoxication takes WAAAYY TO LONG to reduce, making it nearly game breaking to run around with it. Hopefully the game gets what it needs before full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got this gifted from my wife who knows I enjoy a brutal game on occasion. This exceeds expectations. 10/10 I haven't gotten past level 6 at 100 hours of rerolling and crying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots to do and so little time to do it. I love how this game just becomes bigger and bigger while maintaining a challenge. Yes, 2 men, easily handled but 3 or 4, ah yes, I must run now. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game amazes me with each upcoming update. Maybe it is a little grindy; some may say it's unfair, but if you can look past that, the game is amazing. Love the graphics, mechanics, and attention to detail. Looking forward to its future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is like no other I've played and absolutely hooked me! My only complaint is the rate of development but I can understand considering what the developers are having to deal with!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic little project. Small part a fantasy RPG (for now) and mostly a lite adventure simulator/sandbox experience. It's not particularly close to being feature complete, and the story is only an intro at the moment, but well worth the money still.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Having this weird issue where permadeath mode is unticked by default. Bad game design/doesn't respect my time? How can you expect me to manually click that every time when it's not even painted yellow? What if I forget to enable it?\n\nUnacceptable. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like a game with a steep barrier to entry where most of the real progress is measured in how well you, the player, learn to deal with bad situations, you're in for a treat. Your zomboids, your dwarfs fortress, etc. I'm having a great time. I've played 10 hours, and I've saved my progress at 2.5 hours, so that's a full 6.5 hours of pure learning in the blender. My only complaint so far is that there are too many trees and not enough context to know how well each trait will work for you until you use them, but you're likely to just die in between saves and have to earn that point again soon enough. Would put my fingers in this mouse trap again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I Love this game. I understand is not for everyone, if you don't like a difficult game this may not be fore you. But once you understand it better its not that hard but still challenging and extremely fun :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Masterclass in Harsh, Rewarding RPG Design\n\nStoneshard is one of those rare games that doesn’t just ask for your attention—it demands your respect. Every step, every decision, every bandage you don’t pack can shape the outcome of your adventure. And that’s exactly what makes it so unforgettable.\n\nAt its core, Stoneshard is a deep, turn-based tactical RPG with an atmosphere so thick you can practically smell the damp forests and dusty dungeon corridors. The game’s world feels brutal but fair; it never lies to you. If you die, it’s because you misjudged a fight, overextended, or didn’t prepare. And when you survive? It’s incredibly satisfying.\n\nThe progression system is one of its strongest points: entirely open-ended character building, tons of viable playstyles, meaningful gear choices, and a sense that your character is becoming stronger because you are getting better at reading situations and planning ahead.\n\nThe procedural content keeps things fresh, and the sound design—especially the ambient tracks and enemy cues—adds a surprising amount of tension. Even the little things, like lighting a campfire in the wilderness or inspecting your injuries after a narrow escape, make the experience immersive in a very grounded way.\n\nIs it tough? Absolutely. But it’s the good kind of tough, the kind where every victory feels earned. If you enjoy games like classic roguelikes, tactical RPGs, or survival-heavy adventures, Stoneshard is easily one of the most rewarding games you can sink time into.\n\nVerdict: A brutally honest, brilliantly crafted RPG that rewards thought, patience, and creativity. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good. Very unforgiving. You will be pissed off a bunch until you learn how to survive through trial and error. You will be pissed off. Most negative reviews are because of skill issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a fine line between bravery and stupidity. This is not an easy thing to understand in the world but Stoneshard will teach you how to master the art of bravery and how to avoid crossing that almost invisible line. Think and you may live, do your best and you might still die, life is not fair and Stoneshard is fun if you can accept loosing when you dont know when to run away. Might be too soon to tell (26 hours as of this initial review) but I plan on putting hundreds of hours in this. The progression is incredibly slow and feeding yourself is a struggle at low lvl but it has a darkest dungeon-like energy that some will appreciate in its roughness, turn away now if you like easy games, last warning, if you dare to continue, save often and don't get swarmed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so hard. Choosing melee has low chance to survive because most of the time enemies are in group. I started making real progress after switching to bow or magic. After dying over and over I learned some tactics, like using ranged enemies to hit their own teammates by lining myself up with the melee enemies. You can also reposition to make enemies get stunned and take more damage when they’re knocked into walls. Luck plays a big part too, like after completing the contract, as I went on my way to claiming the reward, I encountered some dogs that chased and bite me. I got a very low HP, so I opened up my inventory to heal… only to realize I had zero healing items left. Instead, I found a smoke bomb item that I picked up earlier (very lucky). I threw it on the ground and the smoke filled the area, their bites missed, and I managed to get two tiles away from the dogs. I'm almost near on the other side to teleport but unfortunately I miss clicked the tiles back from the dogs direction so I died.\n\nEven though the game is unforgiving, I still love it the way it is. You'll learn from each mistakes as you retry and when you reach the spot where you died, you'll know exactly how to correct it.\n\nIve only scratched the surface so far and there is still a lot left for me to uncover in this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Oh it's good. Can't wait for the full experience in 5 years.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I'm fine with this being a long-term project, and I don't mind that the final version won't be released soon. I support developers who are working on the game of their dreams. I’m also willing to buy another support pack if one becomes available.\r\n\r\nThe world is captivating, full of its own adventures and challenges that you have to overcome. I’d love to see more quests in the future and more opportunities for nonlinear progression, like the wine thief quest.\r\n\r\nSpecial thanks to the designers and artists, you can immediately tell that the game has soul because of their work. Thank you!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game!\ncan spend hours upon hours trying different builds, exploring, training, getting gud.\n\nNot easy but very rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very well made game\r\nPros:\r\nFun, very good introduction, combat from beginning to end is interesting and requires immense thought into positioning, timing and cooldown management, each character is pretty well made and the dialogue in this game is actually rather well written and would be something you would realistically say to a person, each build is actually viable\r\nCons:\r\nIncredibly time-consuming, requires constant attention, the game base UI is god awful, only two bosses, core gameplay loop can easily get stale\r\n\r\nWhilst the game does have a rather low amount of content for a game that has been out for 5 years, i do recognise the devs are ukrainian + content is finally resuming properly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SO much fun! Wizard = EZ mode & their spells are really cool. Can't wait for the full game to come out. These devs don't mess around.\r\n\r\nAbsolutely gorgeous game 10/10 as is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible experience! The game is harshly unforgiving, difficult, and deeper than you can tell at a glance. Combat is both measured and frantic; it's turn based, but the momentum of each choice is exciting as you watch it play out - until you make a sequence of wrong moves, or the RNG gods punish you with character-building bad luck. Highly suggest you try this one out, if you're seeking a deeper RPG survival experience with a high level of replay-ability and creativity in it's approach. I created a Pyro/Geo mage & have been having a blast. Just be prepared for either victory, or learning how to achieve it through death & error.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is demanding, yet rewarding. Patience and preparedness go a long way. There's plenty of offer and dungeons of many different levels and difficulties. The world itself is interesting and well-made. The game is not ready yet which is a minor issue but it can be enjoyed in its incomplete form too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is really hard if you don't get aligned with how the mechanics work, you have to get into how everything is affecting you and you really have to know when to run and when to fight, otherwise you'll have a bad time with this.  Having said that, this is a great RPG, I like what I have been seeing so far and how strategic you have to be, this game is not for everyone and it will not forgive the tiniest of mistakes, ye be warned. \r\n\r\nThe graphics are nice to look at, the ambient is gritty and the dialogues are fine, missing a character creator but hope to see that in the future. \r\n\r\nThe only complain I really have is the hunger mechanic; once that hunger hits your character, it becomes relentless unless you find some food, and you'll have to be quick about it and also find tons of food, the more you delay, the hungrier you get and you can spend 3 or 4 full meals trying to bounce from that, the devs just cranked that feature to 11. \r\n\r\nIf you want to see a good review and gameplay, visit 'Splattercat' on youtube, he really does it justice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Literally one of my favorite games of all time, and it's not even done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never rage quit a game and returned to it so quickly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game so far. One of the most enjoyable games I've played this year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, amazing pixel art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's slowly developing, and deepening. I'm enjoying the journey.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more content more more content we Need more very good game !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome RPG game like dark soul and diablo play style",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, cant wait for full release !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very challenging even though I haven't activated permadeath",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game could use move fishing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah, this game makes me cry... a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cant wait for this game to release!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just beat the prologue. lol its rough out here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard but fun once ya get the hang of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "step step step...i die, then live, to die again, very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is going to make me lose my mind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i want to create my own char ... it takes way to long ...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good shit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I give this game my recommendation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I suck at this game, I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So difficult but interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great turn based game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is Dope.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game +1",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nominated for Labour of Love",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very soon...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "baruk khazad khazad ai menu!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate that i love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unique",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I try to like this game, I come back after months of not playing for reasons I cannot remember, start a new game, get into it, then I die to some bullshit ass thing my little moron pathed into instead of going the way I wanted. I remember suddenly why I despise the game when I spawn back 3-4 hours back in time at the last time I laid down on a bed before completing the 4 or 5 quests I did, the last of which being a stroke of luck and making me quite happy to have completed.\r\n\r\nFuck this bullshit ass save system.\r\n\r\nYes I know sleeping bags exist. Yes I know they are 1 use items. Yes I despise them for taking up 60% of my inventory space and neglect buying them as a result.",
      "voted_up": false,
      "votes_helpful": 93
    },
    {
      "review": "Game has potential but in its current state, it’s a mess, it’s all about grinding to get little to no reward, you go in a crypt full of traps and there is nothing interesting to loot, fight is about luck and running away most of the time, you see two ennemies side by side, you run praying to not encounter more ennemies on the way, it takes a lot of time and almost no fun to level, you can only save in a bed at an inn or in the wild but they are scarce, that means you can do a dungeon run and die on your way back, losing two hours of playing for nothing. Devs are inexperienced they are able to make a great game but they strip all the fun about it so it look like you work at a factory for zero dime.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "i wouldnt bother with this game until it finally releases. Many minor things have changed so often that it's hard to want to play the game because your build may not even be possible in the next version.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Update: \nIt does get better. I don't know if it's just sorcerer class that is extremely rough at the beginning but as you unlock more stuff you can survive a bit better. It's still super bs at times and I still have to fight while running away but I don't see that ever changing. \n\nI still think there is a lot to be improved and balanced but as mentioned in my original review there is something redeeming here. It's clearly a labor of love but it needs some work. It is early access ig but it's also been in early access for 5 years. \n\nI'd like to leave a neutral review but since that isn't an option I'm leaving it at not recommended because I think unless you really like extremely punishing games and are willing to put up with some unfair situations, this is probably not for you.\n\nOriginal Review:\nI like difficult games. This game goes beyond fun difficult into frustrating difficult. I have to take every single fight like a complete coward. Cast a spell, run, gain distance, cast spell, run, gain distance, repeat infinitely. Make one wrong step and you get stunned, confused, or scared stiff and you are dead in 3 hits then back to the last time you slept (an hour or 2 ago). You can bring a sleeping bag and sleep before you think there will be an encounter, good luck predicting that. It also takes like 9 spaces in your inventory and is single use. Sleeping bags should be a single slot in size and stack if they are going to be single use. After 15 hours of play time, I have a single level 3 character and I've done one single main quest that took like 6 hours of my life and 5 deaths to complete.\n\nI'll probably keep trying because I hate myself and despite it's frustrating systems and balancing issues, there is something redeeming about it. This could be an 11/10 if they balanced a bit better and changed the save system or sleeping bag size/use amount.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game, i like the premise, i like the many systems, i like alot of things, but at the end of the day there are so many questionable decisions that just plain ruin the experience for me, the main one being the god damn inventory , its so small that it irritates me to no end, also not being able to stack certain items is absolutely infuriating, oh you have 2 berries, guess that takes the same amount of space as a fucking AXE.... You can only save by sleeping so i hope you like HAVING HALF OF YOUR INVENTORY TAKEN UP BY A FUCKING BEDROLL.....",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As with some other reviewers, I really want to like this game.  There is so much potential for it to be an extraordinary game.  But in my short time playing the game as a caster, my experience has felt like everything in the game is stacked against me.  While I enjoy challenging games, the things that are difficult sometimes feel like they exist just to ruin the fun of the game for me.  Short time limits to complete fairly difficult quests (why have time limits at all?).  You cant get into most dungeons unless you have the quest for them so finding places to gain XP can be challenging.  Skills and abilities are difficult to attain and when you do theyre tiny, incremental improvements (maybe make skilling faster or provide larger boosts?).  Its almost impossible to find vendors who want to buy anything from you and when you finally find one, they often run out of gold quickly and it only replenishes if you buy something from them.  During combat, as a caster, I take as much damage from miscasting spells as I do from the mobs and it's tough to significantly decrease your chances at miscasting.  I could go on but, my point is, this game still needs some polish to be anything more than self-flagellation.  I truly hope the developers continue working on it because, as Ive said, it could be an epic game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This has to be. Single handily one of the biggest waited for Game, And, Biggest mistake i've ever brought. \n\nOn one half. Ace update. Really good world building\nOn the other? Still. No custom charatures. Period. And that was Promised Yeearrs ago.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "really like the game and idea, and the art of course\nbut walking from one area to the other is an absolute uneventful chore\nwill come back if theres some sort of fast travel to at least discovered locations",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As cool as the games premise is, almost all the features are just not there, alchemy is still not in the game, crafting is limited to basic food you buy from merchants and the saving system is just plain bad. \n\nthey keep sidestepping the critical issues with the game, in favor of adding new items and magic trees, which isnt itself a bad thing. the problem stems with them making a new system whenever there is an update, instead of using whats already there to make the game better. i.e use crafting recipes for alchemy, a majority of base ingredients are in the game already, as well as the potions themselves. \n\nTLDR. Trailer doesnt accurately show games current state, many features stated are either unfinished or bordering on useless.\n\nGreat potential, wish to see more.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played for nearly 4 hours and I'm already tired of this game. I like a difficult game but this is just frustrating... \n1) The travel time is insane.\n2) Where can you even get food - tried selling gathered items but no NPC wants them.\n3) You finally kill some rufian camp and you think 'yes, boxes to loot!' They are all empty... And then you realize you don't have any bandages left or stuff to heal your body, my character has been hungry for the most part of my playtime. \n4) You get a bow, try hunting some animals: always 1 tile out of range before they fly/run away. \n5) Went for gathering herbs to finally buy some food because I found an NPC who was willing to buy... Did 30 trips to earn 60 coins  -> the inventory space is SO SMALL. \n6) Looked up a way to earn some money by collecting fodder. Farmed 200 fodder and now I read that the developers removed this. \n7) Game has been in early access for 6 years. \n8) Once you finally get some stuff going the game is actually fun to play. Except the cruelty of dying and not having saved your game can set you back hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Better that the game had an engaging 6-hour gameplay instead of being stretched to 24 hours with boring mechanics like, \"oh, my character is hungry\"...\n\nTalent trees do nothing except give 2% changes to some variable? Yet there's a whole essay about \"changing something special\" in the talent tree that practically means nothing in real gameplay.\n\nSaving is a separate pain — if you die, the nearest save is 1 or 2 hours old!\n\nAuto-leveling is worse than in Bethesda games: random one-shots from any enemy, and for some reason a tiny inventory where you have to carry a bunch of useless items by default.\n\nPiles of mobs in dungeons with no way to run away from them.\n\nThe game is beaten by grind, not skill (random damage rolls — mobs can one-shot a fully leveled character?!)\n\nBuy \"Battle Brothers\" instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is meant to be hard.  \"hard\" to the devs means getting hit once puts a significant enough debuff on you that you cannot fight back and every subsequent hit puts even worse debuffs on you.  enemies do not suffer from any of these.  you are also not allowed to save unless you pay at an inn, so death comes quick and then you get to repeat hours of talking to people or exploring the world.  give this one a pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only played this a little, but even so I had a pretty strong opinion. Let me say this first: I have no respect towards rpg games that try to pose as a hardcore difficult rpg by creating artificial difficulties outside the game and try to sell it as immersive. Aspects like quality of life and inventory management should never be part of the difficulty. You have a very limited inventory that fills up really fast, and you gotta carry a lot of stuff with you so half of it can't be even used. And then the same items don't stack so each and every scroll takes a whopping 2 slots in your inventory, never mind all the food and drink. And then when you find some usable item on the ground, you can't use it directly. You found a book? You can't just read it there, you first have to make space for it in your inventory, then loot it, then use it in your inventory. Same goes for every other usable item aswell. If this design is made so the game feels like a difficult rpg, it's just a tasteless, bad decision that kills whatever fun there might be. Even in prologue I ran into this problem, so I can't imagine how bad it becomes as the game expands.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like the game and know its early access but Its hard to recommend this game, theirs allot of work to make this a game worth playing hopefully they finish the game and will change the review but right now Its like a 4/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game almost nailed it.  It is an overhead'ish turned based rpg. Alot of the systems are good.  Combat is fun, music and sound effects are good.  Graphics are passable.  This should be a game that easily gets a thumbs up.  So why am I giving it a thumbs down and a pass?  \n\nI guess the developers wanted this game to be overly difficult.  I am all for a challange and a difficult game when it is done right and is fun.  They made so many tedious things and the game just turns into an unfun chore.  Your inventory even with a bag is annoyingly small.  You constantly have to eat and drink.  Not realistically where one meal would be fine during a day, no you need to constnatly scarf down steaks and other food.  And if you dont mix up the food variety enough? you get depressed and it debuffs your character.  And there are many more annoying things in the game that just ruin the fun of an otherwise very promising game.  I would give a hard pass to this game, it may seem alright at first, but once it sinks in, you realise it is just a waste of time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is five years of early access? I play games like Quasimorph, Battle Brothers, etc...this is just a whole new level of unfair; plus with the saving system sucking it zaps most of the fun out of \"hardcore\", it is a maybe recommend when more updates roll out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a roguelike, at all. Remove this tag.\n\nOnly 3hours and already tired of the moving/traveling system, so much time wasted for nothing...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unfair more than hard\n\nlose 20 - 30 minutes of gameplay because bad rng or too much enemies spawned it's a big NO\nMy time worth more than this shit designed game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a nice low latency OLED 1440p gaming monitor, so I am not able to comfortably read the text on the screen. If I ever become homeless and end up living in land fill stuffed with late 90s computer monitors I will rebuy this game because at that time I will have the trash to play this trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so many things about this game are cool and just as many things are completely and utterly idiotic, the early game is fucking miserable and possible the worst early game of any game i have ever played, the devs are idiots who dont seem to care about the game even in the slightest. the idea of this game could potentially be good but its executed so so poorly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game looks great. It has a lot of potential by looking at the trailer.\nHoneslty I played around 10 minutes only because the white UI dot following the cursor and the lack of walking animation made me crazy. But if you arent that kind of person thats bother by this, go ahead it will be great once its finale release.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not sure i can recommend this. Fight 6 people and destroy them all, fight some farmer with a stick get killed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like the longterm direction they want to take is Battle Brothers, but with a more tedious global movement system, more magic, no innate automatic-weapon-attack-skills, and a bit less tactical depth due to its focus around you as a singular character.\n\nThere are ways this can work well, but I think the introduction to the caravan mechanics feels a bit... arbitrary and rushed (and not necessarily what I wanted). I also find it kind of strange that we're meant to be a normal person, but we also decide to take on solo jobs where we murder 6+ other people in rapid succession. Wouldn't... it make more sense to be part of a larger group if we're a normal person trying to make our fortune in the world?\n\nEconomically the game functions okay, but I do find it also a bit tedious to time myself with NPC shopkeepers, and to move from X to Y, but that isn't a terrible thing by itself, though if a chunk of my day is meant to be spent shopping, I'd like the interaction to be a bit deeper.\n\nI'm also sad there's no character creator.\n\nIf the game had more rapid development, I'd be more optimistic, but while it can scratch an itch, I think it's not quite what I had wanted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a trainwreck. I got 2 characters to level 30 and have most of the achievements. Interesting combat system, but this game features Tiniest inventory ever, tons of pointless micromanagement of your character state, and lots of just carrying items around from vendors to your base storage.\n\nMods looked promising, but they break some skills, and the devs have no interest in fixing that. Add to that the very slow delevopment velocity and the answer is clear: find another game to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a game with good bones and could be very fun but the balancing and scaling needs work. the progression of enemies getting harder happens in sudden stages so rather than organically levelling you hit plateaus where you need to suddenly go back to level 1 mindset to move around the map. Also understand that it there is an rng element but regularly feels that encounters rely solely on whether the dice are with you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to like this game. it definitely has potential, especially as a co op game. As it stands they some how figured out to make a game with 2D graphics and give it 1D combat. The only strategy is run and shoot and try and face enemies 1 at a time. While adding in that its extremely broken and you will die a lot just trying to achieve that singular level of combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just not very fun tbh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "do not waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no review",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The level of detail in this game is awesome and I like everything about it except... this is a game for masochists. Honestly it comes off as very unfair. Imagine a game like Dark Souls, but when you die... you lose 2 hours of progress. It's not only punishingly and unpredictably difficult, but when you die, you have to slog through another 1-2 hours of BORING traveling back to where you died. It's not the gameplay loop of fail fail fail fail fail fail then succeed and feel amazing for conquering that tough boss. Instead it's fail boring re-traveling back to dungeon, fail boring re-traveling back to dungeon, fail boring re-traveling back to dungeon, fail boring re-traveling back to dungeon, then win but no boss fight, shitty rewards, and feeling *not* rewarded for all your hard effort. TOO MUCH boredom because the save mechanism is too infrequent. If you're a fan of iron man/permadeath-style games you might like this. Otherwise... great game with a lot of depth, that needs its difficulty mechanics readjusted. Also, at level 8 I went back to the beginner-level area (Osbrook), took an easy level 1 quest... and still died 3 times on that. Yeah, that's f**king bull$h!+. BADLY in need of difficulty re-balancing. BTW I played, beat and loved Dark Souls 1, 2, and 3, and love BattleBrothers. Sure, lots of frustration with all of those, but they had gameplay mechanics to make the gameplay *not* repetitive and boring after dying over and over, and their weren't unpredictable difficulty spikes while needing to replay long sections of the game over and over each time you die. Not like this they didn't. If only the devs fix the infrequent saves and unpredictable difficulty spikes, this would be an awesome game.",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "I have a feeling that the developers just hate the idea that the players enjoy their game. Any minor things that benefit the player a little bit will just get removed immediately. Oh the loot for the \"stolen shipment\" contract is very good? no worries we will just make the loot random next hotfix. Wow the players are enjoying the arcanistics skill tree? It's fine we will immediately nerf it. I bought your supporter pack because I feel like the developers put quite a lot of effort into this game and I appreciate it. However, you will get a negative review from me for being hostile toward the players.",
      "voted_up": false,
      "votes_helpful": 123
    },
    {
      "review": "I've had this game since early access before it was even released. It technically is still in early access 5 years after release in 2020. The game can be somewhat fun once you learn how to play but it is brutally strict. \n\nThe game pretends that you can freely customize your character's skills which is true but also misleading because the game is just so hard now that you will constantly fail until you figure out what combinations of skills+stats+equipment actually work together in order for you to survive the early-mid game. \n\nThe game was more fun in it's earlier days and this is not nostalgia speaking because we have access to being able to roll back and play older versions and I know for sure I liked the older versions more than the current one personally. \n\nI highly do not recommend this game to people completely new to this game. I believe you are better off going next for better games that actually don't take a thousand years to finish development. Gta 6 is probably going to come out before this game is finished. \n\nI do not recommend this game to many because the game is extremely brutal unless you know specifically how to play the way the devs want you to play. I recently had a response from them in discussion saying that looting junk on the ground is lame and boring so that's why they decided to nerf that so now players can no longer sell junk loot from dungeons even though we have been doing for 5+ years. They also have constantly added nerfs to make players not want to play a certain way while adding buffs to make players play a type of way such as promoting mostly combat over exploration and having fun. They made food cost more money and make them worse by having less effect than it used to, while taking away methods of money making on top of the higher costs to railroad players into this constantly boring loop of talk to the elder, take contract and clear the dungeon, go back and get reward from elder, then repeat. They really wanna force players to just do this over and over and hate if players wanna do other random stuff like hunting, exploring, looting, foraging. Being forced to just constantly talk to the elder, do dungeon, get reward, repeat and that is boring! \n\nwhy can't players just be allowed to do what they want that they find fun? But I guess that's a good point to put in my review. Games are meant to be fun. This game though, the devs do not care about you having fun, they just want to make the game their way and try to nerf things they don't like to force you to play your way because they don't want you to have fun your way. I guess I'm finally leaving a review many years later after buying this because I finally am done with the game after the devs said looting garbage loot is boring tedius lame. Now that I know the devs just want you to play their way or struggle then I can finally drop this game that started off good and just went straight downhill. I figured out how to play the game the way you want it devs, the game is not even that hard it's just players are forced to play a type of way to succeed and that's just lame. Forget about creativity and finding your own way to have fun with the game, just play exactly how the devs want or they will nerf and remove things so you cannot do it anymore. If I knew the game was gonna turn like this, I would have never bought it and moved on to something else. Truly tragic.",
      "voted_up": false,
      "votes_helpful": 103
    },
    {
      "review": "Wow! This game almost gets it perfect, but the one word that sums it up is \"unfair\". I have wasted about 80% play time to dying and trying again which is the worst kind of grind because no progress is made, only virtual progress learning what not to do again. The nice thing is that it's open world so you can just try something else, right? But let me tell you...it just gets harder. Everywhere you go, it's 4 bandits, or 6 wolves, or 8 wasps, or 1 charging boar. I'm one dude, come on man! I don't appreciate having to kite mobs out to another tile to break them up every single fight, or dodging in and out of dungeons to make it 1v1, it's soooooo tedious.\n\n50 hours in and rerolled the game once, learned to really pinch pennies the second time through. Well I'm stuck as level 6 with basic gear again, for some reason the gear is outrageous cost for only +2 dmg and then hits you with negative stats too, you'd think after 50 hours you might be using a different weapon than a Training Crossbow. Every point of interest is just about impossible. Tried 5 different POI 10 times each, died every time even when carefully kiting, some stupid thing happens like madness or running out of bolts. Rarely I might clear a POI, then only get junk loot. All the loot is junk. The loot values depicted are a fraction of what they are worth at vendors (why do this?) and most loot is broken so they won't even buy it. Broken loot should have gray nametags like in Diablo to indicate junk. Skinning rabbits is more rewarding than eradicating bandits and taking all their stuff? The Risk vs. Reward is very lacking, road bandits drop nothing and they're all over the place draining your resources. There's nothing you can upgrade with out of the thousands of items I've seen drop. I even got numerous green and blue unidentified items which only when identified with a 10g scroll, revealed that they were broken and worthless, as usual. Went back to the starting town and died there too, several times. Made 1 hour of progress in 4 hours. Why is it so difficult?\n\nAfter reading many reviews it appears the save system is a major complaint, on top of always being outnumbered, and having to reload to a 2 hour old save. However I don't think an RPG of this nature should have quick save or save scumming. Sleeping at inns and caravan gives this game it's character and immersion, but the slogging across 5 tiles of terrain on foot (multiple times because of dying) because the fast travel cart can't get you there requires a compromise. Fixing the bedroll could resolve this. It costs too much and takes up too much space, but forgoing it results in the majority of hours wasted and frustration. The bedroll is simply unbalanced. Reduce the cost and inventory size of the bedroll, make it multi-use or once per day. Or let it last 5-10 days, not one time use, so that you can lay it down at a dungeon entrance to free up space before going in and it will be there when you escape for a save and heal up. Or campfire allows rest (save but not sleep) and reduces ambush. Combine campfire + bedroll for best camping.\n\nAs it is, with always being outnumbered, high cost of items, and reloading hours of lost progress, I cannot say I recommend this game to anyone. I don't know anyone who would enjoy it in the shape that it's in. But it's almost there, and still early access, and I hope that in the future I can fully recommend it. I wouldn't say anything needs a complete overhaul, but something is just off with the difficulty. Roughness is a better word, and it just needs a bit more polish to make the Shard nice.\n\nRather than overhauling or throwing in whatever the players are calling for like quick save, or cheaper items, or a difficulty setting, I think the game mechanics are already in a 95% good place and just a few small nudges in certain directions can fix the overall dissatisfaction. For example, if only the road bandits dropped loot with some value, that could fix a lot of problems, letting us buy/use more tools to tackle groups. Or if the bedroll was smaller or cheaper, that might also fix a lot of problems. Or if the player didn't have to use tedious cheese tactics all the time, perhaps the player just needs a few more tools that work better, like what I noticed with caltrops is the enemy just goes around them.\n\nA level 6 mercenary thinking \"I should kill this rabbit over here instead of those bandits over there because its safer and I'll earn more money on pelts\" kinda throws off the concept of the game. I returned to the first town and can't even solo a Boar (you know those piggo things that put up a snarl but die easily in every other game), when I get the jump on it with Take Aim then unleash War Cry, Impaling Lunge and spear attacks, it never dies.\n\nDying and having to return to the drawing board is a great part of this game don't get me wrong, that's where my love is at for it, since you get to cross different fields and hunt for pelts or gather food/herbs, search around towns more for info, powerups, and alternate quests, and all these towns are unique with their own lore, locking in that backstory and growing more fun as you get become accustomed to the regions, the people, and how to navigate better.\n\nThe pixel art is amazing, highly expressive characters some of the best I've seen. Rich NPC dialogue and them \"living a full life\" is very immersive. Music and sound effects are top notch.\n\nThis game reminds me of Diablo 1, Low Magic Age, Skyrim, War Tales, and Darkest Dungeon. For clarity, I really disliked Battle Brothers combination of RNG \"miss miss miss\" and attacks of opportunity making otherwise tactical combat a throw of the dice. Attacks of opportunity are way overpowered and should not appear on all characters at level 1, it's more of a mid to high tier skill. In Final Fantasy Tactics they did not even have attacks of opportunity until obtaining the highest level Monk skill \"Hamedo\" and even then it only attacks an attacker, not anyone walking by. When games throw this in as a base mechanic I can only think someone smoked too much of their Smoking Mix today. I understand it's from D&D but in that game at least you weren't 1v8 and could use it more to your advantage. I don't really care if a Bandit is fleeing, let him, he has nothing good anyways. Stoneshard treads a very fine line between what I like and what I don't.",
      "voted_up": false,
      "votes_helpful": 63
    },
    {
      "review": "A great game — but it leaves you with more questions than answers.\nIs it really possible to make a “perpetual motion” game — something that keeps making money for decades with almost no effort? Apparently yes. With AA-level sales, they’re still releasing content on the level of “added two new upgrade branches in a 2D game.”\nSome might say, “They need to fix the balance!” — except there is no balance to fix, and anyone who played enough will tell you that. And with hundreds of thousands of sales, why is there still no proper campaign, just 5–6 short missions?\nSeems like the devs — with rather questionable morals — accidentally made a brilliant foundation, then blew all the money in a casino. Now there are two and a half programmers left, adding tiny updates for a bowl of soup, just to make it look like the project isn’t dead and to keep Steam from flagging it as abandoned.\nYou’ll have fun, no doubt about that. But even six years later, it’s still an unfinished mess that will never be completed. Updates will stop the moment people forget about it. Don’t expect this one to ever be finished.",
      "voted_up": false,
      "votes_helpful": 68
    },
    {
      "review": "I really want to write a positive review for this game... I even regretfully recommended this game to my friends.\n\nI get the game is supposed to be challenging and I do enjoy many aspects of the game.  But as it currently stands, the game has many unbalanced mechanics.  The sorcerer is especially broken and unplayable after the latest update. They do get powerful end-game but the journey is just painful and the frustrations will just overshadow everything else positive. Even in the end-game, they can quickly get run over by the enemy range+charger mobs since they show up in groups. It's almost like the developer forgot the game they designed is a single party game. The same can be said for many other \"classes\".\n\nBottom line, yes, it is a good game with great potentials. But after spending 200+ hours trying various aspects of the game, I honestly would recommend people to save themselves from the frustration and anger until it is better balanced.\n\n----------------------\n\nTried several other builds in the game since my initial review for this game... other than range (just bows, crossbows are practically useless in comparison), heavily armors, and shield builds, everything else is just a torture until level 22+, only then, you are allowed to enjoy the game slightly.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "I try to like this game, I come back after months of not playing for reasons I cannot remember, start a new game, get into it, then I die to some bullshit ass thing my little moron pathed into instead of going the way I wanted. I remember suddenly why I despise the game when I spawn back 3-4 hours back in time at the last time I laid down on a bed before completing the 4 or 5 quests I did, the last of which being a stroke of luck and making me quite happy to have completed.\r\n\r\nFuck this bullshit ass save system.\r\n\r\nYes I know sleeping bags exist. Yes I know they are 1 use items. Yes I despise them for taking up 60% of my inventory space and neglect buying them as a result.",
      "voted_up": false,
      "votes_helpful": 93
    },
    {
      "review": "Game has potential but in its current state, it’s a mess, it’s all about grinding to get little to no reward, you go in a crypt full of traps and there is nothing interesting to loot, fight is about luck and running away most of the time, you see two ennemies side by side, you run praying to not encounter more ennemies on the way, it takes a lot of time and almost no fun to level, you can only save in a bed at an inn or in the wild but they are scarce, that means you can do a dungeon run and die on your way back, losing two hours of playing for nothing. Devs are inexperienced they are able to make a great game but they strip all the fun about it so it look like you work at a factory for zero dime.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "Another \"I really want to like this game BUUUT\" review, because that's just how it is - I played this game 4+ years ago for the first time, got into it a bit and then put it aside. Now I came back after all these updates and my opinion just hasn't changed much.\n\nThere's a lot to love - The game's overall style & artwork, the atmosphere, all the survival elements, the RPG character building, the fairly massive world with a crap ton of things to do .... but the gameplay just has some issues I can't get past.\n\nMy biggest gripe: this game describes itself as a hardcore RPG, but SO much of it is tied to sheer chance & RNG and not actual skill and knowledge. Crits, Dodges, Blocks, status effects, general bodypart damage - pretty much everything surrounding combat is based on chances and (frankly too many) miniscule modifiers. The game starts throwing dungeons with like 30+ enemies at you at just character level 7 with pretty much every room housing 3-5 enemies at a time. If you die in one of the last rooms after going through it very carefully for like an hour due to missing/fumbling multiple skills in a row, getting caught in a net and obliterated by a single enemy you beat before without much trouble... ALL of that was pure bad luck. Dying rarely feels like it was actually YOUR fault as the player because you did something wrong, but rather bc the game didn't give you a chance that time. There are barely any things you can do in the first place to change the pace of a fight - with a single character you usually develop a sort of go-to way of fighting and you just repeat that over and over again. Having to just replay these 1-2 hrs over and over until you get lucky is NOT fun or engaging gameplay. Kiting single enemies away from groups EVERY TIME (because you pretty much always fight 1v3+ at some point) which also doesn't quite work reliably anyway is NOT fun either.\n\nAll that would be doable if you weren't alone and tied to a single character build. Something like NPC companions that could fill other roles of a RPG group to actually give you more strategic and tactical options as a player would be extremely nice, but... I don't think we'll ever get that.\n\nThe way the game plays now, you have to spend a LOT of hrs grinding out your character with procedurally generated quests to handle the RNG a bit easier and have some more skills and options during a fight. The game just seems to love wasting your time instead of giving you more tactical depth through other means. If we're talking \"hardcore RPGs\" - let's compare it to something like Fear & Hunger II Termina. A game that actually runs on the players knowledge & skill and gets progressively easier and easier the more you understand about the game and how it wants to be played. The sheer number focus of Stoneshard completely goes against that. Your skill barely matters. I don't even hate the save system by itself, it's the reasons why you die that makes it not work well here.\n\nI wish I could get into this game because there's so much work that was put into it over the years... but I just get incredibly frustrated by how much this game requires you as the player to \"make it more fun\" by grinding the heck out of it instead of engaging with it in a more meaningful way. I can see how a character at like level 25+ could be fun to play as... but how long would it take to get there and would that have been worth it?",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I really want to like this game and I’m basically the ideal target audience for it. But I just can’t get comfortable with the permadeath/save-on-sleep system. I don’t mind losing progress in general, I’ve played plenty of roguelikes with permadeath, but here it just feels frustrating. Every time you die, you have to pick up the same quests again, talk to the same people, explore and loot the same locations, prepare and so on. It’s simply boring after the 3rd time.\n\nIf you don’t play with permadeath and stick to the default save-on-sleep mode, the issue is less severe, but you still have to travel back to the place where you died (and travel times can be ridiculously long) and redo the same dungeon, which gets boring fast, too. On top of that, you need to spend a bit of time preparing and juggling your needs before heading to a dungeon, which makes the whole experience even more exhausting.\n\nCaves of Qud suffers from a similar problem, but it’s way less prominent there. Regardless, in the end I abandoned it for the same reason. ToME has this a little bit too, but weirdly it never bothered me as much as it does in Stoneshard or CoQ.\n\nIn games like DCSS, Brogue or Dungeons of Dredmor, each run feels fresh and different and when you die and restart, you’re thrown straight back into the action without all the repetitive, tedious overhead you get in Stoneshard.\n\nWhat also bugged me: The meat of this game is exploring dungeons and fighting (at least for me) and all the countless other systems the devs introduced are nice in theory and I'm not opposed to them per se, but IMO they overdone it. The constant juggling of all the mechanics (hunger, thirst, multiple factors affecting morale, fatigue, sanity, intoxication, injuries, pain, equipment repair, constant inventory management because it's so small etc.) just gets annoying after a while and keeps you from jumping into the fun parts of the game.\n\nSo, with a heavy heart, I’m going to set this game aside. It feels like it doesn’t respect my time and I hate that, especially since my time for gaming is very limited these days. IMO the design of Stoneshard doesn't pair well with its save system and certainly not with permadeath, which ended up being a dealbreaker for me.\n\nP.S.: I can already hear the “sKiLl iSsUe” morons yelling.. but difficulty is not the point here, although many of the systems I listed are either poorly explained or not explained at all, which is a real problem for beginners. And yeah, sure, you can read up on them and figure out the best ways to manage all of this stuff efficiently (which I did btw.) but what matters, is that in the end it’s still just not fun and tedious. At least for me. I’d rather be crawling dungeons than spending half of my precious gaming time managing my character’s well-being, juggling my inventory and equipment or slogging through the boonies to the next dungeon during early game.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Game is very unbalanced in the direction of tedium and wastes your time. \nThings that need addressing before this changes to a thumbs up:\n1. Economy makes no sense. For a game that's supposedly realistic, the prices of food and lodging would starve everyone. 30 gold for some pancakes? Get real. Everything is overpriced, and the quest rewards are pathetically low. You'll use it all up repairing your gear. \n2. Bedrolls take up almost all your inventory, and break after one day after use. Ridiculous. You can't even sleep on the ground. \n3. Inventory management is terrible. A few leaves of herbs takes up tons of space. The inventory space is tiny, and you'll constantly have to throw things out that you really need. You can get a backpack, but then you can't wear a cape for some stupid reason. If you don't wear a cape or cloak, then your gear rusts in the rain. In days! It should take years. \n\nThere's a good game under there, buried under deliberately terrible balance choices designed to make you wonder what other games you could be playing with your time.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This game is extremely disrespectful of your time. \r\n\r\nThe biggest example of this are massive open areas that you will have to walk on foot, where there is little to nothing to do but scroll to the edge of the map and watch the hopping animation of the main character. If you're lucky you will not stumble upon random bandit encounters which will get stale after a couple of encounters, and exist to pretend that there is something to do while walking from place A to B.  Second example is a large amount of monsters that will murder the second they touch you - no problem in a game where you can save anywhere, or in a game which has reasonable checkpoints. Big problem in a game where you  can spend a long time just moving between screens. \r\n\r\nBoth of these problems would have been solved with a better fast travel system, sadly the game sacrifices fun gameplay loop for a pretense of realism. Other examples of sacrificing fun gameplay for 'realism' include very limited inventory space, intentionally bad UI choices (No minimap, have to talk with the inkeeper, pay and then walk up to interact with bed, have to manually refill water containers, just a ton of needless clicking all around) \r\n\r\nThere are a lot of fun things in this game buried under terrible time-wasting ideas, and ultimately unsatisfying gameplay loop.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "It used to be a though, challenging turn based RP game, that was fun.\r\nThe type where you would pay any mistakes.\r\n\r\nNow it is just a tedious masochistic experience.\r\n\r\nAnd i have been told that it was by design, and that more tedium was to be implementing to make it even more \"challenging\"\r\n\r\nThis is a joke. I bought this game after playing the demo, which apparently has absolutely nothing to do with their expected final product.\r\n\r\nIf i could, i d refund.\r\n\r\nGreat art, enjoyable abilities, engaging world. \r\n\r\nTerrible ideas.\r\n\r\nDo not buy this game if you value your time.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I really wanted to like this game. It has amazing music and wonderful atmosphere, but some of the mechanics are just infuriating.\n\nThe save system is punishing. In order to save the game, you have to spend money at an inn or invest in a sleeping bag. The sleeping bag is prohibitively expensive and takes up about 1/3 of your inventory space. So, if you go out from your save location to go to a mission, complete the mission, and then get killed by a wild dog, you get to start the whole ordeal again.\n\nCombat is frustrating. The game advises you that you are not a hero and to try to break up enemy hordes into smaller groups to tackle them, or to use your environment to your advantage. There don't seem to be many practical ways of doing this, with gangs of mooks being able to swarm me easily. Retreat is not a feasible option 90% of the time - if you are adjacent, you being victim to attacks of opportunity, if you are not adjacent, they can still keep up with you at identical speed. Not to mention that many of the enemies seem to have a ranged weapon or a special ability that allows them to charge multiple tiles at once. If the save system was not so punishing, it would at least give me the opportunity to test some different tactics and strategies without having to walk hundreds of wilderness tiles each time.\n\nThe inventory system is the diablo style inventory system, except, unlike in Diablo, you also have to deeply worry about hauling a stash of medicine, food, and water with you. Many things take up more space than seems intuitive - picking up herbs in the field typically takes two slots and is not stackable for instance. It also needs some QOL updates, like being able to press the autosort while an item is held in the cursor to make it a little better,\n\nThere are many many mechanics in this game, and a lot of things sound interesting, but being unable to really get my foot in the door is preventing me from exploring any of these things further.\n\nThere are some pros to this if these things sound up your alley. I have not noticed any obvious bugs in the game and the developers are active. Many people seem to love this game, so maybe it is just me. There is a demo so you can try and see for yourself if this is something you will like.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "i wouldnt bother with this game until it finally releases. Many minor things have changed so often that it's hard to want to play the game because your build may not even be possible in the next version.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As the game stands right now, I can't recommend...\nIn development for more than 5 years and and some rather odd and tedious game mechanic choices that tries to punish players unreasonably which doesn't make this a fun experience...\n\nLoot system is absolute gar*age... Sorry but why can't you sell in the beginning broken weapons? This would add so much more to the gathering value in the game. At least make it that when you repair at least you can earn more when selling the item renewed.\nAlso weapon stats should be more randomized for a chance of finding per level something decent to take along. Right now numbers are always the same. This should be easy to implement to give a bit of variety.\n\nDurability system is way too expensive to keep up! It feels like you have to grinding always for money with boring quests, repair and be out of money again. This is not a fun game mechanic.\n\nWhy some food costs the same as a skill book is beyond me.\n \nQuests don't have any decent loot in the beginning or mid game. The death system is really harsh so there should be something more substantial rewarded at the end of a dungeon or whatever. But only getting rope and a few trinkets inside a chest after wasting so much time dying and coming back to clear the place...  yeah... just... nope!\n\nAnd combat... I really tried to enjoy it... but it's really boring... The basic strategy for a long time is just to run away, attract one enemy at the time because you always have to manage your wounds or you will die if just go against anything more than 2 enemies at once. I feel like the power you gain per level upgrade is really lacking. Skills, once more you need to buy books and get people to teach you stuff. But it costs a lot of money in the beginning so this loop of grinding never ends.\n\nAnd caravan companions? They are totally worthless. Just wasted money that could have been used for skills but wasted it on a smith that charges more that the starting village one for repairs... And the hunter can only go out once per 5 days? \nThese are mechanics that doesn't help early game at all. Again, that punishment feeling from the devs...\n\nWhy make the player exiting dialogue shop to access the extra bags for the other loot or craft screen?? Why make this system a pain to deal with?\n\nAnd seriously! Add auto travel by foot on the map! It's so tedious to cross the same region a million times. Add a probability of a wild pokemon/robber appearing on the way and be done with it! But if the path has been clear before it should be safe to travel and so on. \n\nThere are a lot more points I could go on but my overall experience when playing game at the end of the day is, \"enjoyable or just a grind fest?\" \nIn this situation the game as too much of a grind feeling, slow progression, lacking UI visuals, path finding needs better work,  combat system is meh, inventory need more appeal. \n\nHowever this has potential... or should've had... I mean 5 years in production since released on steam and this is the state it's in... It's a very rudimentary game for the asking price and I can't recommend the game in the state it's in right now.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "It was a unique experience. \nBut the game seems to be changing in weird ways.\nWhile character selection goes on about custom character creation only being a thing after beta. Yet we are adding extra free DLC for characters? Something bare bones for custom characters would have been much better.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is certainly something... not a good something tho.\n\nIt has its pros and cons like every other game ever but damn if the cons are the most baffling decisions ever, they cripple the experience to the point that it feels more like I'm dragging myself to a torture session. It really feels bad. For instance, some of the cool parts of the game are:\n\n- Visually-wise, It is beautiful, gorgeous, mesmerizing, the art is just something else.\n- The combat is kind of cool, with in deep mechanics and events (there's nothing more satisfying that hitting a critical, watching the enemy melt and their friends run for their lives).\n- The amount of status effects and stats is really cool.\n- The procedural nature of the game makes it dynamic and the dungeons feel fresh every time.\n- The caravan is a great HUB.\n\nBut then, you get some of the weird decisions and issues like:\n\n- The skill tree and the skill points of your character cannot be re-assigned EVER. So if you, by chance, were not a professional player at the start of the game, your character might be doomed to be soft-locked due to combat incompetency. (people solve this with Cheat Engine).\n- The combat can be a drag: most of the combat can be resumed in \"potion shoving\". You tank, get absolutely wrecked then heal and repeat, it gets old really quick.\n- [strike] The game doesn't allow you to get an in-game clock, but then will ask you to complete a quest in a period of time, some contracts that must be completed in a day. This is the definition of baffling design. [/strike] (read developer response).\n- Difficulty is all over the place: tier 3 difficulty is 10 times harder than tier 2 difficulty, mostly due to the amount of enemies you have to fight.\n- Difficulty, again: what's the deal with animals in this game, they're near impossible, a bear can kill in 2 hits (turns) and can tank 40 hits (turns) with tier 3 gear, so why the fuck is there a quest to haunt bears in the starting area?.\n- The save system: is bad, i don't think I have to elaborate, It's just that bad, thank god you can \"Scum Save\" from the game files.\n- [strike] The turn-based system makes no sense sometimes: enemies can easily cheat the system (you too and it makes no sense), you can get hit while running away from an enemy; for instance, you use a turn to move away - the enemy then moves near you AND hits you at the same time... What in the actual fuck?. [/strike] (RNG mechanic, read developer response).\n- The loot feels meaningless and useless: you don't get much useful loot in the dungeons, almost nothing, everything must be bought from the towns, dungeons are there to get things you can sell and to complete contracts. This leads to player not feeling rewarded for their adventures.\n- The community is the most unbearable bunch of wanna-be high effort, low IQ \"git gud\" souls-like scum that you can find out there, edgy guys with too much free time... (actually not all of them, some folks are actually helpful).\n\nThe developers want a \"hard-core experience\" which means: our game is full of inconveniences for the sake of it. Okay, make it the default difficulty, but at least give an option to make the game playable. I really want to like and play this game. I wouldn't have poured 30 (53 edit time) hours into it otherwise, but the developer doesn't want people to enjoy it, and no, it's not that the game it's \"not made for you\" is just that the game it's not made for anyone. (shout out to the guys with Stockholm syndrome, me included)\n\n(edit: wording and formatting)",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Update: \nIt does get better. I don't know if it's just sorcerer class that is extremely rough at the beginning but as you unlock more stuff you can survive a bit better. It's still super bs at times and I still have to fight while running away but I don't see that ever changing. \n\nI still think there is a lot to be improved and balanced but as mentioned in my original review there is something redeeming here. It's clearly a labor of love but it needs some work. It is early access ig but it's also been in early access for 5 years. \n\nI'd like to leave a neutral review but since that isn't an option I'm leaving it at not recommended because I think unless you really like extremely punishing games and are willing to put up with some unfair situations, this is probably not for you.\n\nOriginal Review:\nI like difficult games. This game goes beyond fun difficult into frustrating difficult. I have to take every single fight like a complete coward. Cast a spell, run, gain distance, cast spell, run, gain distance, repeat infinitely. Make one wrong step and you get stunned, confused, or scared stiff and you are dead in 3 hits then back to the last time you slept (an hour or 2 ago). You can bring a sleeping bag and sleep before you think there will be an encounter, good luck predicting that. It also takes like 9 spaces in your inventory and is single use. Sleeping bags should be a single slot in size and stack if they are going to be single use. After 15 hours of play time, I have a single level 3 character and I've done one single main quest that took like 6 hours of my life and 5 deaths to complete.\n\nI'll probably keep trying because I hate myself and despite it's frustrating systems and balancing issues, there is something redeeming about it. This could be an 11/10 if they balanced a bit better and changed the save system or sleeping bag size/use amount.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I like this game, i like the premise, i like the many systems, i like alot of things, but at the end of the day there are so many questionable decisions that just plain ruin the experience for me, the main one being the god damn inventory , its so small that it irritates me to no end, also not being able to stack certain items is absolutely infuriating, oh you have 2 berries, guess that takes the same amount of space as a fucking AXE.... You can only save by sleeping so i hope you like HAVING HALF OF YOUR INVENTORY TAKEN UP BY A FUCKING BEDROLL.....",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Been waiting years for character creation and it never came.  Can't recommend.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Really want to say its fun but honestly being hit with a negative mental trait every 10 seconds while the enemy spams mental debuffs is just a ridiculous mechanic. 3/10 probably will not replay after i finish it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "每年更挤牙膏一样的更新内容，换一换立绘改一改数值就是一把新武器，明明买断制的单机游戏内容但做的像平衡数值的网游，这坨大粪谁爱吃谁吃\r\nEvery year it's like squeezing toothpaste out with updates, just changing the character illustrations and tweaking the values is treated as a new weapon. It's clearly a single-player game with a buyout model, but it's made like a balance-adjusted online game. Whoever likes this pile of crap can eat it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Oops, the thumb went down.\r\n\r\nAfter stressing over a very limited time to complete a mercenary contract (even though I didn't haggle, which means a limit of 3 days not 1), dying about ten times, redoing thing I had already done, negative morale statuses and various wounds crippling the character's performance, I asked \"am I having fun?\"\r\n\r\nThe usual explanation for the player's poor performance is \"You are just one ordinary person\", but this does NOT hold up when you are still expected to be a One-Man-Army. This is not Hellish Quart, you are not duelling one equally tough foe, you are against multiple with no backup.\r\n\r\nThe economy is heavily against the player to the point that very dangerous contracts are the only real means of decent income, the fights are horribly in favour of the enemies in many cases, then the save system means if you DO manage to succeed, it will all be undone when five minutes later poor luck kills you and all progress is lost.\r\n\r\nThere is a limit to someone's patience. This game will find it for you.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "RNG nightmare game, lol imagine your a \"hunter\" and your confident enough to do mercenary work, yet 80% of your arrows fall short or miss completely  Good luck killing 1 bandit in this game of laughable RNG. \n\nI prefer playing games that require skill, that you progress because of your own Agency, not some RNG under the hood mechanic you cant control. \n\nAlso don't give quests to New players they they cant go straight to and complete with a little work and basic understanding. that's a terrible way to kill a player base.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not sure how to play this game. Get rekt in the first dungeon. 1 enemy is tough, 2 most likely i die, but then i encounter 4 at once and just die. Honestly no idea how to play this without watching tutorials for hours, but it's not fun and I want to enjoy the game on my own. Tried shooting with a bow, not even a single hit landed ever. Wtf is this honestly??? I mean i get that it's supposed to be hard, but this is just confusing.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A deeply flawed jewel. Beautiful art direction, a deeply intricate world, but the game mechanics are jarring, unpolished and aggressively random. \r\n\r\nThe game is punishing to the point of not being fun, with combat being particularly unfair. Sometimes you will steamroll a pair of monsters, sometimes you will miss every swing or strike while they crit you back to back, and then you have to replay an hour or so from your last save.\r\n\r\nThe game appears to be permanently  in early access. Overall somewhat disappointing product at the moment, because there is something truly special in here somewhere.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The combination of save system and unpredictability often leads to a waste of time. Not for me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I want to love this game, but i cant bring myself to hate myself enough to keep at it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Babysiting morale and sanity , tedious camp upgrades that take for ever , there is unnecessary time wasting with traveling to and back to objective, the good equipment is locked behind reputation and boring fetch quests. Also good luck if you made a mistake with your build , there is no respec option. Made a mistake while understanding the game ? Good luck with the next character. Another time waste.Save mechanics are also very punishable , you need to sleep to save - which is tedious, sleeping bags takes too much space in inventory to be functional.\r\n\r\nIn other areas game is quite good , nice music , nice pixel theme , good atmosphere , dungeons are made nice , nice gathering and hunting mechanics, crafting and food cooking.\r\n\r\nThe game has many nice things but those make it like 30% of the game , 70% part of the game feels like a chore and intentional time waste. Its hard to even impossible to sit in the evening to play this game for 1hour. First you have to do your chores :clear the roads , buy supplies for the dungeon , manage your morale and sanity then head out. After completing the quest you must go travel back again and if you die while traveling back , its all over again. And it can happen because lots of things are rng based. And if you made a mistake with character development while learning , guess what ? Better luck with the new one , because there are no skill/points respec , another time waste. As a open world rpg this game feels very linear because there is only few metas how to play it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "There's not enough and the game compensates it with brutal and unfun attrition. I would much prefer a two hour game over a twenty hour game of \"oh my character is hungry... again.\"\n\nOh, and the talent trees are ridiculous. Who cares about a 2% change to some variable? (Unless it's crit.) I have to read an entire essay of \"changes x thing\" bits from a talent tree that amounts to next to nothing in the actual gameplay. Again, same design philosophy as with other systems - making a lot from very little.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It took 8 years for official work to begin on character creation, and that feature still isn't here.  Its a beautiful game with a lot of work put into it.  I'll change my review if they make good on their word.  I don't trust the strange way devs \"test the waters\" for paid characters by releasing new free \"dlc\" characters all the while promising that we can create our own.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have mixed feelings about Stoneshard. I have played this game off and on for the past five years. At one point I completed what they had available and thought \"Wow, that was great, I'll come back when they've added more\". Two years later I go back in and it is BRUTALLY worse. \n\nOriginally I could play any character and find a good build that would get me through the game comfortably with some skill. NOW it doesn't take a good build and skill it takes THE BUILD. Apparently you can only use spears now because all the ranged weapons have garbage accuracy, all the enemies hit like trucks, dodging only avoids some damage some times unless you perfect dodge, blocking will block one hit before you have to build up block power so don't bother trying.\n\nThe list goes on about how useless so many aspects of the skill tree are now. Basically you may as well focus medium armor and spears with maneuvers and stances otherwise 80% of the time you're gonna be SLOGGING through this game at a snails pace trying to keep distance while slowly killing 2 - 3 enemies at a time. A character with a spear can pierce through most mobs like they're swiss cheese without even taking a hit most encounters.\n\nDon't bother hunting either the animals are all ridiculously OP and require a ludicrous amount of investment in traps and quite a bit of luck to kill.\n\nGo do the main quest, go do contracts and then be done because the game isn't even half finished after five years.\n\nIt has good bones but the state of things now is a very broken game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "What a trainwreck. I got 2 characters to level 30 and have most of the achievements. Interesting combat system, but this game features Tiniest inventory ever, tons of pointless micromanagement of your character state, and lots of just carrying items around from vendors to your base storage.\n\nMods looked promising, but they break some skills, and the devs have no interest in fixing that. Add to that the very slow delevopment velocity and the answer is clear: find another game to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This has to be. Single handily one of the biggest waited for Game, And, Biggest mistake i've ever brought. \n\nOn one half. Ace update. Really good world building\nOn the other? Still. No custom charatures. Period. And that was Promised Yeearrs ago.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I tried this game for several hours and quickly realized it practically forces you to camp exits all the time.\nEarly on you have absolutely no useful abilities and you gameplay loop revolves around:\n- Peak corner\n- One enemy aggro'd? Good, easy 1v1.\n- Two enemies aggro'd? Death sentence, run for the nearest map border or the dungeon exit, so those enemies lose track of you and return to their original spots in the dungeon\nI even tried spending most of my early cash to grab 1-2 extra pieces of armor / equipment from the merchants to boost my protection, and setting traps, but you just get owned constantly with close to no utility in the first 3-4 levels.\nCan't be bothered to grind further, considering the amount of trash that drops from each dungeon and barely any gear worth bringing back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really like the game and idea, and the art of course\nbut walking from one area to the other is an absolute uneventful chore\nwill come back if theres some sort of fast travel to at least discovered locations",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Serious time waster, avoid.\r\n\r\nInteresting game, with lots of neat crafting and itemization but for some odd reason the devs thought it would be a good idea to make the game punishingly hard in the beginning.  Literally every 2v1 is fatal.  And when you die you have to go back to your last save...Oh and it's EXTREMELY hard to save in this game...basically you can save in town or if you use a bedroll.  So you basically have to save outside of the dungeon area using a bedroll and if you make any mistake and die, you have to start over.  You really can't run away from anything like you can in games like Kenshi.  So any situation where you are overmatched = start over...and you're overmatched in most situations unless you can spot the enemies and avoid them before they see you.\r\n\r\nI suppose there are masochistic gamers out there that have endless hours to spend retracking their progress over and over and over but I'm not one of them.  My 120 minutes of playtime was spent just replaying the tutorial, trying not to die and then venturing out of town a few times only to get killed by dogs or bandits and end up right back at the start of the game.\r\n\r\nI know there is a trend among developers now where they are trying to differentiate themselves from all the boring theme park sandbox games out there by promising their games are \"super challenging\" and \"unforgiving\" but most of them fall short and are just repeating many of the mistakes Japanese developers made back in the 80's and 90's on the old Nintendo.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game lures you in with its pretty Artistic Direction and immersion but don't get fooled by its cover, it's not a Strategy nor a Roguelike game (as tagged on Steam). \r\nIt is turn-based but there is no tactical element, it's hit as much as you can and pray you don't get killed before your enemy(ies)\r\nAnd yes, given it wants itself to be realistic, almost everything is as strong or stronger than you so you will die (many times) but simply because the game is punitive and unforgivable, not because you lack skill or are a tactical wiz. Strategy boils down to engaging an enemy correctly and praying they don't have a group hidden past your field of vision otherwise, it's certain death. The save system is just another gimmick to make the game even more repetitive and frustrating.\r\n\r\nNot for people who only have a couple of hours a day to play and relax, this game is not that. It's a game where you're constrained on where and when you can save, die often due to bad luck, and have re-do and re-do and re-do and re-do and re-do the same contracts/quests until luck gets on your side.\r\n\r\nA lot of it is pretty-looking and well implemented but not well-thought-out, most mechanics are just gimmicky constraints (standard of survival games) that add nothing to the survivalism or immersion of the game (think diet morale), most RPG elements are only to serve you the illusion of choice when in fact, they are clearly choices that are better than others: and therefore the choice is really do you really want to role play and increase the already hellish difficulty of the game or pick the few best character builds which make the game somewhat more bearable. And the roadmap is not going in the direction I would want the game to go (no pets, or companions, etc.). Will shelve it indefinitely after almost 20h, will dust it off in a year or two to see if it has REALLY improved.\r\n\r\nAs is (early-access), would not recommend.\r\n\r\nWhat the game should have at launch:\r\n- Pretty much all most used Mods should be part of base game (UI+, quicksaves, etc.)\r\n- More tactical options, combat needs to be rethought completely (it's a purge at the moment and not enjoyable)\r\n- Companions so it's not constantly a one-against-many battle",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As with some other reviewers, I really want to like this game.  There is so much potential for it to be an extraordinary game.  But in my short time playing the game as a caster, my experience has felt like everything in the game is stacked against me.  While I enjoy challenging games, the things that are difficult sometimes feel like they exist just to ruin the fun of the game for me.  Short time limits to complete fairly difficult quests (why have time limits at all?).  You cant get into most dungeons unless you have the quest for them so finding places to gain XP can be challenging.  Skills and abilities are difficult to attain and when you do theyre tiny, incremental improvements (maybe make skilling faster or provide larger boosts?).  Its almost impossible to find vendors who want to buy anything from you and when you finally find one, they often run out of gold quickly and it only replenishes if you buy something from them.  During combat, as a caster, I take as much damage from miscasting spells as I do from the mobs and it's tough to significantly decrease your chances at miscasting.  I could go on but, my point is, this game still needs some polish to be anything more than self-flagellation.  I truly hope the developers continue working on it because, as Ive said, it could be an epic game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I kept hoping a fun game and adventure was hiding behind all the annoying, tedious, and unrealistic systems bogging this game down. Then I realized those systems ARE the entire game. These systems are not in place to enhance an otherwise engaging world and story. The world and story are just the window dressing over top of injury, hunger, money, illness, inventory, and sanity mechanics. They are just another way to force you back into menus to micro manage your meters. Success is punished as hard as failure. If you succeed against humans you'll lose sanity for harming humans. If you succeed against undead or casters you're punished. You can eat like a prince but still don't have enough variety in your diet. You can sleep for a week and still not be resting enough to keep your sanity up. You can save a town from certain doom and your reward is enough money to buy a stack of pancakes and a debuff that will make your next dungeon a failure. You can clear out a dungeon full of ghouls but you can barely carry food and water with you. Tedium and frustration are sold as realism. I love the art and I have to give kudos to the devs for creating something technically impressive but there's just nothing in this experience that I can recommend to anyone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great potential. I'll play again when they introduce a more user-friendly save system.\n\nJust started, but I can already tell that having to replay a bunch of tedious content every time you die isn't for me. And based on other reviews, not for many others either.\n\nOther than that, loved the systems, mechanics, tone and aesthetic, etc. - but the save system is just a dealbreaker.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "As cool as the games premise is, almost all the features are just not there, alchemy is still not in the game, crafting is limited to basic food you buy from merchants and the saving system is just plain bad. \n\nthey keep sidestepping the critical issues with the game, in favor of adding new items and magic trees, which isnt itself a bad thing. the problem stems with them making a new system whenever there is an update, instead of using whats already there to make the game better. i.e use crafting recipes for alchemy, a majority of base ingredients are in the game already, as well as the potions themselves. \n\nTLDR. Trailer doesnt accurately show games current state, many features stated are either unfinished or bordering on useless.\n\nGreat potential, wish to see more.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played for nearly 4 hours and I'm already tired of this game. I like a difficult game but this is just frustrating... \n1) The travel time is insane.\n2) Where can you even get food - tried selling gathered items but no NPC wants them.\n3) You finally kill some rufian camp and you think 'yes, boxes to loot!' They are all empty... And then you realize you don't have any bandages left or stuff to heal your body, my character has been hungry for the most part of my playtime. \n4) You get a bow, try hunting some animals: always 1 tile out of range before they fly/run away. \n5) Went for gathering herbs to finally buy some food because I found an NPC who was willing to buy... Did 30 trips to earn 60 coins  -> the inventory space is SO SMALL. \n6) Looked up a way to earn some money by collecting fodder. Farmed 200 fodder and now I read that the developers removed this. \n7) Game has been in early access for 6 years. \n8) Once you finally get some stuff going the game is actually fun to play. Except the cruelty of dying and not having saved your game can set you back hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is hard, but not hard in Souls way, which is hard but fair, but in brutal, unfun, unfair way. As you can read in other reviews, you are GOING to lose hours of progress at a time, thanks to how unfair this game is. Dont get me wrong, I like my games difficult. I love overcoming adversity with either meticulous planning, considering every possible strategy and using skill or through sheer dumb luck, but when adversity is combined with save system where you can loose HOURS of progress because of single off chance of your character missing 4 attacks in a row, while almost dead enemy hits every single one, changing your (almost) full health character into a black screen and reload, then thats neither fun or fair. I love this game art style, I love gameplay (excepts saves) I love map exploration, but these things cannot be enjoyed when you are forced to go through same encounter and same biome 5 times in a row to just die in some crazy way again. If there was somekind of limited quicksave, like in KCD, where i can use coins to buy me a save slot, then I will change this review to positive and give this game proper playtime it deserves.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game does not respect your time. It is beautiful and I respect the developers for their hard work but the experience is like pulling teeth.\n\nI really want to like it but I take one step out of line and it kicks my teeth in and decides the past 40 minutes of my life didn't happen. I am not someone who just looks up optimal builds or guides as I prefer to experiment but this game is designed perfectly to waste my time for attempting this.\n\nAs a fan of rogue-likes I can understand this game's design ethos but the thing is the game is so dreadfully slow, I do not want to have to repeatedly arrange a bank loan and talk to the butcher and the tavernkeep and the twenty other very specific merchants for very specific items repeatedly before I can even begin the slow march cross-country to even make it back to the actual dungeon, die and do it all over again.\n\nAfter several attempts I am giving up on this game, at least for a while. And am writing this to air some of my grievances.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "There is a very thick line between what is difficult and unfair.\r\nI'm a gamer who loves difficulty in video games, complex mechanics, and games that force me to think. Stoneshard has all of this. The problem is when the game makes the big jump from difficult to impossible. I'm going to tell you something that happened to me. I was in a dungeon with my rogue finishing a contract, everything was going quite well, I had carried out many heals, food, etc., to my surprise the dungeon was full of good loot, blue items, ancient coins, I even found 1 gold plate and 2 containers for 1-slot items, the perfect run I thought, it was quite long and I had gone quite deep into the dungeon, it was quite long, after having cleaned it and completed the mission I prepared to leave it, to my surprise the dungeon had revived almost 8 of the enemies, I know the dungeon revives zombies after a while, but 8 of them, and they were all together, since I was well inside the dungeon it was impossible to simply run away, and I had already spent all my resources, the perfect run, studied and strategically played went to the trash along with all the loot (which by the way I never got again in any other run) all because of the terrible design of who You know how many idiots who developed the game thought it was a good idea to revive an entire group of enemies in the middle of a dungeon?\r\nIt's impossible to recommend a game that wastes so much time due to poor dungeon design.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not a bad game but still they all have the difficulty brutal asf at the start. If ya manage to get past the first two levels congrats the game is now semi fun to play. Except some skills and builds just feel like shit lmao.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Latest in a long line of \"dying is fun\" style games except in this one it isn't even vaguely fun. Remember DnD mages with their 1d4 starting HP? and the goblin with a crossbow that does 1d4 Hp damage? That is this game in a nutshell, constant deaths with very limited ability to save and reload. Who knows what the later parts of the game are like because i haven't the patience to restart a hundred times and repeat the early game tedium to get there.\n\nEdit: tried to get my money's worth by playing more but ultimately the game isn't playable until they balance the game and put in some kind of pacing. Save your money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Better that the game had an engaging 6-hour gameplay instead of being stretched to 24 hours with boring mechanics like, \"oh, my character is hungry\"...\n\nTalent trees do nothing except give 2% changes to some variable? Yet there's a whole essay about \"changing something special\" in the talent tree that practically means nothing in real gameplay.\n\nSaving is a separate pain — if you die, the nearest save is 1 or 2 hours old!\n\nAuto-leveling is worse than in Bethesda games: random one-shots from any enemy, and for some reason a tiny inventory where you have to carry a bunch of useless items by default.\n\nPiles of mobs in dungeons with no way to run away from them.\n\nThe game is beaten by grind, not skill (random damage rolls — mobs can one-shot a fully leveled character?!)\n\nBuy \"Battle Brothers\" instead.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know this game is still in early access, but so far the game feels like I'm spending more time keeping my morale and sanity levels up than anything else. Hunger and thirst are easy enough, but otherwise it's like I'm playing this wellbeing simulator where I'm juggling food, thirst, morale, sanity and toxicity. I'll literally spend more time trying to get myself set up to go into a dungeon or approach a base than I will making any progress on said activity. And if you get injured too badly and one of those bars gets too low, guess what? You're spending all the profits you made from your last outing buying things to get your body/mind right. On top of that, everything is extremely expensive to buy and maintain, making it feel nearly impossible to make a profit on any activity. The shop owners buy different items at different prices, so if you accidentally sell a wood weapon at the blacksmith or something like that, you're shortchanging yourself, but it's also time consuming to run around to each one figuring out where the best prices are, especially when they move around their shop, requiring me to chase them down. I had some minor success getting a perk that let me collect pelts and selling those, but I still had to make sure that every encounter was carefully tilted in my favor or I'd lose money or die. I think they went too far to one direction on the fun vs realism seesaw.\nThe perks don't feel like they offer enough to justify taking most of them, especially with how hard it feels to level, and in order to progress further in a skill tree you need to put points into specific stats, which feels like it pigeon holes creativity. I also dislike how the devs seem to be so against any possibility of upping the level cap, I feel like I need so many perks just to be able to survive, or cast a spell without it backfiring that the first several perks are just required no matter the build.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have 2 major issues with this game:\r\n1) You cant save manually whenever you want;\r\n2) No difficulty mode settings;\r\n\r\nThese 2 things hurt accessibility for casual games like myself, really dont understand why some modern games trying to implement mandatory \"souls\" punishing mechanics without offering players a choice. Just add those 2 things I mentioned above and this will increase the player base and of course sales.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this game is meant to be hard.  \"hard\" to the devs means getting hit once puts a significant enough debuff on you that you cannot fight back and every subsequent hit puts even worse debuffs on you.  enemies do not suffer from any of these.  you are also not allowed to save unless you pay at an inn, so death comes quick and then you get to repeat hours of talking to people or exploring the world.  give this one a pass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great but i've been waiting for it to come out of early access to be able to invest time on it without the fear of losing my progress due to an incompatible update but it's been 5 years and the game is still in early access with no release date (as far as i can tell) If you're interested i recommend waiting for full release if it ever happens. I'll change my review if it leaves EA some day",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only played this a little, but even so I had a pretty strong opinion. Let me say this first: I have no respect towards rpg games that try to pose as a hardcore difficult rpg by creating artificial difficulties outside the game and try to sell it as immersive. Aspects like quality of life and inventory management should never be part of the difficulty. You have a very limited inventory that fills up really fast, and you gotta carry a lot of stuff with you so half of it can't be even used. And then the same items don't stack so each and every scroll takes a whopping 2 slots in your inventory, never mind all the food and drink. And then when you find some usable item on the ground, you can't use it directly. You found a book? You can't just read it there, you first have to make space for it in your inventory, then loot it, then use it in your inventory. Same goes for every other usable item aswell. If this design is made so the game feels like a difficult rpg, it's just a tasteless, bad decision that kills whatever fun there might be. Even in prologue I ran into this problem, so I can't imagine how bad it becomes as the game expands.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "absolute incredible addictive game, but this moral system completly destroys the joy and fun of this gem. get rid of it or put it in another difficutly for players who like it.. no clue who comes up with such an annoying system.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like the game and know its early access but Its hard to recommend this game, theirs allot of work to make this a game worth playing hopefully they finish the game and will change the review but right now Its like a 4/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "BLUF: This is completely unbalanced.\n\nMy friends and I spend hours testing out different built and starting characters in the game. The result, only built with high defense with a shield work well where you can deal with four or five enemies one after another. Sorcerer or magic built is complete unplayable unless you like wasting your life. two-hand weapon built also only work if you have excessive high defense. \"Defense not dodge.\" So no, dual wield with dodge is also a waste of your life. Range weapon only work in specific built as long as enemy can't hit you.\n\nOverall, I do not recommend this game to anyone unless due to imbalance of playability.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a great game for the most part BUT it is brutally hard. Which i don't mind but when coupled with the games save mechanics this game is soul destroying at times. If you buy this you have to accept that will be repeating the same hour of game play over and over and over. Its maddening! You can only save by sleeping or resting which costs money in a tavern or by buying a bed roll which are very expensive and forget about crafting them as it needs a medium or large animal skin and animals kick you arse pretty much every time. So you end up going a long time with out saving and so the cycle repeats its self.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game almost nailed it.  It is an overhead'ish turned based rpg. Alot of the systems are good.  Combat is fun, music and sound effects are good.  Graphics are passable.  This should be a game that easily gets a thumbs up.  So why am I giving it a thumbs down and a pass?  \n\nI guess the developers wanted this game to be overly difficult.  I am all for a challange and a difficult game when it is done right and is fun.  They made so many tedious things and the game just turns into an unfun chore.  Your inventory even with a bag is annoyingly small.  You constantly have to eat and drink.  Not realistically where one meal would be fine during a day, no you need to constnatly scarf down steaks and other food.  And if you dont mix up the food variety enough? you get depressed and it debuffs your character.  And there are many more annoying things in the game that just ruin the fun of an otherwise very promising game.  I would give a hard pass to this game, it may seem alright at first, but once it sinks in, you realise it is just a waste of time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is five years of early access? I play games like Quasimorph, Battle Brothers, etc...this is just a whole new level of unfair; plus with the saving system sucking it zaps most of the fun out of \"hardcore\", it is a maybe recommend when more updates roll out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a roguelike, at all. Remove this tag.\n\nOnly 3hours and already tired of the moving/traveling system, so much time wasted for nothing...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unfair more than hard\n\nlose 20 - 30 minutes of gameplay because bad rng or too much enemies spawned it's a big NO\nMy time worth more than this shit designed game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a nice low latency OLED 1440p gaming monitor, so I am not able to comfortably read the text on the screen. If I ever become homeless and end up living in land fill stuffed with late 90s computer monitors I will rebuy this game because at that time I will have the trash to play this trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game looks great. It has a lot of potential by looking at the trailer.\nHoneslty I played around 10 minutes only because the white UI dot following the cursor and the lack of walking animation made me crazy. But if you arent that kind of person thats bother by this, go ahead it will be great once its finale release.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not sure i can recommend this. Fight 6 people and destroy them all, fight some farmer with a stick get killed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like the longterm direction they want to take is Battle Brothers, but with a more tedious global movement system, more magic, no innate automatic-weapon-attack-skills, and a bit less tactical depth due to its focus around you as a singular character.\n\nThere are ways this can work well, but I think the introduction to the caravan mechanics feels a bit... arbitrary and rushed (and not necessarily what I wanted). I also find it kind of strange that we're meant to be a normal person, but we also decide to take on solo jobs where we murder 6+ other people in rapid succession. Wouldn't... it make more sense to be part of a larger group if we're a normal person trying to make our fortune in the world?\n\nEconomically the game functions okay, but I do find it also a bit tedious to time myself with NPC shopkeepers, and to move from X to Y, but that isn't a terrible thing by itself, though if a chunk of my day is meant to be spent shopping, I'd like the interaction to be a bit deeper.\n\nI'm also sad there's no character creator.\n\nIf the game had more rapid development, I'd be more optimistic, but while it can scratch an itch, I think it's not quite what I had wanted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a game with good bones and could be very fun but the balancing and scaling needs work. the progression of enemies getting harder happens in sudden stages so rather than organically levelling you hit plateaus where you need to suddenly go back to level 1 mindset to move around the map. Also understand that it there is an rng element but regularly feels that encounters rely solely on whether the dice are with you",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to like this game. it definitely has potential, especially as a co op game. As it stands they some how figured out to make a game with 2D graphics and give it 1D combat. The only strategy is run and shoot and try and face enemies 1 at a time. While adding in that its extremely broken and you will die a lot just trying to achieve that singular level of combat.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's just not very fun tbh",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}