{
  "positive": [
    {
      "review": "It's a nice idle game... but I can get really complex when you start to reach higher levels. Characters synergy, specializations, positioning, modron cores... be ready to spend some good time trying out different comps and failing.\nYou can have Baldur's Gate 3 characters, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most appealing feature of  Idle Champions of the Forgotten Realms is that the game plays offline automatically even if you turn off your computer. Items, experience, gold and other stuff are gained idly. Extremely time-saving for students, housewives and employees!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I uh....I think I may be addicted to this game. Every time I get up for work, I always think \"I should run my gem farm\". Not \"I should make my coffee\" or \"I should get dressed\" like a normal person. Gem farm. That is my first thought.\r\n\r\nAnyway, jokes aside, I do actually really enjoy the game. There's a fun strategy element of setting up your team to clear difficult variants, prioritising who to work on whether it's your push team, your gem farm team, or a team solely to clear a single variant you're stuck on.\r\n\r\nAbsolutely everything is possible to do entirely free to play, early game can be sped up a bit by spending, and it can make your life more comfortable to have more familiars so you don't need to manually do so much (again though, possible free to play, you just have to wait until you build up enough premium currency from daily logins and then wait for a good weekly offer), and I have no regrets for having spent some money in the game given how many hours I've spent playing.\r\n\r\nThere is so much content to the game, between different campaigns (all of which have a story should you choose to pay attention to it), events, patrons, mount tiamat, etc. Ignoring the time where all I've done is leave a gem farm running, I probably still have hundreds of active hours in the game where I'm strategising etc.\r\n\r\nIt is a very heavy time investment playing this. But it's so worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Something I keep coming back to and just running in the background occasionally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its D&D, I play it for the nostalgia. Good time killer when i cant sleep. i literally only log on, lvl up my teams and log off. doesn't bog me down. I can also sit and play around and learn something about characters that are new to me if i choose. For a free game, they did some research on the charaters and made it fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and casual but harder to get to upper levels if you dont understand the champions you have",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive game, but sometimes needs your attention which is kinda the downside of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Feels good. You don't do anything particularly difficult, just follow a party that walks from left to right and smashes enemies.\n\ndon't forget to check out the jukebox with three seasons of music!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very good auto battler idle game. Its the kind of game you can basically just let run and you will make progress with very little effort. It is not a gacha game but slightly has that element to it as you can get equipment and items from chests to upgrade your characters.\n\nWarning: This is not a game that you will be able to complete in a few weeks and there is enough content here to last for years if you like this kind of game. It has been around a long time and has tons of content to play. Even playing constantly for years will not get you 'everything'.\n\nSecond warning: This game is heavily monetized. You can still do basically everything as a FTP player however spending real money for characters and so forth will definitely make your journey easier. The game itself is FTP friendly but the temptation to spend a few dollars here and there is strong so if you don't have the will to resist real money purchases, best to avoid this one. That being said, there is nothing wrong with spending a few dollars here and there on this type of game if you can afford it and if it increases your enjoyment of the game. \n\nThere are frequently free promo codes with this game for various things, so if you play this, check out a good place that lists the codes because there are usually a couple dozen active ones at least.\n\nThe music is absolutely charming with fully voiced songs that are catchy and fun to listen to as you play - or you can mute it if you want to.\n\nOverall, this is a good game. Most negative reviews deal with the monetization aspect but realistically it is easily avoided. There is plenty of fun to be had as a FTP player. The game is also a huge time sink but can be played in the background and requires minimal interaction. There is also offline progress too. But if you are interested in this type of game, you are likely looking for a time sink, and this game fits that need perfectly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better idler games I have played. You can disable auto-advance for the quests and let the characters grind out the gold for leveling, allowing you to level your characters in an actual idle state. Early game and early quest restarts will require player clicking to help initially build up your characters. It has so far proven playable without spending money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, no buy to win aspects, and once you have progressed a bit you can set things up to be a true idle game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent offline progression. F2P works. Character lore is fantastic. Good nostalgia if your familiar with the characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1 hours in and im already hooked, Idle Champions is a surprisingly deep strategy/idle game with fun character progression and satisfying combat. Perfect for both causal and dedicated players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like clicker games, or the very most obscure of what D&D has to offer, its ok.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never ceases to add new content. One I'll continue playing for years to come.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A nice fanfic which goes through multiple published 5e adventures.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun to play in the background at work lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favourite games whilst being both easy and hard to play at the same time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too many Hours, Too many Dungeons, IS good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't play Idle Games !\r\nBut if you play one, this one is good :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is great, hope it gets better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1 of the best idle games on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have become one with the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good job!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good time killer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a few achievements left…",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(￣y▽￣)╭ Ohohoho.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing this game for a while, and here are my thoughts:\r\n\r\n⚡ 🛑 Performance: For an idle game, the loading is surprisingly slow — even on an SSD or M2 MacBook. Since idle games are all about maximizing time and smooth check-ins, long loading game application and screen really hurt the enjoyment.\r\n\r\n📱 🛑 Cross-Platform Limitation: Sadly, the game doesn’t connect to mobile (iOS/Android). Idle games shine when you can continue progression anytime, anywhere. Being locked to one environment breaks the whole \"lifetime progression\" loop that’s supposed to make the genre so satisfying.\r\n\r\n🎮 🟩  Gameplay & Story: That said, the progression, story, and mechanics are genuinely enjoyable. Building up your party, unlocking champions, and seeing runs evolve is fun and rewarding. The D&D tie-in adds flavor that fans will love.\r\n\r\n👍 Verdict: Fun mechanics and enjoyable story, but hampered by slow loading and no cross-platform sync. If those two issues were fixed, this would be an easy long-term favorite.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I've been running Idle Champions for approximately a year and a half at this point, and I suppose I should review it already.\n\nThe good: \n\nCharacter unlocks are free. In the current system, every month you can unlock three champions for free, so long as you complete a very easy quest (50 areas, which without any buffs means about an hour of progression). You earn Time Gate pieces in the course of regular gameplay, which you can exchange for the ability to unlock additional champions during events (three time pieces), or any champion of your choice through a time gate (six time pieces). You have the option of paying to unlock more champions, mostly with packs. \n\nChampions are diverse, giving everyone the ability to pick their favourites. Champions are split between famous characters in the DnD canon, characters from prominent DnD campaigns and fan fiction, and original creations of the developers. They come from diverse in-universe races and have their own abilities and mechanics. You can choose to field characters who are all the same affiliation, or all different races, or whatever, and more likely than not there is a champion with a bonus for having that type of team.\n\nVarious mechanics are introduced to make your party (parties, later) stronger. There are legendary items, automation cores with boosts to various statistics, and damage boosts from completing tasks or redeeming in-game rewards. All of these are free, and the pace with which you unlock things increases as your account grows more powerful (for example, I now earn a minimum of seven time gate pieces per week). Overall, it feels satisfying to progress, as you can see a real change in just what your champions can do.\n\nThe meh:\nOverall, the different campaigns are modelled after famous Dungeons and Dragons campaigns, which is cool. In my first few quests I tried reading the storylines, but in the end it felt like they were just there to justify killing 25 monsters or collecting 25 items from said monsters. The gameplay loop is repetitive, with most challenge coming from restrictions that may be easy to deal with or may be painfully challenging (anything with perma-removal, for example). Personally, even with ridiculous iLevels I have trouble with the end-end game campaigns and variants.\n\nThe bad:\nProgression is overall quite slow. It speeds up with the use of potions and other buffs, and there is a new campaign to allow additional unlocks, but in the end unless you are willing to spend real-world money you are unlikely to bring together the full roster within a year. Likewise, unlocking the feats and other bonuses for individual champions is time consuming. I get that this is the genre, and I get that a certain meta can mitigate its impact, but in the end I still ended up spending more than I'm willing to admit to build up my roster. \n\nThe meta is very monolithic. If you want the best damage, there's a party for that, and if you vary it, you'll lose damage. If you want the most gold, there's a party for that.  If you're the type of player who just wants to play with your favourite characters (say, build everything around Karlach), you may find progress more difficult than someone choosing to field the meta.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun and surprisingly deep game to learn at start thinking its just casual idle game, click and upgrade and win, but nah man this game hits different lets say there’s a lot to learn about characters and strategies, and while casual play covers only a small part, the game has a huge “iceberg” of content like gem farming and wall pushing. Complex at first, but simple once you get the hang of it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a nice idle game... but I can get really complex when you start to reach higher levels. Characters synergy, specializations, positioning, modron cores... be ready to spend some good time trying out different comps and failing.\nYou can have Baldur's Gate 3 characters, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most appealing feature of  Idle Champions of the Forgotten Realms is that the game plays offline automatically even if you turn off your computer. Items, experience, gold and other stuff are gained idly. Extremely time-saving for students, housewives and employees!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With regular updates and new characters, as well as some of my favorites (love you Drizzt), this is one good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun and casual but harder to get to upper levels if you dont understand the champions you have",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gave this game a positive review because it has many achievements to collect and various characters and other elements. It's not because of its gameplay. The game only requires players to just sit and wait. I myself have no interest in watching boring storylines.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Idle Champions of the Forgotten Realms is a brilliantly designed strategy management game for D&D fans and newcomers alike. With over 140 Champions from across the Dungeons & Dragons universe, each with unique abilities, players can create powerful formations to conquer hundreds of adventures. The game is easy to pick up but challenging to master, offering deep strategic layers through Champion synergies and formation optimization. Automated gameplay features like Familiars let you focus on strategy while your Champions fight and level up automatically. Frequent content updates and new campaigns keep the game fresh, making it a rewarding endless adventure for fans of tactical RPGs and the D&D multiverse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is good idle game. You can have it running on your second monitor while doing something else (working, study). You dont have to spend money to play the game or have a good stuff. If you have time, you will have what you want here (i spended no money here). Or you can use your real money to have it quick, but it is not worth it. It is up to you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this for a while now, and yes — it can get a bit predictable. But it’s definitely a long-haul type of game where unlocking achievements can take ages (I’m talking months, even years). If you’re prepared for a long grind, I’d definitely recommend it. It’s pretty low-key, though you’ll need to figure out the right character combinations for your party. Getting past levels like 400 or 600 can be a real pain, and it gets frustrating when certain stages limit the number or type of characters you can use — or when gear and unlock bonuses aren’t enough to push through.\r\n\r\nBuilding up enough gems to get familiars can also be annoying, and sometimes even potions don’t give you the boost you need for tougher levels. That said, I like that the game keeps progressing and leveling up even when I’m not playing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I have always loved DnD. Drizzt is the only character i know from this game. From playing console Hack n Slash.\r\nIf the devs could get Vox Machina characters including the Briarwoods.(Love Delilah Briarwood.) or even chacters from the movie?\r\nOtherwise it feels like just any other idle/Time Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive game, but sometimes needs your attention which is kinda the downside of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun and engaging idle game with tons of content! I love the variety of champions and formations you can create. Progress can be slow, but it's satisfying to see your team get stronger over time. A good choice for casual players looking for a game to pick up and play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels good. You don't do anything particularly difficult, just follow a party that walks from left to right and smashes enemies.\n\ndon't forget to check out the jukebox with three seasons of music!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very good auto battler idle game. Its the kind of game you can basically just let run and you will make progress with very little effort. It is not a gacha game but slightly has that element to it as you can get equipment and items from chests to upgrade your characters.\n\nWarning: This is not a game that you will be able to complete in a few weeks and there is enough content here to last for years if you like this kind of game. It has been around a long time and has tons of content to play. Even playing constantly for years will not get you 'everything'.\n\nSecond warning: This game is heavily monetized. You can still do basically everything as a FTP player however spending real money for characters and so forth will definitely make your journey easier. The game itself is FTP friendly but the temptation to spend a few dollars here and there is strong so if you don't have the will to resist real money purchases, best to avoid this one. That being said, there is nothing wrong with spending a few dollars here and there on this type of game if you can afford it and if it increases your enjoyment of the game. \n\nThere are frequently free promo codes with this game for various things, so if you play this, check out a good place that lists the codes because there are usually a couple dozen active ones at least.\n\nThe music is absolutely charming with fully voiced songs that are catchy and fun to listen to as you play - or you can mute it if you want to.\n\nOverall, this is a good game. Most negative reviews deal with the monetization aspect but realistically it is easily avoided. There is plenty of fun to be had as a FTP player. The game is also a huge time sink but can be played in the background and requires minimal interaction. There is also offline progress too. But if you are interested in this type of game, you are likely looking for a time sink, and this game fits that need perfectly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better idler games I have played. You can disable auto-advance for the quests and let the characters grind out the gold for leveling, allowing you to level your characters in an actual idle state. Early game and early quest restarts will require player clicking to help initially build up your characters. It has so far proven playable without spending money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really addicting, even if you dont play dnd. Fun, and the equipment actually shows on your champions. i have played for 4 1/2 hours and im not even half way. they add events to the game, and special offers. the add people like Nixie, Evandra, AND Antrius. really good free game, also you earn free tokens offline, including event tokens!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, no buy to win aspects, and once you have progressed a bit you can set things up to be a true idle game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent offline progression. F2P works. Character lore is fantastic. Good nostalgia if your familiar with the characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good mind numbing game to just kill some time and enjoy the mechanics of the D&D world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1 hours in and im already hooked, Idle Champions is a surprisingly deep strategy/idle game with fun character progression and satisfying combat. Perfect for both causal and dedicated players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Idle Champions of the Forgotten Realms\" — увлекательная idle-стратегия с глубокой системой развития и атмосферной вселенной D&D. Игра идеально подходит для игроков, ценящих постепенный прогресс: герой автоматически сражается, а вы занимаетесь улучшением персонажей, экипировкой и стратегией. Разнообразие классов, уникальные способности и регулярные обновления держат в напряжении. Однако, как и в других idle-играх, прокачка требует времени, а монетизация (покупки за деньги) может ускорить прогресс, но не обязательна. Минус — сложность в начале и частые уведомления. Для фанатов фэнтези и стратегий — отличный выбор.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you like clicker games, or the very most obscure of what D&D has to offer, its ok.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never ceases to add new content. One I'll continue playing for years to come.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A nice fanfic which goes through multiple published 5e adventures.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun to play in the background at work lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for dnd fans and easy to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best idle clicker i have found so far,  love it,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favourite games whilst being both easy and hard to play at the same time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has flavor, complexity, and a lack of urgency.  Set em up, let em ride, come back to collect the rewards.  It is ever expanding, so do not expect to complete it.  There are currently more than 700 steam achievements.   Woot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's lots of content and many systems to give the feeling of progression.\n\nA trickle of premium currency from the daily login allows obtaining paywalled extra stuff but could require waiting for what you want to (re-)appear in the \"Wild Offers\" or \"Weekly Offers\" shops which rotate/refresh.\n\nSome levels require active playing, even though it's an idle game.\n\nThere are quarterly \"Legendary Dismantle\" periods which allow reassigning the endgame progression resources (\"Legendary\" equipment and equipment \"pigments\"). The game scratches an optimization or min/max itch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As far as \"idle\" games go, this is the best one I've found, free or paid. Whereas many games of the genre have simplistic graphics (or sometimes none at all), Idle Champions boasts a mind-boggling amount of visually-unique content. With 150+ champions, hundreds of different enemies, I-don't-know-how-many locations, and hundreds of adventures (in the form of Dungeons and Dragons adventures), the amount of content here has to be unrivaled.\nAgainst all odds for a free to play game, it doesn't feel like I'm being pressed to spend money on in-app purchases either. It's also nice that a game that released half a decade ago is still getting new content every month.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I uh....I think I may be addicted to this game. Every time I get up for work, I always think \"I should run my gem farm\". Not \"I should make my coffee\" or \"I should get dressed\" like a normal person. Gem farm. That is my first thought.\r\n\r\nAnyway, jokes aside, I do actually really enjoy the game. There's a fun strategy element of setting up your team to clear difficult variants, prioritising who to work on whether it's your push team, your gem farm team, or a team solely to clear a single variant you're stuck on.\r\n\r\nAbsolutely everything is possible to do entirely free to play, early game can be sped up a bit by spending, and it can make your life more comfortable to have more familiars so you don't need to manually do so much (again though, possible free to play, you just have to wait until you build up enough premium currency from daily logins and then wait for a good weekly offer), and I have no regrets for having spent some money in the game given how many hours I've spent playing.\r\n\r\nThere is so much content to the game, between different campaigns (all of which have a story should you choose to pay attention to it), events, patrons, mount tiamat, etc. Ignoring the time where all I've done is leave a gem farm running, I probably still have hundreds of active hours in the game where I'm strategising etc.\r\n\r\nIt is a very heavy time investment playing this. But it's so worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Something I keep coming back to and just running in the background occasionally.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its D&D, I play it for the nostalgia. Good time killer when i cant sleep. i literally only log on, lvl up my teams and log off. doesn't bog me down. I can also sit and play around and learn something about characters that are new to me if i choose. For a free game, they did some research on the charaters and made it fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game for background merriment while working. It is fun and challenging at times, but not too challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is buggy, says X needs to buff to do damage, arrow shows buff, character shows 0 damage.  Like the idea, dislike the implimentation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice way to relax and watch my team flatten hordes of monsters without needing to think a lot about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best idle game out there. Im 400 hours in and only about 5% done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has a good idle mechanics the stronger heroes you have the better and has alot of quest lines and have to maintain from taking damage while battling enemies, and has hours of content and can even do daily logins for chest that contains loot, and has events from time to time almost weekly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too many Hours, Too many Dungeons, IS good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't play Idle Games !\r\nBut if you play one, this one is good :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "sometimes she idle on my champion till i forget all over her realm",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It needs more kobold champions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great, hope it gets better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An awesome time passer game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1 of the best idle games on steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have become one with the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Idle RPG Games!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good job!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "plays without playing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Karlach goes BRRRRRRRRRR",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good time killer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a few achievements left…",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "neat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(￣y▽￣)╭ Ohohoho.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing this game for a while, and here are my thoughts:\r\n\r\n⚡ 🛑 Performance: For an idle game, the loading is surprisingly slow — even on an SSD or M2 MacBook. Since idle games are all about maximizing time and smooth check-ins, long loading game application and screen really hurt the enjoyment.\r\n\r\n📱 🛑 Cross-Platform Limitation: Sadly, the game doesn’t connect to mobile (iOS/Android). Idle games shine when you can continue progression anytime, anywhere. Being locked to one environment breaks the whole \"lifetime progression\" loop that’s supposed to make the genre so satisfying.\r\n\r\n🎮 🟩  Gameplay & Story: That said, the progression, story, and mechanics are genuinely enjoyable. Building up your party, unlocking champions, and seeing runs evolve is fun and rewarding. The D&D tie-in adds flavor that fans will love.\r\n\r\n👍 Verdict: Fun mechanics and enjoyable story, but hampered by slow loading and no cross-platform sync. If those two issues were fixed, this would be an easy long-term favorite.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I've been running Idle Champions for approximately a year and a half at this point, and I suppose I should review it already.\n\nThe good: \n\nCharacter unlocks are free. In the current system, every month you can unlock three champions for free, so long as you complete a very easy quest (50 areas, which without any buffs means about an hour of progression). You earn Time Gate pieces in the course of regular gameplay, which you can exchange for the ability to unlock additional champions during events (three time pieces), or any champion of your choice through a time gate (six time pieces). You have the option of paying to unlock more champions, mostly with packs. \n\nChampions are diverse, giving everyone the ability to pick their favourites. Champions are split between famous characters in the DnD canon, characters from prominent DnD campaigns and fan fiction, and original creations of the developers. They come from diverse in-universe races and have their own abilities and mechanics. You can choose to field characters who are all the same affiliation, or all different races, or whatever, and more likely than not there is a champion with a bonus for having that type of team.\n\nVarious mechanics are introduced to make your party (parties, later) stronger. There are legendary items, automation cores with boosts to various statistics, and damage boosts from completing tasks or redeeming in-game rewards. All of these are free, and the pace with which you unlock things increases as your account grows more powerful (for example, I now earn a minimum of seven time gate pieces per week). Overall, it feels satisfying to progress, as you can see a real change in just what your champions can do.\n\nThe meh:\nOverall, the different campaigns are modelled after famous Dungeons and Dragons campaigns, which is cool. In my first few quests I tried reading the storylines, but in the end it felt like they were just there to justify killing 25 monsters or collecting 25 items from said monsters. The gameplay loop is repetitive, with most challenge coming from restrictions that may be easy to deal with or may be painfully challenging (anything with perma-removal, for example). Personally, even with ridiculous iLevels I have trouble with the end-end game campaigns and variants.\n\nThe bad:\nProgression is overall quite slow. It speeds up with the use of potions and other buffs, and there is a new campaign to allow additional unlocks, but in the end unless you are willing to spend real-world money you are unlikely to bring together the full roster within a year. Likewise, unlocking the feats and other bonuses for individual champions is time consuming. I get that this is the genre, and I get that a certain meta can mitigate its impact, but in the end I still ended up spending more than I'm willing to admit to build up my roster. \n\nThe meta is very monolithic. If you want the best damage, there's a party for that, and if you vary it, you'll lose damage. If you want the most gold, there's a party for that.  If you're the type of player who just wants to play with your favourite characters (say, build everything around Karlach), you may find progress more difficult than someone choosing to field the meta.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun and surprisingly deep game to learn at start thinking its just casual idle game, click and upgrade and win, but nah man this game hits different lets say there’s a lot to learn about characters and strategies, and while casual play covers only a small part, the game has a huge “iceberg” of content like gem farming and wall pushing. Complex at first, but simple once you get the hang of it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a nice idle game... but I can get really complex when you start to reach higher levels. Characters synergy, specializations, positioning, modron cores... be ready to spend some good time trying out different comps and failing.\nYou can have Baldur's Gate 3 characters, 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most appealing feature of  Idle Champions of the Forgotten Realms is that the game plays offline automatically even if you turn off your computer. Items, experience, gold and other stuff are gained idly. Extremely time-saving for students, housewives and employees!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With regular updates and new characters, as well as some of my favorites (love you Drizzt), this is one good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun and casual but harder to get to upper levels if you dont understand the champions you have",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gave this game a positive review because it has many achievements to collect and various characters and other elements. It's not because of its gameplay. The game only requires players to just sit and wait. I myself have no interest in watching boring storylines.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Having spent hundreds on the game packs+dlc and thousands of hours, I can say this is at best a 5/10 idle games.\n\nThe game start out well with a lot of things to work on and a lot of characters to collect especially if you want to build a dream team and focus entirely on that. The variants let you do a bit of thinking to figure out on what to do for that very stage instead of just using the same team the entire time to keep the game a bit more fresh.\n\nHowever, as you play more and more of the game, the game crack will show and the crack is massive and cannot be ignored. The pace the game actually receives a meaningful update is even slower than other much smaller indie game that only work on their idle stuff more as a hobby. Instead of releasing new and better goals to work toward in general with more layers to the gameplay like most idle games do, this game instead focus on puking out new streamer-based characters that are pretty much forgotten after the event is over in most case so often, a monthly update feel like nothing is really added to the game if you don't care about that new event character.\n\nOnce you unlock the current end-game feature that you only get to do once a week, that's pretty much it and that's where the game has been sitting at for almost half a year already that even I figure it's time I give up hoping for them to actually improve the core gameplay and cut my losses here.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "First of all,  IT IS FREE, so I guess try it?\n\nIf your time is valuable here are some thoughts:\n\nDespite being an utterly brain-dead \"idle\" game it (like so many others) requires lots of clicking and managing while yet never really presenting a challenge.  There is no pause button which is very very annoying.  I did not enjoy myself.\n\nI'd like to find an idle game where one can just chill, maybe watch a movie on the other monitor, pick out some goodies and level up choices now and then, maybe lose and have to rethink upgrade choices and puzzle it out... instead they all seem to require constant baby sitting.  I guess I'm the crazy one.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This is an example of an idle game that commits one of the cardinal sins of idle games: it demands your attention.\nA lot of your attention. An increasingly ungainly amount of your attention.\nYet I like many others tolerated it anyway. The game was charming, and undoubtably a step up over Codename Entertainment's previous game. \nBoiling frogs though we were, it became increasingly unpleasant and unsatisfying to play the game.\nDo your patron weeklies every week, click all the upgrades this reset, complete the seasonal events (that run almost monthly), click all your upgrades again, reset and adjust your three parties that run at the same time, click all the upgrades for all three parties because the automation won't do that until you upgrade your modron cores to level umpteen, click all your upgrades again, gnash your teeth at the idea of clearing that one objective that will require you to watch the game like a hawk for 40 minutes, click all your upgrades again, realize you HAVE to clear that one objective to unlock the new features, click all your upgrades again, CLICK THEM ALL, CLICK THEM AGAIN.\n\nDid any of that help me clear areas I couldn't before? No? Why the hell not? Why do these upgrades feel like they do nothing?! Why does nothing I do feel like it increases my power incrementally IN THIS INCREMENTAL GAME?\nGoogle formation guides. Find the one specific formation that trivializes the objective, that requires one or two very specific champions, using one very specific, and unintuitive specialization.\n\nWe don't get gold chests anymore from promo codes from videos and podcasts anymore. We get \"electrum\" chests.\nGiven that electrum is just gold watered down with silver, they are aptly named.\n\nNow they've added another premium currency. Because the old currency, gems, were something we could earn through gameplay, and not drip fed day by day. It's an insult, but only a moderate one, because half the stuff in the shop just costs straight up cash anyway.\n\nPlaying this game has somehow become one of the top 5 sources of anxiety in my life.\nI'm done. I want to forget about this game. I want to forget it even exists. I want to forget I ever played it.\nI think I will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Didn't like it the first time around.\nTried to open it again on another PC to see if I'll like it beter this time.\nThe sprites and the interface just didn't show up at all, no matter what I tried.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Please don't waste your life on this. I wanted an idle game months ago. I just wanted to see numbers go up and to have something to check on everyday, something that would make me feel cozy and in a way productive? and I chose this for a familiar IP. I now have a 115 hours, measly and pathetic compared to long time players, and I'm becoming more and more disgusted this game is over taking shorter games in my library I truly love in my total hours. \nI'm uninstalling this game and deleting it from my library. I'm going to go play a game with a real story I can finish and end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is a bit broken. I haven't really checked what else is not working but I did a run and wanted to spend my blessings for bonuses but... The blessings menu is nonexistent. I then tried to open the hotkeys to see what button I needed to press... that menu does not work either. I cannot access a part of the game simply because it's... broken. It just does not work. I've tried verifying files. Reinstalling. Everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing for many days and hours and no longer recommend it because I don't feel any progress or power-ups with my champions and items.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A positive review is not available in your region.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This is cash trash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Shit in a butt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing for years, and I have spent hundreds (if not thousands) of dollars on this, so please trust what I say:\n\nDo not touch this game.\n\nI'm not the kind that plays \"free\" games on any platform. I figured that I wasn't stupid enough to get into a \"freemium\" game, and certainly not enough to spend money. I don't play Clash of Clans, gatcha games, or any other mobile trash. I don't have mental issues, and I do not have an addictive personality. I'm just a normal person who liked D&D, and in 2017, I figured I'd give this a shot. How naive I was.\n\nJust like any other modern phone game, this isn't intended to be a good game, and it isn't fun.\nThe goal is to addict you because that is how it's engineered from the start. And that's the entire point - it is a business model, not a game. That means it's packed with extremely predatory monetisation practices that nickel and dime you at every opportunity.\n\nPoor design-wise, it takes a ton of time to manually optimise your teams every time you interact with it (got a new champion? Time to rearrange EVERY team you have!), pins your CPU a great deal wasting loads of power, and multiple times a week I encountered glitches that caused severe progress loss.\n\nYes, those are all bad, but not as bad as the monetisation that was slowly added over time that really turned the game into a glorified store with progression attached.\n\nThey sell \"DLC\" which are continually expiring in the store forcing false scarcity, sell back-to-back battle passes, hawk cosmetic skins for some reason that nobody can or will ever see, have constant mini-events with their own expiring currencies that they want you to purchase, repeatedly shove purchases and upsells via chests at you - even directly after purchasing chests, and contains hard progress walls that you CAN NOT progress through without scads of grinding or paying through the nose. Like an idiot, I did both.\n\nOh. And they raised prices recently and shink-flated the number and quality of items you got. Just FYI.\n\nI had to stop, re-evaluate things, and realise that I wasn't having fun and was just continuing out of habit all while flushing money down a toilet. I was addicted to this garbage and am ashamed.\n\nThis game is gross.\nThe company making it is gross.\nThese game practices are gross.\n\nEDIT FOR COMMENTS: There's a deeply weird number of people saying I spent a ton of time to fake my hours & achievements for this free game simply so I could give it a bad review (?).\n\nRelease Date: My earliest DLC is the Celeste Starter Pack from December of 2017. The game was not released in 2020, despite what the release date says on Steam - it was in Early Access for quite a while. Look it up.\n\nHours: If you're wondering about the hours I sunk into this, you used to not make any progress unless the game was left on in the background (which I often did 24 / 7), hence the hour count.\n\nDid I play?: Yes. I've never cheated play time or achievements. I also didn't buy a bunch of DLC so I could post a bad review. That would be insane.\nHere's a picture of my DLC ownership screen: https://imgur.com/a/TgTHSD9\n\nAny further salty lying / complaining because you want to waste time standing up for a predatory mobile game will be deleted.",
      "voted_up": false,
      "votes_helpful": 101
    },
    {
      "review": "My time on idler cash grabs are over. I spent the greater part of a year leaving this program and my computer running to farm parties full of heroes to scale them and earn currency faster.\n\nThis game is a time sink, like most mobile gacha and monetized games are. Since the release of premium platinum currency, the cash grab has been even worse. With continually expiring/retiring bundles and such, each skin and feat and event having their own gated p2w style niche behind it, it's not a D&D experience.\n\nThis game became a chore, I started to see how I dreaded just mixing and matching my party to progress as one of the lower parts of sitting down at my computer to game, even though it likely took up 10-15 minutes tops. It also takes a good amount of CPU, even spiking sometimes.\n\nYes, with enough time and enough research, you can get into this game without spending any money. The game itself has been around for 8ish years at this point. But is the amount of time and effort worth? No, find something else to sink your time into.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "Having spent hundreds on the game packs+dlc and thousands of hours, I can say this is at best a 5/10 idle games.\n\nThe game start out well with a lot of things to work on and a lot of characters to collect especially if you want to build a dream team and focus entirely on that. The variants let you do a bit of thinking to figure out on what to do for that very stage instead of just using the same team the entire time to keep the game a bit more fresh.\n\nHowever, as you play more and more of the game, the game crack will show and the crack is massive and cannot be ignored. The pace the game actually receives a meaningful update is even slower than other much smaller indie game that only work on their idle stuff more as a hobby. Instead of releasing new and better goals to work toward in general with more layers to the gameplay like most idle games do, this game instead focus on puking out new streamer-based characters that are pretty much forgotten after the event is over in most case so often, a monthly update feel like nothing is really added to the game if you don't care about that new event character.\n\nOnce you unlock the current end-game feature that you only get to do once a week, that's pretty much it and that's where the game has been sitting at for almost half a year already that even I figure it's time I give up hoping for them to actually improve the core gameplay and cut my losses here.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "With 47000 hours in, this game has been unplayable for the last few months.  Crashes very often and gem farming is not practical unless the game is running.  Have used multiple PCs and laptops with no luck.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "First of all,  IT IS FREE, so I guess try it?\n\nIf your time is valuable here are some thoughts:\n\nDespite being an utterly brain-dead \"idle\" game it (like so many others) requires lots of clicking and managing while yet never really presenting a challenge.  There is no pause button which is very very annoying.  I did not enjoy myself.\n\nI'd like to find an idle game where one can just chill, maybe watch a movie on the other monitor, pick out some goodies and level up choices now and then, maybe lose and have to rethink upgrade choices and puzzle it out... instead they all seem to require constant baby sitting.  I guess I'm the crazy one.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Other people have already highlighted why this game isn't really fun, and is a major cash and time grab.\n\nDid I have fun af times when playing it? Definitely. Several parts of the game are fun, especially when you start to unlock automation. But it's such quick bursts of joy, followed by mindless grinding and optimizing. At one point my friend asked me \"why are you playing it?\" after I had expressed a negative feeling about the weekly missions I \"needed\" to do. And at that moment I had no answer. So I uninstalled it and never looked back. That was several years ago, and I just decided to post this review to perhaps help others avoid wasting their time and money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Suppose you love D&D. You'll be drawn in by the familiar names and apparent intricacies, and before you know it you'll find yourself wasting more time than you intended just mindlessly trading boredom for anxiety. This game is addictive by design. It's full of bugs, some of which I'm certain are intentional (offline progress), the UX is mediocre at best, and barring a sprinkling of moderately clever writing (which gets repeated ad nauseam) it's not even entertaining. And that's if you don't spend any money on it.\n\nPlease consider doing literally anything else. Maybe play something with an actual story to it, or that you can enjoy with others. Like, I don't know, D&D?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Didn't like it the first time around.\nTried to open it again on another PC to see if I'll like it beter this time.\nThe sprites and the interface just didn't show up at all, no matter what I tried.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ugly art, recycled, uninspired writing and the sleepiest idle experience I have found. Pulling the plug today as the game killed 12 hours of offline and is freezing. There are less demanding, higher quality and more engaging idlers that are f2p. This game is truly a waste of time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I play a lot of clicker and idle games, and there's nothing I like about this one. For a game that came out in 2020, the graphics are extremely blurry and quite frankly terrible on the eyes, I also don't like the gameplay loop whatsoever when compared to literally any other mainstream clicker or idle game on the market. Not to mention the hilariously terrible theme song that sounds like a literal south park parody song for a video game. I have no idea why this game has so many positive reviews? Maybe just because it's D&D? But it's not held anywhere on the same universe of standards to all other D&D products and it's a terrible game with blurry makes my eyes bleed graphics. Did I mention how bad the theme song was?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ugh. Nothing but pop-up after pop-up.  I tried, but man, it won't let me play the game.\nReminds me of websurfing with add-block turned off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an example of an idle game that commits one of the cardinal sins of idle games: it demands your attention.\nA lot of your attention. An increasingly ungainly amount of your attention.\nYet I like many others tolerated it anyway. The game was charming, and undoubtably a step up over Codename Entertainment's previous game. \nBoiling frogs though we were, it became increasingly unpleasant and unsatisfying to play the game.\nDo your patron weeklies every week, click all the upgrades this reset, complete the seasonal events (that run almost monthly), click all your upgrades again, reset and adjust your three parties that run at the same time, click all the upgrades for all three parties because the automation won't do that until you upgrade your modron cores to level umpteen, click all your upgrades again, gnash your teeth at the idea of clearing that one objective that will require you to watch the game like a hawk for 40 minutes, click all your upgrades again, realize you HAVE to clear that one objective to unlock the new features, click all your upgrades again, CLICK THEM ALL, CLICK THEM AGAIN.\n\nDid any of that help me clear areas I couldn't before? No? Why the hell not? Why do these upgrades feel like they do nothing?! Why does nothing I do feel like it increases my power incrementally IN THIS INCREMENTAL GAME?\nGoogle formation guides. Find the one specific formation that trivializes the objective, that requires one or two very specific champions, using one very specific, and unintuitive specialization.\n\nWe don't get gold chests anymore from promo codes from videos and podcasts anymore. We get \"electrum\" chests.\nGiven that electrum is just gold watered down with silver, they are aptly named.\n\nNow they've added another premium currency. Because the old currency, gems, were something we could earn through gameplay, and not drip fed day by day. It's an insult, but only a moderate one, because half the stuff in the shop just costs straight up cash anyway.\n\nPlaying this game has somehow become one of the top 5 sources of anxiety in my life.\nI'm done. I want to forget about this game. I want to forget it even exists. I want to forget I ever played it.\nI think I will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is laziest gacha game ever(no this is not a idle/puzzle game). Devs are not even trying to fix bugs or making this into a real game but the skins/familiars and all kind of bs is their only priority. Seasons had nice thing going on but they thought that it gave \"too much\" to players and it was \"too much effort to make\" so they watered them down and ultimately just butchered it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Please don't waste your life on this. I wanted an idle game months ago. I just wanted to see numbers go up and to have something to check on everyday, something that would make me feel cozy and in a way productive? and I chose this for a familiar IP. I now have a 115 hours, measly and pathetic compared to long time players, and I'm becoming more and more disgusted this game is over taking shorter games in my library I truly love in my total hours. \nI'm uninstalling this game and deleting it from my library. I'm going to go play a game with a real story I can finish and end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is a bit broken. I haven't really checked what else is not working but I did a run and wanted to spend my blessings for bonuses but... The blessings menu is nonexistent. I then tried to open the hotkeys to see what button I needed to press... that menu does not work either. I cannot access a part of the game simply because it's... broken. It just does not work. I've tried verifying files. Reinstalling. Everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly designed and really glad I didn't pay for it. Kind of like a game your friend in high school would design with all the bugs and flaws. It's fun but not worth paying for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of neat concepts but a buggy mess and loses its charm pretty early in. Also pretty PTW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]WHAT. A. BUGGY. MESS.[/h1]\n\nFirst off, ignore my hours played. I've played hundreds of hours on another account, and spent money on various things for the game. My reason for posting this review here is to act as a warning for you, and post my frustration with a game I was enjoying so that you know what happened to me and that it could happen to you if you decide to play it too.\n\n[b]So why did I start playing the game?[/b] Dungeons & Dragons. Idle game. I like all those words!\n[b]Why did I stop playing the game?[/b] The game, my account, maybe both - something is broken so bad that it will no longer allow me to play it. Whenever I log into my account it is stuck on \"Verifying definitions 0/0\" and does not progress any further. I've tried various things to fix the problem but nothing has helped. Permanently stuck on \"Verifying Definitions 0/0\". So you may ask yourself [i]\"Why doesn't he submit a ticket to support and have it fixed?\"[/i] Well, this is the anvil on top of many straws upon the camel's back, and frankly at this point I'm done with the game.\n\n[h2]So what happened?[/h2]\n\nI've played other idler games so I pretty much knew what to expect with this one. The game started out great. I was making progress, leveling up my characters, and even unlocking new ones. I liked the game so much I bought a few of their various packs to progress and enhance my game. I was having a good time. It was fun waking up in the morning to see how far my characters had gotten.\n\nThen the bugs started to come out of the woodwork.\n\nI started to notice more and more often problems with the game both intended and unintended.\n[list]\n[*]Every once in a while without even touching the game you would see a random \"Reporting error\" in-game pop-up. This meant I had to restart the game.\n[*]Sometimes I would glance at my game and there were no enemies on the screen. My characters were just swaying, waiting for some to spawn. This meant I had to restart the game.\n[*]I noticed that the game behaves differently based on whether the window is active or not. If the window was active, my characters progressed significantly farther than if the window was minimized.\n[*]Characters with the \"Speed\" role functionality rely on them being both the active party, and the window active for their abilities to function\n[*]Other oddities, but don't want this to become a book\n[/list]\n\nHowever the final bug/error/show stopper that currently blocks me from playing happened while doing something extremely mundane. I was editing my modron core pipe flow when out of nowhere I got the \"Reporting error\" in-game pop-up. I was able to close the modron core window, but still the \"Reporting error\" window was there. I even got some new \"Reporting error\" pop-ups that overlayed on top of the existing pop-ups over and over again. I let it sit there for a few seconds, but it never fixed itself and my game wouldn't let me do anything else. So I closed the game and re-opened it. The game will no longer even show me menu options, but instead I am now shown an error of \"Verifying definitions 0/0\". I've tried a few things to fix this, but no matter what I try I still get the error. I am physically unable to play the game anymore. Yeah I probably could open a support ticket. Maybe they could fix it. However at this point I think I am just done with the game......not that I really have a choice in it.\n\nIf you decide to play the game I hope you see what happened to me, and know what could happen to you. So no, I cannot recommend to play a game that no longer even allows me to do so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a shame i have to give it a thumbs down. Alot of stuff seems to be locked behind platinum (premium currency) and on every new adventure the top of the screen gets bombarded with \"buy this and buy that\" Basicly a phone game ported to pc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "came back to game after a year , nothing has changed .\ntrolls and no optimization what so ever , love it to see how talent got nothing to make money \ngood bye codename entertainment",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Idle my a$$. I never clicked so much since Broodwars diamond league. Was fun though, Just dont spend any $$ and accept that you are a worthless worm grinding for survival.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have been playing for many days and hours and no longer recommend it because I don't feel any progress or power-ups with my champions and items.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broken updates, no soul, full on money grabber these days. Done with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Offline progress is a joke. When they say idle champions, they intend you to keep the game, and your computer, on 24/7 to make meaningful progress, not play it like an actual idle game where you log in a few times per day to massage numbers and/or start a new run. It's very clearly just intending to make you pad your play time to make them look good, as the gold issue would be such a simple fix.\n\nBased on what I looked up, you progress about 1 area per minute and make 10% gold while offline for starters. This is far slower than even unbuffed speeds and, obviously, 10% of expected gold. Characters that increase speed don't seem to speed that up, defeating the point of bothering to use them. Might as well just go full DPS and/or gold to at least get some level of progress. Worse, familiars apparently don't auto-level you properly while offline, instead stopping at your specialization, making them more or less pointless unless you have unlocked modrom automation you can use to auto-apply specialization and formation as well as auto-restart a run. \n\nWorse still, your other teams are in offline mode while not in focus, meaning even if you do play like a maniac and don't turn the game off, you still get punished for your audacity of going through the trouble of unlocking, and, heaven forbid, using your other party slots.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the longest time I have played this game as a back burner, now I can't recommend it at all. The amount of bugs present currently is stupidly annoying, from not being able to automatically set your current campaign automations to what campaign you're CURRENTLY ON, THERE ARE A LOT OF CAMPAIGNS TO MANUALLY SIEVE THROUGH, to automations not even running the way it's suppose to, IE NOT RUNNING AT ALL FOR SEVERAL HOURS EVEN OVERNIGHT, I can set a perfect automation in the party and leave it, only to find it STUCK AT RESET 5 THE WHOLE NIGHT. I have even found instances where my SAVED FORMATION doesn't even load properly in automation PARTIES, IE Familiars and Champions, NOT RUNNING AT ALL in the save after a several resets -- even when I am NOT even using them in any other party runs, mind you it is difficult to ascertain whether or not a party run is even running, so to mitigate I have to jump through several parties JUST to make sure it is running and when I couldn't be bothered that day I WASTE HOURS NOT REALIZING THAT THE PARTY HAS BEEN BUGGED THE WHOLE TIME. My reliance has been heavily on automated parties to get things done, but for it to break and not even run as intended, that's where I draw the line. Keep in mind I know about the Automated Parties only run within a week, that was not applicable to my complain because the runs happens WITHIN the week. This game only embeds my already compounded OCD, so I don't need this bugged game crossing that line further than it already has, therefore I would be leaving it with no regrets other than the wasted time I have already invested in it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This can be a fun game, at first, and if you are into D&D at all you'll see familiar names and faces and enjoy watching them fight. But the grind is so long if you want to keep playing. Pay to play to the extreme. And if you pay, prepare to pay some more because the grind keeps coming unless you keep paying, and paying. Even if you don't mind some long grinding sessions, you'll get to a point where it is too frustrating to continue, you either pay or die. A shame.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hmm yes. Nice game but got too much for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried twice....won't touch it with a stick....even it is a wand of fireballs. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A positive review is not available in your region.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Cash grab using a beloved franchise. making the franchise less beloved",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Quite boring..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is cash trash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Shit in a butt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing for years, and I have spent hundreds (if not thousands) of dollars on this, so please trust what I say:\n\nDo not touch this game.\n\nI'm not the kind that plays \"free\" games on any platform. I figured that I wasn't stupid enough to get into a \"freemium\" game, and certainly not enough to spend money. I don't play Clash of Clans, gatcha games, or any other mobile trash. I don't have mental issues, and I do not have an addictive personality. I'm just a normal person who liked D&D, and in 2017, I figured I'd give this a shot. How naive I was.\n\nJust like any other modern phone game, this isn't intended to be a good game, and it isn't fun.\nThe goal is to addict you because that is how it's engineered from the start. And that's the entire point - it is a business model, not a game. That means it's packed with extremely predatory monetisation practices that nickel and dime you at every opportunity.\n\nPoor design-wise, it takes a ton of time to manually optimise your teams every time you interact with it (got a new champion? Time to rearrange EVERY team you have!), pins your CPU a great deal wasting loads of power, and multiple times a week I encountered glitches that caused severe progress loss.\n\nYes, those are all bad, but not as bad as the monetisation that was slowly added over time that really turned the game into a glorified store with progression attached.\n\nThey sell \"DLC\" which are continually expiring in the store forcing false scarcity, sell back-to-back battle passes, hawk cosmetic skins for some reason that nobody can or will ever see, have constant mini-events with their own expiring currencies that they want you to purchase, repeatedly shove purchases and upsells via chests at you - even directly after purchasing chests, and contains hard progress walls that you CAN NOT progress through without scads of grinding or paying through the nose. Like an idiot, I did both.\n\nOh. And they raised prices recently and shink-flated the number and quality of items you got. Just FYI.\n\nI had to stop, re-evaluate things, and realise that I wasn't having fun and was just continuing out of habit all while flushing money down a toilet. I was addicted to this garbage and am ashamed.\n\nThis game is gross.\nThe company making it is gross.\nThese game practices are gross.\n\nEDIT FOR COMMENTS: There's a deeply weird number of people saying I spent a ton of time to fake my hours & achievements for this free game simply so I could give it a bad review (?).\n\nRelease Date: My earliest DLC is the Celeste Starter Pack from December of 2017. The game was not released in 2020, despite what the release date says on Steam - it was in Early Access for quite a while. Look it up.\n\nHours: If you're wondering about the hours I sunk into this, you used to not make any progress unless the game was left on in the background (which I often did 24 / 7), hence the hour count.\n\nDid I play?: Yes. I've never cheated play time or achievements. I also didn't buy a bunch of DLC so I could post a bad review. That would be insane.\nHere's a picture of my DLC ownership screen: https://imgur.com/a/TgTHSD9\n\nAny further salty lying / complaining because you want to waste time standing up for a predatory mobile game will be deleted.",
      "voted_up": false,
      "votes_helpful": 101
    },
    {
      "review": "My time on idler cash grabs are over. I spent the greater part of a year leaving this program and my computer running to farm parties full of heroes to scale them and earn currency faster.\n\nThis game is a time sink, like most mobile gacha and monetized games are. Since the release of premium platinum currency, the cash grab has been even worse. With continually expiring/retiring bundles and such, each skin and feat and event having their own gated p2w style niche behind it, it's not a D&D experience.\n\nThis game became a chore, I started to see how I dreaded just mixing and matching my party to progress as one of the lower parts of sitting down at my computer to game, even though it likely took up 10-15 minutes tops. It also takes a good amount of CPU, even spiking sometimes.\n\nYes, with enough time and enough research, you can get into this game without spending any money. The game itself has been around for 8ish years at this point. But is the amount of time and effort worth? No, find something else to sink your time into.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "Having spent hundreds on the game packs+dlc and thousands of hours, I can say this is at best a 5/10 idle games.\n\nThe game start out well with a lot of things to work on and a lot of characters to collect especially if you want to build a dream team and focus entirely on that. The variants let you do a bit of thinking to figure out on what to do for that very stage instead of just using the same team the entire time to keep the game a bit more fresh.\n\nHowever, as you play more and more of the game, the game crack will show and the crack is massive and cannot be ignored. The pace the game actually receives a meaningful update is even slower than other much smaller indie game that only work on their idle stuff more as a hobby. Instead of releasing new and better goals to work toward in general with more layers to the gameplay like most idle games do, this game instead focus on puking out new streamer-based characters that are pretty much forgotten after the event is over in most case so often, a monthly update feel like nothing is really added to the game if you don't care about that new event character.\n\nOnce you unlock the current end-game feature that you only get to do once a week, that's pretty much it and that's where the game has been sitting at for almost half a year already that even I figure it's time I give up hoping for them to actually improve the core gameplay and cut my losses here.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "With 47000 hours in, this game has been unplayable for the last few months.  Crashes very often and gem farming is not practical unless the game is running.  Have used multiple PCs and laptops with no luck.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "First of all,  IT IS FREE, so I guess try it?\n\nIf your time is valuable here are some thoughts:\n\nDespite being an utterly brain-dead \"idle\" game it (like so many others) requires lots of clicking and managing while yet never really presenting a challenge.  There is no pause button which is very very annoying.  I did not enjoy myself.\n\nI'd like to find an idle game where one can just chill, maybe watch a movie on the other monitor, pick out some goodies and level up choices now and then, maybe lose and have to rethink upgrade choices and puzzle it out... instead they all seem to require constant baby sitting.  I guess I'm the crazy one.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Other people have already highlighted why this game isn't really fun, and is a major cash and time grab.\n\nDid I have fun af times when playing it? Definitely. Several parts of the game are fun, especially when you start to unlock automation. But it's such quick bursts of joy, followed by mindless grinding and optimizing. At one point my friend asked me \"why are you playing it?\" after I had expressed a negative feeling about the weekly missions I \"needed\" to do. And at that moment I had no answer. So I uninstalled it and never looked back. That was several years ago, and I just decided to post this review to perhaps help others avoid wasting their time and money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Suppose you love D&D. You'll be drawn in by the familiar names and apparent intricacies, and before you know it you'll find yourself wasting more time than you intended just mindlessly trading boredom for anxiety. This game is addictive by design. It's full of bugs, some of which I'm certain are intentional (offline progress), the UX is mediocre at best, and barring a sprinkling of moderately clever writing (which gets repeated ad nauseam) it's not even entertaining. And that's if you don't spend any money on it.\n\nPlease consider doing literally anything else. Maybe play something with an actual story to it, or that you can enjoy with others. Like, I don't know, D&D?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Didn't like it the first time around.\nTried to open it again on another PC to see if I'll like it beter this time.\nThe sprites and the interface just didn't show up at all, no matter what I tried.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ugly art, recycled, uninspired writing and the sleepiest idle experience I have found. Pulling the plug today as the game killed 12 hours of offline and is freezing. There are less demanding, higher quality and more engaging idlers that are f2p. This game is truly a waste of time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I play a lot of clicker and idle games, and there's nothing I like about this one. For a game that came out in 2020, the graphics are extremely blurry and quite frankly terrible on the eyes, I also don't like the gameplay loop whatsoever when compared to literally any other mainstream clicker or idle game on the market. Not to mention the hilariously terrible theme song that sounds like a literal south park parody song for a video game. I have no idea why this game has so many positive reviews? Maybe just because it's D&D? But it's not held anywhere on the same universe of standards to all other D&D products and it's a terrible game with blurry makes my eyes bleed graphics. Did I mention how bad the theme song was?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ugh. Nothing but pop-up after pop-up.  I tried, but man, it won't let me play the game.\nReminds me of websurfing with add-block turned off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an example of an idle game that commits one of the cardinal sins of idle games: it demands your attention.\nA lot of your attention. An increasingly ungainly amount of your attention.\nYet I like many others tolerated it anyway. The game was charming, and undoubtably a step up over Codename Entertainment's previous game. \nBoiling frogs though we were, it became increasingly unpleasant and unsatisfying to play the game.\nDo your patron weeklies every week, click all the upgrades this reset, complete the seasonal events (that run almost monthly), click all your upgrades again, reset and adjust your three parties that run at the same time, click all the upgrades for all three parties because the automation won't do that until you upgrade your modron cores to level umpteen, click all your upgrades again, gnash your teeth at the idea of clearing that one objective that will require you to watch the game like a hawk for 40 minutes, click all your upgrades again, realize you HAVE to clear that one objective to unlock the new features, click all your upgrades again, CLICK THEM ALL, CLICK THEM AGAIN.\n\nDid any of that help me clear areas I couldn't before? No? Why the hell not? Why do these upgrades feel like they do nothing?! Why does nothing I do feel like it increases my power incrementally IN THIS INCREMENTAL GAME?\nGoogle formation guides. Find the one specific formation that trivializes the objective, that requires one or two very specific champions, using one very specific, and unintuitive specialization.\n\nWe don't get gold chests anymore from promo codes from videos and podcasts anymore. We get \"electrum\" chests.\nGiven that electrum is just gold watered down with silver, they are aptly named.\n\nNow they've added another premium currency. Because the old currency, gems, were something we could earn through gameplay, and not drip fed day by day. It's an insult, but only a moderate one, because half the stuff in the shop just costs straight up cash anyway.\n\nPlaying this game has somehow become one of the top 5 sources of anxiety in my life.\nI'm done. I want to forget about this game. I want to forget it even exists. I want to forget I ever played it.\nI think I will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is laziest gacha game ever(no this is not a idle/puzzle game). Devs are not even trying to fix bugs or making this into a real game but the skins/familiars and all kind of bs is their only priority. Seasons had nice thing going on but they thought that it gave \"too much\" to players and it was \"too much effort to make\" so they watered them down and ultimately just butchered it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Please don't waste your life on this. I wanted an idle game months ago. I just wanted to see numbers go up and to have something to check on everyday, something that would make me feel cozy and in a way productive? and I chose this for a familiar IP. I now have a 115 hours, measly and pathetic compared to long time players, and I'm becoming more and more disgusted this game is over taking shorter games in my library I truly love in my total hours. \nI'm uninstalling this game and deleting it from my library. I'm going to go play a game with a real story I can finish and end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is a bit broken. I haven't really checked what else is not working but I did a run and wanted to spend my blessings for bonuses but... The blessings menu is nonexistent. I then tried to open the hotkeys to see what button I needed to press... that menu does not work either. I cannot access a part of the game simply because it's... broken. It just does not work. I've tried verifying files. Reinstalling. Everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly designed and really glad I didn't pay for it. Kind of like a game your friend in high school would design with all the bugs and flaws. It's fun but not worth paying for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of neat concepts but a buggy mess and loses its charm pretty early in. Also pretty PTW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]WHAT. A. BUGGY. MESS.[/h1]\n\nFirst off, ignore my hours played. I've played hundreds of hours on another account, and spent money on various things for the game. My reason for posting this review here is to act as a warning for you, and post my frustration with a game I was enjoying so that you know what happened to me and that it could happen to you if you decide to play it too.\n\n[b]So why did I start playing the game?[/b] Dungeons & Dragons. Idle game. I like all those words!\n[b]Why did I stop playing the game?[/b] The game, my account, maybe both - something is broken so bad that it will no longer allow me to play it. Whenever I log into my account it is stuck on \"Verifying definitions 0/0\" and does not progress any further. I've tried various things to fix the problem but nothing has helped. Permanently stuck on \"Verifying Definitions 0/0\". So you may ask yourself [i]\"Why doesn't he submit a ticket to support and have it fixed?\"[/i] Well, this is the anvil on top of many straws upon the camel's back, and frankly at this point I'm done with the game.\n\n[h2]So what happened?[/h2]\n\nI've played other idler games so I pretty much knew what to expect with this one. The game started out great. I was making progress, leveling up my characters, and even unlocking new ones. I liked the game so much I bought a few of their various packs to progress and enhance my game. I was having a good time. It was fun waking up in the morning to see how far my characters had gotten.\n\nThen the bugs started to come out of the woodwork.\n\nI started to notice more and more often problems with the game both intended and unintended.\n[list]\n[*]Every once in a while without even touching the game you would see a random \"Reporting error\" in-game pop-up. This meant I had to restart the game.\n[*]Sometimes I would glance at my game and there were no enemies on the screen. My characters were just swaying, waiting for some to spawn. This meant I had to restart the game.\n[*]I noticed that the game behaves differently based on whether the window is active or not. If the window was active, my characters progressed significantly farther than if the window was minimized.\n[*]Characters with the \"Speed\" role functionality rely on them being both the active party, and the window active for their abilities to function\n[*]Other oddities, but don't want this to become a book\n[/list]\n\nHowever the final bug/error/show stopper that currently blocks me from playing happened while doing something extremely mundane. I was editing my modron core pipe flow when out of nowhere I got the \"Reporting error\" in-game pop-up. I was able to close the modron core window, but still the \"Reporting error\" window was there. I even got some new \"Reporting error\" pop-ups that overlayed on top of the existing pop-ups over and over again. I let it sit there for a few seconds, but it never fixed itself and my game wouldn't let me do anything else. So I closed the game and re-opened it. The game will no longer even show me menu options, but instead I am now shown an error of \"Verifying definitions 0/0\". I've tried a few things to fix this, but no matter what I try I still get the error. I am physically unable to play the game anymore. Yeah I probably could open a support ticket. Maybe they could fix it. However at this point I think I am just done with the game......not that I really have a choice in it.\n\nIf you decide to play the game I hope you see what happened to me, and know what could happen to you. So no, I cannot recommend to play a game that no longer even allows me to do so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a shame i have to give it a thumbs down. Alot of stuff seems to be locked behind platinum (premium currency) and on every new adventure the top of the screen gets bombarded with \"buy this and buy that\" Basicly a phone game ported to pc.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "came back to game after a year , nothing has changed .\ntrolls and no optimization what so ever , love it to see how talent got nothing to make money \ngood bye codename entertainment",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Idle my a$$. I never clicked so much since Broodwars diamond league. Was fun though, Just dont spend any $$ and accept that you are a worthless worm grinding for survival.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have been playing for many days and hours and no longer recommend it because I don't feel any progress or power-ups with my champions and items.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broken updates, no soul, full on money grabber these days. Done with it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Offline progress is a joke. When they say idle champions, they intend you to keep the game, and your computer, on 24/7 to make meaningful progress, not play it like an actual idle game where you log in a few times per day to massage numbers and/or start a new run. It's very clearly just intending to make you pad your play time to make them look good, as the gold issue would be such a simple fix.\n\nBased on what I looked up, you progress about 1 area per minute and make 10% gold while offline for starters. This is far slower than even unbuffed speeds and, obviously, 10% of expected gold. Characters that increase speed don't seem to speed that up, defeating the point of bothering to use them. Might as well just go full DPS and/or gold to at least get some level of progress. Worse, familiars apparently don't auto-level you properly while offline, instead stopping at your specialization, making them more or less pointless unless you have unlocked modrom automation you can use to auto-apply specialization and formation as well as auto-restart a run. \n\nWorse still, your other teams are in offline mode while not in focus, meaning even if you do play like a maniac and don't turn the game off, you still get punished for your audacity of going through the trouble of unlocking, and, heaven forbid, using your other party slots.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the longest time I have played this game as a back burner, now I can't recommend it at all. The amount of bugs present currently is stupidly annoying, from not being able to automatically set your current campaign automations to what campaign you're CURRENTLY ON, THERE ARE A LOT OF CAMPAIGNS TO MANUALLY SIEVE THROUGH, to automations not even running the way it's suppose to, IE NOT RUNNING AT ALL FOR SEVERAL HOURS EVEN OVERNIGHT, I can set a perfect automation in the party and leave it, only to find it STUCK AT RESET 5 THE WHOLE NIGHT. I have even found instances where my SAVED FORMATION doesn't even load properly in automation PARTIES, IE Familiars and Champions, NOT RUNNING AT ALL in the save after a several resets -- even when I am NOT even using them in any other party runs, mind you it is difficult to ascertain whether or not a party run is even running, so to mitigate I have to jump through several parties JUST to make sure it is running and when I couldn't be bothered that day I WASTE HOURS NOT REALIZING THAT THE PARTY HAS BEEN BUGGED THE WHOLE TIME. My reliance has been heavily on automated parties to get things done, but for it to break and not even run as intended, that's where I draw the line. Keep in mind I know about the Automated Parties only run within a week, that was not applicable to my complain because the runs happens WITHIN the week. This game only embeds my already compounded OCD, so I don't need this bugged game crossing that line further than it already has, therefore I would be leaving it with no regrets other than the wasted time I have already invested in it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This can be a fun game, at first, and if you are into D&D at all you'll see familiar names and faces and enjoy watching them fight. But the grind is so long if you want to keep playing. Pay to play to the extreme. And if you pay, prepare to pay some more because the grind keeps coming unless you keep paying, and paying. Even if you don't mind some long grinding sessions, you'll get to a point where it is too frustrating to continue, you either pay or die. A shame.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hmm yes. Nice game but got too much for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried twice....won't touch it with a stick....even it is a wand of fireballs. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A positive review is not available in your region.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Cash grab using a beloved franchise. making the franchise less beloved",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Quite boring..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is cash trash.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Shit in a butt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing for years, and I have spent hundreds (if not thousands) of dollars on this, so please trust what I say:\n\nDo not touch this game.\n\nI'm not the kind that plays \"free\" games on any platform. I figured that I wasn't stupid enough to get into a \"freemium\" game, and certainly not enough to spend money. I don't play Clash of Clans, gatcha games, or any other mobile trash. I don't have mental issues, and I do not have an addictive personality. I'm just a normal person who liked D&D, and in 2017, I figured I'd give this a shot. How naive I was.\n\nJust like any other modern phone game, this isn't intended to be a good game, and it isn't fun.\nThe goal is to addict you because that is how it's engineered from the start. And that's the entire point - it is a business model, not a game. That means it's packed with extremely predatory monetisation practices that nickel and dime you at every opportunity.\n\nPoor design-wise, it takes a ton of time to manually optimise your teams every time you interact with it (got a new champion? Time to rearrange EVERY team you have!), pins your CPU a great deal wasting loads of power, and multiple times a week I encountered glitches that caused severe progress loss.\n\nYes, those are all bad, but not as bad as the monetisation that was slowly added over time that really turned the game into a glorified store with progression attached.\n\nThey sell \"DLC\" which are continually expiring in the store forcing false scarcity, sell back-to-back battle passes, hawk cosmetic skins for some reason that nobody can or will ever see, have constant mini-events with their own expiring currencies that they want you to purchase, repeatedly shove purchases and upsells via chests at you - even directly after purchasing chests, and contains hard progress walls that you CAN NOT progress through without scads of grinding or paying through the nose. Like an idiot, I did both.\n\nOh. And they raised prices recently and shink-flated the number and quality of items you got. Just FYI.\n\nI had to stop, re-evaluate things, and realise that I wasn't having fun and was just continuing out of habit all while flushing money down a toilet. I was addicted to this garbage and am ashamed.\n\nThis game is gross.\nThe company making it is gross.\nThese game practices are gross.\n\nEDIT FOR COMMENTS: There's a deeply weird number of people saying I spent a ton of time to fake my hours & achievements for this free game simply so I could give it a bad review (?).\n\nRelease Date: My earliest DLC is the Celeste Starter Pack from December of 2017. The game was not released in 2020, despite what the release date says on Steam - it was in Early Access for quite a while. Look it up.\n\nHours: If you're wondering about the hours I sunk into this, you used to not make any progress unless the game was left on in the background (which I often did 24 / 7), hence the hour count.\n\nDid I play?: Yes. I've never cheated play time or achievements. I also didn't buy a bunch of DLC so I could post a bad review. That would be insane.\nHere's a picture of my DLC ownership screen: https://imgur.com/a/TgTHSD9\n\nAny further salty lying / complaining because you want to waste time standing up for a predatory mobile game will be deleted.",
      "voted_up": false,
      "votes_helpful": 101
    },
    {
      "review": "My time on idler cash grabs are over. I spent the greater part of a year leaving this program and my computer running to farm parties full of heroes to scale them and earn currency faster.\n\nThis game is a time sink, like most mobile gacha and monetized games are. Since the release of premium platinum currency, the cash grab has been even worse. With continually expiring/retiring bundles and such, each skin and feat and event having their own gated p2w style niche behind it, it's not a D&D experience.\n\nThis game became a chore, I started to see how I dreaded just mixing and matching my party to progress as one of the lower parts of sitting down at my computer to game, even though it likely took up 10-15 minutes tops. It also takes a good amount of CPU, even spiking sometimes.\n\nYes, with enough time and enough research, you can get into this game without spending any money. The game itself has been around for 8ish years at this point. But is the amount of time and effort worth? No, find something else to sink your time into.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "Having spent hundreds on the game packs+dlc and thousands of hours, I can say this is at best a 5/10 idle games.\n\nThe game start out well with a lot of things to work on and a lot of characters to collect especially if you want to build a dream team and focus entirely on that. The variants let you do a bit of thinking to figure out on what to do for that very stage instead of just using the same team the entire time to keep the game a bit more fresh.\n\nHowever, as you play more and more of the game, the game crack will show and the crack is massive and cannot be ignored. The pace the game actually receives a meaningful update is even slower than other much smaller indie game that only work on their idle stuff more as a hobby. Instead of releasing new and better goals to work toward in general with more layers to the gameplay like most idle games do, this game instead focus on puking out new streamer-based characters that are pretty much forgotten after the event is over in most case so often, a monthly update feel like nothing is really added to the game if you don't care about that new event character.\n\nOnce you unlock the current end-game feature that you only get to do once a week, that's pretty much it and that's where the game has been sitting at for almost half a year already that even I figure it's time I give up hoping for them to actually improve the core gameplay and cut my losses here.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "With 47000 hours in, this game has been unplayable for the last few months.  Crashes very often and gem farming is not practical unless the game is running.  Have used multiple PCs and laptops with no luck.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "First of all,  IT IS FREE, so I guess try it?\n\nIf your time is valuable here are some thoughts:\n\nDespite being an utterly brain-dead \"idle\" game it (like so many others) requires lots of clicking and managing while yet never really presenting a challenge.  There is no pause button which is very very annoying.  I did not enjoy myself.\n\nI'd like to find an idle game where one can just chill, maybe watch a movie on the other monitor, pick out some goodies and level up choices now and then, maybe lose and have to rethink upgrade choices and puzzle it out... instead they all seem to require constant baby sitting.  I guess I'm the crazy one.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Other people have already highlighted why this game isn't really fun, and is a major cash and time grab.\n\nDid I have fun af times when playing it? Definitely. Several parts of the game are fun, especially when you start to unlock automation. But it's such quick bursts of joy, followed by mindless grinding and optimizing. At one point my friend asked me \"why are you playing it?\" after I had expressed a negative feeling about the weekly missions I \"needed\" to do. And at that moment I had no answer. So I uninstalled it and never looked back. That was several years ago, and I just decided to post this review to perhaps help others avoid wasting their time and money.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Suppose you love D&D. You'll be drawn in by the familiar names and apparent intricacies, and before you know it you'll find yourself wasting more time than you intended just mindlessly trading boredom for anxiety. This game is addictive by design. It's full of bugs, some of which I'm certain are intentional (offline progress), the UX is mediocre at best, and barring a sprinkling of moderately clever writing (which gets repeated ad nauseam) it's not even entertaining. And that's if you don't spend any money on it.\n\nPlease consider doing literally anything else. Maybe play something with an actual story to it, or that you can enjoy with others. Like, I don't know, D&D?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Didn't like it the first time around.\nTried to open it again on another PC to see if I'll like it beter this time.\nThe sprites and the interface just didn't show up at all, no matter what I tried.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ugly art, recycled, uninspired writing and the sleepiest idle experience I have found. Pulling the plug today as the game killed 12 hours of offline and is freezing. There are less demanding, higher quality and more engaging idlers that are f2p. This game is truly a waste of time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I play a lot of clicker and idle games, and there's nothing I like about this one. For a game that came out in 2020, the graphics are extremely blurry and quite frankly terrible on the eyes, I also don't like the gameplay loop whatsoever when compared to literally any other mainstream clicker or idle game on the market. Not to mention the hilariously terrible theme song that sounds like a literal south park parody song for a video game. I have no idea why this game has so many positive reviews? Maybe just because it's D&D? But it's not held anywhere on the same universe of standards to all other D&D products and it's a terrible game with blurry makes my eyes bleed graphics. Did I mention how bad the theme song was?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ugh. Nothing but pop-up after pop-up.  I tried, but man, it won't let me play the game.\nReminds me of websurfing with add-block turned off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an example of an idle game that commits one of the cardinal sins of idle games: it demands your attention.\nA lot of your attention. An increasingly ungainly amount of your attention.\nYet I like many others tolerated it anyway. The game was charming, and undoubtably a step up over Codename Entertainment's previous game. \nBoiling frogs though we were, it became increasingly unpleasant and unsatisfying to play the game.\nDo your patron weeklies every week, click all the upgrades this reset, complete the seasonal events (that run almost monthly), click all your upgrades again, reset and adjust your three parties that run at the same time, click all the upgrades for all three parties because the automation won't do that until you upgrade your modron cores to level umpteen, click all your upgrades again, gnash your teeth at the idea of clearing that one objective that will require you to watch the game like a hawk for 40 minutes, click all your upgrades again, realize you HAVE to clear that one objective to unlock the new features, click all your upgrades again, CLICK THEM ALL, CLICK THEM AGAIN.\n\nDid any of that help me clear areas I couldn't before? No? Why the hell not? Why do these upgrades feel like they do nothing?! Why does nothing I do feel like it increases my power incrementally IN THIS INCREMENTAL GAME?\nGoogle formation guides. Find the one specific formation that trivializes the objective, that requires one or two very specific champions, using one very specific, and unintuitive specialization.\n\nWe don't get gold chests anymore from promo codes from videos and podcasts anymore. We get \"electrum\" chests.\nGiven that electrum is just gold watered down with silver, they are aptly named.\n\nNow they've added another premium currency. Because the old currency, gems, were something we could earn through gameplay, and not drip fed day by day. It's an insult, but only a moderate one, because half the stuff in the shop just costs straight up cash anyway.\n\nPlaying this game has somehow become one of the top 5 sources of anxiety in my life.\nI'm done. I want to forget about this game. I want to forget it even exists. I want to forget I ever played it.\nI think I will.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is laziest gacha game ever(no this is not a idle/puzzle game). Devs are not even trying to fix bugs or making this into a real game but the skins/familiars and all kind of bs is their only priority. Seasons had nice thing going on but they thought that it gave \"too much\" to players and it was \"too much effort to make\" so they watered them down and ultimately just butchered it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Please don't waste your life on this. I wanted an idle game months ago. I just wanted to see numbers go up and to have something to check on everyday, something that would make me feel cozy and in a way productive? and I chose this for a familiar IP. I now have a 115 hours, measly and pathetic compared to long time players, and I'm becoming more and more disgusted this game is over taking shorter games in my library I truly love in my total hours. \nI'm uninstalling this game and deleting it from my library. I'm going to go play a game with a real story I can finish and end.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is a bit broken. I haven't really checked what else is not working but I did a run and wanted to spend my blessings for bonuses but... The blessings menu is nonexistent. I then tried to open the hotkeys to see what button I needed to press... that menu does not work either. I cannot access a part of the game simply because it's... broken. It just does not work. I've tried verifying files. Reinstalling. Everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poorly designed and really glad I didn't pay for it. Kind of like a game your friend in high school would design with all the bugs and flaws. It's fun but not worth paying for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of neat concepts but a buggy mess and loses its charm pretty early in. Also pretty PTW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]WHAT. A. BUGGY. MESS.[/h1]\n\nFirst off, ignore my hours played. I've played hundreds of hours on another account, and spent money on various things for the game. My reason for posting this review here is to act as a warning for you, and post my frustration with a game I was enjoying so that you know what happened to me and that it could happen to you if you decide to play it too.\n\n[b]So why did I start playing the game?[/b] Dungeons & Dragons. Idle game. I like all those words!\n[b]Why did I stop playing the game?[/b] The game, my account, maybe both - something is broken so bad that it will no longer allow me to play it. Whenever I log into my account it is stuck on \"Verifying definitions 0/0\" and does not progress any further. I've tried various things to fix the problem but nothing has helped. Permanently stuck on \"Verifying Definitions 0/0\". So you may ask yourself [i]\"Why doesn't he submit a ticket to support and have it fixed?\"[/i] Well, this is the anvil on top of many straws upon the camel's back, and frankly at this point I'm done with the game.\n\n[h2]So what happened?[/h2]\n\nI've played other idler games so I pretty much knew what to expect with this one. The game started out great. I was making progress, leveling up my characters, and even unlocking new ones. I liked the game so much I bought a few of their various packs to progress and enhance my game. I was having a good time. It was fun waking up in the morning to see how far my characters had gotten.\n\nThen the bugs started to come out of the woodwork.\n\nI started to notice more and more often problems with the game both intended and unintended.\n[list]\n[*]Every once in a while without even touching the game you would see a random \"Reporting error\" in-game pop-up. This meant I had to restart the game.\n[*]Sometimes I would glance at my game and there were no enemies on the screen. My characters were just swaying, waiting for some to spawn. This meant I had to restart the game.\n[*]I noticed that the game behaves differently based on whether the window is active or not. If the window was active, my characters progressed significantly farther than if the window was minimized.\n[*]Characters with the \"Speed\" role functionality rely on them being both the active party, and the window active for their abilities to function\n[*]Other oddities, but don't want this to become a book\n[/list]\n\nHowever the final bug/error/show stopper that currently blocks me from playing happened while doing something extremely mundane. I was editing my modron core pipe flow when out of nowhere I got the \"Reporting error\" in-game pop-up. I was able to close the modron core window, but still the \"Reporting error\" window was there. I even got some new \"Reporting error\" pop-ups that overlayed on top of the existing pop-ups over and over again. I let it sit there for a few seconds, but it never fixed itself and my game wouldn't let me do anything else. So I closed the game and re-opened it. The game will no longer even show me menu options, but instead I am now shown an error of \"Verifying definitions 0/0\". I've tried a few things to fix this, but no matter what I try I still get the error. I am physically unable to play the game anymore. Yeah I probably could open a support ticket. Maybe they could fix it. However at this point I think I am just done with the game......not that I really have a choice in it.\n\nIf you decide to play the game I hope you see what happened to me, and know what could happen to you. So no, I cannot recommend to play a game that no longer even allows me to do so.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}