{
  "positive": [
    {
      "review": "I’ve been having an absolute blast with Soundpad. It’s super easy to use and works perfectly with Discord and in-game voice chat. I mainly use it to mess around with my friends — dropping memes, funny clips, or music mid-conversation — and it always gets a good laugh.\r\n\r\nThe setup is really straightforward once you get the hang of it, and the sound quality is great. You can assign hotkeys to any sound, which makes it quick and easy to play stuff without alt-tabbing. It also runs quietly in the background, so it doesn’t mess with your games or slow anything down.\r\n\r\nWhat I really like is how reliable it is — most other soundboard programs I’ve tried were buggy or didn’t work well with voice apps, but Soundpad just works. Whether it’s Discord, CS2, or any other game, it fits right in.\r\n\r\nIf you like joking around with friends or adding a bit of chaos to your voice chats, this is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Cheap alternative to phsyical soundpad that you can use in desktop but still did troll a lot of friends and players it was fun to use but all good things must come to an end when you do the soundpad funny moments after a while it starts go less funny so i will leave you maybe we will share a laugh in the future with new memes my good companion!\r\n\r\nNote: It is so easy to use it literaly nothing you can do wrong about it xd",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very useful for funny and wholesome moments in game c: Glad I got it. \r\n\r\nTIP: if you are unsure of wether or not you should purchase the software, you can try the DEMO first to see if it does what you want. That's what I did at first!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Straightforward software that either makes virtual socialization fun or gets you voice banned from every game you play. You have to download all your sounds and add them, which is the only tedious part. Very simple interface, and you can edit the texts to distinguish each sound you have added. Does what it needs to do!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Soundpad, developed and published by Leppsoft, is a versatile audio tool designed primarily for gamers, streamers, and online communicators who want to bring a new layer of interaction to their voice chats. It allows users to play sounds, music, and recorded clips directly through their microphone input so that others in a voice channel can hear them as if they were part of the live conversation. While the concept is simple, the execution is impressively polished, and Soundpad goes beyond being a mere soundboard—it’s a full-featured audio playback and editing suite built for convenience and performance.\n\nAt its core, Soundpad’s functionality revolves around its hotkey-based soundboard system. Users can assign sound files—whether they’re short memes, reaction clips, or entire songs—to specific keys on the keyboard. This setup enables seamless playback while gaming or chatting, letting users trigger sounds instantly without needing to alt-tab or pause what they’re doing. It supports a wide range of audio formats including MP3, WAV, FLAC, and OGG, giving users flexibility in organizing their sound libraries. The software also features volume normalization, which automatically adjusts the output of sound clips so that they match the user’s microphone volume. This small but significant feature prevents sudden jumps in loudness and ensures that audio clips blend naturally into conversation. The result is a smoother, more professional sound experience for both the user and their audience.\n\nOne of Soundpad’s most impressive aspects is its built-in recording and editing tools. Rather than relying on external programs, users can record any sound they hear on their computer or through their microphone, trim it, and immediately assign it to a hotkey—all within the same interface. This makes it ideal for quickly capturing a funny moment, a quote from a video, or a sound effect and using it right away. The interface is clean and intuitive, allowing for easy drag-and-drop organization of sound lists, while the search and filter functions make managing large libraries effortless. Even users who are not familiar with audio software will find Soundpad approachable thanks to its clear layout and straightforward workflow.\n\nFrom a technical standpoint, Soundpad runs efficiently and with minimal system impact. It installs as a lightweight audio driver that routes sounds through the same device your microphone uses, ensuring that your clips are heard directly in any program that accepts voice input—whether that’s Discord, Skype, Zoom, or in-game voice chat. The software is stable and rarely conflicts with other applications, though it does require administrative privileges during installation since it modifies the way your system handles audio input. Performance-wise, it’s optimized for responsiveness, which is crucial during gaming sessions or live streaming, where delays or stutters could ruin the effect. Users with modest hardware will also appreciate how little processing power Soundpad demands, making it suitable for just about any modern PC setup.\n\nDespite its strengths, Soundpad isn’t without limitations. The most common complaint from users concerns occasional audio quality loss, where sounds may come across as slightly compressed or tinny to listeners, especially if microphone filters or noise suppression settings in chat applications are too aggressive. This issue usually stems from how the audio is transmitted through the same codec that handles voice input, which naturally prioritizes clarity over high fidelity. Proper adjustment of in-app microphone settings typically resolves this, but it does require a bit of setup. Another minor drawback is that, because Soundpad installs a virtual audio driver, it can trigger system security warnings or conflict with certain recording software until configured correctly. For less tech-savvy users, the initial setup might feel intimidating, but once properly installed, it operates flawlessly.\n\nIn terms of value and usability, Soundpad has established itself as one of the best soundboard utilities available on Steam. Its reputation among users is overwhelmingly positive, with consistent praise for its reliability, lightweight design, and continuous developer support. The updates from Leppsoft have been frequent and meaningful, often adding compatibility improvements and refining features based on community feedback. The program also supports multiple languages, making it accessible to a global user base. Considering its low price point, the feature set it provides easily rivals or surpasses many free alternatives, which often come with ads, restrictions, or lack proper audio routing.\n\nSoundpad’s true appeal lies in how well it integrates into everyday digital communication. For gamers, it’s a way to enhance interactions with teammates and opponents through sound effects and humor. For streamers, it serves as an easy way to inject personality into live broadcasts without needing separate audio software or mixers. Even for casual users, it offers a creative outlet—adding sound cues to online meetings, classes, or calls can make otherwise mundane exchanges more entertaining. It doesn’t overcomplicate what it’s meant to do, yet it offers enough flexibility and precision for those who want fine control over their audio output.\n\nIn the end, Soundpad stands as a polished, reliable, and well-supported piece of software that fills its niche perfectly. It’s intuitive enough for casual use yet robust enough to satisfy experienced streamers and content creators. The combination of quick access, clean sound control, built-in editing, and system-level integration makes it one of the most complete soundboard solutions on the market. While it has a few technical quirks tied to its nature as an audio routing tool, these are minor compared to the value it provides. For anyone looking to bring creativity, humor, or personality into their voice chats and streams, Soundpad is an essential addition to the digital toolkit—a program that turns sound into a form of real-time expression.\n\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's an awesome tool for micspamming or just playing sounds in a VC, you can adjust the volume and edit sounds! The only bad thing is that it isn't possible to play 2 sounds at once. Overall it is very good for it's cheap price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good and simple. Works straight away without needing to mess around with audio inputs & outputs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best tools I've bought.  I can play funny sounds to my friends. If you want to do funny things, then buy it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soundpad is honestly one of the best programs I've ever used. I've never seen anything quite like it, and nothing comes close in terms of how smooth and reliable it is.\n\nI really hope the developers continue updating and improving it, because this software has huge potential and truly deserves even more polish.\n\nHighly recommended to everyone — absolutely top-tier!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this thing is the purchase on steam im the most proud of\r\n\r\nits absolutely perfect to use a couple meme sounds from youtube videos and overall make voice chat experience better, or just play uptempo hardcore 2021 mix by jehuty to absolutely destroy my friends' sanity (and maybe lose them all in the process)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best sound pad app on steam for $5 and its super simple to use. Works well on every game I play and any issues are pretty easy to resolve on my PC's end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good look up tutorial for it if you get confused. and also very good since you can have unlimited sounds becayse you download them yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "go into multiplayer games\r\nloaded up soundpad to have some fun\r\nuse various sounds get people to laugh\r\n10/10 would meme on people again\r\nbonus points meme on people on repo getting them killed for extra laughs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good buy. fun for roblox. wish there was a support server or something, annoying to have to figure out, even with the manual. greatest need for this app is a more direct way to open settings and such",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its good. one downside is that by default it shows the file's title instead of the file's name, so audio.mp3 or video.mp4 may look like {youtube to mp3}.mp3. other than that it's good, supports videos as well : D good purchase",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great peice of software, if I had any critisism it would be its tied to Steam running in the background.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice tool, but the software doesn't work properly; the sounds are often choppy and incomplete, as I noticed in Discord. I followed the instructions, but there was no improvement.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "W. i blast racist johnny rebel music to black people online.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "voice meter and this is a goated strategy for having a soundboard for any occasion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the unenlightened masses\r\nthey cannot make the judgement call\r\ngive up free will forever\r\ntheir voices wont be heard at all\r\ndisplayed obedience\r\nwhile never stepping out of line",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Def worth it, works really well, i just wish there was a way to check how your audio sounds while being used.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can now play Team Fortress 2 and play Distorted day in Paris after convincing the lobby to go all Spies \n\n10/10 product",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good, a lil goofy with Discord which pisses my friends and I off, but it's good honestly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been having a blast using this App to play 80s music over my mic while playing ARC Raiders",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keine Ahnung wie ich es geschafft habe 618 Stunden in dieser Software auszuhalten. Kann es Trotzdem Empfehlen. Man merkt kaum, das es im Hintergrund läuft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "то самое чувство когда юзнул не тот звук на тот самом моменте в хоррор игре",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "vewry good for trolling and playing music in your ears",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soundpad changed my life, from a whimpy ugly short kid to a tall built strong handsome man, could never have done it without soundpad and the dedication I have put into soundpad, best 5 dollars ever spent.\nthank you Soundpad❤️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic easy to use platform for playing sounds in games like foxhole :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ts is literally the best app to play yt music gng, trust me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy to use and fun to troll with, but you'll prob get banned in every server and then ur friends will yell at you :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A necessary weapon in games for psychological warfare!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "hey vsause, michel here. the us nukular launch codes are safe, or are they?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "takes a min to understand but once you have it it works wonderful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you use a soundboard like voice mod but cant find it on there you can record the audio you want and play it on here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can force people to listen to annoying sounds in discord 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simplesmente o melhor aplicativo para colocar sons no microfone em tempo real, interface simples de usar, a única parte um pouco mais complexa é deixar tudo configurado certinho, de resto, é um ótimo programa\r\n\r\nSuper recomendo!\r\n\r\n10/10 <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good software soundbaord thingy with many good soundboard features",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it can play audio thru mic, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is probably top 3 software\r\nthe others are probably wallpaper engine and sfm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has so many option for sounds peak software worth the money",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Можно довести людей до суецида,  рекомендую.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "отлично подходит, что бы превратить хоррор в ржаку",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can scare you'r friends while playing horror games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is very useful... don't look at my time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice funny app",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good for playing music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good tool for annoying your friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best thing ever i love this thing so much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD FOR GAMING AND PLAYING SOUNDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i can troll my friends with this i fwking love it <333",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bro really spent money on a moneyboard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its funny af. i recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing for a soundboard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gameplay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy to use, worth the money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "discord raid simulator",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "can I get a refund",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it now all i need left is a soundborad LOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "does what it should do , perfect !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jumpscare simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good if u wanna be annoying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than spotify",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you figure it out, it's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trolling friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good bruh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its awesome",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "easy to operate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best soundboard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good uhh soundboard yaya",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok ig",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good app",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i listened music with this, i got bullied.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "muito bom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "god",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "does what it says",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Имбулечка",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Guacamole nigga penis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works as intended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it works well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just ate 2 whole pizzas help mw",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "норм включать стоны в дс",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "does as advertised",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid for trolling russians",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good soundboard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good sounds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a simple sound board.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "theres no youtube video that shows actually easily it was too complicated",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its aight ig, could be better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah, this software is problematic as hell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the worst apps I have paid for. No joke.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this too scary \r\n:steam_cumming:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "use this if ur annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ну так, не очень",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "iubgdiubdfgziundfgz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly too many hours on this game, its just not viable for the squad, maybe come back in a year and I'll see if it's any better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trying to inject this into the audio stream the way that you would with a soundboard is an inconsistent nightmare.  Not suggested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of negative reviews for this app are written by monkeys with cymbals\n\nit function",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible trying to get this to work on discord. sound keeps cutting out before the playback ends. followed all the steps online",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "difficult program, I couldn't figure out how to use it 1/10",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}