{
  "positive": [
    {
      "review": "Its depressing that we will not experience a video game like this ever again. If you want to enjoy other video games I would not recommend playing this.",
      "voted_up": true,
      "votes_helpful": 200
    },
    {
      "review": "I decided to play the game as I would in real life. In the end, the game told me that I was pathetic, and then I spent the night in a trash can and the game ended.",
      "voted_up": true,
      "votes_helpful": 82
    },
    {
      "review": "GET THIS GAME FROM ANYONE ASIDE THE PUBLISHERS HERE, THEY ARE EVIL.\n\nPeople who don't give this this game a chance either have no sense in art or can't play a game that \"don't have gun or ball in it\", this game has made me question why i haven't killed myself yet, or if there is a true reason beyond my own misery. It is a true staple of diving into the depths that are our own minds, for better, or worse.",
      "voted_up": true,
      "votes_helpful": 106
    },
    {
      "review": "It's been a while to play a proper detective game where your focus is mainly on you and the world around you while also doing your job as well. The lore is superb, you keep want to learn more about it and the characters are just straight out of the reality. Like there's no \"right\" or \"wrong\" way to do things or talk about. Since you're a human and others are, so not everything goes like a checklist in a linear way in most of the games we see.\r\n\r\nYour set of skills is super important but it's not like if you miss one thing you'll be locked out of the game or something very crucial. And sometimes you can salvage the situation but sometimes it was already too late. The voice acting in this game is just god-tier, it's insane how much different characters they fit in this so small world. And the things you pay attention or do has its own effects in the future conversations or actions. It's really masterfully done and you need to improvise a lot if you want to get through from tough situations.\r\n\r\nWriting is also on par with acting so the world they created is one of a kind and really portrays people's feelings towards the things happened in the past and nowadays. Probably Disco Elysium is the only game that captures the emotional and intellectual complexities of human beings perfectly. You can clearly see it throughout in the game. The most mesmerising thing about the game is your inner voices and feelings which is a great add-on and they do sure make the game much fun, like by tens of thousands.\r\n\r\nYou can't go blind like trusting everything they say but sometimes they do make sense even the least sane of your feelings so you have to pick carefully otherwise you might end up with very absurd situations which is fun. You really get a grasp of your character's mental struggles and how he copes against the world and the events that affected him so you can either redeem yourself and lead by example or just drag yourself into the lowest of lows with all around you.\r\n\r\nIt's a shame we never get a second one and what they did to the developers so yeah it's a sad reality. It's very ironic, game mocks of capitalism does the very thing he swore to destroy. If you're into this kind of games then you've played this already. So for new comers I don't think it's not that overwhelming unless you're playing on hardcore mode so you can save scum to try again or go with to the end see what happens. I did both depending on the situation, mostly went with the original outcome to be realistic as possible but of course bad rolls happen in the most unexpected times.\r\n\r\nI enjoyed every second of it, and I wish it was much longer and never ended. Really one of a kind.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "closest thing to literature I've played to date, literally more a philosophical farce performed inside a collapsing psyche than a detective game. Your mind is a bickering committee of failed academics with Electrochemistry behaving like it just raided the faculty lounge drug cabinet. And Revachol mirrors this fragmentation. The city's failed ideologies and broken history form a living archive of disappointed ideals, which makes the murder case feel secondary to the way more interesting project of reconstructing a self out of ideological debris\n\nthe writing is amazing too, funny as shit, erudite, and unexpectedly emotional at times\n\nand then there’s Kim, a quiet argument for dignity in a world allergic to it, the one stable footnote that keeps your entire existential essay from blowing away\n\nmust play if you're into psychology, politics, philosophy, or literature for sure",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "I made sure too 100% this again after I switched steam accounts. Definitely my favorite game of all time. I'd perform a circumcision on myself using a dull zweihander if it meant I could experience playing this for the first time again.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Amazing how sometimes completely trivial situations happen to trigger incredibly complicated and messed up sequences of events. That's a nice way to describe Disco Elysium. It doesn't try to come up with something extraordinary just to stumble upon a challenge of tying up all the loose ends. In a sense it's like a storm that's so sporadic and methodical at the same time. You have a direction but that's not the real point. The most outstanding parts are interwoven through: the city, the people, their motivations and relationships. Same kinda goes for the gameplay and roleplaying elements. Vertical dialogue box and basic skills developed into parts of Harry's psyche are such neat and organic details.\n\nIt's completely absurd yet so elegant. Often way out there but so relatable in the end. Disco reminds that you're not supposed to resolve everything life throws at you. It's a story about coming to terms with yourself and the world around. Some things you leave behind and move on. And some things always stay with you.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Disco Elysium is a pretty exceptional surrealist detective role playing game.\nYour initial goal of solving a murder in the city of Revachol quickly spirals and branches out into an intricate web of really memorable quests and encounters all across the city.  \n\nThe world building and character work in this game are incredibly strong, having your skill system be structured as representing all the facets of your physiological profile and having those personality traits clash and interact with each other over the course of the game is pretty genius. Many potential fail-states can lead to really hilarious outcomes and the game does a great job of de-insentivizing just reloading and trying again. \n\nIf you run Logic, Perception and Empathy as your main skills, you’ll be an eagle-eyed, hyper logical ‘relatively’ (focus on relatively) emotionally stable super detective. Whereas if you run completely different traits like Drama, Electrochemistry or Inland Empire, you’ll have a wildly different experience, like being a free-wheeling psychotropically-stimulated coked-out sociopathic maniac. \n\nSome of the funniest stuff I’ve ever heard in a video game are in Disco Elysium, there’s some savage, amazing responses to conversations you can have with people. There are also some legitimately excellent dramatic interactions you have as well, which do a great job of adding real depth to many of the characters you meet throughout the story. \n\nDisco Elysium is a fantastic game, the original developers did a great job with this and created a genuinely excellent RPG. Super solid work. Big recommendation.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Probably one of if not the greatest RPG's ive ever played. The writing is some of the best ever and i think everyone should try it out",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Incredible game. It's so immersive with its world building and narration. The art and soundtrack are just so good. It's everything I wanted the game to be and more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game changed my understanding of games and gave me countless completely different emotions, from laughter to sadness. It also has a wonderful style and world-building that makes you want to explore and delve into it, trying to discover absolutely everything hidden from your eyes. The characters are incredibly cool, of all ages and personalities, and each requires a different approach. I especially enjoyed interacting with my Skills. My favorites are Authority and Half Light, and probably also Drama and Volition. Disco Elysium worth every penny. You should definitely play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wake up monstrously hungover after an epic, mind-erasing bender and try to re-discover the world, re-invent your ego and and re-conceptualize existence itself. Oh, and solve a murder, I guess.\n\nDisco Elysium is a non-traditional RPG with stellar writing, interesting world-buidling and a keen sense for  all the major and minor philosophical and political implications of the human condition. The run-down, pitiful bleakness of it's world serves as a stark and effective contrast to the sheer delusional grandiosity of the MCs inner monologue. \n\nThe way your character tries to make sense of the world by listening to the voices in his head is witty and cynical, sometimes touching, occasionally absurd - but steadfastly humanizing. The same goes for all NPCs sharing the world. You'll meet colorful people from all walks of life, with varying convictions, motives and flaws - but never devolving into mere caricatures. That's what makes it special.\n\nDisco Elysium is also a massive heap of (brilliantly voice-acted) text that loves to elope on intrigueing but absolutely inconsequential tangents, so buckle up! You'll be rewarded with one of the most unique and memorable gaming experiences ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Disco Elysium is one of the most unique and brilliantly written RPGs I’ve ever played. Its world feels alive, its characters are unforgettable, and the freedom it gives you to shape your detective’s personality makes every playthrough feel personal. The writing is sharp, funny, and emotional all at once, and the game constantly rewards curiosity and creativity. An absolute must-play for anyone who loves storytelling in games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "looking forward to when I hate myself enough to learn from this game, it's probably coming up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(Just talking about the game, not the fraud bs around it)\r\n\r\nThis game is special. Very cool art style, one of the most well written dialoges I've seen in quite some time but there is A LOT of talking, like 90% so if you are not a fan of it and you crave for action, this is not for you. Your decisions have consequences in this game which is really good. The different aspects of your personality that keep trying to influence your actions is very unique and cool. \r\n\r\nI dislike some of the topics that I just didn't find interesting like the cryptospecies stuff and the church thing (Im being vague cause I dont wanna spoil) but I guess its personal preference and almost everything else was very entertaining.\r\nTake your time with this game. Very good.\r\n\r\nF*** Cuno, that f*****!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an amazing experience from start to finish. People have been recommending this game to me for years, and ive been meaning to try it for just as long. Somehow managed to avoid any spoilers or insight going in and man am i glad. I would pay an almost infinite amount of money to play this game blind again. Please only buy if its on sale supposedly the publishers screwed the devs and artists over and purchases no longer go to the beautiful genius minds that created it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of those very few games you get every so often that actively ruin every game you play after. Its utter perfection.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Now I have only played 6hrs of this 'interactive novel' I'd call it, and I can't wait to see what else is in store. The best way I can put this game's premise into words is if one day *you*, your very self as you are right now, suddenly woke up as a detective in this world that you know absolutely nothing about, as you have attained amnesia from drinking and on top of that, you have bipolar personality disorder. You're presented with this 'clean' slate of a character to build your own personality upon, or make one up entirely with the unique trait system. Want to be a walking encyclopedia, knowing facts about everything? Maybe someone who daydreams far too much to the point where you can talk to your own necktie? A scary fasination for chemical abuse? And the best part is that all these different 'traits' of you have their own voice, and chime in during dialogue when relevant.\n\nI've never been a reader of books or anything, especially in this age of short-form content, but there is something about this game that keeps me engaged with every character I meet; they're incredibly well written, hard to forget, and the dialogue options never fail to entertain. You'll wander through the town and recall every conversation you had with these people. I also can't shake this feeling of having to 'impress' my detective partner, Kim, at any possible given opportunity as I feel that I am having to uphold this title of 'detective' even though we're definitely not qualified. Where is my gun and badge?\n\nIf you're looking for action, this game is not it, unfortunately. In 6hrs of playtime, I'm just about to finish the first in-game day and all of it has been world-building and talking, so it is very slow and you shouldn't expect shootouts, blood and guts, and explosions. But for me, I don't need that and I'm having a great time with the game without it. I'll be playing more of this, for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game written by very smart people, working very hard, to make a few identifiable arguments, and a lot of fun with the human condition. Genuine art, that's academically challenging.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crazily good. Played it once just to realize that I will definitely play it at least one more time with different choices. Also with more focus on the side quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "-“I talk to myself so I don’t forget who I am”-\n\nHave you ever felt trapped inside your own head?\nWhere every thought ricochets off the walls of your mind in perfect discord\n\nMurder… Mystery… and some kind of.. Superstar\n\nToday we’re talking about ZA/UM’s 2019 role playing game, Disco Elysium.\n\nA dialogue heavy story told through skill checks dice rolls and a thirst for… Oblivion\n\nHarry is an amnesiac cop sent to the mucky port city of Revachol, deep in the district of Martinaise. A melancholy world painted through an emotional collage of oil. A war-torn zone of control, caught between a political limbo and economic depression. \n\nYou, Along with your ever-composed partner, Kim, are part of the Revachol Citizens Militia. Investigating the murder of the hanging man.\n\nUncover the secrets and history behind Revachol as decaying architecture expands beneath your feet into a world that’ll swallow you whole. Running into eccentric and unforgettable characters along the way, such as the philosophical Cuno.\n\n-“What’s with that third person shit, Cuno is first person”-\n\nThe writing in this game is so deeply immersive, done in a way I could only hope for. Sometimes holding the mirror up to you, breaking the 4th wall in amusing and unsettling ways, reminding you who’s really in charge.\n\nGet lost in the words as they brush the wrinkles on your brain. Every choice shaping your personality and defining who you are or may become. \n\nFans of Baldurs Gate 3 or Return of the Obra Dinn should definitely give this game a try.\n\nYou’ll find yourself engrossed for days in this murder mystery RPG. By the time you’re done your chair will have a butt imprint, and the once rigid, harsh streets of Revachol will sit as a cozy memory in your head.\nSo if you give it a shot, let me know what you think.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Perhaps the greatest game i’ve ever lived to play.\r\n\r\nnothing that could never be summarized, nothing that can be simply written about in a few paragraphs, nothing that can be explained. Only felt, deafened and burnt by. experience would be an understatement.\r\n\r\nTRANSCENDENT COP COMMUNIST FRIENDSHIP HALLUCINATORY FUN.\r\n\r\nthis is the only thing on earth that perfectly utilizes language. sure perhaps you are speechless but every twitch in your hair and body has meaning and a different perspective that will be verbalized. the way god intended.\r\n\r\nAbstract questions answered by with what can only be comprehended by few. \r\n\r\nI Love You.\r\n\r\n\r\nDERANGED COP KILLS HIMSELF.\r\nDERANGED COP ELECTROCUTES SELF.\r\nDISGRACED COP SLEEPS IN TRASH.\r\nDISTRICT IN MOURNING: BURNED-OUT COP SHOOTS CHILD.\r\nCOP DIES IN HEROIC ATTEMPT TO APPREHEND SUSPECT IN MURDER INVESTIGATION.\r\n\r\npirate it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got it on sale, and I can't believe how fun it is. Worth the full price - if you like choose your own adventure novels... if you're looking to explore a true piece of art... this is it.\r\n\r\nThis is really intelligent stuff, I love it <3 Wish I played it sooner :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Made me reflect on why i have not killed myself until now. \r\nI don't know the answer but neither does the game provide you one.\r\nDeliverer of bad news is what i felt playing this game. \r\nTruly Disco And Inferno.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game genuinely made me a better person. its like Kurvitz said, i now feel stronger and more equipped to carry on with my life as i return from this game (after playing it multiple times)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This one is a slow burn. It took me restarting a few times before I could really get into it. It's VERY exposition heavy. But man, now that I've completed it, I recommend it to every person I possibly can. Disco Elysium is among my favorite games of all time. It's truly a masterpiece. Stop reading the reviews, don't spoil it for yourself. Just play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While very text-heavy, this is one of the best games I've ever played, but in my opinion nobody should give their money to a company that stole the IP from the actual creators, booted them out of the company, lied about it, left some of the devs and writers bankrupt and in at least one case unable to work in the industry for several years. They've now sullied their vision further by making a mobile game version with microtransactions and a strictly linear story with new art that tries and fails to copy the original.\n\nIt's very easy to get this game through... \"other means\" and that's exactly what anyone who wants to play it should do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the amount of shady deals, behind-the-scenes drama, corporate takeovers surrounding this game and the \"spiritual successors\" in the works of varying artistic integrity all feel like an additional layer of meta-commentary.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly one of the best games ever created philosophy mixed with whacky nonsense. imagine a TTRPG and add genuine depth of characters. it's too unique to put into words let your reptilian brain run free. p.s. there's a lot of reading involved",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "one of the best games I played. amazing atmosphere, dialogue and storytelling. I don't play through story games more than twice most of the time but this game just had so much to offer.\nBUT. you should pirate it. a lot of stuff has happened to this game and the studio, so know if you buy it you won't be supporting the people that actually worked hard for it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I cannot get a single one of my friends to play this game which is a disgrace because it's amazing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best written novels I've ever read. Super emotional, intriguing, fun, clever, dense, impactful... This game deserves every compliment such game could've had. A masterpiece, an incredible work of art that I will be cherishing through my life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Six years, and to this day. Still remains a masterpiece of an art, despite its creative minds' tragic outcome.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loved every bit of this game, i came into it totally blind and had no idea what to expect. i was put off it in the beginning with how heavy it was on cryptic dialogue, but after 2 years i finally managed to play it and finished it within a few weeks. A shame the studio got split into a million pieces so a sequel will not happen :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "god-tier adventure game about a chronic alcoholic, who turns to be commie, LOVE IT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Visually striking and the best video game writing I've ever experienced. If you like story or roleplaying games, this is a must-play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "congratulations to disco elysium for being the only game to have cuno",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, funny, and heavy one of the best story games I've experienced.  The way they took the rights away from the original maker does make me wish I found a different way to play the game rather than giving money to a company that didn't have anything to do with the making of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "genuinely such an amazing game. I love the dynamic between kim and harry, genuinely did not get bored of it my entire playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "finally finished it on my third (maybe fourth) attempt. 95% of the playthrough was on the Steam Deck, and that's probably the sole reason why i was able to finish it. It plays so well (optimisation in some scenes is rough but that's just the game)\r\n\r\napart from that, it is peak. great game, with an amazing world, have interacted with few RPGs with such great characters, factions, and an overarching setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far I've put five hours into the game and I've become a fallen off, working class racial misogynistic nationalist with amnesia. \n\np.s: i also died from a heart attack in my first run because I sat down in the wrong chair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games I have ever played. There is nothing like it. This is art. It can be kind of hard to get into though but just give it a fair try and it will sink its teeth into you. The story is the main reason to play this game, don't come for the gameplay, (which is not the focus anyway) come for the story, and I promise you will stay for the story. The story is depressing at first glance, but if you dig deeper, it is truly beautiful. It really makes you think about yourself, politics, economics, romance, and what it means to be human. I encountered concepts and perspectives that had never crossed my mind before [laying, and I am confident in saying that I am better for it. \n\n\tThe characters in this game are truly amazing. They all feel like real people, with real stories that you get to uncover. They are very memorable and full of soul, partly due to the amazing voice acting. It is all top notch; the voice actors did a lovely job. Every single line is delivered with thought and care, enhancing the experience to greater heights. \n\n\tThe gameplay, which was never a draw for me, is still good. It is mostly talking to people, but most conversations are well written and interesting. It is fun and lets you experiment and do and say weird stuff, without punishing you for it, in fact, sometimes the game encourages you to say some outrageous things to make progress, which is all great. \n\n\tA final thing I want to highlight is the visuals. They are lovely. Each of the characters' portraits are beautiful paintings that tell you everything you need to know about the character by looking at them. The world is mostly bleak, but with splashes of color that remind you it is still alive and there is still hope for positive change. \n\nThe worst thing about this game, however, has nothing to do with the game, and everything to do with the publishers. They effectively stole this game from its creators, soooo... do with that what you will. (if you catch my drift) \n\nOverall, this is an experience unlike any other, and everyone should at least give it a fair try. It is one of the best stories ever written with amazing characters, writing, and art direction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Planescape or KOTOR 2 of our generation. This game has entirely changed what I think of as possible in RPGs of all types, has prodded me to reexamine my engagement with any one of a hundred topics, has made me laugh and cry. When so many RPGs are trying to be as wide as possible, this game proves that there is an incredible power in creating a finite space of characters and places to a very high degree of fidelity. That such a transcendent success could come from such a troubled cycle of development, even to this day, is only further testament to its greatness.\nI'm still in that hotel room, that plaza, that church, that pier, that yard, that house, that empty building. [spoiler] I'm still on that rooftop, where for me, things have never since been the same. [/spoiler] I know I'm not alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really something else. It ponders on depth i have only ever encountered in my own head and hence i liked it immesurably. Buy this masterpeace !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok, so I haven't replayed games for god knows how long. \r\nMy second playthrough of Disco Elisium started a couple od hours after I'd wrapped up the first one. Cannot recommend enough. \r\n\r\nBeautifully written, masterfully and soulfully voiced. \r\nHas to come wih a bit of a caveat, tho - this is basically a reading simulator. The script and voice work are effing stellar. There might be a bit of an lore info dump here and there, but all the non-essential stuff is easily skippable, and the essential stuff... it will keep you hooked, I promise.\r\n\r\nI've only basically found one hitch with one of the quests, and one bug that was solved but a reload. \r\n\r\nI put off this game for what feels like eternity and now I'm eternally said that it's over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of a kind experience. The ancient reptilian brain beckons you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an epic poetry for the next eternity. Play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the most unique experiences I've ever played. At first I was really unsure about continuing it — I started it, dropped it, and returned to it several times. The beginning was confusing for me; I didn’t know how to progress the missions, and my build was a mess. But after restarting a few times, I finally understood the game’s flow.\n\nOnce everything clicked, it became incredibly enjoyable. The game truly makes you feel like a real detective. Every character has a strong, unique personality, and not a single one feels unnecessary or unimportant.\n\nI played this during one of the darkest days of my life, and somehow it still managed to give me hope and a bit of light. Even until the final moments, I couldn't predict who the killer was.\n\nA remarkable and unforgettable experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutelly amazing piece of game. Great and interesting story, great music that fits the atmosphere perfectly, little bit crazy characters, but they are interesting and you never seen anything like this in any other point and click adventure. Story is great and you can influence storyline. Really worth of try, especially in sale, that's must to have for everyone who likes story driven games, and point and click adventures with some interesting characters and not more of the same feeling...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was worth every cent, i can't put into words how great this game is, you will have to play it yourself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing story, artwork, writing, soundtrack, characters! All of it! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An story-rich adventure game which is also a role playing game where you not only have conversations with  other characters but also with different parts of your mind depending on your choices when levelling up. This makes the game less linear. The artwork and sound track are beautiful. The final cut also has voice over which is a big plus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically a visual novel with RPG elements. The writing is seriously impressive, it's hard to believe each line of the game is voiced over with pretty dang good voice acting. \n\nIf you are going through a rough patch, you will be able to relate to Harry in ways that will make you uncomfortable at times, the game is very dark and dives deep into the dark pit of despair that is Harry's mental health.\n\nI really like Kim, I want to say he is one of my favorite side characters of all time, he makes the game much better than what it would be if Harry was alone.\n\nIt's good, but you have to be willing to read an absurd amount, and either you will find comfort in it's depressing messages or it will just put you off. Your call. I think it's a must play if you appreciate good writing, as this game explores the human psyche in a way that is exceptional on any level of medium",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game that has completely unraveled me multiple times. While emotionally devastating at times, it's also a good portrayal of a very real lived experience while dipping into paranormal if you choose to. I've played a few times to get different experiences and still have found things that I've never seen in previous saves. The only negative is that I do wish your personal relationships with a few characters could be fleshed out more in a different way than the game allows. But perhaps that's just my personal attachment to the characters speaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Было ли хорошей идеей проходить это после постановления двух психиатрических диагнозов и официального подтверждения синдрома дефицита внимания? До сих пор не знаю. Жалею ли я? Ни в коем случае. \r\n\r\nДиско Элизиум - это игра, которую я с полной уверенностью могу назвать произведением искусства. Именно ради этого я играю в игры в принципе. Но проходить и правда было тяжело. Мне понадобилось три полноценных подхода для того, чтобы добить эту игру. И дело не в интересе, а в том, какое настроение задает тон повествования. \r\nЯ рад, что смог долечить себя до того состояния, чтобы позволить себе увидеть эту картину.\r\nСпасибо тому, кто придумал весь этот мир. Жаль, что его так жестко кинули.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played a game like this before. It was an engaging experience from start to finish!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly the most Lychian game ever. Incredible character design, exceptional worldbuilding, and possibly the second greatest piece of OST I've ever heard. And yet, those aren't even its biggest selling point. \n\nIt's very rare that we're able to talk about the strength of a game's writing in the way that a literary critic would talk about the strength of a book's writing. Disco Elysium's writing is undeniably the best the world of video game has to offer. To have the entire game through the lens of a lunatic's internal monologue and his journey through the land of Revachol - the land of historical materialist, unoriginated mythological messiah and *****. A one-of-a-kind experience that you can never get in any other types of medium.\n\nAbsolute HARDCORE to the mega. (Also, f**k Cunoesse, worst character ever)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is easily one of my favorite games I have ever played. Harry and Kim are both some of the most interesting and realistic characters I've seen, and the writing and world-building is just so amazing. I would also buy this game on sale (a heavy sale) or pirate it because the publishers, ZA/UM, suck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I rarely manage to stay in a game for long, because I get bored quickly and get distracted by something more interesting in real life. But Disco Elysium was a real discovery for me. I played it obsessively for hours and went to bed thinking that the next day I’d become the disco cop again and continue the investigation.\nHighly recommended. No question about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very tuff im scared for when i finally finish it bc its so unique",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i cant tell much, im just gonna say, whether you buy it on discount or not, its worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disco Elysium has already won me over as one of my favourite narrative titles of all time.\nI’ve only played through this game once so far but I can tell this is one I’ll revisit many times and experiment with a variety of new builds because honestly, this game basically lets you play however you want in unique ways I haven’t really seen done before.\nAn absolute gem of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m not here to judge the artist, but the art. And man, Disco Elysium is a magnificent piece of art—its writing, artwork, scenery, and wordcraft are exceptional.\n\nOne of my top RPGs ever… hell, one of my top games ever. Even if you don’t usually enjoy reading, give this one a try. The 40–50 hour journey is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kid called me a pedo for asking him why he talks in the third person, and then I had a mental breakdown resulting in game over. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not even a fan of Narrative type RPGs, but this is one hell of a game. The Philosophical take and Story telling was absolutely brilliant. (Now I want more)\n\n\"No. This is somewhere to be. This is all you have, but it's still something. Streets and sodium lights. The sky, the world. You're still alive.\" -Volition",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Occasionally there's a multimodal masterpiece that touches on all the softest and most bedraggled places inside you and makes demands of your fundamental humanity to be accountable for the state of the universe. \nThat surveys the sum of the furthest reaches of where you have extended your thinking and makes all those years of feeling mushy minded into an actual shame because you may go there all the time on your own but other people are speaking it out into the world in ways that display such thoroughly grounded comprehension. It feels like love making of the sort you could've and should've been offering to the world if you'd just only been slightly less broken.\nAnd you're left breathless and enthralled and so grateful that the handheld dimensions of which we're the inheritors are being used by visionaries to glorify the heart of the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unique of its kind. After 4 hours of gaming. It totally absorved me. These hours but i can say also that is a relaxing game also.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible journey from start to finish. I don't think I've played a game so detailed and thorough in my life. Never lose your DISCO!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible Story, fun exploration, interesting characters. Laid back and great for anyone looking for a more slow paced, semi casual experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just a blast. so deep and engaging, you wont even realise there isnt any combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this was not what I was expecting.\n\nA pure 10/10 experience.\nI started a deadbeat cop, and ended...well...not much better than a deadbeat cop.\n\nI loved this game entirely. The dialogue, the characters, the setting and everything about this experience lends to this game becoming a thoroughly enveloping experience.\nI'll have to play this 1-3 more times and do things wayyyy different!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played a game with this strong a narrative since...I don't know. Maybe I never have. \n\nEvery character is great and serves a purpose.\n\nWhat first feels like a silly side quest can end up being the most important quest in the game.\n\nI only unlocked 7 out of 45 achievements on my first playthrough. When I skimmed the ones I missed, I saw names of characters I didn't even meet! I took everything not to immediately start a new game.\n\nThe voice acting is good, but can make the pace drag a bit. This is my only complaint.\n\n\nThis game should have won a freaking Pulitzer. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is art, pure and simple.\r\n\r\nThe writing, the music, the illustration...it all comes together to create a unique, haunting experience. Games like this need to be celebrated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this game on Steam. Pirate it, buy it second hand, get a key from another seller ( usually cheaper anyway ). The company has screwed over the creators, taking their world hostage. Do not support these people. Play this amazing game without showing them a cent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm too slow. This game clicked for me after I dropped it and came back 2 years later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put off playing this for years for no particular reason, which I regret. This game is like an engaging novel in the best way. It's extremely well written, fascinating world and characters, stellar music, the list goes on. It also includes politics in a way that is never forced, cringeworthy, or out of place. I particularly love the voice acting for the narrator and all the characters, which is an addition brought about by the final cut. However, my favourite part of this game has to be the emotions, who are characters themselves. While talking to people in the world, emotions relevant to the conversation will chime in and provide insight, egg you on to do something or simply comment on the person, it's really entertaining. I'm hardly near the end as of writing this, but it's truly a unique game I won't forget.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool worldbuilding. Everything is important. Everything connects. A game that makes you yearn for learning more. One of the coolest games I have played. (Though sometimes reading all the worldbuilding and lore that is randomly dumped on you when doing a completely unrelated quest can at times be a bit overstimulating.) Still a great game, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterpiece. Just keep in mind there is zero combat gameplay, it's just dialogues and skill checks.\r\n\r\nThe ending felt a little bit too abrupt though, even though it had some amazing sequences in the final act.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First playthrough took 28 hours.\r\n\r\nIt's masterpiece of writing. Not even of gaming per se. Its funny, sad and wise. Not much else to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is this the best I have ever played? Absolutely yes.\nHow many times have I played it? 2, and I am gonna play it again.\nIs there any other game that can be close in terms of music, atmosphere, plot, humor, philosophy, world-building? I am not aware of it.\n\nThis game is truly special and one of a kind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the dialogue and the world of the game, just amazing so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game pirated for MANY more hours than I have on steam. Truly one of the only games that can get me invested in a story aside from Red Dead Redemption 2 and Fallout New Vegas. The variety in options and the raw atmosphere and character is astounding. This game is a masterpiece. It is beyond clear that a lot of love went into developing this game. While it can be confusing for me at least what to do at times. Which can conflict with the pacing of the game. When you do get on the right track. Each story moment and character interaction is definitely worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never played a game in this genre before. It’s a narrative click and play game. I didn’t think i would enjoy but im glad i ran it. \n\nIt hooked me up from the first minute \nMusic: Peak\nVoice acting: Peak if not the (best)\nGame mechanics: perfect for the game \nArt style: Peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's completely okay to talk to yourself, it's the voices answering you that you should worry about.\r\n\r\n11/10. Best limbic system vs. ADHD simulator ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must play game for everyone who likes CRPG's! It revived the genre, and I am looking forward to their next game, but be cautious because the studio had massive fallout with members and i assume a massive shakeup as well. Lets hope they don't ruin the next game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game struck a nerve personally. it hadn't been my cup of tea when i started playing and i didn't understand why people loved this game.\n\nthat was until i set foot onto the beach. then the reality of it all kicked in.\nthe game won't hesitate to give you a gut punch you'd never expect. and there lie's the beauty of it all. the idea of it all going down the drain, hopelessly drowning in the sorrow, shame and regret of it all, and wondering how you're redeem yourself from it all. \n\n as one of my steam friends wrote: \n\n“This game is a genuine work of ART, meaning upon completion, this game will live inside you. You can leave Revachol, but Revachol will never leave you.\n\nfor fans of: doom, despair, unending aches of the existential variety, redemption, disco-superstars, the heart broken, the drunken & drugged, both the honorable and dishonorable, detectives, criminals, thinkers, artists, fascists, capitalist pigs, desperate commies, and the a-political alike.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game's I've ever played. Lots of reading but fully worth it. Love that the role playing is done by skill checking your personality stats (empathy, logic, how well you can handle drugs) with top tier world building and characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A genuinely absolutely incredible game. Amazing story, beautiful visuals, top-tier writing both comedically and emotionally. However, like everyone else here says, don't support ZA/UM. Find a different way to get the game whether it be through a cdkey or sailing the seven seas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most uniquely beautiful games I've ever played. The dialogue, story, and lore (as far as I understand it anyway) are all 10/10, and it truly feels like a \"play your own way\" type of experience. By most accounts, the publishers are scumbags though... so there is that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game/novel i played so far, although i feel bad for the drama that happened in the studio.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm 47. This is the first game I've ever played in my life that is literature. And not just literature, but *great* literature.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Masterpiece. Don't overthink your choices, don't worry about missing out on stuff, don't worry about what's the \"best\" choice. Just play the game.\r\n\r\nYou will get overwhelmed by choice, and by the sheer amount of tasks, but just do whatever's in front of you. This game is so well designed that you'll get through it. Explore, have fun with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game... want the Locus city sequel but it's not gonna be the same without the creators either way, it's sad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most amazing games i have ever played. Now that I have a PC again, I am going to start over to experience it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have hesitated for a long time to try Disco Elysium and after multiple recommendations from my friends I gave it a go. Oh my days - what a journey that was.\n\nI am usually drawn more towards action games so the idea of playing a game that is based mostly on dialogues and is basically a huge book was not very apppealing to me. Having said that - I had more fun reading here than shooting, jumping and fighting monsters in some of my favourite games. \n\nStory keeps you engaged non-stop from beginning to an end, the characters are well written and the atmosphere is out of this world. I did struggle at times with following the deeper philosophical aspects of the game but it did not negatively impact my experience at all.  \n\nDisco Elysium is a unique experience that at least at the time I am writing this review is, I believe, not comparable to anything else on the gaming market right now. Even if you feel that a game like this are not 'your cup of tea' I would highly recommend picking it up on sale and giving it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played through this game four times now (first two playthroughs being on the PS4), and I have thoroughly enjoyed it each time. There's something very hopeful about the game, something that really inspires me to do better, it makes me wish I had a mini-volition in my head (well, apart from the SRS stuff). It is a pity ZAUM had to implode, but at least they gave us this. It is a wonderful experience, and one I would always recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An unique, slow-paced gameplay with lots of interesting encounters and dialogues. Not many hours played but sinked in completely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "u like to read walls of text within the game? even if that make no sense, but u like to figure out wtf is gong on there? u find process of that intriguing and u like mystery aka detective solving activities? probably u like just to have great laugh about that all and troll that adventure with no tomorrow? then this game is for u my friend. Quality production on all aspects of game, sound, visual, chars, progression ect., developers worked hard for this and game shows that. Great stuff, ty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "provoking and challenging, the game reflects upon you as a player and if you find something horrific and disgusting, you should take a look at where you are in life.\n\ntheres some bugs here and there though, just reload. hope this world can return to its creator one day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like a mix between an RPG and a Visual Novel. Very good voice acting and a pretty solid story. Doesn't just serve itself on a silver platter. You gotta work for it.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "incredible game-- don't buy it, the wretched moneymen forced the devs out of their own studio",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "great game bad company dont buy this gem look it up for free instead",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I just played DE for the first time this month, after having owned it for years and never having the emotional bandwith free to play it. It's wonderful, painful, fun, interesting. I laughed an awful lot. I cried. I had to put the game aside at times to struggle with the very real and painful feelings it brought up.\n\nI loved it.\n\nDo not buy it. \n\nThe IP, a world fashioned by a DM and players, has been stolen from the people who thought it up. There's been allegations of financial fraud commited by the publisher to in order to steal the IP. The poeople who made this world were kicked out.\n\nIf you haven't got a copy of the game, find another way to get it. \n\nThe nice thing about being half a decade late to the party is that there's so much more information about what happened. It's pretty gross. I'm still digging through this game, still raw from the writing and I'm so, so angry that this lovely, hopeful, delicate and painful world is closed off to me outside of this game because some dude and his brother in and law wanted to steal a cash cow.\n\nPlay this game. Don't give ZA/UM a cent. There are several successor projects by the artsists who made the game. One even looks like it's founded with the artist's rights to their work as a key concern (which is more evidence to me of the theft since they feel they feel the need to include that as a basic founding principle). I'm sure it won't be the same, but ZA/UM already killed Disco Elysium.\n\nDon't buy this. Play it. It's a violent and irrepressible miracle. If you're a sad sack, I suggest bumping up your Volition.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Well... What to make of this game?\r\n\r\nIt starts of very slow. Frustratingly slow. Then it got rolling a little bit, and I wanted to get through it and know how the story finishes....  I can't ever remember looking up how long a game takes to finish... Because I just wanted it to be over.\r\n\r\nThen by the end of it. Being more familiar with all the mechanics (Getting time to advance) I was even contemplating a second play through.\r\nBUT then... Just as the referendum was about to start... My game freezes. (The coppernado is back)  And I can't advance even after looking up solutions on the web. The biggest anti-climax in my gaming life.\r\n\r\nSo after 50 hours it leaves a bitter taste in my mouth.\r\nAny tips to resolve the freeze are welcome though. I really want to get to the end.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "НЕ ПОКУПАЙТЕ ИГРУ, ВЫ ПРОСПОНСИРУЕТЕ МОРАЛЬНЫХ УРОДОВ.\nТех людей что потом и кровью создали эту игру - нагло выгнали из студии жадные дядьки в костюмах и отобрали права на игру. \nСама игра - шедевр и продукт абсолютно уникальный, в который как по мне должен поиграть каждый хотя-бы раз в жизни, НО только скачав игру с пиратских сайтов.\nНапоследок хочется пожелать Роберту Курвицу и Александру Ростову крепких нервов, чтобы вся эта срань завершилась хорошо и свет увидела Диско Элизиум 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Disco Elysium is a highly ambitious RPG celebrated for its deep narrative and complex writing. However, its immense focus on dialogue, internal monologue, and philosophical exploration means it is not a game for every player. For those seeking traditional gameplay loops or faster progression, the experience can feel incredibly slow, tedious, and overly dense. While critically acclaimed, its heavy, text-based nature makes it a difficult and lengthy commitment for players who prefer action or lighter fare.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is one of the best games I’ve ever played. \n\nThe publishers stole it from the creators because they are evil swine \n\n🏴☠️ this game it is a must play game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a good game coming from one of the best developer in the market.\n\nThat until I learn what happened to ZA/UM and their original Devs. Holy wowza, to think greed could be this devastating on such a beloved game.\n\nDO NOT PURCHASE\n\nIts a story based linear-ish game about an amnesiac detective with skills based on rolls, near identicals to typical DnD playthrough.\n\nThe story is instresting. The characters are fun. Absolutely dig the art style. And the music is a blast.\n\n8.5, recomended to play.\nABSOLUTELY NOT RECOMMENDED TO PURCHASE",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game both amazes and confounds me.  On one hand, the story feels like something I might actually want to go through.  The very opening lines of the game caught my attention in a way very few other games ever have.  The internal dialogue manages to convey a character's emotions in a way the simplistic graphics cannot and few games or even movies have managed to do.\n\nOn the other hand, I have died twice--once to picking up my tie in the very first room and once to sitting in a chair.  In both instances, I lost quite a bit of progress. My first death happened so early in the game, there had been no auto-saves.  I had to start the game over.\n\nI love the [i]idea[/i] of this game, but ho my goodness is it like a saw blade around the edges.  Yes, it's intriguing to watch this train wreck of a detective after literal amnesia-level blackout drinking.  No, I don't think it's worth full price.  Depending on how easily you can be frustrated into punching your computer screen, it may not be worth [i]any[/i] price.\n\nI understand point and click adventure games are going to have you jump through hoops to do basic things (like your job), but this is not the kind of game I expect to have to be quick-saving every screen in case I die.  This is the kind of game I expect to be running in SCUMM VM with so many save games to go back to I have to scroll them.  It's frustrating, and it's bad game design.\n\nJust because something is unique does not mean it is a good idea.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It may not be obvious, but the publisher has stolen this IP from the developers and the developers themselves ask that you find a place to get it for free instead of enriching their criminal former publisher. So that's reason #1 not to buy it.\r\n\r\nBut there are other reasons. The game is slow, confusing, poorly paced, and the controls are clumsy at best. A lot of people can overlook its mechanical defects to enjoy what is supposedly a deep and engrossing narrative. I'm not one of them but I'm still forcing myself through it because enough of my friends recommend it so earnestly.\r\n\r\nGood art style and voice acting - everything else is a struggle.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "just not for me.  feels very alien and it is hard to relate to the character.  Well designed game but not my kind of story.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I couldn't force myself to finish it, I just didn't care enough about the characters, I didn't find dialogues quirky or hilarious as some say, but it looks great and the soundtrack is amazing, that's about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some people might really enjoy it but it's not my thing. I quit drugs a long time ago. I can't understand what the voice is even talking about most of the time:).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a very boring game, permeated with communist propaganda, literally all characters who have an ideology, but are not communists, are portrayed as freaks and hypocrites.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is garbage. Its riddled with bugs and now it crashes on startup every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game was pretty fuckng boring and pretentious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is very involved and there's a lot going on... too much for me. I think this would scratch an itch for me if I didn't have descriptive, lengthy, amazing world-building books to read, but I DO read those books already, so when I game I usually want something a little less intricate. Not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I gave this game so many tries because I truly do love the premise of it. But holy moly I've never read so much text in bulk before and it turns the game in a snooze-fest. I love RPGS, I adore books and reading as a whole but for me this game didn't stick the landing. \n\nIf you're capable of reading huge swathes of paragraphs, alongside a well crafted game, then you should definitely play this. I'm not exaggerating when I say that there's a METRIC TON of text.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the challenge is dice rolls, $40.00 for the challenge of dice landing on the result you want. if gambling is illegal so should games were dice or random number generation determine winning/completion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: Don't play the game if you have self esteem issues or CPTSD. It WILL trigger you in a negative and harmful way. \n\nFull Review:\nThis isn't a game for people who've been through certain types of trauma. Namely, trauma having to do with your self esteem and value. First of all, you do NOT get to customize a character. One is given to you and he's already a psychological mess. If you have deep wells of empathy this game will trigger you in a way that is more harmful than good. The overall message is for people who haven't yet developed the skills or life experience to understand the illusion of choice is not freedom. It's a game with a very dark, nihilistic message. While Nihilism can be enlightening and even freeing for some people, this game doesn't really allow you to explore those aspects of it. It tends to repeatedly highlight only the worse parts of humanity in a context absent of hope or empathy. Why the devs would include an entire segment of dialogue that analyzes and breaks down racism in support of it, is a confusing and concerning choice. There are better ways of exposing how toxic racism is without glorifying at the same time. The game is definitely thought provoking but it does it in a very abusive manner that could be harmful to people who struggle with CPTSD, AuDHD and healthy emotional regulation. \nThis game shook me because I've already learned the darker lessons and hard truths life ultimately teaches you. I didn't need a rerun of trauma and I think the lessons could be learned without it, but I understand why some people feel it's necessary. It might be a great game, but it's not for everybody and that's why I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the first time Steam reviews completely failed me. I should have trusted my gut, but all the positive reviews were hard to ignore.\n\nDisco Elysium is like the best picture from the Oscars. Everyone tells you it’s artistic and amazing, but it's actually just boring as shit. It’s more of an audio book you click through than a video game. No skill or knowledge is required.\n\nMaybe I'm being a bit harsh and this game just isn't for me. Just trust your gut on this one.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This isn't a game, but some pretentious story created by screenwriters who jerk off to their own nonconformity, in which there is neither entertainment, aesthetics, nor good music. Maybe it was supposed to be sarcastic, ironic, eloquent, but it's just tiresome gibberish. Not for me at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like small fonts and reading, this is a game for you. Not me though, my kindle font is so big someone sitting behind me on public transport would have no issue reading over my shoulder.\n\nI really struggled with progressing through this game rig that reason. \n\n⭐️ ⭐️ 💫/5",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'd say it's very close to graphomania. It's hard to remember the last time I skipped so much dialogue in an RPG. Walls and bastions of text unrelated to anything other than the author's desire to create \"art.\" If you enjoy immersing yourself in a wealth of fictional pseudo-knowledge, this game is for you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cool aesthetic, kinda cool rpg elements but BORING overall",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is terrible.\n\nI'm quite confident I just didn't 'get it', but after playing for a few hours, I discovered there's a core mechanic that means if you failed a skill check (over which you have no control of course) the game ends... You loose... and must start again or reload until you DON'T fail the skill check.\n\nThe reason for this seems to be some kind of moral system whereby if you moral drops to zero it's as good as dying, only you can heal health and avoid fights, but you cannot avoid skill checks, unless you just want to remain in your hotel room and go nowhere and do nothing.\n\nLike I say, perhaps I'm playing it wrong cos lots of other people give this good ratings and it did somewhat make me laugh a couple of times, but when I'm forced to sit in a chair so uncomfortable a single skill check failure looses me the game, but I cannot progress without having the conversation... Nah, pointless. Irritating and few other words for \"Wish I'd had this experience before I'd played it for 2 hours and could no longer get a refund on this pointless waste of time\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't get it. 10 minutes in and I'm bored to bits. You know it's bad when the character you are playing themselves doesn't know why they are there or what they want; and the first task you have is to find your other shoe. Spoke with a woman, went down some stairs, and yeah... I'm calling it quits.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck the new devs\n\nNow the game itself,\nWho comes up with shit like this, I like it 8/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I could play as a based, strong, non-alcoholic white guy that would be cool, but sadly the only option is to play as a pathetic cuk. It ruins the RPG element of the game. I see the message that they're going for, but the character is an unbearable sap. I'm going to try it again, but I can only take it small doses right now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game felt like reading a 26 hour long poem, 10/10 there will never be another like it. \n\nkinda wish i pirated it tho",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Beat the game and peice of shvt doesnt even geive me a achievement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buying this game was a mistake. ZA/UM is a dogshit company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT PURCHASE FROM ZA/UM.\n\nThe best RPG of all time. literal 10/10. DON'T BUY iykyk ;)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I only bought it mostly for the tags that were used to describe this game such as story rich, choices matter, detective, exploration, adventure. I found only later its basicly a looong novel. And by long I mean endless discussion about politics, his conflicting thoughts, the world, riddles, abstract ideas and constructs. To me I am looking for a detective with a thrive for exploration and story that gets impacted by your choices. Yes there are some key events that happen but they are very small compared to the endless hours of dialogue. I do not consider myself as someone who hates reading I very much do however this was waaaay too much. And half the time the game is made so that you dont understand all of it purposefully, Its supposed to make you feel confused and disheartened. Like if ONLY it would have been specified this is the game.. It is well made dont get me wrong. So if you enjoy reading an impossibly hard abstract concepts and politics and so forth buy the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tried it, not for me at all. Music is going on my playlist though",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "baba sktirin gidin turgenyev babalar ve ogullar okuyun ya",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RHETORIC – Psst, hey, you!\n\nYOU – Who -- me?\n\nRHETORIC – Yes, you. Word on the street is you're ready to talk about what *ZA/UM* did again!\n\nYOU – 'Again'?\n\nRHETORIC – Yes -- you're ready to dig into ZA/UM drama *again*. You've talked about it before, *they've* talked about it before. Hasn't really worked out yet, but neither have all those *spiritual successors* -- should we just stop making them, too?\n\nYOU – Can't argue with that.\n\nRHETORIC – So, what about all that bitterness you've been carrying? Word on the street is you've woken up from a thousand years of slumber, ready to speak of the studio's controversy louder than ever attempted before. Is that true?\n\nYOU – How come there's *word on the street*?\n\nRHETORIC – You keep saying things like *down with the ZERO PARADES*, *eat the board of directors*, *sodomize the ip-owners*, *impale all people who have more than 25% of the shares*, *literally teabag all corpo clowns regardless of their involvement in pushing out the visionaries* -- that kind of stuff.\n\nYOU – Oh, right. That sounds like me.\n\nRHETORIC – Funky-style. Very funky. So tell me. Do you have any questions before we fire up the Big ZA/UM Cancellation, or do we get right down to it?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I just lost two hours of progress because I couldn't save",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is boring and I don't like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, one of my favourites.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "maybe this game isn't for me. it is too boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Artists were robbed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Fuck Communists.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "\" You're at home, stupid cop, not with the art crowd. You hate them, everyone hates them, even they hate themselves. It's nauseating -- an industry built on sprezzatura and sparkling wine. And, let’s be honest, tax evasion schemes.The Wompty Dompty Dom Centre is the heart of this unholy symbiosis of esthetics and tax optimization, and now that you've internalized it – you can have a piece too! \"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pirate it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Devs: Kino\nPublishers: Coal",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck you ZA/UM.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Turned on the lights *dies*\r\nBrings you back to menu gotta remake character\r\nMiss swing falls on floor *dies*\r\nBrings you back to menu gotta remake character\r\n\r\nMaybe the story is well written but I don't wanna lick a shit popsicle to get to the good part in the middle.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "give me my money back bro",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY!\nGame and Development Studio got stolen with fraudulent methods from the original devs and creators.\n\nBut it is a really good game so if you find ways to play it without buying it from these criminals then do that",
      "voted_up": false,
      "votes_helpful": 282
    },
    {
      "review": "Preface: I DO recommend to play this game, I DO NOT recommend to buy it. ZA/UM is a piece of sh*t company that earns every hate for f*cking over the genius people who actually created this masterpiece.\n\nThis is the best game I have ever played, and it will be forever.\n\nI own this since its release and I never felt ready to submit a review that does this game justice. I don't want to spoil any of the content, as it is best to experience it by knowing nothing at all about it. You really need to experience it for yourself.\n\nAlso it may sound cheesy but this game has provoked thoughts in me that made me change my life for the better. I had a lot of the protagonist in me, particularly back then around the time of the release in isolation during the pandemic.\n\nThis game will forever have a special place in my heart and I will never forgive the company for ruining the chance of a potential sequel, and for how they treated the creators, who effectively stole the intellectual property from them.\n\nIn a way, the IP died the most Disco Elysium death possible.",
      "voted_up": false,
      "votes_helpful": 277
    },
    {
      "review": "This is probably one of the best games of all time and you should experience it, nevertheless, the company, ZA/UM did the creative minds behind this project so dirty I cannot in good mind recomend you buy it. So sail the high seas or whatever, but treat yourself into the brainrot cleanser that is Disco Elysium",
      "voted_up": false,
      "votes_helpful": 165
    },
    {
      "review": "the second best videogame i've ever played, once my favorite. changed how i write stories forever. \n\nza/um are bloodsucking, awful beings, and have stripped all charm from it's world by kicking off the people who made elysium, elysium. do not buy this game. pirate it, please. \n\ngood luck to tuulik and kurvitz. elysium awaits you at the end of the war of beuracracy and bullshit.",
      "voted_up": false,
      "votes_helpful": 214
    },
    {
      "review": "Fantastic game. Terrible company. Don't give the corpos that stole the IP from its passionate creatives a single cent of your money. Go check out whatever Argo Tuulik's planning with Summer Eternal, its the most true and honest successor of them all, from what I've seen, and Argo wrote all of the best parts of this game imo, like Cuno and Evrart Claire.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "DO NOT BUY THIS GAME. ZA/UM does not deserve a cent in how they fucked over the original developers and I truly hope they will get their justice.\n\nNow for the actual game. This is a literal masterpiece. Coming into this game without knowing anything except that one of my friends told me that it's an amazing game, I came in expecting a lot, and I was still pleasantly surprised. From the music, the story, the characters, it is simply amazing, and worryingly, relatable. Please do not buy this game, but do experience it in any other way possible.\n\nKim my beloved.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As a huge fan of Planescape: Torment and older story-driven CRPGs in general, I'd just like to say: this is not the spiritual successor that everyone promised me, and unless you walked away from Planescape: Torment thinking, \"Golly, that sure was a lot of reading I had to do to finish that game,\" you might feel the same.\n\nDisco Elysium feels as if it suffers from being grossly misclassified, as it's only just barely an RPG. Personally, I'd describe it as a visual novel... with skill checks. I'd also describe it as a [i]highly political[/i] visual novel, one which you normally wouldn't so much as give a second glance unless you had a keen interest in political discourse, which is far more niche than the overwhelmingly positive reviews and the discourse surrounding it might suggest.\n\nThat's not to say there's nothing else on offer in Disco Elysium, but [i]boy,[/i] you are going to be reading a [i]lot[/i] about Revachol, its history, its rulers, its neighboring countries, the various governmental bodies of the world, the local political factions and their beliefs, and you're going to hear absolutely [i]everyone's[/i] opinions on these topics, again and again [i]and again.[/i] It's the lifeblood of the narrative and it's baked into every facet of the setting, it's completely unavoidable, and I found this to be [i]incredibly[/i] disheartening.\n\nSadly, there's also a compelling exploration of the player character and the existential crisis he's wrestling with, expressed beautifully through his internal monologue (dialogue?), but it's more of a B plot, unfolding quietly in the background over the course of the game. Moreover, like our own never-ending processes of self-examination, it feels as if it has very little bearing on the direction of the narrative, only really affecting the ways in which you interact with others. Like all the other roleplaying tidbits at play here, it's just a bit of personalized flavor for you to enjoy, and one that might occasionally season your dialogue without meaningfully changing the outcome, nothing more and nothing less.\n\nAll of this is to say: Disco Elysium is a wonderfully written piece of fiction, but it's not as widely accessible as the hype surrounding it might imply, nor is it a particularly compelling RPG. Ultimately, [i]it's also just really not for me.[/i] I wrote this review to work those feelings out and to let anyone else who bounces off Disco Elysium know: [i]you're not alone.[/i]",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It gave me a couple of good insights about my personality: that I'm a \"pathetic sorry cop\" and have inclinations towards communism.\n\nThis game can be good for someone, but I absolutely can't stomach its pace (where I can't investigate how I want and instead forced to kill time by doing nonsense tasks) or being overwhelmed with too much lore that's basically IRL concepts named a little differently.\n\nIt's supposed to add immersion and comlexity but instead it feels like I'm forced to keep thoroughly rechewing a bland dish that I've already had a 1000 times.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Incredible game and a modern classic. Play it before you die.\n\nDon't buy it though. A bunch of greedy pieces of shit executives with a history of fraud stole the IP from the people who made it. Don't give those fuckers any money and just pirate the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "incredible game, one of my favorites, but do not pay for it. it was stolen from the creators.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Don't buy this shit, the publisher pulled a coup d'etat on the devs and them are asking you to get it from archive dot org instead. Save your money and morals.\nThis game might be one of the greatest pieces of media of the decade but my hate boner for the devs is so massive that makes me incapable of writing any form of review before blacking out\nThe best take i can take from this game is: as long there's capital in the world, one bullet won't be enough.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great game. Do not give these guys your money if you care about any of it going toward the people who made it. I do want to make explicit that I don't hold the company or shareholders' actions against current regular employees of ZA/UM.\n\n\nRemember Dobreva and Abadanaiz...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "incredible game-- don't buy it, the wretched moneymen forced the devs out of their own studio",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "I tried and I tried and I tried to like this game but it's just not for me. My biggest gripe with Disco Elysium is that you can be balls deep into a conversation with an NPC (I'm talking 10 minutes into the conversation; this game is dialogue heavy) and if you pick a wrong dialogue option, your character will expire forcing you to go to your last save and then the same dialogue again and I just don't feel like sifting through the same dialogue over and over again. Unfortunately, you cannot save your game while partaking in a dialogue, like you can, for example, in Baldur's Gate 3. Other than that the gameplay is very simplistic and the story is quite intriguing but not intriguing enough for me to suffer through deaths caused by wrong choices in dialogues. I just can't bring myself to finish this game because it's tedious.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "preface 1 - don't buy this. publishers screwing over devs and taking the money, tale as old as time, yada yada. find some way to get it for free (legally, ofc) or just watch your favorite streamer play it or something\n\npreface 2 - i didn't like this game much, but there's a sea of '10/10 best game ever's out there, so many that i'm inclined to say that i must just be wrong and everyone else is right. what follows is the ramblings of a madman, feel free to stop here and listen to all the positive reviews\n\npros\n-i like that this game lets you be the worst trash fire of a human. game itself never says 'x thing is good/bad', it lets its characters do that (on all sides of any topic), and there are options to agree/disagree with them as you like. you're not forced to be a paragon at all, you very much can go full fascist/racist/etc, and the game just lets you [i] marinate [/i] in those choices. real neat. this isn't \"too many woke games these days!!!11\", it's \"letting me be the worst and seeing the consequences thereof hits with 1000x the impact of characters turning to the camera and saying 'did you know prejudice is bad'\"\n- it got on the woke games list for having communism in it, but unclear on whether it's pro or anti. that's a pro (of the game) from me boss. these people have already decided they're angry about this game, but they can't justify a solid reason for *why* because it doesn't do the 'preachy' thing they always complain about, so they're just stuck in place directionlessly lashing out. sideshow bob stepping on rakes dot mp4\n- measurehead. i don't like him, i don't agree with him, but his flavor of racism is *fascinating* and i can see why he's the one character i'd heard of before playing\n- some of the VA work is good. some.\n\ncons\n- the overhype. everyone and their dog says this is the deepest shit ever, and then i jump in and the water's only up to my knees. i don't mean i'm smarter than the game is, probably the opposite. there's the point i made further up about the game letting you experience the consequences of being garbage, but that's mostly achieved by a few zinger 'gottem' lines which feel like they were written for the purpose of being quoted in other places. whenever a character tells me i should stop being so fash, i can see a writer's room high-fiving each other, and i feel like i'd kind of get the same experience reading these lines off the tvtropes page\n- character portraits have an Art Style, by which i'm politely trying to say it looks like someone threw a load of paint at my screen. they're incomprehensible, probably on purpose but hell if i get the *deep meaning* of it, and environments are so smudgy you need to hold down the button to highlight interactable things basically all the time\n- soundtrack is meh\n- the worldbuilding feels like it's straight out of the manual of a tabletop rpg, except i don't get to see the manual and there's no session 0 to get a feel for the world and you're just hurled in. which can be fine, these places/events/etc can be introduced naturally, but sometimes the writing is just so dang flowery that it's hard to parse the actual info. it's good writing, someone here clearly absolutely adores the written word, but sometimes you just need some concrete descriptions of things\n- skill points. there are four skill types, six skills per type, and two more things you can spend points on. when you finally scrape enough exp for a skill point, you have *26* options for where to put it. entirely too many. skill points should upgrade all skills of one type, or the number of skills should be cut in half, maybe more than that. you'll probably have a dozen incomplete skill checks lying around at any given time, so when the game deigns to give you a whole one (1) skill point you'll want to upgrade *that* skill or *that* skill to do those checks, but also *this* skill is used all over the place in conversation so you'd better upgrade that instead, but also maybe the next conversation will have a missable check relating to *this other* skill so you'd better get that, but also you need that point to unlock a slot for this interesting *thought* to go in, and then you realise your solitary uno point won't be enough to feed the kids this month\n- i'm not done whining about skill points. why does it cost a skill point to *forget* a thought. my brother in christ i can do that for free.\n- dice. game does a 'your points in this skill + dice roll' thing for checks, and the cases where you roll the lowest 0-25% value possible and fail something you should be good at will far outweigh the times where you clutch a 95-100% roll on something you suck at. i failed three 83% checks in a row, which was probably the beginning of the downward spiral for me. just have a point threshold. and locking you out of checks until you've put at least one more point into the relevant skill is an absurd requirement, for reasons of the *entire skill point system* is absurd. just put a cooldown on checks to avoid spamming them, ez\n- i played on controller and it just felt weird in my hands sometimes. my guy goes in directions i'm not moving him, gets stuck on things that aren't there. the occasional ui glitch as well. not the worst i've ever seen, but this was so overhyped i wasn't expecting issues like that\n- it's just kind of... boring, in the end? like there's a murder to solve, but it's not that compelling and nobody but me and kim seem to care about solving it. i guess that's the point of the game, this place sucks and all the hope is gone and whatever, but a narrative that's uninterested with the plot *on purpose* is still uninterested with the plot. add an overwritten narrator/characters, and some (maybe intentionally) grating VA work, and I found myself just mashing through conversations and skimreading because i can read faster than some of these people talk. i know switching off VA is an option, but didn't want to miss the voices that were actually good.\n- got to some cargo container or something with a *Fat Evil* in it, who said two words with exactly the voice i was expecting, and i quit there. maybe i'm the guy in that comic who stops digging two feet before reaching diamonds, maybe i just had to wait until episode 60 for this anime to get good, but i ran out of patience there\n\ntl;dr i'm wrong, you should probably play this game, whatever",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "great game bad company dont buy this gem look it up for free instead",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "[h1]This Game Reads Me Like A Book[/h1]\n\nI got this game from my good friend, who is really fond of it. When I started last year, I abandoned this because of the large amount of text. I was a \"hundred percent player\", and many texts about politics and the game world bored me. But now, when I don't want to read all the dialogues, I fall in love with this game.\n\nThis game gave me answer variants that represent my thoughts one by one, so I started associating the protagonist with me. I got into it because I played visual novels mostly, that has obvious answer variants, meaning only one - will this girl be with you or not.\n\nMany characteristics represent real human feelings. If you upgrade the conceptualization, you can talk with your colorful tie. With empathy, you can understand the motives of your friends, enemies, and their feelings. With electro-chemistry, you will feel any cigarettes, alcohol, or drugs around you, then get tasks like \"find how to smoke\", \"use amphetamine\".\n\nAnd you can shoot the childe\n\n(This review is a task for my English lessons. I recommend Disco Elysium, but because of problems around the ZA/UM Studio, I set a dislike.)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dont buy this game, something something zaum bad, buy as many jugs of pineapple juice as you can instead and drink them until you piss your pants",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Well... What to make of this game?\r\n\r\nIt starts of very slow. Frustratingly slow. Then it got rolling a little bit, and I wanted to get through it and know how the story finishes....  I can't ever remember looking up how long a game takes to finish... Because I just wanted it to be over.\r\n\r\nThen by the end of it. Being more familiar with all the mechanics (Getting time to advance) I was even contemplating a second play through.\r\nBUT then... Just as the referendum was about to start... My game freezes. (The coppernado is back)  And I can't advance even after looking up solutions on the web. The biggest anti-climax in my gaming life.\r\n\r\nSo after 50 hours it leaves a bitter taste in my mouth.\r\nAny tips to resolve the freeze are welcome though. I really want to get to the end.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "НЕ ПОКУПАЙТЕ ИГРУ, ВЫ ПРОСПОНСИРУЕТЕ МОРАЛЬНЫХ УРОДОВ.\nТех людей что потом и кровью создали эту игру - нагло выгнали из студии жадные дядьки в костюмах и отобрали права на игру. \nСама игра - шедевр и продукт абсолютно уникальный, в который как по мне должен поиграть каждый хотя-бы раз в жизни, НО только скачав игру с пиратских сайтов.\nНапоследок хочется пожелать Роберту Курвицу и Александру Ростову крепких нервов, чтобы вся эта срань завершилась хорошо и свет увидела Диско Элизиум 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disco Elysium is a highly ambitious RPG celebrated for its deep narrative and complex writing. However, its immense focus on dialogue, internal monologue, and philosophical exploration means it is not a game for every player. For those seeking traditional gameplay loops or faster progression, the experience can feel incredibly slow, tedious, and overly dense. While critically acclaimed, its heavy, text-based nature makes it a difficult and lengthy commitment for players who prefer action or lighter fare.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is one of the best games I’ve ever played. \n\nThe publishers stole it from the creators because they are evil swine \n\n🏴☠️ this game it is a must play game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a good game coming from one of the best developer in the market.\n\nThat until I learn what happened to ZA/UM and their original Devs. Holy wowza, to think greed could be this devastating on such a beloved game.\n\nDO NOT PURCHASE\n\nIts a story based linear-ish game about an amnesiac detective with skills based on rolls, near identicals to typical DnD playthrough.\n\nThe story is instresting. The characters are fun. Absolutely dig the art style. And the music is a blast.\n\n8.5, recomended to play.\nABSOLUTELY NOT RECOMMENDED TO PURCHASE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game both amazes and confounds me.  On one hand, the story feels like something I might actually want to go through.  The very opening lines of the game caught my attention in a way very few other games ever have.  The internal dialogue manages to convey a character's emotions in a way the simplistic graphics cannot and few games or even movies have managed to do.\n\nOn the other hand, I have died twice--once to picking up my tie in the very first room and once to sitting in a chair.  In both instances, I lost quite a bit of progress. My first death happened so early in the game, there had been no auto-saves.  I had to start the game over.\n\nI love the [i]idea[/i] of this game, but ho my goodness is it like a saw blade around the edges.  Yes, it's intriguing to watch this train wreck of a detective after literal amnesia-level blackout drinking.  No, I don't think it's worth full price.  Depending on how easily you can be frustrated into punching your computer screen, it may not be worth [i]any[/i] price.\n\nI understand point and click adventure games are going to have you jump through hoops to do basic things (like your job), but this is not the kind of game I expect to have to be quick-saving every screen in case I die.  This is the kind of game I expect to be running in SCUMM VM with so many save games to go back to I have to scroll them.  It's frustrating, and it's bad game design.\n\nJust because something is unique does not mean it is a good idea.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not for me.  feels very alien and it is hard to relate to the character.  Well designed game but not my kind of story.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I couldn't force myself to finish it, I just didn't care enough about the characters, I didn't find dialogues quirky or hilarious as some say, but it looks great and the soundtrack is amazing, that's about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some people might really enjoy it but it's not my thing. I quit drugs a long time ago. I can't understand what the voice is even talking about most of the time:).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5 out of 11 bojankles\n\ndon't get me wrong- this game is both REALLY funny and EXPERTLY written, but after completing my second playthrough i am in zero rush to touch this game again. for a game that emphasizes how you can be whatever kind of cop you want, there is actually zero real difference you can make other than being competent versus incompetent; the whole game is just window-dressing. it's extremely tedious and linear once you understand the only thing different about your next playthrough is that you just get new dialogue reacting to the same predicaments\n\nPS: i even took another point off my score just for ZA/UM completely robbing the original team's work and parading around like they're the creative geniuses who came up with the game. in an ironic way though, it actually kind of makes the game's themes better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "(I've been exposed to more than 5 minutes of this game, I've seen closer to the first 5 hours)\n\nIncredible art direction, strong writing, great music, interesting concepts, a compelling world, and unbelievably boring gameplay and dialogue. I won't lie, my brain's been melted by the internet, so I could see someone else getting a lot out of this. A great deal of love and talent went into it, it really shows. I generally go for pretentious or conceptual stuff, and I can have a lot of patience if the story can hold my attention. But the characters in this game do not behave like people, and as funny or as interesting as that can be, I'd rather have some kind of emotional core to keep me engaged. It's too impersonal and cold, and the rest of the game is incredibly slow. Still though, I think if you don't demand as much moment-to-moment stimulation you could vibe with it. Not for me though. Also, the communism stuff feels incredibly forced in the beginning. I hate the U.S. healthcare system as much as the next guy, but the messaging feels quite desperate at its inception. It probably gets better later on, I wouldn't know.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is garbage. Its riddled with bugs and now it crashes on startup every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is very involved and there's a lot going on... too much for me. I think this would scratch an itch for me if I didn't have descriptive, lengthy, amazing world-building books to read, but I DO read those books already, so when I game I usually want something a little less intricate. Not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I gave this game so many tries because I truly do love the premise of it. But holy moly I've never read so much text in bulk before and it turns the game in a snooze-fest. I love RPGS, I adore books and reading as a whole but for me this game didn't stick the landing. \n\nIf you're capable of reading huge swathes of paragraphs, alongside a well crafted game, then you should definitely play this. I'm not exaggerating when I say that there's a METRIC TON of text.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a very boring game, permeated with communist propaganda, literally all characters who have an ideology, but are not communists, are portrayed as freaks and hypocrites.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the challenge is dice rolls, $40.00 for the challenge of dice landing on the result you want. if gambling is illegal so should games were dice or random number generation determine winning/completion.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very slow paced, in game i was ridiculed for not adhering to racism theory and had a heart attack.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: Don't play the game if you have self esteem issues or CPTSD. It WILL trigger you in a negative and harmful way. \n\nFull Review:\nThis isn't a game for people who've been through certain types of trauma. Namely, trauma having to do with your self esteem and value. First of all, you do NOT get to customize a character. One is given to you and he's already a psychological mess. If you have deep wells of empathy this game will trigger you in a way that is more harmful than good. The overall message is for people who haven't yet developed the skills or life experience to understand the illusion of choice is not freedom. It's a game with a very dark, nihilistic message. While Nihilism can be enlightening and even freeing for some people, this game doesn't really allow you to explore those aspects of it. It tends to repeatedly highlight only the worse parts of humanity in a context absent of hope or empathy. Why the devs would include an entire segment of dialogue that analyzes and breaks down racism in support of it, is a confusing and concerning choice. There are better ways of exposing how toxic racism is without glorifying at the same time. The game is definitely thought provoking but it does it in a very abusive manner that could be harmful to people who struggle with CPTSD, AuDHD and healthy emotional regulation. \nThis game shook me because I've already learned the darker lessons and hard truths life ultimately teaches you. I didn't need a rerun of trauma and I think the lessons could be learned without it, but I understand why some people feel it's necessary. It might be a great game, but it's not for everybody and that's why I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This isn't a game, but some pretentious story created by screenwriters who jerk off to their own nonconformity, in which there is neither entertainment, aesthetics, nor good music. Maybe it was supposed to be sarcastic, ironic, eloquent, but it's just tiresome gibberish. Not for me at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played for 3 hours, then i started to consider dropping the game. Heard people tell me not to so i came to the conclusion to push further. I can now happily say i should've dropped this garbage game. 0/10 overrated. If people say they like this they have to be on more than the main character.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the mechanics make no sense, you wear the right clothes, your stats have great odds and they still fail the roll check?\neverything doesnt matter, just click and hope makes the game boring.\nyou have to save before every interaction as they last 30 minutes and auto save doesnt save a thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like small fonts and reading, this is a game for you. Not me though, my kindle font is so big someone sitting behind me on public transport would have no issue reading over my shoulder.\n\nI really struggled with progressing through this game rig that reason. \n\n⭐️ ⭐️ 💫/5",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'd say it's very close to graphomania. It's hard to remember the last time I skipped so much dialogue in an RPG. Walls and bastions of text unrelated to anything other than the author's desire to create \"art.\" If you enjoy immersing yourself in a wealth of fictional pseudo-knowledge, this game is for you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cool aesthetic, kinda cool rpg elements but BORING overall",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't get it. 10 minutes in and I'm bored to bits. You know it's bad when the character you are playing themselves doesn't know why they are there or what they want; and the first task you have is to find your other shoe. Spoke with a woman, went down some stairs, and yeah... I'm calling it quits.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is terrible.\n\nI'm quite confident I just didn't 'get it', but after playing for a few hours, I discovered there's a core mechanic that means if you failed a skill check (over which you have no control of course) the game ends... You loose... and must start again or reload until you DON'T fail the skill check.\n\nThe reason for this seems to be some kind of moral system whereby if you moral drops to zero it's as good as dying, only you can heal health and avoid fights, but you cannot avoid skill checks, unless you just want to remain in your hotel room and go nowhere and do nothing.\n\nLike I say, perhaps I'm playing it wrong cos lots of other people give this good ratings and it did somewhat make me laugh a couple of times, but when I'm forced to sit in a chair so uncomfortable a single skill check failure looses me the game, but I cannot progress without having the conversation... Nah, pointless. Irritating and few other words for \"Wish I'd had this experience before I'd played it for 2 hours and could no longer get a refund on this pointless waste of time\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck the new devs\n\nNow the game itself,\nWho comes up with shit like this, I like it 8/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If I could play as a based, strong, non-alcoholic white guy that would be cool, but sadly the only option is to play as a pathetic cuk. It ruins the RPG element of the game. I see the message that they're going for, but the character is an unbearable sap. I'm going to try it again, but I can only take it small doses right now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game felt like reading a 26 hour long poem, 10/10 there will never be another like it. \n\nkinda wish i pirated it tho",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Beat the game and peice of shvt doesnt even geive me a achievement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buying this game was a mistake. ZA/UM is a dogshit company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT PURCHASE FROM ZA/UM.\n\nThe best RPG of all time. literal 10/10. DON'T BUY iykyk ;)",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}