{
  "positive": [
    {
      "review": "Absolute Great Simple Game, with fun and crazy mods\n.\nPros = \n- The base game itself already very great and tons of fun\n- 0 grinds, just choose your weapons, and large-scale warfare with land, air, sea vehicles\n- im always play vanilla first before modded, but brooo, the mods community in this game is chef kiss, absolutely uvcking GREAT, no puns\n--- the weapons and vehicles in the modded community include WIIIIDDDDEE variety of choices\n--- you can fight wonder weapon bosses, even use this bosses yourself, even bring this bosses to NORMAL BATTLE and doing boss vs boss fight, lmaooo, imagine the fun (i dont need to imagine, because i already do that myself)\n--- even you could fight SCP lovecraftian cosmic horror bosses using modern weaponary\n--- even you can make a bit of money by become a modder in this game by doing a commission works\n.\nNot really a Cons : \n- this game seems designed for online PTP multiplayer, but seems its only AI for now, and somehow single player, sad\n- the AI is dumb, but still smart enough to do their own things, if you feel they need to be smarter, theres some mods can mitigate some their stupidity aspects\n- the mods community sometimes filled with half-baked assets that either underpowered or overpowered in balanced department, or sometimes not function properly\n- dev is only working alone, i'd heard now he finally has a team to speed things up, since the game havent meet full version standards for such a long time, but still PRETTY MUCH playable with a lot of fun to achieved\n.\nCons :\n- nothing\n.\nOpinion :\nI hope i found this game earlier in life, such well-hidden gem drowned in the deep sea of steam\nThis game gave massive nostalgic values to me from certain past games\nAlso this game is just pick and play game without 0 ranked or/and life-service micro-transactions is MASSIVE pros points\nI prayed a massive good luck to dev (or devs) who working for this game, and hope this game finally picked up by algorithm and reach wider audiences than roblox peds or AAA slops (which this game already achieved, just need to be noticed by a lot of people)\n.\nThe mods list im using = [my current game version: EA32]\nSteelFront: Project Raven (Official Vehicles, Skins, Weapons mod)\nVanilla+ - Tides of War (WIP)\n[ABPHYSICAL] Site Omicron\n[ABPHYSICAL] (Not) Third Impact\n[URSSOS] Skirmish at Anzara\nAustere - Dunes (Vehicle Combat)\nAustere - Tundra (Vehicle Combat)\n(PMP) Java Sea [sea battle map, read mods description for setting]\n[EA32] Boxforts Reimagined [CQB map]\nApollo432: Factory [CQB map]\nRepair Wrench MOD (balanced, but hand animation a bit buggy after some updates ago, await fixing from the mods author)\nAmmo+Med Box (Replenishable!) [may a bit cheaty, but its not, since you're the only person in team needed to carry]\nGunship [Kill Streaks] (cheaty, recommended only for roleplay)\nAuto Squad (Mutator Mod)\nVanilla+ Weapons pack\nBattleship Yamato\nP.1000 Ratte (Boss Battle)\nThe Shrew (Boss Battle)\n[COMMISSION] HeliTank\nVMX-21 \"Hydra\" Gunship\nRHINO Modernized\nLETMS - Leopard 2A8 [Commission]\nPHL-16 self-propelled MLRS (COMMISSION) [MRLS arty]\nPanzerhaubitze 2000 Self-propelled howitzer (COMMISSION) [traditional tank arty]\nKAMAZ 5350 Logistics (if you want to play logistic game, and keep your fellows AI fit and full of ammo)\nHumvee Variants\nConvair B-36 Peacemaker strategic bomber (COMMISSION) [a balance nuke bomber in workshop]\nBDS-R2 Bomber [nuke fighters with lasers and plasma, but a bit cheaty, still can die to buzzard-M if you skilled enough]\nBUZZARD Modernized\nA10R - R.E.A.P\nMcDonnell Douglas F-4 Phantom II\nM202 F.L.A.S.H\nM1887\nAN-94“Abakan”\netc, weapons and vehicles addition of your choices in workshop\n.\nedit1 = updating mods list\nedit2 = updating mods list",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "there is mods  bosss battles  cool guns  theres a b2  just download the mods you like and it will be fun belilve me",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "played this game when it was only on gamejolt and still come back to it here and there, mindless fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "迟到的评测，随便写写我的想法吧\r\n当初知道这个游戏还得是看了魔哒的视频解说\r\n小学的时候，也就是2018年，在‘‘快玩游戏盒’’玩到的，接着它不见了。有下了个‘‘快吧游戏盒’’\r\n当初玩的都是盗版，一些武器都是隐藏的。\r\n很好玩，现在也差不多，中文名好像叫“战地模拟器”\r\n这游戏的创意工坊特别有意思，什么都有。\r\n现在是大一，有大把时间玩游戏，可惜这个游戏没有成就",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The base game is good. Nothing special and very low graphics but fun. Mods are the real gem of the game. Buy it if you want to play fun mods, or not.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The amount of mods this game has is amazing. Not just weapons and skins but mutators to make the game run better or in whichever way you're seeking for. That alone is great.\r\n\r\nNot to mention for those who have a very busy life and/or prefer casual fun play over the sweaty, competitive online play, then this is the game for you. Throw on some bots and do whatever you please. It's a shame really that many games dont offer this anymore. This game hits every nail on the head though. Very much recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you enjoy first-person shooters, are into modding/ know how to use the steam workshop, or have a lower-end PC, you should at the very least try this game.\nWhen you start modding your game, try the stuff that Hoider makes, the EXTAS project weapon mods, the custom M4, and the World War II collection of weapons and vehicles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite game OAT. With the right combination of mods you can make this game anything you like.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this gam was like a war  but if it was cartoonish and where blue vs red its so fun you can lahugh  out your lungs but if you are able to laugh out  your lungs call 911",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, very modable, highly recommend to everyone \n\nPlz add the ability to select multiple skins like you can with vehicles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is 10/10! Funny while also pure action! This game is allows modding, making it so you can change your vanilla experience, or completely changing the game! \n\nYou have a infinite amount of weapons, vehicles, maps, etc, thanks to the large modding community...\nYou can create your own map exactly how you want and even publish it to the workshop!\nIf you want a simple sandbox shooter that you can play without people who are competitive, this is the game for you!!! Just add some bots and enjoy!\n\nAnd if you want to play with friends, you can also use the community made mod, RavenM. Infinite possibilities!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of fun and really easy to get into. pretty user friendlyish with controls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely simple, but extremely modable game. The only problem I have with the game is that I need a lot of RAM space to play with a lot of mods, but I get that this might be too difficult to solve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was worth the money as it is fun exciting you can also get mods for free if you subscribe to there\r\nchannel you can find these mods on the community hub",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games I've ever played. It brought me back to when I was a kid playing with Soldier Toys.\n\nThis game is a canvas,  you are the one holding the brushes making the game as you see it fit. You can make as crazy of battles as you can imagine, community content is an absolute must. The Workshop is the go to place for Weapon Packs, Maps, Skins etc.. the sky is the limit for your imagination. \n\nAbsolute recommend, if you are someone looking for a sandbox game where you can play massive battles with a crazy amount of Mods to choose from then this game is for you. Best money ever spent on a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have over 300 hours on record and none have been the same experience; every time i boot up the game I am greeted with a new experience, no battle is ever the same. Ravenfield allows for familiarity without repetitiveness, it allows you to not have to focus solely on what you are doing but actually allows you to enjoy the game you are playing. The modding community is also amazing and constantly turns out new and incredible experiences tuned to exactly what you want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple game that scales well to your specific interests with the insane amounts of community content like mods and maps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "be it modded or vanilla, Ravenfield is a fun little game.\n\nWhile the Base game can look a bit bland, it's still fun and a large upside of being \"simple\" is that the game can be run on a plethora of systems, including office laptops with integrated graphics.\nThere aren't much gamemodes, but they are really fun.\nNo grind, you jump straight in with weapons of your choice and just battle while the Slow-Mo mode makes you feel like a total badass, but i recommend playing without it because it brings more realism.\n\nThe strong point of this game is the community. \nThe sheer scale of mods made by the community is nuts.\nwhatever you can think of, it's probably there.\nSome mods are just a little fun addition while others make the game unrecognisable \n\nall in all a great game with an even greater community \nat this price point it is an money worth game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely versatile game that can be easily modded into whatever you want via the workshop. Excited to see what the future holds for this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in vanilla its decent its a good game not bad but with mods oh its something else maybe even near perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it a good game but it git boring rael qwick it just not my tipe of game i like do aney one know how to git a reyfund",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played!\nThe players are always making and updating mods that make the game better!\n10/10 Stars every time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really funny and i love the way its made. THE MENU MUSIC IS FIRE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun gun warfare and LOTS of mods\r\nreally recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While still in early access, this has to be one of the most fun games I have ever played. The modding community is excellent, and the base game is well worth it. Definitely one of top non-realistic battle sims.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the way the characters fly around most of the time when they go boom the game is \"VERY\" easy to mod just go the the steam workshop and you know the rest i would recommend this to a new player if you want a FPS game mixed with a ragdoll game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenfield is still the most casual fun you can have with a shooter, just being able to mod in whatever you want to play out whatever ridiculous FPS fantasy, it has been their since I was playing on the crappiest integrated graphics of 2015, and it is still here a decade later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game with and without mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fuego pure fuego.\n\nTHE pure PASSION put into the game ALL DEVELOPED BY ONE PERSON is amazing. Like i said only one person developed this masterpiece, yet it dosen't feel like it. It is as master built as a game from a AAA studio.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very interesting battle simulator with an extremely awesome wide range of Workshop creations to go with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing! Its like battlefield, but you can customize everything! Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ravenfield is amazing I love everything and I've been playing for six years now and it never gets old really recomend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily a slept on game, 10/10 with the gameplay and mods and the community \nEasy recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fun depends on the type of player. You like games like black ops 2? Play on foot. You like battlefield? Try out a vehicle like a plane or tank. You like games like RTS games? Download a mod and launch cruise missiles and get paratroopers. This game has a heavy amount of variety and i could even say its in my top 10 games ever played. 9.4/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good mod support and community. Very good game 10/10 :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best indie games I've played. Designed to be incredibly moddable, but I've played countless hours even without mods for the clean gameplay. Every update adds so much to the game, and the dedication of the developer through years of work has been inspiring. Definitely worth the price, even more so if on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play it its fun had big update best mario 3d like shooter out beshides doom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely LOVE this game!\n\nThis game has been in active development for some time now, which is why I've nominated it for the Labor of Love award in the Steam Awards 2025.\n\nThis game is amazing on it's own, and the mods add infinite replayability.\n\nWant a bunch of weapons from Soviet Russia? Check\n\nWant to recreate a random battle that I probably have no idea ever happened? Check.\n\nWant to fight in space with weapons from Half Life? The map didn't work, but a better one exists out there, as the workshop is HUMONGOUS for this game. I have about another 20 GB of workshop content on top of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is great and fun but is a bug that causes the bot's too just sit and not move and i don't know why?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun to play just really hoping conquest mode isnt going to be abandoned",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have had this game for years, been there since it was early stages. This game has progressed so far, and the community approach towards Ravenfield has pushed its progression to the point it is now. The modding capabilities for new players is so easy and changes the game completely, the developers are incredibly open with modding, and community feedback; this game is always a comfort space for me, coming to it when I feel as though there is nothing to do or there is too much happening in the real world. Absolute 10/10 even without the mods, the simplicity and enjoyability is unbeatable by other games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun by itself, but if you want a better experience I would recommend downloading some things from the workshop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun af and i really like flying and this game has the best flying machanics ive seen in a game but i will say mods do kind of carry this game after a few days of playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game itself is very fun, When you bring in to moding scene It becomes one of the best Single player Sandbox games. However this is just my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has one of the best mod custumizer ever created.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is addictive and very fun i love it so much i think this game just needs to keep up the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect for star wars battles, maps and all else u can get mods aswell, it makes the game better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes i do love the game but don't play with a contoler no a PC it'a bettter to just play on PC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Lots of mods. If bugs occur they're mostly fun ones",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is extremely amazing and very fun, I've played this game for hours on end. However if you do not use mods after a little while it gets boring, they havent updated much in a while. PLS UPDATE THE CONQUEST TO BE CUSTOMIZABLE AND ADD MODS AND YOU CAN PUT THOSE WEAPONS IN SPECIFIC PLACES ON THE BOARD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Guerrilla warfare is a type of unconventional warfare in which small groups of irregular military, such as rebels, partisans, paramilitary personnel or armed civilians, which may include children in the military, use ambushes, sabotage, terrorism, raids, petty warfare or hit-and-run tactics in a rebellion, in a violent conflict, in a war or in a civil war to fight against regular military, police or rival insurgent forces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun offline game, makes you feel like a real pilot, paratrooper, or sniper, super customizable with mods, I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game includes very awesome ragdoll physics, sometimes realistic and sometimes extremely funny, and has a great modding community. thats kinda everything i remember. Just play it, its worth the 17 bucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fairly versatile game. Make sure you only play it if you have a computer mouse, otherwise the trackpad will make the game awkward to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny game and i love it love when bots shoot you or run you over lol its gold!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best first person shooter when it comes to modding. You can have dorito bags armed with AKMs fighting each other. Absolute peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and even though it does not look realistic it feels very realistic, and the mods work really well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome sandbox war game, you can do any type of conflicts that you heart desires, you can go from The Great War (WW1) to Afghan War in just a second, you can go from arcade to milsim just with click of buttons on a workshop page, you can have the weapon you want, if you like AR platform, well theres alot for you to choose, if you love AK platform its the same for the AR, alot of mods, you can add any skins that you want for your soldiers, from real military units skins like Delta Force, Navy SEALs, to self made skins like 18th division and etc, if the graphics dont please you, thats not a problem! With just some clicks and adjusts you can download reshade and alot of presets, if the arcade gameplay doesnt please you and you like a more MILSIM style of gameplay, dont worry, theres mods of realistic camera movements and animations, like the SQUAD style sway to even Bodycams movements!!, if the blood doesnt pleases you and you want a more realistic and war footage violence, thats not a problem! There are mods that adds better blood spills to even heavy realistic gore like heads open in half and dismemberments, a example of gore mod is the LeMieux's gore mod 2 a gore mod that adds alot of dismemberments and even guts physics and custom blood pools & spills!! If this game doesnt gives you alot of fun than nothing will!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun with all the mods i have but without em its js a goofy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is so fun and there is lots of diffrent wepones",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenfield is very fun, it's customizable with mods just like Minecraft, which I also like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun, enjoyable and a really fun way to kill time and with the mods you can customise it anyway you like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for first person shooter lovers and great when it comes to workshop items",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenfield is a pretty basic military based sandbox shooter with potato graphics but some fun maps, vehicles and game-modes and is highly moddable making for more fun and hours spent playing, just wish there was more to the game and that the graphics were a bit better, it definitely has potential.\n\n7.3/10 Very fun driving around with npcs in a tank blowing people up lol, and definitely worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game because it is simple easy to learn and fun thanks for making this game and listening to the community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a really good game for what it is. You can make huge battles with hundreds of NPCs (as long as your PC isn't complete junk) with modded weapons and models, heck you could even have star wars battle droids fight nazi germany! Or you could try and make the game as realistic as possible with installing mods for \"realism\". There's lots of possibilities with this game. Even online play is possible as long as you downgrade your version and apply a mod. Recommend checking it out, it's pretty cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes i would aboslutly (srry if i spelt that wrong) But dont get your hopes up you have to install mods i thought the mods already came with the game but you have to install them but yes i would recommend this game to others give it a try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun and its nice to be able to get mods easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful game! I have enjoyed every second of playing it. I would recommend EVERYONE to play this game if I could!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Similar to both War Thunder, DCS, and a little bit of Arma. I think almost anyone can enjoy it with tons of mods in the workshop, and stream compatability on discord.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although this game is pricey for what it offers, if you are on a lower end device and want an easly modible first person shooter, this game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly one of the best shooter out there. Sure, it's buggy, sure the bots are dumb as a lamp post. That's part of the charme though. THe thing that sets Ravenfield apart from other FPS is the fact that it is not trying to be other FPS. Ravenfield may only be singleplayer, but that means you can have funny slow-mo ragdolls. Not to mention the Workshop: this game LIVES off of its community. Without talented modders like Charlie or Sofa the game would have died years ago. What you are looking at, is the GMod of shooters: the ultimate custom battle. You want to play as a Wehrmacht soldier fighting Dr. Kleiner from Half-Life with water guns? Go for it. You want to test nuclear strikes against the P.1000 Ratte? Go for it. You want bodycam footage of an Iraqi soldier fighting the US Army in Al-Basrah? Go for it. This game is not just a shooter, it's YOUR shooter the moment you decide to check out mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and good game even beter with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probable the best battle simulator I've played. Ravenfield has so much content, and it still early access. I would reccomend downloading mods or doing the same battles might get boring :/. so yea great community and I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get this game if you like customization of FPS and vehicle gameplay, or battle reenactment. Thank goodness for the mods though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenfield is a wonderful mix of everything good and everything great. That's all I can give it: it's a great shooter game with a well-manufactured AI (which I can hold that is NOT that smart, but it is intelligent enough to get the job done very well!). It emulates a multiplayer experience VERY well and is great for simulating large wars similar to Ancient Warfare 2/3 or TABS. Don't even get me started on the fantastic modding community that the game offers, because if boredom ever is even a factor in your experience-- you obviously haven't discovered the fantastical world of Ravenfield modding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cause it is a fun game with many workshop mods and many different playstyles. this game fits many needs to a player would recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve spent hours tweaking battles—adding helicopters, swapping out weapons, even recreating sci-fi skirmishes with Star Wars mods. One of my favorite setups was a snowy map with stealth gear and suppressed weapons, where I played out a full-on spec ops infiltration. No story, no rules—just me, my imagination, and a bunch of bots who had no idea what hit them.\n\nWhat I love most is how Ravenfield doesn’t take itself too seriously. It gives you the tools, then gets out of the way. Whether I’m testing ridiculous weapons (like a gun that fires tanks) or trying to survive a zombie wave, it always feels fresh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game just wish it had more people working on it because it has been in early access for over 8 years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im writing this review so i can get the steam badge and also i like the game it is fun with mods :p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its peak. and really easy to mod. nothing else needs to be said.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I get to shoot ppl not as fun as real life but still",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great mods and community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely brilliant game to play, amazing mods to go with it!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very awesome i have mods that make it perfect and you just get them from the workshop no sketchy website",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10, phenomenal mod support, would kick shirtless texans in the nuts for ammo again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenfield is AMAAAZIING! its fun, the story, the guns, the enemy's ragdoll's flying though the air, I can't wait for multiplayer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6741 worth a try very goonism and edgism 1000 percent quilified byt the nig aa comunity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it a dopemine, once you download a cool mod, you want more. You want it so much it effect your PC mental health.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spawned 24 teamates and instantly ran them over with a truck. Proseded to lose miserably 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is peak been playing for multiple years i do recomend if you have 20bucks to burn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun and filled with funny moments",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game to mess around with mods. Would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very well made game with lots of mods and very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS A GREAT GAME ITS REALLY COOL AND FUN TO PLAY (Also the physics)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great but the map editor fucking sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING I JUST BOUGHT ITS THE BEST GAME FOR FUN DISCLAMER CHANGE ALL YOUR SETTINGS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the vanilla raven field can be fun but its more addicting with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the mods and one thing i dont like is that it has no campagin and no story line",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Battlefield but with unlimited content",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I would say its kinda a scam to pay 18 dollars for this game however the game could change since it is in early access. I had fun playing it but over time it got a bit dry. There is a large list of thousands of fan made mods but even those don't add a lot and can be slightly buggy. I would say if you get this on sale its a good deal and it runs well with most computers. I hope this game improves over time but for now I honestly would not reccomend this game to anyone unless they are looking for a sandbox shooter style game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steel raven has made a game with potential but that's it, the new \"rarity\" system is a good idea but poorly executed and buggy, the configure flags tool breaks the ai and screws with the way matches work the only \"fun\" to be had in this is with mods which again is a good idea in concept but when put practice it doesn't work not because of the modders but because steel raven continuously puts out updates that break mods and then says that he will give them more tools to work with which is in no way a bad thing but after he states that he also says hes no longer working on certain features which were hyped like the story mode or the conquest mode which is also buggy and hasn't been worked on since it's creation and you can't delete presets for mode setups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is cool but it 100% is NOT worth 20 euros",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i bought this because battlefield 1 is 50 bucks and im thrifty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA32 fucked up all  the mods I had, shit update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game if fun but the new ui is fucking horrible its laggy and so confusing and it crashes my game when i try to select vehicle it takes way longer to set up battles and its just shitty overall if the devs could add a option in settings to change it it would be better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i would give this a thumbs up but the menu to select and deselect weapons and vehicles for a match is just very confusing",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s a fun sandbox but the ui still sucks even after being updated, also after you install like 4 mods goodluck organizing shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would say its kinda a scam to pay 18 dollars for this game however the game could change since it is in early access. I had fun playing it but over time it got a bit dry. There is a large list of thousands of fan made mods but even those don't add a lot and can be slightly buggy. I would say if you get this on sale its a good deal and it runs well with most computers. I hope this game improves over time but for now I honestly would not reccomend this game to anyone unless they are looking for a sandbox shooter style game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steel raven has made a game with potential but that's it, the new \"rarity\" system is a good idea but poorly executed and buggy, the configure flags tool breaks the ai and screws with the way matches work the only \"fun\" to be had in this is with mods which again is a good idea in concept but when put practice it doesn't work not because of the modders but because steel raven continuously puts out updates that break mods and then says that he will give them more tools to work with which is in no way a bad thing but after he states that he also says hes no longer working on certain features which were hyped like the story mode or the conquest mode which is also buggy and hasn't been worked on since it's creation and you can't delete presets for mode setups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is cool but it 100% is NOT worth 20 euros",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i bought this because battlefield 1 is 50 bucks and im thrifty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA32 fucked up all  the mods I had, shit update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game if fun but the new ui is fucking horrible its laggy and so confusing and it crashes my game when i try to select vehicle it takes way longer to set up battles and its just shitty overall if the devs could add a option in settings to change it it would be better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i would give this a thumbs up but the menu to select and deselect weapons and vehicles for a match is just very confusing",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s a fun sandbox but the ui still sucks even after being updated, also after you install like 4 mods goodluck organizing shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would say its kinda a scam to pay 18 dollars for this game however the game could change since it is in early access. I had fun playing it but over time it got a bit dry. There is a large list of thousands of fan made mods but even those don't add a lot and can be slightly buggy. I would say if you get this on sale its a good deal and it runs well with most computers. I hope this game improves over time but for now I honestly would not reccomend this game to anyone unless they are looking for a sandbox shooter style game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steel raven has made a game with potential but that's it, the new \"rarity\" system is a good idea but poorly executed and buggy, the configure flags tool breaks the ai and screws with the way matches work the only \"fun\" to be had in this is with mods which again is a good idea in concept but when put practice it doesn't work not because of the modders but because steel raven continuously puts out updates that break mods and then says that he will give them more tools to work with which is in no way a bad thing but after he states that he also says hes no longer working on certain features which were hyped like the story mode or the conquest mode which is also buggy and hasn't been worked on since it's creation and you can't delete presets for mode setups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is cool but it 100% is NOT worth 20 euros",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i bought this because battlefield 1 is 50 bucks and im thrifty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA32 fucked up all  the mods I had, shit update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game if fun but the new ui is fucking horrible its laggy and so confusing and it crashes my game when i try to select vehicle it takes way longer to set up battles and its just shitty overall if the devs could add a option in settings to change it it would be better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i would give this a thumbs up but the menu to select and deselect weapons and vehicles for a match is just very confusing",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s a fun sandbox but the ui still sucks even after being updated, also after you install like 4 mods goodluck organizing shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would say its kinda a scam to pay 18 dollars for this game however the game could change since it is in early access. I had fun playing it but over time it got a bit dry. There is a large list of thousands of fan made mods but even those don't add a lot and can be slightly buggy. I would say if you get this on sale its a good deal and it runs well with most computers. I hope this game improves over time but for now I honestly would not reccomend this game to anyone unless they are looking for a sandbox shooter style game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steel raven has made a game with potential but that's it, the new \"rarity\" system is a good idea but poorly executed and buggy, the configure flags tool breaks the ai and screws with the way matches work the only \"fun\" to be had in this is with mods which again is a good idea in concept but when put practice it doesn't work not because of the modders but because steel raven continuously puts out updates that break mods and then says that he will give them more tools to work with which is in no way a bad thing but after he states that he also says hes no longer working on certain features which were hyped like the story mode or the conquest mode which is also buggy and hasn't been worked on since it's creation and you can't delete presets for mode setups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is cool but it 100% is NOT worth 20 euros",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i bought this because battlefield 1 is 50 bucks and im thrifty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA32 fucked up all  the mods I had, shit update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE IT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game if fun but the new ui is fucking horrible its laggy and so confusing and it crashes my game when i try to select vehicle it takes way longer to set up battles and its just shitty overall if the devs could add a option in settings to change it it would be better",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i would give this a thumbs up but the menu to select and deselect weapons and vehicles for a match is just very confusing",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s a fun sandbox but the ui still sucks even after being updated, also after you install like 4 mods goodluck organizing shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would say its kinda a scam to pay 18 dollars for this game however the game could change since it is in early access. I had fun playing it but over time it got a bit dry. There is a large list of thousands of fan made mods but even those don't add a lot and can be slightly buggy. I would say if you get this on sale its a good deal and it runs well with most computers. I hope this game improves over time but for now I honestly would not reccomend this game to anyone unless they are looking for a sandbox shooter style game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steel raven has made a game with potential but that's it, the new \"rarity\" system is a good idea but poorly executed and buggy, the configure flags tool breaks the ai and screws with the way matches work the only \"fun\" to be had in this is with mods which again is a good idea in concept but when put practice it doesn't work not because of the modders but because steel raven continuously puts out updates that break mods and then says that he will give them more tools to work with which is in no way a bad thing but after he states that he also says hes no longer working on certain features which were hyped like the story mode or the conquest mode which is also buggy and hasn't been worked on since it's creation and you can't delete presets for mode setups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is cool but it 100% is NOT worth 20 euros",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i bought this because battlefield 1 is 50 bucks and im thrifty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EA32 fucked up all  the mods I had, shit update",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE IT",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}