{
  "positive": [
    {
      "review": "There is nothing more to say—the mods (e.g., Roguetech) keep this game extremely enjoyable and addictive :D. Every hour I put into it feels like a love-hate relationship. This is my second largest game in terms of hours played. It seems I’ll never stop playing it.\n\nBut we NEED a new game with a new modern engine!!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very fun game set in the Battletech universe. While it may be a bit rough around the edges, I thoroughly enjoyed my time playing this game. The only real complaint I have is that there isn't more of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. And with the extensive mod options, I love it even more.\r\nPLEASE PLEASE PLEASE make Battletech 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For those that are unfamiliar with the Battletech franchise: This is a super fun tactical RPG with big stompy robots shooting each other. It's similar to XCOM in mechanics, but played in large scale on the surface of various planets. It can be a bit overwhelming at first to figure out the mechanics, and the in game tutorials are a bit lacking, so be prepared to look some stuff up. Once you get the hang of the basics and figure out the weapon types and ranges, it becomes pretty intuitive.\r\n\r\nFor those who have played CBT, it is pretty close to 1:1 classic rules. It takes the thinking out of movement and facing for the most part, treats cover and terrain levels a bit differently, and simplifies the pilot rolls mechanics. Also the numbers on damage and armor are scaled differently. It's very good! I really enjoy the campaign mechanics. It's set up pretty much the same as MW5 mercs, but in a smaller section of the perirphery just south of the capellan confederation.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you love turn based combat, min- maxing, challenging strategic battles with a lot of details and big un mechs that is something for you. Base campaign is ca 60-100 hours, more in the career mode and DLCs but it is worth trying.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super great game, has a good difficulty. can recommend for sure to anyone that likes mechs/mechwarrior and turn based games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Mech battles are fun, the story is very true to Battletech, and keeping it at 3025 tech level with a little bit of added lostech keeps things from getting too kooky. There's always mods if you want more of the crazy stuff as well.\n\nLoad times are pretty annoying though TBH.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great RTS game of mechs with lots of replay . I hope that more DLCs are made for this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game and keep coming back to it over and over.  If you have not played this, please do.  There is a little bit of a learning curve, but it plays very much like xcom.  I hope they do a sequel one day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I could replay this game on repeat if there weren't so many other games to try! I love the strategies, and I feel like they largely do the Battletech universe justice. Choose to salvage mech pieces and occasionally set new rules for different runs, like don't piss off the pirates, or Kill all things things Lyran, etc. \n\nNow I'll drop anything and everything when a new version with all the clans drops!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty good. \r\n\r\nParticularly good: The sound design, the ambient noises in the ship, the satisfying sound of the heavy autocannon. \r\n\r\nParticularly bad: I don't know why there aren't more limitations on deployments. It leads to a lot of missions feeling very same-y, even when you have access to dozens and dozens of mechs, you can drop the same 4 assault mechs. The story battles should have grown in scope, multiple lances deployed simultaneously, different requirements. I know this is possible, because Mechcommander had this 20 years ago!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, got about 90 hours on the vanilla version. The Roguetech mod got me the other 2500 hours. Highly recommend both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly fun turn based tactical combat with a campaign and career mode.  Plenty of ways to play it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While not exactly a transfer of the Tabletop game.  It is still a fun tactical/strategy game with big, stompy, robots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great turn based strategy. If you like the combat of Baldur's Gate 3 or similar games, you'll like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Giant Merc Robots.  Front Mission with more options.  \r\n\r\nSave up for that Gauss Rifle.\r\n\r\n Max salvage every time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why can't I just left click through the opening movie? I keep my mouse handy, but I have to reach over, get my keyboard, and press escape. I have to be careful though because if I press it twice, it asks me if I want to exit the game. It's a great many petty annoyances like this that make Battletech. Despite this, I recommend it because there really isn't anything like this out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty much my favorite game of all time. What's not to love? Big robots. Space ships. Planet hopping. Good story. Custom features. It's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the OG game I love. I can't tell you how many nights and days I spent playing this during my college days with friends. Harebrained repackaged it and made it a fun battletech video game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BATTLETECH is a turn-based tactical strategy game developed by Harebrained Schemes and set in the classic MechWarrior universe. It focuses on commanding a squad of customizable BattleMechs in a mix of tactical combat, resource management, and mercenary operations. The game translates the tabletop roots of the franchise into a modern digital format with impressive depth and atmosphere.\n\nGameplay revolves around commanding a lance of up to four mechs in turn-based missions across diverse planetary environments. Positioning, line of sight, and heat management are critical. Every move carries weight, as overheating, terrain, and armor placement can determine victory or destruction. The combat pace is deliberate, emphasizing careful planning over reflexes.\n\nCustomization is one of BATTLETECH’s strongest features. Each mech can be outfitted with a wide range of weapons, armor configurations, and heat sinks. Balancing weight, firepower, and mobility allows for deep strategic experimentation. The variety of chassis—from light scouts to heavy assault mechs—encourages diverse playstyles and tactical flexibility.\n\nOutside of battle, the campaign layer adds another dimension. You manage a mercenary company, negotiating contracts, maintaining finances, repairing mechs, and hiring pilots. Decisions made in management affect combat readiness and long-term survival. The economic pressure keeps the experience grounded, making each battle outcome meaningful beyond immediate rewards.\n\nThe narrative combines political intrigue and personal stakes within the Inner Sphere. You aid a deposed noblewoman in reclaiming her throne while navigating alliances and betrayals. The writing is grounded and mature, blending military realism with science fiction lore that fans of the franchise will appreciate.\n\nVisually, BATTLETECH presents its universe with grit and realism. The mech models are detailed and weighty, and the combat effects feel impactful without being flashy. The interface is functional but dense, reflecting the game’s complexity. Audio design—especially the heavy mech footsteps and weapon fire—reinforces the sense of scale.\n\nOverall, BATTLETECH is a deep and satisfying tactical experience. It rewards patience, precision, and strategic thinking. While its pacing may feel slow for players seeking constant action, its depth and atmosphere make it one of the most faithful and engaging adaptations of the BattleTech universe to date. It stands as a must-play for fans of turn-based strategy and mech warfare.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game unfortunately need to install the big mods for clan mechs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Хоть я и не фанат гигантских роботов, но игра супер благодаря своим механикам и геймлею. Прошёл всю компанию, очень доволен. Всё что нужно - здесь присутствует: сборка лута после битвы (сальважинг), полная кастомизация мехов (свои персональные сборки), после компании открывается вся карта, где можно делать всё что хотите. \r\nНаличие кучи модов. Я пробовал RogurTech и мне не очень зашло. Слишком сложно, в том плане, что просто тупо духота, наличие пресловутых зомби которых уже не знают куда ещё запихать, которые совершенно не вписываются в лор игры и т.д.. Одна битва длится по 2 часа, и малейшая буквально ошибка и она проиграна, и 2 часа вашей жизни в помойку, а то и больше, потому что в некоторых случаях придётся перезапускать карьеру/всю компанию. Я не из тех кто играет только в одну игру, и у кого есть по пол дня вв неё зависать каждый день. Хотя, если вы один из тех кто играет в Battletech очень хорошо, кто очень большой фанат игры, и для кого уже всё понятно и легко - то можно и RogueTech.\r\nСоветую BTAdvanced 3062 mod, он более приблежённый к ванильному геймлею, а так же сордержит в себе и гигантскую карту, и контракты по всей карте, плюс дополнительные модовые мехи и дополнения в виде брони, пушек и т.д.. Присутсвует небольшое усложнение AI (по моим ощущениям), но в ваниле после 60%-70% пройденной компании становится очень легко, так что это лёгкое усложнение только на пользу. Так же у него было замечено гораздо меньше багов, в отличии от RoguTech.\r\nРаньше игра была часто по скидке, сейчас не знаю, так как не отслеживаю. Игра у меня была куплена сразу со всеми дополнениями по моему с 50% скидкой, что по цене я считаю очень достойно и стоит каждой потраченой монеты.\r\nЖалко конечно, что разработчики никак не развивают игру и я так понимаю продолжения/новой истории в мире Battletech не предвидится. Ну или хотябы ремикс как сейчас модно это делать, так как хорошие игры с повесткой не получаются, а вот старую переделать - есть хорошая отмазка - что мы просто улучшили то что было))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would highly recommend this game. I have played the original board game and the other software iterations (PC, PS2, Nintendo, etc) and this ranks very high.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very enjoyable for those who love the board game.  And challenging enough for those who just love giant, stompy robots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The next best thing, when you can't play the tabletop version with real humans. Incredibly detailed conversion. One thing, though, the game doesn't give you auto wins just so everyone who starts the game will complete it. You have to learn the mechanics and make the right strategic and tactical decisions. If you like a challenge and remember the good old days where you had to become good enough for a PC game over time and not be pampered, you will like this. If you expect the game to adjust to your skill, you might get disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing tactical game. 9/10 and with mods (which are AWESOME) it's a 10/10. Really hope there will be Battletech 2. Love this game and the battletech universe. Long live mechwarrior",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stompy robutt game! Look, for the price of the game you can also get BTA Advanced, Roguetech, and BEX which are like three more battletech games. Modding community is alive and well meaning . . . well, hundreds of hours of gameplay finding new mechs, kitting them out, and killing people with them and causing massive property damage. Artillery + invasion + urban maps means no credit penalty for \"collateral damage\". Also it's fun to blow up buildings mechs have jumped on and watching them fall. \r\n\r\nMemory leak issue is a bitch though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Con todos los defectos que tiene, es un estupendo juego táctico de robotitos que se tiran misiles y se disparan lásers de colorines.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "old school tactical strategy with mechs! has a good amount to choose from and they are customizable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]⭐⭐⭐⭐⭐ Just Fantastic![/h1]\n\n[b]One of the best strategy games I’ve ever played![/b]  \nI’ve been playing strategy titles for decades, and this one easily makes the top tier. I rarely leave reviews, but credit where it’s due — this is a brilliantly balanced, immersive experience that deserves recognition.\n\n[hr]\n\n[h2]⚙️ A True MechWarrior Experience[/h2]  \nI’ve played every MechWarrior I could find, the latest being [i]MW5: Clans[/i]. Those were all first-person simulators — fantastic for the cockpit feel and Mech customization — but this game brings back the [b]command-level strategy[/b] that was missing.  \n\nIt captures what the Battletech universe started with back in the 1980s board-game era: [b]terrain tactics, team coordination, flanking, ambushing, hit-and-run[/b] — the true art of battle.\n\n[hr]\n\n[h2]🛠️ Progression That Feels Earned[/h2]  \nBuilding your merc company from scratch is tough but deeply rewarding. Every upgrade, refit, and loadout decision matters.  \n\n• [b]Overheating[/b] actually influences your tactics.  \n• [b]Terrain[/b] can help or hinder you.  \n• [b]Finances, reputation, and pilot growth[/b] all tie together naturally.  \n\nYou don’t just play battles — you [i]manage a campaign.[/i]\n\n[hr]\n\n[h2]🚀 Authenticity Everywhere[/h2]  \nFrom JumpShip upgrades to pilot training, from refit bays to combat briefings — everything feels authentic and connected to the MechWarrior world.  \nThe UI, atmosphere, and tone show real respect for the source material.\n\n[hr]\n\n[h2]🎨 Presentation[/h2]  \n• [b]Graphics:[/b] Solid, detailed, and sure to improve with community support.  \n• [b]Sound & Music:[/b] Strong work — immersive and well-matched to the pacing.  \n• [b]Performance:[/b] Smooth on modern rigs; clearly well-optimized.\n\n[hr]\n\n[h2]👎 The Bad?[/h2]  \nHonestly… I haven’t found much yet.  \nMaybe I’m just too absorbed to notice — and that says something.\n\n[hr]\n\n[h2]🏆 Final Verdict[/h2]  \nThis game absolutely [b]rocks![/b]  \nIt’s tactical, rewarding, and made with clear passion for the universe.  \n\nIf you’re a true strategist — or a Mech fan — [b]don’t skip this one.[/b]  \nIt takes effort, but that’s what makes it [i]real.[/i]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Modern Day reboot of Mech Commander",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun turn based tactical Mech combat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Are you a BattleTech fan? If yes, get this game. That simple.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Call Of Duty for statisticians. I love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, especially with mods. I almost exclusively play the career mode and I enjoy how much things you can choose about your lance (unlike some other battletech games cough cough).\nIf you like tactics games like xcom I can highly recommend this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game, brings back childhood memories. More DLC and V2 required.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Going over 100's of titles in my library and this one stands out strong in my mind. \nI rarely play a game and am surprised, repeatedly, in a good way. \n\nI really got into the attention to detail in this one, from pilots and mechs, to the random BS and cost of being a mercenary captain, paying off debt and upgrading the damaged ship you launch from... I felt a real translation from my tactical choices to what sort of loot I'd get and profit thereafter would snowball into a clear picture of risk vs reward. Dark times, the best of times- mostly were my fault and not everything was a pretty check down the list of boxes and move on as the chosen one. \n\nStarting out gives ya context of the 'struggle' and opens into a transformation story of having zero to hero vibes where just ONE of my mechs could lay low most of a government and those choices would have an echo. \n\nLove this title and it still stands strong today as a \"if ya didn't already- play this\" \nCan't argue with something that just delivers on all fronts. The freelance mode is also a fun romp after the story mode.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun Digital adaption of the Tabletop Game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game with more depth than I at first thought.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it when your best mechwarrior dies from a crit on the head from a haft dead griffin",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AND HERE COMES THE HIGHLANDER OFF THE TOP ROPE\r\nHE HAS A STEEL CHAIR!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game robots bit stomp stomp boom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game made Awesome with the BTA 3062 mod",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes very much this game should have come out a long time ago!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish there was more variety of maps, but I've been enjoying the heck out of it regardless.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I genuinely find this game to be the coziest mech game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will forever be waiting for a sequel in the Clan Wars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game! Enjoyable all the way through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, if you don’t have MechWarrior 5: Mercs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Big robots go boom, make me happy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Takes me back to the 80s and 90s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's like good and stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big 'honkin, stompin' robots. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I STILL LOVE THIS GAME MAKE A SEQUEL PLS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just great fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's woke!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'D LIKE SOME MOAR PLEASE SER!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old school BTech fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "boom!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's ok.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GREAT GAME LOTS OF FUN",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like rougetech",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "vggvhjhngff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You should play this game. You get to run a company of mechs. And upgrade the mechs. And get better mechs and make your company better. And your company gets better so you get better mechs. And your mechs become cooler!",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "This game was so good I became a full blown Battletech addict. I now smoke battlecrack full time.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Battletech, coupled with Roguetech community mod, might be the most extensive and deep turn based mech game that will ever exist in our lifetimes.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Its literally tabletop mechwarrior in a video game, WITH A CAREER SIMULATOR.\n\ni doubt there will ever be a turned based combat game better than this one.\nThe combat is incredibly satisfying and rewarding, the visuals are delicious, it is genuinely super fun, challenging and i come back to play it so often. The mods are also really good, but the vanilla game is enough for me! and the dlcs are obviously just more content to play with. (though, really expensive).\n\nif only there was a proper co-op mode, but i dont know how that'd work, ill just play mercenaries with my friends if i want co-op mechwarrior.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "its the closes as you can get to tabletop game play\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☑ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "This game is so good at scratching all the tabletop game itches without any of the set up or expensive of buying and painting thousands of dollars of minis.  The story line is immensely fun. The campaign has fairly little re-playability but the game itself offers many hours of entertainment.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "There is nothing more to say—the mods (e.g., Roguetech) keep this game extremely enjoyable and addictive :D. Every hour I put into it feels like a love-hate relationship. This is my second largest game in terms of hours played. It seems I’ll never stop playing it.\n\nBut we NEED a new game with a new modern engine!!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game was a great introduction to the Battletech setting. It's got highlights when your talking to people that you can hover over to learn about the subject at hand and covers enough of the setting your not lost when you start looking at other media. The game has an expansive and still active modding community that have expanded the game to the entirety of the settings inhabited space with just about every piece of equipment ever available through the tabletop rules and a expanded mech designer to play around with them! The DLC are solid additions to the game adding new environments and a whole lot more mechs to play with and against which really helps keep missions fresh and varied! \n\nThere are complaints that your limited to just 4 mechs at a time but you really don't need more if your playing smart and if your really in over your head then get out and end the contract, your a mercenary and a single mission isn't worth your whole force, fighting to the last is for suckers. Plus the mods expand the number you can bring anyway.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Wonderful mech customization, deep exploration of star systems, lots of moving pieces to consider and tinker with & a cool story as a backdrop to the turn-based battles & progression. Love this one, hope to see some sequels someday!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "brilliant turn based game great representation of classic battletech while not as in depth its streamlined for the best",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Play the campaign once then go play BEX or BTA, both fantastic expansion mods for the game that add hundreds of new mechs. Avoid Roguetech unless you have a really good PC, that thing is notorious for being extremely hard and resource intensive",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Very fun game set in the Battletech universe. While it may be a bit rough around the edges, I thoroughly enjoyed my time playing this game. The only real complaint I have is that there isn't more of it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. And with the extensive mod options, I love it even more.\r\nPLEASE PLEASE PLEASE make Battletech 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For those that are unfamiliar with the Battletech franchise: This is a super fun tactical RPG with big stompy robots shooting each other. It's similar to XCOM in mechanics, but played in large scale on the surface of various planets. It can be a bit overwhelming at first to figure out the mechanics, and the in game tutorials are a bit lacking, so be prepared to look some stuff up. Once you get the hang of the basics and figure out the weapon types and ranges, it becomes pretty intuitive.\r\n\r\nFor those who have played CBT, it is pretty close to 1:1 classic rules. It takes the thinking out of movement and facing for the most part, treats cover and terrain levels a bit differently, and simplifies the pilot rolls mechanics. Also the numbers on damage and armor are scaled differently. It's very good! I really enjoy the campaign mechanics. It's set up pretty much the same as MW5 mercs, but in a smaller section of the perirphery just south of the capellan confederation.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you love turn based combat, min- maxing, challenging strategic battles with a lot of details and big un mechs that is something for you. Base campaign is ca 60-100 hours, more in the career mode and DLCs but it is worth trying.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Super great game, has a good difficulty. can recommend for sure to anyone that likes mechs/mechwarrior and turn based games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a really good game.\r\n\r\nIf you like a turn based tactics game (I love them) then Battletech is going to scratch that itch in very satisfying fashion.\r\n\r\ndisclaimer\r\nI have only played the campaign and do not intend to touch multiplayer or career mode.\r\n\r\nPros\r\nMy usual gripes are nowhere to be seen. You can skip the intro and splash screens. You can quit to desktop from the pause menu.\r\nThe game runs well on a modern rig and I experienced no crashes. Strangely long load times though.\r\nThe game play is solid. No mission will take more than about 20 minutes.\r\nThe campaign story is your usual betrayal and redemption arc but does it's job of giving you a reason for all your destruction.\r\nDifficulty was surprisingly high at the start but once your lance is at full power there is very little to stop you. This in my opinion is the sweet spot for games. It should be hard to begin with but by the end I should be a god like legend swatting away all comers like flies. Battletech gets this spot on.\r\nThe music is good but not spectacular. It is reminiscent of Barber's Adagio for strings (never a bad thing), used in Homeworld. It fits the game very well and an often overlooked part of many games comes in solid here.\r\n\r\nCons\r\nUnity engine always makes me apprehensive.\r\nThe game is showing it's age in that it is not graphically very spectacular. If that bothers you then you might be disappointed.\r\nThere is a distinct lack of strategy beyond making sure your tonnage is higher than your opponents by some margin. Once you have figured out the basics there is not really a large scope for tactics. Cover seems to be irrelevant and other than attacks from the rear and protecting or targeting damaged zones it seems like there is not a large scope for strategy. That might just be me though.\r\nPeople looking for a real challenge might want to look elsewhere this is not a hard game beyond a certain point.\r\n\r\nOverall well worth the money I paid for it and if you like turn based tactics games this should be on your list.\r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Mech battles are fun, the story is very true to Battletech, and keeping it at 3025 tech level with a little bit of added lostech keeps things from getting too kooky. There's always mods if you want more of the crazy stuff as well.\n\nLoad times are pretty annoying though TBH.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I regret not keeping all of my BT novels and game books. I absolutely love this game and am addicted to it. I could never find people to play in the real world, because of being in a rural community. This is the next best thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game can be fun. the only problems I have had so far is loading the game can take a long time and every update causes any mods loaded needs to be reinstalled.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great RTS game of mechs with lots of replay . I hope that more DLCs are made for this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game and keep coming back to it over and over.  If you have not played this, please do.  There is a little bit of a learning curve, but it plays very much like xcom.  I hope they do a sequel one day!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I could replay this game on repeat if there weren't so many other games to try! I love the strategies, and I feel like they largely do the Battletech universe justice. Choose to salvage mech pieces and occasionally set new rules for different runs, like don't piss off the pirates, or Kill all things things Lyran, etc. \n\nNow I'll drop anything and everything when a new version with all the clans drops!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty good. \r\n\r\nParticularly good: The sound design, the ambient noises in the ship, the satisfying sound of the heavy autocannon. \r\n\r\nParticularly bad: I don't know why there aren't more limitations on deployments. It leads to a lot of missions feeling very same-y, even when you have access to dozens and dozens of mechs, you can drop the same 4 assault mechs. The story battles should have grown in scope, multiple lances deployed simultaneously, different requirements. I know this is possible, because Mechcommander had this 20 years ago!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, got about 90 hours on the vanilla version. The Roguetech mod got me the other 2500 hours. Highly recommend both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly fun turn based tactical combat with a campaign and career mode.  Plenty of ways to play it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While not exactly a transfer of the Tabletop game.  It is still a fun tactical/strategy game with big, stompy, robots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great turn based strategy. If you like the combat of Baldur's Gate 3 or similar games, you'll like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Giant Merc Robots.  Front Mission with more options.  \r\n\r\nSave up for that Gauss Rifle.\r\n\r\n Max salvage every time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Why can't I just left click through the opening movie? I keep my mouse handy, but I have to reach over, get my keyboard, and press escape. I have to be careful though because if I press it twice, it asks me if I want to exit the game. It's a great many petty annoyances like this that make Battletech. Despite this, I recommend it because there really isn't anything like this out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty much my favorite game of all time. What's not to love? Big robots. Space ships. Planet hopping. Good story. Custom features. It's great.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Way too expensive for what it is. Not much actual tactical meat here. It's just an RNG fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just another trash game where the dev's idea of difficulty is to constantly have you outnumbered and outweighed by the enemy. \n\"Oh, look, another mission where my four mediums face six heavy and assault mechs! What fun!\" Maybe someday there'll be a BattleTech computer game worthy of the name, but this isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yet another game released with bare bones, the full game and mechanics are hidden behind 3 additional DLCs.  Welcome to the death of gaming.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Although I've been playing Mechwarrior for decades, this was my first time playing Battletech. The trailers looked really good, and most the reviews checked out, so I started playing the vanilla version without any mods.\r\n\r\nThe gameplay is slow, even for turn based games. The graphics have not aged well. Getting to the various screens you need in the leopard are a pain. Load times are alive and well. There isn't much variety in the missions.\r\n\r\nThere are some good elements to the game such as the mechlab, the voice acting, and some of the writing. I really appreciate how much difference the terrain makes in this game, compared to MW titles. And melee is actually a viable attack in Battletech! But unfortunately these things are not enough to encourage me to click the Play button again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a hoot if you're a Battletech tabletop fan, what with all it's mech building intricacies and vague mechanics that the game absolutely does not bother explaining to you. For me, it just feels like a chore to have several tabs open into rulebooks and hour-long YouTube videos explaining the nuance of combat.\n\nNo one wants a massive info dump at the beginning of the game, but surely even an in-game manual would be helpful? So many mechanics are fed to you by brief blurbs from NPCs that largely amount to \"you have to manage your heat!\" without explaining the numerous ways to do that. Bracing, bulwark, evasion, a whole litany of game mechanics are not properly laid out for you in any way. Normally, I'd say this is beneficial for the sake of trial and error - but error means waiting. And I mean [i]waiting[/i]. As Tom Petty once said, \"the waiting is the hardest part.\"\n\nInjuries and repair times can be mitigated later into the game, but only so much. You'll still spend several minutes on a time advancement screen between battles, even if all goes well, as there is travel involved. What is there to do in that interim? Well, not much. This in and of itself isn't damning, but then there's the combat. Even turning off some extra animations still has battles taking entirely too long for how stale they become. Sometimes it's just turns of sprinting across a generic gameboard to get to an objective before spending 20 minutes firing shots with a slow, itemized list popping up of every affect you inflicted on the enemy mech.\n\nAll in all, it's just a bland, slow grind made unbearable by static between everything. The fun of tabletop gaming is the social experience that fills that empty space between turns - this simply takes everything fun from that and serves it up with typically overpriced Paradox DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After two different computers I expected this game to not crash randomly after getting through the campaign. At first I thought it was my system kind of sucking, but turns out it's the game that sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty is too hard, in a way that doesn't feel challenging and just arbitrary and it feels more like a grind than a fun experience. \n\nThe story itself is too much of a novel than what should be a video game experience. Much more voice acting and cutscenes would have really improved the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is nice, but the AI is allowed to cheat when you get to a skull of two or more and you can field a 70 ton mech or higher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this years ago. Tutorial is horrible. Started a campaign, played the first mission and Mastiff gets wreched. Game Over. Decided to give it another try recently and Mastiff still gets dogpiled and wrecked, ending the mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While I have liked the franchise for years, I found the campaign for this iteration to be really boring, with stale, repetitive, fights. I get why my friends that are diehard Battletech fans like this game, but I just cannot get into it. If you're curious and it's on sale for a deep discount, it might be worth grabbing, but I could never recommend anyone pay full price.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game. It has A LOT of cool mechanics, customizing your mechs is super enjoyable. \n\n**However**, if you've ever heard the saying \"hard, but fair\" that does **not** apply to BATTLETECH. This game is just plain unfair. Other reviewers have mentioned this but why are opposing forces able to bring up to 12 mechs while we're restricted to 4? It makes zero sense. Did you spend a lot of time, C-Bills, and missions to get the equipment and mechs you want? Well that sucks cause now you're getting swarmed by 8-12 mechs, have fun watching your 40+ hour grind get obliterated within a minute. You could always save-scum I guess.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Honestly just an unenjoyable experience. The game is pretty well made and overall looks/sounds really good. The problem is the difficulty is just completely unfair. \n\nYou can only bring up to 4 mechs on a mission but the enemy mechs can range anywhere from 3 to 12. This will result in a lot of missions being either easy or difficult but doable, and then you get the occasional mission where the enemy has double your total tonnage, has the same or better weapons than you, and are also hard rushing you so you get absolutely swarmed. The missions do have difficulties to them, but the scenario I just described happened on a difficulty 1 and a half mission out of 5, and it was literally the easiest mission I had available. \n\nThere also is no way to early extract or abandon a mission to save your mechs, and heavy damage to your mechs is extremely punishing. You have to pay serivce fees every 30 days and heavier damage to your mechs not only cost a lot of money but also take up so much time you can easily go through an entire fee cycle waiting for them to be fixed up to bring into battle. That's also assuming you even have enough weapons to replace the ones you lost.\n\nI don't want to play a game where I'm forced to waste time trying to win a battle with the odds heavily stacked against me, purely because I'm forced to fight since there is no way out of it without just scum saving which isn't a fun way to experience a game. I want to experience lose and set backs without actually just going bankrupt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a fan of the tabletop game, this game really disappoints me. They try to go for a feel like the tabletop itself, but fundamentally fail at multiple points (ability to crit engines or gyros, mixing heat syncs, etc.). In addition to this they fail to really capture anything magic about the actual series, instead trying to tell a weird story about a made up faction that has little to nothing to do with any of the main factions veteran players might actually care about. I think the worst offence this game makes however is a total lack of understanding in map design. Maps are uninteresting, and take far too long to navigate due to their size. To make up for this they try to artificially increase the difficulty by throwing hordes of enemies with more tonnage than you. Combined with the earlier mentioned lack of engine crits, and every fight is an incredibly frustrating, annoying, and often plain boring slog to the end of an equally uninspired story. The end result leaves me wondering who in God's name they were trying to please with this mess, cause it seems like nobody.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game doesn't run properly on M1 Macs even though Steam say it works on Mac. You can get through career mode by choosing to avoid certain things but campaign is unplayable. I tried to expansions too and they have the same issue.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game just has some unmitigatable mechanics that I don't enjoy. There are a huge amount of tedious upkeep cycles. You have monthly bank fees. In a game. Hear that? This game has monthly bank fees. You pay for your squad. You pay for your 'Mechs to have them ready in the hangar. Want to have strategic options? For some reason, you have to may to have those in... your ship's.... hangar... dust removal, maybe? Not sure. Twice, now, someone has said they were going to pick up my fees. Next month? Same fees.\r\n\r\nMech lost an arm? Great - that weapon's gone. Go get a new one. If you have one. If you can buy one. I could live with this just fine... if it would at least jut track what got blown off. Maybe just bill me or auto buy a new one? I actually kind of like that there's a penalty for part removal. It's interesting. It opens up strategy that's different from other games of the sort. Instead of just alpha-striking a single enemy, it actually makes sense to take a better round against a whole 'Mech where you can disable it's output. So you disable incoming damage even if you aren't just mindlessly killing whatever the next target is. But the upkeep. I swear. Half of this game is tedious upkeep that could have easily been automated.\r\n\r\nI like the game overall. I like the combat. I like the difficulty. It's very unfamiliar to me so I'm enjoying the learning curve. But I just can't stand the tedious upkeep. I haven't been thirteen in a long time and I don't do perma-death games. I very lack the time and the interest. Where's my option to just turn this off? I work in development. These things are a very light lift and open up the door for players to have the experience they want. Lazy omission, if you ask me. Minor polish and QoL features would have made this quite enjoyable. \r\n\r\nFortunately, I'm cheap and bought this on heavy discount and have no problem putting it down for the next one I bought for next to nothing. Just can't spend my time this way when there is so little of it to allocate to gaming these days. Feel like I could have enjoyed this with just a few options tweaks that would have be super easy to develop.\r\n1. Option to disable pilot death.\r\n2. Option to disable pilot injury.\r\n3. Option to disable item loss.\r\n4. Option to disable starting the game with bad credit and bank fees.\r\n\r\nI just can't recommend it. If those things don't bother you though, then I absolutely do. It's really quite fun, otherwise.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too expensive for what it is. Not much actual tactical meat here. It's just an RNG fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its actually quite bad on many levels.\n\nFirst: What you have vs what you face -  You'll be put up against much larger, better equipped enemies, that outnumber you minimun 3-1, and they will almost always have a field advantage. (the last one not so important)\n\nSecond: The weapons feel weak, and the accuracy is incredibly laughable; with precision strikes from a few hundred meters having under a 20% chance to hit. I get the concept of games like this, but in a mech warrior game with feels stupid.\n\nThird: The grind: In the beginning you'll be short money, short equipment and short viable mechs. You MIGHT find a decent medium mech occasionally, but they don't really do a thing vs assault mechs or heavies you'll encounter early on. You'll be trying to complete missions for pennies, just trying to stave off the tax collector, as well as balancing your whiny companions emotions and moral.\n\nConclusion: Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't know what it is, but for some reason this game isn't fun. \nthank eff i got this cheap.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another trash game where the dev's idea of difficulty is to constantly have you outnumbered and outweighed by the enemy. \n\"Oh, look, another mission where my four mediums face six heavy and assault mechs! What fun!\" Maybe someday there'll be a BattleTech computer game worthy of the name, but this isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game but after 3 attempts to get into it over the years I have unfortunately come to the conclusion it just straight up fucking sucks. The framework is definitely there for a fun game with decent depth, company management, mech loadout building, looting etc. but it all falls apart the second you get to actually playing a battle. The combat is simply boring as fuck, slow and tedious. You can only bring a party of 4 into each mission yet you almost always face hordes of enemies often up to double your number yet made up of units of equal or even better quality, even on the lower difficulty beginner missions. Not to mention additional vehicles such as tanks or missile trucks and base defence turrets of different kinds. This ends in a thrilling experience where you have 4 turns to deal a little damage with a bunch of weapons that all do absolutely nothing. Then you can put your feet up for 5 minutes while you are forced to painfully watch about 16 enemy units of all aforementioned types focus fire the exact same one of your mechs dealing miniscule chip damage over and over again until your core explodes due to sheer overwhelm while you can do nothing about it but sit and watch. And I hope you like watching because even when you hit space bar to speed up the animations and pauses between all the turns it still feels like slow motion. The game is a total waste of time and potential.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Yet another game released with bare bones, the full game and mechanics are hidden behind 3 additional DLCs.  Welcome to the death of gaming.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "350 mlp missiles is not sufficient to destroy 5 starters mech in first mission from campagn in standard difficulty and my other mech overheat like wtf  it's not a strategy game it's just a bullet sponge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although I've been playing Mechwarrior for decades, this was my first time playing Battletech. The trailers looked really good, and most the reviews checked out, so I started playing the vanilla version without any mods.\r\n\r\nThe gameplay is slow, even for turn based games. The graphics have not aged well. Getting to the various screens you need in the leopard are a pain. Load times are alive and well. There isn't much variety in the missions.\r\n\r\nThere are some good elements to the game such as the mechlab, the voice acting, and some of the writing. I really appreciate how much difference the terrain makes in this game, compared to MW titles. And melee is actually a viable attack in Battletech! But unfortunately these things are not enough to encourage me to click the Play button again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a hoot if you're a Battletech tabletop fan, what with all it's mech building intricacies and vague mechanics that the game absolutely does not bother explaining to you. For me, it just feels like a chore to have several tabs open into rulebooks and hour-long YouTube videos explaining the nuance of combat.\n\nNo one wants a massive info dump at the beginning of the game, but surely even an in-game manual would be helpful? So many mechanics are fed to you by brief blurbs from NPCs that largely amount to \"you have to manage your heat!\" without explaining the numerous ways to do that. Bracing, bulwark, evasion, a whole litany of game mechanics are not properly laid out for you in any way. Normally, I'd say this is beneficial for the sake of trial and error - but error means waiting. And I mean [i]waiting[/i]. As Tom Petty once said, \"the waiting is the hardest part.\"\n\nInjuries and repair times can be mitigated later into the game, but only so much. You'll still spend several minutes on a time advancement screen between battles, even if all goes well, as there is travel involved. What is there to do in that interim? Well, not much. This in and of itself isn't damning, but then there's the combat. Even turning off some extra animations still has battles taking entirely too long for how stale they become. Sometimes it's just turns of sprinting across a generic gameboard to get to an objective before spending 20 minutes firing shots with a slow, itemized list popping up of every affect you inflicted on the enemy mech.\n\nAll in all, it's just a bland, slow grind made unbearable by static between everything. The fun of tabletop gaming is the social experience that fills that empty space between turns - this simply takes everything fun from that and serves it up with typically overpriced Paradox DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After two different computers I expected this game to not crash randomly after getting through the campaign. At first I thought it was my system kind of sucking, but turns out it's the game that sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty is too hard, in a way that doesn't feel challenging and just arbitrary and it feels more like a grind than a fun experience. \n\nThe story itself is too much of a novel than what should be a video game experience. Much more voice acting and cutscenes would have really improved the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is nice, but the AI is allowed to cheat when you get to a skull of two or more and you can field a 70 ton mech or higher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this years ago. Tutorial is horrible. Started a campaign, played the first mission and Mastiff gets wreched. Game Over. Decided to give it another try recently and Mastiff still gets dogpiled and wrecked, ending the mission.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game. It has A LOT of cool mechanics, customizing your mechs is super enjoyable. \n\n**However**, if you've ever heard the saying \"hard, but fair\" that does **not** apply to BATTLETECH. This game is just plain unfair. Other reviewers have mentioned this but why are opposing forces able to bring up to 12 mechs while we're restricted to 4? It makes zero sense. Did you spend a lot of time, C-Bills, and missions to get the equipment and mechs you want? Well that sucks cause now you're getting swarmed by 8-12 mechs, have fun watching your 40+ hour grind get obliterated within a minute. You could always save-scum I guess.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Honestly just an unenjoyable experience. The game is pretty well made and overall looks/sounds really good. The problem is the difficulty is just completely unfair. \n\nYou can only bring up to 4 mechs on a mission but the enemy mechs can range anywhere from 3 to 12. This will result in a lot of missions being either easy or difficult but doable, and then you get the occasional mission where the enemy has double your total tonnage, has the same or better weapons than you, and are also hard rushing you so you get absolutely swarmed. The missions do have difficulties to them, but the scenario I just described happened on a difficulty 1 and a half mission out of 5, and it was literally the easiest mission I had available. \n\nThere also is no way to early extract or abandon a mission to save your mechs, and heavy damage to your mechs is extremely punishing. You have to pay serivce fees every 30 days and heavier damage to your mechs not only cost a lot of money but also take up so much time you can easily go through an entire fee cycle waiting for them to be fixed up to bring into battle. That's also assuming you even have enough weapons to replace the ones you lost.\n\nI don't want to play a game where I'm forced to waste time trying to win a battle with the odds heavily stacked against me, purely because I'm forced to fight since there is no way out of it without just scum saving which isn't a fun way to experience a game. I want to experience lose and set backs without actually just going bankrupt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a fan of the tabletop game, this game really disappoints me. They try to go for a feel like the tabletop itself, but fundamentally fail at multiple points (ability to crit engines or gyros, mixing heat syncs, etc.). In addition to this they fail to really capture anything magic about the actual series, instead trying to tell a weird story about a made up faction that has little to nothing to do with any of the main factions veteran players might actually care about. I think the worst offence this game makes however is a total lack of understanding in map design. Maps are uninteresting, and take far too long to navigate due to their size. To make up for this they try to artificially increase the difficulty by throwing hordes of enemies with more tonnage than you. Combined with the earlier mentioned lack of engine crits, and every fight is an incredibly frustrating, annoying, and often plain boring slog to the end of an equally uninspired story. The end result leaves me wondering who in God's name they were trying to please with this mess, cause it seems like nobody.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game doesn't run properly on M1 Macs even though Steam say it works on Mac. You can get through career mode by choosing to avoid certain things but campaign is unplayable. I tried to expansions too and they have the same issue.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game just has some unmitigatable mechanics that I don't enjoy. There are a huge amount of tedious upkeep cycles. You have monthly bank fees. In a game. Hear that? This game has monthly bank fees. You pay for your squad. You pay for your 'Mechs to have them ready in the hangar. Want to have strategic options? For some reason, you have to may to have those in... your ship's.... hangar... dust removal, maybe? Not sure. Twice, now, someone has said they were going to pick up my fees. Next month? Same fees.\r\n\r\nMech lost an arm? Great - that weapon's gone. Go get a new one. If you have one. If you can buy one. I could live with this just fine... if it would at least jut track what got blown off. Maybe just bill me or auto buy a new one? I actually kind of like that there's a penalty for part removal. It's interesting. It opens up strategy that's different from other games of the sort. Instead of just alpha-striking a single enemy, it actually makes sense to take a better round against a whole 'Mech where you can disable it's output. So you disable incoming damage even if you aren't just mindlessly killing whatever the next target is. But the upkeep. I swear. Half of this game is tedious upkeep that could have easily been automated.\r\n\r\nI like the game overall. I like the combat. I like the difficulty. It's very unfamiliar to me so I'm enjoying the learning curve. But I just can't stand the tedious upkeep. I haven't been thirteen in a long time and I don't do perma-death games. I very lack the time and the interest. Where's my option to just turn this off? I work in development. These things are a very light lift and open up the door for players to have the experience they want. Lazy omission, if you ask me. Minor polish and QoL features would have made this quite enjoyable. \r\n\r\nFortunately, I'm cheap and bought this on heavy discount and have no problem putting it down for the next one I bought for next to nothing. Just can't spend my time this way when there is so little of it to allocate to gaming these days. Feel like I could have enjoyed this with just a few options tweaks that would have be super easy to develop.\r\n1. Option to disable pilot death.\r\n2. Option to disable pilot injury.\r\n3. Option to disable item loss.\r\n4. Option to disable starting the game with bad credit and bank fees.\r\n\r\nI just can't recommend it. If those things don't bother you though, then I absolutely do. It's really quite fun, otherwise.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too expensive for what it is. Not much actual tactical meat here. It's just an RNG fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its actually quite bad on many levels.\n\nFirst: What you have vs what you face -  You'll be put up against much larger, better equipped enemies, that outnumber you minimun 3-1, and they will almost always have a field advantage. (the last one not so important)\n\nSecond: The weapons feel weak, and the accuracy is incredibly laughable; with precision strikes from a few hundred meters having under a 20% chance to hit. I get the concept of games like this, but in a mech warrior game with feels stupid.\n\nThird: The grind: In the beginning you'll be short money, short equipment and short viable mechs. You MIGHT find a decent medium mech occasionally, but they don't really do a thing vs assault mechs or heavies you'll encounter early on. You'll be trying to complete missions for pennies, just trying to stave off the tax collector, as well as balancing your whiny companions emotions and moral.\n\nConclusion: Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't know what it is, but for some reason this game isn't fun. \nthank eff i got this cheap.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another trash game where the dev's idea of difficulty is to constantly have you outnumbered and outweighed by the enemy. \n\"Oh, look, another mission where my four mediums face six heavy and assault mechs! What fun!\" Maybe someday there'll be a BattleTech computer game worthy of the name, but this isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game but after 3 attempts to get into it over the years I have unfortunately come to the conclusion it just straight up fucking sucks. The framework is definitely there for a fun game with decent depth, company management, mech loadout building, looting etc. but it all falls apart the second you get to actually playing a battle. The combat is simply boring as fuck, slow and tedious. You can only bring a party of 4 into each mission yet you almost always face hordes of enemies often up to double your number yet made up of units of equal or even better quality, even on the lower difficulty beginner missions. Not to mention additional vehicles such as tanks or missile trucks and base defence turrets of different kinds. This ends in a thrilling experience where you have 4 turns to deal a little damage with a bunch of weapons that all do absolutely nothing. Then you can put your feet up for 5 minutes while you are forced to painfully watch about 16 enemy units of all aforementioned types focus fire the exact same one of your mechs dealing miniscule chip damage over and over again until your core explodes due to sheer overwhelm while you can do nothing about it but sit and watch. And I hope you like watching because even when you hit space bar to speed up the animations and pauses between all the turns it still feels like slow motion. The game is a total waste of time and potential.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Yet another game released with bare bones, the full game and mechanics are hidden behind 3 additional DLCs.  Welcome to the death of gaming.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "350 mlp missiles is not sufficient to destroy 5 starters mech in first mission from campagn in standard difficulty and my other mech overheat like wtf  it's not a strategy game it's just a bullet sponge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although I've been playing Mechwarrior for decades, this was my first time playing Battletech. The trailers looked really good, and most the reviews checked out, so I started playing the vanilla version without any mods.\r\n\r\nThe gameplay is slow, even for turn based games. The graphics have not aged well. Getting to the various screens you need in the leopard are a pain. Load times are alive and well. There isn't much variety in the missions.\r\n\r\nThere are some good elements to the game such as the mechlab, the voice acting, and some of the writing. I really appreciate how much difference the terrain makes in this game, compared to MW titles. And melee is actually a viable attack in Battletech! But unfortunately these things are not enough to encourage me to click the Play button again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a hoot if you're a Battletech tabletop fan, what with all it's mech building intricacies and vague mechanics that the game absolutely does not bother explaining to you. For me, it just feels like a chore to have several tabs open into rulebooks and hour-long YouTube videos explaining the nuance of combat.\n\nNo one wants a massive info dump at the beginning of the game, but surely even an in-game manual would be helpful? So many mechanics are fed to you by brief blurbs from NPCs that largely amount to \"you have to manage your heat!\" without explaining the numerous ways to do that. Bracing, bulwark, evasion, a whole litany of game mechanics are not properly laid out for you in any way. Normally, I'd say this is beneficial for the sake of trial and error - but error means waiting. And I mean [i]waiting[/i]. As Tom Petty once said, \"the waiting is the hardest part.\"\n\nInjuries and repair times can be mitigated later into the game, but only so much. You'll still spend several minutes on a time advancement screen between battles, even if all goes well, as there is travel involved. What is there to do in that interim? Well, not much. This in and of itself isn't damning, but then there's the combat. Even turning off some extra animations still has battles taking entirely too long for how stale they become. Sometimes it's just turns of sprinting across a generic gameboard to get to an objective before spending 20 minutes firing shots with a slow, itemized list popping up of every affect you inflicted on the enemy mech.\n\nAll in all, it's just a bland, slow grind made unbearable by static between everything. The fun of tabletop gaming is the social experience that fills that empty space between turns - this simply takes everything fun from that and serves it up with typically overpriced Paradox DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After two different computers I expected this game to not crash randomly after getting through the campaign. At first I thought it was my system kind of sucking, but turns out it's the game that sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty is too hard, in a way that doesn't feel challenging and just arbitrary and it feels more like a grind than a fun experience. \n\nThe story itself is too much of a novel than what should be a video game experience. Much more voice acting and cutscenes would have really improved the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is nice, but the AI is allowed to cheat when you get to a skull of two or more and you can field a 70 ton mech or higher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this years ago. Tutorial is horrible. Started a campaign, played the first mission and Mastiff gets wreched. Game Over. Decided to give it another try recently and Mastiff still gets dogpiled and wrecked, ending the mission.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game. It has A LOT of cool mechanics, customizing your mechs is super enjoyable. \n\n**However**, if you've ever heard the saying \"hard, but fair\" that does **not** apply to BATTLETECH. This game is just plain unfair. Other reviewers have mentioned this but why are opposing forces able to bring up to 12 mechs while we're restricted to 4? It makes zero sense. Did you spend a lot of time, C-Bills, and missions to get the equipment and mechs you want? Well that sucks cause now you're getting swarmed by 8-12 mechs, have fun watching your 40+ hour grind get obliterated within a minute. You could always save-scum I guess.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Honestly just an unenjoyable experience. The game is pretty well made and overall looks/sounds really good. The problem is the difficulty is just completely unfair. \n\nYou can only bring up to 4 mechs on a mission but the enemy mechs can range anywhere from 3 to 12. This will result in a lot of missions being either easy or difficult but doable, and then you get the occasional mission where the enemy has double your total tonnage, has the same or better weapons than you, and are also hard rushing you so you get absolutely swarmed. The missions do have difficulties to them, but the scenario I just described happened on a difficulty 1 and a half mission out of 5, and it was literally the easiest mission I had available. \n\nThere also is no way to early extract or abandon a mission to save your mechs, and heavy damage to your mechs is extremely punishing. You have to pay serivce fees every 30 days and heavier damage to your mechs not only cost a lot of money but also take up so much time you can easily go through an entire fee cycle waiting for them to be fixed up to bring into battle. That's also assuming you even have enough weapons to replace the ones you lost.\n\nI don't want to play a game where I'm forced to waste time trying to win a battle with the odds heavily stacked against me, purely because I'm forced to fight since there is no way out of it without just scum saving which isn't a fun way to experience a game. I want to experience lose and set backs without actually just going bankrupt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a fan of the tabletop game, this game really disappoints me. They try to go for a feel like the tabletop itself, but fundamentally fail at multiple points (ability to crit engines or gyros, mixing heat syncs, etc.). In addition to this they fail to really capture anything magic about the actual series, instead trying to tell a weird story about a made up faction that has little to nothing to do with any of the main factions veteran players might actually care about. I think the worst offence this game makes however is a total lack of understanding in map design. Maps are uninteresting, and take far too long to navigate due to their size. To make up for this they try to artificially increase the difficulty by throwing hordes of enemies with more tonnage than you. Combined with the earlier mentioned lack of engine crits, and every fight is an incredibly frustrating, annoying, and often plain boring slog to the end of an equally uninspired story. The end result leaves me wondering who in God's name they were trying to please with this mess, cause it seems like nobody.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game doesn't run properly on M1 Macs even though Steam say it works on Mac. You can get through career mode by choosing to avoid certain things but campaign is unplayable. I tried to expansions too and they have the same issue.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game just has some unmitigatable mechanics that I don't enjoy. There are a huge amount of tedious upkeep cycles. You have monthly bank fees. In a game. Hear that? This game has monthly bank fees. You pay for your squad. You pay for your 'Mechs to have them ready in the hangar. Want to have strategic options? For some reason, you have to may to have those in... your ship's.... hangar... dust removal, maybe? Not sure. Twice, now, someone has said they were going to pick up my fees. Next month? Same fees.\r\n\r\nMech lost an arm? Great - that weapon's gone. Go get a new one. If you have one. If you can buy one. I could live with this just fine... if it would at least jut track what got blown off. Maybe just bill me or auto buy a new one? I actually kind of like that there's a penalty for part removal. It's interesting. It opens up strategy that's different from other games of the sort. Instead of just alpha-striking a single enemy, it actually makes sense to take a better round against a whole 'Mech where you can disable it's output. So you disable incoming damage even if you aren't just mindlessly killing whatever the next target is. But the upkeep. I swear. Half of this game is tedious upkeep that could have easily been automated.\r\n\r\nI like the game overall. I like the combat. I like the difficulty. It's very unfamiliar to me so I'm enjoying the learning curve. But I just can't stand the tedious upkeep. I haven't been thirteen in a long time and I don't do perma-death games. I very lack the time and the interest. Where's my option to just turn this off? I work in development. These things are a very light lift and open up the door for players to have the experience they want. Lazy omission, if you ask me. Minor polish and QoL features would have made this quite enjoyable. \r\n\r\nFortunately, I'm cheap and bought this on heavy discount and have no problem putting it down for the next one I bought for next to nothing. Just can't spend my time this way when there is so little of it to allocate to gaming these days. Feel like I could have enjoyed this with just a few options tweaks that would have be super easy to develop.\r\n1. Option to disable pilot death.\r\n2. Option to disable pilot injury.\r\n3. Option to disable item loss.\r\n4. Option to disable starting the game with bad credit and bank fees.\r\n\r\nI just can't recommend it. If those things don't bother you though, then I absolutely do. It's really quite fun, otherwise.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too expensive for what it is. Not much actual tactical meat here. It's just an RNG fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its actually quite bad on many levels.\n\nFirst: What you have vs what you face -  You'll be put up against much larger, better equipped enemies, that outnumber you minimun 3-1, and they will almost always have a field advantage. (the last one not so important)\n\nSecond: The weapons feel weak, and the accuracy is incredibly laughable; with precision strikes from a few hundred meters having under a 20% chance to hit. I get the concept of games like this, but in a mech warrior game with feels stupid.\n\nThird: The grind: In the beginning you'll be short money, short equipment and short viable mechs. You MIGHT find a decent medium mech occasionally, but they don't really do a thing vs assault mechs or heavies you'll encounter early on. You'll be trying to complete missions for pennies, just trying to stave off the tax collector, as well as balancing your whiny companions emotions and moral.\n\nConclusion: Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't know what it is, but for some reason this game isn't fun. \nthank eff i got this cheap.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another trash game where the dev's idea of difficulty is to constantly have you outnumbered and outweighed by the enemy. \n\"Oh, look, another mission where my four mediums face six heavy and assault mechs! What fun!\" Maybe someday there'll be a BattleTech computer game worthy of the name, but this isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game but after 3 attempts to get into it over the years I have unfortunately come to the conclusion it just straight up fucking sucks. The framework is definitely there for a fun game with decent depth, company management, mech loadout building, looting etc. but it all falls apart the second you get to actually playing a battle. The combat is simply boring as fuck, slow and tedious. You can only bring a party of 4 into each mission yet you almost always face hordes of enemies often up to double your number yet made up of units of equal or even better quality, even on the lower difficulty beginner missions. Not to mention additional vehicles such as tanks or missile trucks and base defence turrets of different kinds. This ends in a thrilling experience where you have 4 turns to deal a little damage with a bunch of weapons that all do absolutely nothing. Then you can put your feet up for 5 minutes while you are forced to painfully watch about 16 enemy units of all aforementioned types focus fire the exact same one of your mechs dealing miniscule chip damage over and over again until your core explodes due to sheer overwhelm while you can do nothing about it but sit and watch. And I hope you like watching because even when you hit space bar to speed up the animations and pauses between all the turns it still feels like slow motion. The game is a total waste of time and potential.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Yet another game released with bare bones, the full game and mechanics are hidden behind 3 additional DLCs.  Welcome to the death of gaming.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "350 mlp missiles is not sufficient to destroy 5 starters mech in first mission from campagn in standard difficulty and my other mech overheat like wtf  it's not a strategy game it's just a bullet sponge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although I've been playing Mechwarrior for decades, this was my first time playing Battletech. The trailers looked really good, and most the reviews checked out, so I started playing the vanilla version without any mods.\r\n\r\nThe gameplay is slow, even for turn based games. The graphics have not aged well. Getting to the various screens you need in the leopard are a pain. Load times are alive and well. There isn't much variety in the missions.\r\n\r\nThere are some good elements to the game such as the mechlab, the voice acting, and some of the writing. I really appreciate how much difference the terrain makes in this game, compared to MW titles. And melee is actually a viable attack in Battletech! But unfortunately these things are not enough to encourage me to click the Play button again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a hoot if you're a Battletech tabletop fan, what with all it's mech building intricacies and vague mechanics that the game absolutely does not bother explaining to you. For me, it just feels like a chore to have several tabs open into rulebooks and hour-long YouTube videos explaining the nuance of combat.\n\nNo one wants a massive info dump at the beginning of the game, but surely even an in-game manual would be helpful? So many mechanics are fed to you by brief blurbs from NPCs that largely amount to \"you have to manage your heat!\" without explaining the numerous ways to do that. Bracing, bulwark, evasion, a whole litany of game mechanics are not properly laid out for you in any way. Normally, I'd say this is beneficial for the sake of trial and error - but error means waiting. And I mean [i]waiting[/i]. As Tom Petty once said, \"the waiting is the hardest part.\"\n\nInjuries and repair times can be mitigated later into the game, but only so much. You'll still spend several minutes on a time advancement screen between battles, even if all goes well, as there is travel involved. What is there to do in that interim? Well, not much. This in and of itself isn't damning, but then there's the combat. Even turning off some extra animations still has battles taking entirely too long for how stale they become. Sometimes it's just turns of sprinting across a generic gameboard to get to an objective before spending 20 minutes firing shots with a slow, itemized list popping up of every affect you inflicted on the enemy mech.\n\nAll in all, it's just a bland, slow grind made unbearable by static between everything. The fun of tabletop gaming is the social experience that fills that empty space between turns - this simply takes everything fun from that and serves it up with typically overpriced Paradox DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After two different computers I expected this game to not crash randomly after getting through the campaign. At first I thought it was my system kind of sucking, but turns out it's the game that sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty is too hard, in a way that doesn't feel challenging and just arbitrary and it feels more like a grind than a fun experience. \n\nThe story itself is too much of a novel than what should be a video game experience. Much more voice acting and cutscenes would have really improved the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is nice, but the AI is allowed to cheat when you get to a skull of two or more and you can field a 70 ton mech or higher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this years ago. Tutorial is horrible. Started a campaign, played the first mission and Mastiff gets wreched. Game Over. Decided to give it another try recently and Mastiff still gets dogpiled and wrecked, ending the mission.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game. It has A LOT of cool mechanics, customizing your mechs is super enjoyable. \n\n**However**, if you've ever heard the saying \"hard, but fair\" that does **not** apply to BATTLETECH. This game is just plain unfair. Other reviewers have mentioned this but why are opposing forces able to bring up to 12 mechs while we're restricted to 4? It makes zero sense. Did you spend a lot of time, C-Bills, and missions to get the equipment and mechs you want? Well that sucks cause now you're getting swarmed by 8-12 mechs, have fun watching your 40+ hour grind get obliterated within a minute. You could always save-scum I guess.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Honestly just an unenjoyable experience. The game is pretty well made and overall looks/sounds really good. The problem is the difficulty is just completely unfair. \n\nYou can only bring up to 4 mechs on a mission but the enemy mechs can range anywhere from 3 to 12. This will result in a lot of missions being either easy or difficult but doable, and then you get the occasional mission where the enemy has double your total tonnage, has the same or better weapons than you, and are also hard rushing you so you get absolutely swarmed. The missions do have difficulties to them, but the scenario I just described happened on a difficulty 1 and a half mission out of 5, and it was literally the easiest mission I had available. \n\nThere also is no way to early extract or abandon a mission to save your mechs, and heavy damage to your mechs is extremely punishing. You have to pay serivce fees every 30 days and heavier damage to your mechs not only cost a lot of money but also take up so much time you can easily go through an entire fee cycle waiting for them to be fixed up to bring into battle. That's also assuming you even have enough weapons to replace the ones you lost.\n\nI don't want to play a game where I'm forced to waste time trying to win a battle with the odds heavily stacked against me, purely because I'm forced to fight since there is no way out of it without just scum saving which isn't a fun way to experience a game. I want to experience lose and set backs without actually just going bankrupt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a fan of the tabletop game, this game really disappoints me. They try to go for a feel like the tabletop itself, but fundamentally fail at multiple points (ability to crit engines or gyros, mixing heat syncs, etc.). In addition to this they fail to really capture anything magic about the actual series, instead trying to tell a weird story about a made up faction that has little to nothing to do with any of the main factions veteran players might actually care about. I think the worst offence this game makes however is a total lack of understanding in map design. Maps are uninteresting, and take far too long to navigate due to their size. To make up for this they try to artificially increase the difficulty by throwing hordes of enemies with more tonnage than you. Combined with the earlier mentioned lack of engine crits, and every fight is an incredibly frustrating, annoying, and often plain boring slog to the end of an equally uninspired story. The end result leaves me wondering who in God's name they were trying to please with this mess, cause it seems like nobody.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game doesn't run properly on M1 Macs even though Steam say it works on Mac. You can get through career mode by choosing to avoid certain things but campaign is unplayable. I tried to expansions too and they have the same issue.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game just has some unmitigatable mechanics that I don't enjoy. There are a huge amount of tedious upkeep cycles. You have monthly bank fees. In a game. Hear that? This game has monthly bank fees. You pay for your squad. You pay for your 'Mechs to have them ready in the hangar. Want to have strategic options? For some reason, you have to may to have those in... your ship's.... hangar... dust removal, maybe? Not sure. Twice, now, someone has said they were going to pick up my fees. Next month? Same fees.\r\n\r\nMech lost an arm? Great - that weapon's gone. Go get a new one. If you have one. If you can buy one. I could live with this just fine... if it would at least jut track what got blown off. Maybe just bill me or auto buy a new one? I actually kind of like that there's a penalty for part removal. It's interesting. It opens up strategy that's different from other games of the sort. Instead of just alpha-striking a single enemy, it actually makes sense to take a better round against a whole 'Mech where you can disable it's output. So you disable incoming damage even if you aren't just mindlessly killing whatever the next target is. But the upkeep. I swear. Half of this game is tedious upkeep that could have easily been automated.\r\n\r\nI like the game overall. I like the combat. I like the difficulty. It's very unfamiliar to me so I'm enjoying the learning curve. But I just can't stand the tedious upkeep. I haven't been thirteen in a long time and I don't do perma-death games. I very lack the time and the interest. Where's my option to just turn this off? I work in development. These things are a very light lift and open up the door for players to have the experience they want. Lazy omission, if you ask me. Minor polish and QoL features would have made this quite enjoyable. \r\n\r\nFortunately, I'm cheap and bought this on heavy discount and have no problem putting it down for the next one I bought for next to nothing. Just can't spend my time this way when there is so little of it to allocate to gaming these days. Feel like I could have enjoyed this with just a few options tweaks that would have be super easy to develop.\r\n1. Option to disable pilot death.\r\n2. Option to disable pilot injury.\r\n3. Option to disable item loss.\r\n4. Option to disable starting the game with bad credit and bank fees.\r\n\r\nI just can't recommend it. If those things don't bother you though, then I absolutely do. It's really quite fun, otherwise.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too expensive for what it is. Not much actual tactical meat here. It's just an RNG fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its actually quite bad on many levels.\n\nFirst: What you have vs what you face -  You'll be put up against much larger, better equipped enemies, that outnumber you minimun 3-1, and they will almost always have a field advantage. (the last one not so important)\n\nSecond: The weapons feel weak, and the accuracy is incredibly laughable; with precision strikes from a few hundred meters having under a 20% chance to hit. I get the concept of games like this, but in a mech warrior game with feels stupid.\n\nThird: The grind: In the beginning you'll be short money, short equipment and short viable mechs. You MIGHT find a decent medium mech occasionally, but they don't really do a thing vs assault mechs or heavies you'll encounter early on. You'll be trying to complete missions for pennies, just trying to stave off the tax collector, as well as balancing your whiny companions emotions and moral.\n\nConclusion: Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't know what it is, but for some reason this game isn't fun. \nthank eff i got this cheap.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another trash game where the dev's idea of difficulty is to constantly have you outnumbered and outweighed by the enemy. \n\"Oh, look, another mission where my four mediums face six heavy and assault mechs! What fun!\" Maybe someday there'll be a BattleTech computer game worthy of the name, but this isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game but after 3 attempts to get into it over the years I have unfortunately come to the conclusion it just straight up fucking sucks. The framework is definitely there for a fun game with decent depth, company management, mech loadout building, looting etc. but it all falls apart the second you get to actually playing a battle. The combat is simply boring as fuck, slow and tedious. You can only bring a party of 4 into each mission yet you almost always face hordes of enemies often up to double your number yet made up of units of equal or even better quality, even on the lower difficulty beginner missions. Not to mention additional vehicles such as tanks or missile trucks and base defence turrets of different kinds. This ends in a thrilling experience where you have 4 turns to deal a little damage with a bunch of weapons that all do absolutely nothing. Then you can put your feet up for 5 minutes while you are forced to painfully watch about 16 enemy units of all aforementioned types focus fire the exact same one of your mechs dealing miniscule chip damage over and over again until your core explodes due to sheer overwhelm while you can do nothing about it but sit and watch. And I hope you like watching because even when you hit space bar to speed up the animations and pauses between all the turns it still feels like slow motion. The game is a total waste of time and potential.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Yet another game released with bare bones, the full game and mechanics are hidden behind 3 additional DLCs.  Welcome to the death of gaming.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "350 mlp missiles is not sufficient to destroy 5 starters mech in first mission from campagn in standard difficulty and my other mech overheat like wtf  it's not a strategy game it's just a bullet sponge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although I've been playing Mechwarrior for decades, this was my first time playing Battletech. The trailers looked really good, and most the reviews checked out, so I started playing the vanilla version without any mods.\r\n\r\nThe gameplay is slow, even for turn based games. The graphics have not aged well. Getting to the various screens you need in the leopard are a pain. Load times are alive and well. There isn't much variety in the missions.\r\n\r\nThere are some good elements to the game such as the mechlab, the voice acting, and some of the writing. I really appreciate how much difference the terrain makes in this game, compared to MW titles. And melee is actually a viable attack in Battletech! But unfortunately these things are not enough to encourage me to click the Play button again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a hoot if you're a Battletech tabletop fan, what with all it's mech building intricacies and vague mechanics that the game absolutely does not bother explaining to you. For me, it just feels like a chore to have several tabs open into rulebooks and hour-long YouTube videos explaining the nuance of combat.\n\nNo one wants a massive info dump at the beginning of the game, but surely even an in-game manual would be helpful? So many mechanics are fed to you by brief blurbs from NPCs that largely amount to \"you have to manage your heat!\" without explaining the numerous ways to do that. Bracing, bulwark, evasion, a whole litany of game mechanics are not properly laid out for you in any way. Normally, I'd say this is beneficial for the sake of trial and error - but error means waiting. And I mean [i]waiting[/i]. As Tom Petty once said, \"the waiting is the hardest part.\"\n\nInjuries and repair times can be mitigated later into the game, but only so much. You'll still spend several minutes on a time advancement screen between battles, even if all goes well, as there is travel involved. What is there to do in that interim? Well, not much. This in and of itself isn't damning, but then there's the combat. Even turning off some extra animations still has battles taking entirely too long for how stale they become. Sometimes it's just turns of sprinting across a generic gameboard to get to an objective before spending 20 minutes firing shots with a slow, itemized list popping up of every affect you inflicted on the enemy mech.\n\nAll in all, it's just a bland, slow grind made unbearable by static between everything. The fun of tabletop gaming is the social experience that fills that empty space between turns - this simply takes everything fun from that and serves it up with typically overpriced Paradox DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After two different computers I expected this game to not crash randomly after getting through the campaign. At first I thought it was my system kind of sucking, but turns out it's the game that sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty is too hard, in a way that doesn't feel challenging and just arbitrary and it feels more like a grind than a fun experience. \n\nThe story itself is too much of a novel than what should be a video game experience. Much more voice acting and cutscenes would have really improved the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is nice, but the AI is allowed to cheat when you get to a skull of two or more and you can field a 70 ton mech or higher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this years ago. Tutorial is horrible. Started a campaign, played the first mission and Mastiff gets wreched. Game Over. Decided to give it another try recently and Mastiff still gets dogpiled and wrecked, ending the mission.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I want to love this game. It has A LOT of cool mechanics, customizing your mechs is super enjoyable. \n\n**However**, if you've ever heard the saying \"hard, but fair\" that does **not** apply to BATTLETECH. This game is just plain unfair. Other reviewers have mentioned this but why are opposing forces able to bring up to 12 mechs while we're restricted to 4? It makes zero sense. Did you spend a lot of time, C-Bills, and missions to get the equipment and mechs you want? Well that sucks cause now you're getting swarmed by 8-12 mechs, have fun watching your 40+ hour grind get obliterated within a minute. You could always save-scum I guess.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Honestly just an unenjoyable experience. The game is pretty well made and overall looks/sounds really good. The problem is the difficulty is just completely unfair. \n\nYou can only bring up to 4 mechs on a mission but the enemy mechs can range anywhere from 3 to 12. This will result in a lot of missions being either easy or difficult but doable, and then you get the occasional mission where the enemy has double your total tonnage, has the same or better weapons than you, and are also hard rushing you so you get absolutely swarmed. The missions do have difficulties to them, but the scenario I just described happened on a difficulty 1 and a half mission out of 5, and it was literally the easiest mission I had available. \n\nThere also is no way to early extract or abandon a mission to save your mechs, and heavy damage to your mechs is extremely punishing. You have to pay serivce fees every 30 days and heavier damage to your mechs not only cost a lot of money but also take up so much time you can easily go through an entire fee cycle waiting for them to be fixed up to bring into battle. That's also assuming you even have enough weapons to replace the ones you lost.\n\nI don't want to play a game where I'm forced to waste time trying to win a battle with the odds heavily stacked against me, purely because I'm forced to fight since there is no way out of it without just scum saving which isn't a fun way to experience a game. I want to experience lose and set backs without actually just going bankrupt",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a fan of the tabletop game, this game really disappoints me. They try to go for a feel like the tabletop itself, but fundamentally fail at multiple points (ability to crit engines or gyros, mixing heat syncs, etc.). In addition to this they fail to really capture anything magic about the actual series, instead trying to tell a weird story about a made up faction that has little to nothing to do with any of the main factions veteran players might actually care about. I think the worst offence this game makes however is a total lack of understanding in map design. Maps are uninteresting, and take far too long to navigate due to their size. To make up for this they try to artificially increase the difficulty by throwing hordes of enemies with more tonnage than you. Combined with the earlier mentioned lack of engine crits, and every fight is an incredibly frustrating, annoying, and often plain boring slog to the end of an equally uninspired story. The end result leaves me wondering who in God's name they were trying to please with this mess, cause it seems like nobody.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game doesn't run properly on M1 Macs even though Steam say it works on Mac. You can get through career mode by choosing to avoid certain things but campaign is unplayable. I tried to expansions too and they have the same issue.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game just has some unmitigatable mechanics that I don't enjoy. There are a huge amount of tedious upkeep cycles. You have monthly bank fees. In a game. Hear that? This game has monthly bank fees. You pay for your squad. You pay for your 'Mechs to have them ready in the hangar. Want to have strategic options? For some reason, you have to may to have those in... your ship's.... hangar... dust removal, maybe? Not sure. Twice, now, someone has said they were going to pick up my fees. Next month? Same fees.\r\n\r\nMech lost an arm? Great - that weapon's gone. Go get a new one. If you have one. If you can buy one. I could live with this just fine... if it would at least jut track what got blown off. Maybe just bill me or auto buy a new one? I actually kind of like that there's a penalty for part removal. It's interesting. It opens up strategy that's different from other games of the sort. Instead of just alpha-striking a single enemy, it actually makes sense to take a better round against a whole 'Mech where you can disable it's output. So you disable incoming damage even if you aren't just mindlessly killing whatever the next target is. But the upkeep. I swear. Half of this game is tedious upkeep that could have easily been automated.\r\n\r\nI like the game overall. I like the combat. I like the difficulty. It's very unfamiliar to me so I'm enjoying the learning curve. But I just can't stand the tedious upkeep. I haven't been thirteen in a long time and I don't do perma-death games. I very lack the time and the interest. Where's my option to just turn this off? I work in development. These things are a very light lift and open up the door for players to have the experience they want. Lazy omission, if you ask me. Minor polish and QoL features would have made this quite enjoyable. \r\n\r\nFortunately, I'm cheap and bought this on heavy discount and have no problem putting it down for the next one I bought for next to nothing. Just can't spend my time this way when there is so little of it to allocate to gaming these days. Feel like I could have enjoyed this with just a few options tweaks that would have be super easy to develop.\r\n1. Option to disable pilot death.\r\n2. Option to disable pilot injury.\r\n3. Option to disable item loss.\r\n4. Option to disable starting the game with bad credit and bank fees.\r\n\r\nI just can't recommend it. If those things don't bother you though, then I absolutely do. It's really quite fun, otherwise.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Way too expensive for what it is. Not much actual tactical meat here. It's just an RNG fest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its actually quite bad on many levels.\n\nFirst: What you have vs what you face -  You'll be put up against much larger, better equipped enemies, that outnumber you minimun 3-1, and they will almost always have a field advantage. (the last one not so important)\n\nSecond: The weapons feel weak, and the accuracy is incredibly laughable; with precision strikes from a few hundred meters having under a 20% chance to hit. I get the concept of games like this, but in a mech warrior game with feels stupid.\n\nThird: The grind: In the beginning you'll be short money, short equipment and short viable mechs. You MIGHT find a decent medium mech occasionally, but they don't really do a thing vs assault mechs or heavies you'll encounter early on. You'll be trying to complete missions for pennies, just trying to stave off the tax collector, as well as balancing your whiny companions emotions and moral.\n\nConclusion: Meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i don't know what it is, but for some reason this game isn't fun. \nthank eff i got this cheap.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just another trash game where the dev's idea of difficulty is to constantly have you outnumbered and outweighed by the enemy. \n\"Oh, look, another mission where my four mediums face six heavy and assault mechs! What fun!\" Maybe someday there'll be a BattleTech computer game worthy of the name, but this isn't it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game but after 3 attempts to get into it over the years I have unfortunately come to the conclusion it just straight up fucking sucks. The framework is definitely there for a fun game with decent depth, company management, mech loadout building, looting etc. but it all falls apart the second you get to actually playing a battle. The combat is simply boring as fuck, slow and tedious. You can only bring a party of 4 into each mission yet you almost always face hordes of enemies often up to double your number yet made up of units of equal or even better quality, even on the lower difficulty beginner missions. Not to mention additional vehicles such as tanks or missile trucks and base defence turrets of different kinds. This ends in a thrilling experience where you have 4 turns to deal a little damage with a bunch of weapons that all do absolutely nothing. Then you can put your feet up for 5 minutes while you are forced to painfully watch about 16 enemy units of all aforementioned types focus fire the exact same one of your mechs dealing miniscule chip damage over and over again until your core explodes due to sheer overwhelm while you can do nothing about it but sit and watch. And I hope you like watching because even when you hit space bar to speed up the animations and pauses between all the turns it still feels like slow motion. The game is a total waste of time and potential.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Yet another game released with bare bones, the full game and mechanics are hidden behind 3 additional DLCs.  Welcome to the death of gaming.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "350 mlp missiles is not sufficient to destroy 5 starters mech in first mission from campagn in standard difficulty and my other mech overheat like wtf  it's not a strategy game it's just a bullet sponge",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although I've been playing Mechwarrior for decades, this was my first time playing Battletech. The trailers looked really good, and most the reviews checked out, so I started playing the vanilla version without any mods.\r\n\r\nThe gameplay is slow, even for turn based games. The graphics have not aged well. Getting to the various screens you need in the leopard are a pain. Load times are alive and well. There isn't much variety in the missions.\r\n\r\nThere are some good elements to the game such as the mechlab, the voice acting, and some of the writing. I really appreciate how much difference the terrain makes in this game, compared to MW titles. And melee is actually a viable attack in Battletech! But unfortunately these things are not enough to encourage me to click the Play button again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is probably a hoot if you're a Battletech tabletop fan, what with all it's mech building intricacies and vague mechanics that the game absolutely does not bother explaining to you. For me, it just feels like a chore to have several tabs open into rulebooks and hour-long YouTube videos explaining the nuance of combat.\n\nNo one wants a massive info dump at the beginning of the game, but surely even an in-game manual would be helpful? So many mechanics are fed to you by brief blurbs from NPCs that largely amount to \"you have to manage your heat!\" without explaining the numerous ways to do that. Bracing, bulwark, evasion, a whole litany of game mechanics are not properly laid out for you in any way. Normally, I'd say this is beneficial for the sake of trial and error - but error means waiting. And I mean [i]waiting[/i]. As Tom Petty once said, \"the waiting is the hardest part.\"\n\nInjuries and repair times can be mitigated later into the game, but only so much. You'll still spend several minutes on a time advancement screen between battles, even if all goes well, as there is travel involved. What is there to do in that interim? Well, not much. This in and of itself isn't damning, but then there's the combat. Even turning off some extra animations still has battles taking entirely too long for how stale they become. Sometimes it's just turns of sprinting across a generic gameboard to get to an objective before spending 20 minutes firing shots with a slow, itemized list popping up of every affect you inflicted on the enemy mech.\n\nAll in all, it's just a bland, slow grind made unbearable by static between everything. The fun of tabletop gaming is the social experience that fills that empty space between turns - this simply takes everything fun from that and serves it up with typically overpriced Paradox DLC.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After two different computers I expected this game to not crash randomly after getting through the campaign. At first I thought it was my system kind of sucking, but turns out it's the game that sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty is too hard, in a way that doesn't feel challenging and just arbitrary and it feels more like a grind than a fun experience. \n\nThe story itself is too much of a novel than what should be a video game experience. Much more voice acting and cutscenes would have really improved the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is nice, but the AI is allowed to cheat when you get to a skull of two or more and you can field a 70 ton mech or higher.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this years ago. Tutorial is horrible. Started a campaign, played the first mission and Mastiff gets wreched. Game Over. Decided to give it another try recently and Mastiff still gets dogpiled and wrecked, ending the mission.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}