{
  "positive": [
    {
      "review": "I was 15, running around my school in Iran, showing my classmates the trailers for Final Fantasy XV. It made me proud to be a gamer (and future game designer). “This is what games are! Do you see why I’m so passionate about this now?”\r\n\r\nNow I’m 27. A whole decade later, I finally played it. I’d been scared — scared it wouldn’t live up to what I saw back then. The reviews weren’t perfect, and that haunted me. But somehow, after all this time, it [i]exceeded[/i] my expectations — and that might surprise most people.\r\n\r\nThis game is genius. Absolute genius — maybe even in ways the developers never intended. Maybe that’s copium. Maybe it’s truth. But either way, FFXV is about something bigger than itself: the beauty of life and its inevitable passing. It’s that one last road trip with the boys. The side quests you hated doing at the time — fetching tomatoes, running errands — somehow become the sweetest memories when it’s all over.\r\n\r\n“I’m a king, goddammit!” you think, \"why am I fetching tomatoes for you?\". But that’s the point — you had the privilege of knowing normalcy. Like capital-L [i]Life[/i] itself, the small, mundane things end up meaning the most. By the end, you find yourself missing the early hours — the stupid fetch quests, the campfires, the jokes and banter with your brothers. What you wouldn’t give for one more night under the stars with them.\r\n\r\nPeople wanted another [i]Witcher 3[/i] — a world bursting with content, where every random joe on every corner had a deep story to tell. But FFXV isn’t that kind of game, and Life isn't that kind of experience. Its emptiness [i]is the point.[/i] Life isn’t packed with meaning at every turn; it’s quiet, awkward, sometimes tedious. And then one day you look back and realize — that was it. That was life itself.\r\n\r\nYou don’t remember the massive battles. You remember your brothers. The drives. The fireside laughter. The homemade meals. And somewhere along the way, it stops feeling like a game. It feels like a memory.\r\n\r\nMaybe I’m coping. Maybe I’m seeing something that isn’t there. But I’d rather believe it was intentional — that the tedium, the melancholy, the silence — all of it was designed to make you feel the weight of time. And if you play the game with this perspective, it would reach into the depths of your soul and impact you in a way that no other game has.\r\n\r\nFinal Fantasy XV is messy, beautiful, and painfully human. As I fight back tears, all I want to say is: Ignis, Gladio, Prompto — thank you for living this life with me. You guys... are the best.",
      "voted_up": true,
      "votes_helpful": 119
    },
    {
      "review": "When it's good, it's amazing. I recommend watching the movie, Kingsglaive, first (treat it like an extended opening cutscene) as well as the Brotherhood anime on youtube. \r\n\r\nGameplay-wise, it's a flawed gem. The combat system was refined into the far better system the FFVII remake games currently use, but you can seeds of it here. What this game has that I haven't ever seen done better is the party interactions, both in and out of combat. It's like they took the party banter that Bioware and Naughty Dog were known for in the 2010s and incorporated it into an open world RPG without it feeling repetitive. There's a reason the main 4 characters are consistently regarded as the best part of this game. It's not that the story is bad, it's fractured, but the one part that consistently works throughout the whole game is the party dynamics.\r\n\r\nAll that to say, the game is a great time if you can tolerate some major flaws that don't disrupt the core of the experience.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Final Fantasy XV was a game that I had heard mixed opinions about, but I entered the game open minded. At it's core, the game is unlike any other game in the Final Fantasy franchise. The open world is vast and well built, offering unique experiences and vastly different landscapes as you progress through the game and travel around the world.\n\nFor the most part, the bulk of the game is openly exploring the world and completing quests/levelling up your skills and equipment. And although I like to complete games fully before writing reviews. I could not bring myself to fully complete all achievements before doing so, not because the game is bad. But the pacing of the mid-game is slow, and relies heavily on your willingness to complete all side quests before progressing to the endgame. \n\nNarratively, I thought the game was interesting, and offered something unique - a lot of the story telling is done through the travelling with your friends on the road, and the feeling of a road trip is something this game excels at. You really feel connected with this group and you start to enjoy the time you spend with them, and watching them live and work together. Conflicts and character development are always key features in Final Fantasy games and this game is no different. The development of the group from the start of the game to the end is remarkable and seeing the bonds form and change in real time is something I thought was well executed. The end game really picks up and for me is largely the best part of the game, in terms of action and outright story telling.\n\nCombat is simple, but effective. I found that it wasn't as complex and extravagant as compared to Final Fantasy XVI but I think it's fun. Working to get ability points and freely choose what to upgrade was a nice change, although I felt like the prices of later upgrades are harder to reach if you're wanting an easy playthrough but if you're willing to put the time in and complete it fully, then you will get everything and you will see just how vast the upgrade system can be.\n\nQuests in the game are largely simple, however the travelling to and from becomes tiring and tedious, with few quests being close by. Although it does encourage exploration, I do think it took away from the overall experience at times, as I would waste an entire day just working on 2-3 quests largely just from travelling.\n\nVisually, I thought the game was stunning, considering the game is a few years old, I thought it held up really well and some areas and cutscenes were incredibly well designed. The music is incredible as always, but that is to be expected with the Final Fantasy franchise. Performance wasn't really an issue, with the game only crashing once for me, which was the last boss fight, but aside from that, I had no issues with performance.\n\nAs a whole, I would recommend playing the game, but I will warn that it's one that requires commitment and a willingness to complete it fully, to truly get the most from it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Picked this game up some odd years ago, it finally clicked with me!\n\nSome might say the open world segment in the first half of the game may feel empty, maybe even mundane with a RIDICULOUSLY huge number of fetch/kill quests, and long driving sequences but these moments, the long hours, the hard hours that you put in to engage with the world, fighting, adventuring, fishing, camping, photographing, THESE hours are the moments you hold onto and carry with you into the latter half of the game, when you put the controller down, and when you see those end credits.\n\nA very enriching experience from a game with a troubled dev history, it's a shame to see that a good number of DLC was cancelled and looking back at the older trailers and gameplay reveals, you can see we got a very different version of what was originally envisioned.\n\nDespite all that, however, I walk away satisfied and implore you to let the game take you on the road trip it promises, flaws and all",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The road trip with bros vibe from the first 8 chapters of the game make it well worth the purchase. Super fun. However, just be aware that if you really want to understand the plot you have to watch the movie, mini anime series and play the DLCs.\r\nThat is the game's weakness, the story is confusing and isn't well put together. It requires the extra effort that I mentioned above and even then its still difficult.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game with lots to do, secret bosses, dungeons, etc etc.\r\n\r\nThe story is good up until the last chapters where everything got rushed. I like the comments from the party members on everything you do.\r\n\r\nSome of the hunts are a bit annoying though, especially those who requires you to go kill the boss of a dungeon you already completed. Worth a play at least.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I never liked RPG games and i thought this was gonna be like a Turn-Based RPG, but i was really wrong, this game was really beautiful.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The story in this game is really good and the graphics still look amazing even today. The characters are cool too. They can be cheesy sometimes but I liked that and got attached to them by the end. The only thing I didn’t like was the combat. It gets repetitive and too easy after a while. Most fights weren’t hard, they just took forever because enemies have so much health. Holding one button the whole time got boring fast. I even put it on easy mode just to finish fights quicker. The open world and side quests are a lot of fun though. Riding chocobos is great, but I didn’t really like how the Regalia worked. That’s just personal taste though. Overall it’s a really good game with a nice story and fun characters. If you don’t mind simple combat, I’d say give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is broken as hell and barely runs on even the fastest of computers and squeenix will not provide a fix.\n\nIt is un-optimized and broken. You can be running at 120 fps and then suddenly have a memory leak and be running at 5 fps. I will also tell you that whatever you on modern windows in terms of going under the security tab to turn off certain things will also not fix your issue.\n\nAlso also Special K will not help you nor will any mods to run this game on a decent framerate. Honestly the game is pretty cheap on a PS4 or Xbox One and I would recommend you pay 3-12 dollars for that version from eBay instead of playing this broken game on PC.\n\nOther then that this is probably the best Final Fantasy game out there with how large in scope everything is and how much there is to do in this game. Its a shame squeenix abandoned it after a certain point and it became borderline impossible to play this at a decent framerate.\n\nYou can fish, you can monster hunt, and you can rot your brain with the story. You can physically walk to all your quest locations and not fast travel or drive the car anywhere. You can use chocobo's to do the same thing. You can race Chocobos. You can camp and collect resources to cook hyper-realistic and good looking food. You will experience set pieces that are borderline bigger and better looking than any Final Fantasy game that came after this game. It is a technical marvel what this game achieved when it first came out and its not afraid to show it. The battles are grand and awesome in scope and made me realize that this was probably the biggest game that Squeenix will ever probably come out with.\n\nIts a shame no one really liked this game when it first came out. I certainly do but honestly its best bought elsewhere off of PC on old game consoles with physical disc drives for that cheap price from eBay and no the non steam versions will not magically fix the game give up already. I wouldn't be surprised if this game broke one day and became only playable on Linux and older versions of Windows.\n\nIf you really wanna play the game on PC use Linux and buy a high end graphics card with at-least 48 gigabytes of vram. Have at-least 128 gigabytes of ram or more. Pray these specs will allow you to play the game longer before the game starts slowing down where it has the chance to randomly crash.\n\nOh yeah BTW the game will and randomly brick itself as-well. So good luck with that as-well.\n\nI played this game first on console and kinda wish I stuck to that version. Ugh at-least the PC version doesn't look bad.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9ne of the best games I have ever played. Definitely worth it. The music is amazing and yoko Shimura did a wonderful job with it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This was my first and ever Final Fantasy game, I got interested in Noctis's appearance I thought he looked cool. I don't care what people say about this game, \"unfinished slop\" everything runs and looks fine to me, its my kind of slop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best FF games, the cast is so goated and the story is really good \r\n\r\nWalk tall, my friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good music, decent combat, good character, good story. It is enjoyable, and good for relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buen combate y buena optimización, cuando lo jugue en ps4 en salida era horrible, se nota mucho la optimización de los años y el añadido al lore con los dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with an amazing and tragic story and fun combat\r\n\r\nLots of reviews say the world is empty and its a rushed story after the first bit but I completely disagree, especially if you play the DLCs\r\n\r\nworth the full price imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this on console launch when it first released and it was not a horrible game but it was very incomplete. I am almost through my first playthrough of windows edition with all the dlc and fixes and it is a much more fleshed out and complete game. I was unsure about what to expect with the kingdom hearts control style but no real complaints other than the magic system can feel very underwhelming at times for the way I play. The story is what makes me like this game, though. It really puts a literal point on why the game is called final fantasy and i will not spoil (a 9 year old game lol) the ending here. So, yeah, give it a go or whatever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first experience with FF. It was amazing! Pretty fun game play and lots of things to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun. I've been somewhat into Final Fantasy ever since playing FF7 Remake and it was a delight. This game is definitely structured differently from FF7 and despite that I still find myself extremely engaged. \r\n\r\nMy only gripe is the vehicle travelling system, maybe I'm a dunce and don't know a faster way yet but If theres no fast travel I find myself doomscrolling while waiting for the ride to end. I do find the engagements with the other characters while driving to be quite fun and a nice touch. This however, is not at all an issue that would stop me from playing the game, It's amazing overall. \r\n\r\nWill edit after finishing the story :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i grew up with the final fantasy games but this one and 7 are definetly my favorite. i love the open world aspect in this game the the scenery is absolutely beautiful. even if your not following the story you will still have just as much fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually love this game, and its in my top 10 Final Fantasy games which is saying a lot. I heard it sucked when it came out, but windows edition in 2025 is great. The main story can be a little all over the place, but Noctis is a cool protagonist and his chemistry with his crew is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My fav final fantasy it might be a little streamlined but how you can explore the very alive world and interact with the characters is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always been a fan of FF -  great game for old & new players. Something different than the turn-by-turn base. Visuals are amazing. Look of easter eggs and collaboration with other games and brands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had several false starts with this game. I wanted to give it a real shot, because it's Final Fantasy, but I didn't care much for the party members or the combat. The game throws you into a big world too soon, and it felt overwhelming. I didn't like the theme of going on some road trip with a bunch of dudes either.... But then I finally sat down and gave it a real shot.\n\nAt some point, these dudes became my brothers who I would lay down my life for. Suddenly I was emotionally invested and gripped by the story. I couldn't put it down, nor did I want to. I wanted to see the story. I needed to see the story. I didn't care that I didn't care much for the combat, because I just had to see how everything played out. After a little while, everything became much more linear and focused on pushing the narrative forward. I greatly appreciated that.\n\nThere were quite a few moments in the story that I felt were wonderful. I wish I could say that I loved every moment of it, but there are a few things I would change if I could. Do not read ahead unless you want important story elements to be ruined.\n\n[spoiler] I did not like that Ignis never regained his sight, that your girlfriend dies, and that Noctis dies at the end. I'm also under the impression that the 3 guys you spent this whole journey with die also, but I've seen it debated. Either way, I don't enjoy stories that end this way. The cost of it all seemed too great for me to enjoy the outcome. What do I have to be happy about? That Noctis and his girl are together in the afterlife? Nobody that went through this journey with me enjoyed the fruit of all their labor and sacrifices. They were going to release DLC that gave the ending I wish I would have gotten, but it was canceled. I'd pay $60 to have this ending. [/spoiler]\n\nI do recommend this game for the most part. If you can make it to the middle chapters, it's all worth it and straight forward from there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At times, it can feel like the game is dragging on. By the time I had gotten to the end, I was ready for the game to finish, however, after the final cutscene, it made the entire playthrough feel worth it. The reflection of Noctis' journey and how small mundane things can sometimes be the most meaningful experiences, manifests itself in the player experience as well. I found myself personally looking back to the car rides, campfires, and annoying side quests just to realize that was the point of it all... Noctis and his conflict with normalcy as a king.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "use curseforge to retrieve cut content and expand your gameplay, i sugest flagrum mod manager to get started. its really easy to use as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy it a lot. A me problem though is that this game is REEEEALLY long, so I play for a while, put it down, and then I want to start over after picking it up much later again.\r\n\r\n\r\nPlease help me, I want to finish this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reccomended! Overall 80/100\n\nQuite Good combat system for 2018 game. The graphics is awesome! The artstyle is magnificent! and the World of EOS . . . . is so beautiful and feels live. The character on FFXV is great (Ignis is MVP btw). \n\nAnd the Post game content is surprisingly have large content, there is some DLC and it is, .  . . just good.\n\nThe negative part is. This game is actually have potential to become like Witcher 3 or Clair obscure for the stories and game content. And Lunafreya screentime, . . . i mean, she is the heroine right? She is important to the story, but she just like, well you can count her screentime. I really want to play using her on the party with noctis on scenario for the story. But, . . . yeah, dissapointing. :(\n\ni would say overall 80/100\n\n*Sadly this game could be 95/100 for me if the deleted content of the story not cut in the game. Some parts especially on the mid to the end feels rushed. And after some of searching, i found the game is actually have like 10 hours unrealized cutscenes of the story. The tight deadlines makes them cut the content and some of part throw it to the movies and anime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took 10 years to develop, and then 6 years to break even. And almost 10 years later, this could be released today and still beat everything else in terms of graphics, gameplay and story.\r\n\r\nI recommend using a story guide, otherwise it's very easy to miss out on the plot, and watching Kingsglaive between chapter 1 and 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is peak...from the story,character design,the immersion..\nEasily my favorite game off al time (plus if u use mod the game is even better).\ngreat deep gameplay,mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for an odd two years now, and honestly? I don't think I'm ever getting out of this phase.\r\nI mean, yeah, it's kinda a button mashing, hangout and hike with the boy's simulator, and the story felt just a tiny bit rushed in the end, but overall it's a beautiful game worth giving a shot at. \r\n(But maybe get a computer that actually meets minimum requirements LOL.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my Favorite Final Fantasy game to this day, I originally played it on XBOX, but I am enjoying every minute of my replay of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm going to make this brief and just highlight the things that made this game pretty cool and pretty bad and if I could leave this as a mixed review I would. But for what it's worth, it was an okay experience at best and the following will contain spoilers:\n\nCombat-\n\nPretty okay combat. Playing as Noctis was fun towards the later end of the game and it wasn't even close. Armiger (and Armiger Awakened) were insanely fun to use and the team bar was interesting to try and diversify the strategies for some enemies. Now, it was very and far few between for it to have really mattered (Aoe vs single target) and with the right weapons it was solely just Break and Jump. Gladiolus' gameplay relied a lot on counters and blocking to build stats and unless you're doing a boss battle it was pretty lame outside of his episode. Ignis suffered the same where outside of the elemental daggers, there really wasn't much interesting about his gameplay outside of seeing what you can do with his Clarity mechanic. Prompto easily had one of the more fun gameplay in comparison with his guns (smg, rocket launcher, and grenade) and Crackshot mechanic.\n\nStory -\n\nOkay, this portion is where knowing about Vs XIII and comparing it to the current story it's terrible. But for looking at it solely, the -very- beginning of it is actually what caught all of my attention. Ardyn Izunia is the 'main' protagonist of the game. A benevolent healer that would go around healing the Star Scourge from infected people while harboring the scourge within himself. His little brother Somnus, the would be founder king, usurped his position prematurely by slaying Ardyn's lover, the first oracle, and sealing Ardyn away for two thousand years. Originally Ardyn would be the king but the darkness from curing others was slowly corrupting him and the Crystal denied his claim to the throne. His new task by the gods is to spread darkness and be a sacrificial lamb for the Chosen King to appear one day and banish it all with him as the epicenter.\n\nThat right there would've been interesting to expand on, minus the final bit. But we fast forward to present day where Noctis is the chosen king, loses everything; his kingdom, his dad, his lover, etc. Noctis wins the favor of the gods in the form of Final Fantasy summons and needs to be reborn as the Chosen King of Light. Fast forward ten years, he goes to fight Ardyn and sacrifices himself to put him down permanently.\n\nThat's the synopsis of the game. It's bad. And unless you play the respective character episodes which is detached from the main game, it'll make less sense. And good luck playing Comrades to understand what happened during the time skip between modern and post time skip. A LOT more is explained in the movies and books or whatever but supposedly Bahamut's also just kinda an instigator. Go figure.\n\nPersonal Thoughts -\n\nThere's not much I can say about this game. The rewards you get suck and you do need a level of a guide to figure out where some stuff is, unless you intend to dump an ungodly amount of time to find everything yourself. There's a level of city exploration Episode Ardyn introduced where, if we had gotten the ability to fly about and explore freely, this game would've been way, way better. The Regalia's ability to fly is lack luster because you are insanely limited on where you can fly and the controls are limiting.\n\nJust mod it if you intend to have a good time. I normally like to play games vanilla on the first play through but there's just too many quality of life changes you can mod in where you won't feel it to be a hassle. The jumping is clunky, the driving is meh, and the restrictions you get like Armiger weapons draining HP per swing is dumb (even if it makes sense lore wise). \n\n\nIf you need something to kill time, I guess this is a good option. It's not my first or my last choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite final fantasy games. Beat it on my PS5 thought it was the best ending out of all the final fantasy games ive beaten. Replaying this again because of the great memories i had. Combat takes time to get used to but it was fun overall. Would recommend for first time final fantasy players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very very good game, personally now one of my top 10 favorite game series and i recommend it a lot for new gamer's to final fantasy and older generations, like i always say ''you know the game is good when it makes you cry''",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much, despite the flaws. I played the vanilla version of this on release on PS4, played the hell out of it and every single DLC that eventually got released. Also did a couple New Game + runs. \nWas sad I couldn't replay Moogle Chocobo Festival after awhile, so eventually got it on PC where you can gets mods to play the event. And I love being able to play it once more now on my PC.\n\nYes the game is flawed, there's countless YouTube video's about it, but I still love it. I love the traveling around with the guys, the graphics are gorgeous, and it's overall just a fun game with great areas to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's amazing and near-perfect in so many ways, from the stunning graphics, rich and vibrant world, and story that really tugs at your heartstrings, this game is a must-play for both veterans and newcomers to the Final Fantasy franchise. \n\nI've beaten this game almost twice on my Xbox and every single time that cover of Stand By Me by Florence + The Machine makes me cry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished FF15 on my PS5 and man, it is definitely one of the best Final Fantasy games out there. The OST is amazing as usual, I loved the lore so much, and the graphics were good (though the quality of the cutscenes weren't it for me). One day, when I'm in the mood to play FF15 again, I shall replay on Steam lol (might as well as I haven't finished it on here yet). Whether you're new or a longtime Final Fantasy fan, you gotta try this!! I'M NOCTIS LUCIS CAELUM, THE PRINCE OF LUCIS AND KING OF FISHING RAHH~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When you get the context for drama of how the game restarted multiple times, is built on top of itself, and the lead creator's dream game was replaced with a mobile game director, the weird pacing, in consistent quality of detail and groundbreakingly terrible rollout of a story start to make sense.( On that latter note- it takes a guide to actually follow along with the extra, damn near required content outside of the game to be in the know of whats happening in the game.)\n\nSometimes you encounter terrible ideas with excellent execution that are fun.\nThis is a terrific idea with terrible execution, layered with the nuace of past work that complicates the final experience due to its irrefutable achievements.\n\nLets give examples. An auto attack combat system is built ontop of a action slasher system in which both are accessible but each compete for relevance.\nAwesome camping and roadtripping mechanics that are designed out of relevance for optimal play.\nAnd most impactful story moments happen off screen.\n\nThe games that fulfills this promise are the final fantasy 7 remakes. My suggestion is to go play those first, and play this later on with the perspective that if this was reworked under the team that made 7, completely and utterly, it'd be one of the best ff games they ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game. I remember being this age. Looks cool, decent combat mechanics, big map, and a variety of mini games and side-quests. It's weird you can't zoom or rotate the female characters in the character viewer. It's not even like you can zoom in super far anyway. I get you don't want people doing p****rt stuff in your honorable anime game, but I just wanted a better look at their faces. Oh well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1]🌌 Final Fantasy XV 🌌[/h1]\n\nI bought FFXV without any preconceptions—just knowing it evolved from the cancelled Versus XIII. I wasn’t expecting much, and as someone who’s not a huge Nomura fan, I assumed it’d be mediocre at best. Turns out, I was wrong. While it feels like a missed opportunity to be something far bigger, it holds up decently in its own style—though it needs some nuance.\n\n[hr][/hr]\n\n[h2]✨ The Great [/h2]\n\n[list]\n[*][b]Soundtrack[/b] – One of the best in the series. Opera-classical and rock opera elements shine throughout.  \n[*][b]Character Dynamics[/b] – The interactions and evolution of the main cast are genuinely charming and give the game its unique flavor.  \n[*][b]Gameplay[/b] – Not your typical FF mechanics, but within its style it’s fun and engaging.  \n[*][b]The Regalia[/b] – Feels like a character in itself, adding depth and serving as the stage for side stories.  \n[*][b]New Game +[/b] – Adds replay value and extra layers to the experience.\n[/list]\n\n[hr][/hr]\n\n[h2]⚠️ The Not So Great [/h2]\n\n[list]\n[*][b]Missed Opportunities[/b] – The game could have been much more than it turned out to be.  \n[*][b]DLC Story Bits[/b] – Decent on their own, but the main narrative feels patched together and lacks depth.  \n[*][b]Pacing & Development[/b] – Story momentum shifts noticeably; the development feels uneven.  \n[*][b]Empty World[/b] – Only two fully populated cities; side-quests are generally unremarkable.  \n[*][b]Mixed-Media Requirement[/b] – Understanding the full plot needs external materials, which is both frustrating and appreciated.  \n[*][b]Multiplayer Story[/b] – Beautiful story that not many players engage with in multiplayer.\n[/list]\n\n[hr][/hr]\n\n[h2]💬 Verdict [/h2]\n\nI can recommend FFXV, but it’s bittersweet. The list of good things outweighs the flaws, yet the negatives are hard to ignore. It’s a game with charm, beauty, and unique moments, but I often wish I could hit a “Recommend, but…” button.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Goodness, have I not played this game since it came out, it's good from what I remember",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite its imperfections, Final Fantasy XV holds a special place as one of my favorites. The camaraderie and constant discovery that come from exploring the world with the core four characters is truly invigorating. Everything from their travels and finding the various tombs to the tense anticipation of looming mysteries feels spot on. Unfortunately, the overall story remains incomplete. It's a genuine disappointment that the canceled final DLCs prevented us from experiencing the full and complete FFXV narrative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had fun with the PlayStation and I’m having so much better fun with this version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Taking a road trip with the boys has never been a better experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just amazing no words can describe how much i love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An upcoming king, a shonen sidekick, a talking wall and a british guy embarks on a noble quest to fulfill the most prestigious of royal duties to be a king: Manual labors, paying taxes, and catching frogs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun. get lost in the world you wont regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game ever played, great story that can take your tear.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I giggled, i cried 6 or 7 times, changed my brain chemistry and affected my way of life.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this ultimate boyfriend roadtrip! 10 outta 10 fr fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game despite the development hell it went through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the autism spectrum representation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its Final Fantasy. What more can I say !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good. Game yes. Purchase Purchance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never again will I experience a game that moved me to my core like this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EPIC adventure with a hot boy band.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would pay so much money to fight leviathan for the first time again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been more than 7 years now and I still haven't recovered. Play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "forgot to play the game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the team aspect and the combat style flows well",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "4 bros chillin in the hot tub 5 feet apart cause they're not gay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great open world rpg!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Noctis Lucis Caelum you will always be famous",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My favorite game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Final Fantasy game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST FF GAME THAT I PLAYED",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "amazing hot garbage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "white tear rolled down my leg first time i played",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a just barely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the top 3 FF of all time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak final fantasy\ntears to my eyes",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i cannot live without noctis",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Walk tall my Friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would die for my boys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "heartwarming",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mindblowing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sexy bro time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cactuar :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wwwwwwwwwqooooooooowwwwwwwq gam,ew rjun sao s;.low",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fuck yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "emo twink",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ardyn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "mntp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“I’ve made my peace. Still… Knowing this is it, and seeing you here, now, it’s…more than I can take.”",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was 15, running around my school in Iran, showing my classmates the trailers for Final Fantasy XV. It made me proud to be a gamer (and future game designer). “This is what games are! Do you see why I’m so passionate about this now?”\r\n\r\nNow I’m 27. A whole decade later, I finally played it. I’d been scared — scared it wouldn’t live up to what I saw back then. The reviews weren’t perfect, and that haunted me. But somehow, after all this time, it [i]exceeded[/i] my expectations — and that might surprise most people.\r\n\r\nThis game is genius. Absolute genius — maybe even in ways the developers never intended. Maybe that’s copium. Maybe it’s truth. But either way, FFXV is about something bigger than itself: the beauty of life and its inevitable passing. It’s that one last road trip with the boys. The side quests you hated doing at the time — fetching tomatoes, running errands — somehow become the sweetest memories when it’s all over.\r\n\r\n“I’m a king, goddammit!” you think, \"why am I fetching tomatoes for you?\". But that’s the point — you had the privilege of knowing normalcy. Like capital-L [i]Life[/i] itself, the small, mundane things end up meaning the most. By the end, you find yourself missing the early hours — the stupid fetch quests, the campfires, the jokes and banter with your brothers. What you wouldn’t give for one more night under the stars with them.\r\n\r\nPeople wanted another [i]Witcher 3[/i] — a world bursting with content, where every random joe on every corner had a deep story to tell. But FFXV isn’t that kind of game, and Life isn't that kind of experience. Its emptiness [i]is the point.[/i] Life isn’t packed with meaning at every turn; it’s quiet, awkward, sometimes tedious. And then one day you look back and realize — that was it. That was life itself.\r\n\r\nYou don’t remember the massive battles. You remember your brothers. The drives. The fireside laughter. The homemade meals. And somewhere along the way, it stops feeling like a game. It feels like a memory.\r\n\r\nMaybe I’m coping. Maybe I’m seeing something that isn’t there. But I’d rather believe it was intentional — that the tedium, the melancholy, the silence — all of it was designed to make you feel the weight of time. And if you play the game with this perspective, it would reach into the depths of your soul and impact you in a way that no other game has.\r\n\r\nFinal Fantasy XV is messy, beautiful, and painfully human. As I fight back tears, all I want to say is: Ignis, Gladio, Prompto — thank you for living this life with me. You guys... are the best.",
      "voted_up": true,
      "votes_helpful": 139
    }
  ],
  "negative": [
    {
      "review": "Denuvo.\nDenuvo allows a game to run on 5 different system in a timespan of 24 hours. Do NOT fiddle around with proton versions because each version is considered ONE device and you will get this error:\n\"The server is not reachable, check your Internet connection and click \"Retry\"\" - locking you out of playing the game for 24 hours.\n\nPlease remove Denuvo, it causes more problems than it fixes.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "(SPOILERS) Final Fantasy XV is such a frustrating game because you want it so badly to be a great game, but it's so frustratingly mediocre and directionless that after playing it for about 13 hours, I had to put it down.\n\nThe first 2 hours of the game are nothing less than amazing, you are introduced to 4 characters through a dialogue oozing with chemistry, and are shown an open world that leaves so much to the imagination. The sprawling landscapes and beautiful views that bring you to say: \"wow, this world is beautiful, I can't wait to see what comes next.\"\n\nThose first 2 hours were the best hours of the game, and it wasn't even close.\n\nThen comes the big twist in the story: the city in which you start the game in is taken under siege by the evil faction in the game, and your father, king Regis, is killed in the onslaught. Our main character, Noctis, is obviously devastated by this. The news comes out of nowhere, for both the player and the characters, and hits him like a truck; but I hadn't had a single emotional connection with the city or the late king, I hadn't even remembered their names before I looked them up on wikipedia. I had no attachment to the inciting incident of the game, because all I knew of the city and person that were destroyed was encompassed all in a three or four minute cutscene at the beginning of the game.\n\nThen comes the fact that the game cannot decide what tone it is trying to go for. Does it want to be a coming-of-age-story of 4 close friends exploring the world and having fun moments with each other? Or does it want to be a serious narrative about the fall of an empire and how that impacts people? Final Fantasy 15 decides to be some weird mix of the two, with seemingly heavy and emotional moments being interjected by one of the characters wanting to go see chocobos. More offensive, however, was when a character left your party for a reason he left unexplained, seemingly going on some great task that he needed to do. A few minutes after he finally reunites with your party, he grabs your attention and you're expecting him to talk about whatever task he felt so obligated to do or at least some comment about how he's feeling, and instead of doing anything like that, he gushes about the (sponsored!) cup-noodles that he loves so much. \n\nIt's not the moment itself that struck me, moreso that there are so many moments like that, where I am internally begging for the game to characterize these people on a deeper level, but it can't decide on what tone it wants to stick with, so any real development of these characters are just interrupted by 'funny haha' moments that bring anything serious to a complete halt.\n\nLike I said, I can excuse a rough story if the gameplay is good enough, but after 12 hours, I genuinely can't find any more fun in this game.\n\nThe world is easily the strongest part of the game. There were views while I was driving in which the characters had dialogue something along the lines of \"look at that view! it's amazing!\", and they were right, the world in this game is beautiful and for the first few hours I was gawking at everything I was seeing. It carried me through my playthrough and was the only thing that beckoned me to explore the world, but a world so large had so little to do inside of it. 99 out of a 100 times, the only content of the open world I could find were fetch quests-- kill these 5 monsters, go get this item and bring it back to me. There was nothing to do in a world brimming with potential. The only memorable quest I had was going to the chocobo ranch, and finding out that there was a monster scaring off the chocobos. The spectacle alone of the time building up to finally finding that monster, seeing its sheer size as you trail it to its den, and the final fight that wraps it all up, was the single most memorable thing I did in that game.\n\nThe side content itself kept me from exploring the world, as when I tried a few of them, they were so boring and uninteresting that I found myself just sticking with the 'hunt' quests, which just had you going to a certain location and killing a few monsters for a couple rewards. After a few hours in the game, I was entirely unmotivated to explore the open world in the open world game in favor of just doing a couple fetch quests until I got what I needed.\n\nThe biggest gripe I have with this game, however, is the combat system. I'm not one for extreme depth in combat, I'm okay with some things, like combos, being simplified for the player; but the extreme length to which the game tightens its leash on you with how dumbed-down the games systems are is incredibly frustrating. There are many smaller problems I have with the combat, but there are two main things: for one, you can win just about any battle by holding left click and shift, as the game will both auto-target the enemies on your screen and also automatically perform combos entirely out of your own control, taking any agency you could possibly have out of your own battles, you're basically just watching someone else play the game for you. Second, you'll never lose a battle in your life because the healing system is so unbalanced that you can brave any fight through sheer force of potion-spamming, because the game both gives you invulnerability when you've been knocked down AND pauses when you enter item-select so you have all the time in the world to select a healing potion which can put you right back into the fight. This action RPG has no real action, you're just watching people fight while barely having any input of your own. It's a test to see how long you can wait until the fight finally ends after spamming potions and holding two buttons, because the chance of you dying is nonzero, but it's so low that it may as well be nonexistent.  \n\nI really wanted to like this game. It was my second final fantasy game, I played the first one after the collection was on sale, and it had so much promise, but I found myself losing all interest in continuing before I could even finish the game. If you want an Action RPG with a developed and interesting world, play Elden Ring, not this.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I’ve played many action RPGs, including Soulslike games, Monster Hunter, Devil May Cry — you name it. But I have never experienced combat this frustrating. And no, it’s not “mashy.” The problem is that you're constantly getting one-shotted, and enemy attack patterns are either so poorly telegraphed or outright random that half the time you just die to something you literally cannot see coming.\n\nEvery enemy in this game feels harder than an actual Dark Souls boss — not because they’re well designed or mechanically interesting, but because the timing of their attacks is bizarre and inconsistent. Sometimes they hesitate. Sometimes they chain attacks with zero gaps. Sometimes you dodge and get hit anyway because… reasons? And reading enemy animations? Forget it. Some attacks blend so much into the environment or character models that you only notice them when you’re already dead.\n\nAnd as if that wasn’t bad enough: the camera.\nWorst part of the whole experience. It clips through walls, zooms into Noctis’ spine, gets stuck under enemies, or just randomly decides to point at the sky like it’s admiring the scenery instead of showing you the thing that’s about to murder you.\n\nCombat feels less like skill and more like praying RNG doesn’t screw you.\n\nThe frustrating thing is: the game looks great. The story is emotional, the world feels alive, and there’s clearly passion behind it. But everything outside of that — performance issues, the awful camera, the completely chaotic combat system, and the constant feeling of being punished for things you can’t control — overshadows all the good parts.\n\nWould I recommend it?\nYeah. If you hate yourself and need a new source of frustration.\n\nOtherwise? Watch the cutscenes on YouTube. It’s the better experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What I Liked:\n⦁ interesting premise\n⦁ beautiful open world\t\n\nWhat I Didn’t Like:\n⦁ awful, boring combat\n⦁ empty open world\n⦁ extremely repetitive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is no polite way to say it, this game is a mess from start to end. Issues begin to arise as soon as you start the tutorial. The combat in this game just isn’t good. I really tried to like it, but it feels like shit. You hold down the attack button and the dodge button and your character just does stuff. It isn’t fun or interesting in the slightest. The way magic works in this game made barely any sense, so I just never interacted with that system after trying it once. It also took me a while to realize that I could unlock skills to play as the other party members in combat, but Gladiolus and Prompto feel terrible to play and Ignis just felt weak compared to Noctis. I am not a modern FF hater, but if this is what we killed turn based for, I can understand why people are mad about the shift.\n\nThe actual combat is just the tip of the iceberg though. Why is this game open world? I think even if you asked the actual developers, they wouldn’t be able to give a good reason. Not only is this world boring as all hell to explore, but it manages to be tedious as fuck too. Anytime you get a quest or start a hunt, you better hope that the location happens to be next to a fast travel point. If not you get to sit in the stupid fucking car while it automatically drives you there. Waiting four minutes with your hands off the controller sounds fun to you? Well fuck you idiot because you just so happened to start the quest while it was turning night, so now you get stopped every few seconds to do a fight against a giant piece of shit who outlevels you like crazy early game. Luckily, it's not like this guy is hard, he's just fat as shit. You got that, beat him up! Think again dumbass because while you were in the seven minute fight against this boring enemy with the garbage combat, the devs thought it would be funny if they dropped a plane full of enemy soldiers on you. Now that seven minute fight is a twelve minute one! Better hope they don’t do that twice since that can happen for some reason. \n\nYou finally did it though, you managed to make it to your quest location and can get to business! These quests are so bad that you are going to wish you never made it in the first place. I’ve played a lot of open world games where they fill up the map with boring side quests, but you can at least expect a few of them to be good. I can’t say that a single one of the quests I did were even decent. Imagine if every quest was a radiant Skyrim quest. That's what it's like except at least those might bring you into a cool dungeon or something. THESE QUESTS ARE JUST ASS!!!!! Go pick up dogtags. Go collect frogs. Go kill this group of enemies. Repeat over and over until you give up and completely stop doing them.\n\nThe story is actually pretty cool. Too bad they managed to fuck that up too because to actually experience the entire story, you’ll have to go through things outside of this game. You are actually missing out on important things if you only go through the game. Ignis gets hurt in a major way and I had to take a step back and watch a YouTube video to try and figure out what the hell happened to him because the game just goes to the next chapter like it's nothing. Turns out they expect you to play through his DLC at that moment to understand what happened. Hold your horses though moron! Before you go ahead and play that DLC at that moment, watch out because it spoils the ending of the game if you do it. Like what the fuck? I’d call this next part a major spoiler, but it barely affects the story. Lunafreya died and I sat there wondering if Noctis gave a shit because they barely interacted in the story. It was a nice enough scene, but I was actually caught off guard when Noctis was depressed for the next couple chapters.\n\nComrades DLC is just butt, don’t play it.\n\nAll in all, I would not recommend playing this game. The story is a mess and the gameplay definitely does not make up for it. The only positive thing I can say is that the interaction between the party members is kinda nice. Play something else.\n\n2/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Driving in this game is just torturing. I don't even catch the slightest vibe of relaxation when driving, but the game designers seem put so much effort on it trying to impress players. This game is a huge let-down.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game kind of sucks...in almost everyway.\n\nThis game's combat is so so boring and unreadable, enemies backhand you with one shots, or you don't get hit because you hold down a button to dodge. Why do I get one shotted?, because I was underleveled. Why was I under leveled? Because I don't didn't do too many sidequests. Why didn't I do sidequests? Because I didn't want to traverse the giant, empty map that is filled with looooong inpassible walls to hunt or fetch more shit, or fight monsters with this games shitass combat system.\n\nEven barring all of the above, this game's story has some nuance but bascially boils down to the Backstreet Boys suicide-bomb the darkness with light by the end. Not that you'd know about any of this nuance considering most of it comes as a result of outside media or DLC that launched after the fact, because japanese developers don't have the restraint to pace their stories properly, even when you give them 10 FUCKING YEARS! \n\nThe one and only redeeming quality to this game is Noctis' companions, they are very well fleshed out and performed.\n\nIt's like they tried to make a Kingdom Hearts-esque action game with light Final Fantasy elements, but never chose a direction. And we're left with the peices of what could have been.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played the launch version and I actually really love the characters but the gameplay even in this \"complete\" version is super repetitive and there a lot of issue with the story, like the fact the whole story is split between the game, some movies and an anime.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was unique. Overall, I enjoyed the open world aspects and put in a lot of hours but once it went onto rails then my mind went the opposite direction and hated the design and how everything had a \"thing\" with the story components during key segments.\r\n\r\n5/10. OK. Something to purchase on sale. But, a no from me, chief.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm playing this for the \"bromance\" story and will never touch again.  It's mechanically a MONSTER.  Stay away unless you want to be part of a FF boy band.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The end of this game is s poorly planned boss rush that doesn't prepare you in the slightest. Prepare to get soft locked right before the very end of the game with no apologies. Boys club car ride was fun, story was very ham fisted and rushed in the last 20% of the game. Do not buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool! An open world! I have a car! But I can't drive it? Except at night (but I'm not supposed to be out at night). OK? Sooo I'm basically on a railway, telling my friend to take me from point A to point B, which takes 1 to 4 minutes depending on the destination (or I guess I can pay some money to instant travel? wtf?) So I tell my buddy to go to our next quest, but stop on the way, so I can pick up the contents of a chest indicated on the map (fade out to get out of the car) I loot the chest. Cool, some new equipment! I have to equip its content, so I go through 4 menus to do that. Let's go back to the car. A group of mobs attacks me on the way; I now go through a slow, tedious and confusing fight. Done! Then some hidden dude calls for help once, which makes a quest appear in my quest log that says I have to find him. Where is he? He only called once, and I have nothing more than a vague location to look for him. Oh, here he is; it's the same dude as last time? Ok well anyway, I give him a potion (fade out to talk to him, another one to give him a potion, quest validated, that plays an animation that takes another 10 seconds or so before I can press A so the quest actually ends, fade out). Finally, I'm done with this. Let's go back to the car! (fade out to get in the car) Alright, still another 3 minutes of trip to get to my destination. Can I pick the radio station? Oh, no, I can't even play an in-game album or radio. I have to manually go through each track, and there's no random mode. No conversations in the car to pass the time either, I can look at the scenery or at the map. Greeeat. We finally arrive, but you know, now it's night. My buddy tells me we shouldn't leave for the next objevtive, we should rent a bed at the inn to go to sleep because going out at night is too dangerous? Aren't we warriors or something? Oh, and by the way, my fuel tank is empty, too: I have to go through 3 fade outs and a cutscene to fill it before I go to bed. How FUN.\n\nThat's the core gameplay loop, topped with a tedious, confusing and, from what I gathered, simply boring combat. The UI is not designed, it's put together, with bits and pieces that don't fit together and make every single step of the game tedious. It looks like whoever designed that game forgot to play it, and whoever played it forgot that a game is supposed to be fun.\n\nOn the plus side, the world seems really interesting; artistic direction, graphics and music are beautiful. But it's really not enough to compensate for that boring gameplay, and I have played other FF games before.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "NOPE. No reason to put Denuvo in a single player game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Disaster. Waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "good game\nbad optimisation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't waste your money on this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yea, nah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Denuvo.\nDenuvo allows a game to run on 5 different system in a timespan of 24 hours. Do NOT fiddle around with proton versions because each version is considered ONE device and you will get this error:\n\"The server is not reachable, check your Internet connection and click \"Retry\"\" - locking you out of playing the game for 24 hours.\n\nPlease remove Denuvo, it causes more problems than it fixes.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I normally don't write long reviews but when I read other reviews of Final Fantasy XV Windows Edition, I found some resonance with my own experience.\n\nI initially had mixed feelings about Final Fantasy XV, finding some enjoyable elements despite notable flaws. However, after sinking more hours into this game, I'm revising my opinion to [b]mostly negative[/b]. What started as minor annoyances have revealed themselves to be fundamental design problems that make this game more of a chore than an adventure.\n\n[h2]The Day-Night Cycle[/h2]\n\nThe day-night cycle remains one of my biggest frustrations. It feels artificially restrictive. I spend half my time just traveling around, and by the time I complete two or three missions, darkness falls and forces me back to camp. This constant interruption kills any sense of momentum or flow. It really feels like being punished to continue to play the game for more than 50 mins at a time. \n\nThe 30-minute real-time cycle for a full day might sounds like a lot, but due to the catastrophic travel system, which simply doesn't give you enough time to accomplish meaningful exploration or quest chains.\n\n[h2]Side Quests, A Complete Lack of Imagination[/h2]\n\nWhat I initially described as \"everywhere but skippable\" has revealed itself to be something far worse—a complete [b]lack of imagination[/b]. Every NPC delivers endless, repetitive, almost exactly the same side quests. Catching red frogs, then yellow frogs, then whatever color frogs. Collecting potatoes, then onions, beans, then whatever vegetables. Even the cutscenes and animations are EXACTLY IDENTICAL.\n\nThe quest design is deliberately obscured too—some collectibles are hidden in bushes with absolutely no visual or audio clues. Oh, and did I mention that you have to watch those cutscenes AGAIN AND AGAIN BECAUSE THEY ARE UNSKIPPABLE! They don't even bother to create new stories for NPCs; they just label missions \"Help XXX doing YYY AGAIN.\" 99% of the game's sidequests feel like filler, consisting of nothing more than fetching vegetables, gems, or dog tags with zero narrative substance.\n\n[h2]Travel System[/h2]\n\nThe travel mechanics remain a mixed bag with persistent issues. You can teleport to parking spots or use autopilot to quest markers, but the map constantly resets to your current location when switching modes. This makes simple tasks—like picking a nearby parking lot, teleporting there, and walking to the mission point—unnecessarily complicated. Ironically, this manual approach is usually faster than the autopilot system, which speaks to how poorly the convenience features are implemented.\n\n[h2]Maze Design[/h2]\n\nThe dungeon and maze design represents another major failure. If you fall off a narrow ledge, you're forced to climb all the way back, then squeeze through a crevice WITH ANOTHER LONG UNSKIPPABLE CUTSCENE, only to fall at another cliff and repeat this tedious process.\n\nIf I have to give it a score, it would be a [b]3/10[/b]. Beautiful visuals and decent combat can't save this from being a fundamentally flawed experience.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The combat is complete rubbish. You can't tell what's going on and it doesn't seem to get any better. Just grapple high, then hit things. Over, and over, and over... What happened to the actual rpg character building elements of the game? It appear SE has decided that final fantasy is now an action RPG rather than focusing on game elements that made the series popular. Oh but wait, you can take selfies everywhere! and post them! WOW! that's what I'm playing Final Fantasy for! Sorry SE but you did a fantastic blend of traditional turn based rpg and action RPG with FF 12 and ever since then your combat system as gone down hill. Oh, so has the story.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Final Fantasy XV Stuttering Edition powered by Denuvo Anti-Tamper.\nI Remember playing this game on PS4 in 2017 without problems, on PC stuttering every 4 seconds with a 9950X3d & 5080",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Besides a really convoluted plot and questionable game design choices, maybe the real Final Fantasy XV were the friends we made along the way.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "(SPOILERS) Final Fantasy XV is such a frustrating game because you want it so badly to be a great game, but it's so frustratingly mediocre and directionless that after playing it for about 13 hours, I had to put it down.\n\nThe first 2 hours of the game are nothing less than amazing, you are introduced to 4 characters through a dialogue oozing with chemistry, and are shown an open world that leaves so much to the imagination. The sprawling landscapes and beautiful views that bring you to say: \"wow, this world is beautiful, I can't wait to see what comes next.\"\n\nThose first 2 hours were the best hours of the game, and it wasn't even close.\n\nThen comes the big twist in the story: the city in which you start the game in is taken under siege by the evil faction in the game, and your father, king Regis, is killed in the onslaught. Our main character, Noctis, is obviously devastated by this. The news comes out of nowhere, for both the player and the characters, and hits him like a truck; but I hadn't had a single emotional connection with the city or the late king, I hadn't even remembered their names before I looked them up on wikipedia. I had no attachment to the inciting incident of the game, because all I knew of the city and person that were destroyed was encompassed all in a three or four minute cutscene at the beginning of the game.\n\nThen comes the fact that the game cannot decide what tone it is trying to go for. Does it want to be a coming-of-age-story of 4 close friends exploring the world and having fun moments with each other? Or does it want to be a serious narrative about the fall of an empire and how that impacts people? Final Fantasy 15 decides to be some weird mix of the two, with seemingly heavy and emotional moments being interjected by one of the characters wanting to go see chocobos. More offensive, however, was when a character left your party for a reason he left unexplained, seemingly going on some great task that he needed to do. A few minutes after he finally reunites with your party, he grabs your attention and you're expecting him to talk about whatever task he felt so obligated to do or at least some comment about how he's feeling, and instead of doing anything like that, he gushes about the (sponsored!) cup-noodles that he loves so much. \n\nIt's not the moment itself that struck me, moreso that there are so many moments like that, where I am internally begging for the game to characterize these people on a deeper level, but it can't decide on what tone it wants to stick with, so any real development of these characters are just interrupted by 'funny haha' moments that bring anything serious to a complete halt.\n\nLike I said, I can excuse a rough story if the gameplay is good enough, but after 12 hours, I genuinely can't find any more fun in this game.\n\nThe world is easily the strongest part of the game. There were views while I was driving in which the characters had dialogue something along the lines of \"look at that view! it's amazing!\", and they were right, the world in this game is beautiful and for the first few hours I was gawking at everything I was seeing. It carried me through my playthrough and was the only thing that beckoned me to explore the world, but a world so large had so little to do inside of it. 99 out of a 100 times, the only content of the open world I could find were fetch quests-- kill these 5 monsters, go get this item and bring it back to me. There was nothing to do in a world brimming with potential. The only memorable quest I had was going to the chocobo ranch, and finding out that there was a monster scaring off the chocobos. The spectacle alone of the time building up to finally finding that monster, seeing its sheer size as you trail it to its den, and the final fight that wraps it all up, was the single most memorable thing I did in that game.\n\nThe side content itself kept me from exploring the world, as when I tried a few of them, they were so boring and uninteresting that I found myself just sticking with the 'hunt' quests, which just had you going to a certain location and killing a few monsters for a couple rewards. After a few hours in the game, I was entirely unmotivated to explore the open world in the open world game in favor of just doing a couple fetch quests until I got what I needed.\n\nThe biggest gripe I have with this game, however, is the combat system. I'm not one for extreme depth in combat, I'm okay with some things, like combos, being simplified for the player; but the extreme length to which the game tightens its leash on you with how dumbed-down the games systems are is incredibly frustrating. There are many smaller problems I have with the combat, but there are two main things: for one, you can win just about any battle by holding left click and shift, as the game will both auto-target the enemies on your screen and also automatically perform combos entirely out of your own control, taking any agency you could possibly have out of your own battles, you're basically just watching someone else play the game for you. Second, you'll never lose a battle in your life because the healing system is so unbalanced that you can brave any fight through sheer force of potion-spamming, because the game both gives you invulnerability when you've been knocked down AND pauses when you enter item-select so you have all the time in the world to select a healing potion which can put you right back into the fight. This action RPG has no real action, you're just watching people fight while barely having any input of your own. It's a test to see how long you can wait until the fight finally ends after spamming potions and holding two buttons, because the chance of you dying is nonzero, but it's so low that it may as well be nonexistent.  \n\nI really wanted to like this game. It was my second final fantasy game, I played the first one after the collection was on sale, and it had so much promise, but I found myself losing all interest in continuing before I could even finish the game. If you want an Action RPG with a developed and interesting world, play Elden Ring, not this.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Refunded, bro it's 2025 and this game not only won't let you remap your controls but when you go look at the control schemes it's all for controller? I don't have bumper and trigger buttons on my mouse and keyboard, for the \"Windows Edition\". This is ridiculous in this day and age.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad port.. the minimum requiriments are wrong, you cant play without stuttering unless you have a cpu 6/12\nTAA has bad implementation in this game.. the game is good but the port is bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the first final fantasy game i ever played and it left such a bad aftertaste i became reluctant to try the other entries. I managed to convince myself to try ff10 tho and after just one hour of playing ff10 i can confidently say that this game is dogsh1t. U cannot convince me that this game is enjoyable bcs story-wise it feels rlly bland, u don’t rlly bond enough with the characters to feel anything when sth huge happens. as for the combat, it feels too easy like the game doesn’t even feel challenging at all, even when the big monsters come at night i never rlly die so it feels unearned. Also isn’t this supposed to be an open world game? Where’s the world design?? Most of it is just long roads, grass, rocks, and mountains like what do u even want me to explore.. and must i talk about the ruins? they’re so plain and uninteresting it pains me to be there even for lore purposes. Idk how many more hours i need to invest in this game for it to be “enjoyable” but i really gotta give it to this game for giving me 18 hours of boredom.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cannot recommend this game due to the constant crashing anytime you want to minimize the game. It would be very nice when you have multiple monitors to be able to minimize your game and use your other monitor to check a guide or use an interactive map to see the world but this game suffers horribly from crashing anytime you want to change something that every other game does flawlessly. Minimize your game? Crash. Change the game from fullscreen to borderless or non? Crash. Let's not also mention that every time you load your game your mouse will be perfectly visible on screen and no matter what google or anyone tells you, you cannot get it to go away. So if you have multiple monitors, your mouse will just end up moving to one of your other monitors as you play the game and as you click and move your character will just randomly stop attacking because your cursor has migrated to another monitor as you played. These are simple things that should have been fixed 7 years ago. Oh its simple everyone says, use the F1 trick.. trash, doesn't work. Update your drivers.. Trash, doesnt work. Play in borderless instead of fullscreen. Trash doesnt work. Download and use Special K to do something the game should have already done for you? Nope trash doesnt work. Its a potentially Great game which is unplayable depending on how unlucky you were when your computer was built with the components it was built with.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boy band on world (saving) tour! \nHonestly, best! What else could you ever ask of a game. \nOh right. Less repetetive phrases. And a button to kill the Chocobo music. And exterminate a lot of characters.\nTurns out I'm not into... certain fanservice. Oops.\nBut: Gackt! \nWhy did I only realize this in chapter 15? And why was the game over before I fully enjoyed the fact?\nAND WHAT GAME NEEDS 5 ENDBOSS FIGHTS?!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If there was a middle between yes and no I would rate it that instead, but if I had to lean a certain direction, it is no. It's not a proper final fantasy title to me, the combat is boring and overly simple. I find the 4 main characters to be not very likeable either. It's quite weak overall.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for 29 hours before the crashes reached a point where I cannot progress. I think the issue is related to the rain, because most crashes happen with the rain. But chapter 5, where it's raining? Crash out in minutes. Was shaping up to be a great game. Sad I'll have to wait until something changes. I have a ROG computer that I bought only a couple of months ago. I had a similar issue with Tales of Zestria. Had to wait over a year before things resolved. How are more people not having this problem? Cannot currently recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game in 2019 and only played for 57 minutes. I cant get into it. When your group of characters looks like a K-pop group of wanna be punk rock posers who are concerned about looking pretty, it is hard to take any of the drama in the game seriously.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played many action RPGs, including Soulslike games, Monster Hunter, Devil May Cry — you name it. But I have never experienced combat this frustrating. And no, it’s not “mashy.” The problem is that you're constantly getting one-shotted, and enemy attack patterns are either so poorly telegraphed or outright random that half the time you just die to something you literally cannot see coming.\n\nEvery enemy in this game feels harder than an actual Dark Souls boss — not because they’re well designed or mechanically interesting, but because the timing of their attacks is bizarre and inconsistent. Sometimes they hesitate. Sometimes they chain attacks with zero gaps. Sometimes you dodge and get hit anyway because… reasons? And reading enemy animations? Forget it. Some attacks blend so much into the environment or character models that you only notice them when you’re already dead.\n\nAnd as if that wasn’t bad enough: the camera.\nWorst part of the whole experience. It clips through walls, zooms into Noctis’ spine, gets stuck under enemies, or just randomly decides to point at the sky like it’s admiring the scenery instead of showing you the thing that’s about to murder you.\n\nCombat feels less like skill and more like praying RNG doesn’t screw you.\n\nThe frustrating thing is: the game looks great. The story is emotional, the world feels alive, and there’s clearly passion behind it. But everything outside of that — performance issues, the awful camera, the completely chaotic combat system, and the constant feeling of being punished for things you can’t control — overshadows all the good parts.\n\nWould I recommend it?\nYeah. If you hate yourself and need a new source of frustration.\n\nOtherwise? Watch the cutscenes on YouTube. It’s the better experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Final Fantasy is just kinda average. It’s not bad, but I don’t really have anything great to say about it either. Honestly, it’s one of the first games in the series where I enjoyed the side quests more than the main story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really do enjoy this game. Played it years ago and I've been wanting to replay it. Everything was going really well, but once I finished the boss fight at the end of chapter 2 my game just keeps crashing. I've tried everything I could find on the internet and nothing worked. It's a real shame cause I really wanted to play this again but with mods. It was amazing and I had a lot of fun in the beginning. But after spending almost all day trying get things fixed nothing worked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't play this game without it turning off my computers internet. For a while I was able to get around it by just turning my router on/off for 30 seconds, but now that doesn't work either and it just keeps turning off. And I can't request a refund anymore, because I've played longer than an hour. So what am I to do? I've spent money on a game I can't play because it doesn't save progress to steam once the internet goes out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I found out this game had a movie and an anime after playing this for as long as i did.  I might have bonded with the characters more if I saw them I guess? I personally hate the traveling in this game its most of this game. I really tried cause I heard nothing but good things about this game but its a no for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While this isn't my favorite, its still sorta enjoyable. Combat is very button mashy. The music is very forgettable and mostly relies on pulling nostalgic riffs from previous games. The story is nowhere near the quality of FFX. Magic spells have a crafting system, which i find time consuming having to absorb magicka from the nodes, and then craft them, and then go through your party equipping them.\n\nThen there's the whole car obsession, which quickly wears its welcome real fast. Since the game has a lot of back and forth travel, you're constantly thinking of how you can warp back to your car to save yourself time. While driving at night you randomly get pulled over by enemies forcing you to get out, and then get back in so you can drive off.\n\nCant forget the Camp system. Each party member has their own focus: fishing, survival, cooking, photography. You're constantly having to setup camp to level up, buff up with food just like in Monster Hunter, and skip thru the photographs nobody cares about.\n\nWhats good about the game then? Nothing really stands out aside from the animations and graphics. The skill system is kinda good, there's a handful of skill trees that each offer something unique to one aspect of the game, giving you alot of possibility. The button mashy combat is also kinda good when you just want to beat the crap out of enemies with the lowest amount of care. Its legit the most braindead combat system ever. The only time its ever engaging is when you fight a enemy 30 levels higher than you.\n\nI don't believe there is such a thing as a bad Final Fantasy, but FF15 is more flash than substance. I would never recommend it over FFX or FFXII.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What I Liked:\n⦁ interesting premise\n⦁ beautiful open world\t\n\nWhat I Didn’t Like:\n⦁ awful, boring combat\n⦁ empty open world\n⦁ extremely repetitive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is no polite way to say it, this game is a mess from start to end. Issues begin to arise as soon as you start the tutorial. The combat in this game just isn’t good. I really tried to like it, but it feels like shit. You hold down the attack button and the dodge button and your character just does stuff. It isn’t fun or interesting in the slightest. The way magic works in this game made barely any sense, so I just never interacted with that system after trying it once. It also took me a while to realize that I could unlock skills to play as the other party members in combat, but Gladiolus and Prompto feel terrible to play and Ignis just felt weak compared to Noctis. I am not a modern FF hater, but if this is what we killed turn based for, I can understand why people are mad about the shift.\n\nThe actual combat is just the tip of the iceberg though. Why is this game open world? I think even if you asked the actual developers, they wouldn’t be able to give a good reason. Not only is this world boring as all hell to explore, but it manages to be tedious as fuck too. Anytime you get a quest or start a hunt, you better hope that the location happens to be next to a fast travel point. If not you get to sit in the stupid fucking car while it automatically drives you there. Waiting four minutes with your hands off the controller sounds fun to you? Well fuck you idiot because you just so happened to start the quest while it was turning night, so now you get stopped every few seconds to do a fight against a giant piece of shit who outlevels you like crazy early game. Luckily, it's not like this guy is hard, he's just fat as shit. You got that, beat him up! Think again dumbass because while you were in the seven minute fight against this boring enemy with the garbage combat, the devs thought it would be funny if they dropped a plane full of enemy soldiers on you. Now that seven minute fight is a twelve minute one! Better hope they don’t do that twice since that can happen for some reason. \n\nYou finally did it though, you managed to make it to your quest location and can get to business! These quests are so bad that you are going to wish you never made it in the first place. I’ve played a lot of open world games where they fill up the map with boring side quests, but you can at least expect a few of them to be good. I can’t say that a single one of the quests I did were even decent. Imagine if every quest was a radiant Skyrim quest. That's what it's like except at least those might bring you into a cool dungeon or something. THESE QUESTS ARE JUST ASS!!!!! Go pick up dogtags. Go collect frogs. Go kill this group of enemies. Repeat over and over until you give up and completely stop doing them.\n\nThe story is actually pretty cool. Too bad they managed to fuck that up too because to actually experience the entire story, you’ll have to go through things outside of this game. You are actually missing out on important things if you only go through the game. Ignis gets hurt in a major way and I had to take a step back and watch a YouTube video to try and figure out what the hell happened to him because the game just goes to the next chapter like it's nothing. Turns out they expect you to play through his DLC at that moment to understand what happened. Hold your horses though moron! Before you go ahead and play that DLC at that moment, watch out because it spoils the ending of the game if you do it. Like what the fuck? I’d call this next part a major spoiler, but it barely affects the story. Lunafreya died and I sat there wondering if Noctis gave a shit because they barely interacted in the story. It was a nice enough scene, but I was actually caught off guard when Noctis was depressed for the next couple chapters.\n\nComrades DLC is just butt, don’t play it.\n\nAll in all, I would not recommend playing this game. The story is a mess and the gameplay definitely does not make up for it. The only positive thing I can say is that the interaction between the party members is kinda nice. Play something else.\n\n2/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Driving in this game is just torturing. I don't even catch the slightest vibe of relaxation when driving, but the game designers seem put so much effort on it trying to impress players. This game is a huge let-down.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game kind of sucks...in almost everyway.\n\nThis game's combat is so so boring and unreadable, enemies backhand you with one shots, or you don't get hit because you hold down a button to dodge. Why do I get one shotted?, because I was underleveled. Why was I under leveled? Because I don't didn't do too many sidequests. Why didn't I do sidequests? Because I didn't want to traverse the giant, empty map that is filled with looooong inpassible walls to hunt or fetch more shit, or fight monsters with this games shitass combat system.\n\nEven barring all of the above, this game's story has some nuance but bascially boils down to the Backstreet Boys suicide-bomb the darkness with light by the end. Not that you'd know about any of this nuance considering most of it comes as a result of outside media or DLC that launched after the fact, because japanese developers don't have the restraint to pace their stories properly, even when you give them 10 FUCKING YEARS! \n\nThe one and only redeeming quality to this game is Noctis' companions, they are very well fleshed out and performed.\n\nIt's like they tried to make a Kingdom Hearts-esque action game with light Final Fantasy elements, but never chose a direction. And we're left with the peices of what could have been.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was unique. Overall, I enjoyed the open world aspects and put in a lot of hours but once it went onto rails then my mind went the opposite direction and hated the design and how everything had a \"thing\" with the story components during key segments.\r\n\r\n5/10. OK. Something to purchase on sale. But, a no from me, chief.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm playing this for the \"bromance\" story and will never touch again.  It's mechanically a MONSTER.  Stay away unless you want to be part of a FF boy band.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The end of this game is s poorly planned boss rush that doesn't prepare you in the slightest. Prepare to get soft locked right before the very end of the game with no apologies. Boys club car ride was fun, story was very ham fisted and rushed in the last 20% of the game. Do not buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initially interesting but then goes from open world to a walking simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool! An open world! I have a car! But I can't drive it? Except at night (but I'm not supposed to be out at night). OK? Sooo I'm basically on a railway, telling my friend to take me from point A to point B, which takes 1 to 4 minutes depending on the destination (or I guess I can pay some money to instant travel? wtf?) So I tell my buddy to go to our next quest, but stop on the way, so I can pick up the contents of a chest indicated on the map (fade out to get out of the car) I loot the chest. Cool, some new equipment! I have to equip its content, so I go through 4 menus to do that. Let's go back to the car. A group of mobs attacks me on the way; I now go through a slow, tedious and confusing fight. Done! Then some hidden dude calls for help once, which makes a quest appear in my quest log that says I have to find him. Where is he? He only called once, and I have nothing more than a vague location to look for him. Oh, here he is; it's the same dude as last time? Ok well anyway, I give him a potion (fade out to talk to him, another one to give him a potion, quest validated, that plays an animation that takes another 10 seconds or so before I can press A so the quest actually ends, fade out). Finally, I'm done with this. Let's go back to the car! (fade out to get in the car) Alright, still another 3 minutes of trip to get to my destination. Can I pick the radio station? Oh, no, I can't even play an in-game album or radio. I have to manually go through each track, and there's no random mode. No conversations in the car to pass the time either, I can look at the scenery or at the map. Greeeat. We finally arrive, but you know, now it's night. My buddy tells me we shouldn't leave for the next objevtive, we should rent a bed at the inn to go to sleep because going out at night is too dangerous? Aren't we warriors or something? Oh, and by the way, my fuel tank is empty, too: I have to go through 3 fade outs and a cutscene to fill it before I go to bed. How FUN.\n\nThat's the core gameplay loop, topped with a tedious, confusing and, from what I gathered, simply boring combat. The UI is not designed, it's put together, with bits and pieces that don't fit together and make every single step of the game tedious. It looks like whoever designed that game forgot to play it, and whoever played it forgot that a game is supposed to be fun.\n\nOn the plus side, the world seems really interesting; artistic direction, graphics and music are beautiful. But it's really not enough to compensate for that boring gameplay, and I have played other FF games before.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "NOPE. No reason to put Denuvo in a single player game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "good game\nbad optimisation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The boys are out of town! The boys are out of town!\n\nDenuvo Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disaster. Waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't waste your money on this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yea, nah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Denuvo.\nDenuvo allows a game to run on 5 different system in a timespan of 24 hours. Do NOT fiddle around with proton versions because each version is considered ONE device and you will get this error:\n\"The server is not reachable, check your Internet connection and click \"Retry\"\" - locking you out of playing the game for 24 hours.\n\nPlease remove Denuvo, it causes more problems than it fixes.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I normally don't write long reviews but when I read other reviews of Final Fantasy XV Windows Edition, I found some resonance with my own experience.\n\nI initially had mixed feelings about Final Fantasy XV, finding some enjoyable elements despite notable flaws. However, after sinking more hours into this game, I'm revising my opinion to [b]mostly negative[/b]. What started as minor annoyances have revealed themselves to be fundamental design problems that make this game more of a chore than an adventure.\n\n[h2]The Day-Night Cycle[/h2]\n\nThe day-night cycle remains one of my biggest frustrations. It feels artificially restrictive. I spend half my time just traveling around, and by the time I complete two or three missions, darkness falls and forces me back to camp. This constant interruption kills any sense of momentum or flow. It really feels like being punished to continue to play the game for more than 50 mins at a time. \n\nThe 30-minute real-time cycle for a full day might sounds like a lot, but due to the catastrophic travel system, which simply doesn't give you enough time to accomplish meaningful exploration or quest chains.\n\n[h2]Side Quests, A Complete Lack of Imagination[/h2]\n\nWhat I initially described as \"everywhere but skippable\" has revealed itself to be something far worse—a complete [b]lack of imagination[/b]. Every NPC delivers endless, repetitive, almost exactly the same side quests. Catching red frogs, then yellow frogs, then whatever color frogs. Collecting potatoes, then onions, beans, then whatever vegetables. Even the cutscenes and animations are EXACTLY IDENTICAL.\n\nThe quest design is deliberately obscured too—some collectibles are hidden in bushes with absolutely no visual or audio clues. Oh, and did I mention that you have to watch those cutscenes AGAIN AND AGAIN BECAUSE THEY ARE UNSKIPPABLE! They don't even bother to create new stories for NPCs; they just label missions \"Help XXX doing YYY AGAIN.\" 99% of the game's sidequests feel like filler, consisting of nothing more than fetching vegetables, gems, or dog tags with zero narrative substance.\n\n[h2]Travel System[/h2]\n\nThe travel mechanics remain a mixed bag with persistent issues. You can teleport to parking spots or use autopilot to quest markers, but the map constantly resets to your current location when switching modes. This makes simple tasks—like picking a nearby parking lot, teleporting there, and walking to the mission point—unnecessarily complicated. Ironically, this manual approach is usually faster than the autopilot system, which speaks to how poorly the convenience features are implemented.\n\n[h2]Maze Design[/h2]\n\nThe dungeon and maze design represents another major failure. If you fall off a narrow ledge, you're forced to climb all the way back, then squeeze through a crevice WITH ANOTHER LONG UNSKIPPABLE CUTSCENE, only to fall at another cliff and repeat this tedious process.\n\nIf I have to give it a score, it would be a [b]3/10[/b]. Beautiful visuals and decent combat can't save this from being a fundamentally flawed experience.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The combat is complete rubbish. You can't tell what's going on and it doesn't seem to get any better. Just grapple high, then hit things. Over, and over, and over... What happened to the actual rpg character building elements of the game? It appear SE has decided that final fantasy is now an action RPG rather than focusing on game elements that made the series popular. Oh but wait, you can take selfies everywhere! and post them! WOW! that's what I'm playing Final Fantasy for! Sorry SE but you did a fantastic blend of traditional turn based rpg and action RPG with FF 12 and ever since then your combat system as gone down hill. Oh, so has the story.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Final Fantasy XV Stuttering Edition powered by Denuvo Anti-Tamper.\nI Remember playing this game on PS4 in 2017 without problems, on PC stuttering every 4 seconds with a 9950X3d & 5080",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Besides a really convoluted plot and questionable game design choices, maybe the real Final Fantasy XV were the friends we made along the way.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "(SPOILERS) Final Fantasy XV is such a frustrating game because you want it so badly to be a great game, but it's so frustratingly mediocre and directionless that after playing it for about 13 hours, I had to put it down.\n\nThe first 2 hours of the game are nothing less than amazing, you are introduced to 4 characters through a dialogue oozing with chemistry, and are shown an open world that leaves so much to the imagination. The sprawling landscapes and beautiful views that bring you to say: \"wow, this world is beautiful, I can't wait to see what comes next.\"\n\nThose first 2 hours were the best hours of the game, and it wasn't even close.\n\nThen comes the big twist in the story: the city in which you start the game in is taken under siege by the evil faction in the game, and your father, king Regis, is killed in the onslaught. Our main character, Noctis, is obviously devastated by this. The news comes out of nowhere, for both the player and the characters, and hits him like a truck; but I hadn't had a single emotional connection with the city or the late king, I hadn't even remembered their names before I looked them up on wikipedia. I had no attachment to the inciting incident of the game, because all I knew of the city and person that were destroyed was encompassed all in a three or four minute cutscene at the beginning of the game.\n\nThen comes the fact that the game cannot decide what tone it is trying to go for. Does it want to be a coming-of-age-story of 4 close friends exploring the world and having fun moments with each other? Or does it want to be a serious narrative about the fall of an empire and how that impacts people? Final Fantasy 15 decides to be some weird mix of the two, with seemingly heavy and emotional moments being interjected by one of the characters wanting to go see chocobos. More offensive, however, was when a character left your party for a reason he left unexplained, seemingly going on some great task that he needed to do. A few minutes after he finally reunites with your party, he grabs your attention and you're expecting him to talk about whatever task he felt so obligated to do or at least some comment about how he's feeling, and instead of doing anything like that, he gushes about the (sponsored!) cup-noodles that he loves so much. \n\nIt's not the moment itself that struck me, moreso that there are so many moments like that, where I am internally begging for the game to characterize these people on a deeper level, but it can't decide on what tone it wants to stick with, so any real development of these characters are just interrupted by 'funny haha' moments that bring anything serious to a complete halt.\n\nLike I said, I can excuse a rough story if the gameplay is good enough, but after 12 hours, I genuinely can't find any more fun in this game.\n\nThe world is easily the strongest part of the game. There were views while I was driving in which the characters had dialogue something along the lines of \"look at that view! it's amazing!\", and they were right, the world in this game is beautiful and for the first few hours I was gawking at everything I was seeing. It carried me through my playthrough and was the only thing that beckoned me to explore the world, but a world so large had so little to do inside of it. 99 out of a 100 times, the only content of the open world I could find were fetch quests-- kill these 5 monsters, go get this item and bring it back to me. There was nothing to do in a world brimming with potential. The only memorable quest I had was going to the chocobo ranch, and finding out that there was a monster scaring off the chocobos. The spectacle alone of the time building up to finally finding that monster, seeing its sheer size as you trail it to its den, and the final fight that wraps it all up, was the single most memorable thing I did in that game.\n\nThe side content itself kept me from exploring the world, as when I tried a few of them, they were so boring and uninteresting that I found myself just sticking with the 'hunt' quests, which just had you going to a certain location and killing a few monsters for a couple rewards. After a few hours in the game, I was entirely unmotivated to explore the open world in the open world game in favor of just doing a couple fetch quests until I got what I needed.\n\nThe biggest gripe I have with this game, however, is the combat system. I'm not one for extreme depth in combat, I'm okay with some things, like combos, being simplified for the player; but the extreme length to which the game tightens its leash on you with how dumbed-down the games systems are is incredibly frustrating. There are many smaller problems I have with the combat, but there are two main things: for one, you can win just about any battle by holding left click and shift, as the game will both auto-target the enemies on your screen and also automatically perform combos entirely out of your own control, taking any agency you could possibly have out of your own battles, you're basically just watching someone else play the game for you. Second, you'll never lose a battle in your life because the healing system is so unbalanced that you can brave any fight through sheer force of potion-spamming, because the game both gives you invulnerability when you've been knocked down AND pauses when you enter item-select so you have all the time in the world to select a healing potion which can put you right back into the fight. This action RPG has no real action, you're just watching people fight while barely having any input of your own. It's a test to see how long you can wait until the fight finally ends after spamming potions and holding two buttons, because the chance of you dying is nonzero, but it's so low that it may as well be nonexistent.  \n\nI really wanted to like this game. It was my second final fantasy game, I played the first one after the collection was on sale, and it had so much promise, but I found myself losing all interest in continuing before I could even finish the game. If you want an Action RPG with a developed and interesting world, play Elden Ring, not this.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Refunded, bro it's 2025 and this game not only won't let you remap your controls but when you go look at the control schemes it's all for controller? I don't have bumper and trigger buttons on my mouse and keyboard, for the \"Windows Edition\". This is ridiculous in this day and age.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad port.. the minimum requiriments are wrong, you cant play without stuttering unless you have a cpu 6/12\nTAA has bad implementation in this game.. the game is good but the port is bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the first final fantasy game i ever played and it left such a bad aftertaste i became reluctant to try the other entries. I managed to convince myself to try ff10 tho and after just one hour of playing ff10 i can confidently say that this game is dogsh1t. U cannot convince me that this game is enjoyable bcs story-wise it feels rlly bland, u don’t rlly bond enough with the characters to feel anything when sth huge happens. as for the combat, it feels too easy like the game doesn’t even feel challenging at all, even when the big monsters come at night i never rlly die so it feels unearned. Also isn’t this supposed to be an open world game? Where’s the world design?? Most of it is just long roads, grass, rocks, and mountains like what do u even want me to explore.. and must i talk about the ruins? they’re so plain and uninteresting it pains me to be there even for lore purposes. Idk how many more hours i need to invest in this game for it to be “enjoyable” but i really gotta give it to this game for giving me 18 hours of boredom.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cannot recommend this game due to the constant crashing anytime you want to minimize the game. It would be very nice when you have multiple monitors to be able to minimize your game and use your other monitor to check a guide or use an interactive map to see the world but this game suffers horribly from crashing anytime you want to change something that every other game does flawlessly. Minimize your game? Crash. Change the game from fullscreen to borderless or non? Crash. Let's not also mention that every time you load your game your mouse will be perfectly visible on screen and no matter what google or anyone tells you, you cannot get it to go away. So if you have multiple monitors, your mouse will just end up moving to one of your other monitors as you play the game and as you click and move your character will just randomly stop attacking because your cursor has migrated to another monitor as you played. These are simple things that should have been fixed 7 years ago. Oh its simple everyone says, use the F1 trick.. trash, doesn't work. Update your drivers.. Trash, doesnt work. Play in borderless instead of fullscreen. Trash doesnt work. Download and use Special K to do something the game should have already done for you? Nope trash doesnt work. Its a potentially Great game which is unplayable depending on how unlucky you were when your computer was built with the components it was built with.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boy band on world (saving) tour! \nHonestly, best! What else could you ever ask of a game. \nOh right. Less repetetive phrases. And a button to kill the Chocobo music. And exterminate a lot of characters.\nTurns out I'm not into... certain fanservice. Oops.\nBut: Gackt! \nWhy did I only realize this in chapter 15? And why was the game over before I fully enjoyed the fact?\nAND WHAT GAME NEEDS 5 ENDBOSS FIGHTS?!",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If there was a middle between yes and no I would rate it that instead, but if I had to lean a certain direction, it is no. It's not a proper final fantasy title to me, the combat is boring and overly simple. I find the 4 main characters to be not very likeable either. It's quite weak overall.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for 29 hours before the crashes reached a point where I cannot progress. I think the issue is related to the rain, because most crashes happen with the rain. But chapter 5, where it's raining? Crash out in minutes. Was shaping up to be a great game. Sad I'll have to wait until something changes. I have a ROG computer that I bought only a couple of months ago. I had a similar issue with Tales of Zestria. Had to wait over a year before things resolved. How are more people not having this problem? Cannot currently recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game in 2019 and only played for 57 minutes. I cant get into it. When your group of characters looks like a K-pop group of wanna be punk rock posers who are concerned about looking pretty, it is hard to take any of the drama in the game seriously.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve played many action RPGs, including Soulslike games, Monster Hunter, Devil May Cry — you name it. But I have never experienced combat this frustrating. And no, it’s not “mashy.” The problem is that you're constantly getting one-shotted, and enemy attack patterns are either so poorly telegraphed or outright random that half the time you just die to something you literally cannot see coming.\n\nEvery enemy in this game feels harder than an actual Dark Souls boss — not because they’re well designed or mechanically interesting, but because the timing of their attacks is bizarre and inconsistent. Sometimes they hesitate. Sometimes they chain attacks with zero gaps. Sometimes you dodge and get hit anyway because… reasons? And reading enemy animations? Forget it. Some attacks blend so much into the environment or character models that you only notice them when you’re already dead.\n\nAnd as if that wasn’t bad enough: the camera.\nWorst part of the whole experience. It clips through walls, zooms into Noctis’ spine, gets stuck under enemies, or just randomly decides to point at the sky like it’s admiring the scenery instead of showing you the thing that’s about to murder you.\n\nCombat feels less like skill and more like praying RNG doesn’t screw you.\n\nThe frustrating thing is: the game looks great. The story is emotional, the world feels alive, and there’s clearly passion behind it. But everything outside of that — performance issues, the awful camera, the completely chaotic combat system, and the constant feeling of being punished for things you can’t control — overshadows all the good parts.\n\nWould I recommend it?\nYeah. If you hate yourself and need a new source of frustration.\n\nOtherwise? Watch the cutscenes on YouTube. It’s the better experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Final Fantasy is just kinda average. It’s not bad, but I don’t really have anything great to say about it either. Honestly, it’s one of the first games in the series where I enjoyed the side quests more than the main story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really do enjoy this game. Played it years ago and I've been wanting to replay it. Everything was going really well, but once I finished the boss fight at the end of chapter 2 my game just keeps crashing. I've tried everything I could find on the internet and nothing worked. It's a real shame cause I really wanted to play this again but with mods. It was amazing and I had a lot of fun in the beginning. But after spending almost all day trying get things fixed nothing worked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't play this game without it turning off my computers internet. For a while I was able to get around it by just turning my router on/off for 30 seconds, but now that doesn't work either and it just keeps turning off. And I can't request a refund anymore, because I've played longer than an hour. So what am I to do? I've spent money on a game I can't play because it doesn't save progress to steam once the internet goes out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I found out this game had a movie and an anime after playing this for as long as i did.  I might have bonded with the characters more if I saw them I guess? I personally hate the traveling in this game its most of this game. I really tried cause I heard nothing but good things about this game but its a no for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While this isn't my favorite, its still sorta enjoyable. Combat is very button mashy. The music is very forgettable and mostly relies on pulling nostalgic riffs from previous games. The story is nowhere near the quality of FFX. Magic spells have a crafting system, which i find time consuming having to absorb magicka from the nodes, and then craft them, and then go through your party equipping them.\n\nThen there's the whole car obsession, which quickly wears its welcome real fast. Since the game has a lot of back and forth travel, you're constantly thinking of how you can warp back to your car to save yourself time. While driving at night you randomly get pulled over by enemies forcing you to get out, and then get back in so you can drive off.\n\nCant forget the Camp system. Each party member has their own focus: fishing, survival, cooking, photography. You're constantly having to setup camp to level up, buff up with food just like in Monster Hunter, and skip thru the photographs nobody cares about.\n\nWhats good about the game then? Nothing really stands out aside from the animations and graphics. The skill system is kinda good, there's a handful of skill trees that each offer something unique to one aspect of the game, giving you alot of possibility. The button mashy combat is also kinda good when you just want to beat the crap out of enemies with the lowest amount of care. Its legit the most braindead combat system ever. The only time its ever engaging is when you fight a enemy 30 levels higher than you.\n\nI don't believe there is such a thing as a bad Final Fantasy, but FF15 is more flash than substance. I would never recommend it over FFX or FFXII.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What I Liked:\n⦁ interesting premise\n⦁ beautiful open world\t\n\nWhat I Didn’t Like:\n⦁ awful, boring combat\n⦁ empty open world\n⦁ extremely repetitive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is no polite way to say it, this game is a mess from start to end. Issues begin to arise as soon as you start the tutorial. The combat in this game just isn’t good. I really tried to like it, but it feels like shit. You hold down the attack button and the dodge button and your character just does stuff. It isn’t fun or interesting in the slightest. The way magic works in this game made barely any sense, so I just never interacted with that system after trying it once. It also took me a while to realize that I could unlock skills to play as the other party members in combat, but Gladiolus and Prompto feel terrible to play and Ignis just felt weak compared to Noctis. I am not a modern FF hater, but if this is what we killed turn based for, I can understand why people are mad about the shift.\n\nThe actual combat is just the tip of the iceberg though. Why is this game open world? I think even if you asked the actual developers, they wouldn’t be able to give a good reason. Not only is this world boring as all hell to explore, but it manages to be tedious as fuck too. Anytime you get a quest or start a hunt, you better hope that the location happens to be next to a fast travel point. If not you get to sit in the stupid fucking car while it automatically drives you there. Waiting four minutes with your hands off the controller sounds fun to you? Well fuck you idiot because you just so happened to start the quest while it was turning night, so now you get stopped every few seconds to do a fight against a giant piece of shit who outlevels you like crazy early game. Luckily, it's not like this guy is hard, he's just fat as shit. You got that, beat him up! Think again dumbass because while you were in the seven minute fight against this boring enemy with the garbage combat, the devs thought it would be funny if they dropped a plane full of enemy soldiers on you. Now that seven minute fight is a twelve minute one! Better hope they don’t do that twice since that can happen for some reason. \n\nYou finally did it though, you managed to make it to your quest location and can get to business! These quests are so bad that you are going to wish you never made it in the first place. I’ve played a lot of open world games where they fill up the map with boring side quests, but you can at least expect a few of them to be good. I can’t say that a single one of the quests I did were even decent. Imagine if every quest was a radiant Skyrim quest. That's what it's like except at least those might bring you into a cool dungeon or something. THESE QUESTS ARE JUST ASS!!!!! Go pick up dogtags. Go collect frogs. Go kill this group of enemies. Repeat over and over until you give up and completely stop doing them.\n\nThe story is actually pretty cool. Too bad they managed to fuck that up too because to actually experience the entire story, you’ll have to go through things outside of this game. You are actually missing out on important things if you only go through the game. Ignis gets hurt in a major way and I had to take a step back and watch a YouTube video to try and figure out what the hell happened to him because the game just goes to the next chapter like it's nothing. Turns out they expect you to play through his DLC at that moment to understand what happened. Hold your horses though moron! Before you go ahead and play that DLC at that moment, watch out because it spoils the ending of the game if you do it. Like what the fuck? I’d call this next part a major spoiler, but it barely affects the story. Lunafreya died and I sat there wondering if Noctis gave a shit because they barely interacted in the story. It was a nice enough scene, but I was actually caught off guard when Noctis was depressed for the next couple chapters.\n\nComrades DLC is just butt, don’t play it.\n\nAll in all, I would not recommend playing this game. The story is a mess and the gameplay definitely does not make up for it. The only positive thing I can say is that the interaction between the party members is kinda nice. Play something else.\n\n2/10",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Driving in this game is just torturing. I don't even catch the slightest vibe of relaxation when driving, but the game designers seem put so much effort on it trying to impress players. This game is a huge let-down.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game kind of sucks...in almost everyway.\n\nThis game's combat is so so boring and unreadable, enemies backhand you with one shots, or you don't get hit because you hold down a button to dodge. Why do I get one shotted?, because I was underleveled. Why was I under leveled? Because I don't didn't do too many sidequests. Why didn't I do sidequests? Because I didn't want to traverse the giant, empty map that is filled with looooong inpassible walls to hunt or fetch more shit, or fight monsters with this games shitass combat system.\n\nEven barring all of the above, this game's story has some nuance but bascially boils down to the Backstreet Boys suicide-bomb the darkness with light by the end. Not that you'd know about any of this nuance considering most of it comes as a result of outside media or DLC that launched after the fact, because japanese developers don't have the restraint to pace their stories properly, even when you give them 10 FUCKING YEARS! \n\nThe one and only redeeming quality to this game is Noctis' companions, they are very well fleshed out and performed.\n\nIt's like they tried to make a Kingdom Hearts-esque action game with light Final Fantasy elements, but never chose a direction. And we're left with the peices of what could have been.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was unique. Overall, I enjoyed the open world aspects and put in a lot of hours but once it went onto rails then my mind went the opposite direction and hated the design and how everything had a \"thing\" with the story components during key segments.\r\n\r\n5/10. OK. Something to purchase on sale. But, a no from me, chief.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm playing this for the \"bromance\" story and will never touch again.  It's mechanically a MONSTER.  Stay away unless you want to be part of a FF boy band.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The end of this game is s poorly planned boss rush that doesn't prepare you in the slightest. Prepare to get soft locked right before the very end of the game with no apologies. Boys club car ride was fun, story was very ham fisted and rushed in the last 20% of the game. Do not buy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initially interesting but then goes from open world to a walking simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool! An open world! I have a car! But I can't drive it? Except at night (but I'm not supposed to be out at night). OK? Sooo I'm basically on a railway, telling my friend to take me from point A to point B, which takes 1 to 4 minutes depending on the destination (or I guess I can pay some money to instant travel? wtf?) So I tell my buddy to go to our next quest, but stop on the way, so I can pick up the contents of a chest indicated on the map (fade out to get out of the car) I loot the chest. Cool, some new equipment! I have to equip its content, so I go through 4 menus to do that. Let's go back to the car. A group of mobs attacks me on the way; I now go through a slow, tedious and confusing fight. Done! Then some hidden dude calls for help once, which makes a quest appear in my quest log that says I have to find him. Where is he? He only called once, and I have nothing more than a vague location to look for him. Oh, here he is; it's the same dude as last time? Ok well anyway, I give him a potion (fade out to talk to him, another one to give him a potion, quest validated, that plays an animation that takes another 10 seconds or so before I can press A so the quest actually ends, fade out). Finally, I'm done with this. Let's go back to the car! (fade out to get in the car) Alright, still another 3 minutes of trip to get to my destination. Can I pick the radio station? Oh, no, I can't even play an in-game album or radio. I have to manually go through each track, and there's no random mode. No conversations in the car to pass the time either, I can look at the scenery or at the map. Greeeat. We finally arrive, but you know, now it's night. My buddy tells me we shouldn't leave for the next objevtive, we should rent a bed at the inn to go to sleep because going out at night is too dangerous? Aren't we warriors or something? Oh, and by the way, my fuel tank is empty, too: I have to go through 3 fade outs and a cutscene to fill it before I go to bed. How FUN.\n\nThat's the core gameplay loop, topped with a tedious, confusing and, from what I gathered, simply boring combat. The UI is not designed, it's put together, with bits and pieces that don't fit together and make every single step of the game tedious. It looks like whoever designed that game forgot to play it, and whoever played it forgot that a game is supposed to be fun.\n\nOn the plus side, the world seems really interesting; artistic direction, graphics and music are beautiful. But it's really not enough to compensate for that boring gameplay, and I have played other FF games before.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "NOPE. No reason to put Denuvo in a single player game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "good game\nbad optimisation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The boys are out of town! The boys are out of town!\n\nDenuvo Bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disaster. Waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't waste your money on this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yea, nah",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fish",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Denuvo.\nDenuvo allows a game to run on 5 different system in a timespan of 24 hours. Do NOT fiddle around with proton versions because each version is considered ONE device and you will get this error:\n\"The server is not reachable, check your Internet connection and click \"Retry\"\" - locking you out of playing the game for 24 hours.\n\nPlease remove Denuvo, it causes more problems than it fixes.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I normally don't write long reviews but when I read other reviews of Final Fantasy XV Windows Edition, I found some resonance with my own experience.\n\nI initially had mixed feelings about Final Fantasy XV, finding some enjoyable elements despite notable flaws. However, after sinking more hours into this game, I'm revising my opinion to [b]mostly negative[/b]. What started as minor annoyances have revealed themselves to be fundamental design problems that make this game more of a chore than an adventure.\n\n[h2]The Day-Night Cycle[/h2]\n\nThe day-night cycle remains one of my biggest frustrations. It feels artificially restrictive. I spend half my time just traveling around, and by the time I complete two or three missions, darkness falls and forces me back to camp. This constant interruption kills any sense of momentum or flow. It really feels like being punished to continue to play the game for more than 50 mins at a time. \n\nThe 30-minute real-time cycle for a full day might sounds like a lot, but due to the catastrophic travel system, which simply doesn't give you enough time to accomplish meaningful exploration or quest chains.\n\n[h2]Side Quests, A Complete Lack of Imagination[/h2]\n\nWhat I initially described as \"everywhere but skippable\" has revealed itself to be something far worse—a complete [b]lack of imagination[/b]. Every NPC delivers endless, repetitive, almost exactly the same side quests. Catching red frogs, then yellow frogs, then whatever color frogs. Collecting potatoes, then onions, beans, then whatever vegetables. Even the cutscenes and animations are EXACTLY IDENTICAL.\n\nThe quest design is deliberately obscured too—some collectibles are hidden in bushes with absolutely no visual or audio clues. Oh, and did I mention that you have to watch those cutscenes AGAIN AND AGAIN BECAUSE THEY ARE UNSKIPPABLE! They don't even bother to create new stories for NPCs; they just label missions \"Help XXX doing YYY AGAIN.\" 99% of the game's sidequests feel like filler, consisting of nothing more than fetching vegetables, gems, or dog tags with zero narrative substance.\n\n[h2]Travel System[/h2]\n\nThe travel mechanics remain a mixed bag with persistent issues. You can teleport to parking spots or use autopilot to quest markers, but the map constantly resets to your current location when switching modes. This makes simple tasks—like picking a nearby parking lot, teleporting there, and walking to the mission point—unnecessarily complicated. Ironically, this manual approach is usually faster than the autopilot system, which speaks to how poorly the convenience features are implemented.\n\n[h2]Maze Design[/h2]\n\nThe dungeon and maze design represents another major failure. If you fall off a narrow ledge, you're forced to climb all the way back, then squeeze through a crevice WITH ANOTHER LONG UNSKIPPABLE CUTSCENE, only to fall at another cliff and repeat this tedious process.\n\nIf I have to give it a score, it would be a [b]3/10[/b]. Beautiful visuals and decent combat can't save this from being a fundamentally flawed experience.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The combat is complete rubbish. You can't tell what's going on and it doesn't seem to get any better. Just grapple high, then hit things. Over, and over, and over... What happened to the actual rpg character building elements of the game? It appear SE has decided that final fantasy is now an action RPG rather than focusing on game elements that made the series popular. Oh but wait, you can take selfies everywhere! and post them! WOW! that's what I'm playing Final Fantasy for! Sorry SE but you did a fantastic blend of traditional turn based rpg and action RPG with FF 12 and ever since then your combat system as gone down hill. Oh, so has the story.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Final Fantasy XV Stuttering Edition powered by Denuvo Anti-Tamper.\nI Remember playing this game on PS4 in 2017 without problems, on PC stuttering every 4 seconds with a 9950X3d & 5080",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Besides a really convoluted plot and questionable game design choices, maybe the real Final Fantasy XV were the friends we made along the way.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "(SPOILERS) Final Fantasy XV is such a frustrating game because you want it so badly to be a great game, but it's so frustratingly mediocre and directionless that after playing it for about 13 hours, I had to put it down.\n\nThe first 2 hours of the game are nothing less than amazing, you are introduced to 4 characters through a dialogue oozing with chemistry, and are shown an open world that leaves so much to the imagination. The sprawling landscapes and beautiful views that bring you to say: \"wow, this world is beautiful, I can't wait to see what comes next.\"\n\nThose first 2 hours were the best hours of the game, and it wasn't even close.\n\nThen comes the big twist in the story: the city in which you start the game in is taken under siege by the evil faction in the game, and your father, king Regis, is killed in the onslaught. Our main character, Noctis, is obviously devastated by this. The news comes out of nowhere, for both the player and the characters, and hits him like a truck; but I hadn't had a single emotional connection with the city or the late king, I hadn't even remembered their names before I looked them up on wikipedia. I had no attachment to the inciting incident of the game, because all I knew of the city and person that were destroyed was encompassed all in a three or four minute cutscene at the beginning of the game.\n\nThen comes the fact that the game cannot decide what tone it is trying to go for. Does it want to be a coming-of-age-story of 4 close friends exploring the world and having fun moments with each other? Or does it want to be a serious narrative about the fall of an empire and how that impacts people? Final Fantasy 15 decides to be some weird mix of the two, with seemingly heavy and emotional moments being interjected by one of the characters wanting to go see chocobos. More offensive, however, was when a character left your party for a reason he left unexplained, seemingly going on some great task that he needed to do. A few minutes after he finally reunites with your party, he grabs your attention and you're expecting him to talk about whatever task he felt so obligated to do or at least some comment about how he's feeling, and instead of doing anything like that, he gushes about the (sponsored!) cup-noodles that he loves so much. \n\nIt's not the moment itself that struck me, moreso that there are so many moments like that, where I am internally begging for the game to characterize these people on a deeper level, but it can't decide on what tone it wants to stick with, so any real development of these characters are just interrupted by 'funny haha' moments that bring anything serious to a complete halt.\n\nLike I said, I can excuse a rough story if the gameplay is good enough, but after 12 hours, I genuinely can't find any more fun in this game.\n\nThe world is easily the strongest part of the game. There were views while I was driving in which the characters had dialogue something along the lines of \"look at that view! it's amazing!\", and they were right, the world in this game is beautiful and for the first few hours I was gawking at everything I was seeing. It carried me through my playthrough and was the only thing that beckoned me to explore the world, but a world so large had so little to do inside of it. 99 out of a 100 times, the only content of the open world I could find were fetch quests-- kill these 5 monsters, go get this item and bring it back to me. There was nothing to do in a world brimming with potential. The only memorable quest I had was going to the chocobo ranch, and finding out that there was a monster scaring off the chocobos. The spectacle alone of the time building up to finally finding that monster, seeing its sheer size as you trail it to its den, and the final fight that wraps it all up, was the single most memorable thing I did in that game.\n\nThe side content itself kept me from exploring the world, as when I tried a few of them, they were so boring and uninteresting that I found myself just sticking with the 'hunt' quests, which just had you going to a certain location and killing a few monsters for a couple rewards. After a few hours in the game, I was entirely unmotivated to explore the open world in the open world game in favor of just doing a couple fetch quests until I got what I needed.\n\nThe biggest gripe I have with this game, however, is the combat system. I'm not one for extreme depth in combat, I'm okay with some things, like combos, being simplified for the player; but the extreme length to which the game tightens its leash on you with how dumbed-down the games systems are is incredibly frustrating. There are many smaller problems I have with the combat, but there are two main things: for one, you can win just about any battle by holding left click and shift, as the game will both auto-target the enemies on your screen and also automatically perform combos entirely out of your own control, taking any agency you could possibly have out of your own battles, you're basically just watching someone else play the game for you. Second, you'll never lose a battle in your life because the healing system is so unbalanced that you can brave any fight through sheer force of potion-spamming, because the game both gives you invulnerability when you've been knocked down AND pauses when you enter item-select so you have all the time in the world to select a healing potion which can put you right back into the fight. This action RPG has no real action, you're just watching people fight while barely having any input of your own. It's a test to see how long you can wait until the fight finally ends after spamming potions and holding two buttons, because the chance of you dying is nonzero, but it's so low that it may as well be nonexistent.  \n\nI really wanted to like this game. It was my second final fantasy game, I played the first one after the collection was on sale, and it had so much promise, but I found myself losing all interest in continuing before I could even finish the game. If you want an Action RPG with a developed and interesting world, play Elden Ring, not this.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Refunded, bro it's 2025 and this game not only won't let you remap your controls but when you go look at the control schemes it's all for controller? I don't have bumper and trigger buttons on my mouse and keyboard, for the \"Windows Edition\". This is ridiculous in this day and age.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bad port.. the minimum requiriments are wrong, you cant play without stuttering unless you have a cpu 6/12\nTAA has bad implementation in this game.. the game is good but the port is bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the first final fantasy game i ever played and it left such a bad aftertaste i became reluctant to try the other entries. I managed to convince myself to try ff10 tho and after just one hour of playing ff10 i can confidently say that this game is dogsh1t. U cannot convince me that this game is enjoyable bcs story-wise it feels rlly bland, u don’t rlly bond enough with the characters to feel anything when sth huge happens. as for the combat, it feels too easy like the game doesn’t even feel challenging at all, even when the big monsters come at night i never rlly die so it feels unearned. Also isn’t this supposed to be an open world game? Where’s the world design?? Most of it is just long roads, grass, rocks, and mountains like what do u even want me to explore.. and must i talk about the ruins? they’re so plain and uninteresting it pains me to be there even for lore purposes. Idk how many more hours i need to invest in this game for it to be “enjoyable” but i really gotta give it to this game for giving me 18 hours of boredom.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cannot recommend this game due to the constant crashing anytime you want to minimize the game. It would be very nice when you have multiple monitors to be able to minimize your game and use your other monitor to check a guide or use an interactive map to see the world but this game suffers horribly from crashing anytime you want to change something that every other game does flawlessly. Minimize your game? Crash. Change the game from fullscreen to borderless or non? Crash. Let's not also mention that every time you load your game your mouse will be perfectly visible on screen and no matter what google or anyone tells you, you cannot get it to go away. So if you have multiple monitors, your mouse will just end up moving to one of your other monitors as you play the game and as you click and move your character will just randomly stop attacking because your cursor has migrated to another monitor as you played. These are simple things that should have been fixed 7 years ago. Oh its simple everyone says, use the F1 trick.. trash, doesn't work. Update your drivers.. Trash, doesnt work. Play in borderless instead of fullscreen. Trash doesnt work. Download and use Special K to do something the game should have already done for you? Nope trash doesnt work. Its a potentially Great game which is unplayable depending on how unlucky you were when your computer was built with the components it was built with.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}