{
  "positive": [
    {
      "review": "buy this fantastic game before they delist it for a more expensive version",
      "voted_up": true,
      "votes_helpful": 387
    },
    {
      "review": "An amazing game that will get delisted soon so they can replace it with a more expensive version, no free upgrade, no transferring saves. Get this one before its gone lol",
      "voted_up": true,
      "votes_helpful": 145
    },
    {
      "review": "SEGA please delist this game if you love eating poop and if your mom is fat",
      "voted_up": true,
      "votes_helpful": 83
    },
    {
      "review": "5/5 Stars\n\nReally great. Amazing story, fun gameplay, instantly classic music, just overall a great time. Lots of fun side content to sink time into in between missions if that's your thing as well.\n\nBUY NOW BEFORE IT GETS DELISTED. YAKUZA 0 DIRECTOR'S CUT COSTS MORE WITH ONLY MARGINAL AMOUNTS OF NEW CONTENT.",
      "voted_up": true,
      "votes_helpful": 71
    },
    {
      "review": "Buy the superior version of Yakuza 0 before those greedy fucks delist it",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "If you're reading this and you haven't bought Yakuza 0: do it\n\nYakuza 0 will soon be delisted on december 8th to be replaced by an overpriced and totally pointless \"remaster\"\nThis is the game that got me into the series and is probably one of my favorites games ever. Great story, great characters, great gameplay, pretty much great everything\nAnd precisely as someone who loves this game so much I suggest you to do yourself a favor and buy it now that you can so you don't buy that director's cut bs",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "the manliest thing in this game is two shirtless men aggressively wrestling for dominance over one another. game of the year contender",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "PSA: This version is getting delisted on Dec 8th so if you want this version best to get it now. SEGA needs to stop delisting games even though the updated version is replacing this one. Also runs perfect on the steam deck \n\nThis game is perfect. the music, the story, side quest, everything. It’s the start of the series too so you would have a better understanding of what is going on before kiwami and the other games. Already sunk 200 hours in and still have a few things left to complete such as doing a run on legendary, climax battles and some missed achievements in certain chapters. Almost there to 100% for platinum.\n\nWhen it comes to mini games (if you care for 100% completion) good luck to you because RNG is frustrating especially for certain games that is heavy on it. Can have countless hours on some mini games because of it all because of a fish or cat fights for example. But the good thing is I finally learned how to play mahjong and now don’t need to worry about not being able to finish the list for the other games in the series.\n\nThere’s a lot of content to keep you busy and I see now why people like zero. I personally put this game off for many years and finally decided to come back to the series and actually play start to finish and completed the completion list. It’s not easy but practice makes perfect \n\nI do also have this on PlayStation but played it on here instead because this port is 10x better. Though the new version coming soon I would stick with this one.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game has been sitting in my library for six years, and I finally decided to give it a try to get into the franchise. My god, what a treat it has been! \nGood thing I have all the mainline games, from 0 to Infinite Wealth in my library. Yakuza marathon is definitely incoming.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "i can't say i liked this game so much but delisting it and replace it with 60$ dollar for bloatware is a terrible idea\nI'm boycotting SEGA and I'm not gonna bother buying their shitty games if they gonna continue delisting games and horrid practice like this",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "**MY FIRST YAKUZA GAME THAT INTRODUCED ME WITH YAKUZA SERIES**\n\nYakuza 0 is one of its kind which makes it hard to compare with anything else. I cleared the game twice and still not able to 100% it, there is so much to do. The mini games are fantastic, the side missions are sometimes better than the main mission and we also have custom battles. If I can have only one game for my entire life then I guess I would have chosen Yakuza 0.\n\nI am writing this review on the eve of Y0 DC release, so before the base version gets delisted I wanted to make sure the orginal one gets all the credit it deserves.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really good action and adventure game. The game is long but I definitely recommend it\nAs an addition, I recommend buying this game NOW, because it will be delisted from the Steam Store on December 8th because the Director's cut version will be released then",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "one of the greatest games ever made and it's getting replaced soon by a director's cut that is a huge detriment to the story, get the good version while you still can",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the best way ill put it is this game is a full package it contains a deep and emotional story and side content that can make you laugh and this game is jam packed of stuff to do for both characters from the side stories to the mini games. and the setting of a 80s Kamurocho and Sotenbori was perfect but the biggest props i have to give is the whole majima story and what a bittersweet masterpiece it was that had me on the edge of my seat the whole way. i wish i could replay this game all over again without any knowledge of whats to come. 100% a must own game even for just a singular playthrough this game excels in every aspect. truly a masterpiece.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Buy it before it gets delisted for no reason, you don't need the Director's Cut.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "\"eeek help me im gonna be delisted heeelp\" is what i imagine this innocent little game saying while its ugly father prepares to KILL him! FUCK YOU!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "My cousin wanted to play this game and told me if it ever went on sale they would transfer the money for me to buy it for them to add to the shared family library. \n\nSo I added this game to my wishlist to track it for discounts and about an hour later a friend gifted me this game. Much appreciated.\n\nAbout 30 minutes into the game and I already got to the 'Baka Mitai' meme scene.\n\nAnother story I might add is that, while I was working from home. I was listening to random YouTube recommended songs that auto-play after the next. One of the songs that was playing was from this game Yakuza 0 called 'Friday Night'. \n\nIt was a banger and I was reading the comments and there is a person named 'twonnycakes' that comments on that video every Friday night without fail. I just thought it was hilarious. The Yakuza fanbase is wild.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There is simply no better \"gritty\" story game with humor and side activites.\nThe best entry point into this franchise.\n\nLove this series",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Buy it before they delist it, and replace it with the \"remaster\" which has bloated a AF file size.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I got into the series last year and this game is such a life changing experience. \n\nalso fuck you SEGA for delisting the game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Yakuza 0 is a masterpiece through its exciting and incredibly well-written storyline, simple to learn gameplay but hard to master and like in typical yakuza fashion, its humour. From deep backstories, bonds, and love to helping Michael Jackson make the 'Thriller' music video while also challenging him to a disco dance battle, its hard to say that this game will ever bore you.\n\nWith an chapter campaign story-line that takes roughly 20-30 hours and to fully complete the game that takes  roughly 240 hours, I can 100% recommend you will get your moneys worth of this game ESPECIALLY regarding RRG's cheap prices on 95% of their, which is still evident to this day. \n\nGraphics wise for people who don't like playing older games don't worry this game was made originally in Japan in 2015, pretty much 10 years from writing this review and it barely shows any flaws in gameplay, storyline or most importantly in graphics.\n\nThe experience you get from playing this game is like none other with plenty to do throughout the game and even once you're finished the story. I could not recommend more, if you don't believe that i'm sure that 37 000 people minimum will overwhelmingly back me up on this game.\n\nJust get it gang you're throwing",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game \nTruly peak \nToo bad they are delisting this version and making new players pay $30 more for pretty much nothing new other than dubs and multiplayer and also increase the file size to almost 100 gigs\n\nI love when my favorite things get screwed over by modern triple A gaming ❤️\n\nBuy the Game on GOG Post Dec 8",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Amazing game about shirtless muscular men fighting\n\nGet this before it gets delisted for an INFERIOR AND EXPENSIVE VERSION. \n\nThe extra cutscenes from directors cut simply ruin some parts of the story, ruining the build up of the story of having real stakes. Its obvious it wasnt made by the same director (because it really wasnt, he stopped working for SEGA some years ago) because you can see the traits of storytelling of the recent Yakuza games used in the newly added cutscenes (this is the best I can say without spoiling the series), so I really dont understand the ''directors cut'' in the title if its not even made by the same guy",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "馬鹿みたい 子供なのね\n夢を追って傷ついて\n嘘が下手なくせに 笑えない笑顔みせた\n\nI love youも ろくに言わない\n口下手でほんまに不器用\nなのになのにどうして サヨナラは言えたの\n\nだめだね だめよ だめなのよ\nあんたが 好きで好きすぎて\nどれだけ 強いお酒でも\n歪まない思い出が 馬鹿みたい",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Get it before Sega delists it and replaces it with the worse, more expensive version",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "buy this game before it gets delisted and replaced for a \"director's cut\" version, which retcons impactful moments and just damn unncessary. why can't we have both versions exist???",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has it all: Brawler mechanics, mob soap opera, two protagonists with different fighting styles, management minigames, playable claw machines, and in-game food that looks delicious.\r\n\r\nMy 113 hour playtime is testament that there's a lot to do in the game. Quick word of caution, though. The ending finale was 2+ hours of gameplay and cutscenes with no save point in sight. Plan your gaming session in advance to avoid lost progress,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished my first ever playthrough of Yakuza 0 on my switch 2! Absolutely GOATED game. Installing Kiwami 1 as we speak..\n\nSpeaking of Directors Cut, just a quick reminder that SEGA is DELISTING original Yakuza 0 across all digital storefronts for the directors cut. Starting December 8th, 2025 you WON'T be able to buy original y0 anymore. Physical sales and aftermarket game keys are about to shoot through the roof.\n\nMake sure that you get base Y0 over DC for these few reasons:\n- Base Y0 is $20 off sale, $10 or less on sale! Director's Cut costs $49.99 USD.\n- Director's Cut has an unnecessarily inflated file size. DC is 95gb and base Y0 is less than 30gb.\n- The English dub will probably be turned into a mod at some point.\n- Red Light Raid is terrible\n- The retcons in DC are lame as hell.\n- Y0DC was fun to have as a switch 2 exclusive, but it's leaked into the rest of the versions of the game on different platforms.\n\nPreservation is extremely important, and it's vastly disappointing that SEGA/RGG have been making some seriously poor decisions with this IP over this last year. PYIH was mid as hell, Y0DC is now just the only version of Y0 that will exist after dec. 8. RGG also recast and hired a POS for Hamazaki in Kiwami 3 and are ignoring everyone about it, and so on and so forth.\n\nI will never tell you or anyone else what to do when it comes to buying games, but at least be aware of how shitty RGG is being in 2025. If you buy DC over Y0, that's up to you to waste money on something that could've been an update akin to LADG. If you buy Kiwami 3, at least be aware of what's happening behind the scenes at Ryu Ga Gotoku studio.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Of course SEGA delists the better version of the game for an inferior demake.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "buy this fantastic game before they delist it for a needlessly more expensive version!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The best Yakuza game in my opinion, and a perfect entryway into the series. Everything from the combat, minigames, characters, story and substories are just absolutely phenomenal. Even if this would be the only Yakuza game you would play, I would reccommend anyone play this at least once.\r\n\r\nI would suggest buying this now before it gets delisted on Dec 8th. You will still be able to get it, you'll just have to purchase the more expensive Director's Cut version. I agree delisting the original is absolutely pointless, and remasters should never be a proper substitute for the originals. But please don't review bomb this game, the delisting has nothing to do with the actual game itself and it's hurting the overwhelmingly positive rating this game truly deserves.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this game when it first released on the PS4 and it was a life defining piece of media for me ever since. And I bought this day one when it released on PC to support the series. I don't need to explain what makes the game so great when it's been said by so many people in much more depth than I can do in a simple steam review but I have to make this review now cause this game is very special to me.\n\nIf this game is getting delisted as of December 8th, and being replaced with the directors cut, then you need to get this game on steam before it gets delisted now. The additional cutscenes added in the Directors Cut version of the game straight up make the games overall story worse and are continuing a trend in the games latest entires that has been having me really concerned about the series continuation of its plotlines. \n\nEven beyond that, delisting the original version of the game is unnacceptable from both an accessability standpoint for people to be able to get access to such a masterpiece, as well as an insult to the long history of mod support this game has had. I hightly doubt you can just carry all those hand made mods over to the directors cut version. \n\nYakuza 0 is such a special game to me and so many people. If they do not walk back on delisting the game, I highly suggest you either get it now or acquire it somewhere else. Because the Directors Cut is just entirely uneccessary as it was and insulting in how it will be replacing the original version entirely",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very good videogame. If the new content from the upcoming Director's Cut version (Red Light Raid multiplayer mode, saving whenever you want, and new but controversial cutscenes) sounds enticing, embrace your free will and buy that version! Just know that you can otherwise get 𝘱𝘳𝘦𝘵𝘵𝘺 𝘮𝘶𝘤𝘩 the same story rich & satisfying gameplay experience from this version at a cheaper and more reasonable price. This version is expected to be delisted from Steam once Director's Cut launches on December 8th, so it's recommended you buy it while you can if you want to be sensible. And remember that prices on key sites will skyrocket quickly once this leaves Steam.\n\nI won't elaborate on the story or gameplay itself here, as I had very little idea of what I was in for until I first played. But if you're looking to try the Yakuza/Like a Dragon series then absolutely start here, you're gonna love it.\n\nEDIT: It's been confirmed by SEGA that digital upgrades for Yakuza 0 Director's Cut will soon be available for players who previously owned the digital version of Yakuza 0, including Steam. If you want to own 2 different versions of the game packaged cheaper than the base price of Director's Cut itself, now's your best chance to buy this so you can upgrade at a considerable discount later on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is amazing.\r\n\r\nIt's like if fast and furious, dead rising, and you're favorite mafia movie all fused together. \r\n\r\nThe main story is phenomenal, but where the real fun is the bonus/side content which from my understanding are these games specialty. So many fun side mini games to get lost in and the game actually rewards you for doing their side content with the completion points which essentially upgrade your character. Some of the mini games can be a bit of a hassle or have a learning curve(Mahjong), but for the most part they break up the game play in a fun way that kept my brain satisfied.\r\n\r\nThe performances by the entire cast here is truly something to behold, it takes a very good performance to get you out of the goofy mindset of firing you're fish cannon, and this cast pulls it off in spades. Particularly Kiryu and Majima. These have to be some of the best protagonists I've ever encountered. The emotion they get out of Kiryu and Majimas face models is very impressive.\r\n\r\nThe environment design is also incredibly impressive. The amount of detail in Kamurocho makes it all feel real in a way to where I play with the sub cause it's as if I'm walking around japan. A lot of games can feel a tad empty in their city design where it'll feel like a ghost town, not here. This is a cut above most rpgs, which is unexpected because  this game is nearly a decade old. \r\n\r\nThe story is structured masterfully, just the right amount of twists and turns, I was actively curious where it was all heading to towards the end. The handful of antagonists in this game are some of my favorites across any medium. The facial design and background of these villain esque chracters are very well crafted. \r\n\r\nI'm sold on the series and will be venturing to Kiwami next. :)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Get it before sega replaces it the exact same thing but for $30 more.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not going to leave a negative review, the director's cut is what deserves that. Cheap, nice looking game for being a 2015 game. One of the best in the yakuza franchise, get it before Dec 8 when it gets delisted and barely gets anything but a $45 price tag.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is better than straight sex (not gay sex but its close)\n\nBuy it before it gets delisted, the directors cut isn't worth the extra money, or at the very least without the upgrade discount.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Greatest game of all time. 10/10. Content everywhere for everyone with the most compelling story in a modern video game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "BUY IT NOW BEFORE THE SLOP DIRECTORS CUT COMES OUT AND RUINS THE STORY!!!!! (and make it more expensive)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Plot twist after plot twist. This game is PERFECTION. Yes, some parts of the gameplay are a little clunky, but it doesn't take away the fact that the story is incredible from start to finish. I was grabbing the edge of my seat by the near end.\n\nBUY IT BEFORE THEY DELIST,. TRUST ME!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "they're releasing the directors cut on steam? i better keep my ass in this office, im playing ts!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "phenomenal gameplay, great main characters, and amazing balance of hilarity and drama. Also has Too much to do in a good way!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addicting, I spend more time in the mini games, and running around doing sub stories than the main story, the main story its really good too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Here before they delist the game from the store\n\nAbsolute fucking banger of a game \n\n10/10 must play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Life is chaotic, full of random nonsense and can change abruptly to serious shit. You'll find that the same in this game, that and spending an eternity on Mahjong.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my introduction to the Yakuza series and it genuinely changed my life. As dramatic as it sounds, the storytelling in the series and this one in particular is really something special. Even if you don't care for the combat, or the minigames, the game is worth playing for the story alone. \r\n\r\nThe combat is nothing to write home about in my opinion but it wasn't an issue either. The minigames are super fun as well. Cabaret Club Czar and Disco are some of the best in the series, which are exclusive to this game. \r\n\r\nIf you're looking to get into the series, this is the place to start. It's the earliest chronologically and a good balance between the latest new-engine games and the PS3 classics. If you aren't hooked by the end of chapter 4, I don't know what to tell you. As soon as I got through Majima's first 2 chapters I knew I was going to follow through with the whole series. It really is that good.\r\n\r\nPlay it!! You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you hate monotony, play this game.\n You'll go from the most dramatic moment ever to singing like you're auditioning for The Voice Japan.\n\n\nAbsolute cinema of a game, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story and style is just brilliant, abosulte cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the BEST games..... and it's getting delisted\n\n\nReally worth to buy before it's gone forever (Although I thing GOG won't delist it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first 100% completed this game via Xbox Game Pass, but bought it on steam after hearing the news that this version of the game will be delisted, in favor of an overpriced 100 GB monstrosity, with a really bad and forgettable multiplayer mode, and new cutscenes that actively make the story worse. The Directors Cut is literally over double the price of the original (not counting sales) with new inclusions only making sense in a free update or DLC, or at the very least they could release Directors Cut as it is now but keep the original available. If the existence of the previous version is gonna heavily affect the sales of the new version so much that you need to do this then maybe you should have made a better and more reasonably priced product.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy this game before they delist it. The Director's Cut \"remaster\" is objectively inferior!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the funnest games I have ever played\nGo from beating someone up with a garbage can to having a mission to sing karaoke\nThe story is great also\n\nRuns really well on Steam Deck\nReally want to play the other ones now!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Yakuza 0 – A Masterpiece of Storytelling, Style, Emotion, and Absolute Chaos[/b]\n\n[i] This game will get delisted on steam on release of Yakuza 0 Director's Cut [/i]\n\n[i]Yakuza 0[/i] is one of the rare games that can make you cry, laugh, rage, and cheer — all within the span of a single chapter. It is not just a prequel; it is the definitive introduction to one of gaming’s most iconic franchises. Set in 1980s Japan, the game captures the glitz, glamour, and danger of the yakuza underground with breathtaking confidence and cinematic weight.\n\nThe story is nothing short of phenomenal. It switches between two unforgettable protagonists — the honorable yet feared Kazuma Kiryu and the charismatic mad dog himself, Goro Majima — each trapped in their own battle for survival, loyalty, and identity. Their journeys collide through betrayals, conspiracies, emotional sacrifices, and some of the most well-directed cutscenes in gaming history. Every chapter deepens the narrative, making the stakes feel heavier and more personal.\n\nThe combat delivers raw, crunchy satisfaction. Kiryu and Majima each have multiple fighting styles, and switching between them mid-battle feels incredible. Bone-breaking heat moves, improvised weapons, street brawls in neon-lit alleys — every fight is brutal, stylish, and addictive. The progression system rewards both mastery and experimentation, making each encounter feel fresh.\n\nAnd then there’s the world — Kamurocho and Sotenbori — dripping with life and personality. Beyond the emotional crime drama and tense combat, the game explodes with hilarious side activities: karaoke, disco dancing, cabaret club management, pocket circuit racing, bowling, pool, underground fighting rings, and some of the wildest substories ever written. One minute you’re uncovering a murder conspiracy; the next you’re teaching a punk band how to act tough or helping a cult member reunite with their family. It’s absurd — and absolutely brilliant.\n\nThe real genius of [i]Yakuza 0[/i] is how seamlessly it blends tones. It never apologizes for switching from heart-wrenching storytelling to pure comedic madness. Instead, it embraces the chaos, allowing players to experience the entire spectrum of human emotion without ever feeling inconsistent or forced.\n\nThe soundtrack and presentation elevate everything further. Powerful electric guitars during boss fights, emotional piano during dramatic turns, classic 80s club beats during minigames — every track fits perfectly and leaves an impact long after the credits roll.\n\n[i]Yakuza 0[/i] is more than a game — it’s an unforgettable experience. A crime drama masterpiece wrapped in unhinged comedy, powered by a world full of passion, heart, and soul. It’s the perfect entry point for new fans and a legendary highlight for long-time players.\n\nIf you play it once, you’ll never forget it.\nIf you finish it, you’ll understand why the Yakuza series means so much to so many.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsDBWwrJ5mN9t-_NiiZ2rs9V]here[/url][/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get it while its on sale for $11!!! it will be delisted soon and replaced by a $50 dollar version!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome gameplay and the story keeps me interested. Rediculous amount of side content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy this game RIGHT NOW. They’re replacing it with the directors cut and charging 30 more dollars. Right now, 11 dollars will get you some of the best story I’ve ever seen in a game. It excelled what I was expecting from it, and I think I’m only half way through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8.5/10 peak storytelling. i rushed finishing this game cause i got a news about this yakuza 0 will get delisted soon, next month. i started played last year in 2024 taking a break at chapter 7 and quickly finished it in this november. a shame i didn't play many side quest/sub stories or other activity like real estate etc. because it was fun and kinda funny sometimes. main story also felt really good, there are so many plot twist upon plot twist and they are not afraid to take out important character. man, i think im gonna play this series more if they are not delisted this game upon the new version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get while you can at a true absolute bargain of price before anti-consumer practice of replacing OG release with a new released version of game happens, which triples or mores the price without a level of content that justifies it and will not get good discounts for a while. When having both up would mean discount version for people with less money would also exist.\n\nYou can probably even get language option added in directors cut modded into this version. You shouldn't be charged for what should be free upgrades.\n\nStill one of best games to start series with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this at the start of this year, absolutely fell in love with how they mix a serious, dramatic and heartbreaking story, with the comedy and chaos of the side stuff. Perfect balance. This game will break your heart, but at least you can sing it off in the karaoke booth. This year I've played through all the Yakuza games, but since it all started with this one for me, I gotta give it it's due respect and give it a big thumbs up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent an hour collecting telephone cards with p0rn stars on them to advance in a mini game where you manage a cabaret club which unlocks a secret style where you can kick knives into people's chests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This one is the 10 billion yen game :wink:\n\nSince it's getting delisted...wanted to say that it failed me on my first playthrough (?????) and gave up around chapter 9. Dunno why.\nFortunate I was and gave it a second chance in January and it became my favorite game. Rest is history.\nGot 4 chapters left of LAD:Infinite Wealth with the plan to finish Pirates till the end of the year.\n\nIt's been a great journey, kyoudais.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i own!!! also best in the franchise in my opinion. I love all the characters, and all their stories. not to mention the sick karaoke songs!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have any vested interest in this game, get this version before the shitty Director's Cut replaces it. It's one of my favorite games of all time and I hate to see it be treated the way it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If theres an interest in this series, you should get this before the director's cut comes out so you can still get it at a good price. GO GET IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy it before it gets delisted for the upcoming more expensive Directors Cut.\n\nGreat game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of beat 'em ups or just want a great immersive story I would highly recommend buying this version before it's de-listed December 8th.\n\nIt's a MUCH cheaper option than buying the $50+ directors cut that will take its place, and I personally am not confident that it will do this game justice. The game is a masterpiece, what little improvements that could be made could in no way ever make up for taking it down forever in favor of the new version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grab this version in any way you can for an authentic Y0 experience - even if you find it after it's been delisted. Only reason you should be getting their \"Director's Cut\" is if you want to compare (or the multiplayer), as this is not only more affordable but a much more genuinely better written story as a whole.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buy this game now before it gets delisted on December 8th, I can [i]not[/i] recommend this game enough, absolutely fantastic game with great story, flexible combat, and side quests/content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "buy this fantastic game before they delist it for a more expensive version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fu_k you RGG for removing this game for others and replacing it with the same with shitter scenes which ruins the plot and f_ck you again you greedy f_cks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Making this review purely for those who are on the fence about getting this game. You need to get it before December 8th, when it gets delisted. This is not an experience you should allow scummy corporate practices to let you miss out on. The team that worked on this game delivered something incredibly, incredibly special, so if you're even slightly curious, I implore you to grab it right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the story game for yakuza 0 it’s sad to see that it’s getting replaced and upgraded to yakuza 0 directors cut :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had an insane amount of fun with this game. Bought it for a little less than 10 bucks before knowing 0DC was even a thing. However, if there's any chance the game goes on sale before it's delisted: GET IT!! Even if it does not, I think it's worth its price because it's still gonna be a third of the price DC will be and it's cheaper to get this game and then buy the Director's Cut upgrade later down the line. It's a stupid decision that OG0 cannot coexist with the director's cut by giving us a separate upgrade path.\r\n10/10 game, get it while you still can",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game in the 2020 pandemic out of curiosity, and to this day this game remains as one of the best I've ever played, which rips my heart out because of what is happening. RGG is going to delist this game in 10 days in favor of an objectively worse version that's twice the price, bloated file size, extra cutscenes that either add nothing or retcon the story, no save carry-over, as well as delisting the other games from W10 because they can't be bothered to maintain/upgrade it, and they are even delisting it from PS4, something they have no reason to do! Alongside ALL of this, they are also keeping a known sexual abuser in the cast in their upcoming re-release, and as fans continue to push against it, RGG continues to silence them instead of addressing the criticism. RGG was a company I used to adore as an actually good AAA company, but either through corporate greed or through sketchy actions by Sega, this company has tanked their reputation HARD in the past few months. Do yourself a favor and purchase, dare I say pirate, this version and don't buy the more expensive worse version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maturing is learning that Kuze is the easiest boss in the game and he's simply a rite of passage for new players. I love this game, the music is great, most of the fights are awesome, the minigames rock, fuck the catfight arena, PLAY YAKUZA 0",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The DEFINITIVE everyone on your friends list has this and sings it praise but never beat it game (It's alright)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite in the RGG Series. Sad about the delisting though. But whether it's the original or the Director's cut, this game will always be a classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was fun.  Solid story and characters.   Hell I even had a little respect for some of the captains by the end.   I do wish the fighting skills for each style weren't locked behind the Cabaret/Real Estate side quests.   Still overall a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza games are so bizarre... in Yakuza 0 you get captivating and emotional story about a man who became yakuza to follow his father figure who took him from the orphanage, yet something happens and he is now hunted by same yakuza... while in the mean time he participates in: bowling, toy car racing, karaoke, pool, mahjong, underground catfights, disco(!), all while acquiring insane amount of real estate property. \r\n\r\nBoth emotionally strong and hilarious game. I think that even if you haven't heard about Yakuza storyline, you at least heard about all the minigames it has. Great beat 'em up with great fights (and story of course).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good gameplay and the story makes its to my one of the best games ive ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game to just pick up and play without really knowing these games. Even with all of the weird stuff that happens in this game, I am addicted. This game blends the perfect amount of weird, serious, and sad. That it forced me to get 30 hours on it in the first 3 days of playing it. So in short, I would highly recommend playing this game if you wana get into the yakuza games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes a man cry tears of happiness just seeing Majima and Kiryu doing something such simple as walking the earth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the best starting point for new players. I would recommend buying this before Yakuza Kiwami, because it's funnier and very good. Although the cutscene made my pc crash, so be cautious with the system requirements of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Either play as a guy buying land after \"murdering\" someone or just play as a crazy ass guy with an eyepatch, they both have one goal, beat the ever-loving GOD outta *GOONS* and thugs before going into a karaoke just to act all silly after helping someone in the most embarrassing situation, this game has it all and I love it, great humour and it has great combat, it's a masterpiece, heavily recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a game, the story keeps getting better and better each chapter you complete. I can see why this is a classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please don't let Yakuza 0 \"Directors edition\" shit have this game delisted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great starting point much more accessible than the PS2 entries in the franchise (which I also recommend to start with if you can)\n\nHighly recommend this franchise. I didn't expect to love Yakuza/LAD as much as I do. The stories in these games mean a lot to me and Kiryu is an amazing main character. \n\nFinally, please remove Kagawa from Yakuza Kiwami 3. People like him do not deserve to take up space in our games. He should not be allowed in the game. Please do right by your fans and the people working at SEGA and make the decision to remove him.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My frist Yakuza game and sure won't be the last. Impressive how it manages to combine such rediculous over-the-top game play with a dark, emotional and thought-provoking story. Not to mention, the side activities are quite additictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game and yakuza game ever, 1000x times the swag of any other game on the planet its not even a competition",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i was getting bullied by my friends to play this game and i avoided it for the longest time, i totally see why they bullied me.\n\n29 hours later, my god this game is fucking peak, 10/10\n\nbrb, about to play the entire yakuza series :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried to get into this game once before, but left around the halfway mark. This time I played it all the way through, and I have to say that it has been one of the greatest decisions of my life. The story is phenomenal, the characters are really well written, the game balances crazy with reality in perfect proportions, and overall it has definitely been one of my favourite gaming experiences. That being said, I'm not a huge fan of beat 'em ups, so I didn't enjoy the gamplay all that much. I understand that 0 is considered to be on the better end as far as gameplay is concerned from the Yakuza franchise, but it's just not my cup of tea. I would give this game an 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review: Yakuza 0 — (9/10)\n\nYakuza 0 is one of those rare games that completely immerses you in a time and place. Its recreation of 1980s Japan during the economic boom is nothing short of spectacular—neon-drenched streets, exuberant nightlife, and an atmosphere that effortlessly captures the era’s swagger. Combine that with a strong, emotionally charged story featuring Kiryu and Majima at their most raw and human, and you get an experience that stays with you long after the credits roll.\n\nThe game’s breadth of activities is almost overwhelming in the best way: cabaret club management, real estate battles, disco dancing, pocket circuit racing, karaoke, darts, pool, bowling, and countless street distractions that make Kamurocho and Sotenbori feel alive. I loved how 80s nostalgia serves the story well, and the mostly fun substories add a layer of grounded absurdity the series is known for.\n\nThat said, Yakuza 0 isn’t flawless. The combat can feel repetitive after a while, even with the multiple fighting styles. Some QoL improvements—like faster menu flow, less backtracking, or more intuitive upgrade gating—would have gone a long way. Substories, while entertaining, often lack real narrative depth and feel more like quick comedic sketches than engaging side plots. And the CP system isn’t particularly compelling; it exists more as a checklist than something that meaningfully enhances the experience.\n\nStill, these issues don’t detract from what Yakuza 0 ultimately is: a stylish, heartfelt, and often hilarious crime drama wrapped in the best representation of 80s Japan you can find in gaming. Its emotional highs, memorable characters, and richly textured world make it an absolute must-play.\n\nFinal Verdict: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game blew me away with the quality of its storytelling and the depth of its characters. As a new entrant to the series I'd heard a lot of great things and finally taking the plunge did not disappoint. If you're a fan of games with visceral brawler combat, a deep and emotionally charged narrative, and an excellent balance of surrealist humour and grounded social commentary, I'd heartily recommend picking this up.\n\nThe combat feels visceral and well paced, the Heat move finishers are dramatic and animated beautifully. The camera can sometimes be difficult to control and the automatic lock-on system doesn't always feel as precise as you'd want it to. The boss fights are visually spectacular, intercut with over the top brawling, though on higher difficulties the health bars can be daunting and make the fights last a little too long. My main complaint is the enemies propensity for stun-locking combos that have to be anticipated rather than avoided by reflex, which breaks the flow of aggression.\n\nAt first I was sceptical about the games' rapidly shifting tone, from serious drama to anime goofiness on a dime, but it really becomes part of the charm. Having a scene that wouldn't be out of place in a Japanese version of The Godfather cut right into a 20-man brawl where you beat enemies over the head with a bicycle just becomes part of the flow, and its pure fun every time.\n\nThe representation of 1980s Japan, its urban sprawl, economic boom and rampant consumerism are on full display, and the wide array of in-depth minigames, restaurants and locals you can interact with really sell the diversity of experience and face-paced rat race associated with city life. And acts in perfect contrast to the seedy underbelly lurking behind the facade of neon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza 0. it is one of the best games I have played, The story was too good, It was just perfect when playing the game I was immersed with both the protagansits. The gang fights of sheer will power in this game is insane. Its like a movie in a simpler version. However the game for completionists its gonna be hell, the game is way to grindy especially the minigames and D&T. These 2 aspects of the game will eat away the fun of the game. Just play the story and enjoy it dont grind the achievements. But I did it so if you want a challenge sure go for it. But other than this the game is a solid 9.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a friend of mine has constantly recommended the Yakuza series, i gave it a chance and can say I understand the hype. This feels like finding a diamond after mining in an empty cave. I'm only a couple hours in, but the gameplay has been fun and the story has been intriguing. I wish there were more cutscenes, and less still frame narrated text, but that's a minor gripe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got into substantially fewer fights in Japan than this game led me to believe I would \n\n(The endless side quests are accurate though)\n\nSolid game, play if you wanna feel Showa-era nostalgia and larp as a real estate agent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my second playthrough as I played it originally back in 2019 on a console. I was motivated by my recent playthrough of Judgment to replay this one.\r\n\r\nAnd Yakuza 0 is even better than what I remembered.\r\nIt's still one of the top 3 in the series for me and it's especially enjoyable on the Steam Deck.\r\n\r\nSteam Deck Settings:\r\n16:9 720p (otherwise game puts static background in the top and bottom bars at 16:10 800p)\r\nHigh Graphics preset with manually changing FXAA to MEDIUM and allowing the cutscenes to run at full FPS. Then I locked the game to 60 fps via the Deck settings. This got me about 6 hours of battery life while still looking phenomenal.\r\n\r\nTHE GOOD\r\nDramatic story and humor\r\nCharacters\r\nGraphics\r\nMusic and 80's vibe\r\nCombat and heat actions\r\nPerformance and stability\r\nGreat amount of content, especially large amount of minigames. You can easily get over 100 hours by doing all the minigames besides the main story.\r\n\r\nTHE BAD\r\nMovement in the streets, there is a lot of clutter that you cannot move around or push around and invisible walls in weird places.\r\nMr. Shakedown - I am just not a fan of this game mechanic, it's just there to slow down the fun parts of the game and has too many invincibility frames compared to all other bosses.\r\nSome background textures like to flicker in random cutscenes.\r\nSome minigames are pretty brutal. E.g. sometimes even one \"good\" press instead of fully perfect run in Karaoke will land you below 90/100.\r\nFixed camera in most interiors and near shops/restaurants - it's just annoying and messes with your controls.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game originally in 2020 played a little bit stopped having a pc finally got around ot playing and beating it the story is 10/10 Kiryu, Majima and Nishki are awesome. This game reminds me of a JRPG that is a beat em up with so much side content I mostly skipped over but it makes the game have so much to do after beating it with the substories overall the game made me buy yakuza 1 after beating it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wholesome, but sometimes it unloads an insane amount of bs onto player. Take the last chapter as example",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've barely played this game and it's already an immediate favorite. The story is very good sure, but the gameplay is phenomenal",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "In 10 days, this game will be delisted in favour of the Yakuza 0: Director's Cut edition, with a bloated file size, no mod support, no save file carry-over, a price hike that's twice as expensive, and 4 short extra story cutscenes that kill the pace of the existing story and assume you're not smart enough to work the story out. This update comes almost 10 years later to the game.\nThe original version of Yakuza 0 (this one!) is being delisted, becoming abandonware, in favour of their shiny new product of a fan favourite that they can sell for more money, to new and existing fans. A product that doesn't respect your ability to understand stories, a product made for you to give them more money for the same game.\nI adore Yakuza 0, but I refuse to support the removal of the existing title in favour of the director's cut edition. I don't understand why both can't be purchaseable.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "Do NOT buy the new director's cut. Save your money and buy the original Yakuza 0 before it gets delisted permanently on December 8th.\nIt's more than double the price of the original (20€ vs 50€ FULL PRICE, the original frequently went on sale for dirt cheap) for what's basically the same game but with a couple new cutscenes that make no sense and add nothing to the story, an absurdly bloated file size compared to the original, broken mod compatibility, no save carryover from the original version and a half-baked gimmicky online mode that sucks ass compared to the amazing co-op mod Jhrino recently put out on Nexus Mods. This is terrible value and one of the most blatantly anti consumer moves RGG Studio and SEGA have ever pulled. Director's cut is only a somewhat justifiable purchase for the Switch 2, because it's literally the only option available.\nThe original Yakuza 0 is a fantastic game and a really good starting point for a (mostly) incredible series, but between delisting such an amazing value game, casting a sexual predator in the upcoming Yakuza Kiwami 3 which you also shouldn't buy, and so many other anti-consumer decisions over the past few years, RGG studio and SEGA makes it impossible to keep supporting them.\n\nEDIT: I forgot to include this, but it's also worth noting that the original Yakuza 0 will not just be delisted on steam. It's getting pulled from every platform including PS4 and Xbox One, which won’t be getting the new Director’s Cut version, so once the original is gone, there will be no legal way to buy Yakuza 0 digitally on last-gen consoles, effectively turning the original last-gen release into abandonware. It's manufactured obsolescence that screws over anyone still on older consoles, consoles that could easily run the director's cut since it's running on the same engine with basically zero improvements! And all of this just to push a low effort, unnecessary and overpriced \"upgrade\"... what a joke!",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "Fuck you sega for delisting this game and making it nearly 4x more expensive.\n\nand making existing owners pay for an crappy \"upgrade\" that at most is worth 5$\n\nI recommend buying this version of the game and not overpaying for the \"directors cut\"",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "The practice of delisting original game releases from storefronts just to put up a worse, more expensive edition in its place must come to an end. Publishers need to reign in their greed and be more customer friendly. Ruining your reputation is not worth the 2.5x price increase.\nYakuza 0 will forever be delisted on December 8th 2025.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "My name is John Yakuza, and I don’t approve of delisting the game just to replace it with an unnecessary remaster.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I love this game, it's a shame it will get unlisted and replaced by an inferior version with retcons that are either pointless or detrimental to the story. All of that at double the price and 95GB file size for some reason, biblical greed.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Delisting the OG version to push a \"Director's Cut\" that no one asked for and is twice as expensive is just dirty.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "you're delisting this great 30$ version because otherwise you know people arent gonna pay 50$ for a bloated (25GB->95GB), inferior (all deaths retconned, tons of new useless cutscenes) \"Director's Cut\"\n\nThis old version is a great purchase, but I'm leaving this review as negative to hopefully garner more public attention",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "What pinhead at Sega thought it would be a good idea to delist this release of Yakuza 0 for one that's more expensive?",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Don't get me wrong it's a great game and I highly recommend it whether if you're new or not to the franchise. I'm just writing this review for the recent announcement of this game being delisted all because of a newer version and them wanting to milk it as much as possible and it's not the first time SEGA does this. But delisting games shouldn't be a thing. What do they gain from it? Nothing. Isn't the mere purpose of companies to make money as much as possible? Yet they limit themselves by doing so. They only get bad reputation and locking the alternatives to the customers which are the ones who got them where they are right now. They can still get money from both versions, and there's always people who can't run newer versions as others or just want to have both and support the game. But no, they keep doing the same garbage anti consumer practices. Thanks Bandai Namco, Rockstar, Microsoft, 2K, Epic Games, and now Sega. Keep it up, literally making everything worse.\r\n\r\nGame's available until December 8, if you haven't grabbed it and been wanting to get into Yakuza games, I highly recommend it or get a CdKey if you can't get it soon. Apparently Kiwami and Kiwami 2 are also getting delisted for no reason, guess it's not crazy to think Yakuza 3 will be delisted eventually as well considering Kiwami 3 is coming. Gotta love these practices, literally no one benefits from it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Oh good, SEGA felt the need to delist another game so they could market the same game, but different. They pull this every couple years and my disgust persists every time. No, I'm not upset \"I can't play this game anymore.\" My problem is that past December 8th, 2025, unless you already purchased this specific game, there's no downloading and playing it again (legally, anyway). And, of course, there's the obvious implication that support for this game will be discontinued, even if it was sunset forever ago. And while I base this on nothing, there's no doubt in my mind that it will require better hardware than this.\n\nI like Y0. I've had fun with it. I personally recommend it and the series. I'm nonetheless appalled at SEGA's actions once more.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "good game, terrible business practice",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Dame Da DAMN, i cant believe they're Dame Da DELISTING this game for the mid ass Dame Da DIRECTOR'S CUT!!!!!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "great game ruined by sega's greed. you literally gain nothing from unlisting games",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Great game, terrible clown company behind it. You might want to grab this before it gets delisted and replaced by an inferior, vandalized version. Be aware that the current discount is not even close to the best price for it and of course you fund these \"people\" who quite eagerly destroy works of art, so that they can sell you more expensive copies with crayon doodles all over instead.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "completely delisting the game just to force people to buy the more expensive version that could have been jsut a dlc for this game is absolutely disgusting. i do NOT recommend this to anyone.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Going to completely delist for an \"upgraded version\".\nRead as \"we want to charge full price for a 10 years old game and milk some more from people who already bought it\".\n\nI hope people are going to be smart enough to NOT give even a cent to these greedy bast**d",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Game gets Delisted Dec 8th for a stupid remaster so buy it now if you want it. But the the game is great only put negative so more people would look at this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game will soon be delisted so you have to buy the much more expensive remaster, what a shame!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It isn't like when physical copies have limited stock, they could just sell this version forever. Instead, you will have to buy their new version and all of a sudden the old version is competition. Hope SEGA gets a grip and stops these anti-consumer practice",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "So this is the end for OG Yakuza 0 funny joy modding move up Director's Cut \n\n\n\nDev RGG greedy thing.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "They're planning to delist this game for a more expensive version that is 95 GB according to the store page, and marketing it at around $50 usd when they could've just marked this as a dlc or an update. The new things including an unnecessary multiplayer mode, like 5 new cutscenes (one of them, in my opinion, ruining characters deaths in the game), new text language options, and an english dub.\n\nAll of this could've just been part of an update, or the multiplayer as a dlc. But instead they want to charge you $15 to upgrade for the \"better\" version, or around $50 for a 10 year old game with a bit of new things added, its ridiculous",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Greedy practices from Sega/Ryu Ga Gotoku studios delisting this off Steam just to push an inferior version directors cut?\n\nNo thanks. I won't be giving Sega/Ryu Ga Gotoku any more of my money until they cease these marketing schemes and treat their customers better!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Good game but it is getting delisted on 12/8. You should get it now because it isn't worth it for the expensive remaster.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck you sega and fuck you RGG delisting a great game because you want to realese 2x more expensive directors cut version that adds basically fucking nothing worth 50$",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "retarded company keeping sex offender and delisting this game cos its £34 cheaper than the one which adds a shit retcon, saving where u want (good change) and a very mid co op mode lmfao what an absolute joke",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The story is great, the music fits well, the two sides of the story coming together for the big finale clash is awesome!\n\nThe minigames are fun and the sidequests can be a bit absurd (Meeting MJ in the 80 for a Japanese styled Thriller? Gnarly bro.)\n\nSo why do I rate it down? Because on 11/26/2025, a \"Director's Cut\" was announced. This DC will add the Multiplayer Mod to the base game, a new song, several new VA's, and cutscenes, at least 2 of which *will retcon massively important parts to the story, such as people surviving things that they previously died in*.\n\nThis is, of course on top of EGGMAN'S MASTER PLAN TO DESTROY THE WORLD AND--Wait, sorry, I've just been informed that Sega is going to make current owners of this game BUY the DC for almost the same price as the original game, and they're DELISTING this version and relacing with the new version, Dirctor's cut included... for $50, or $49.99 USD, whatever.\n\nI actually really, REALLY like this game, but for all who seek to purchase the game past the \"upgrade day\", Turn back, do not feed the greed and stupidity, TURN BACK!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When i like y0 so much, that sorry but i must need to put negative here cause of moves which RGG and SEGA are doing from not so long time ago. If you wanna play y0, i would like recommend look on keyshops for cheaper y0 or just pirate it. It's not worth supporting this scammy practice which Director's Scam is by adding ONLY 5 RETCON CUTSCENES, MID MINIGAME WHICH CAN BE MADE BETTER BY MODDERS or JUST ADDITIONAL DUBS AND SUBS LANGUAGES. JUST XD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game ruined by greedy practices\nyou cant buy the old, cheaper version\nyou HAVE to buy the new version with barely any new cutscenes, a gamemode nobody cares about, and the only good part might be the languages, but its not worth $50.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is great, don't get me wrong and my hours in the game is telling of that. The ONLY reason why I don't recommend buying this is because I found out this is getting a Director's Cut version release on Steam, which is just a straight upgrade. This will probably be delisted. Don't buy this and just wait for the Director's Cut version (and depending on the price). This is a similar situation with many rereleased games like Skyrim Special Edition and the recent Atelier Ryza DX by KOEI. To simply put it, this is just anti-consumer. I understand this has nothing to do with the game itself, but I'm strongly against anti-consumer practices. If Sega doesn't offer a free Director's Cut copy to all users or offer an upgrade option, I'm just leaving this review as is.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just love playing a game for like 3 hours just to lose all progress.. even went to a phone both, saved the game THREE TIMESSSSSSSSSSS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No one wants an overpriced re-release and the old version to be delisted. \n\nWalk back the delisting of Yakuza 0 and add the new content/improvements as a DLC for about 15-20€, further discounted for existing customers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never supporting the practice of delisting games just to replace them with an expensive \"\"\"remaster\"\"\".",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Although I wouldn’t recommend it, Yakuza 0 is far from being a bad game — it’s just not for everyone.\n\nThe game still looks gorgeous in 2025, and I was blown away by how stunning the districts of Kamurocho and Sotenbori are, especially at night.\n\nWhile the main story takes quite a while to really get going, it’s excellent once it does — and that’s what kept me playing until the end (it took me about 35 hours to finish the main storyline).\n\nThat said, Yakuza 0 is definitely starting to show its age in many areas, and I kind of forced myself to finish it. Here are the things that particularly bothered me:\n\n- The gameplay feels very stiff and extremely repetitive (even for the genre). There’s not much sense of progression in terms of power, aside from a few unlockable moves. The special moves are satisfying — at least in the beginning.\n\n- The side quests aren’t voice-acted, which really hurts immersion and overall engagement, in my opinion.\n\n- Although this can also be seen as a positive point, the game offers way too many things to do (mini-games, business management, etc.), and it’s easy to get lost or overwhelmed.\n\nIf the negatives I’ve mentioned don’t bother you, go ahead and dive in — Yakuza 0 is still a remarkable experience in many ways.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you change your mind regarding the delisting of the game, I will change this review to positive. The Yakuza franchise and its games are so fantastic, but the latest decisions made by SEGA and Ryu Ga Gotoku Studio are causing the franchise to falling apart, Yakuza/Like A Dragon doesn't deserve this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game but a game to come out in 2018 with no autosave's is stupid, lost a good few hours of gameplay cuz my power went out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza 0 is peak, but I'm only giving this a negative because of the fact they're delisting this version with the sloppified, retcon filled \"remake\" soon, so get this version while you can",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Can't recommend this game after everything RGG has been doing lately\nHope they fire the current Director asap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "★☆☆☆☆ Terrible!\r\n\r\n[h1]Action[/h1]\r\n\r\nThe story of Yakuza 0 starts off engaging, but falls apart in the latter half as luck and cheap plot twists resolve the main conflicts and the game drags itself along to a forced-out ending. The story gives you some gripping intense cutscenes, but is mostly and constantly flips back to the static text boxes with little grunts from the characters as you read their lines. For the most part, the characters are likable and entertaining.\r\n\r\nA gameplay gets dull near the end with very little enemy variety to spice the game up. The leveling system is this jumbled mess and tasks to acquire more skills are painfully boring and long!\r\n\r\nSubstories are built on charming ideas, however dragged out into a boring husk with very little gameplay to save them. Minigames are underdeveloped side things, but they are more there to be gimmicks and give a few giggles.[h3][hr][i]I really want to rate it higher, but the sour taste after many of the minigames and combat never exactly doing what I want it to prevents it from ever being a truly good game![/i][/hr][/h3]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Okay, the game is not the second coming of jesus christ or a masterpiece. \n\nit's a fun action romp through 80s japan. And while I really didnt like the combat, the game has a ton of great moments and has a nice progression curve. \n\nThe game has sooo many cutscenes, and I feel like I should be watching a movie instead. That's the only reason why it's negative.\n\nI also didn't like the minigame and open world aspects. I would've preferred a shorter, more focused experience. The game's writing is too wacky for me - but it pulls off the serious aspects well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would like to recommend this game, but there are so many glaring issues with the saving that I just can't. You can't close the game while in a boss fight. If you do, you lose your progress for the entire mission. You can't leave the game before you make your way to a phone booth located in the world, so you're forced to play through entire parts of the game in one session. The game will never autosave for you either, so if the game crashes or your power goes out, all the progress you made is lost. I would really like to recommend it, but there's no reason for a game made in 2015 to have such obtuse design. FUCK you yakuza 0.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "More than double the price of the original with OG being £16, director's cut is about around £50 for what's basically the same game but with a couple new cutscenes that bring almost nothing new to the story and rather retcon some things instead. \nRGG and SEGA have all but lost my respect with how this is being handled. 0DC having an incredibly bloated file size compared to the original; broken mod compatibility; no save carry-over from the original version and an online mode that leaves a lot to be desired makes the price tag leave a sour taste in your mouth. \nSave your money, don't buy the directors cut edition and instead buy the original Yakuza 0 before it gets delisted in 10 days with the release of 0DC. You'll be happier in the long run I promise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Such a primitive, stupid and extremely overrated game! After completing it, I have no idea why it has such a high rating. The fights are monotonous and boring. The plot is childish, stupid and predictable. I really regret wasting money for the entire series of Yakuza. I do not recommend it even at a 95% discount. Screw all wooden Japanese games and their greedy developers! Never buy Japanese games! I mean it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kömpelöt mekaniikat, jatkuvat tylsät välivideot, karaokerytmipeli...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Greedy bastards with the Director's Cut.\nAnyone defending this is a dumbass bootlicker that needs to stop defending billion dollar companies and start demanding better.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Yakuza : like a dragon (7) was better than this in every way.\r\nthe few seconds of majima in it had more aura than whatever this was. fiction sometimes is better in your head vs when read it and my reaction on witnessing majima's entire arc was : is he fucking stupid? why he doing <insert bizzare action>. i think the writers tried to potray him as a dog that broke free of his baggage, but he doesn't, the story is weirdly written, it's almost as if majima along with being extremely dumb also has sadistic fetishes.\r\n\r\nthen there's kiryu : the best word that describes him is a rock. yes he is as stoic as a rock but as bland too, in contrast to ichiban (the hero of yakyza 7), ichiban is extremely full of life and colorful. the best scene about kiryu in this entire game was him screaming in a flashback \"can't orphans dream too?\" about luxury that the yakuza have.\r\n\r\nanyways, i am sorely disappointed in this game as i had a entire headcanon about it's aura, and it disappointed me a lot with it's blandness. both the protagnist's are glorified (but colorless) donkeys carrying loads on their back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it will be delisted bcz of remaster. buy it now if you want it. great decision from sega",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "a perfectly fine version is being delisted for an inferior release. seriously rgg?",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Can't believe Sega and RGG Studio have decided to kill all good will this franchise has gained. Eat crap.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "great game that you wont be able to buy legally in ~10 days",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Writing this review in the vain hope that Sega notices how much we DONT want original Y0 to be delisted",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Reuse ga gotoku studio is out of touch with reality, what a shame",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is good, company is bad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game on sale for $5 what do you mean $50.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Everything is very primitive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid\ndelisting 8/12",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fire yokoyama",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Why Should We Legalize Cannibalism:[/h1]\n\nEver since we have known ourselves as humans, we have considered “hunger” as one of our greatest barriers to survival, a challenge we have fought in different ways depending on the historical era. During Prehistory, humans lived nomadically and hunted other animals, while later civilizations, which lived sedentary lives, adapted through animal domestication and the extensive cultivation of pre-selected crops. However, many civilizations across different periods of history engaged in the act of feeding on the mortal bodies of humans, what we know as cannibalism, and many of these civilizations survived with this habit for decades, if not centuries.\n\nDuring extreme times and in remote places with limited access to water and food, human beings were forced to practice cannibalism as a way to survive. One example that we, from Western culture, know, and which has been distorted both by works from the Industrial Revolution and by the Catholic Church, is the Maya and Aztec empires, where it is claimed that both practiced cannibalism. These were great empires that extended over vast areas, even in unfavorable environments, and survived for many years using human flesh as a nutritional basis. Both eventually declined; however, in relation to the Maya Empire, the reasons remain unknown even to the best anthropologists and historians today, while the Aztec Empire fell due to its defeat by the former Spanish kingdom, whose diseases and more technologically advanced weapons contributed to the downfall. Thus, it is possible to observe that cannibalism was never responsible for the collapse of civilizations.\n\nIn regard to human health within the context of cannibalism, many “cannibals,” often portrayed as monsters by our modern society, report that human flesh tastes similar to pork, such as pigs and wild boars. They claim that its consumption would not affect the human palate, making it theoretically edible for us, even though we reject this delicious food. However, when discussing this topic with those who “do not know the truth,” many will say that studies claim humans cannot survive by feeding on human flesh. Yet these same people would blindly support articles written by newly graduated students from Brazilian public universities, who write papers merely to fill out their resumes, tarnishing the so-called “science” that these people love to worship. Therefore, one should never blindly trust any scientific article, especially those that condemn cannibalism under the argument that it violates ethics. After all, following only the values of our own Western culture and ignoring the others would be the right thing to do, wouldn’t it? Wrong!\n\nCannibalism, despite being considered a taboo, is far from being legalized, because people, blinded by the system, do not know what horizons this could bring to humanity. Imagine vast farms filled with humans, raised and slaughtered to become meat and feed billions of families around the world! Imagine criminals, found guilty of their crimes, being used as food sold in supermarkets and nourishing countless men, women, and children! Imagine places where people who cannot afford to raise cattle or even plant a simple lettuce could instead enjoy a fresh human being to satisfy their hunger! This truth is difficult to believe, something almost considered utopian today, but one that could become reality if we were allowed to feed on our own species.\n\nTherefore, it is possible to conclude that cannibalism would bring more benefits than harm to the human race as a whole, and that we, as humans, have the right to abandon this outdated system imposed by the super-rich aligned with the cabal, adopting the consumption of our own species as our new standard. By allowing the consumption of human flesh, the human race would prosper and grow without facing the hunger problems that we struggle with today.\n\n#legalizecannibalism",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In 10 days, this game will be delisted in favour of the Yakuza 0: Director's Cut edition, with a bloated file size, no mod support, no save file carry-over, a price hike that's twice as expensive, and 4 short extra story cutscenes that kill the pace of the existing story and assume you're not smart enough to work the story out. This update comes almost 10 years later to the game.\nThe original version of Yakuza 0 (this one!) is being delisted, becoming abandonware, in favour of their shiny new product of a fan favourite that they can sell for more money, to new and existing fans. A product that doesn't respect your ability to understand stories, a product made for you to give them more money for the same game.\nI adore Yakuza 0, but I refuse to support the removal of the existing title in favour of the director's cut edition. I don't understand why both can't be purchaseable.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Do NOT buy the new director's cut. Save your money and buy the original Yakuza 0 before it gets delisted permanently on December 8th.\nIt's more than double the price of the original (20€ vs 50€ FULL PRICE, the original frequently went on sale for dirt cheap) for what's basically the same game but with a couple new cutscenes that make no sense and add nothing to the story, an absurdly bloated file size compared to the original, broken mod compatibility, no save carryover from the original version and a half-baked gimmicky online mode that sucks ass compared to the amazing co-op mod Jhrino recently put out on Nexus Mods. This is terrible value and one of the most blatantly anti consumer moves RGG Studio and SEGA have ever pulled. Director's cut is only a somewhat justifiable purchase for the Switch 2, because it's literally the only option available.\nThe original Yakuza 0 is a fantastic game and a really good starting point for a (mostly) incredible series, but between delisting such an amazing value game, casting a sexual predator in the upcoming Yakuza Kiwami 3 which you also shouldn't buy, and so many other anti-consumer decisions over the past few years, RGG studio and SEGA makes it impossible to keep supporting them.\n\nEDIT: I forgot to include this, but it's also worth noting that the original Yakuza 0 will not just be delisted on steam. It's getting pulled from every platform including PS4 and Xbox One, which won’t be getting the new Director’s Cut version, so once the original is gone, there will be no legal way to buy Yakuza 0 digitally on last-gen consoles, effectively turning the original last-gen release into abandonware. It's manufactured obsolescence that screws over anyone still on older consoles, consoles that could easily run the director's cut since it's running on the same engine with basically zero improvements! And all of this just to push a low effort, unnecessary and overpriced \"upgrade\"... what a joke!",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "My name is John Yakuza, and I don’t approve of delisting the game just to replace it with an unnecessary remaster.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Fuck you sega for delisting this game and making it nearly 4x more expensive.\n\nand making existing owners pay for an crappy \"upgrade\" that at most is worth 5$\n\nI recommend buying this version of the game and not overpaying for the \"directors cut\"",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "The practice of delisting original game releases from storefronts just to put up a worse, more expensive edition in its place must come to an end. Publishers need to reign in their greed and be more customer friendly. Ruining your reputation is not worth the 2.5x price increase.\nYakuza 0 will forever be delisted on December 8th 2025.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Delisting this game so people would only buy the remake is like throwing your child onto the tracks of the Williamsburg bridge just so you could go home and have sex for another one right after and name it fucking Todd",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I love this game, it's a shame it will get unlisted and replaced by an inferior version with retcons that are either pointless or detrimental to the story. All of that at double the price and 95GB file size for some reason, biblical greed.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Delisting the OG version to push a \"Director's Cut\" that no one asked for and is twice as expensive is just dirty.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "you're delisting this great 30$ version because otherwise you know people arent gonna pay 50$ for a bloated (25GB->95GB), inferior (all deaths retconned, tons of new useless cutscenes) \"Director's Cut\"\n\nThis old version is a great purchase, but I'm leaving this review as negative to hopefully garner more public attention",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "What pinhead at Sega thought it would be a good idea to delist this release of Yakuza 0 for one that's more expensive?",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Don't get me wrong it's a great game and I highly recommend it whether if you're new or not to the franchise. I'm just writing this review for the recent announcement of this game being delisted all because of a newer version and them wanting to milk it as much as possible and it's not the first time SEGA does this. But delisting games shouldn't be a thing. What do they gain from it? Nothing. Isn't the mere purpose of companies to make money as much as possible? Yet they limit themselves by doing so. They only get bad reputation and locking the alternatives to the customers which are the ones who got them where they are right now. They can still get money from both versions, and there's always people who can't run newer versions as others or just want to have both and support the game. But no, they keep doing the same garbage anti consumer practices. Thanks Bandai Namco, Rockstar, Microsoft, 2K, Epic Games, and now Sega. Keep it up, literally making everything worse.\r\n\r\nGame's available until December 8, if you haven't grabbed it and been wanting to get into Yakuza games, I highly recommend it or get a CdKey if you can't get it soon. Apparently Kiwami and Kiwami 2 are also getting delisted for no reason, guess it's not crazy to think Yakuza 3 will be delisted eventually as well considering Kiwami 3 is coming. Gotta love these practices, literally no one benefits from it.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Oh good, SEGA felt the need to delist another game so they could market the same game, but different. They pull this every couple years and my disgust persists every time. No, I'm not upset \"I can't play this game anymore.\" My problem is that past December 8th, 2025, unless you already purchased this specific game, there's no downloading and playing it again (legally, anyway). And, of course, there's the obvious implication that support for this game will be discontinued, even if it was sunset forever ago. And while I base this on nothing, there's no doubt in my mind that it will require better hardware than this.\n\nI like Y0. I've had fun with it. I personally recommend it and the series. I'm nonetheless appalled at SEGA's actions once more.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Great game, terrible clown company behind it. You might want to grab this before it gets delisted and replaced by an inferior, vandalized version. Be aware that the current discount is not even close to the best price for it and of course you fund these \"people\" who quite eagerly destroy works of art, so that they can sell you more expensive copies with crayon doodles all over instead.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "good game, terrible business practice",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Dame Da DAMN, i cant believe they're Dame Da DELISTING this game for the mid ass Dame Da DIRECTOR'S CUT!!!!!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "great game ruined by sega's greed. you literally gain nothing from unlisting games",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "completely delisting the game just to force people to buy the more expensive version that could have been jsut a dlc for this game is absolutely disgusting. i do NOT recommend this to anyone.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Going to completely delist for an \"upgraded version\".\nRead as \"we want to charge full price for a 10 years old game and milk some more from people who already bought it\".\n\nI hope people are going to be smart enough to NOT give even a cent to these greedy bast**d",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "game is full of glitches.\nIn Caberet Club minigame, there's a rare chance to softlock the game while doing a makeover. You're able to spin around the model. but everything else refuses to work. Also, when saving a game, if the \"Save Complete\" message doesn't show up, it switches items in your inventory until you save again. Everything else is fine. Good story, great gameplay. But the glitches ruin it. I really hope Director's Cut will fix this, or remove it entirely.\nIf you buy this game, SAVE OFTEN. Or else you'll lose tons of progress to these stupid glitches.\nPlease fix your game. I paid $20 for this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game gets Delisted Dec 8th for a stupid remaster so buy it now if you want it. But the the game is great only put negative so more people would look at this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game will soon be delisted so you have to buy the much more expensive remaster, what a shame!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It isn't like when physical copies have limited stock, they could just sell this version forever. Instead, you will have to buy their new version and all of a sudden the old version is competition. Hope SEGA gets a grip and stops these anti-consumer practice",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "So this is the end for OG Yakuza 0 funny joy modding move up Director's Cut \n\n\n\nDev RGG greedy thing.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "They're planning to delist this game for a more expensive version that is 95 GB according to the store page, and marketing it at around $50 usd when they could've just marked this as a dlc or an update. The new things including an unnecessary multiplayer mode, like 5 new cutscenes (one of them, in my opinion, ruining characters deaths in the game), new text language options, and an english dub.\n\nAll of this could've just been part of an update, or the multiplayer as a dlc. But instead they want to charge you $15 to upgrade for the \"better\" version, or around $50 for a 10 year old game with a bit of new things added, its ridiculous",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "retarded company keeping sex offender and delisting this game cos its £34 cheaper than the one which adds a shit retcon, saving where u want (good change) and a very mid co op mode lmfao what an absolute joke",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Good game but it is getting delisted on 12/8. You should get it now because it isn't worth it for the expensive remaster.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Greedy practices from Sega/Ryu Ga Gotoku studios delisting this off Steam just to push an inferior version directors cut?\n\nNo thanks. I won't be giving Sega/Ryu Ga Gotoku any more of my money until they cease these marketing schemes and treat their customers better!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Fuck you sega and fuck you RGG delisting a great game because you want to realese 2x more expensive directors cut version that adds basically fucking nothing worth 50$",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Unbearably slow and clunky game, should be called \"Yakuza 0 gameplay\" unless the gameplay is pressing a button to see the next textbox with 1 sentence. Japanese games are fucking weird",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The story is great, the music fits well, the two sides of the story coming together for the big finale clash is awesome!\n\nThe minigames are fun and the sidequests can be a bit absurd (Meeting MJ in the 80 for a Japanese styled Thriller? Gnarly bro.)\n\nSo why do I rate it down? Because on 11/26/2025, a \"Director's Cut\" was announced. This DC will add the Multiplayer Mod to the base game, a new song, several new VA's, and cutscenes, at least 2 of which *will retcon massively important parts to the story, such as people surviving things that they previously died in*.\n\nThis is, of course on top of EGGMAN'S MASTER PLAN TO DESTROY THE WORLD AND--Wait, sorry, I've just been informed that Sega is going to make current owners of this game BUY the DC for almost the same price as the original game, and they're DELISTING this version and relacing with the new version, Dirctor's cut included... for $50, or $49.99 USD, whatever.\n\nI actually really, REALLY like this game, but for all who seek to purchase the game past the \"upgrade day\", Turn back, do not feed the greed and stupidity, TURN BACK!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "When i like y0 so much, that sorry but i must need to put negative here cause of moves which RGG and SEGA are doing from not so long time ago. If you wanna play y0, i would like recommend look on keyshops for cheaper y0 or just pirate it. It's not worth supporting this scammy practice which Director's Scam is by adding ONLY 5 RETCON CUTSCENES, MID MINIGAME WHICH CAN BE MADE BETTER BY MODDERS or JUST ADDITIONAL DUBS AND SUBS LANGUAGES. JUST XD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game ruined by greedy practices\nyou cant buy the old, cheaper version\nyou HAVE to buy the new version with barely any new cutscenes, a gamemode nobody cares about, and the only good part might be the languages, but its not worth $50.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is great, don't get me wrong and my hours in the game is telling of that. The ONLY reason why I don't recommend buying this is because I found out this is getting a Director's Cut version release on Steam, which is just a straight upgrade. This will probably be delisted. Don't buy this and just wait for the Director's Cut version (and depending on the price). This is a similar situation with many rereleased games like Skyrim Special Edition and the recent Atelier Ryza DX by KOEI. To simply put it, this is just anti-consumer. I understand this has nothing to do with the game itself, but I'm strongly against anti-consumer practices. If Sega doesn't offer a free Director's Cut copy to all users or offer an upgrade option, I'm just leaving this review as is.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I just love playing a game for like 3 hours just to lose all progress.. even went to a phone both, saved the game THREE TIMESSSSSSSSSSS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No one wants an overpriced re-release and the old version to be delisted. \n\nWalk back the delisting of Yakuza 0 and add the new content/improvements as a DLC for about 15-20€, further discounted for existing customers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never supporting the practice of delisting games just to replace them with an expensive \"\"\"remaster\"\"\".",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Although I wouldn’t recommend it, Yakuza 0 is far from being a bad game — it’s just not for everyone.\n\nThe game still looks gorgeous in 2025, and I was blown away by how stunning the districts of Kamurocho and Sotenbori are, especially at night.\n\nWhile the main story takes quite a while to really get going, it’s excellent once it does — and that’s what kept me playing until the end (it took me about 35 hours to finish the main storyline).\n\nThat said, Yakuza 0 is definitely starting to show its age in many areas, and I kind of forced myself to finish it. Here are the things that particularly bothered me:\n\n- The gameplay feels very stiff and extremely repetitive (even for the genre). There’s not much sense of progression in terms of power, aside from a few unlockable moves. The special moves are satisfying — at least in the beginning.\n\n- The side quests aren’t voice-acted, which really hurts immersion and overall engagement, in my opinion.\n\n- Although this can also be seen as a positive point, the game offers way too many things to do (mini-games, business management, etc.), and it’s easy to get lost or overwhelmed.\n\nIf the negatives I’ve mentioned don’t bother you, go ahead and dive in — Yakuza 0 is still a remarkable experience in many ways.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you change your mind regarding the delisting of the game, I will change this review to positive. The Yakuza franchise and its games are so fantastic, but the latest decisions made by SEGA and Ryu Ga Gotoku Studio are causing the franchise to falling apart, Yakuza/Like A Dragon doesn't deserve this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game but a game to come out in 2018 with no autosave's is stupid, lost a good few hours of gameplay cuz my power went out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza 0 is peak, but I'm only giving this a negative because of the fact they're delisting this version with the sloppified, retcon filled \"remake\" soon, so get this version while you can",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Can't recommend this game after everything RGG has been doing lately\nHope they fire the current Director asap",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "★☆☆☆☆ Terrible!\r\n\r\n[h1]Action[/h1]\r\n\r\nThe story of Yakuza 0 starts off engaging, but falls apart in the latter half as luck and cheap plot twists resolve the main conflicts and the game drags itself along to a forced-out ending. The story gives you some gripping intense cutscenes, but is mostly and constantly flips back to the static text boxes with little grunts from the characters as you read their lines. For the most part, the characters are likable and entertaining.\r\n\r\nA gameplay gets dull near the end with very little enemy variety to spice the game up. The leveling system is this jumbled mess and tasks to acquire more skills are painfully boring and long!\r\n\r\nSubstories are built on charming ideas, however dragged out into a boring husk with very little gameplay to save them. Minigames are underdeveloped side things, but they are more there to be gimmicks and give a few giggles.[h3][hr][i]I really want to rate it higher, but the sour taste after many of the minigames and combat never exactly doing what I want it to prevents it from ever being a truly good game![/i][/hr][/h3]",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}