{
  "positive": [
    {
      "review": "It is undercooked. Exploration is not satisfying. You basically find a cave or similar on like 90% of them. No interesting sidequests and choices don't really make too much difference. Weirdly, the two Pathfinder games (this and wotr) have a similar premise, as a female bad guy can get absolution in the end. Kingdom management is a drag, and you feel you are constantly out of time. The difficulty is weird. Before the House at the Edge of Time, I can just pummel through everything. There, I have to switch to turn-based, because they killed one of my party members instantly. Wild hunt archers were somewhat overpowered. The ending is also a drag. You just get book events based on your decisions in the game, which isn't fun because after like 120 hours, I really don't remember much of them. \nBut at least there is so much enemy variety compared to the second game, so the fights were more interesting. \n\nIt is a decent CRPG, but there are many better out there.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "Kingmaker is Owlcat Games' very first game and they nailed it. While this game is worth full price, I suggest waiting for a sale. Kingmaker goes on sale for about $3 all the time and at that price it's hard not to suggest this game!\n\n[b]The good:[/b]\n[list]\n    [*]Solid companions and solid writing\n    [*]Character creation is addictive\n    [*]Good mechanics \n    [*]Nok-Nok \n[/list]\n\n[b]The bad:[/b]\n[list]\n    [*]Some encounters are vastly harder than others and some will hard counter certain builds such as trip builds vs swarms/flying/etc.\n    [*]Mostly minor bugs. I have only ran into one significant bug in my first full playthrough which was a recruitable companion not showing up when he was supposed to.\n[/list]\n\nMy suggestions for the best experience: Try a few hours on Easy difficulty if this is your first CRPG and/or you have no prior knowledge of Pathfinder 1E. If this is not your first then try a few hours on Normal. Avoid Challenging and above difficulties for your first play through unless if you're stubborn. There is no shame in looking up build guides and the solution to puzzles if you don't care for Owlcat puzzles. Oh, and save frequently, one manual save at the beginning of each dungeon and quick saves before entering a new room.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The game adapts the tabletop Pathfinder ruleset into a lengthy CRPG about exploration and political leadership. You begin as an adventurer and progress toward ruling a growing kingdom. The narrative mixes dungeon crawling with regional management.\n\nCharacter creation is dense. Classes, archetypes, feats, and spell lists allow deep build paths. New players may feel overwhelmed. Veterans can refine party roles for late-game encounters. Progression rewards system knowledge.\n\nCombat is real-time-with-pause. Positioning, crowd control, and buff sequences influence outcomes. Enemy resistances and saving throws matter. High difficulty punishes unprepared parties. Timing and spell synergy carry weight.\n\nKingdom management adds a strategic layer. You assign advisors, handle crises, and develop regions. Poor management can cause collapse. The system adds consequence but can feel punishing. Events occur on strict timers.\n\nThe Enhanced Plus Edition improves stability, balance, and interface clarity. Loading times are shorter. Visual readability is better. Navigation through inventories and spell books shows less friction.\n\nAudio is effective. Ambient tracks support wilderness zones. Voice acting highlights major conversations. Spell effects and creature sounds provide useful cues. Overall sound design is functional.\n\nThe game suits players who enjoy long CRPG campaigns that reward planning. Complexity is high but yields satisfaction. Kingdom management introduces stress but enhances immersion. Strong value for fans of tactical party building.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Of all the Owlcat games, this is the hardest to get through. \n\nIt was and still is incredibly ambitious and borderline demented, but this ambition comes with drawbacks, many of which they only started to remedy in their more recent titles (WotR and Rogue Trader). It is incredibly long, to the point where the endgame is more of a marathon than a glorious climax. This marathon sadly extends to the gameplay as endless waves of trash fights, for which you still have to sort of min-max and buff up tho (thanks PF 1e), simply get boring and tedious after a while. \n\nChoices and consequences also suffer from the game lenght. Without more specialised RP options and world consequences, any alignment path besides Chaotic good will feel severely out of place and weird. The Mythic system in WotR did wonders to remedy this, but once again this is an example of a lesson learned from a non-functional aspect of Kingmaker. \n\nThe endings are also severely undercooked and do not synergise between eachother, it is so bad I wouldve prefered a \"You win\" screen to what I got. This is a problem in all 3 Owlcat CRPGs to date, and I cannot pinpoint why it keeps happening. Fallout New Vegas did good and cohesive ending slides back in 2010, you dont have to re-invent the wheel here. \n\nSo after all this, why the thumbs up? Well for one, as a product of its time, it is amazing and the sheer gravitas of this game being the springboard from which Owlcat began their rise into the CRPG game market is incredible. Taking something so niche, executing it so incredibly, painstakingly accurate that it actually becomes a detriment and still create a fun and engaging product is nothing short of awesome. \n\nThe build variety is great (Although somewhat limited if one wants to play on anything higher than Normal), the scope of adventuring around and managing a kingdom at the same time feel good (IF IT WAS SHORTER) and some character arcs are legitimately cool, you can become attached to these people as well as your kingdom as a whole and Owlcat's writing definitely proved itself in their very first entry already. \n\nSadly,  less than 10 % of the playerbase has the \"you win\" Achievement. Less than 10 % actually finished the game. This is somewhat expected, considering the niche nature of the game and it many non accessible aspects, but its still sad. In my opinion, no matter how niche, a game shouldn't be not finished by a large majority of players and I blame the lenght above anything. You can play the same Pen & paper campaign for many years, but this lenght, this maturing of story which comes naturally in IRL Roleplaying, cannot be translated to a videogame. \n\nI bet most people had fun for their first 30, 35 or even 40 hours, but just didn't have it in them to run the final 100 miles. In hindsight they didn't miss much, truely, but this problem with Owlcat games dragging on and simply not holding attention long enough started here with their very first release. WotR upped the completion rate to almost 12 % while rogue trader sits at roughly 17 %. They are slowly catching up the Behemoth of BG 3 with its almost 22 % completion rate, but neither has figured out a way to make most people see these long adventures through. \n\nTLDR: Digressions aside, Kingmaker is fun, but tedious. It is detailed but often sloppy. It is grand but often confusing. In the end only the biggest of CRPG fans will see the adventure through, but I like to see the game more as the beginning of a bigger adventure; the adventure of Owlcat games and their struggle to bring CRPGs and niche PnP games solidly into the mainstream. As an \"Act 1\" of this adventure, Kingmaker is well worth a recommendation.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "True bg2 successor, and alongside pillars of eternity, the best cRPG of 2010s. Feels very different to next pathfinder game, it's more grounded and personally feels like playing real ttrpg pathfinder. Music builds great atmosphere, as expected from Inon Zur who created similar music to his previous work on Dragon age origins.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "After a long period of time when I basically only played JRPG's I decided that I needed a change of pace and, since it had been a long time since I'd played any isometric CRPG's I went back to play some of the gems I'd missed over the years. After playing Divinity: Original Sin 1 & 2, Pillars of Eternity and Baldur's Gate 3, I decided to give this one a try.\n\nI'm happy to say I'm having fun with it and that it kind of feels like a middle point between Divinity and Baldur's Gate 3, since it does use the Pathfinder rules, that are based on the D&D open license, but it understandably lacks the high-end cutscenes and visual presentation of the newer game. It's not quite as complex as what Larian does, since their games are really detailed and give you a lot of freedom, but it doesn't feel as outdated and clunky as Pillars of Eternity did, despite the fact that it literally came out a year after the origianl Divinity: Original Sin.\n\nThe game is fun and feels like a newer version of the old Baldur's Gate games, but it does have its flaws, such as the annoying mechanics that have to do with resting and camping when your characters get tired, which happens all the time because the game is literally designed to make you travel from point A to point whatever a ton of times, and it has a glaring flaw with random encounters during those travels because you run the risk of stupid crap like running into a random battle with, say, a dozen greater elementals despite the fact that you're like level 5 and there's zero reason why from a story standpoint so many powerful monsters would be randomly roaming around together in some backwater road, so that if you run into that stupid encounter you're dead no matter what you do and you can't run away easily and you'll lose whatever progress you'd made since your last save. That's just B.S. and a terrible design choice that I'm amazed hasn't been fixed by a patch after so many years and full on gigantic sequel.\n\nOther than that, I'm digging slowly building up my barony/kingdom in parallel of the usual adventuring, since the former usually involves making story-based decisions and managing resources, and the latter is the more traditional gameplay loop where you go out dungeon crawling and fighting monsters or bad guys. I also like that your companions can disagree with you and each other, and sometimes even choices that seem like the \"correct\" one from the traditional \"good guy\" standpoint might elicit an unexpected response from a companion that has some unique view regarding that specific issue regardless of what you'd expect from their alignment.\n\nEdit: After 20+ hours and in the middle of Act 3 I screwed up because I was too busy running my kingdom and chasing timed companion quests and so on, and I realized I had 16 hours to get to the location of a main quest of the kingdom would be destroyed. Thing is, I was all the way to the other side of the map and it was impossible to make it in time so it was game over and there was nothing to be done about it except go back to a save file that has so old that I might as well start over again. I get it, it's on me, but it's still annoying and made me drop the game until I feel like trying again, which won't be in a long time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game is great. Loved the story, the characters and how they adapted the system to a videogame. Loved the antagonist a lot, and voice acting is crazy good. \r\nAnd I love, love the possibility to play as an evil dude. People react to your choices, and game changes. Not sure if I can (mentally) finish an evil run, but the sole possibility of it warms my heart.\r\n\r\nBut its not perfect, and here are some advices to new players:\r\n1. Must-have mods are Bag of Tricks and Cleaner. You can find them on nexusmods.\r\n2. Difficulty levels above Normal are actually hard. There is no shame in playing on normal or easier.\r\n3. Raise kingdom stats early. You want them maxed out as soon as its only possible.\r\n4. Resolve main quests first. After each major story event you will have some time to resolve kingdom issues. Do not act in the opposite order - some main quests, when delayed, will harm your kingdom. \r\n5. The game has a time limit. Do not be intimidated - there is plenty of it. Like, a lot. Just do not lose yourself in side quests completely.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pathfinder is a funny thing. there is a lot of good and a lot of bad stuff to be said about this game ^^.\r\nMost of the game is very much enjoyable. The voice over is mostly pretty good and the optics give a good old Icewinddale / Baldurs gate 2 vibe. Graphics for me a really okay and the story is actually pretty good. It definetely goes beyond \" be the greatest hero of all time\" and has more depth then the average \"ur awesome\"-rpg. i do not wish to spoil the story , but i enjoyed the story a lot so far, and it has allready become clear , daß you are able to make totally different choices on multiple playthroughs. Also having many many very different companions who most of them are really cool in my book , gives you a lot of different options to pick from. The companions are done really really nice, i enjoyed most of them a lot. \r\n\r\nWhile the game seems to be bugfree nowadays, which is great, there are a lot of technicalities about rules and infos that are sadly pretty bad even though many games before using pathfinder or D&D have done this very well. \r\nFor example many talents in pathfinder (feats in english i believe) have prerequisites like certain attribute points and or other feats which need to be taken before. In the source books and or other games you can often or mostly see these. this makes it much easier to plan what kind of character you would like to build. \r\nKingmaker does not have this and in all those years of its existence no one thought it to be a good idea to implement it , even if late. That means if you are not a total freak and know most of them out of the top of your head, or lo and behold if you are someone who likes roleplaying games but you do not know pathfinder, then u are royally screwed. And if you have to go through online pathfinder rulebooks for hours on end to build a somewhat decent charackter,  then i am of the opinion that the ppl who made this game did something wrong. \r\nOn the other hand, when you finally get the gist of it playing is actually a lot of fun. the reason i critisize this so heavily is that there are many situations, where you will get totally wasted if ur characters are not at least in part maximized. That becomes even worse, when most of the characters that the game offers you as companions are the absolute opposite of an effective build. here another example. you will get a tank fighter which is intended as exactly that, a tank. but that charackter lacks enough inteligence to get some of the most important tank skills, which have a prerequisite of 13 intelligence (natural 13). In fact her int is so low it does not even make sense to improve it , because you would have to wait until L16 until you would have int 13. In addition to that, the game gives you advice on what talents to choose when you level up, but very often these advices are very very bad or in some cases they will even mark  some of the best picks as \"do not pick, does not help\". That is kind of mind blowing to me because it leads newcomers astray. And if you have ineffective charackters you will often come into a situaion, where the enemy spawns will totally wipe the floor with you. That is not cool. \r\nWhat is also not cool is, that with the system of building up your country/barony/kingdom you are thrown into the hot water. i for example allready assumed this was a big part of the game and watched about 3 hours or YT-vids and read 4 -5 handouts about it online, and i still had that moment when everything was going fine, that all of a sudden one quest fails , rebellion start instantly and after 10-12 days (that is not long in this at all) all of a sudden a window popps up saying : game over . you ruinied your lands try again. and i had no clue whatsoever how within 14 days my barony fell from stable to rebellious and game over. Again i had to turn towards the online community to get this solved even though i had an idea what it could have been, but the game itself told me shit.  All these things anger me. And while i could save my game by loading a savegame 2 weeks earlier this still sucked in my book. \r\nMuch of the game feels like you are under a lot of time pressure. In all honesty that is not for me. i do not like that. i play to have fun not to get the feeling that i have to rush everything or the game is over. \r\n\r\nIn the end that means you have to decide if the development of your lands and charackters and the story weigh in heavier then the artifical time-pressure and the lack of a lot of explanation. Sure once you have experienced it, u'll know , but i do not like games that are designed to shitcan you early on ,just so they can say: look how hard our game was , dang we did a hard game didn't we!\" But not explaining anything or most of it is not a good difficulty level it is the opposite. \r\nso in the end the question is , would i recommend it. and i say yes. because while i did get frustrated early on a lot , in the end i still had a lot of fun and i kept playing even though i was very short of deinstalling it. \r\nBut i recommend to only get this on a sale or if the full price does not bother you at all . i also advice on the complete edition ,because the addons fit in really well and you should have them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Interesting story.\n\nThe timers are not that bad but still a bit annoying to have.\nThe game tells you how long till the main quests will fail.\n\nCompanion's quests are also really good and interesting.\n\nFor the build i followed a guide since i have no clue how to manage all those active/passive skills and what to choose. Game helps you a bit what to pick.\n\nI didn't know even what item is better than the other. It's not like a regular RPG with regular stat on items.\nEven though, I really enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Big fan of crpgs, but never played pen and paper DnD. It's worth studying the encyclopedia and checking guides. Yeah might take a bit of investment but you will be rewarded many many times more once you get into it. \r\nWill definitely play the sequel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recommended WITH CAUTION. All in all I had a great time with this game but it has a ton of annoying problems. You have to meet it where it's at (which is not a great place) to enjoy it, so beware before buying. Some issues off the top of my head:\n\n* There's a lot of things you need to know that the game doesn't communicate well. Some light googling here and there is necessary to make sure that you haven't missed a whole entire party member, for example.\n\n* Some spells just don't seem to work? For example hypnotism or banishment (which sounds powerful until you try to use it), I never got them to do anything at all.\n\n* In turn based, sometimes you will try to cast a spell in battle and your character moves into position, stops short of casting the spell and you just lose your turn.\n\n* I managed to break a main story quest. There's a major boss that I insta killed by using a clever combination of abilities, which felt very good, but then I found out that there's supposed to be a custcene when he gets to low health and I skipped that. I noticed because the journal said that a certain character had betrayed me and left my party, and I was looking at him right there. I reset to a previous save and I have no idea what would have happened otherwise. In a complex RPG such as this one, it feels especially frustrating to be punished for trying an alternative solution.\n\n* Kingdom management events come with an expiration date, and often you will get swamped with many problems at the same time. You're expected to prioritize, but then some events will expire one month before their stated date.\n\n* The endgame is an absolute slog. I don't know how they thought it was a good idea to spam so many identical and extremely annoying combat encounters. It feels like padding in a game you have already sunk 100+ hours into. You will find a lot of comments online of people who threw their hands up and lowered the difficulty in the very last dungeons because they just couldn't be bothered.\n\nI want to make it clear that there is an excellent game with great characters, combat, and systems hiding underneath all this, but be prepared to exercise a lot of patience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had already played in and then DMed Kingmaker in tabletop before playing this. It's very well polished. It has little changes to the plot of the tabletop module that keep things interesting. It's not the kind of game that I normally play, but I enjoyed it a lot anyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is the game good? Yes, kinda.\nIs a great way to get the Pathfinder experience? Yes, kinda.\nIs the game a pain in the ass? 100% yes\n\nA massive array of content, classes, missions, and management that will humble you at every turn (especially on higher difficulties). However, the game can be obtuse at times, so set your pride aside and don't be afraid to consult character guides or other references to enjoy this experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game seemingly favors its enemies very evidently. The player will always roll bad rolls consecutivley without fail while the enemy rolls good numbers at all times no matter how much you buff up your bonuses. Think you're finally invincible? the enemy will roll nat 20s to remind you that this game was programmed to favor the enemy. It heavily encourages save scumming which is a disgusting habit. have trickery of +16 against a 20 DC chest? roll 3+16 and the chest is locked to you indefinitely. reload the save and the same thing happens 4 times over until the chest is unlocked. absolutely shambolic programming. 5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kingmaker started Owlcat down their contemporary artistic vision of building love letters to a bygone era of table top role-playing games. The history of Pathfinder is central to many of the first backers love of the game. \n\nThe 3.5/4e schism brought Pathfinder; envisioned as the 'capital R' Role-players alternative to the 'lowercase r' roll-players who followed Wizards to 4e. Pathfinder's crunch was envisioned to allow a high level of class customizability compared to what players had come to expect from the typical DnD class system, mainly through feats. In this way to players with the same class would be distinct.\n\nThe differences in the mediums of tabletop and CRPG present unique boons and challenges for the pathfinder system\n\nAt the table top, to achieve this high simulation style of play, players could be dealing with large and time consuming equations often which slows gameplays (and has led to the current eco system of rules lite ttrpgs we see today).\nThe crunch heavy rpg that translates well to a CRPG where your machine can handle the math for you and results are quick and don’t get in the way of the action\n\nHowever, playing your character (let alone the 5 other companions) requires a level of mechanical knowledge, of a now out of date RPG system, that cant be expected of the modern player. Pathfinder 1e/3.5 is a great but flawed product and a great example of a time where high simulation was important to ttrpgs. It's rules are vast and complex and require a strong knowledge of the keywords the game uses and how the interact. Which at the table can be learned through the shared game experience at the table. On your own at a computer, it may requires some research, or trial and error. This is Owlcats first game, and they have made refinements to their latest titles, but Kingmaker in particular is a little light on tutorials for such a complex rpg system. \n\nOne would benefit from having the Pathfinder 1e core rule book while playing, which shouldn’t be required to play, luckily the 3.5SRD is open licence and free online. Skiming the core rules, your class mechanics, and party class mechanics will help reduce the learning curve.\n\nIf you love CRPGs and want to experience one of the best fantasy settings, pathfinder rewards those who take the time to learn. The realms of Golarian are vast and rich and offer something to all roleplayers. Fans of heavy deep lore will be well rewarded for their investments. Deep roleplayers who want to take a character concept a really build it, not just flavour it, will spend hours finetuning builds. The River Kingdoms may seem to be a generic fantasy setting, but scratch the surface and you'll see why you shouldn't judge a book by it's cover.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are new to isometric CRPGs this would probably not be the right game to start with. It's systems-heavy, light-on-tutorials, rather difficult, long, time consuming to master and so on. On the other hand, this is a hobbyist's dream-come-true game. Back when it came out it was the most ambitious CRPG project of its time, and while it did come out in a very subpar state, at this point it's stable and very cheap. For me the only true strike against it is the fact that the story isn't that good or engaging. It is the real successor to Baldur's Gate II though, or at least it used to be until Wrath of the Righteous came out.  Don't sleep on Kingmaker though, once you master the systems - it's a treat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Even after reinstalling it years later i still enjoy the story. One thing to keep in mind with Kingmaker is that it is a long game and a lot of reading when it comes to skills/feats, spells, and abilities. If you like CRPG's and the Pathfinder tabletop games, you will like this game. God luck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "steep learning curve, but complex and lots of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. It's a bit buggy at times, but still very entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is fun has some issues but for being the first ever published game by the company its beyond stellar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a beautifully well crafted game.\nI only wish there were not so many child-like elements introduced via characters like Linzi and Tartuccio. If the whole thing looked a bit more serious or grown up, this would probably be the best RPG I ever played.\n\nMaybe I change my mind yet, but the start was a bit of \"lets manufacture a story plot out of plastics so it suits where we want to steer this\" pain, a lot of early aspects of the story were not really believable and felt outright awkward. Which is a shame for such a beautiful game, to not polish the story element sufficiently. And also if the story is not that perfect, one can work with that and not expose it so much on each and every step, which would provide more freedom for the players.\n\nAnother thing is the Technic League... Why, tell me why is the tech religion of today so strong, that even historical RPG does not resist the temptation to somehow embrace the tech aspect and put such a stupid tech church into a game taking place in the middle ages? I sincerely hope not to discover some kind of AI related crap included as well...\n\nThe variety of roles, characters, stats, items, I mean it is amazing but sometimes one thinks if its not a bit too much of everything.\n\nAs far as I can say, the hybrid real time / turn combat is perfect, despect many people here having different position. I think it is implemented and working really well and smooth.\n\nStill would buy again, just wish the focus was more clear cut and true to the historical reality.\nI recommend it for a buy if you have a lot of time to read all the dialogues and study all the mechanics. Bear in mind that even the task of equipping group of 8 with the best items available is a bit time consuming, wish UI offered a bit more help in this regard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good old game. An old-style cRPG. If you like BG1, BG2, PS:T, PoE, PoE2, or, of course, DND 3.5/PF1, you will like this game. Some QOL mods are recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The time limits are not that bad and you are warned when things are getting much worse, giving you time to react. You can also just put the kingdom building into auto, so if that was holding you back from trying the game out, just go and buy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun once you understand pf mechanics and kingdom mgmt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Biggest bang for the buck out there. Nice mechanics, old school charm. Doesn't get much better than this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kingdom management sucks straight buns but the story is great (although i have mixed feelings with stuff that goes on towards the end).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4.5 stars. Great fun, good story line, lots of side quests. Literally hundreds of hours of content. Some buggy / baffling quests which were mildly annoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For Hardcore DnD Nerds who want complexity and epic scopes as well as micromanagement - this is IT!. The stuff you couldnt do in tabletop, you can do here!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] 9/10. [/h1] If you like table top D&D and RTS games this is a solid win and it's on sale pretty much every second week. If you are mostly into FPS and racing games, probably not for you haha.\nI'm not a professional reviewer so I'll give some Pro's and Cons and some game changing tips i wish i knew sooner.\n\n[h1] Pro's: [/h1] - The Price. The game and all expac's are on sale alot.\n- [u] The Story [/u] and side stories are amazing. Every odd location has a fun event that triggers. You may stumble upon a goblin army or giants sleeping in a cave each with their own dialogue checks that effect the encounter. The Main story runs like arcs and each one if unique in its own way but follows a solid progression.\n- [u] The Companions [/u] are very engaging. Nearly all of them are great to play with, some are game breaking-ly fun [Alchemist] and others you may want to respec. I will let you figure out who lol. Their independent story lines are great, simple and very easy to run.\n- [u] The Game play [/u] is good in a way you can swap between auto-play and turn base. If you want a BG3 type of game, turn auto off. If you want to steam through a victory or get your ass completely handed to you because you don't use spells, keep it on.\n\n[h1] Cons: [/h1]\n- [u] FOMO [/u] is real in this game, alot of tasks in the kingdom management don't get completed. All I can say is, keep an eye on what quests punish you for missing them, let the others go. Most of them will be repeated.\n- [u] Being Overwhelmed [/u] can happen fast once you get past the tutorial of [spoiler] beating the stag lord. [/spoiler] You get thrown alot of stuff at once with not alot of explanation about kingdom management. Just go to reddit, it helped me alot.\n- [u] Time limits [/u] on the main story can be a pain. Don't worry about the tutorial time limit. You can't really muck that up unless you try. I took my time and still had a solid 21 days left. BUT pay attention in arc 2 and 3. It sneaks up on you.\n\n[b] Tips: [/b]\n-Scatter your towns away from you'r capital. Place teleportation circles in your towns. Fast travel is life changing in this game.\n-Take your time with the story. Some things you think are trivial play into the main arc and give you extra dialogue checks later.\n-Like all D&D games, pay attention to your stats for combat AND kingdom management. Their main stat helps when they become advisers.\n-Amiri. Always use Amiri she is a powerhouse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "now that my heart has mended after dying a stupid death in an ironman campaign I can say: it's a good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My favorite game since Baldur's Gate 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty okay old school game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed it a lot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fuck those fucking trolls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it's kinda neat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much better then WotR",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "EPIC~~~!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started Pathfinder: Kingmaker thinking I’d be the noble ruler of a proud realm.\nTen hours later, I was knee-deep in tax reports, kingdom unrest, and three missing companions because I forgot to rest for five days.\nEvery decision feels important until you realize the real enemy isn’t trolls or undead — it’s the RNG dice roll that keeps ruining your diplomacy.\nThe combat is brutal, the dialogue is endless, and the loading screens give you time to reflect on your poor life choices.\nBut somehow… it’s brilliant. The story sucks you in, the companions are lovable disasters, and every victory feels earned — mostly because you survived the UI.\nI wanted to be a ruler, but ended up a sleep-deprived peasant with a crown.",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "One of the few RPGs that veers away from the typical 'chosen one/save the world' storyline. Instead, Kingmaker places you at the head of a group of adventurers who attempt to establish a barony in an unclaimed land. \n\nThe companions in this game are in my opinion its standout feature. Almost all of them are well written and a joy to travel with and fight alongside. The companion stories are all well done and some are even directly tied to the main quest which makes them feel like an integral part of the story and not just your lackeys. All in all, this gives the game a very 'Fellowship of the Ring' vibe which I absolutely loved. \n\nThe main story itself is excellent, though it is a slow-burn. At the start the stakes are relatively low - which again is rare for RPGs. As you go along, the narrative slowly begins to unravel and the stakes ramp up. It all culminates in a satisfying conclusion which makes you feel like the choices you made along the way mattered. \n\nThe only things holding it back is the somewhat clunky Pathfinder 1E system and some questionable encounter/dungeon design. Essentially, if you're not familiar with the system, you will struggle with even the tutorial encounters. Either play on a lower difficulty until you find your footing or refer to a guide online. The game also has some performance issues in some areas/battles - even though I play on a decent rig, I still got major frame drops in some sections.  \n\nThen there's the Kingdom Management section of the game which is quite polarising. If you lose in this management sim, your campaign will end! Thankfully, you can circumvent this by lowering the Kingdom Management difficulty to the lowest setting, so it's not that big of an issue. Alternatively, you can skip the sim entirely by putting it on Auto mode. Personally, I wouldn't recommend this as you lose out on a lot of flavour and character interactions that are exclusive to this mode.\n\nStill, the pros far outweigh the cons overall. Kingmaker is simply one of the best role-playing experiences to come out in recent times! \n\n[b] 9/10 [/b]",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Kingmaker is Owlcat Games' very first game and they nailed it. While this game is worth full price, I suggest waiting for a sale. Kingmaker goes on sale for about $3 all the time and at that price it's hard not to suggest this game!\n\n[b]The good:[/b]\n[list]\n    [*]Solid companions and solid writing\n    [*]Character creation is addictive\n    [*]Good mechanics \n    [*]Nok-Nok \n[/list]\n\n[b]The bad:[/b]\n[list]\n    [*]Some encounters are vastly harder than others and some will hard counter certain builds such as trip builds vs swarms/flying/etc.\n    [*]Mostly minor bugs. I have only ran into one significant bug in my first full playthrough which was a recruitable companion not showing up when he was supposed to.\n[/list]\n\nMy suggestions for the best experience: Try a few hours on Easy difficulty if this is your first CRPG and/or you have no prior knowledge of Pathfinder 1E. If this is not your first then try a few hours on Normal. Avoid Challenging and above difficulties for your first play through unless if you're stubborn. There is no shame in looking up build guides and the solution to puzzles if you don't care for Owlcat puzzles. Oh, and save frequently, one manual save at the beginning of each dungeon and quick saves before entering a new room.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "It is undercooked. Exploration is not satisfying. You basically find a cave or similar on like 90% of them. No interesting sidequests and choices don't really make too much difference. Weirdly, the two Pathfinder games (this and wotr) have a similar premise, as a female bad guy can get absolution in the end. Kingdom management is a drag, and you feel you are constantly out of time. The difficulty is weird. Before the House at the Edge of Time, I can just pummel through everything. There, I have to switch to turn-based, because they killed one of my party members instantly. Wild hunt archers were somewhat overpowered. The ending is also a drag. You just get book events based on your decisions in the game, which isn't fun because after like 120 hours, I really don't remember much of them. \nBut at least there is so much enemy variety compared to the second game, so the fights were more interesting. \n\nIt is a decent CRPG, but there are many better out there.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "Of all the Owlcat games, this is the hardest to get through. \n\nIt was and still is incredibly ambitious and borderline demented, but this ambition comes with drawbacks, many of which they only started to remedy in their more recent titles (WotR and Rogue Trader). It is incredibly long, to the point where the endgame is more of a marathon than a glorious climax. This marathon sadly extends to the gameplay as endless waves of trash fights, for which you still have to sort of min-max and buff up tho (thanks PF 1e), simply get boring and tedious after a while. \n\nChoices and consequences also suffer from the game lenght. Without more specialised RP options and world consequences, any alignment path besides Chaotic good will feel severely out of place and weird. The Mythic system in WotR did wonders to remedy this, but once again this is an example of a lesson learned from a non-functional aspect of Kingmaker. \n\nThe endings are also severely undercooked and do not synergise between eachother, it is so bad I wouldve prefered a \"You win\" screen to what I got. This is a problem in all 3 Owlcat CRPGs to date, and I cannot pinpoint why it keeps happening. Fallout New Vegas did good and cohesive ending slides back in 2010, you dont have to re-invent the wheel here. \n\nSo after all this, why the thumbs up? Well for one, as a product of its time, it is amazing and the sheer gravitas of this game being the springboard from which Owlcat began their rise into the CRPG game market is incredible. Taking something so niche, executing it so incredibly, painstakingly accurate that it actually becomes a detriment and still create a fun and engaging product is nothing short of awesome. \n\nThe build variety is great (Although somewhat limited if one wants to play on anything higher than Normal), the scope of adventuring around and managing a kingdom at the same time feel good (IF IT WAS SHORTER) and some character arcs are legitimately cool, you can become attached to these people as well as your kingdom as a whole and Owlcat's writing definitely proved itself in their very first entry already. \n\nSadly,  less than 10 % of the playerbase has the \"you win\" Achievement. Less than 10 % actually finished the game. This is somewhat expected, considering the niche nature of the game and it many non accessible aspects, but its still sad. In my opinion, no matter how niche, a game shouldn't be not finished by a large majority of players and I blame the lenght above anything. You can play the same Pen & paper campaign for many years, but this lenght, this maturing of story which comes naturally in IRL Roleplaying, cannot be translated to a videogame. \n\nI bet most people had fun for their first 30, 35 or even 40 hours, but just didn't have it in them to run the final 100 miles. In hindsight they didn't miss much, truely, but this problem with Owlcat games dragging on and simply not holding attention long enough started here with their very first release. WotR upped the completion rate to almost 12 % while rogue trader sits at roughly 17 %. They are slowly catching up the Behemoth of BG 3 with its almost 22 % completion rate, but neither has figured out a way to make most people see these long adventures through. \n\nTLDR: Digressions aside, Kingmaker is fun, but tedious. It is detailed but often sloppy. It is grand but often confusing. In the end only the biggest of CRPG fans will see the adventure through, but I like to see the game more as the beginning of a bigger adventure; the adventure of Owlcat games and their struggle to bring CRPGs and niche PnP games solidly into the mainstream. As an \"Act 1\" of this adventure, Kingmaker is well worth a recommendation.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Really mixed feelings.\r\n\r\nWhat I liked:\r\n- The plot.\r\n- The companions and their quests.\r\n- The game mechanics.\r\n\r\nWhat I disliked:\r\n- Most quests have hidden time limits that you’re not informed about. I often failed quests while exploring the world, then had to reload earlier saves just to finish them before the unknown deadlines.\r\n- You need to be very careful when leveling up your character. If you play for the first time and avoid build guides, you can easily end up with a weak build and struggle against enemies in certain areas.\r\n- The final quest forces you to follow it immediately, causing all unfinished tasks to fail. This also prevents you from earning any additional achievements afterward.\r\n- Sometimes the game bugged, but not very often. Most of the time it happened during combat, and simply re-entering fight mode fixed it.\r\n\r\nOverall, I really enjoyed the game, though it was a bit frustrating that I couldn’t complete some quests or get most of the achievements.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "The game adapts the tabletop Pathfinder ruleset into a lengthy CRPG about exploration and political leadership. You begin as an adventurer and progress toward ruling a growing kingdom. The narrative mixes dungeon crawling with regional management.\n\nCharacter creation is dense. Classes, archetypes, feats, and spell lists allow deep build paths. New players may feel overwhelmed. Veterans can refine party roles for late-game encounters. Progression rewards system knowledge.\n\nCombat is real-time-with-pause. Positioning, crowd control, and buff sequences influence outcomes. Enemy resistances and saving throws matter. High difficulty punishes unprepared parties. Timing and spell synergy carry weight.\n\nKingdom management adds a strategic layer. You assign advisors, handle crises, and develop regions. Poor management can cause collapse. The system adds consequence but can feel punishing. Events occur on strict timers.\n\nThe Enhanced Plus Edition improves stability, balance, and interface clarity. Loading times are shorter. Visual readability is better. Navigation through inventories and spell books shows less friction.\n\nAudio is effective. Ambient tracks support wilderness zones. Voice acting highlights major conversations. Spell effects and creature sounds provide useful cues. Overall sound design is functional.\n\nThe game suits players who enjoy long CRPG campaigns that reward planning. Complexity is high but yields satisfaction. Kingdom management introduces stress but enhances immersion. Strong value for fans of tactical party building.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I tried to start a few times and always ended up finding something more interesting to do instead. Between attempts, I did a bunch of research, and I discovered that the game, while interesting, has a huge number of sharp corners that can result in an extremely unpleasant experience.\n\nOne dungeon at the end of the campaign in particular, The House on the Edge of Time, or something like that, is infamous for having many players drop their campaigns in it.\n\nFor such a massive game, the prospect of encountering these things is very discouraging. Especially since i'm sure a good portion of my time here would simply be padding.\n\nBesides that, the very easy possibility of creating useless builds if you don't have a deep understanding of the system (because balancing a video game with this amount of variables is practically impossible) or being overwhelmed by a kingdom management system that even the game's most die-hard fans seem to hate tells me the game doesn't seem worth the time.\n\nStill, with the little I've played, I've been able to recognize qualities that some players might appreciate, such as a high level of customization and role-playing opportunities (as long as it's within the game's simplistic tone), and the nearly inexhaustible replayability these factors offer.\n\nThe presentation in almost every way is excellent for a mid-budget game in this genre.\n\nAnd for better or worse, at least they do a good job of covering the game with information everywhere, so as long as you have the patience for a tutorial format that requires a lot of effort and probably isn't all that worthwhile, it should work because the information will at least be there, in ample detail, even if not intuitively.\n\nThe writing, however, seems quite poor. Long paragraphs, full of redundant prose. No objectivity whatsoever. Flowery, but lacking eloquence or genuine emotion to color the text and simultaneously function as a conversation.\n\nIt doesn't take long, and right in the prologue, you'll see examples of diplomacy checks where the logic and arguments presented make no sense, and certain characters will accept very stupid and forced opposing arguments simply because you failed the checks.\n\nPeople with completely nonsensical motivations who seem to have stepped out of a cartoon for very young children.\n\nThe characters seem like parodies straight out of the rulebooks.\n\nThe feeling I got was that a game designed to fit a niche of 10-year-olds who have a PhD.\n\nStill, you might be one of those legendary kids, or you might be more tolerant of the writing than I am, and actually get to the meat of the story and find something interesting there, or you might simply enjoy the gameplay for its gargantuan complexity. So, since I didn't make it all the way to the end, I'll give it a thumbs up. Because I actually didn't find anything major wrong with the game so far, though I've resigned myself to not trying to play it again.\n\nIt seems like an ambitious project that could well benefit from being cut in half and having the rules and options streamlined to make it easier to join in on the fun, if it even exists.\n\nThe general recommendations I found were to ignore more than half of the content, which is always a bad sign.\n\nP.S: There's a popular YouTuber who's made several very comprehensive and extensive video guides about this game and its sequel (to several RPGs, actually) called Mortismal Gaming.\n\nIf you have no idea what you're getting into, I recommend checking it out and watching a few things so you don't make unnecessary mistakes and waste your time restarting campaigns or reading irrelevant information.\n\nAlternatively, another channel called MandaloreGaming has a video giving an overview of the game, without going into too much detail, more accessible for those who don't want to waste two hours watching the other guy.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Yea I bought the game when it came out and it was unplayable. i've tried it several times, it got better and better but i never had the time to fully finish it. now i think it's really great crpg. But still hates the kingdom management system oh god please owlcat, now i've played all three games. Hated kingdom management, hated crusader, hated fleet battle... can we pleassssssseeeeee not",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Amazing lore. Amazing mechanics. Unique blend of tactical, pause, strategy play.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It has been too long since I played this to give a good thorough analysis, but seeing it only has a \"mostly positive\" score made me want to toss another positive review onto the pile.\n\nBasically there are two bad bordering on terrible things in the game: the ability to get an unavoidable \"game over\" through kingdom management events if you do not read a guide to understand how it works, and the fact that there is a timer in a game where exploring at your own pace seems like it should be the entire point--see also the kingdom management game, because games ending abruptly for reasons you did not see coming is just plain bad no matter how you look at it.\n\nBUT GUESS WHAT basically every other thing about the game is good to great, even amazing, and I heartily recommend anyone with even a passing interest in party-based CRPGs take a crack at this one.  Sometimes I spontaneously think about how much fun I had talking to some of the companions in the game--particularly Harrim despite him seemingly being mostly overlooked--between sessions of fun exploration and combat and awful kingdom management simulators, and honestly I was having fun with that aspect UNTIL I discovered it can end your game if you do not understand you need to complete the same events a half-dozen times, not that the game was bugged and I might as well just ignore yet another group of rampaging trolls.  The narrative is extremely satisfying overall, and other than the endgame's abrupt shift to every enemy type being one you rarely fight throughout the rest of the game and you might not at all be geared towards fighting, I have basically no complaints about how it went.  At least now that the bugs are fixed.\n\nBasically every complaint about how easy or hard combat is can be solved by changing the game's difficulty on the fly; I know, it felt surprising to me, too, but after a while playing with the difficulty raised because my party was stomping everything in sight and suddenly hitting an encounter where some of the enemies could kill me in a single round, I realized I either had to have perfect knowledge of the setting or, much more simply, turn the difficulty down for 5 minutes and get back to enjoying the game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Another fantastic game from the studio. Unfortunately, I’ve never been a fan of timers in games, so that part spoiled the experience a little for me. But if you can look past the timer, what you get is a huge, large-scale CRPG with an incredible amount of content, great visuals, engaging gameplay, a fairly standard story, and some pretty solid characters.\n\nThe sheer amount of content alone deserves endless praise—especially considering this was the studio’s very first game. Oh, and I played with the real-time combat system (always prefer it over turn-based) with a speedhack set to x3, which made the gameplay even more dynamic and fun.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "After a long period of time when I basically only played JRPG's I decided that I needed a change of pace and, since it had been a long time since I'd played any isometric CRPG's I went back to play some of the gems I'd missed over the years. After playing Divinity: Original Sin 1 & 2, Pillars of Eternity and Baldur's Gate 3, I decided to give this one a try.\n\nI'm happy to say I'm having fun with it and that it kind of feels like a middle point between Divinity and Baldur's Gate 3, since it does use the Pathfinder rules, that are based on the D&D open license, but it understandably lacks the high-end cutscenes and visual presentation of the newer game. It's not quite as complex as what Larian does, since their games are really detailed and give you a lot of freedom, but it doesn't feel as outdated and clunky as Pillars of Eternity did, despite the fact that Pillars of Eternity literally came out a year after the original Divinity: Original Sin but still manages to feel like a much older game.\n\nKingmaker is fun and feels like a newer version of the old Baldur's Gate games, but it does have its flaws, such as the annoying mechanics that have to do with resting and camping when your characters get tired, which happens all the time because the game is literally designed to make you travel from point A to point whatever a ton of times, and it has a glaring flaw with random encounters during those travels because you run the risk of stupid crap like running into a random battle with, say, a dozen greater elementals despite the fact that you're like level 5 and there's zero reason why from a story standpoint so many powerful monsters would be randomly roaming around together in some backwater road, so that if you run into that stupid encounter you're dead no matter what you do and you can't run away easily and you'll lose whatever progress you'd made since your last save. That's just B.S. and a terrible design choice that I'm amazed hasn't been fixed by a patch after so many years and full on gigantic sequel.\n\nOther than that, I'm digging slowly building up my barony/kingdom in parallel of the usual adventuring, since the former usually involves making story-based decisions and managing resources, and the latter is the more traditional gameplay loop where you go out dungeon crawling and fighting monsters or bad guys. I also like that your companions can disagree with you and each other, and sometimes even choices that seem like the \"correct\" one from the traditional \"good guy\" standpoint might elicit an unexpected response from a companion that has some unique view regarding that specific issue regardless of what you'd expect from their alignment.\n\nEdit: After 20+ hours and in the middle of Act 3 I screwed up because I was too busy running my kingdom and chasing timed companion quests and so on, and I realized I had 16 in-game hours to get to the location of a main quest or the kingdom would be destroyed, which triggers an automatic and unavoidable game over. Thing is, I was all the way to the other side of the map and it was impossible to make it in time so it was game over and there was nothing to be done about it except go back to a save file that has so old that I might as well start over again. I get it, it's on me, but it's still annoying and made me drop the game until I feel like trying again.\n\nEdit 2: After literally going off to play the entirety of the sequel Wrath of the Righteous and its DLC's, so that I got over my annoyance at my previous screw-up playing this game, I decided to start over again from scratch and make a new character taking advantage of all I learned during my first failed playthrough and my WotR playthrough and I have to say that I really enjoyed the experience. \n\nI was actually surprised that I kept running into stuff I didn't encounter the first time around, including many more quests, a couple of recruitable companions I didn't meet the first time, and locations/items my characters didn't find due to having lower/different Perception scores. So, in sum, except for a few bugs and clunky mechanics having to do with traveling from place to place or the way the game uses \"real\" time to trigger events, I honestly think this is a really good game and I appreciate that the sequel has a very different story and each of the two games felt distinctly their own thing, despite being loosely connected by virtue of the setting and some NPC's you meet in both games. I hope they make a third one, and I'll play the WH40K games made by the same studio in the meantime.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[h1] 6/10 - A Clunky but Still Enjoyable cRPG [/h1]\nPersonally, I would recommend Owlcat's follow-up game Wrath of the Righteous before I recommend this one; I think the quality-of-life changes goes a LONG way in making the game feel better, and it has a lot of the same mechanics & gameplay feel.\nAs for Kingmaker itself, the main things on offer is the deep character customization and story, alongside the combat. I think the experience of gradually growing into a ruler of this realm is a fun one story-wise, especially as your character grows in tandem. Unfortunately, this game is weighed down a lot by an annoying lack of quality-of-life features, subsystems that can just feel really clunky at times (Kingdom Management) and some combat encounters that are just... painful.\nIf you really enjoy cRPGs, then I feel like its absolutely worth giving a shot, but if you're unsure about them as a whole, I think theres a lot better out there to try instead.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "True bg2 successor, and alongside pillars of eternity, the best cRPG of 2010s. Feels very different to next pathfinder game, it's more grounded and personally feels like playing real ttrpg pathfinder. Music builds great atmosphere, as expected from Inon Zur who created similar music to his previous work on Dragon age origins.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Pathfinder: Kingmaker – Enhanced Plus Edition\n\nThis game doesn’t babysit you. Every fight, every decision, every misstep hits hard — and that’s what makes it great. The Enhanced Plus Edition finally fixed the mess from launch and turned it into a proper campaign worth your time.\n\nTactical combat, deep character builds, and real kingdom management — not filler, not clickbait. You actually feel like you’re leading, not just questing. Writing’s solid too — loyalty, betrayal, and the burden of command, all wrapped in an unforgiving world.\n\nIf you like your RPGs with teeth, this one delivers.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I recently started playing it again after all these years.  Its a fun and solid game",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is great. Loved the story, the characters and how they adapted the system to a videogame. Loved the antagonist a lot, and voice acting is crazy good. \r\nAnd I love, love the possibility to play as an evil dude. People react to your choices, and game changes. Not sure if I can (mentally) finish an evil run, but the sole possibility of it warms my heart.\r\n\r\nBut its not perfect, and here are some advices to new players:\r\n1. Must-have mods are Bag of Tricks and Cleaner. You can find them on nexusmods.\r\n2. Difficulty levels above Normal are actually hard. There is no shame in playing on normal or easier.\r\n3. Raise kingdom stats early. You want them maxed out as soon as its only possible.\r\n4. Resolve main quests first. After each major story event you will have some time to resolve kingdom issues. Do not act in the opposite order - some main quests, when delayed, will harm your kingdom. \r\n5. The game has a time limit. Do not be intimidated - there is plenty of it. Like, a lot. Just do not lose yourself in side quests completely.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pathfinder is a funny thing. there is a lot of good and a lot of bad stuff to be said about this game ^^.\r\nMost of the game is very much enjoyable. The voice over is mostly pretty good and the optics give a good old Icewinddale / Baldurs gate 2 vibe. Graphics for me a really okay and the story is actually pretty good. It definetely goes beyond \" be the greatest hero of all time\" and has more depth then the average \"ur awesome\"-rpg. i do not wish to spoil the story , but i enjoyed the story a lot so far, and it has allready become clear , daß you are able to make totally different choices on multiple playthroughs. Also having many many very different companions who most of them are really cool in my book , gives you a lot of different options to pick from. The companions are done really really nice, i enjoyed most of them a lot. \r\n\r\nWhile the game seems to be bugfree nowadays, which is great, there are a lot of technicalities about rules and infos that are sadly pretty bad even though many games before using pathfinder or D&D have done this very well. \r\nFor example many talents in pathfinder (feats in english i believe) have prerequisites like certain attribute points and or other feats which need to be taken before. In the source books and or other games you can often or mostly see these. this makes it much easier to plan what kind of character you would like to build. \r\nKingmaker does not have this and in all those years of its existence no one thought it to be a good idea to implement it , even if late. That means if you are not a total freak and know most of them out of the top of your head, or lo and behold if you are someone who likes roleplaying games but you do not know pathfinder, then u are royally screwed. And if you have to go through online pathfinder rulebooks for hours on end to build a somewhat decent charackter,  then i am of the opinion that the ppl who made this game did something wrong. \r\nOn the other hand, when you finally get the gist of it playing is actually a lot of fun. the reason i critisize this so heavily is that there are many situations, where you will get totally wasted if ur characters are not at least in part maximized. That becomes even worse, when most of the characters that the game offers you as companions are the absolute opposite of an effective build. here another example. you will get a tank fighter which is intended as exactly that, a tank. but that charackter lacks enough inteligence to get some of the most important tank skills, which have a prerequisite of 13 intelligence (natural 13). In fact her int is so low it does not even make sense to improve it , because you would have to wait until L16 until you would have int 13. In addition to that, the game gives you advice on what talents to choose when you level up, but very often these advices are very very bad or in some cases they will even mark  some of the best picks as \"do not pick, does not help\". That is kind of mind blowing to me because it leads newcomers astray. And if you have ineffective charackters you will often come into a situaion, where the enemy spawns will totally wipe the floor with you. That is not cool. \r\nWhat is also not cool is, that with the system of building up your country/barony/kingdom you are thrown into the hot water. i for example allready assumed this was a big part of the game and watched about 3 hours or YT-vids and read 4 -5 handouts about it online, and i still had that moment when everything was going fine, that all of a sudden one quest fails , rebellion start instantly and after 10-12 days (that is not long in this at all) all of a sudden a window popps up saying : game over . you ruinied your lands try again. and i had no clue whatsoever how within 14 days my barony fell from stable to rebellious and game over. Again i had to turn towards the online community to get this solved even though i had an idea what it could have been, but the game itself told me shit.  All these things anger me. And while i could save my game by loading a savegame 2 weeks earlier this still sucked in my book. \r\nMuch of the game feels like you are under a lot of time pressure. In all honesty that is not for me. i do not like that. i play to have fun not to get the feeling that i have to rush everything or the game is over. \r\n\r\nIn the end that means you have to decide if the development of your lands and charackters and the story weigh in heavier then the artifical time-pressure and the lack of a lot of explanation. Sure once you have experienced it, u'll know , but i do not like games that are designed to shitcan you early on ,just so they can say: look how hard our game was , dang we did a hard game didn't we!\" But not explaining anything or most of it is not a good difficulty level it is the opposite. \r\nso in the end the question is , would i recommend it. and i say yes. because while i did get frustrated early on a lot , in the end i still had a lot of fun and i kept playing even though i was very short of deinstalling it. \r\nBut i recommend to only get this on a sale or if the full price does not bother you at all . i also advice on the complete edition ,because the addons fit in really well and you should have them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AMAZING game, lots of replayability but its a text heavy game that could have hugely benefited from some voice acting.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is really fun, the systems work well. Wish there was more character appearance, but that's probably a product of the time the game was produced. Character ability customization is very robust, almost too many options. Graphics look great, especially considering the time this came out.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's a worthy cRPG game that deserves a better rating than it has on Steam.  Played 100 hours and I feel like I'm not even halfway through my first playthrough.  The character creation is pretty intense so just pick what you're interested in and don't worry about minmaxing or following a guide unless you get stuck.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Good game. Interesting story.\n\nThe timers are not that bad but still a bit annoying to have.\nThe game tells you how long till the main quests will fail.\n\nCompanion's quests are also really good and interesting.\n\nFor the build i followed a guide since i have no clue how to manage all those active/passive skills and what to choose. Game helps you a bit what to pick.\n\nI didn't know even what item is better than the other. It's not like a regular RPG with regular stat on items.\nEven though, I really enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Big fan of crpgs, but never played pen and paper DnD. It's worth studying the encyclopedia and checking guides. Yeah might take a bit of investment but you will be rewarded many many times more once you get into it. \r\nWill definitely play the sequel.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun, it's groovy, you get to make lots of character choices.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "being mean is evil L-O-L i cant with these games, but I was pleasant surprized by this game. You better know pathfinder rules cause this game does not hold your soft hands.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have rage quit this game **SEVERAL** times without ever getting to the ending. This is a great, fun and interesting game - but it **WILL** allow you to corner yourself into plot points and endings that you're not willing to live with. As someone who really struggles with the idea of not giving my NPCs their perfect endings... this game is probably not healthy for me.\n\nThe first time I played this game I got as far as the final Boss' lair before I realised there was a whole ass companion who I'd never met - somehow managed to miss the opportunity to invite him to the party - and another companion that I royally fucked up the plot line to and had to fight to the death. OK... well fuck... guess I'll restart the game... \n\nI've ALMOST beat this game about once a year since 2018 - and I'm unsure if I'll ever get to the actual end of it before another update comes out, breaks my mods, and tosses me into a mist of nerd rage that is probably legal grounds for my wife to enact the Baker Act.\n\n10/10 - would play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story, and the fact you kind of manage your own kingdom, merged with RPG group building game, is a great combo. Only minus (AND A BIG ONE) is the luck based and just so unfair feeling combat, even on normal difficulty. If you can look past that, the game's fire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great combination of RPG, text based adventure, and kingdom management",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had already played in and then DMed Kingmaker in tabletop before playing this. It's very well polished. It has little changes to the plot of the tabletop module that keep things interesting. It's not the kind of game that I normally play, but I enjoyed it a lot anyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is the game good? Yes, kinda.\nIs a great way to get the Pathfinder experience? Yes, kinda.\nIs the game a pain in the ass? 100% yes\n\nA massive array of content, classes, missions, and management that will humble you at every turn (especially on higher difficulties). However, the game can be obtuse at times, so set your pride aside and don't be afraid to consult character guides or other references to enjoy this experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game seemingly favors its enemies very evidently. The player will always roll bad rolls consecutivley without fail while the enemy rolls good numbers at all times no matter how much you buff up your bonuses. Think you're finally invincible? the enemy will roll nat 20s to remind you that this game was programmed to favor the enemy. It heavily encourages save scumming which is a disgusting habit. have trickery of +16 against a 20 DC chest? roll 3+16 and the chest is locked to you indefinitely. reload the save and the same thing happens 4 times over until the chest is unlocked. absolutely shambolic programming. 5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kingmaker started Owlcat down their contemporary artistic vision of building love letters to a bygone era of table top role-playing games. The history of Pathfinder is central to many of the first backers love of the game. \n\nThe 3.5/4e schism brought Pathfinder; envisioned as the 'capital R' Role-players alternative to the 'lowercase r' roll-players who followed Wizards to 4e. Pathfinder's crunch was envisioned to allow a high level of class customizability compared to what players had come to expect from the typical DnD class system, mainly through feats. In this way to players with the same class would be distinct.\n\nThe differences in the mediums of tabletop and CRPG present unique boons and challenges for the pathfinder system\n\nAt the table top, to achieve this high simulation style of play, players could be dealing with large and time consuming equations often which slows gameplays (and has led to the current eco system of rules lite ttrpgs we see today).\nThe crunch heavy rpg that translates well to a CRPG where your machine can handle the math for you and results are quick and don’t get in the way of the action\n\nHowever, playing your character (let alone the 5 other companions) requires a level of mechanical knowledge, of a now out of date RPG system, that cant be expected of the modern player. Pathfinder 1e/3.5 is a great but flawed product and a great example of a time where high simulation was important to ttrpgs. It's rules are vast and complex and require a strong knowledge of the keywords the game uses and how the interact. Which at the table can be learned through the shared game experience at the table. On your own at a computer, it may requires some research, or trial and error. This is Owlcats first game, and they have made refinements to their latest titles, but Kingmaker in particular is a little light on tutorials for such a complex rpg system. \n\nOne would benefit from having the Pathfinder 1e core rule book while playing, which shouldn’t be required to play, luckily the 3.5SRD is open licence and free online. Skiming the core rules, your class mechanics, and party class mechanics will help reduce the learning curve.\n\nIf you love CRPGs and want to experience one of the best fantasy settings, pathfinder rewards those who take the time to learn. The realms of Golarian are vast and rich and offer something to all roleplayers. Fans of heavy deep lore will be well rewarded for their investments. Deep roleplayers who want to take a character concept a really build it, not just flavour it, will spend hours finetuning builds. The River Kingdoms may seem to be a generic fantasy setting, but scratch the surface and you'll see why you shouldn't judge a book by it's cover.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are new to isometric CRPGs this would probably not be the right game to start with. It's systems-heavy, light-on-tutorials, rather difficult, long, time consuming to master and so on. On the other hand, this is a hobbyist's dream-come-true game. Back when it came out it was the most ambitious CRPG project of its time, and while it did come out in a very subpar state, at this point it's stable and very cheap. For me the only true strike against it is the fact that the story isn't that good or engaging. It is the real successor to Baldur's Gate II though, or at least it used to be until Wrath of the Righteous came out.  Don't sleep on Kingmaker though, once you master the systems - it's a treat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Even after reinstalling it years later i still enjoy the story. One thing to keep in mind with Kingmaker is that it is a long game and a lot of reading when it comes to skills/feats, spells, and abilities. If you like CRPG's and the Pathfinder tabletop games, you will like this game. God luck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "steep learning curve, but complex and lots of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. It's a bit buggy at times, but still very entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is fun has some issues but for being the first ever published game by the company its beyond stellar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a beautifully well crafted game.\nI only wish there were not so many child-like elements introduced via characters like Linzi and Tartuccio. If the whole thing looked a bit more serious or grown up, this would probably be the best RPG I ever played.\n\nMaybe I change my mind yet, but the start was a bit of \"lets manufacture a story plot out of plastics so it suits where we want to steer this\" pain, a lot of early aspects of the story were not really believable and felt outright awkward. Which is a shame for such a beautiful game, to not polish the story element sufficiently. And also if the story is not that perfect, one can work with that and not expose it so much on each and every step, which would provide more freedom for the players.\n\nAnother thing is the Technic League... Why, tell me why is the tech religion of today so strong, that even historical RPG does not resist the temptation to somehow embrace the tech aspect and put such a stupid tech church into a game taking place in the middle ages? I sincerely hope not to discover some kind of AI related crap included as well...\n\nThe variety of roles, characters, stats, items, I mean it is amazing but sometimes one thinks if its not a bit too much of everything.\n\nAs far as I can say, the hybrid real time / turn combat is perfect, despect many people here having different position. I think it is implemented and working really well and smooth.\n\nStill would buy again, just wish the focus was more clear cut and true to the historical reality.\nI recommend it for a buy if you have a lot of time to read all the dialogues and study all the mechanics. Bear in mind that even the task of equipping group of 8 with the best items available is a bit time consuming, wish UI offered a bit more help in this regard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good old game. An old-style cRPG. If you like BG1, BG2, PS:T, PoE, PoE2, or, of course, DND 3.5/PF1, you will like this game. Some QOL mods are recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The time limits are not that bad and you are warned when things are getting much worse, giving you time to react. You can also just put the kingdom building into auto, so if that was holding you back from trying the game out, just go and buy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun once you understand pf mechanics and kingdom mgmt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's a learning curve even for experienced strategy & D&D gamers but it's worth it. Excellent game with so many hidden gems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is randomly typed text. To just fill the box that stopa me recomending good game without some text...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty cool. The RNG feels very unfair sometimes, but the story is pretty cool, there's decent variety in classes, etc. They definitely improved things immensely in Wrath of the Righteous on that last point, but this one is still pretty cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's my first CRPG and it can feel a bit overwelming at first. I'm playing on easy so combat isn't too punishing. With a bit of research and a few guides, you'll pick up on progression and party management soon enough. The world is vast and vibrant. You'll love it if you love high fantasy and want that cozy nostalgic feeling of reading an epic novel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like these rules better than the D&D ones. What I feel is fun to pick during level up more relates to becoming a better fighter in that regard, to me. \r\nOn the other hand, It is not perfect. Very important things that should be obvious is hidden rather deep in a fight log. I had to restart a few times and watch some youtube videos before I sort of 'got' the mechanics.\r\nSometimes I'd face a new foe and think wtf is going on, some enemies have attacks that completely wiped my party with no chance of winning and I had not chance to know in advance(maybe I should have listened more to other players). So don't be like me and pick [spoiler]blind fight and give someone ability to cast the spell \"echolocation\" and \"glitterdust\" too late.[/spoiler] I'd sometimes be hidden behind walls and unable to see anything, and many fights became rather cheesy. Better players than me might be able to make it without cheese.\r\nBut the adventure! That is where the game is brilliant. Everything I say might be a spoiler but it is like I expected early on. The game expands as you go and turns into a great story. I like the companions and how the game lets you act out the alignments and mildly both rewards and punishes you for being everything good, bad, lawful, chaotic, or neutral.\r\nI barely started on wrath of the righteous and I can see that game has improved many of the things that were troublesome in kingmaker.(like being able to turn the camera and better UI) so I look forward to that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a lot of tedious things in the game, but still enjoyed it overall.\r\n\r\nI almost gave it a thumbs down because of my bard :\\ Not cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DONT BUY THE GAME IF YOU ARE ON NEWER RTX CARDS \n\nthe game dosent run well its almost unplayable on newer gpus it crashes every 5 minutes !! \nsuch a shame a good game ruined by its crashes, used to run well on 1660ti but almost impossible to play on rtx5050  \n\ni have tried everything \n-borderless window\n-prefer max perfrmance from gpu\n-older drivers\n-installed older directX run times \n-reinstalled many times\n-tried playing on lower graphics \n-tried limiting the fps to 60 \n\nNOTHING works, the game just keeps crashing every 1 minute\n\n\nEdit: this was a driver issue, but still the game inst without its flaws \n1.the audio constantly stutters (usually fixed by closing and reopening the game)\n2.and still has a lot of bugs \n\nBut, none of that should be very concerning, It has an excellent Story campaign and amazing characters with even more amazing development of their personalities and the Rules are fun to understand and build your main character around (just dont play it on Unfair ) . Even the Kingdom management is well done dosent feel too much like a chore its just the right amount to add risk/flavor to the game makes our choices heavier. a 10/10 game for me ! \n\n(i still hate the buggy unity engine used to make this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first Owlcat game playthrough and I am guessing that I am about halfway through. Enjoying the story line, visuals, sound track, though miss the voice over across the entire story. Nevertheless, having a great time going through and experiencing the Pathfinder world. Looking forward in playing Owlcat's other titles, too. \r\nMy typical gamestyle, I lose interest rather quick. Having raked up this amount of hours in a game, that's a very good sign. Thank you Owlcat in delivering a great gaming experience for me on this one and hope to find the same on your other titles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far, I've made it into Act 3, 30 days after finishing Act 2, and my God this game is fucking great, knocked it out of the park for me so far, I'm addicted to it, I find it to be more enjoyable than Baldur's Gate 1, and it letting you swap between turn-based and real-time is fantastic, it makes the easy encounters be done quickly instead of having to do each turn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is probably like a 7/10 as a fan of Pathfinder. The exploration in an untamed wild, questing, meeting interesting characters, that's all great and feels like playing the TTRPG, and I became super invested... The only problem is that the kingdom sim part of it, which was one of the biggest selling points, also feels like the weakest part of it, to the point that it almost feels like a punishment when you finally get to it.\r\n\r\nThe game starts you out by introducing you to the fun adventuring and exploring part, and then when you actually get your kingdom, it dumps a ton of new mechanics on you all at once and gives you a ton of things to keep track of, and I couldn't help but think.... man, I really wish I could just do the adventuring part of this, because that was super fun. It's a shame, because the kingdom sim aspect is the titular thing that's supposed to drive the game (it is \"Kingmaker\" after all), but those mechanics just felt boring and cumbersome after experiencing the other aspects of the game. \r\n\r\nYou can set it to \"Auto mode,\" and ignore the kingdom to an extent, but certain things will still fail, and you do still have to do certain quests on a timer or the kingdom will crumble and you'll fail. This game would be a 10/10 for me if I had the option of giving the barony to one of the other characters and spending the rest of the game being an adventurer hired by them to do quests and help people in the frontier without ever worrying about any of the kingdom sim mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game after both WotR and RT, and it still holds up.\n\nIt has a nice story, curated dialogues and companions, and overall offers a great CRPG experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best of the best game here. As always. Newervinter 2, Pathfinder 1 and 2... Yeah baby. They are the topest RPG's in this world. OwlCat - Horray, Im with you as I always was!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing so far, cannot wait to see what the rest of the game holds!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definately recommend this great game, but 2 thigns to know:\nUnless your a pathfinder scholar, understanding hot to build a character is difficult. WAY TOO much know..not just if your min-maxing, but just getting a solid character.  I just stayed single class but felt like I was not doing it right. \nAlso, while the amount of content is great ( i spend 200 hours playing it), at a certain point I just wanted it to be over. Being a completion-ist, I struggled through, but it was a struggle.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "There is much to enjoy but you have to fight this game to make it bearable. The companions are interesting and the story is solid but the pacing is horrible. The first three acts are composed of tedious quests that have little significance. Only towards the end of act 3 does the story finally begin. Random encounters are annoying but luckily you can adjust your skills to minimize them. The combat can be long and unforgiving so adjusting the difficulty is recommended. Despite the game coming out long ago, some of the original bugs are still here, insane. At the end of act 6 the game does not give me a key cutscene. I have tried everything and no solution. I could keep going but I refuse to continue without that key moment. You should really skip this game and go to wrath of the righteous.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is terrible. Just terrible. I wanted to try it because I had so much fun with Rogue Trader, but oh dear does it have some really poor design choices.\n\nRight from the start, the game puts a ticking clock on your main quest, and if you don't finish it in time you can outright lose the game. What kind of an idiot thought it was a great idea to force the player to run against a clock at the very beginning of the game, when we're still trying to learn how everything works? Incredibly bad idea that is only further compounded by the fact that if you then do try to finish the quest quickly, you'll find that you're constantly meeting enemies that are way higher level than you are.\n\nSo which is it Owlcat? Are we in a hurry and need to rush the objective, or do we need to stop and grind for XP along the way? I'm glad I bought this miserable experience at a discount because I won't be spending another 2 seconds trying to solve that poorly thought out problem.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "[h2]Review after 3 Hours: Deep Pathfinder System, Annoying Prologue & Characters[/h2]\nI really wanted to like this game. It clearly offers a deep and faithful implementation of the Pathfinder ruleset - all the feats, skills, spells, and checks are there, and the interface for reviewing character builds and progression is nicely done.\n\nWhat completely turned me off, though, was the prologue and its characters. The game forces on you an obnoxious female Bard companion who insists on chronicling your adventures because “you’re destined to be a hero.” That alone was grating, but what really broke it for me was discovering that the [i]journal interface[/i] is written entirely from the Bard’s perspective  meaning this irritating character is tied directly to the game’s core UI.  I don’t know if that changes later, but it was enough to stop me right there.\n\nThe setup also leans hard on clichés,  a sweaty, bloodthirsty female barbarian, a snarky evil sorcerer you have to tolerate for no reason, and the usual “heroes summoned to a mansion for a shared quest” trope. It all felt predictable, and the so-called twist in the prologue didn’t help.\n\nThat said, there’s no denying the game looks good for its genre and has a lot of mechanical depth. Fans of the Pathfinder ruleset will probably enjoy it. But for me, the writing, tone, and character presentation in the early game were just too off-putting.\n\n[b]Rating:[/b] ★★☆☆☆ (2/5)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want to like this game, and there is almost a soft spot in my heart for it, but ultimately it is a mediocre drag.\n\nThe main two root problems are:\n\n[list]\n    [*]The Pathfinder system piles on complexity without weighing the value vs. cost\n    [*]Owlcat's ambitions went off in wild directions (such as the kingdom management) instead of being more ambitious with the core design.\n[/list]\n\nKingmaker is a quantity over quality product, which wouldn't be such a problem except the quantity isn't evenly distributed. At times the player is flooded with quantity to the point of everything becoming noise, and at other times the content is stretched sparsely so there are large gaps in anything new and significant.\n\nA game of this size should never need to stretch its content, but it does.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "On paper this is everything I want out of a game. I love Neverwinter Nights and this is like that on steroids. And yet I have tried playing this time like 4 different times and each time I play like 2 hours and put it down for months until I try again. I think this game gives me decision paralysis by introducing so much so fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game but very buggy.  Probably encountered at least 5 game breaking bugs that were only fixable by reverting to an older save, pray to god that your auto save was recent.  Fell through the floor bug maybe 3-4 times.  Locked in place dialogue cutscenes would start but never progress maybe 10+ times.  Also filled with so many purposefully done mechanics and story decisions with gameplay impact forced upon you by the devs that appear to exist to only annoy the pants off the player.  I was constantly shocked at how obnoxious so many parts of the game were when they just didn't need to be.  So many story goals were so obtuse and poorly explained that I found myself frequently looking up a guide to see if the game had bugged out.  Many quests can be failed if you go \"left instead of right\".  Kingdom management was awful and through just regular probabilities, a percent of players who try to honestly engage with it will fail through no fault of their own due to a bizarre dev choice to have failed missions impose a kingdom stat penalty.  Get too many 1s in a row and you tank your stats and it's now impossible to do missions with that character.  It's such a foolish punishing system to use D20 on.  1 out of 20 players will get the 1.  And now 1/20 of those players will get a second 1 and they're basically ruined.  I wanted to give this a positive score but it really is filled with so many flaws, so many of which were intentional by the devs to just spite the players i guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h3] An ambitious game ruined by one of the most atrocious combat systems I have ever had the misfortune to experience. It is completely unplayable. 2/5 [/h3]\n\n[i] On my scale, a 2/5 game is disappointing, unfun, or otherwise not worth the purchase price. There are definitely better alternatives, and I highly recommend you consider finding one of those. [/i]\n\nThe scale and scope of this game is impressive. I was SO excited when I booted it up to experience a new RPG system even if it was going to be a jankier older game.\n\nAnd then, I came to learn that the jankiness of this game is entirely based on the absolutely, mindnumbingly frog-brained decision to make every single simulated dice roll impossible to hit. I am not joking when I say that [b] it took me 30 minutes to fight a pack of 6 level 2 spiders [/b] which suddenly activated their trap card, whacked me 4 times, killed me entire party, and then I had to spend another 30 minutes refighting (and that time the rng favored me at least).\n\nWhoever is responsible for this combat system needs to be glued to a chair and subject to 50 consecutive hours of missing their cantrip spell attacks against a level 1 centipede.  Doesn’t help that even if you do land a cantrip, it does 1 damage. Wow, very cool.\n\nDon’t get me started on the permanent stat debuffs that cripple your characters if they so much as get scratched by a rat’s literal ass. My 17 dexterity sorceress somehow ended up with a grand total of 3 fucking dexterity after 4 hours of the spider cave. The only way to get rid of this following the [i] INTENDED [/i] “normal” difficulty was to basically sleep for 2 in-game months. (?!?!?) I then switched that setting off and regained the use of my legs, which I would’ve loved to have realized I could do before spending 25 minutes desperately trying to extricate this character from the middle of a PERMANENT web trap that covered 90% of a room’s surface area. \n\nThe characters seem interesting, the party dynamics look like they allow for a massive variety of depth in gameplay, the character creation screen has an overwhelming number of complicated choices, and the game seems absolutely massive. I really wanted to experience all of that positive stuff, and if the developers literally came back to the game and patched in a fix to the awful “to-hit” roll balancing (and cantrip spell damage), it would probably be a fun enough game to power through and experience.\n\nBut they haven’t patched in a fix, 7 years after the game was released. So, don’t even bother trying to enjoy this, because you won’t.\n\nUnfortunately, it is literally impossible to play this game and complete it within an average human lifespan. I already felt like it took 10 years off my life on account of the agony of consecutive dice rolls. So rather than play this, go play BG3. Or anything else.\n\nIt is telling that the majority of positive reviews are entirely conflicted on why they’re providing a positive recommendation while the majority of negative reviews are scathing.\n\nI hope they fixed this crap with Wrath of the Righteous because this is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Story is boring as sin, and the \"choices\" in many cases lack any nuance and are absent of what a interesting character (you as a character in this game, but also in many examples your NPC Companions) would decide to do. Many of the kingdom actions and decisions are surface level and have no long stretching consequences in the campaign that i've seen. Your characters \"moral\" options are a joke because in cases where your NPCs may betray you or act out of line the choices are either you let them go with no consequence, lightly scold them, or... Hack of their head in a execution. In either the cases of hacking off their head or scolding them the game will punish you for making decisive actions like this, not with a alignment shift, but also because you eliminated the super cool character some writer wrote up by having the penalities be rather harsh now that their gone. In many cases these characters personal quests tie into your kingdoms prosperity to in alot of cases, so rather than just having the consequence of not getting to  use your NPC companion or learn their full story, but your kingdom is somehow dragged down a level or two. Also good luck on making a replacement for that companion you dismiss or kill if there also a  advisor for you, they often are the best in slot and you get a inherent penalty for using multiple custom characters, unless you were to mod their stats to reduce the mercenary debuff given which is only really there to enforce you using the NPCs the game gives you for a party,  which helps speak to the confidence the writers have in their own work or the agency of a player.\n\nCompanions are in general terribly written, unlikable or subversive or traitorous for characters that really have no excuse for doing these things other than to annoy the player. If the game basically didnt make it mandatory to use most of them as advisors I would have dismissed or killed many of them.\n\nThe game is also extremely buggy in Acts 3 & 4 to the point where I would have to go back on saves made a hour or two before a decision (thank god i save fairly regularly) or download toybox to fix the initiation for quests after looking them up and realizing that they were bugged and not working properly. \n\nGameplay itself is quite alright, Pathfinder has always been a exceptional ttrpg system and translates well into the game barring a few hiccups that can be expected for any CRPG or a system with alot of crunch and expansive as Pathfinder, which i do not blame the dev for its just naturally going to happen and they did well keeping the spirit of the tabletop into combat for better or for worse. This does mean in some cases your expected to min-max a bit if you want to be able to get through tougher challenges or to advance without wanting to rip your hair out, but you have enough wiggle room to make variant characters and not have to level the same 4 skills to max every level up if you know what your doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've recently finished BG3 and was hoping to find something that would scratch the same itch. Unfortunately, this is not it. \n\nThe plot seems quite interesting but the mechanics really show their age. The characters move super sluggishly and combat is chaotic. Also the voice acting is quite irritating.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't believe this was a game created by Owlcat, but I guess everyone has to start somewhere.\n\nDo not waste any time on this game, just play WOTR (Pathfinder: Wrath of the Righteous). \n\nThis game is an uncomplete mess and the juice is just not worth the squeeze when compared to the other games that owlcat has developed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of attack rolls for your team will miss regardless of actual chance to hit. Spent 14 rounds of combat trying to land one hit on a single enemy. Combat ended in a party wipe.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pathfinder: Kingmaker is an RPG that is a lot of fun at the beginning, but unfortunately quickly becomes redundant. In the game, the kingdom is constantly plagued by threats such as pandemics, wars with neighbours and barbarians. Although the story is okay at the beginning, it eventually becomes uninteresting due to the unreasonably long playing time. What we have here is a story for perhaps 30 to 35 hours stretched to almost 80 hours, according to HLTB.\n\nAnother point of criticism is the unnecessarily difficult battles in the later stages of the game. Instead of the enemies becoming stronger and more powerful, you are simply bombarded with an excess of 20 to 30 enemies. This not only affects the game performance, but also the enjoyment of the game.\n\nOne annoying aspect is that potential companions can be missed. As these companions are needed for kingdom management, this leads to problems. An example is a companion who is found in an uninteresting location during a single specific main quest. It is possible to spend the entire game without a chamberlain, causing the kingdom to fail and the game to be lost. One could argue that you should simply explore more, but this leads to the next point of criticism.\n\nAll quests have an invisible time limit, which reduces the enjoyment of the game. Although it is realistic that NPCs do not stay in one place indefinitely, this gives the player little freedom. What if you want to pursue the main quest before doing the companions' side quests? What if you want to explore the map, but time passes and you run the risk of losing the game? What if you just want to spend a few months in the game managing the kingdom?\n\nThe questlog often does not give you enough information. In the majority of the quests you will find yourself wandering all over the world map hoping to finally find the place you are supposed to go. I think it's pretty obvious that this, along with the time limit, is pretty bad design.\n\nDespite these points of criticism, there are also aspects worthy of praise. The level of difficulty can be customised very nicely so that both pros and newcomers can have fun with the game. In addition, kingdom management can be minimised by only taking on the most necessary tasks. The lore of Pathfinder is also explained quite well, so that even players who have never come into contact with Pathfinder before are not completely lost.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fun until you realize that at the end of the day this is a dice rolling simulator, and since there's no actual GM to work with the player gameplay boils down to \"Roll a 20? You win. Roll a 1? You Lose, Skill Issue.\" The player has very little actual agency beyond character creation, and the storyline is not good enough to justify spending hours at a time rolling a 20-sided die over and over again hoping \"just roll high bro 4head\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having bounced off the bitterly disappointing Kingmaker PF2E module (also we got owned because we're bad), I thought I'd give Kingmaker another try. I thought having the Kingdom turns be automatable and skipping the group consensus element that the tabletop module forces on you would be nice, and it is, but as this isn't a review of the tabletop game I can only say it's still a boring and disappointing system regardless. The Kingdom system drives a lot of the plot but there is little tangible incentive to actually engage with it beyond \"you have to\", so it very quickly becomes a chore that keeps you from the meat of the game, the adventuring. It could have done with either being much more abstract, or much more granular, but the system would require a complete ground up rework to be engaging to me.\n\nThe combat itself is built on a strong basis, with the Pathfinder First Edition system being a solid tabletop system. The NPC companions are pretty unlikeable (save for Linzi, who grew on me) and unmemorable, the second most interesting being Valerie who happens to be probably the weakest class in the entire system and certainly of the starting companions. You severely lack options for Cleric or INT caster archetypes that are only somewhat fixed when you get access to a Sorceror, or the Arcane Trickster you can lean more into the magic side with. Nobody is a conventional, well-rounded base class by default, and while you can retrain them  more or less as you please it's irritating getting to grips with a roster full of quirky subclasses and learning what they can do when I'd really rather just have the NPC companions be simple archetypes while my own character can grow as desired. There are automation options, but these just further divorce you from the decision making process. \n\nLuckily, the game is not all that hard, so you don't really need to care about the above composition issues that much, but rather repetitive to the point of boring. Slogging through overly large zones separated by long stretches of overland travel, which don't really run into each other as much as feel like separate instances is just not enjoyable, before you get into the tedium of progressing the kingdom to even access the content. It feels very much like the game is padded out to keep you from noticing how thin it is outside of the core content, which is still not even all that good. I didn't feel motivated to finish the game because I just got bored, which is honestly pretty rare for me, and didn't even catch up to the part in the Tabletop we TPKed at, which was my motivation to play the game in the first place.\n\nIf you have played every other CRPG and are dying for a new one then by all means play it, but I would strongly recommend just picking up WOTR instead, which has far fewer of the downsides. To sum it up, it just feels like Kingmaker doesn't respect your time - just adding mounts could've fixed about a quarter of what's wrong with the game. At least it's pretty cheap and regularly goes on sale at 80% off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First the positive parts: Graphics actually look decent. Which is nice to see, some of these kinds of games really need help in that department, but this one doesn't. Especially when you factor in it's age. Another thing I liked is that much of it is voiced. Always a good choice in my opinion. \n\nNow for the not so positive parts: Even after all this time, it still feels like it's in beta. There's a certain lack of polish that you'll run into, that other games in this genre don't seem to suffer from. No map zoom, buttons that definitely should be there but aren't, some buttons are hidden behind their menus, party not always moving when you tell it to... there's a long list of problems. Really does feel like a beta. \n\nAnd you can really tell it's a product of it's time, which typically brings a game down. The gyno centrism is strong, with this one. I made a male character cause I'm a male like everyone else that's gonna play this, and I left the starting area with a party of all women. Right. Feel the immersion. As far as I can tell, there was no way for me to avoid this. Especially given the party I was attempting to build. In fact, that's another problem with the game, it has very small character selection. You can purchase different ones for a high price in the game, but who knows if they'll be voiced or have quests. So your first instinct is to avoid doing that, leaving you stuck playing a harem anime. \n\nBut yes if you're into boss chicks and women in nearly every position of power, you'll like this game. You know the drill, you've seen it enough by now. Your female characters are of course stronger than a gorilla on steroids. One of them comes with a sword that there's no way she could even lift. And wouldn't you know it, the patriarchy was keeping her down! They wouldn't let her be a man. Also the barrony controls feel convoluted and disorganized, and the game generally seems to take itself too seriously. For example, it talks about how leveling up may just be too complicated, and it offers to do it for you. It's about as easy as it gets, you click through a few screens just like all the rest of these kinds of games. Yeah I want my fighter to have shield focus, cause she's (lol) tanking all the damage. And my rogue needs to have good perception! Yup, hard choices like that mean you might not be smart enough to figure this game out! Aside from the poor pacing of the game, I see zero reason to do some kind of deep dive into character creation. So I'm not sure why this guy doubts his players' intelligence. \n\nOn the whole, I can't recommend it. Unless you can get this thing for like $2 or $3 on a deep discount, avoid it. And that's only if you just can't get enough of these games and you've already played all the rest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It may be tedious and boring but don't worry, it's also bug-ridden and poorly balanced",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Even on easy difficulty 20 hits missed in a row against the weakest enemies. Absolutely impossible to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally leaving a bad review after several hours of great gameplay because Owlcat decided to start using Steam announcements as ads for unrelated games.\n\nWhoever thought that was a good idea should be fired.\n\nI'll change it back to positive if the ♥♥♥♥ up is at least acknowledged.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Absolute generic CRPG with see-once scenery and art.   LIke, why bother, Devs?\n\nShit-trope after shit-trope.  Skip all his boring-ass, shite, dice-based neckbeards idea of a DND game.\n\nDice works fine with pen an paper and a human DM. \n\nOn a computer, Dice lack any subtlety or nuance, and it plays like lazy ass shit.   Fucking stop it, Devs.\n\nAt least the voice acting is...present...\n\nManager: \"Hey guys! what if we hired all the voice actors but NO producer!?! We only need one take, right?\" \n\nOh? They DID hire a producer...and continued to pay them...after seeing their work...Lots to unpack there.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Story's okay. Combat is somehow very complicated, yet shallow and boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "right now i cant go a 20 round with out the ai rolling 15-20 and i keep rolling 1-6 so fuck my build because the ai just cheats",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too old-school, even for someone who's played 3.0 and 3.5 until well after they were discontinued.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So this is one of those hardcore DnD games that a lot of DnD players enjoy obviously. I do have experience with DnD games, I played Baldur Gates 2 and 3, I played Divinity Origin Sin 1 and 2 and Dragon Age 1. \r\nAnyway, this game is apparently too hard core to me. Unless you know how exactly to roll your character from the start, be prepared that you will be steamrolled by a single level 1 swarm of flies. And if you somehow accidentally have a character with a fly killing spell, there will be other enemies that you whole team will \"miss\" hitting at because thats how DnD rolling works. Like the whole encounter will be - 6 characters miss against one low level NPC and it will slowly chip away at your team till they all dead. Sorry, shit like this is not for me, but you do you. Good luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games should be fun - this one isn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just not very fun",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its mid",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have mostly negative takeways from Kingmaker, most have to do with the RTwP combat system, encounter design and balancing, as well as stability issues. The few things it does get right are not enough to make up for all the dubious design choices and other shortcomings.\n\nPositives:\n\n• The writing starts off weird, like a Tumblr user's fanfic with characters using silly terms like \"freaking\", \"kick butts\" etc. Fortunately it is an anomaly that is mostly contained to the prologue, the quality shifts for the better after that and stays consistent throughout.\n• Nice art direction on the monsters and some good variety there too, I also like the environments.\n• The soundtrack is pretty nice.\n\nMixed:\n\n• Most of the quests are fetch quests, the main story is where the quality content is at but you won't be doing that for 150h. I was very disappointed with the way most of the Companions' arcs ended, they build up throughout the game towards what you'd expect to be a satisfying climax only to end on a whiff. Also I really did not appreciate the shoehorned way they handle Linzi - just a PSA: if you, like me, have Linzi as your party's main support & lockpicker/ disarmer, do yourself a favor and remove all her gear before entering the final dungeon.\n• Speaking of companions, they are written fine, I enjoyed them for the most part. they aren't up there with the best from Dragon Age (ie. 1 & 2), Mass Effect, DOS2 and not even close to BG3 companions but they are good enough.\n\nNegatives:\n\n• RTwP. This abomination of a combat system single-handedly kills off most games in the cRPG genre, it is a relic of gaming much like fixed camera angles and tank controls are and it should be left alone as such. To actually make it work takes a lot of effort and even then it is just better to either have full realtime combat or full turn-based.\n• Atrocious encounter design and wildly inconsistent general balancing, dubious design choices. Enemy spam, constant interruptions while you travel the map. Random one shots can happen wherever and whenever even on lower difficulties. Enemies not only have access to but also spam CCs that last for like 30+ seconds (hello Wild Gaze.) \"Permanent\" debuff types that can be removed only by Resting, such as losing levels and attributes/ stats. If you want to clear the hard content, you read a guide on how to min-max and then spend a good 5 minutes stacking like 50 buffs before every tough fight.\n• Time limits and not just on side quests but main quests too, that give you a Game Over if ignored. I legitimately cannot think of any game that has time limits and was praised for it, Kingmaker is most certainly not an exception to that.\n• Kingdom management, this is almost universally disliked from what I've seen and read, even the devs themselves added options to skip it completely, that's how bad it is. Just padding to inflate playtime, not to mention that mishandling it can brick your campaign if you don't save often because of the way in which it interacts with time limits.\n• UI: imo half of the mastery in making cRPGs/ Strategy games is in how clean and readable the UI is, if your game has convoluted mechanics but the UI is good, it creates a pleasant and rewarding learning environment for the player. When the UI looks and feels sloppy it does the opposite, case in point Kingmaker. And don't get me started on the lack of QoLs, I feel like I'm walking away from the game with a strained wrist from all the clicking due to inventory management.\n• So many bugs and glitches, poor overall stability. For starters, the game minimizes if you alt-tab or click on a 2nd monitor when you have it on \"Borderless Windowed\" - that kind of defeats one of the primary purposes of that setting I think. Random total slow-mos on your party that happen very frequently, which you fix with Pause/ Unpause. Characters get stuck on invisible walls, especially when combat is triggered. Death's Door can trigger randomly on area traversal, and sometimes it doesn't get healed even when resting in safe areas. New items and existing ones get sorted completely randomly and erratically in your inventory, skipping entire empty columns or even pages for some reason - if you do inventory management to fix it, they'll auto-sort next time you interact with merchants or your storage anyway. Achievements don't unlock way too often and it really sucks when it happens to quests that span the entire game eg. Magic Prison. I was very thorough in my playthrough, so thorough that after checking every unlock condition I should've had 3/4 of the total achievements yet I finished with only 1/4 unlocked. If the game loses focus often (alt-tab, clicking on second monitor) it messes up either your Storage or Memory, it creates system-wide slowdowns and micro-freezes that don't go away even if you turn it off, what fixes it is signing out of Windows or a full restart.\n\nEven with all the cheesy nonsense this game overwhelms you with I was very close to walking away from it having had an okay experience because it does have some charm to it, however the final area just dialed the nonsense up to eleven with the enemy and CC spam, frustratingly obtuse area and puzzle design as well as cheesy encounters. Literally every negative aspect that I could tolerate before got compounded to 3-5h of non-stop frustration that had me breathing a sigh of relief when it was all over. I just can't recommend Kingmaker for anyone but the biggest cRPG/ DnD addicts with how flawed of an experience it is. Go play Divinity or Baldur's Gate instead.\n\n🔳 Broken\n🔳 Shovelware\n🔳 Awful\n🔳 Bad\n🔳 Mid\n☑️ Okay\t\t\n🔳 Good\n🔳 Great\n🔳 Excellent",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game is \"ok\". So many bad decisions in otherwise very good game ruins the score:\n\n- There is no take 20 in the game. Save reload each time you try to pass a dice check  because your trickery check with +40 bonus against a 42 DC lock rolled a 1. Mode solely to satisfy a miniscule amount of RP players who actually take bad rolls and continue. [b]You should not have fun. [/b]\n\n- The main quest notoriously has a timer something which has not been done since fallout 1 for a reason. People hate it and it should always be hated. You are fucked without a guide and lose potentially hundreds of hours if you were unaware. Done to give resting a downside , which is done to annoy you. [b]You should not have fun. [/b]\n\n- Stat bloat , item bloat and general bloat of any numbers in the game. I actually applaud a developer to allow levels 1 to 20 in a single campaign but they do not know how to let players have fun. The encounters in the game are adjusted way too high to the point normal enemies boast AC's of 40 and 300 HP without any reason at all but make it a slog. Everyone drops +5 weapons and is immune to everything because... [b]You should not have fun. [/b]\n\n- CC spam... Developers must detest a regular exchange of DPS so every encounter is a CC galore... Hardcore fans think this is ok because they CC spam too. It is a spell DR and save roll game instead of AC and AR. You wanted a straight fight? no. you can only have dirty CC in pathfinder:cheesemaker. [b]You should not have fun. [/b]\n\n- Overland travel takes time and you must rest to avoid massive penalties of being exhausted from travelling. Oh but when you rest you lose precious time, since your main quest is timed you should pay good attention when to explore and where to explore. How? Read a guide of course what else? or did you think you shall explore freely in the spirit of good RPGs? remember [b]You should not have fun. [/b]\n\n- Alignment locked decisions. Yes you heard it right. Want to punch an asshole in the face? Sorry can't do you are lawful good. Want to stay neutral in a big conflict... no no.. only chaotic players can do that. Roleplaying is done in the character creation screen not in game. [b]You should not have fun. [/b]\n\n- Dumbest achievements ever designed in an 300+ hour RPG. 75% of all achievements I got (and I only got around 60 % of total) are rare achievements despite me following a 600 page long guide.. a simple mistake a conversation chose wrongly can block you from a dumb achievement 200 hours in.. [b]You should not have fun. [/b]\n\n- Difficulty curve is all over the place.. One moment you are moving down goblins the other moment you are sweating against demigod level human bandits. Hardcore fans would say you can play the game with hands tied to your back and typing with your nose because all they do is multiclass dipping, abusing CC spells like grease, stinking cloud. Every member of your party should invest in persuasion because we are going to spam dazzling display to eliminate that pesky 40 armor class. Why? Why not? If you are not meta gaming to death you are not allowed to complain about the difficulty. Get your finger out of your ass and get your Monk/Paladin/Eldritch Knight Lawful Evil character and start meta-gaming too. Bashing on people who want to play a normal RPG in reddit is bonus. [b]You should not have fun. [/b]\n\n- Stat damage spam. Enemies especially in the late game do not try to kill you. They are made to deal ability damage just to force you to rest to cast restoration. Clever eh? Enemies cast CC and spam ability damage / disease not to kill the MC but to annoy the player. Let that sink in, [b]You should not have fun. [/b]\n\n[hr][/hr]\n\nThe developers want to hinder you from saving and loading, which some idiots in gaming space call \"savescumming\" an incredible dumb take on a computer game which disqualifies anyone uttering it from being taken seriously. How they do that? force one-time DC checks on you regularly, no search button and locks can only be attempted once. Surely you will get tired from looking at loading screens and join their side of 'properly' playing an RPG.\n\nThe developers want you to not rest after each encounter because it is not how you would do it on tabletop. So they force travel time/exhaustion and top it with main quest timer. But why? Because it should not be fun. \n\nThe developers want you to utilize every spell in game so they make encounters in a way that pre-buffing is a must and buffs are there to close disadvantages not give you any advantages. What do you mean you want to cast Damage Dealing spells? No sir you want to take every buff at each spellcaster in your party. You want to cast Lvl 9 spell Power Word Kill and feel like Irenicus from Bg2  ? Sorry that only kills stuff under 100 health and those stopped existing from the mid-game. Take extended , empowered, maximized grease instead. Trust us it is fun.\n\nThe developers want you to replay the game because it is their beloved magnum opus and you SHOULD love it! what do you mean you do not want to replay this tedious thing for another 300 hours for a single achievement? Here is an alignment locked decision, here is an ambigious quest with dumb choices. Here are some long-term effects no one can know without a guide! \n\n[hr][/hr]\nREMEMBER : [b]You should not have fun. [/b]\n[hr][/hr]\n\nI can go on for ages... very sad because there is actually a good game beneath all this crap. Developers did a way better job in their second pathfinder game and even better in the 40k rogue trader adaptation. They learn but their first attempt is a mess. This game though;  It smells like developers trying too hard to punish players and to create the most obnoxious and tedious experience ever for no other reason than to cater to a tiny part of cRPG players who have no lives, no friends and hate themselves.\n\nIf you are going to play this game.. Read a comprehensive guide fully from start to end and if you still want give it a go you have been warned. Only 9,6 % of players finished the game... think about it.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I took too long completing a quest and this caused me to fail the entire game. That is such a colossally stupid design decision.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Kingdom management ruined the game for me. Had a great time with the story and questing, but found my game to be suddenly ended from a cascading series of dumb kingdom events. Really unfortunate way to lose the game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There is much to enjoy but you have to fight this game to make it bearable. The companions are interesting and the story is solid but the pacing is horrible. The first three acts are composed of tedious quests that have little significance. Only towards the end of act 3 does the story finally begin. Random encounters are annoying but luckily you can adjust your skills to minimize them. The combat can be long and unforgiving so adjusting the difficulty is recommended. Despite the game coming out long ago, some of the original bugs are still here, insane. At the end of act 6 the game does not give me a key cutscene. I have tried everything and no solution. I could keep going but I refuse to continue without that key moment. You should really skip this game and go to wrath of the righteous.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Played most of this game on the Deck. Long story short, I gave it every chance possible. It does not want me to have fun. ENDLESS loading screens, performance degrades as you play, poor writing, bonkers balance (get paralyzed for 40+ rounds easily and fail every save imaginable until it sorts itself out) - the very philosophy of the game design is about dragging things out. I was PRAYING for the game to end after 100+ hours, and gave up in the final dungeon where you are just repeatedly PUNISHED with debuffs. Having to rest means you encounter more enemies, and again, and again, and over and over and over again.\nFor a really patient, optimistic person who normally completes the story at least, this sad excuse for a game drove me to the brink, where I simply figured you win Pathfinder by not playing. I would not recommend this game to anyone.\nKingdom management was pretty cool though - gotta give them that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This one is just for the true Pathfinders and the management sickos.\n\nThis game is imminently and interminably frustrating. I am not a Pathfinder player, but I have experience with the 3.5 Dungeons and Dragons rule-set that it was based on. I can note a few improvements, but the statement that pathfinder \"fixed\" the problems with D&D is, in my opinion, erroneous. With that background out of the way, I'll start with the biggest issue. The kingdom management system, frankly, just isn't very good. If the purpose of it was to make you feel like you have important choices to make in the development of your barony (and later on, your kingdom), then I consider it a failure. The constant events that crop up far too frequently make it taxing to attempt building up your lands, especially in the early and middle chapters of the game, and what's worse is that the main story is all timed. You can switch the kingdom system to automatic, and I highly recommend doing so, but it is a major component of the game, and it should not be so tempting to turn it off unless you are simply uninterested in that type of game-play. I did like the town building, though, so there's that.\n\nReturning to the timed story-lines, that is another major issue with the game as a whole. Not the mere presence of a time-based element, which I can find some enjoyment in (as you can note by my playtime with various entries in the Atelier series), but the obtuse implementation and the hidden fail-states are grating and unnecessary. There are several quests that clearly show how long you have to finish them, primarily those on the main story portions, but there are others that fail upon reaching undeclared moments in the story or after unknown amounts of time. If all quests were time-sensitive, at least you could prioritize and decide which quests are worth your time, and which you're willing to fail, or even plan out your exploration and adventuring efficiently so you can get them all done. But without outside knowledge, there's no way of knowing which quests will fail after a certain amount of time and which can wait until you have a spare few days.\n\nBeyond that, this game has many bugs, unintuitive user interface, and a baffling relationship with the D&D alignment system. It is extremely bizarre to me, for instance, that a pair of lovers who care deeply about each other would just shrug off one of them being good and one of them being evil. I don't see how any healthy relationship could survive when one of the things they disagree on is \"murder is wrong\".\n\nThat being said, the art and music are lovely and the characters come to life in the game's stronger moments. I don't buy the level of camaraderie they supposedly share with each other by the end (it would make more sense to me that most of them simply tolerate one another due to their relationship to the player character), but they are fully realized in their own moments, and in the conversations you share with them. The story has many archetypal beats and it feels very aimless during its middle portions. The reveal of how all these disparate events are related probably could have been dropped earlier for a stronger narrative, I think. But overall, it is a story of reclaiming what is lost, and banding together even when it doesn't make sense. And there are many moments where you really feel your choices playing out throughout the land and over the years, in particular a gift you receive early on in the game comes in handy at a very late chapter of the story, which made for a great moment in my play-through.\n\nOverall, I can only really recommend this gamer to people who are fans of the Pathfinder role-playing system. But for everyone else, I say avoid this absolute time vampire!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pathfinder 1e is just not fun both as a tabletop ruleset and doubly so for a PC RPG. I'd rather just replay Neverwinter Nights and have a much better time of things for the combat if I have to powergame builds to enjoy the higher difficulties. Everything else is fun, but the combat really sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "On paper this is everything I want out of a game. I love Neverwinter Nights and this is like that on steroids. And yet I have tried playing this time like 4 different times and each time I play like 2 hours and put it down for months until I try again. I think this game gives me decision paralysis by introducing so much so fast.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really good and i want to like it. The problem i have is, this game sucks and is impressively unfun to play.\r\nEnemies have CRAZY AC, Damage, and CTH and pretty much every encounter i do in this game is my party enters combat and watch as a party of 6 people get utterly rolled by kobolds. Why are basic enemies in this game at LEVEL FUCKING 2 have 18 AC with a +5 to hit MINIMUM. every encounter boils down to pure luck of a random dice roll that 9 times out of 10 are in favor of the AI. In the fight in the ruins, which if you play is the first real \"quest\" my main character with 19 AC got killed 3 different times by the AI's \"random\" dice rolls and they \"rolled\" a natural 20 3 times and did 31 damage instantly killing my character and forcing a reload 3 seperate times. moreover the fact that enemies can hit characters at level 1 and 2 that have AC in there 20's is insane.\r\nThis game IS really fun, its just coded and programmed by absolute morons who don't have any real understanding of DnD mechanics and how to implement them well into a video game.\r\nevery encounter is \"do it perfect\" or you die, that makes for a very boring game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The battle portions of this game are pretty much lifted from the Baldur's Gate games. Where this game drops the ball is the hamfisted kingdom sim where just about anything you do will cause your kingdom to drop into disarray and eventually collapse. I could not finish this game without mods because of this. The story is decent but drags on a bit longer than it should. Character balance is very off and tanky characters feel kind of unhelpful. Not worth the price of admission.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Third game breaking bug and I'm only in act 4. This game is downright sadistic with it's dungeon design and combat encounters. Most companions are cringe and uninteresting. Writing fluctuates a lot from passable to written by someone who's only social interactions was entirely on Reddit. Kingdom management can be fun or tedious but it's almost always frustrating.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is terrible. Just terrible. I wanted to try it because I had so much fun with Rogue Trader, but oh dear does it have some really poor design choices.\n\nRight from the start, the game puts a ticking clock on your main quest, and if you don't finish it in time you can outright lose the game. What kind of an idiot thought it was a great idea to force the player to run against a clock at the very beginning of the game, when we're still trying to learn how everything works? Incredibly bad idea that is only further compounded by the fact that if you then do try to finish the quest quickly, you'll find that you're constantly meeting enemies that are way higher level than you are.\n\nSo which is it Owlcat? Are we in a hurry and need to rush the objective, or do we need to stop and grind for XP along the way? I'm glad I bought this miserable experience at a discount because I won't be spending another 2 seconds trying to solve that poorly thought out problem.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I liked the game but just hated the timer on quest. As a person who doesnt really play these games but want to try... its a turn off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h2]Review after 3 Hours: Deep Pathfinder System, Annoying Prologue & Characters[/h2]\nI really wanted to like this game. It clearly offers a deep and faithful implementation of the Pathfinder ruleset - all the feats, skills, spells, and checks are there, and the interface for reviewing character builds and progression is nicely done.\n\nWhat completely turned me off, though, was the prologue and its characters. The game forces on you an obnoxious female Bard companion who insists on chronicling your adventures because “you’re destined to be a hero.” That alone was grating, but what really broke it for me was discovering that the [i]journal interface[/i] is written entirely from the Bard’s perspective  meaning this irritating character is tied directly to the game’s core UI.  I don’t know if that changes later, but it was enough to stop me right there.\n\nThe setup also leans hard on clichés,  a sweaty, bloodthirsty female barbarian, a snarky evil sorcerer you have to tolerate for no reason, and the usual “heroes summoned to a mansion for a shared quest” trope. It all felt predictable, and the so-called twist in the prologue didn’t help.\n\nThat said, there’s no denying the game looks good for its genre and has a lot of mechanical depth. Fans of the Pathfinder ruleset will probably enjoy it. But for me, the writing, tone, and character presentation in the early game were just too off-putting.\n\n[b]Rating:[/b] ★★☆☆☆ (2/5)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've recently finished BG3 and was hoping to find something that would scratch the same itch. Unfortunately, this is not it. \n\nThe plot seems quite interesting but the mechanics really show their age. The characters move super sluggishly and combat is chaotic. Also the voice acting is quite irritating.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game but very buggy.  Probably encountered at least 5 game breaking bugs that were only fixable by reverting to an older save, pray to god that your auto save was recent.  Fell through the floor bug maybe 3-4 times.  Locked in place dialogue cutscenes would start but never progress maybe 10+ times.  Also filled with so many purposefully done mechanics and story decisions with gameplay impact forced upon you by the devs that appear to exist to only annoy the pants off the player.  I was constantly shocked at how obnoxious so many parts of the game were when they just didn't need to be.  So many story goals were so obtuse and poorly explained that I found myself frequently looking up a guide to see if the game had bugged out.  Many quests can be failed if you go \"left instead of right\".  Kingdom management was awful and through just regular probabilities, a percent of players who try to honestly engage with it will fail through no fault of their own due to a bizarre dev choice to have failed missions impose a kingdom stat penalty.  Get too many 1s in a row and you tank your stats and it's now impossible to do missions with that character.  It's such a foolish punishing system to use D20 on.  1 out of 20 players will get the 1.  And now 1/20 of those players will get a second 1 and they're basically ruined.  I wanted to give this a positive score but it really is filled with so many flaws, so many of which were intentional by the devs to just spite the players i guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overshadowed in terms of polish and scope by its successor, it's hard to recommend this game in 2025. Some of the design decisions are just bad (why are you making me go through multiple load screens to resolve a random encounter? Why do web effects persist after combat? Why is the belt system so awkward for consumables?)\n\nI'd play Wrath of the Righteous before I play this, and if after completing multiple Mythic Paths in Wrath you still need more Pathfinder, then I'd finally buy this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just seems to lack overall direction, very bland interactions, if I was to describe the systems of this game across the board, the word that keeps coming to mind is TEDIOUS. Every system seems this way, inventory management, combat, leveling, kingdom management, conversations, npcs, story, I don't feel anything when interacting with the systems other that \"do it because you need to interact with the next system\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sux easily the worst gameplay ive ever had the misfortune of playing it doesnt explain anything and the story has no hooks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I want to like this game, and there is almost a soft spot in my heart for it, but ultimately it is a mediocre drag.\n\nThe main two root problems are:\n\n[list]\n    [*]The Pathfinder system piles on complexity without weighing the value vs. cost\n    [*]Owlcat's ambitions went off in wild directions (such as the kingdom management) instead of being more ambitious with the core design.\n[/list]\n\nKingmaker is a quantity over quality product, which wouldn't be such a problem except the quantity isn't evenly distributed. At times the player is flooded with quantity to the point of everything becoming noise, and at other times the content is stretched sparsely so there are large gaps in anything new and significant.\n\nA game of this size should never need to stretch its content, but it does.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game seems cool but the combat system is naff, boring, repetitive, etc ,etc. \n\nIf you like Divinity Original Sin, Bolders gate, you won't like this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h3] An ambitious game ruined by one of the most atrocious combat systems I have ever had the misfortune to experience. It is completely unplayable. 2/5 [/h3]\n\n[i] On my scale, a 2/5 game is disappointing, unfun, or otherwise not worth the purchase price. There are definitely better alternatives, and I highly recommend you consider finding one of those. [/i]\n\nThe scale and scope of this game is impressive. I was SO excited when I booted it up to experience a new RPG system even if it was going to be a jankier older game.\n\nAnd then, I came to learn that the jankiness of this game is entirely based on the absolutely, mindnumbingly frog-brained decision to make every single simulated dice roll impossible to hit. I am not joking when I say that [b] it took me 30 minutes to fight a pack of 6 level 2 spiders [/b] which suddenly activated their trap card, whacked me 4 times, killed me entire party, and then I had to spend another 30 minutes refighting (and that time the rng favored me at least).\n\nWhoever is responsible for this combat system needs to be glued to a chair and subject to 50 consecutive hours of missing their cantrip spell attacks against a level 1 centipede.  Doesn’t help that even if you do land a cantrip, it does 1 damage. Wow, very cool.\n\nDon’t get me started on the permanent stat debuffs that cripple your characters if they so much as get scratched by a rat’s literal ass. My 17 dexterity sorceress somehow ended up with a grand total of 3 fucking dexterity after 4 hours of the spider cave. The only way to get rid of this following the [i] INTENDED [/i] “normal” difficulty was to basically sleep for 2 in-game months. (?!?!?) I then switched that setting off and regained the use of my legs, which I would’ve loved to have realized I could do before spending 25 minutes desperately trying to extricate this character from the middle of a PERMANENT web trap that covered 90% of a room’s surface area. \n\nThe characters seem interesting, the party dynamics look like they allow for a massive variety of depth in gameplay, the character creation screen has an overwhelming number of complicated choices, and the game seems absolutely massive. I really wanted to experience all of that positive stuff, and if the developers literally came back to the game and patched in a fix to the awful “to-hit” roll balancing (and cantrip spell damage), it would probably be a fun enough game to power through and experience.\n\nBut they haven’t patched in a fix, 7 years after the game was released. So, don’t even bother trying to enjoy this, because you won’t.\n\nUnfortunately, it is literally impossible to play this game and complete it within an average human lifespan. I already felt like it took 10 years off my life on account of the agony of consecutive dice rolls. So rather than play this, go play BG3. Or anything else.\n\nIt is telling that the majority of positive reviews are entirely conflicted on why they’re providing a positive recommendation while the majority of negative reviews are scathing.\n\nI hope they fixed this crap with Wrath of the Righteous because this is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first step is the hardest - that's how I can sum up Owlcat's first game. So much about Kingmaker is just straight up bad and the only thing that keeps me going is admiration towards Owlcat being bold enough to actually make a game in Pathfinder ruleset. \n\nI wanna be perfectly clear - this system sucks ass. Don't listen to sychopants and nerds, it's simply bad and there's no way around it. Like I genuinely cannot believe someone could willingly gaslit themselves into playing this abomination of a ruleset. It's like sniffing your own farts and being proud about it. Everything about Pathfinder is atrociously bloated, overcomplicated and just simply not fun. This system inherits everything that is objectively bad about DnD: extremely long lists of worthless feats, stacking +1 buffs from every possible source as the prime instrument of buildcrafting, skills that are mostly meaningless outside very specific circumstancees, godawful spell slot system paired with mandated resting. I cannot stress enough how inherently anti-fun the spell slot system is - it's literally a warcrime DnD have commited against the whole TTRPG world. It's basically the equivalent of your parents gifting you a cool toy for Christmas yet allowing you only 5 minutes per day to play with it. But not only Pathfinder copies all the wrong things DnD does, it doubles down on bloating every aspect of it. Every rule has dozens of exceptions, instead of one dispel - there are dozens of different effect-specific dispels, literally hundreds of weapon-types that literally do the exact same damage. If you haven't guessed already yeah, I really do dislike Pathfinder system. And what's even worse, the game really does an awful job of explaining it.\n\nIf you have ever played an Owlcat game before - you can already guess what kind of encounter/boss design Kingmaker has. Imagine a DM that for whatever reason hates the party so badly, they will stop at nothing in order to humiliate and wipe them out. That's how it works in general in Kingmaker. Overinflated DCs for every mob in the game, attacks that deal permanent stat damage, bosses that spam disables, mobs spawning behind your back to disrupt your positioning. Some call it a \"challenge\", but honestly it feels like cheating. You can overcome it if you really want to, but it doesn't make it more fair or balanced. But the worst offender gameplay wise is time limits - time limits everywhere. Some are obvious, some are not, some are just a side-quest lost - no big deal, some can ruin your whole game potentially wasting dozens of hours of gameplay. I hope you like unintentionally failing like literally half of your quests because you were forced to stay in your capital jerking off your advisor for two weeks straight - because it will happen and it will happen a lot. \n\nThe most succinct summary i can give to Kingmaker is that I literally had more fun building villages in the kingdom simulator part than playing the game itself. Thus, I can't really recommend it to anyone other than DnD nerds. Go play WOTR or Rogue Trader. This game has 25% of negative reviews for a reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Such a bizarre choice to put the entire campaign on a timer. Imagine if they did that in Skyrim.... This game would have been so much better if you had time to explore, level, and really enjoy the game without feeling a constant pressure. What's even more disappointing is how much I love the tabletop version of Pathfinder, which I've been playing since it very first released around 2009-ish? I really wanted to like this but I can't get into it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Story is boring as sin, and the \"choices\" in many cases lack any nuance and are absent of what a interesting character (you as a character in this game, but also in many examples your NPC Companions) would decide to do. Many of the kingdom actions and decisions are surface level and have no long stretching consequences in the campaign that i've seen. Your characters \"moral\" options are a joke because in cases where your NPCs may betray you or act out of line the choices are either you let them go with no consequence, lightly scold them, or... Hack of their head in a execution. In either the cases of hacking off their head or scolding them the game will punish you for making decisive actions like this, not with a alignment shift, but also because you eliminated the super cool character some writer wrote up by having the penalities be rather harsh now that their gone. In many cases these characters personal quests tie into your kingdoms prosperity to in alot of cases, so rather than just having the consequence of not getting to  use your NPC companion or learn their full story, but your kingdom is somehow dragged down a level or two. Also good luck on making a replacement for that companion you dismiss or kill if there also a  advisor for you, they often are the best in slot and you get a inherent penalty for using multiple custom characters, unless you were to mod their stats to reduce the mercenary debuff given which is only really there to enforce you using the NPCs the game gives you for a party,  which helps speak to the confidence the writers have in their own work or the agency of a player.\n\nCompanions are in general terribly written, unlikable or subversive or traitorous for characters that really have no excuse for doing these things other than to annoy the player. If the game basically didnt make it mandatory to use most of them as advisors I would have dismissed or killed many of them.\n\nThe game is also extremely buggy in Acts 3 & 4 to the point where I would have to go back on saves made a hour or two before a decision (thank god i save fairly regularly) or download toybox to fix the initiation for quests after looking them up and realizing that they were bugged and not working properly. \n\nGameplay itself is quite alright, Pathfinder has always been a exceptional ttrpg system and translates well into the game barring a few hiccups that can be expected for any CRPG or a system with alot of crunch and expansive as Pathfinder, which i do not blame the dev for its just naturally going to happen and they did well keeping the spirit of the tabletop into combat for better or for worse. This does mean in some cases your expected to min-max a bit if you want to be able to get through tougher challenges or to advance without wanting to rip your hair out, but you have enough wiggle room to make variant characters and not have to level the same 4 skills to max every level up if you know what your doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to enjoy Pathfinder: Kingmaker, but I found the controller setup and tutorials very frustrating. It took me quite a while just to figure out how combat actually worked — whether it was turn-based or if the game was fighting automatically for me.\n\nThe gamepad layout feels awkward and not very intuitive, especially for a CRPG of this depth. A proper control diagram or a clearer tutorial system would make a huge difference for players using a controller instead of mouse and keyboard.\n\nI can tell there’s a lot of depth here and it probably becomes enjoyable once you learn the systems, but the early experience is not friendly to new players or those using gamepads.\n\nHopefully future titles (or an update) improve controller support and make the tutorials more accessible — because the world and style seem great otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't believe this was a game created by Owlcat, but I guess everyone has to start somewhere.\n\nDo not waste any time on this game, just play WOTR (Pathfinder: Wrath of the Righteous). \n\nThis game is an uncomplete mess and the juice is just not worth the squeeze when compared to the other games that owlcat has developed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of attack rolls for your team will miss regardless of actual chance to hit. Spent 14 rounds of combat trying to land one hit on a single enemy. Combat ended in a party wipe.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pathfinder: Kingmaker is an RPG that is a lot of fun at the beginning, but unfortunately quickly becomes redundant. In the game, the kingdom is constantly plagued by threats such as pandemics, wars with neighbours and barbarians. Although the story is okay at the beginning, it eventually becomes uninteresting due to the unreasonably long playing time. What we have here is a story for perhaps 30 to 35 hours stretched to almost 80 hours, according to HLTB.\n\nAnother point of criticism is the unnecessarily difficult battles in the later stages of the game. Instead of the enemies becoming stronger and more powerful, you are simply bombarded with an excess of 20 to 30 enemies. This not only affects the game performance, but also the enjoyment of the game.\n\nOne annoying aspect is that potential companions can be missed. As these companions are needed for kingdom management, this leads to problems. An example is a companion who is found in an uninteresting location during a single specific main quest. It is possible to spend the entire game without a chamberlain, causing the kingdom to fail and the game to be lost. One could argue that you should simply explore more, but this leads to the next point of criticism.\n\nAll quests have an invisible time limit, which reduces the enjoyment of the game. Although it is realistic that NPCs do not stay in one place indefinitely, this gives the player little freedom. What if you want to pursue the main quest before doing the companions' side quests? What if you want to explore the map, but time passes and you run the risk of losing the game? What if you just want to spend a few months in the game managing the kingdom?\n\nThe questlog often does not give you enough information. In the majority of the quests you will find yourself wandering all over the world map hoping to finally find the place you are supposed to go. I think it's pretty obvious that this, along with the time limit, is pretty bad design.\n\nDespite these points of criticism, there are also aspects worthy of praise. The level of difficulty can be customised very nicely so that both pros and newcomers can have fun with the game. In addition, kingdom management can be minimised by only taking on the most necessary tasks. The lore of Pathfinder is also explained quite well, so that even players who have never come into contact with Pathfinder before are not completely lost.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's fun until you realize that at the end of the day this is a dice rolling simulator, and since there's no actual GM to work with the player gameplay boils down to \"Roll a 20? You win. Roll a 1? You Lose, Skill Issue.\" The player has very little actual agency beyond character creation, and the storyline is not good enough to justify spending hours at a time rolling a 20-sided die over and over again hoping \"just roll high bro 4head\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having bounced off the bitterly disappointing Kingmaker PF2E module (also we got owned because we're bad), I thought I'd give Kingmaker another try. I thought having the Kingdom turns be automatable and skipping the group consensus element that the tabletop module forces on you would be nice, and it is, but as this isn't a review of the tabletop game I can only say it's still a boring and disappointing system regardless. The Kingdom system drives a lot of the plot but there is little tangible incentive to actually engage with it beyond \"you have to\", so it very quickly becomes a chore that keeps you from the meat of the game, the adventuring. It could have done with either being much more abstract, or much more granular, but the system would require a complete ground up rework to be engaging to me.\n\nThe combat itself is built on a strong basis, with the Pathfinder First Edition system being a solid tabletop system. The NPC companions are pretty unlikeable (save for Linzi, who grew on me) and unmemorable, the second most interesting being Valerie who happens to be probably the weakest class in the entire system and certainly of the starting companions. You severely lack options for Cleric or INT caster archetypes that are only somewhat fixed when you get access to a Sorceror, or the Arcane Trickster you can lean more into the magic side with. Nobody is a conventional, well-rounded base class by default, and while you can retrain them  more or less as you please it's irritating getting to grips with a roster full of quirky subclasses and learning what they can do when I'd really rather just have the NPC companions be simple archetypes while my own character can grow as desired. There are automation options, but these just further divorce you from the decision making process. \n\nLuckily, the game is not all that hard, so you don't really need to care about the above composition issues that much, but rather repetitive to the point of boring. Slogging through overly large zones separated by long stretches of overland travel, which don't really run into each other as much as feel like separate instances is just not enjoyable, before you get into the tedium of progressing the kingdom to even access the content. It feels very much like the game is padded out to keep you from noticing how thin it is outside of the core content, which is still not even all that good. I didn't feel motivated to finish the game because I just got bored, which is honestly pretty rare for me, and didn't even catch up to the part in the Tabletop we TPKed at, which was my motivation to play the game in the first place.\n\nIf you have played every other CRPG and are dying for a new one then by all means play it, but I would strongly recommend just picking up WOTR instead, which has far fewer of the downsides. To sum it up, it just feels like Kingmaker doesn't respect your time - just adding mounts could've fixed about a quarter of what's wrong with the game. At least it's pretty cheap and regularly goes on sale at 80% off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First the positive parts: Graphics actually look decent. Which is nice to see, some of these kinds of games really need help in that department, but this one doesn't. Especially when you factor in it's age. Another thing I liked is that much of it is voiced. Always a good choice in my opinion. \n\nNow for the not so positive parts: Even after all this time, it still feels like it's in beta. There's a certain lack of polish that you'll run into, that other games in this genre don't seem to suffer from. No map zoom, buttons that definitely should be there but aren't, some buttons are hidden behind their menus, party not always moving when you tell it to... there's a long list of problems. Really does feel like a beta. \n\nAnd you can really tell it's a product of it's time, which typically brings a game down. The gyno centrism is strong, with this one. I made a male character cause I'm a male like everyone else that's gonna play this, and I left the starting area with a party of all women. Right. Feel the immersion. As far as I can tell, there was no way for me to avoid this. Especially given the party I was attempting to build. In fact, that's another problem with the game, it has very small character selection. You can purchase different ones for a high price in the game, but who knows if they'll be voiced or have quests. So your first instinct is to avoid doing that, leaving you stuck playing a harem anime. \n\nBut yes if you're into boss chicks and women in nearly every position of power, you'll like this game. You know the drill, you've seen it enough by now. Your female characters are of course stronger than a gorilla on steroids. One of them comes with a sword that there's no way she could even lift. And wouldn't you know it, the patriarchy was keeping her down! They wouldn't let her be a man. Also the barrony controls feel convoluted and disorganized, and the game generally seems to take itself too seriously. For example, it talks about how leveling up may just be too complicated, and it offers to do it for you. It's about as easy as it gets, you click through a few screens just like all the rest of these kinds of games. Yeah I want my fighter to have shield focus, cause she's (lol) tanking all the damage. And my rogue needs to have good perception! Yup, hard choices like that mean you might not be smart enough to figure this game out! Aside from the poor pacing of the game, I see zero reason to do some kind of deep dive into character creation. So I'm not sure why this guy doubts his players' intelligence. \n\nOn the whole, I can't recommend it. Unless you can get this thing for like $2 or $3 on a deep discount, avoid it. And that's only if you just can't get enough of these games and you've already played all the rest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It may be tedious and boring but don't worry, it's also bug-ridden and poorly balanced",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Even on easy difficulty 20 hits missed in a row against the weakest enemies. Absolutely impossible to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Literally leaving a bad review after several hours of great gameplay because Owlcat decided to start using Steam announcements as ads for unrelated games.\n\nWhoever thought that was a good idea should be fired.\n\nI'll change it back to positive if the ♥♥♥♥ up is at least acknowledged.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story's okay. Combat is somehow very complicated, yet shallow and boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute generic CRPG with see-once scenery and art.   LIke, why bother, Devs?\n\nShit-trope after shit-trope.  Skip all his boring-ass, shite, dice-based neckbeards idea of a DND game.\n\nDice works fine with pen an paper and a human DM. \n\nOn a computer, Dice lack any subtlety or nuance, and it plays like lazy ass shit.   Fucking stop it, Devs.\n\nAt least the voice acting is...present...\n\nManager: \"Hey guys! what if we hired all the voice actors but NO producer!?! We only need one take, right?\" \n\nOh? They DID hire a producer...and continued to pay them...after seeing their work...Lots to unpack there.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "right now i cant go a 20 round with out the ai rolling 15-20 and i keep rolling 1-6 so fuck my build because the ai just cheats",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too old-school, even for someone who's played 3.0 and 3.5 until well after they were discontinued.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So this is one of those hardcore DnD games that a lot of DnD players enjoy obviously. I do have experience with DnD games, I played Baldur Gates 2 and 3, I played Divinity Origin Sin 1 and 2 and Dragon Age 1. \r\nAnyway, this game is apparently too hard core to me. Unless you know how exactly to roll your character from the start, be prepared that you will be steamrolled by a single level 1 swarm of flies. And if you somehow accidentally have a character with a fly killing spell, there will be other enemies that you whole team will \"miss\" hitting at because thats how DnD rolling works. Like the whole encounter will be - 6 characters miss against one low level NPC and it will slowly chip away at your team till they all dead. Sorry, shit like this is not for me, but you do you. Good luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games should be fun - this one isn't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just not very fun",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its mid",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "also bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have mostly negative takeways from Kingmaker, most have to do with the RTwP combat system, encounter design and balancing, as well as stability issues. The few things it does get right are not enough to make up for all the dubious design choices and other shortcomings.\n\nPositives:\n\n• The writing starts off weird, like a Tumblr user's fanfic with characters using silly terms like \"freaking\", \"kick butts\" etc. Fortunately it is an anomaly that is mostly contained to the prologue, the quality shifts for the better after that and stays consistent throughout.\n• Nice art direction on the monsters and some good variety there too, I also like the environments.\n• The soundtrack is pretty nice.\n\nMixed:\n\n• Most of the quests are fetch quests, the main story is where the quality content is at but you won't be doing that for 150h. I was very disappointed with the way most of the Companions' arcs ended, they build up throughout the game towards what you'd expect to be a satisfying climax only to end on a whiff. Also I really did not appreciate the shoehorned way they handle Linzi - just a PSA: if you, like me, have Linzi as your party's main support & lockpicker/ disarmer, do yourself a favor and remove all her gear before entering the final dungeon.\n• Speaking of companions, they are written fine, I enjoyed them for the most part. they aren't up there with the best from Dragon Age (ie. 1 & 2), Mass Effect, DOS2 and not even close to BG3 companions but they are good enough.\n\nNegatives:\n\n• RTwP. This abomination of a combat system single-handedly kills off most games in the cRPG genre, it is a relic of gaming much like fixed camera angles and tank controls are and it should be left alone as such. To actually make it work takes a lot of effort and even then it is just better to either have full realtime combat or full turn-based.\n• Atrocious encounter design and wildly inconsistent general balancing, dubious design choices. Enemy spam, constant interruptions while you travel the map. Random one shots can happen wherever and whenever even on lower difficulties. Enemies not only have access to but also spam CCs that last for like 30+ seconds (hello Wild Gaze.) \"Permanent\" debuff types that can be removed only by Resting, such as losing levels and attributes/ stats. If you want to clear the hard content, you read a guide on how to min-max and then spend a good 5 minutes stacking like 50 buffs before every tough fight.\n• Time limits and not just on side quests but main quests too, that give you a Game Over if ignored. I legitimately cannot think of any game that has time limits and was praised for it, Kingmaker is most certainly not an exception to that.\n• Kingdom management, this is almost universally disliked from what I've seen and read, even the devs themselves added options to skip it completely, that's how bad it is. Just padding to inflate playtime, not to mention that mishandling it can brick your campaign if you don't save often because of the way in which it interacts with time limits.\n• UI: imo half of the mastery in making cRPGs/ Strategy games is in how clean and readable the UI is, if your game has convoluted mechanics but the UI is good, it creates a pleasant and rewarding learning environment for the player. When the UI looks and feels sloppy it does the opposite, case in point Kingmaker. And don't get me started on the lack of QoLs, I feel like I'm walking away from the game with a strained wrist from all the clicking due to inventory management.\n• So many bugs and glitches, poor overall stability. For starters, the game minimizes if you alt-tab or click on a 2nd monitor when you have it on \"Borderless Windowed\" - that kind of defeats one of the primary purposes of that setting I think. Random total slow-mos on your party that happen very frequently, which you fix with Pause/ Unpause. Characters get stuck on invisible walls, especially when combat is triggered. Death's Door can trigger randomly on area traversal, and sometimes it doesn't get healed even when resting in safe areas. New items and existing ones get sorted completely randomly and erratically in your inventory, skipping entire empty columns or even pages for some reason - if you do inventory management to fix it, they'll auto-sort next time you interact with merchants or your storage anyway. Achievements don't unlock way too often and it really sucks when it happens to quests that span the entire game eg. Magic Prison. I was very thorough in my playthrough, so thorough that after checking every unlock condition I should've had 3/4 of the total achievements yet I finished with only 1/4 unlocked. If the game loses focus often (alt-tab, clicking on second monitor) it messes up either your Storage or Memory, it creates system-wide slowdowns and micro-freezes that don't go away even if you turn it off, what fixes it is signing out of Windows or a full restart.\n\nEven with all the cheesy nonsense this game overwhelms you with I was very close to walking away from it having had an okay experience because it does have some charm to it, however the final area just dialed the nonsense up to eleven with the enemy and CC spam, frustratingly obtuse area and puzzle design as well as cheesy encounters. Literally every negative aspect that I could tolerate before got compounded to 3-5h of non-stop frustration that had me breathing a sigh of relief when it was all over. I just can't recommend Kingmaker for anyone but the biggest cRPG/ DnD addicts with how flawed of an experience it is. Go play Divinity or Baldur's Gate instead.\n\n🔳 Broken\n🔳 Shovelware\n🔳 Awful\n🔳 Bad\n🔳 Mid\n☑️ Okay\t\t\n🔳 Good\n🔳 Great\n🔳 Excellent",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game is \"ok\". So many bad decisions in otherwise very good game ruins the score:\n\n- There is no take 20 in the game. Save reload each time you try to pass a dice check  because your trickery check with +40 bonus against a 42 DC lock rolled a 1. Mode solely to satisfy a miniscule amount of RP players who actually take bad rolls and continue. [b]You should not have fun. [/b]\n\n- The main quest notoriously has a timer something which has not been done since fallout 1 for a reason. People hate it and it should always be hated. You are fucked without a guide and lose potentially hundreds of hours if you were unaware. Done to give resting a downside , which is done to annoy you. [b]You should not have fun. [/b]\n\n- Stat bloat , item bloat and general bloat of any numbers in the game. I actually applaud a developer to allow levels 1 to 20 in a single campaign but they do not know how to let players have fun. The encounters in the game are adjusted way too high to the point normal enemies boast AC's of 40 and 300 HP without any reason at all but make it a slog. Everyone drops +5 weapons and is immune to everything because... [b]You should not have fun. [/b]\n\n- CC spam... Developers must detest a regular exchange of DPS so every encounter is a CC galore... Hardcore fans think this is ok because they CC spam too. It is a spell DR and save roll game instead of AC and AR. You wanted a straight fight? no. you can only have dirty CC in pathfinder:cheesemaker. [b]You should not have fun. [/b]\n\n- Overland travel takes time and you must rest to avoid massive penalties of being exhausted from travelling. Oh but when you rest you lose precious time, since your main quest is timed you should pay good attention when to explore and where to explore. How? Read a guide of course what else? or did you think you shall explore freely in the spirit of good RPGs? remember [b]You should not have fun. [/b]\n\n- Alignment locked decisions. Yes you heard it right. Want to punch an asshole in the face? Sorry can't do you are lawful good. Want to stay neutral in a big conflict... no no.. only chaotic players can do that. Roleplaying is done in the character creation screen not in game. [b]You should not have fun. [/b]\n\n- Dumbest achievements ever designed in an 300+ hour RPG. 75% of all achievements I got (and I only got around 60 % of total) are rare achievements despite me following a 600 page long guide.. a simple mistake a conversation chose wrongly can block you from a dumb achievement 200 hours in.. [b]You should not have fun. [/b]\n\n- Difficulty curve is all over the place.. One moment you are moving down goblins the other moment you are sweating against demigod level human bandits. Hardcore fans would say you can play the game with hands tied to your back and typing with your nose because all they do is multiclass dipping, abusing CC spells like grease, stinking cloud. Every member of your party should invest in persuasion because we are going to spam dazzling display to eliminate that pesky 40 armor class. Why? Why not? If you are not meta gaming to death you are not allowed to complain about the difficulty. Get your finger out of your ass and get your Monk/Paladin/Eldritch Knight Lawful Evil character and start meta-gaming too. Bashing on people who want to play a normal RPG in reddit is bonus. [b]You should not have fun. [/b]\n\n- Stat damage spam. Enemies especially in the late game do not try to kill you. They are made to deal ability damage just to force you to rest to cast restoration. Clever eh? Enemies cast CC and spam ability damage / disease not to kill the MC but to annoy the player. Let that sink in, [b]You should not have fun. [/b]\n\n[hr][/hr]\n\nThe developers want to hinder you from saving and loading, which some idiots in gaming space call \"savescumming\" an incredible dumb take on a computer game which disqualifies anyone uttering it from being taken seriously. How they do that? force one-time DC checks on you regularly, no search button and locks can only be attempted once. Surely you will get tired from looking at loading screens and join their side of 'properly' playing an RPG.\n\nThe developers want you to not rest after each encounter because it is not how you would do it on tabletop. So they force travel time/exhaustion and top it with main quest timer. But why? Because it should not be fun. \n\nThe developers want you to utilize every spell in game so they make encounters in a way that pre-buffing is a must and buffs are there to close disadvantages not give you any advantages. What do you mean you want to cast Damage Dealing spells? No sir you want to take every buff at each spellcaster in your party. You want to cast Lvl 9 spell Power Word Kill and feel like Irenicus from Bg2  ? Sorry that only kills stuff under 100 health and those stopped existing from the mid-game. Take extended , empowered, maximized grease instead. Trust us it is fun.\n\nThe developers want you to replay the game because it is their beloved magnum opus and you SHOULD love it! what do you mean you do not want to replay this tedious thing for another 300 hours for a single achievement? Here is an alignment locked decision, here is an ambigious quest with dumb choices. Here are some long-term effects no one can know without a guide! \n\n[hr][/hr]\nREMEMBER : [b]You should not have fun. [/b]\n[hr][/hr]\n\nI can go on for ages... very sad because there is actually a good game beneath all this crap. Developers did a way better job in their second pathfinder game and even better in the 40k rogue trader adaptation. They learn but their first attempt is a mess. This game though;  It smells like developers trying too hard to punish players and to create the most obnoxious and tedious experience ever for no other reason than to cater to a tiny part of cRPG players who have no lives, no friends and hate themselves.\n\nIf you are going to play this game.. Read a comprehensive guide fully from start to end and if you still want give it a go you have been warned. Only 9,6 % of players finished the game... think about it.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I took too long completing a quest and this caused me to fail the entire game. That is such a colossally stupid design decision.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Kingdom management ruined the game for me. Had a great time with the story and questing, but found my game to be suddenly ended from a cascading series of dumb kingdom events. Really unfortunate way to lose the game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There is much to enjoy but you have to fight this game to make it bearable. The companions are interesting and the story is solid but the pacing is horrible. The first three acts are composed of tedious quests that have little significance. Only towards the end of act 3 does the story finally begin. Random encounters are annoying but luckily you can adjust your skills to minimize them. The combat can be long and unforgiving so adjusting the difficulty is recommended. Despite the game coming out long ago, some of the original bugs are still here, insane. At the end of act 6 the game does not give me a key cutscene. I have tried everything and no solution. I could keep going but I refuse to continue without that key moment. You should really skip this game and go to wrath of the righteous.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Played most of this game on the Deck. Long story short, I gave it every chance possible. It does not want me to have fun. ENDLESS loading screens, performance degrades as you play, poor writing, bonkers balance (get paralyzed for 40+ rounds easily and fail every save imaginable until it sorts itself out) - the very philosophy of the game design is about dragging things out. I was PRAYING for the game to end after 100+ hours, and gave up in the final dungeon where you are just repeatedly PUNISHED with debuffs. Having to rest means you encounter more enemies, and again, and again, and over and over and over again.\nFor a really patient, optimistic person who normally completes the story at least, this sad excuse for a game drove me to the brink, where I simply figured you win Pathfinder by not playing. I would not recommend this game to anyone.\nKingdom management was pretty cool though - gotta give them that.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This one is just for the true Pathfinders and the management sickos.\n\nThis game is imminently and interminably frustrating. I am not a Pathfinder player, but I have experience with the 3.5 Dungeons and Dragons rule-set that it was based on. I can note a few improvements, but the statement that pathfinder \"fixed\" the problems with D&D is, in my opinion, erroneous. With that background out of the way, I'll start with the biggest issue. The kingdom management system, frankly, just isn't very good. If the purpose of it was to make you feel like you have important choices to make in the development of your barony (and later on, your kingdom), then I consider it a failure. The constant events that crop up far too frequently make it taxing to attempt building up your lands, especially in the early and middle chapters of the game, and what's worse is that the main story is all timed. You can switch the kingdom system to automatic, and I highly recommend doing so, but it is a major component of the game, and it should not be so tempting to turn it off unless you are simply uninterested in that type of game-play. I did like the town building, though, so there's that.\n\nReturning to the timed story-lines, that is another major issue with the game as a whole. Not the mere presence of a time-based element, which I can find some enjoyment in (as you can note by my playtime with various entries in the Atelier series), but the obtuse implementation and the hidden fail-states are grating and unnecessary. There are several quests that clearly show how long you have to finish them, primarily those on the main story portions, but there are others that fail upon reaching undeclared moments in the story or after unknown amounts of time. If all quests were time-sensitive, at least you could prioritize and decide which quests are worth your time, and which you're willing to fail, or even plan out your exploration and adventuring efficiently so you can get them all done. But without outside knowledge, there's no way of knowing which quests will fail after a certain amount of time and which can wait until you have a spare few days.\n\nBeyond that, this game has many bugs, unintuitive user interface, and a baffling relationship with the D&D alignment system. It is extremely bizarre to me, for instance, that a pair of lovers who care deeply about each other would just shrug off one of them being good and one of them being evil. I don't see how any healthy relationship could survive when one of the things they disagree on is \"murder is wrong\".\n\nThat being said, the art and music are lovely and the characters come to life in the game's stronger moments. I don't buy the level of camaraderie they supposedly share with each other by the end (it would make more sense to me that most of them simply tolerate one another due to their relationship to the player character), but they are fully realized in their own moments, and in the conversations you share with them. The story has many archetypal beats and it feels very aimless during its middle portions. The reveal of how all these disparate events are related probably could have been dropped earlier for a stronger narrative, I think. But overall, it is a story of reclaiming what is lost, and banding together even when it doesn't make sense. And there are many moments where you really feel your choices playing out throughout the land and over the years, in particular a gift you receive early on in the game comes in handy at a very late chapter of the story, which made for a great moment in my play-through.\n\nOverall, I can only really recommend this gamer to people who are fans of the Pathfinder role-playing system. But for everyone else, I say avoid this absolute time vampire!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pathfinder 1e is just not fun both as a tabletop ruleset and doubly so for a PC RPG. I'd rather just replay Neverwinter Nights and have a much better time of things for the combat if I have to powergame builds to enjoy the higher difficulties. Everything else is fun, but the combat really sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "On paper this is everything I want out of a game. I love Neverwinter Nights and this is like that on steroids. And yet I have tried playing this time like 4 different times and each time I play like 2 hours and put it down for months until I try again. I think this game gives me decision paralysis by introducing so much so fast.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is really good and i want to like it. The problem i have is, this game sucks and is impressively unfun to play.\r\nEnemies have CRAZY AC, Damage, and CTH and pretty much every encounter i do in this game is my party enters combat and watch as a party of 6 people get utterly rolled by kobolds. Why are basic enemies in this game at LEVEL FUCKING 2 have 18 AC with a +5 to hit MINIMUM. every encounter boils down to pure luck of a random dice roll that 9 times out of 10 are in favor of the AI. In the fight in the ruins, which if you play is the first real \"quest\" my main character with 19 AC got killed 3 different times by the AI's \"random\" dice rolls and they \"rolled\" a natural 20 3 times and did 31 damage instantly killing my character and forcing a reload 3 seperate times. moreover the fact that enemies can hit characters at level 1 and 2 that have AC in there 20's is insane.\r\nThis game IS really fun, its just coded and programmed by absolute morons who don't have any real understanding of DnD mechanics and how to implement them well into a video game.\r\nevery encounter is \"do it perfect\" or you die, that makes for a very boring game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The battle portions of this game are pretty much lifted from the Baldur's Gate games. Where this game drops the ball is the hamfisted kingdom sim where just about anything you do will cause your kingdom to drop into disarray and eventually collapse. I could not finish this game without mods because of this. The story is decent but drags on a bit longer than it should. Character balance is very off and tanky characters feel kind of unhelpful. Not worth the price of admission.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Third game breaking bug and I'm only in act 4. This game is downright sadistic with it's dungeon design and combat encounters. Most companions are cringe and uninteresting. Writing fluctuates a lot from passable to written by someone who's only social interactions was entirely on Reddit. Kingdom management can be fun or tedious but it's almost always frustrating.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is terrible. Just terrible. I wanted to try it because I had so much fun with Rogue Trader, but oh dear does it have some really poor design choices.\n\nRight from the start, the game puts a ticking clock on your main quest, and if you don't finish it in time you can outright lose the game. What kind of an idiot thought it was a great idea to force the player to run against a clock at the very beginning of the game, when we're still trying to learn how everything works? Incredibly bad idea that is only further compounded by the fact that if you then do try to finish the quest quickly, you'll find that you're constantly meeting enemies that are way higher level than you are.\n\nSo which is it Owlcat? Are we in a hurry and need to rush the objective, or do we need to stop and grind for XP along the way? I'm glad I bought this miserable experience at a discount because I won't be spending another 2 seconds trying to solve that poorly thought out problem.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I liked the game but just hated the timer on quest. As a person who doesnt really play these games but want to try... its a turn off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h2]Review after 3 Hours: Deep Pathfinder System, Annoying Prologue & Characters[/h2]\nI really wanted to like this game. It clearly offers a deep and faithful implementation of the Pathfinder ruleset - all the feats, skills, spells, and checks are there, and the interface for reviewing character builds and progression is nicely done.\n\nWhat completely turned me off, though, was the prologue and its characters. The game forces on you an obnoxious female Bard companion who insists on chronicling your adventures because “you’re destined to be a hero.” That alone was grating, but what really broke it for me was discovering that the [i]journal interface[/i] is written entirely from the Bard’s perspective  meaning this irritating character is tied directly to the game’s core UI.  I don’t know if that changes later, but it was enough to stop me right there.\n\nThe setup also leans hard on clichés,  a sweaty, bloodthirsty female barbarian, a snarky evil sorcerer you have to tolerate for no reason, and the usual “heroes summoned to a mansion for a shared quest” trope. It all felt predictable, and the so-called twist in the prologue didn’t help.\n\nThat said, there’s no denying the game looks good for its genre and has a lot of mechanical depth. Fans of the Pathfinder ruleset will probably enjoy it. But for me, the writing, tone, and character presentation in the early game were just too off-putting.\n\n[b]Rating:[/b] ★★☆☆☆ (2/5)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've recently finished BG3 and was hoping to find something that would scratch the same itch. Unfortunately, this is not it. \n\nThe plot seems quite interesting but the mechanics really show their age. The characters move super sluggishly and combat is chaotic. Also the voice acting is quite irritating.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good game but very buggy.  Probably encountered at least 5 game breaking bugs that were only fixable by reverting to an older save, pray to god that your auto save was recent.  Fell through the floor bug maybe 3-4 times.  Locked in place dialogue cutscenes would start but never progress maybe 10+ times.  Also filled with so many purposefully done mechanics and story decisions with gameplay impact forced upon you by the devs that appear to exist to only annoy the pants off the player.  I was constantly shocked at how obnoxious so many parts of the game were when they just didn't need to be.  So many story goals were so obtuse and poorly explained that I found myself frequently looking up a guide to see if the game had bugged out.  Many quests can be failed if you go \"left instead of right\".  Kingdom management was awful and through just regular probabilities, a percent of players who try to honestly engage with it will fail through no fault of their own due to a bizarre dev choice to have failed missions impose a kingdom stat penalty.  Get too many 1s in a row and you tank your stats and it's now impossible to do missions with that character.  It's such a foolish punishing system to use D20 on.  1 out of 20 players will get the 1.  And now 1/20 of those players will get a second 1 and they're basically ruined.  I wanted to give this a positive score but it really is filled with so many flaws, so many of which were intentional by the devs to just spite the players i guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overshadowed in terms of polish and scope by its successor, it's hard to recommend this game in 2025. Some of the design decisions are just bad (why are you making me go through multiple load screens to resolve a random encounter? Why do web effects persist after combat? Why is the belt system so awkward for consumables?)\n\nI'd play Wrath of the Righteous before I play this, and if after completing multiple Mythic Paths in Wrath you still need more Pathfinder, then I'd finally buy this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just seems to lack overall direction, very bland interactions, if I was to describe the systems of this game across the board, the word that keeps coming to mind is TEDIOUS. Every system seems this way, inventory management, combat, leveling, kingdom management, conversations, npcs, story, I don't feel anything when interacting with the systems other that \"do it because you need to interact with the next system\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sux easily the worst gameplay ive ever had the misfortune of playing it doesnt explain anything and the story has no hooks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I want to like this game, and there is almost a soft spot in my heart for it, but ultimately it is a mediocre drag.\n\nThe main two root problems are:\n\n[list]\n    [*]The Pathfinder system piles on complexity without weighing the value vs. cost\n    [*]Owlcat's ambitions went off in wild directions (such as the kingdom management) instead of being more ambitious with the core design.\n[/list]\n\nKingmaker is a quantity over quality product, which wouldn't be such a problem except the quantity isn't evenly distributed. At times the player is flooded with quantity to the point of everything becoming noise, and at other times the content is stretched sparsely so there are large gaps in anything new and significant.\n\nA game of this size should never need to stretch its content, but it does.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game seems cool but the combat system is naff, boring, repetitive, etc ,etc. \n\nIf you like Divinity Original Sin, Bolders gate, you won't like this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h3] An ambitious game ruined by one of the most atrocious combat systems I have ever had the misfortune to experience. It is completely unplayable. 2/5 [/h3]\n\n[i] On my scale, a 2/5 game is disappointing, unfun, or otherwise not worth the purchase price. There are definitely better alternatives, and I highly recommend you consider finding one of those. [/i]\n\nThe scale and scope of this game is impressive. I was SO excited when I booted it up to experience a new RPG system even if it was going to be a jankier older game.\n\nAnd then, I came to learn that the jankiness of this game is entirely based on the absolutely, mindnumbingly frog-brained decision to make every single simulated dice roll impossible to hit. I am not joking when I say that [b] it took me 30 minutes to fight a pack of 6 level 2 spiders [/b] which suddenly activated their trap card, whacked me 4 times, killed me entire party, and then I had to spend another 30 minutes refighting (and that time the rng favored me at least).\n\nWhoever is responsible for this combat system needs to be glued to a chair and subject to 50 consecutive hours of missing their cantrip spell attacks against a level 1 centipede.  Doesn’t help that even if you do land a cantrip, it does 1 damage. Wow, very cool.\n\nDon’t get me started on the permanent stat debuffs that cripple your characters if they so much as get scratched by a rat’s literal ass. My 17 dexterity sorceress somehow ended up with a grand total of 3 fucking dexterity after 4 hours of the spider cave. The only way to get rid of this following the [i] INTENDED [/i] “normal” difficulty was to basically sleep for 2 in-game months. (?!?!?) I then switched that setting off and regained the use of my legs, which I would’ve loved to have realized I could do before spending 25 minutes desperately trying to extricate this character from the middle of a PERMANENT web trap that covered 90% of a room’s surface area. \n\nThe characters seem interesting, the party dynamics look like they allow for a massive variety of depth in gameplay, the character creation screen has an overwhelming number of complicated choices, and the game seems absolutely massive. I really wanted to experience all of that positive stuff, and if the developers literally came back to the game and patched in a fix to the awful “to-hit” roll balancing (and cantrip spell damage), it would probably be a fun enough game to power through and experience.\n\nBut they haven’t patched in a fix, 7 years after the game was released. So, don’t even bother trying to enjoy this, because you won’t.\n\nUnfortunately, it is literally impossible to play this game and complete it within an average human lifespan. I already felt like it took 10 years off my life on account of the agony of consecutive dice rolls. So rather than play this, go play BG3. Or anything else.\n\nIt is telling that the majority of positive reviews are entirely conflicted on why they’re providing a positive recommendation while the majority of negative reviews are scathing.\n\nI hope they fixed this crap with Wrath of the Righteous because this is ridiculous.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The first step is the hardest - that's how I can sum up Owlcat's first game. So much about Kingmaker is just straight up bad and the only thing that keeps me going is admiration towards Owlcat being bold enough to actually make a game in Pathfinder ruleset. \n\nI wanna be perfectly clear - this system sucks ass. Don't listen to sychopants and nerds, it's simply bad and there's no way around it. Like I genuinely cannot believe someone could willingly gaslit themselves into playing this abomination of a ruleset. It's like sniffing your own farts and being proud about it. Everything about Pathfinder is atrociously bloated, overcomplicated and just simply not fun. This system inherits everything that is objectively bad about DnD: extremely long lists of worthless feats, stacking +1 buffs from every possible source as the prime instrument of buildcrafting, skills that are mostly meaningless outside very specific circumstancees, godawful spell slot system paired with mandated resting. I cannot stress enough how inherently anti-fun the spell slot system is - it's literally a warcrime DnD have commited against the whole TTRPG world. It's basically the equivalent of your parents gifting you a cool toy for Christmas yet allowing you only 5 minutes per day to play with it. But not only Pathfinder copies all the wrong things DnD does, it doubles down on bloating every aspect of it. Every rule has dozens of exceptions, instead of one dispel - there are dozens of different effect-specific dispels, literally hundreds of weapon-types that literally do the exact same damage. If you haven't guessed already yeah, I really do dislike Pathfinder system. And what's even worse, the game really does an awful job of explaining it.\n\nIf you have ever played an Owlcat game before - you can already guess what kind of encounter/boss design Kingmaker has. Imagine a DM that for whatever reason hates the party so badly, they will stop at nothing in order to humiliate and wipe them out. That's how it works in general in Kingmaker. Overinflated DCs for every mob in the game, attacks that deal permanent stat damage, bosses that spam disables, mobs spawning behind your back to disrupt your positioning. Some call it a \"challenge\", but honestly it feels like cheating. You can overcome it if you really want to, but it doesn't make it more fair or balanced. But the worst offender gameplay wise is time limits - time limits everywhere. Some are obvious, some are not, some are just a side-quest lost - no big deal, some can ruin your whole game potentially wasting dozens of hours of gameplay. I hope you like unintentionally failing like literally half of your quests because you were forced to stay in your capital jerking off your advisor for two weeks straight - because it will happen and it will happen a lot. \n\nThe most succinct summary i can give to Kingmaker is that I literally had more fun building villages in the kingdom simulator part than playing the game itself. Thus, I can't really recommend it to anyone other than DnD nerds. Go play WOTR or Rogue Trader. This game has 25% of negative reviews for a reason.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Such a bizarre choice to put the entire campaign on a timer. Imagine if they did that in Skyrim.... This game would have been so much better if you had time to explore, level, and really enjoy the game without feeling a constant pressure. What's even more disappointing is how much I love the tabletop version of Pathfinder, which I've been playing since it very first released around 2009-ish? I really wanted to like this but I can't get into it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Story is boring as sin, and the \"choices\" in many cases lack any nuance and are absent of what a interesting character (you as a character in this game, but also in many examples your NPC Companions) would decide to do. Many of the kingdom actions and decisions are surface level and have no long stretching consequences in the campaign that i've seen. Your characters \"moral\" options are a joke because in cases where your NPCs may betray you or act out of line the choices are either you let them go with no consequence, lightly scold them, or... Hack of their head in a execution. In either the cases of hacking off their head or scolding them the game will punish you for making decisive actions like this, not with a alignment shift, but also because you eliminated the super cool character some writer wrote up by having the penalities be rather harsh now that their gone. In many cases these characters personal quests tie into your kingdoms prosperity to in alot of cases, so rather than just having the consequence of not getting to  use your NPC companion or learn their full story, but your kingdom is somehow dragged down a level or two. Also good luck on making a replacement for that companion you dismiss or kill if there also a  advisor for you, they often are the best in slot and you get a inherent penalty for using multiple custom characters, unless you were to mod their stats to reduce the mercenary debuff given which is only really there to enforce you using the NPCs the game gives you for a party,  which helps speak to the confidence the writers have in their own work or the agency of a player.\n\nCompanions are in general terribly written, unlikable or subversive or traitorous for characters that really have no excuse for doing these things other than to annoy the player. If the game basically didnt make it mandatory to use most of them as advisors I would have dismissed or killed many of them.\n\nThe game is also extremely buggy in Acts 3 & 4 to the point where I would have to go back on saves made a hour or two before a decision (thank god i save fairly regularly) or download toybox to fix the initiation for quests after looking them up and realizing that they were bugged and not working properly. \n\nGameplay itself is quite alright, Pathfinder has always been a exceptional ttrpg system and translates well into the game barring a few hiccups that can be expected for any CRPG or a system with alot of crunch and expansive as Pathfinder, which i do not blame the dev for its just naturally going to happen and they did well keeping the spirit of the tabletop into combat for better or for worse. This does mean in some cases your expected to min-max a bit if you want to be able to get through tougher challenges or to advance without wanting to rip your hair out, but you have enough wiggle room to make variant characters and not have to level the same 4 skills to max every level up if you know what your doing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wanted to enjoy Pathfinder: Kingmaker, but I found the controller setup and tutorials very frustrating. It took me quite a while just to figure out how combat actually worked — whether it was turn-based or if the game was fighting automatically for me.\n\nThe gamepad layout feels awkward and not very intuitive, especially for a CRPG of this depth. A proper control diagram or a clearer tutorial system would make a huge difference for players using a controller instead of mouse and keyboard.\n\nI can tell there’s a lot of depth here and it probably becomes enjoyable once you learn the systems, but the early experience is not friendly to new players or those using gamepads.\n\nHopefully future titles (or an update) improve controller support and make the tutorials more accessible — because the world and style seem great otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't believe this was a game created by Owlcat, but I guess everyone has to start somewhere.\n\nDo not waste any time on this game, just play WOTR (Pathfinder: Wrath of the Righteous). \n\nThis game is an uncomplete mess and the juice is just not worth the squeeze when compared to the other games that owlcat has developed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% of attack rolls for your team will miss regardless of actual chance to hit. Spent 14 rounds of combat trying to land one hit on a single enemy. Combat ended in a party wipe.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}