{
  "positive": [
    {
      "review": "Great game, very addictive - some of the custom maps are really good and extend the life of the game massively.  shame it is not longer supported by the devs.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "It’s a great game to play, especially for those who love strategy games. Playing randomly won’t help, only thoughtful planning will lead you to complete your missions on the map.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game could be great if they added more units and nations but the game is still fun. 7.5 out of 10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "To describe the game in one word will be: Challenging. It starts fun and interesting but as you progress further its starts to punish you for bad decisions and on your next try you give your best not to repeat said mistakes, although the game  always finds a way to make it harder for you (which is a plus). I would return to replay it on harder difficulty or make other decisions on the tech tree for the end game. The last mission took my 64 tries to beat it, given my lack of knowledge what is good and bad chooses. Still i enjoyed it. If you are wondering for this game, my advice is to be patient, its rewarding but it takes time to get there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun and challenging RTS game. I really enjoy building up my colonies and defending against waves of infected. My only real complaint is that units can have poor pathfinding which sometimes causes them to go outside the colony and walk into infected (I’ve lost so many units in this way). Some more types of attack towers would have good as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game, lots strategy and interesting a new takes on the Genre. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's definitely worth buying.\nI wish the developers would make some extensions for it.\nThe only negative thing that comes to mind is that in hero level for taking the all documents and scores you have spend long time and click randomly across the building.\nBut the tower defense levels (especially when the game says they are coming from the north) was as great as hell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Start a colony, build an army, upgrade your defenses, protect the living, kill the dead. A really fun, challenging strategy game. The survival mode is where it shines. The mechanics are super simple but the random map layouts and difficulty modifiers make for intense scenarios.\n\nSome people say the game was abandoned, but it wasn't. It was just...completed. It's done. It's a full game. And a good one at that!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish this game was polished a but more. I absolutely love this game and its one of the few in this genre that i do. The main storyline ends up sucking if you mess up certain upgrades and gets very grindy with no easy way forward. The open world building is very good though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most unforgiving games out there.... which makes it that much more rewarding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really Challenging Campaign, but so satisfying to survive the waves and build out the empire. I normally pause when i have to build materials to build/upgrade my colony so a level can take up to 2 hours so far. But this has been my jam when I'm playing single player. Excited for TAB 2 or CO-OP campaign!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredibly fun and challenging RTS. The skirmish modes remind me of more classic RTS games and the game is incredibly balanced. The design of the game is great, and there is enough unit variety that many different playstyles can be tried.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A unique and engaging tower defense game. Great visuals and art style, sound track, gameplay, and tech progression. It's quite satisfying to clear areas, pushing defenses forward, and seize resources - all while making sure there's zero gaps to be attacked. With no option to load saves, essentially forcibly locking you into an 'ironman' mode, it can be frustrating to lose at the very end after hours of effort but the wins are sweeter as well. 9/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to enjoy and tinker strategies and upgrades",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game especially for those of us that like to turtle in strategy games and then get blasted by waves to test the defences we've built.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are some technical issues here and there, like questionable ultrawide + borderless support (just use Borderless Gaming or similar), but they're small enough to overlook. Great game, if a little frustrating at times.\nI've seen no other game that fits in the niche quite like this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most unforgiving game, The dead are just like in the show the last of us and the Living dead..And they cheat, oh my do they cheat... If you win a level on this on anything other than whats required to get to the next level your a pussy, lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good RTS. Lots of zombies. Steampunk vibe. \r\n\r\nHaven't touched the campaign, survival mode is where it is at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is tough to beat, but you grow stronger with every mission you complete, every feature you unlock in the skill tree, and every improvement you make to your strategy — whether it’s optimizing your buildings or refining your micro- and macro-management. It’s definitely challenging, yet every failed mission drives you to try again immediately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you loved turtling in StarCraft 1 / Broodwar, this is your game (but different)!  I played (and enjoyed) the campaign first, which got a mixed review upon release from those with experience playing the randomized missions.  It's just so. slow. with some BS achievements.  My <10 year old kids hated it, found it boring.\r\n\r\nGraphics are not 3D.  Palette is morose.  Difficulty feels high at first; while you can save for the night and come back... it's \"rogue-like\" in that you can't restore a mid-mission save and between-mission tech tree is permanent (with some bad choices).   You can legit save backups between missions, but it's awkward in how it works and the name carries forward. If you're not a fan of wasting your time, turn off Steam cloud (at your own risk) and manually back up save files while out of the game.  There's no real tutorial.  It helped to watch a few good players on Youtube.  Things that really helped me push through on 100% 'Challenging' in my first playthrough (did drop final mission to 50% because I already had my 10k achievement in the bag, and was glad I did):\r\n- Tents are the priority for both building and defending.  You can build them in rows of two.\r\n- Reviewing the maps ahead of time (on the wiki) is common sense.  Where is stone?  Where is iron?  Wouldn't hurt to review recommended techs, either.\r\n- Patrol works in lieu of a wall before the first swarms.\r\n- One contiguous wall is enough for the first few missions, only if you build random wall bits in front of it.  Any randomly placed as 'scratching posts' are a great early warning system, when wood is scarce.  Zombies are dumb and will take the shortest empty-map path to your command center.  Take note if that means they will clump to which side of your wall.\r\n- In general, expand from one choke point to the next, placing walls between clumps of rock or trees.  Middle mouse button to toggle grid view to confirm if your walls are contiguous.  They did a nice job with 'houses you build generate gold' so that expansion is wherever you want, rather than just where the StarCraft minerals are.\r\n- Build your houses in tidy rows of two, with a space before the next row of two, ideally so that the alleyway between is in the direction that troops may need to move quickly.\r\n- The swarm is always bigger than you think.  Tells you in the bottom left when the next official swarm is coming.  When there's no more listed there, there's no more official swarms to worry about.\r\n- Soldiers can handle everything, but clumping them causes 'zeds' from very far away to rush towards you (and through your base if that's in the way of their path to the soldiers).  Noise is additive per tile, takes a moment to decay away, and stretches much farther than you can see.\r\n\r\nI made it through on 100% 'Challenging' difficulty by trying things out and watching YouTubers like Kensei play on enhanced difficulties.  Wouldn't have realized how to do a lot of the above without it.  But after getting past the first 'no swarm until Day 60' missions I found watching those ahead hurt my enjoyment so I stopped (and just checked the wiki map image for where resources/ paths lead).  Still looked up tech tree upgrade suggestions, though.  The game obviously isn't that forgiving and doesn't respect your time... would have preferred an early option in the campaign to be like \"I enjoy roguelikes\" versus \"Starting over repeatedly is for people without other games to play\".  This game would have benefited from prebuilt tutorials and the ability to manually save mid-level.  Even so, my kids got bored of it because it is a very slow game even when you are winning.\r\n\r\nPS. Foundry collectibles have changed since the guides 5 years ago.  Can't click 3 items in the northeast office and missing 20 empire points?  Find it in the northwest office, for me it was a floor book to the south of that room.  Possibly a couple of other hero mission collectibles changed.\r\n\r\nSurvival note to self:\r\nChallenging and challenging went to wave on day 93 before special infected (and coming from all sides), and gave a score factor of 80%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it, and hate it at the same time. I get my ass kick on this game. 9 out of 10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible game. Would give anything for a sequel",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love it. hate it. wasted so much time on it. worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, need some expansions/DLCs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its actually a great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sick game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "strategy with action!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kill zombies simple as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played for over 100 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's SUPER fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good survival RTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is this game good?\nYes\n\nIs this game made for masochists who dont know what the word \"fun\" means?\nYes\n\n---\n\nThey are Billions is when you take the idea of tower defense, flip it on its head, add colony management to it and then throw a horde mechanic towards the player and yell \"Have fun with that one, A**hole!\".\n\nYou min max or you die. You kite or you die. You build the RIGHT colony or you die. You build efficient or you die. You skill proper or you die.\n\nI think the one thing the game really has going for it that if you end up failing it doesnt spell disaster. Your save file doesnt get erased. You dont lose any progress other than on the level you played on. You can even reset the entire research tree at no cost whatsoever so you can experiment with what you may be wrong about. That is until you won a game with it. Then you can get screwed on that lol\n\nNow would I say that the game is worth 30 bucks? Well it is 6 years old. And the gameplay isnt the most entertaining. Its more a case of \"Lock in and enjoy\". So if you are that kinda person? Yea it is. If not, wait for a sale.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Great game, very addictive - some of the custom maps are really good and extend the life of the game massively.  shame it is not longer supported by the devs.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "The standard RTS part was fun, especially on higher difficulties. The levels where you had to move your character around in the fortress were absolute cancer.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "My biggest complaint is that there isn't more, so that's pretty good.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "They Are Billions (TAB) is a really fun but brutally unforgiving mix of light RTS and light tower defence.\n\nYou start off with a humble town hall and a handful of units, then slowly expand your settlement across a map absolutely crawling with zombies of all kinds. Every few days, a massive swarm will come crashing into your defences, and it’s entirely up to your hastily built walls, towers, and soldiers to hold the line, all while juggling your city’s economy and resources.\n\nThe real kicker? It only takes one stray, basic zombie slipping through your defences to trigger a chain reaction that turns your proud metropolis into yet another undead wasteland. One minute you’re admiring your growing city, the next you’re watching it collapse in a glorious domino effect of panic, fire, and screaming.\n\nThere’s a good variety of zombies to keep you on your toes. Everything from the shambling basics to nightmare special infected that run at mach 10 and chew through your defences like paper. Thankfully, you’ve got a growing roster of units, towers, and upgrades to counter them, from simple rangers with bows to powerful snipers, Tesla towers, mech units and more.\n\nThe campaign is fantastic too, easing you in by gradually introducing new buildings, units, and zombie types as you progress. It strikes a nice balance between teaching you the ropes and still punishing every mistake in spectacular fashion.\n\nIt’s stressful, it’s punishing… and it’s brilliant.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great game. It's sad the developers stopped supporting it. 900% difficulty is sketchy due to really poor mutant AI.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "It’s a great game to play, especially for those who love strategy games. Playing randomly won’t help, only thoughtful planning will lead you to complete your missions on the map.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "10/10 plumbing simulator, you'll know when you have a leak in your walls because then 90 zombies appear and end your run.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "This game has great replayability, its like starcraft meets zombies, i really enjoy it!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game could be great if they added more units and nations but the game is still fun. 7.5 out of 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "one of the best rts that ive ever played, nothing scratches this itch since star craft 2",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A fun and challenging RTS game. I really enjoy building up my colonies and defending against waves of infected. My only real complaint is that units can have poor pathfinding which sometimes causes them to go outside the colony and walk into infected (I’ve lost so many units in this way). Some more types of attack towers would have good as well.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "To describe the game in one word will be: Challenging. It starts fun and interesting but as you progress further its starts to punish you for bad decisions and on your next try you give your best not to repeat said mistakes, although the game  always finds a way to make it harder for you (which is a plus). I would return to replay it on harder difficulty or make other decisions on the tech tree for the end game. The last mission took my 64 tries to beat it, given my lack of knowledge what is good and bad chooses. Still i enjoyed it. If you are wondering for this game, my advice is to be patient, its rewarding but it takes time to get there.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An incredibly fun and challenging RTS. The skirmish modes remind me of more classic RTS games and the game is incredibly balanced. The design of the game is great, and there is enough unit variety that many different playstyles can be tried.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A unique and engaging tower defense game. Great visuals and art style, sound track, gameplay, and tech progression. It's quite satisfying to clear areas, pushing defenses forward, and seize resources - all while making sure there's zero gaps to be attacked. With no option to load saves, essentially forcibly locking you into an 'ironman' mode, it can be frustrating to lose at the very end after hours of effort but the wins are sweeter as well. 9/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wish this game was polished a but more. I absolutely love this game and its one of the few in this genre that i do. The main storyline ends up sucking if you mess up certain upgrades and gets very grindy with no easy way forward. The open world building is very good though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most unforgiving games out there.... which makes it that much more rewarding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really Challenging Campaign, but so satisfying to survive the waves and build out the empire. I normally pause when i have to build materials to build/upgrade my colony so a level can take up to 2 hours so far. But this has been my jam when I'm playing single player. Excited for TAB 2 or CO-OP campaign!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to enjoy and tinker strategies and upgrades",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game especially for those of us that like to turtle in strategy games and then get blasted by waves to test the defences we've built.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are some technical issues here and there, like questionable ultrawide + borderless support (just use Borderless Gaming or similar), but they're small enough to overlook. Great game, if a little frustrating at times.\nI've seen no other game that fits in the niche quite like this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most unforgiving game, The dead are just like in the show the last of us and the Living dead..And they cheat, oh my do they cheat... If you win a level on this on anything other than whats required to get to the next level your a pussy, lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play this game 7 years ago. Recently saw it on steam (having forgotten it existed) and bought it to play again. It's so much fun. Great mix of strategy, awareness/paranoia and RTS base building unit spamming. Having enough layers of walls and choosing the choke points to survive for long enough for your troops to clean up is fun in the final wave. The random map generation makes 2 games on the same map feel completely different so replayability is very high. Love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's quite good.  The missions are a bit long due to needing to reach a specific colonist count, which almost always happens after you have defeated the zomboids, so you are just spamming food, energy, and huts.  The hero missions are a nice twist as are the old newspaper clippings from the pre-zombie outbreak era.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6.5/10\nDecent game with some flaws.\nPathfinding is very basic and it becomes a problem when your troops fight in a group. The ones at the back don't move around the front ones and the ones at the front are unable to move around  the group when you want to save it after tanking zombies, especially Venoms.\nGame does a poor job of providing information. The stats of the buildings, especially towers are hidden from us in the technology tree and we have to manually mouse over towers to check for tower ranges whereas I would have preferred if turning on life bars would also show the range of towers too. Also, that should have been a toggle instead of having to hold it down for the sake of QOL\nMap layouts sometimes don't make sense. How on earth did humans manage to set up rail tracks and a damn HQ whilst surrounded by zombie hordes? The very last mission is the worst example. All this trouble just to build next to the fallen statue?? Why?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, but it is very hard.  I would almost liken it to the Dark Souls of RTS.  Maybe I just suck at it, but on the hard/200% difficulty I still haven't finished the campaign as of this review.  Yes, I could lower the difficulty anytime but I don't want to quit if I don't have to.  \nThe game is very unforgiving, if you lose a level, start all over, no restarting from a certain point in the level.  The only exception is if you save and quit you can come back to it (like you started a level, got about halfway through realized you had to get off the computer, you can save it and return from that point), but if you die, you go back.  The reason I think why is because, the game counts how many zombies you kill and adds to the overall total that all players of the game have killed.  That's one upside, if you killed a bunch of zombies in a level but you lost the zombies you killed still counts towards that and zombie kill achievements.     \nDuring the campaign you get tech points to get new and improve current units and buildings.  However, once you pick the technology you're stuck with it, (if you pick it on the menu you can change it around or take it back, but once you leave that screen you're locked in,)  so if you don't like the unit or building you bought you have to use it or live with it.  \nI think there's ways to save your campaign progress right before picking tech and if it doesn't work you can go back, but it's not intuitive.  \nThere's also survival levels aside from the main campaign and you can download other maps from the workshop but that's about all the content you get.\nFor the most part though the pathfinding is fine but it can be a little hit or miss especially in cramped areas with a large army.  There are \"hero\" missions where you play as one character, (you might can rescue others in the level but you start with just your character) that are more tedious than challenging, but they're also a kind of relief because they're still pretty easy and give valuable tech points for the campaign.\nOverall, the game isn't perfect but it's still a very neat game and still fun to pop into here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable tower defense game that rewards creative layouts. But be prepared to lose again, and again, and again, while learning how to do better each time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun games I’ve played. It offers tons of content, multiple ways to play, and strikes a perfect balance of being intuitive yet surprisingly complex. The gameplay constantly keeps you on edge, making sure you protect all sides and punishing you if you don’t manage your time and resources well. I’ve been hooked picked it up a week ago and already spent 16 hours playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun , nice, overpriced maybe a 20$ would have been a more apropriate sale but has its charm 7/10 :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and challenging one little zombie slips past you and its all over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. If you are a fan of the turtle defense strategy, building and focusing on defending your base, and defense systems, then this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The political bent is tacky, the voice acting is average to bad, and the campaign storyline is trite, but the gameplay is just so great that it makes up for all of it. A phenomenal strategy game that ruthlessly punishes hubris and poor planning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seriously underrated RTS game. From gameplay to story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, one of my favorites that combines zombies with an RTS.  Campaign was good slowly progressing you with more units and buildings introduced.  The downside here was random missions that have a \"hero\" that you solely control to take out zombies without any other RTS elements... didn't really fit in and felt like a filler.\n\nOnly other complaint is swarms at the end of a mission are difficult to predict how hard they can be.  You can spend hours setting up a huge defense expecting an endless swarm only to take win in a minute, or you just get completely steamrolled....   Despite these few drawbacks I would still definitely recommend the game just to see how satisfying it is watching your turrets and soldiers turn a horde into a bloody mess :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Вот я и закрыл важное для меня достижение - 70к за кампанию. В жизни так не сейвскамил, как тут, благо игра превентивно автосейвит вообще все твои действия без возможности отката. Даже выполняя альт-ф4, игра сначала тебя заботливо сохранит - вдруг ты удумал засейвить сессию, переиграв последнюю волну?\r\nНо изучение и эксперименты стали синонимами прохождения этой игры.\r\n\r\nХотите РТС, которая не прощает - вам сюда\r\nХотите чувствовать, как становитесь сильнее, а враг ещё сильнее - сюдааа\r\nХотите начать сраться простого зомби, аки обычный нпц - сюданах\r\n10 разорённых поселений от одного зомби из 10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game they should add more campaign mission too than DLC campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got that \"just one more  go\" thing. Only real criticism is that you cannot reset tech tree during campaign you have to start a new game and try remember what you wanted to do different! Not a game for everyone but it keeps my small brain happy...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun RTS, worth going back to and giving a try if you haven't already and you enjoy tower defense games and other games of the genre like Warcraft and Starcraft. I recommend using the \"no hero missions\" mod whilst playing through the campaign, as the hero missions are the weak point of the game and are not as fleshed out as other mechanics. They end up being quite the slog. Luckily there's now a mod you can find, just google it, which makes the campaign much more fun. Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have not found a game in awhile that makes me want to sleep late and wake up early in a long long long time. This is it, this is why we are here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the difficulty in this game, while learning it and how it allows for greater challenges as you progress.  Its got a nice balance to the push for economy whilst needing to protect your base.  And you can't just haphazardly place buildings down wherever.  Theres a lot of thought behind how all the small things come together in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good  zombie city survival game lots of fun, map generrator, never know whats ahead always new challenges",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic RTS, horrible RPG..i would skip all the RPG if it wasnt mandatory for the points to upgrade. In a sense we got scammed because when i bought it in early access there was no RPG, it was strictly an RTS game. Scammed i tell u but still good so..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Infuriatingly hard and utterly addictive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing strategy - very difficult and requires a lot of tactics and patience - top game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OMG THEY ARE BILLIONS\n\nseriously just look at my hours spent on this game should sum it up for you how good it is.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Start a colony, build an army, upgrade your defenses, protect the living, kill the dead. A really fun, challenging strategy game. The survival mode is where it shines. The mechanics are super simple but the random map layouts and difficulty modifiers make for intense scenarios.\n\nSome people say the game was abandoned, but it wasn't. It was just...completed. It's done. It's a full game. And a good one at that!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely recommend it! My only concern is the lack of options while choosing the governors. I really would like to have 3 or 4 choices but I don't think it will happen since there has not been any update in a long time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good RTS. Lots of zombies. Steampunk vibe. \r\n\r\nHaven't touched the campaign, survival mode is where it is at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is tough to beat, but you grow stronger with every mission you complete, every feature you unlock in the skill tree, and every improvement you make to your strategy — whether it’s optimizing your buildings or refining your micro- and macro-management. It’s definitely challenging, yet every failed mission drives you to try again immediately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished the campaign in max difficulty (800%) twice now (full points). Remember pausing is an important option and that the initial tech choices are very important in order to beat particular levels.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you loved turtling in StarCraft 1 / Broodwar, this is your game (but different)!  I played (and enjoyed) the campaign first, which got a mixed review upon release from those with experience playing the randomized missions.  It's just so. slow. with some BS achievements.  My <10 year old kids hated it, found it boring.\r\n\r\nGraphics are not 3D.  Palette is morose.  Difficulty feels high at first; while you can save for the night and come back... it's \"rogue-like\" in that you can't restore a mid-mission save and between-mission tech tree is permanent (with some bad choices).   You can legit save backups between missions, but it's awkward in how it works and the name carries forward. If you're not a fan of wasting your time, turn off Steam cloud (at your own risk) and manually back up save files while out of the game.  There's no real tutorial.  It helped to watch a few good players on Youtube.  Things that really helped me push through on 100% 'Challenging' in my first playthrough (did drop final mission to 50% because I already had my 10k achievement in the bag, and was glad I did):\r\n- Tents are the priority for both building and defending.  You can build them in rows of two.\r\n- Reviewing the maps ahead of time (on the wiki) is common sense.  Where is stone?  Where is iron?  Wouldn't hurt to review recommended techs, either.\r\n- Patrol works in lieu of a wall before the first swarms.\r\n- One contiguous wall is enough for the first few missions, only if you build random wall bits in front of it.  Any randomly placed as 'scratching posts' are a great early warning system, when wood is scarce.  Zombies are dumb and will take the shortest empty-map path to your command center.  Take note if that means they will clump to which side of your wall.\r\n- In general, expand from one choke point to the next, placing walls between clumps of rock or trees.  Middle mouse button to toggle grid view to confirm if your walls are contiguous.  They did a nice job with 'houses you build generate gold' so that expansion is wherever you want, rather than just where the StarCraft minerals are.\r\n- Build your houses in tidy rows of two, with a space before the next row of two, ideally so that the alleyway between is in the direction that troops may need to move quickly.\r\n- The swarm is always bigger than you think.  Tells you in the bottom left when the next official swarm is coming.  When there's no more listed there, there's no more official swarms to worry about.\r\n- Soldiers can handle everything, but clumping them causes 'zeds' from very far away to rush towards you (and through your base if that's in the way of their path to the soldiers).  Noise is additive per tile, takes a moment to decay away, and stretches much farther than you can see.\r\n\r\nI made it through on 100% 'Challenging' difficulty by trying things out and watching YouTubers like Kensei play on enhanced difficulties.  Wouldn't have realized how to do a lot of the above without it.  But after getting past the first 'no swarm until Day 60' missions I found watching those ahead hurt my enjoyment so I stopped (and just checked the wiki map image for where resources/ paths lead).  Still looked up tech tree upgrade suggestions, though.  The game obviously isn't that forgiving and doesn't respect your time... would have preferred an early option in the campaign to be like \"I enjoy roguelikes\" versus \"Starting over repeatedly is for people without other games to play\".  This game would have benefited from prebuilt tutorials and the ability to manually save mid-level.  Even so, my kids got bored of it because it is a very slow game even when you are winning.\r\n\r\nPS. Foundry collectibles have changed since the guides 5 years ago.  Can't click 3 items in the northeast office and missing 20 empire points?  Find it in the northwest office, for me it was a floor book to the south of that room.  Possibly a couple of other hero mission collectibles changed.\r\n\r\nSurvival note to self:\r\nChallenging and challenging went to wave on day 93 before special infected (and coming from all sides), and gave a score factor of 80%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it, and hate it at the same time. I get my ass kick on this game. 9 out of 10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Every time I think I've played for the last time, I come back again like a drunk ex.  Only criticism:  I really think they could have made a sequel, but I've lost hope at this point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game. Would give anything for a sequel",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like building and defense games and like the steam punk genre and zombies. This game will make you happy. It has a nice sense of progression in the campaign, which acts like a tutorial if you want to do endless mode. I find myself coming back to this game every so often to scratch an itch no other games seem to scratch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is one of my favorites. I don't feel like typing out an actual review.... This game is really well balanced. Has great graphics. It is well optimized that it ran smooth on my worse computer(slow but very smooth). I appreciate both the campaign and survival modes offering many challenges. The game is super satisfying.\r\nI never had a problem with a learning curve, but I watched this game for at least a year before I bought it. I don't think it has a particularly difficult learning curve. One thing I really I wish I had with this game was more time to play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very fun game, lots strategy and interesting a new takes on the Genre. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's definitely worth buying.\nI wish the developers would make some extensions for it.\nThe only negative thing that comes to mind is that in hero level for taking the all documents and scores you have spend long time and click randomly across the building.\nBut the tower defense levels (especially when the game says they are coming from the north) was as great as hell.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "VERY fun game, but EXTREMELY unforgiving. Any holes in your defenses WILL be found and you will be punished for them. Randomly generated maps keep it fresh between each and every ass kicking. Don't stop building and fortifying. Waves ramp up VERY quickly! Definitely recommend this game though!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "another good game that i am just terrible at. skill issue",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best RTS campaign experience ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun Game but also very difficult",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "There are a lot of fun things about they are billions, but its clear somewhere along the way they ran out of money or time. The final campaign mission is laughable at how bad it is, it starts off great as a final mission thats built up on a campaign thats too short in mission variety but too long in play time. Then it decides to throw massive BS waves at you randomly, ensuring you have to pray the enemies attack you in a nice spot or else it's several hours wasted.\n\n Not only that but a good chunk of the game has you doing hero missions. These missions can only be described as boring and a waste of time. It's a shame they're basically mandatory to get the required research points you need. The game would straight up be better without it. Add in bugs, clipping errors, and a lack of enemy and unit variety, and you have an alright game, but an alright game that LOVES to waste your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was fun until I got about 10 missions into the campaign and now even on the lowest difficulty I cannot continue the game even though I am a decent strategy player. I like the art style and thought it was fun in general, but it gets unfair and not fun at a pretty early point in the campaign. I spent too many hours retrying several strategies, missions, etc. but it didn't matter. I've never stopped playing a game for its difficulty, or left a bad review for it, but, the fact that I cannot continue the game past this point no matter what, constitutes a negative review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no restart button no exit button force save override \nshows lack of care of devs\nweird difficulty scaling \nif min to progress is 20% why can't I set this difficulty level\nno game speed control so you can't chill and play you have to sweat and min max\nno option to surrender either you have to waste time waiting zzzz",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed the game as a concept and had fun playing it. \n\nThe campaign feels like something put together in a few weeks, the level designs are really cool but the mechanics, the objectives, the game play loop got very tedious as pretty much 90 percent of the missions have the same objective. \nThe hero missions were also freaking atrocious beyond belief.\n\nThe \"Infected Killer\" achievements are the nail in the coffin for me though. Old forum posts exist of the developers promising to remove these achievements and replace them with something less tedious but 5 years later it seems they still exist and remain some of the worst achievements of any game I've ever played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign has very little story, hero missions are slow, swarms require ridiculous micro to defeat. I don't like a lot of the choices that were made here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes during champion (hero?) selection. Sadly unplayable on Linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is too hard more wasted money. get gud? how bout I have enough struggle in my life that I want my games to have an easy option. and yes I tried the easiest difficulty and cant get passed lvl 2 difficulty missions. this and warhammer. fuck these games. just to be clear ive beaten games like halo and x-com on the highest difficulty without issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the biggest complaints of the campaign is the fact that if you are losing a mission, you cannot save scum. I can understand why because the player would inevitably spend their time save scumming trying to change the result rather than restarting the map and adjusting their strategy. But the problem with that is you cannot reset your character or research trees after you have played a single mission with the points you have spent. This means that you cannot adjust your strategy at all in the campaign because you have made objectively bad choices in the research tree picks. The only solution is to lower the difficulty of the mission to progress which ruins the whole experience for the player. This punishes new players and since there is a meta, it only caters to those that enjoy the game THAT much to replay it.\n\nThe concept of the game is good, the implementation is bad locking the player into their choices. It really hurts new players especially.\n\nThe character missions whilst initially interesting became incredibly tedious and boring by the end, made worse by not picking the right talents in the talent tree which made it impossible to progress in missions without lowering the difficulty. In the end, I just rushed the character missions on the easiest mode. Add to the fact that you need to visually scour the map for items for the research and campaign points each mission which can turn a 10 minute mission into a an hour long mission as you're scouring every single room for objects you missed. This is made worse by the fact that there is no set position for the objects so guides don't help. They are randomly generated from a pool of locations each time the mission starts. So you could fail the mission and redo it only to find that the objects are in completely different locations.\n\nAs a new player, if you find a guide to follow of what skill and research points to pick, you can enjoy the game. But if you want to play this properly, you won't enjoy it as the developers actively punish you for not having spent a hundred hours prior playing the game and gaining all the knowledge needed before you even bought it. And lowering the difficulty to complete a mission just isn't fun as you cannot fix your strategy if you cannot even rectify the points wasted on bad choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fucking difficult cunt shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how are the hero missions this tedious",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is hard to recommend it.\n\nDo you like fast paced games that are very slow at the same time. Superlong runs and absolutely no information about your current strength whilst not being able to quicksave / or speedup the game. \n\nSo after about 90 minutes of tedious waiting the swarm comes runs you over and you have to start over.\nWould be ok for singleplayer but the campaign is atrocious. \n\nYou have limited tech tree points and if you do not go a certain path at the start you will be softlocked even on low difficutly. Game did not think to explain some important upgrades or whatsoever. \n\nI only played the campaign and had to restart it after 15 hours (6-7 missions) due to beforementioned softlock. \nThe campaign hero missions are quite special for a game developed in the 2010s+ since they have to be designed by one who went into retirement in the 1990s. I have never experienced pixel hunting to be so frustrating and the guides are only partially helpful.\n\nAnd for some odd reason are the cutscenes about 1/10 of the volume of the overall game and you never know when you receive em beforehand. So better play the game on a volume that your neighbors will call the police or you are not going to hear a word from that dude on that throne. (Have no idea what or who he is supposed to be because of the only thing I was able to hear in the 5-6 cutscenes was \"colony\" once)\n\nOverall Game started as 7/10\nQuickly became 3/10\n\nClunky unforgiving and it is uncertain if it wants to be fast paced with pauses or slow relaxing.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "The game itself is not bad. Its the little things that tick me off.\r\n\r\nFirst off, pathfinding is terrible. Units get stuck running while another fires and doesnt move or attempt to walk around it. Its easy to get units stuck.\r\n\r\nNext is the pacing. The game is slow except during attacks, the economy moves far too slow so starting each mission is a chore. The advances take forever and each building takes a lot of time to build. So if a mission tells you to wait until a certain day, its going to be a long and boring play.\r\n\r\nThen and finally, its the campaign. The design is horribly made, you cant go back on your investments so you can easily softlock yourself if you go on to a mission without certain techs unlocked. Its just bad design. Not to mention the bloody game sets you up telling you a horde is coming from somewhere, and bullsh*t, it comes from the other side, and ruins the game for you.\r\n\r\nIts a good game, but these details eventually killed the experience for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There are a lot of fun things about they are billions, but its clear somewhere along the way they ran out of money or time. The final campaign mission is laughable at how bad it is, it starts off great as a final mission thats built up on a campaign thats too short in mission variety but too long in play time. Then it decides to throw massive BS waves at you randomly, ensuring you have to pray the enemies attack you in a nice spot or else it's several hours wasted.\n\n Not only that but a good chunk of the game has you doing hero missions. These missions can only be described as boring and a waste of time. It's a shame they're basically mandatory to get the required research points you need. The game would straight up be better without it. Add in bugs, clipping errors, and a lack of enemy and unit variety, and you have an alright game, but an alright game that LOVES to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It was fun until I got about 10 missions into the campaign and now even on the lowest difficulty I cannot continue the game even though I am a decent strategy player. I like the art style and thought it was fun in general, but it gets unfair and not fun at a pretty early point in the campaign. I spent too many hours retrying several strategies, missions, etc. but it didn't matter. I've never stopped playing a game for its difficulty, or left a bad review for it, but, the fact that I cannot continue the game past this point no matter what, constitutes a negative review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no different game speeds, so after playing around with the semi boring base building part for lets say 1 hour.. if only 1 and i mean ONE zombie make it to a building its over..  and there is no reload checkpoint, there isnt a \"oopsie let me just go back 5min.. its over.. and once you realize its over and want to restart you cant.. unless you sit and watch the zombies destroy the rest.. and then when you restart you have to do the same thing over again for another hour and wait for enough resources to get stone going to get a barracks and its just feels sluggish. theres no reason for this game not to have  x2 button or even a x3.. why make me do the whole beginning part slow  again just to lose later by 1 zombie.. idk not a fan",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There should be an option for manual saves.  Insisting that its played in this Ironman style is an idiotic requirement.\r\n\r\nOtherwise it has a lot of potential, they just ruined it by not giving the option for saves, and trust me, when a huge mob of zombies suddenly spawns right beside your command centre, you kinda get pissed and want a way to get past it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign is a bit shit. While the other game modes get a bit repetitive. Also the game's load and save menus are clunky and can be hard to find and access.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be enjoyable to some. I guess I'm missing something because it's not that fun for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Core gameplay is fine, but campaign is poorly balanced. Not getting shock towers in time, can doom a campaign. Rushing to Shocking Tower is bad game design. Technology tree should not exist in this game.  Hero missions are awful.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very difficult game, even on easy level. You will drive yourself mad trying to finish even the first levels of this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no restart button no exit button force save override \nshows lack of care of devs\nweird difficulty scaling \nif min to progress is 20% why can't I set this difficulty level\nno game speed control so you can't chill and play you have to sweat and min max\nno option to surrender either you have to waste time waiting zzzz",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So difficult it's UNPLAYABLE. Not even that it's just difficult, this game requires your UNDIVIDED attention every NANO-SECOND it is running on your PC. This is not, \"haha gimme a challenge\" hard, this is, \"There is no fun, there is no challenge, just hours of your life wasted trying to beat an unbeatable game\" type of hard.\n\nThe reviews for this game have to have been outright bought, or posted by bots, with no more support from the devs going on this game there is no way in the condition this game is in that its \"VERY POSITIVE\" for its reviews. It's straight up unplayable. \n\nI have about 12.5 hours into this game and each thats about 3 missions, being that there are only 3, 1 star missions. So, it takes about 3-4 REAL LIFE HOURS to complete just one mission. After your 1 star missions you are 'gate-kept' on your technologies preventing you from stronger units, increased resources, or stats. (That's only playing on the easiest difficulty BTW. And there are like, 8, difficulties I think? Which is funny because the different difficulties don't do ANYTHING. You would think you could gain more technology points by doing the missions on harder difficulties, but NO).\n\nThis game had the potential to be great, but this idea the devs had was partially brought to light, and then they just ran away once they started to collect a paycheck from it. Don't bother spending money on this, there are plenty of other game that probably cost less and are significantly more fun. I would recommend Command & Conquer Red Alert 3, as that is my favorite RTS game out there.\n\nDO    NOT    BUY, LOOK THE OTHER WAY, AND BUY A DIFFERENT GAME.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The lack of save function just makes all of the minor issues of this game so glaring. Especially when you play similar games. Really poor decision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is the worst campaign I have ever played. Some random trash hero quests, if you unlock wrong things in your technology tree then at some point you will be stuck. As you have to unlock every building and unit through technolodgy tree first missions are really boring. There is also no way to force the wave or to make time past quicker so whenever you get ahed of the map you just have to wait for final wave just to get your win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyed the game as a concept and had fun playing it. \n\nThe campaign feels like something put together in a few weeks, the level designs are really cool but the mechanics, the objectives, the game play loop got very tedious as pretty much 90 percent of the missions have the same objective. \nThe hero missions were also freaking atrocious beyond belief.\n\nThe \"Infected Killer\" achievements are the nail in the coffin for me though. Old forum posts exist of the developers promising to remove these achievements and replace them with something less tedious but 5 years later it seems they still exist and remain some of the worst achievements of any game I've ever played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hero missions are only boring, and for the rest of the missons, whenever a dev add time limits to their games, that screams \"hurry up and finish before you realize the game is crap\", and to be fair, they're kind of correct..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game, but on windows 11 it is not working. I see the post on the discussions that many other guys have the same issue, and no any reaction from the developers. \n\nSo, as for now I put a downvote here to bring developers attention. If you fix it - i will change it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign has very little story, hero missions are slow, swarms require ridiculous micro to defeat. I don't like a lot of the choices that were made here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its cool, for about 2 hours and then there's nothing new. \n\nIt is an okay RTS, i never had any major game breaking problems with it and its decently hard, but the issue i have with it is, there is no \"AI\" governing the zombies, so its always the same, predictable, zombie horde. And the game gets very stale, very quickly.\n\nAll of these problems are compounded by the fact the developers are strictly against mods that improve the game, patch broken features, or add new content. and have been silent for months if not years.\n\nNot reccomended. I dont support abandonware, and i got this on sale. if i had known i probably wouldn't have bought it in the first place unfortunately.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Started very fun. Ended very poorly. Game is boring and repetitive. Campaign also needs to be more linear in terms of difficulty. It should not be stupid easy and then suddenly crazy difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, just meh. Like... there is some fun gameplay to be had in here, but it's really lacking in quality of life stuff. Even something as basic as a \"restart mission\" button is missing, meaning that if you hit a point of no return, you just have to sit and wait for your command center to be destroyed. That is such a basic thing that I almost can't believe any game of this type wouldn't have it (maybe it's there and just hidden in some really weird place? who knows). And that example is pretty emblematic of the game overall. It probably could have used a bit more time in the oven (or a patch maybe?) for things like that.\r\n\r\nThat's another thing, that's lacking: good info on what's going on. There don't appear to be actual numerical stats for my units, so I have to just go off vibes for deciding which one is better to use, which is weird. Plus even though there are callouts for when your base is under attack, I have, on more than one occasion not realized anything was wrong until one of my wall sections had already been completely destroyed and my base in shambles. Maybe that one is just a me problem, I don't know. \r\n\r\nAdditionally the writing just isn't good at all unfortunately. And for a game like this, who cares I guess, but it would have been cool to actually have some reason to care about the events of the campaign. Especially when you factor in the need for solo hero unit missions, that seem like they should be \"story missions\" (a la StarCraft) but instead, they are just busywork missions. It would probably be a nice way of mixing things up to have these missions where you aren't doing the normal RTS thing in between regular ones, but they are just lame, so it becomes a chore.\r\n\r\nAnd there are more little things I won't get into, but the point is, while any one or even two of these things i could probably just overlook and still have fun, when you add them all up it's just really hard to have a good time with this game. Many people seem to have enjoyed it, but it really seems like the game was going out its way to try to stop me from finding that fun and ultimately I just feel like it's not worth it.\r\n\r\nPS: There are still a lot of good ideas in here, and the fact that there definitely is fun to be found underneath all of the annoyances says a lot. I'd call this pretty okay for a first game and I hope the devs keep honing their craft and make an even better one next time :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "god this campagin is dog shit. games cool but it has so many design choices that are just bizzar. like the game refuses to no save less you ended it with task manager. i like to save scumb when i make a stupid ass mistake on my 10+ hour campagin run but no get stuff enjoy your mission that will now have lower score.... which is a resource you use in infested horde mission that the empire helps you with. empire points are the worst part of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game.  I've played thousands of hours on it.  Now that I am fine tuning and getting into precision play, the broken targeting system has enraged me enough to provide my feedback in the form of this review.  So many good things about this game, how could you managed to screw this part up?  It should be a replayable game with endless possibilities, but all you learn more and more about is how inconsistent it is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even at 'accessible' if you screw up on the map build like an hour and fifteen minutes in, you're behind the 8 ball and fucked when the final wave comes.  I dunno, make it maybe a little less punishing for casual players?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes during champion (hero?) selection. Sadly unplayable on Linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really don't appreciate a single-player base builder that gives you constant paranoia about attacks from all directions.  It was a neat concept, but there needs to be a more structured adversary to make this enjoyable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Did not like this game. Constantly crashed on me. Game play itself is frustrating. Units do not do what you tell them to. They bunch up and stand stagnant while tripping over eachother and will not progress. One zombie gets through you lose the whole map. Combine this with units not moving unless you guide them every step. Need your units to go between buildings without holding their hand and clicking 100000x times to get them through,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The deliberate blocking of save games/quicksave COMBINED WITH there being no option to restart the map means you have absolutely no save game or map control at all and are basically in a forced iron man mode by default in this game.  Even Frostpunk gives you more control than this.    I am refunding it for this reason.  I'm really sick of developers that lack creativity just bluntly making something non-user friendly as a way of adding \"uniqueness\" - like \"hey no one else decided to screw over the player like this, we should do it for novelty sake since we can't think of anything actually creative!\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is too hard more wasted money. get gud? how bout I have enough struggle in my life that I want my games to have an easy option. and yes I tried the easiest difficulty and cant get passed lvl 2 difficulty missions. this and warhammer. fuck these games. just to be clear ive beaten games like halo and x-com on the highest difficulty without issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really wanna like this game, but no manual saving at all is a bizarre choice. One oversight, one singular Zombie getting too close and you can tear down your entire base and hope it's enough to stop the cascade (it isn't); 1 hour or more completely wasted. You can't even learn much from defeats as sometimes, you may just get unlucky and poof, you're done.\n\nI get that it's part of the design philosophy, but to require that every player has to sweat the game to accomplish anything is, again, such a bizarre and dumb choice for an otherwise very enjoyable experience. \n\nIn other words, I just wanna play the game without having to master it first and be locked in at all times, but it's design requires both from the start with no room for slight mistakes or any reasonable way to salvage a run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty was increased from before.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the biggest complaints of the campaign is the fact that if you are losing a mission, you cannot save scum. I can understand why because the player would inevitably spend their time save scumming trying to change the result rather than restarting the map and adjusting their strategy. But the problem with that is you cannot reset your character or research trees after you have played a single mission with the points you have spent. This means that you cannot adjust your strategy at all in the campaign because you have made objectively bad choices in the research tree picks. The only solution is to lower the difficulty of the mission to progress which ruins the whole experience for the player. This punishes new players and since there is a meta, it only caters to those that enjoy the game THAT much to replay it.\n\nThe concept of the game is good, the implementation is bad locking the player into their choices. It really hurts new players especially.\n\nThe character missions whilst initially interesting became incredibly tedious and boring by the end, made worse by not picking the right talents in the talent tree which made it impossible to progress in missions without lowering the difficulty. In the end, I just rushed the character missions on the easiest mode. Add to the fact that you need to visually scour the map for items for the research and campaign points each mission which can turn a 10 minute mission into a an hour long mission as you're scouring every single room for objects you missed. This is made worse by the fact that there is no set position for the objects so guides don't help. They are randomly generated from a pool of locations each time the mission starts. So you could fail the mission and redo it only to find that the objects are in completely different locations.\n\nAs a new player, if you find a guide to follow of what skill and research points to pick, you can enjoy the game. But if you want to play this properly, you won't enjoy it as the developers actively punish you for not having spent a hundred hours prior playing the game and gaining all the knowledge needed before you even bought it. And lowering the difficulty to complete a mission just isn't fun as you cannot fix your strategy if you cannot even rectify the points wasted on bad choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fucking difficult cunt shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is hard to recommend it.\n\nDo you like fast paced games that are very slow at the same time. Superlong runs and absolutely no information about your current strength whilst not being able to quicksave / or speedup the game. \n\nSo after about 90 minutes of tedious waiting the swarm comes runs you over and you have to start over.\nWould be ok for singleplayer but the campaign is atrocious. \n\nYou have limited tech tree points and if you do not go a certain path at the start you will be softlocked even on low difficutly. Game did not think to explain some important upgrades or whatsoever. \n\nI only played the campaign and had to restart it after 15 hours (6-7 missions) due to beforementioned softlock. \nThe campaign hero missions are quite special for a game developed in the 2010s+ since they have to be designed by one who went into retirement in the 1990s. I have never experienced pixel hunting to be so frustrating and the guides are only partially helpful.\n\nAnd for some odd reason are the cutscenes about 1/10 of the volume of the overall game and you never know when you receive em beforehand. So better play the game on a volume that your neighbors will call the police or you are not going to hear a word from that dude on that throne. (Have no idea what or who he is supposed to be because of the only thing I was able to hear in the 5-6 cutscenes was \"colony\" once)\n\nOverall Game started as 7/10\nQuickly became 3/10\n\nClunky unforgiving and it is uncertain if it wants to be fast paced with pauses or slow relaxing.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "The game itself is not bad. Its the little things that tick me off.\r\n\r\nFirst off, pathfinding is terrible. Units get stuck running while another fires and doesnt move or attempt to walk around it. Its easy to get units stuck.\r\n\r\nNext is the pacing. The game is slow except during attacks, the economy moves far too slow so starting each mission is a chore. The advances take forever and each building takes a lot of time to build. So if a mission tells you to wait until a certain day, its going to be a long and boring play.\r\n\r\nThen and finally, its the campaign. The design is horribly made, you cant go back on your investments so you can easily softlock yourself if you go on to a mission without certain techs unlocked. Its just bad design. Not to mention the bloody game sets you up telling you a horde is coming from somewhere, and bullsh*t, it comes from the other side, and ruins the game for you.\r\n\r\nIts a good game, but these details eventually killed the experience for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There are a lot of fun things about they are billions, but its clear somewhere along the way they ran out of money or time. The final campaign mission is laughable at how bad it is, it starts off great as a final mission thats built up on a campaign thats too short in mission variety but too long in play time. Then it decides to throw massive BS waves at you randomly, ensuring you have to pray the enemies attack you in a nice spot or else it's several hours wasted.\n\n Not only that but a good chunk of the game has you doing hero missions. These missions can only be described as boring and a waste of time. It's a shame they're basically mandatory to get the required research points you need. The game would straight up be better without it. Add in bugs, clipping errors, and a lack of enemy and unit variety, and you have an alright game, but an alright game that LOVES to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It was fun until I got about 10 missions into the campaign and now even on the lowest difficulty I cannot continue the game even though I am a decent strategy player. I like the art style and thought it was fun in general, but it gets unfair and not fun at a pretty early point in the campaign. I spent too many hours retrying several strategies, missions, etc. but it didn't matter. I've never stopped playing a game for its difficulty, or left a bad review for it, but, the fact that I cannot continue the game past this point no matter what, constitutes a negative review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no different game speeds, so after playing around with the semi boring base building part for lets say 1 hour.. if only 1 and i mean ONE zombie make it to a building its over..  and there is no reload checkpoint, there isnt a \"oopsie let me just go back 5min.. its over.. and once you realize its over and want to restart you cant.. unless you sit and watch the zombies destroy the rest.. and then when you restart you have to do the same thing over again for another hour and wait for enough resources to get stone going to get a barracks and its just feels sluggish. theres no reason for this game not to have  x2 button or even a x3.. why make me do the whole beginning part slow  again just to lose later by 1 zombie.. idk not a fan",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There should be an option for manual saves.  Insisting that its played in this Ironman style is an idiotic requirement.\r\n\r\nOtherwise it has a lot of potential, they just ruined it by not giving the option for saves, and trust me, when a huge mob of zombies suddenly spawns right beside your command centre, you kinda get pissed and want a way to get past it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign is a bit shit. While the other game modes get a bit repetitive. Also the game's load and save menus are clunky and can be hard to find and access.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be enjoyable to some. I guess I'm missing something because it's not that fun for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Core gameplay is fine, but campaign is poorly balanced. Not getting shock towers in time, can doom a campaign. Rushing to Shocking Tower is bad game design. Technology tree should not exist in this game.  Hero missions are awful.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very difficult game, even on easy level. You will drive yourself mad trying to finish even the first levels of this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no restart button no exit button force save override \nshows lack of care of devs\nweird difficulty scaling \nif min to progress is 20% why can't I set this difficulty level\nno game speed control so you can't chill and play you have to sweat and min max\nno option to surrender either you have to waste time waiting zzzz",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So difficult it's UNPLAYABLE. Not even that it's just difficult, this game requires your UNDIVIDED attention every NANO-SECOND it is running on your PC. This is not, \"haha gimme a challenge\" hard, this is, \"There is no fun, there is no challenge, just hours of your life wasted trying to beat an unbeatable game\" type of hard.\n\nThe reviews for this game have to have been outright bought, or posted by bots, with no more support from the devs going on this game there is no way in the condition this game is in that its \"VERY POSITIVE\" for its reviews. It's straight up unplayable. \n\nI have about 12.5 hours into this game and each thats about 3 missions, being that there are only 3, 1 star missions. So, it takes about 3-4 REAL LIFE HOURS to complete just one mission. After your 1 star missions you are 'gate-kept' on your technologies preventing you from stronger units, increased resources, or stats. (That's only playing on the easiest difficulty BTW. And there are like, 8, difficulties I think? Which is funny because the different difficulties don't do ANYTHING. You would think you could gain more technology points by doing the missions on harder difficulties, but NO).\n\nThis game had the potential to be great, but this idea the devs had was partially brought to light, and then they just ran away once they started to collect a paycheck from it. Don't bother spending money on this, there are plenty of other game that probably cost less and are significantly more fun. I would recommend Command & Conquer Red Alert 3, as that is my favorite RTS game out there.\n\nDO    NOT    BUY, LOOK THE OTHER WAY, AND BUY A DIFFERENT GAME.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The lack of save function just makes all of the minor issues of this game so glaring. Especially when you play similar games. Really poor decision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is the worst campaign I have ever played. Some random trash hero quests, if you unlock wrong things in your technology tree then at some point you will be stuck. As you have to unlock every building and unit through technolodgy tree first missions are really boring. There is also no way to force the wave or to make time past quicker so whenever you get ahed of the map you just have to wait for final wave just to get your win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyed the game as a concept and had fun playing it. \n\nThe campaign feels like something put together in a few weeks, the level designs are really cool but the mechanics, the objectives, the game play loop got very tedious as pretty much 90 percent of the missions have the same objective. \nThe hero missions were also freaking atrocious beyond belief.\n\nThe \"Infected Killer\" achievements are the nail in the coffin for me though. Old forum posts exist of the developers promising to remove these achievements and replace them with something less tedious but 5 years later it seems they still exist and remain some of the worst achievements of any game I've ever played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hero missions are only boring, and for the rest of the missons, whenever a dev add time limits to their games, that screams \"hurry up and finish before you realize the game is crap\", and to be fair, they're kind of correct..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game, but on windows 11 it is not working. I see the post on the discussions that many other guys have the same issue, and no any reaction from the developers. \n\nSo, as for now I put a downvote here to bring developers attention. If you fix it - i will change it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign has very little story, hero missions are slow, swarms require ridiculous micro to defeat. I don't like a lot of the choices that were made here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its cool, for about 2 hours and then there's nothing new. \n\nIt is an okay RTS, i never had any major game breaking problems with it and its decently hard, but the issue i have with it is, there is no \"AI\" governing the zombies, so its always the same, predictable, zombie horde. And the game gets very stale, very quickly.\n\nAll of these problems are compounded by the fact the developers are strictly against mods that improve the game, patch broken features, or add new content. and have been silent for months if not years.\n\nNot reccomended. I dont support abandonware, and i got this on sale. if i had known i probably wouldn't have bought it in the first place unfortunately.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Started very fun. Ended very poorly. Game is boring and repetitive. Campaign also needs to be more linear in terms of difficulty. It should not be stupid easy and then suddenly crazy difficult.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, just meh. Like... there is some fun gameplay to be had in here, but it's really lacking in quality of life stuff. Even something as basic as a \"restart mission\" button is missing, meaning that if you hit a point of no return, you just have to sit and wait for your command center to be destroyed. That is such a basic thing that I almost can't believe any game of this type wouldn't have it (maybe it's there and just hidden in some really weird place? who knows). And that example is pretty emblematic of the game overall. It probably could have used a bit more time in the oven (or a patch maybe?) for things like that.\r\n\r\nThat's another thing, that's lacking: good info on what's going on. There don't appear to be actual numerical stats for my units, so I have to just go off vibes for deciding which one is better to use, which is weird. Plus even though there are callouts for when your base is under attack, I have, on more than one occasion not realized anything was wrong until one of my wall sections had already been completely destroyed and my base in shambles. Maybe that one is just a me problem, I don't know. \r\n\r\nAdditionally the writing just isn't good at all unfortunately. And for a game like this, who cares I guess, but it would have been cool to actually have some reason to care about the events of the campaign. Especially when you factor in the need for solo hero unit missions, that seem like they should be \"story missions\" (a la StarCraft) but instead, they are just busywork missions. It would probably be a nice way of mixing things up to have these missions where you aren't doing the normal RTS thing in between regular ones, but they are just lame, so it becomes a chore.\r\n\r\nAnd there are more little things I won't get into, but the point is, while any one or even two of these things i could probably just overlook and still have fun, when you add them all up it's just really hard to have a good time with this game. Many people seem to have enjoyed it, but it really seems like the game was going out its way to try to stop me from finding that fun and ultimately I just feel like it's not worth it.\r\n\r\nPS: There are still a lot of good ideas in here, and the fact that there definitely is fun to be found underneath all of the annoyances says a lot. I'd call this pretty okay for a first game and I hope the devs keep honing their craft and make an even better one next time :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "god this campagin is dog shit. games cool but it has so many design choices that are just bizzar. like the game refuses to no save less you ended it with task manager. i like to save scumb when i make a stupid ass mistake on my 10+ hour campagin run but no get stuff enjoy your mission that will now have lower score.... which is a resource you use in infested horde mission that the empire helps you with. empire points are the worst part of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game.  I've played thousands of hours on it.  Now that I am fine tuning and getting into precision play, the broken targeting system has enraged me enough to provide my feedback in the form of this review.  So many good things about this game, how could you managed to screw this part up?  It should be a replayable game with endless possibilities, but all you learn more and more about is how inconsistent it is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even at 'accessible' if you screw up on the map build like an hour and fifteen minutes in, you're behind the 8 ball and fucked when the final wave comes.  I dunno, make it maybe a little less punishing for casual players?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes during champion (hero?) selection. Sadly unplayable on Linux.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really don't appreciate a single-player base builder that gives you constant paranoia about attacks from all directions.  It was a neat concept, but there needs to be a more structured adversary to make this enjoyable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Did not like this game. Constantly crashed on me. Game play itself is frustrating. Units do not do what you tell them to. They bunch up and stand stagnant while tripping over eachother and will not progress. One zombie gets through you lose the whole map. Combine this with units not moving unless you guide them every step. Need your units to go between buildings without holding their hand and clicking 100000x times to get them through,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The deliberate blocking of save games/quicksave COMBINED WITH there being no option to restart the map means you have absolutely no save game or map control at all and are basically in a forced iron man mode by default in this game.  Even Frostpunk gives you more control than this.    I am refunding it for this reason.  I'm really sick of developers that lack creativity just bluntly making something non-user friendly as a way of adding \"uniqueness\" - like \"hey no one else decided to screw over the player like this, we should do it for novelty sake since we can't think of anything actually creative!\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is too hard more wasted money. get gud? how bout I have enough struggle in my life that I want my games to have an easy option. and yes I tried the easiest difficulty and cant get passed lvl 2 difficulty missions. this and warhammer. fuck these games. just to be clear ive beaten games like halo and x-com on the highest difficulty without issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really wanna like this game, but no manual saving at all is a bizarre choice. One oversight, one singular Zombie getting too close and you can tear down your entire base and hope it's enough to stop the cascade (it isn't); 1 hour or more completely wasted. You can't even learn much from defeats as sometimes, you may just get unlucky and poof, you're done.\n\nI get that it's part of the design philosophy, but to require that every player has to sweat the game to accomplish anything is, again, such a bizarre and dumb choice for an otherwise very enjoyable experience. \n\nIn other words, I just wanna play the game without having to master it first and be locked in at all times, but it's design requires both from the start with no room for slight mistakes or any reasonable way to salvage a run.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty was increased from before.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the biggest complaints of the campaign is the fact that if you are losing a mission, you cannot save scum. I can understand why because the player would inevitably spend their time save scumming trying to change the result rather than restarting the map and adjusting their strategy. But the problem with that is you cannot reset your character or research trees after you have played a single mission with the points you have spent. This means that you cannot adjust your strategy at all in the campaign because you have made objectively bad choices in the research tree picks. The only solution is to lower the difficulty of the mission to progress which ruins the whole experience for the player. This punishes new players and since there is a meta, it only caters to those that enjoy the game THAT much to replay it.\n\nThe concept of the game is good, the implementation is bad locking the player into their choices. It really hurts new players especially.\n\nThe character missions whilst initially interesting became incredibly tedious and boring by the end, made worse by not picking the right talents in the talent tree which made it impossible to progress in missions without lowering the difficulty. In the end, I just rushed the character missions on the easiest mode. Add to the fact that you need to visually scour the map for items for the research and campaign points each mission which can turn a 10 minute mission into a an hour long mission as you're scouring every single room for objects you missed. This is made worse by the fact that there is no set position for the objects so guides don't help. They are randomly generated from a pool of locations each time the mission starts. So you could fail the mission and redo it only to find that the objects are in completely different locations.\n\nAs a new player, if you find a guide to follow of what skill and research points to pick, you can enjoy the game. But if you want to play this properly, you won't enjoy it as the developers actively punish you for not having spent a hundred hours prior playing the game and gaining all the knowledge needed before you even bought it. And lowering the difficulty to complete a mission just isn't fun as you cannot fix your strategy if you cannot even rectify the points wasted on bad choices.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fucking difficult cunt shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is hard to recommend it.\n\nDo you like fast paced games that are very slow at the same time. Superlong runs and absolutely no information about your current strength whilst not being able to quicksave / or speedup the game. \n\nSo after about 90 minutes of tedious waiting the swarm comes runs you over and you have to start over.\nWould be ok for singleplayer but the campaign is atrocious. \n\nYou have limited tech tree points and if you do not go a certain path at the start you will be softlocked even on low difficutly. Game did not think to explain some important upgrades or whatsoever. \n\nI only played the campaign and had to restart it after 15 hours (6-7 missions) due to beforementioned softlock. \nThe campaign hero missions are quite special for a game developed in the 2010s+ since they have to be designed by one who went into retirement in the 1990s. I have never experienced pixel hunting to be so frustrating and the guides are only partially helpful.\n\nAnd for some odd reason are the cutscenes about 1/10 of the volume of the overall game and you never know when you receive em beforehand. So better play the game on a volume that your neighbors will call the police or you are not going to hear a word from that dude on that throne. (Have no idea what or who he is supposed to be because of the only thing I was able to hear in the 5-6 cutscenes was \"colony\" once)\n\nOverall Game started as 7/10\nQuickly became 3/10\n\nClunky unforgiving and it is uncertain if it wants to be fast paced with pauses or slow relaxing.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "The game itself is not bad. Its the little things that tick me off.\r\n\r\nFirst off, pathfinding is terrible. Units get stuck running while another fires and doesnt move or attempt to walk around it. Its easy to get units stuck.\r\n\r\nNext is the pacing. The game is slow except during attacks, the economy moves far too slow so starting each mission is a chore. The advances take forever and each building takes a lot of time to build. So if a mission tells you to wait until a certain day, its going to be a long and boring play.\r\n\r\nThen and finally, its the campaign. The design is horribly made, you cant go back on your investments so you can easily softlock yourself if you go on to a mission without certain techs unlocked. Its just bad design. Not to mention the bloody game sets you up telling you a horde is coming from somewhere, and bullsh*t, it comes from the other side, and ruins the game for you.\r\n\r\nIts a good game, but these details eventually killed the experience for me.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There are a lot of fun things about they are billions, but its clear somewhere along the way they ran out of money or time. The final campaign mission is laughable at how bad it is, it starts off great as a final mission thats built up on a campaign thats too short in mission variety but too long in play time. Then it decides to throw massive BS waves at you randomly, ensuring you have to pray the enemies attack you in a nice spot or else it's several hours wasted.\n\n Not only that but a good chunk of the game has you doing hero missions. These missions can only be described as boring and a waste of time. It's a shame they're basically mandatory to get the required research points you need. The game would straight up be better without it. Add in bugs, clipping errors, and a lack of enemy and unit variety, and you have an alright game, but an alright game that LOVES to waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It was fun until I got about 10 missions into the campaign and now even on the lowest difficulty I cannot continue the game even though I am a decent strategy player. I like the art style and thought it was fun in general, but it gets unfair and not fun at a pretty early point in the campaign. I spent too many hours retrying several strategies, missions, etc. but it didn't matter. I've never stopped playing a game for its difficulty, or left a bad review for it, but, the fact that I cannot continue the game past this point no matter what, constitutes a negative review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no different game speeds, so after playing around with the semi boring base building part for lets say 1 hour.. if only 1 and i mean ONE zombie make it to a building its over..  and there is no reload checkpoint, there isnt a \"oopsie let me just go back 5min.. its over.. and once you realize its over and want to restart you cant.. unless you sit and watch the zombies destroy the rest.. and then when you restart you have to do the same thing over again for another hour and wait for enough resources to get stone going to get a barracks and its just feels sluggish. theres no reason for this game not to have  x2 button or even a x3.. why make me do the whole beginning part slow  again just to lose later by 1 zombie.. idk not a fan",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There should be an option for manual saves.  Insisting that its played in this Ironman style is an idiotic requirement.\r\n\r\nOtherwise it has a lot of potential, they just ruined it by not giving the option for saves, and trust me, when a huge mob of zombies suddenly spawns right beside your command centre, you kinda get pissed and want a way to get past it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign is a bit shit. While the other game modes get a bit repetitive. Also the game's load and save menus are clunky and can be hard to find and access.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Might be enjoyable to some. I guess I'm missing something because it's not that fun for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Core gameplay is fine, but campaign is poorly balanced. Not getting shock towers in time, can doom a campaign. Rushing to Shocking Tower is bad game design. Technology tree should not exist in this game.  Hero missions are awful.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very difficult game, even on easy level. You will drive yourself mad trying to finish even the first levels of this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "no restart button no exit button force save override \nshows lack of care of devs\nweird difficulty scaling \nif min to progress is 20% why can't I set this difficulty level\nno game speed control so you can't chill and play you have to sweat and min max\nno option to surrender either you have to waste time waiting zzzz",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "So difficult it's UNPLAYABLE. Not even that it's just difficult, this game requires your UNDIVIDED attention every NANO-SECOND it is running on your PC. This is not, \"haha gimme a challenge\" hard, this is, \"There is no fun, there is no challenge, just hours of your life wasted trying to beat an unbeatable game\" type of hard.\n\nThe reviews for this game have to have been outright bought, or posted by bots, with no more support from the devs going on this game there is no way in the condition this game is in that its \"VERY POSITIVE\" for its reviews. It's straight up unplayable. \n\nI have about 12.5 hours into this game and each thats about 3 missions, being that there are only 3, 1 star missions. So, it takes about 3-4 REAL LIFE HOURS to complete just one mission. After your 1 star missions you are 'gate-kept' on your technologies preventing you from stronger units, increased resources, or stats. (That's only playing on the easiest difficulty BTW. And there are like, 8, difficulties I think? Which is funny because the different difficulties don't do ANYTHING. You would think you could gain more technology points by doing the missions on harder difficulties, but NO).\n\nThis game had the potential to be great, but this idea the devs had was partially brought to light, and then they just ran away once they started to collect a paycheck from it. Don't bother spending money on this, there are plenty of other game that probably cost less and are significantly more fun. I would recommend Command & Conquer Red Alert 3, as that is my favorite RTS game out there.\n\nDO    NOT    BUY, LOOK THE OTHER WAY, AND BUY A DIFFERENT GAME.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The lack of save function just makes all of the minor issues of this game so glaring. Especially when you play similar games. Really poor decision.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is the worst campaign I have ever played. Some random trash hero quests, if you unlock wrong things in your technology tree then at some point you will be stuck. As you have to unlock every building and unit through technolodgy tree first missions are really boring. There is also no way to force the wave or to make time past quicker so whenever you get ahed of the map you just have to wait for final wave just to get your win",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyed the game as a concept and had fun playing it. \n\nThe campaign feels like something put together in a few weeks, the level designs are really cool but the mechanics, the objectives, the game play loop got very tedious as pretty much 90 percent of the missions have the same objective. \nThe hero missions were also freaking atrocious beyond belief.\n\nThe \"Infected Killer\" achievements are the nail in the coffin for me though. Old forum posts exist of the developers promising to remove these achievements and replace them with something less tedious but 5 years later it seems they still exist and remain some of the worst achievements of any game I've ever played.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hero missions are only boring, and for the rest of the missons, whenever a dev add time limits to their games, that screams \"hurry up and finish before you realize the game is crap\", and to be fair, they're kind of correct..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game, but on windows 11 it is not working. I see the post on the discussions that many other guys have the same issue, and no any reaction from the developers. \n\nSo, as for now I put a downvote here to bring developers attention. If you fix it - i will change it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign has very little story, hero missions are slow, swarms require ridiculous micro to defeat. I don't like a lot of the choices that were made here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its cool, for about 2 hours and then there's nothing new. \n\nIt is an okay RTS, i never had any major game breaking problems with it and its decently hard, but the issue i have with it is, there is no \"AI\" governing the zombies, so its always the same, predictable, zombie horde. And the game gets very stale, very quickly.\n\nAll of these problems are compounded by the fact the developers are strictly against mods that improve the game, patch broken features, or add new content. and have been silent for months if not years.\n\nNot reccomended. I dont support abandonware, and i got this on sale. if i had known i probably wouldn't have bought it in the first place unfortunately.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}