{
  "positive": [
    {
      "review": "If you're coming to The Crew 2 expecting a deep narrative or ultra-realistic racing simulation, you'll be disappointed. But if you're looking for a massive, unadulterated open-world playground where the core loop is simply having fun with a staggering variety of vehicles, this game is a gem.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Crew 2's strong points are huge map and crazy variety of different events. On the other hand you've got terrible UI, unpleasant driving physics and average graphics. 6/10",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I was in the middle of the street and suddenly turned into a plane. I don’t know why but the game did. Thanks Crew, you always get me.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "not bad at all\n\njust try it, maybe this game not the best, but it better than another shit arcade expensive game. \nnot best like forza series, assetto corsa, NFS heat, and another peak game. \nbut its better than Burnout, Carx series, and etc for the price\n\nso this worth to buy",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "このゲームはとても楽しくて、リラックスするのにぴったりです。フォルツァホライゾンに似ているタイプのゲームがとても好きなので、フォルツァホライゾン6の発売を待ちながら楽しんでいます。",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good game good graphics huge map and alot of activities",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is a bit outdated and the physics are not the best (def wouldnt recommend a wheel on this game)\r\nThe prices are not realistic at ALL. 1M for a C7 ZR1, 80K for a monster truck. Although the game has a lot of cons there is great customization on the cars, bikes, planes, etc. This game is good if you are just looking to have fun with your friends and race. 7.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fills a specific niche in open world racing games I appreciate. Really sucks Ivory Tower is stuck in the Ubisoft mines.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game and I play it alone for hours. Of course, I would have liked it to have a more complete collection of cars in the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game with a lot of variety, the boat and fly races are a bit boring. And the stories could also use variety, its just like; drive 10km here and that times 8. And i would like to see more variety in cars and customization. but its good for a lot of hours of fun. If your a car guy just get forza",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS GREAT. FUN,FUN and more FUN\r\ngot it on a deal and will enjoy this gem, i would say try it when on special its legit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest - As far as racing games goes this controls worse than forza horizon 5 and the crew motorfest, but once you get past that It's just a really fun game packed full of fun, It's world is huge, there is a ton to do, and It's just a blast to drive around in.  \n\nI wholly recommend playing this before The Crew Motorfest since all the vehicles you earn here can be imported into Motorfest too, and who knows how long the Crew 2 will still be online?\n\nAll in all while i think Motorfest is a better short-term experience, crew 2 is better long term.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. \nAlso, interesting liveries out there. I guess Ubisoft doesn't check what players upload. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great driving game, not simulator but still. \r\nLike the ability to hotswap between cars/boats/planes. would like to have ability to hot swap between car/boat/plane types (Sport car -> drift car)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, awesome cars, a lot of cars, realistic, great wheel feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "graphics ar so deam good and the game is so good, is worth the bucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun. I enjoyed most of the different vehicles you get to play. I also enjoyed the map of the USA. Since its a squashed down version it will be off at times, but it is a very nice looking game to drive around in, has a very nostalgic feel for anyone that has doen cross country tours and lives in multiple major cities around the country. \r\n\r\nIf you are a fan of games like Forza Horizon, I would suggest trying this out. I liked the game enough to get the Motorfest when it's on sale for half off.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game there is a huge map a lot to do and vehicles are not hard to get i recommend this game to anyone who wants a good vehicle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not very good grapchis. espected more. map is huge but isnt at it is in real life. if ur a kid buy it but i would chose the crew moterfest over this game. overall a good game for som1 whos looking to start",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game,has a decent amount of content and the driving feels decent. The variety of the cars are somewhat lacking with actual recognisable cars for me. The recent addition of an offline mode makes it so ubisoft cant pull a ubisoft and shut down something that you paid for and own. if its on sale you CAN do worse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was out in 2018 and still got some major update!! Big-up to the devs for that!! <3 I don't play anymore but had fun on it for some times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL,DR: Fun game with a massive open world and wide variety of vehicles, but its successor is better overall. Worth getting when bundled with Crew Motorfest at a massive discount, plus you get to import your Crew 2 vehicles to Motorfest which is a fantastic move by IVT. \r\n\r\nThe game has a ton of vehicles and many, many races to do. Chances are you'll find your favourite cars in here except for Toyotas (thankfully Motorfest has Supras but still no LFA). The handling is more arcade-like compared to Motorfest's more realistic driving physics, and cars handle noticeably differently from each other. There is a \"pro settings\" option to adjust a vehicle's handling to your liking. I personally don't really care for the planes and boats, I enjoy the driving more but to each their own. Weekly summits give you a reason to return to the game, for better or worse depending on how much you like the live service model.\r\n\r\nHowever, I hate the parts system in this and its successor, it just adds to the grind and detracts from the experience. The weekly summits should be enough for player retention. Farming for the set bonus you want (which is important if you want to platinum summits) is RNG and time-consuming, and you'll have to periodically clear your inventory of all the garbage parts you've obtained. The offline mode in Crew 2 isn't great, it exists as a separate save so any progress made in offline mode will be lost if you decide to overwrite this save later from a more recent online save. The car sounds feel artificial, it's inferior even to older games like NFS Hot Pursuit. There are different genres of music you can switch between in the player but the tracks themselves are boring or annoying, just play your own music.\r\n\r\nOverall, it's inferior to Motorfest despite having a larger map but still a fairly fun game on its own merit. Just don't buy at full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic racing game I played in recent times. I liked forza, but this one is on another level, and gameplay is very smooth. Better than FH5 in my opinion in-terms of player engagement.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, enjoy the mixed races that go from car to boat, planes, etc. lots of races and things to do/ unlock",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that how this game it has a diffrrent varieties  of  sport racings rally, touring, streetracing, drag and also diffrent type of planes, bikes, boats and more i reccomend this game if u like to expirience the american roads !!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi i just recently bought the crew 2 but im facing a big probelm after downloading it\ni can't get the cd key or the activation key even if i go to the properties of the game i can't find the cd key any help guys please asap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game! \nlike literally there is nothing I hate about the crew 2; and If you are a racing fan, this will probably be the only racing game you ever need cos it's got everything! Drift, drag, race, demolition derby, stunts, boats, planes, you name it, the game has got it. \n\nNow I know there are some people who say the handling is too arcade like, and to them I say, you can easily fix this issue by manually tuning your car and also through engine upgrades cos everything is adjustable. So don't miss out and give the game a try before its online features go away, which IMO are the things that actually make the game great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isnt just a driving game its a fight thru hell boats make you wanna die of boredom planes wanna make you die of rage motorcycles are mid hoverboards make you wanna set urself on fire but cars are a 10/10 experience so if you hate yourself and like cars its an amazin game i recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The first game and motorfest are way better but it has great content added to it for free the summit and the multiplayer is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very enjoyable; though, the vehicle handling takes some getting used to if you've played a lot of other racing games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got this game for 50 rupees as a promo for Motorfest, but the memories and the fun that ensued were much more than that. Amazing experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was really easy to learn, I struggled on Mouse and Keyboard till a Friend told me I can use Controller",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A friend of mine recommended me The Crew 2 a long time ago, and while I was initially sceptical about the game, it turned out to be one if not my favourite racing game ever. And even made me love the genre despite I was never a fan of racing games.\n\nThe best thing of the games is the many disciplines you have and vehicles available for you to drive, from old vehicles such as the classic Porsche cars to the newest ones such as the latest Audi R8. You can use the whole United States to fly, drive, ride your motorbike or sail, visiting every major city and doing every type of competition with your vehicles such as street races, rallying, stunts competitions with your aircrafts or a race on the sea. My only negative point is how sometimes the car's driving feels like a tank, specially crashing, but generally speaking the driving is really well executed. \n\nFor a 2018 game it aged perfectly, with good visuals not only for the interiors and exteriors of the vehicles (which can be really customizable) but for the landscapes and cities of the United States. Sometimes you can just travel without purpouse through the map and enjoy the map.\n\nAnd about the sound (sound effects and music) is pretty enjoyable, but my only flaw is how generic the music stations sound. \n\nThe standard edition of the game costs 30€, kinda fair if you plan to spend hundreds of hours playing the game. Although during sales the price drops to a very low price, such as 2 or 3€ more or less.\n\nI'd say that The Crew 2 is that game that even if you don't like racing games such as Gran Turismo, Need for Speed or Forza Horizons/Motorsport you can enjoy. Not only is easy to learn the mechanics but also is pretty relaxing to just hop on a vehicle and travel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very good game you cannot get bored with your freinds if you get a drift car and a hypercar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing and probably the best car/boat/airplane game ever, and the graphics are AMAZING FOR MEDIUM level and A LOT of cars and different races, truly a immersive experience. I love the \"Hybrid mode\" ( allows you to transfer your progression over to an offline mode) and the map is huge has a lot to offer for a game that seems to be constantly on a deal. In a conclusion matter, amazing game, I do recommend to other car lovers!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun, and there is so much you can do in this game  it is even better when you play it with friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a very good game, i bought it on sale for only 3 euro. The drifting in this game is the best i have ever played it is just one problem, i cant connect my logitech wheel to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game cool cars cant say much else other than im a crazy pilot, only con is money is not quick to get but it kinda makes it more fun imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Not for those who are looking for a super realistic car game but it is still an all around great game! If you are wanting games like forza, then you have very bad game tastes. the crew is 10 times better than forza! big map",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such a good game, i just love it, great graphics and sounds. good pricing as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] I PLAY WITHOUT crew, ANY QUESTIONS? [/h1]\r\n\r\nPersonally, I’d give The Crew 2 a “good” rating (without comparing it to the first one – I never got around to playing it).\r\n\r\nTC2 really does have a lot of cool features: planes and boats are finally here, plus a pretty basic progression system.\r\n\r\nThe map size is seriously impressive – it feels like a mini-America, giving players plenty of space to explore and race around.\r\n\r\nBut there’s a big problem – the map isn’t filled with interesting spots. What I mean is, there’s a lack of TRULY unique activities and places to discover. Sure, there are cargo delivery missions, but really, it’s just random drives from one random point A to another random point B.\r\n\r\nMoreover, the artificial intelligence in the game does not provide a real challenge. On the \"Ace\" difficulty, it can be somewhat tough, as the AI sometimes behaves incorrectly—simply put, it cheats. Because of this, the player almost always needs to be in first place to avoid losing, which kills the competitive spirit and reduces the satisfaction of victory.\r\n\r\nIt's hard to say much about online. The tracks are the same as in solo mode, and the modes are not very diverse. And, probably logically, to compete at least somewhat equally with most players online, you need to grind. New cars don't appear very often, so blaming the game for being pay-to-win isn't entirely fair.\r\n\r\nOverall, The Crew 2 is an interesting game with good concepts and possibilities, but it lacks content and depth to become a truly memorable project.\r\n\r\nAnd hopefully, the same won't happen with the second installment and Motorfest as it did with the first.\r\n\r\n[h3] P. S. 2x. Did you like the review or my profile? Drop a Steam reward for the review. Thanks to your support, I don't lose the point of playing and writing reviews! [/h3]",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "THE GAME IS REALLY GOOD. BUT WE SHOULD HAVE A CUSTOM CAMERA ANGLE. IT WOULD MAKE THE EXPERIENCE A LOT BETTER.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, first other car game i really played",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Entertaining, don't expect forza, wait for a discount",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought it during a promotion for 1euro and I must say best 1 euro ever spent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blasting The Four Season Summer at 320 KM/H is peak gameplay. \n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bikes ass, everything else acceptable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game could use better car upgrades",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game especially with friends,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and fun (dont try airplanes)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very fun game to play with friends. I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fire but need more cars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used my dirtbike to fly, It made plane sounds\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend kept bragging about his Lambo, that's why I ran him over my Honor, nothing more nothing less",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "that game takees driving cars gamess to another level :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just buy motorfest, its worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first proper racing game. And I have to say, I am thoroughly enjoying it! ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very good and its realy great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody reads my reviews anyway.\nI'll throw in a recipe for Varenyky.\n\nRecipe for Potato Dumplings (Varenyky)\nIngredients:\nFor the dough:\nWheat flour – 500 g\nWater – 200 ml\nEgg – 1\nSalt – 1 tsp\nFor the filling:\nPotatoes – 1 kg\nOnions – 2\nLard or butter – 50 g\nSalt – to taste\nGround black pepper – to taste\nPreparation steps:\nMaking the dough:\nSifting the flour: Sift the flour into a large bowl.\nMaking the dough: Add salt and the egg to the flour. Gradually pour in the water, constantly stirring. Knead the dough until it becomes smooth and elastic.\nResting the dough: Wrap the dough in plastic wrap or cover it with a towel and let it rest for 30 minutes.\nPreparing the filling:\nBoiling the potatoes: Peel the potatoes, cut them into large pieces, and boil until tender in salted water.\nPreparing the onions: While the potatoes are boiling, finely chop the onions. Sauté the onions in lard or butter until golden brown.\nMaking the potato puree: Drain the potatoes and mash them. Add the sautéed onions, salt, and pepper to taste, and mix well.\nForming the dumplings:\nRolling out the dough: Roll out the dough into a thin sheet about 2-3 mm thick. Use a glass or cutter to cut out circles approximately 7-8 cm in diameter.\nForming the dumplings: Place a spoonful of potato filling on each circle of dough. Fold the dough in half and pinch the edges tightly to seal the dumplings.\nCooking the dumplings:\nBoiling water: Bring a large pot of water to a boil, add salt.\nCooking the dumplings: Gently drop the dumplings into the boiling water, stirring carefully to prevent sticking. Cook until done (approximately 5-7 minutes after they float to the surface).\nServing:\nRemoving the dumplings: Remove the dumplings with a slotted spoon and place them on a plate.\nServing: Serve the dumplings hot, optionally drizzling with melted butter, sour cream, or sautéed onions.\nEnjoy your meal!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty bad physics but it's very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game love motorcikle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i remember playing this on Xbox, its cool and i gotta play it again sometime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gamenya bagus, sayang banget gaada motor supra bapak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an awesome game, the perfect way to blow off some steam.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a realistic and relacing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 one of the best racing open world game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only because it was on big sale but yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can drive a car, a motorbike, a plane, a boat! What are you waiting for?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "great game, great memories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game\nThe Crew 2 8/10\nHeisen",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Very good, Trust me and your mom gng",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realistic and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game... 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it late, but enjoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best To Play When You Are In Bad Mood <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cars goooo brrrrrrrrrrrrrrr its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game totally worth it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a good game infact",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great would recormend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright but cant fly plane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire graphics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very sexy game.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ive played a lot its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than new Need For Speed games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a shit game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not bad game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "supur game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than forza 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Ubisoft launcher literally never remembering my password.\n\nnot gonna waste money on your crap in the future, i'm sure pirating is a much nicer user experence.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "The Crew 2 tries to be an all-in-one racing experience — cars, boats, planes — but ends up failing at almost everything. The voice acting is bad, customization feels weak, and the UI is clunky. Driving doesn’t feel good either: cornering, turning, and general car handling are terrible, like the vehicles have no weight or traction. Planes and boats somehow manage to feel even worse, with awkward controls and no sense of speed or realism. The game looks decent from far away, but up close the quality sucks, and it all feels shallow.\n\nOverall, The Crew 2 is a huge open world full of things to do — none of which are actually fun.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "redownloaded this excited about the offline feature just to find yet another game has added battle eye i will not allow this backdoor onto my system TY for added another game to my list of (enjoy to play but cannot due to BS AC that is kernel level BS)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a lot of configuration just to get the game running, bad controls that make your experience unbearable, really poor optimization, no tips on the beginning of the game. Overall, this game is NOT worth your money nor time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actually amazing concept for a game, but they completely broke steering wheels with recent updates and they no longer work at all. Do not buy the game if you want to play with a wheel you will be disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's broken. It's constantly lagging. Car won't suddenly move, gets stuck in the road for a second. Can't play it man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cars dont feel great.\nThere are bikes but they dont feel great.\nThere are planes but they dont feel great.\nThere are boats but they dont feel great.\nThe perfect example of a jack of all trades but master of none..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most 5/10 racing game you can think of.\n- ubisoft made (bad thing if you're a bit clueless)\n- character customization with the worst set of clothes you can imagine and a very limited character selection. so bad i'd probably enjoy the game more if they didn't include it or at least chose to not add some cars in favour of adding more character items. primarily irritating because roughly 1/3 of each clothing category is just hogged up by clothing recolours, with no way of choosing colours for the clothing after you buy it, similar to car interiors or rims.\n- \"hybrid mode\" which is a bit of a shabby attempt at an offline mode. it exists but in of itself it is a 5/10 feature. at least it won't get ripped from you completely like the original crew.\n- good car list, but the car pricing is so off that you don't even want to buy cars that you would in any other racing game; for instance, why is an EVO VI 335k and a GTR Nismo is 334k? a stock S2000 is 323k, and a Miura SV is 302k. how do you, for lack of better wording, fuck up pricing that badly?\n- very different from the first crew. if it was still 2018 and you had only played the first crew, i'd probably suggest you to not play this because it's like stepping into an earlier version of the current festival racing genre. fun at times but a complete drag for grinding money, xp, or figuring out what on earth you want to do next because everything just feels dull after you've gotten all the cars you want and completed the current \"weekly challenge set\" and having friends to play it with you doesn't change that\n- story. oh god. complete drag, you have a few... noticeable character traits if you feel like turning your playthrough into an observation activity in a psychology degree. just trust me, if you do get it, go to audio right after booting up the game and set the voices slider to 0. saves your ears from the regular, corny, irritating cut-in line that is absolutely pointless and the regular thing you just respond \"yes i know that already\" or \"oh just shut up\" to.\n\ntl;dr: 5/10, mid, droning experience that babies you too much and feels a bit like GTAO at points.\nunless you're an IGN reviewer in which case it's either a 0/10 or a 10/10 with how badly it babies you at times and is very over-simplified. not the worst but... i mean it regularly goes on sale for like £2, knock yourself out it's fairly worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game just will not work right for me. Mouse doesn't work on the map, seems like every button makes me leave the map which is annoying, and I cannot get anything to work properly while using the wheel. Now I remember why I only played this \"3 hours\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game rarely ever fucking launches and when it does it can be incredibly underwhelming due to the lack of vehicles unless willing to pay for pass after pass. L Ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very weak game. low graphics, playing so bad like nfs 3. is not worth !!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not a bad game, but... Good graphics, but the mechanics leave a lot to be desired and it's very difficult to get into the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the thing is, you cannot play offline, because you have to be connected with ubi-pig.\r\nThey call it offline but it is not. So don't buy the game if offline gaming, specially as ubisof closing servers like they do, you loose everything you put in it. \r\nBest to stay away from game developers and publishers who like to have you online with their servers, one day it will close. Offline so called standalone gaming is real ownership. And online should be an additive, not the root of the software. \r\nSo choose wisely! \r\nIt is just racing around like all race games. no biggy!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Such a \"meh' game. There are a million problems with it. I'll make a list:\r\n\r\n1- It's locked to 60fps. Such a letdown.\r\n2- The graphics are fine for its time, but the anti-aliasing is horrifyingly bad.\r\n3- The physics feel like it's a mobile game or something. The cars are too grippy, the turns feel inconsistent etc. It's a HUGE downgrade coming from either recent NFS games or Forzas.\r\n4- There's too much content but barely any depth to them. No one asked for Planes or Boats. Wish it was all cars.\r\n5- The map is great to explore, but sometimes it's so barren. It's got reduced details compared to TC1.\r\n6- The CONSTANT notifications and stuff on your screen. GOD. It's like you're in a TV advertisement. The UI is so cluttered. I've spent 13hrs on this game and understand absolutely NOTHING about what I should do and where I should go.\r\n7- The races are meh. Very very basic.\r\n8- The playerbase is pretty dead. Have seen like 3 player cars so far. And found no PVP matches.\r\nI bought this for $1 or $2 when it was on like 99% sale. It's worth just that much. Not more.\r\n\r\nI really hope Motorfest is better because I'm planning on getting it during the Winter sale. Hope it doesn't disappoint.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3/10\r\nDon’t waste your time and money on this game.\r\n\r\n-The cars suffer from stiff handling and feel heavy and unresponsive compared to other games.\r\n-The graphics are mediocre at best and dated at worst.\r\n-The vehicles feel extremely slow due to the lack of visual feedback for speed (ignoring the \r\n  speedometer). To make things worse, the developers removed the ability to turn off the awful motion \r\n  blur and TAA (for players like me, for example).\r\n-Activities feel bland and unwarranted at times—like driving a demolition derby car across the country \r\n  with no real stakes.\r\n-You’re forced to grind for hours to get randomly generated loot to upgrade your car, as if this were an \r\n  MMORPG or a Borderlands title instead of an arcade racing game.\r\n-There’s no incentive to get better or cooler cars since performance is determined by loot with numbers \r\n  on it.\r\n-Even the high-end cars suffer from poor control and a lack of speed, feeling like turbocharged bricks of \r\n  misplaced steel and aluminum.\r\n-The offline mode still requires anti-cheat and for me refused to work when my internet was down (great \r\n  one Ubisoft :D)\r\n-Final point: the cars have a terrible lack of customization and feel utterly bland.\r\n\r\nIt’s better to buy a Need for Speed game or find another arcade racing sim (but not Forza Horizon, especially Forza Horizon 5).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not offline. Hybrid requires ubisoft to connect to the Internet even after you have created a local save. Not worth it when you want to play this on a handheld PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't even bother to buy rather than standard package because they don't refund money after buying Golden package or extra cars. They don't provide the cars packages in game. so useless to pay extra money to them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Revoked game ownership after 46hours, game supposeably linked to another email address. Same thing happened with Wildlands, The Division 2 Brooklyn DLC. This company is so corrupt!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking into buying the game to play with a steering wheel dont do it. It doesnt work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't play on Linux. not buying anymore Ubisoft games till this changes! games come second to privacy and Bill Gates is a pedophile!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "управление говно + 60 фпс лок + юбисофт + визуально говно кароче игра параша дырявая \nubisoft",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kept asking for cd key when launching support cant even help me did everything they said. Ubisoft trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my outlook email was stolen from me (microsoft refused to help me get it back) witch was the email on my ubisoft account i have since made a new ubisoft account but i am forced to buy another copy of this game because ubisoft said they cant change my email for \"security reasons\" (even tho i provided every single detail of the account) and i cant launch this game thru steam because of a \"licence ownership error\" i contacted ubisoft support to get this fix but they said they couldnt do anything (go figure) so now im out 30 bucks because both microsoft an ubisoft refused to do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Game feels dirty. It is packed with Lootboxes and other special currencies and bs. Even the progressing and unlocking of Events feels bad as they kinda Pop Up like some Slotmachine win or some bs. Also the required ubi launcher always sucks. Overall even 5 dollars for deluxe version feels like a scam. Sad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game keeps crashing or won't even open in most cases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even though they have allowed an offline mode, just sail the high seas for the first one, it's infinitely better than this generic festival racer slop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unless you like holding the right trigger or vehicles that feel like wet bar soap, there are a lot of other things you can do with your time than grind away in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is actually the worst piece of garbage I have ever opened on my pc. \nkeeps crashing, won't let me create an offline save.\nThe game is just awful awful awful. I just want to drive an S1K around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Offline mode was added but still cannot start the game without Battleye???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can the anti-cheat can be disabled in single player so I can play the game *I paid for* again? Thanks :)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ubisoft, being Ubisoft, completely half-assed the offline mode everybody was asking for. Amazing.\nHere's hoping the community manages to bring the livery editor to offline mode at some point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mimo że grę kupiłem za 4 zł dalej żałuję pieniędzy nie wiem co tu robić po prostu jeździłem po mapie nie widzę żadnych misji ani nic a w dodatku domyślnie ustawiony język rosyjski nie polecam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game not working becuase of the app Ubisoft+",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "graphics sucks\r\nthe game's FPS is limited to 60 Only",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no linux, no game, no fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many steps to get started and kinda crap.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My computer can't handle this shit, so I have to use it.Geforce now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you plan to use it with any steering wheel it most of the time it wont work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "take a sh*t tone of time to get a good care kys",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "waste of time buy forza",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "fuck you, i need my save data offline",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Downgrade from the crew 1.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the crew 1 was better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ITS BAD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bruhh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They finally released the offline mode for The Crew 2 but what a deception it is, without a doubt it was evident that Ubisoft would have failed this as they fail everything they do / touch. \n\n- BattlEye still is required to play (even the offline part of the game), remove it at least for the offline part then you'll get a lot of points.\n- Season pass not working offline unless you go online and export the savegame but then if you want to start a new game offline without going online first or if the online servers goes down forever then you'll be out of luck, change this and you'll get points for sure.\n- The exclusive cars (previous seasons, locked content, etc...) aren't playable offline except if you export your online save (which must have the content unlocked) to the offline part but once the servers will be down, forget about it, make it so we can get all the cars for offline play and you'll get a lot of points.\n- Make some of the online modes available with AI / bots and you'll get lot of points.\n- Make liveries from online stay on offline and let us be able to import and export them so we can save them on our storarge and online so we can also share them with other people while being able to play the game offline and you'll get points.\nIf you do all of the points above, i'll give this game a positive feedback and i may purchase The Crew Motorfest.\nBut in all honesty, i doubt that Ubisoft will do any of those points but the community / modders will do some of them.\nIt's Ubisoft we're talking about after all, The Crew Unlimited's team made a better job than Ubisoft could ever do.\n\nGot the game for less than 3$ and i still feel ripped off.\n\n\nEdit Oct 22: there's a mod which makes the summit cars buyable. Community 1, Ubisoft 0.",
      "voted_up": false,
      "votes_helpful": 89
    },
    {
      "review": "Don't buy it. You never know if 10 years from now you'll want to download it to play at your old nostalgic save-file and Ubisoft will have terminated the game for everyone.",
      "voted_up": false,
      "votes_helpful": 140
    },
    {
      "review": "why does playing the offline mode requires battleye anticheat?? it blocks me from playing it on linux and on steam deck",
      "voted_up": false,
      "votes_helpful": 365
    },
    {
      "review": "Ubisoft launcher literally never remembering my password.\n\nnot gonna waste money on your crap in the future, i'm sure pirating is a much nicer user experence.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "I participated in a racing competition that lasted over 30 minutes. At the end of the race, the server kicked me out of the game, and I got nothing.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It's 2025 and we still have to login Ubisoft account just to play this game then why have this game on steam in the first place? Customer service at Ubisoft is practically dead, no one there to help you if you ever forget your account details or worse lose your account. Come on man, y'all can do better than this..",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Can't start the game at all. Unlinking accounts on ubisoft, running in compatibility mode, reinstall, verifying game files all don't work. Hard to believe this is still a problem in 2025",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The Crew 2 tries to be an all-in-one racing experience — cars, boats, planes — but ends up failing at almost everything. The voice acting is bad, customization feels weak, and the UI is clunky. Driving doesn’t feel good either: cornering, turning, and general car handling are terrible, like the vehicles have no weight or traction. Planes and boats somehow manage to feel even worse, with awkward controls and no sense of speed or realism. The game looks decent from far away, but up close the quality sucks, and it all feels shallow.\n\nOverall, The Crew 2 is a huge open world full of things to do — none of which are actually fun.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "-I buy the game\n-I launch the game\n-Black screen and hearing the game in the background\n-No fix\n-ffs thanks ubi ig",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As much as I appreciate Ivory Tower finally including an Offline Mode (or Hybrid Mode) for this game, I absolutely don't enjoy the fact that user-created liveries are not carried over to Offline Mode. And the fact that you can't make liveries yourself for any and all types of vehicles and are restricted to pre-designed liveries by the devs just feels incredibly lazy. Even older racing games allowed you to make your own liveries for cars. This has absolutely no excuse for that option to be completely omitted from a 2018 game.\n\nCongrats to Ivory Tower for completely dropping the ball by removing such a simple yet useful feature older racing games had by not allowing us to create liveries for vehicles of all types, along with not allowing us to download user-created liveries for personal use.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really like the first The Crew (when i could play it!) and Motorfest, so it honestly shocks me that this game is held in such high regard by so many people when it is generally one of the least interesting and blandest racers I have played. To my eye the game looks like ass with performance that is also total ass, inconsistent and unstable. The map is definitely awesome and the highlight of the experience as going on road trips across the whole of the US is a lot of fun, but everything else about the game is just so lackluster and bland. Car handling is decent and the car selection is actually really solid with a grind that isn't super awful either but there are so many other & far superior racers with those same qualities. Newly added offline mode doesn't save the experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ubisoft still intentionally blocks Linux from being able to play even after the so-called \"offline\" update as it still uses battleye anti-cheat and they won't tick on the option to enable linux support like majority of battleye games do.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "any game with mandatory external launcher to play , it is a very let down first impression , especially most trash and straightup BULLSHI8 Ubisoft launcher which randomly crashes and freezes my cursor....graphics are okayish and but controls are weird\nthats the most i can complain for a game i grabbed at 98% off , either way dont waste you money even on sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "redownloaded this excited about the offline feature just to find yet another game has added battle eye i will not allow this backdoor onto my system TY for added another game to my list of (enjoy to play but cannot due to BS AC that is kernel level BS)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game wants a CD key, but Steam won't give it to me. I can only play the trial, which makes it pointless to buy the game from Steam.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[EN]\n\nThis game is ridiculously stupid. How can I not win one of the introductory races even after multiple attempts? I literally race damn near perfectly every time and finish dead last. IN THE FIRST RACE!!! No wonder games like Forza are holding you by the balls. This game is pure ♥♥♥♥♥♥♥ garbage. Do not buy. I'm glad I only paid the discount price.\n\n. . . . . .\n\n[PL]\n\nTa gra jest absurdalnie głupia. Jak mogę nie wygrać żadnego z wyścigów wprowadzających, nawet po wielu próbach? Za każdym razem ścigam się niemal idealnie i kończę na ostatnim miejscu. W PIERWSZYM WYŚCIGU!!! Nic dziwnego, że gry takie jak Forza trzymają was za jaja. Ta gra to po prostu gówno. Nie kupuj. Cieszę się, że zapłaciłem tylko zniżkę.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is just simply not as good as it's predecessor, which UBISOFT has now shut down. Very disappointed, really screwed over Ivory Tower by association.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Here's what's not available in Offline Mode:\n\nCrew Credits purchases (vehicle bundles, vanity items) and the Far & Beyond shop in all 4 Hubs.\nLIVE Summits.\nAll multiplayer content, including PvP, Crews, crew features, news feed, leaderboards, ghosts, and statistics menus. Only your own best times will be recorded per race.\nUGC features, including the Race Creator and Livery Editor. Custom liveries will not transfer to offline saves.\nSome Hobbies and Achievements (Xbox, PlayStation, PC, and Ubisoft Connect) that require online-only actions.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game looks very poor for a 2018 release. Edge flickering, 60 fps lock, and blurry images at 2k monitor is unacceptable for such a modern game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks ass lmao, and ubisoft does as well..",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "a lot of configuration just to get the game running, bad controls that make your experience unbearable, really poor optimization, no tips on the beginning of the game. Overall, this game is NOT worth your money nor time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I thought this was gonna be a good experience for me but it was not, the game felt very grindy to me without any sense of earning something worthy, the car sounds aren't upto the mark, i did not like the handling at all, ikr this isn't a sim but cockpit camera isn't fun at all, they also ruined the night time graphics of this game, and lastly its from UBISOFT but the game does have its good parts ie the map and the vibe of it, the car/bike list, the modifications and that is it for me. Its worth buying only when it comes in sale at 50 rupees ie 98% sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "3/10, feels very cheap like a low budget game when compared to nfs or forza horizon. Don't waste your money there are much better racing simcades than this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Edit: This event took place a year ago\n\nDear Crew 2 you are terrible,\n1. Load into the game\n2. Crash\n3. Load back into the game\n4. 60 fps engine lock (it makes it look like poopoo)\n5. Get my first race\n6. win\n7. Get into another race\n8. Game soft locks\n9. Restart and redo race, it works\n10. I try to beat the race to get top prize\n11. AI keeps destroying my car\n12. The AI somehow beats 14 times because invisible wall\n13. Rage\n14. Smash fist into monitor\n15. Now I need to buy a new monitor \n\nThank you The Crew 2 Love,\nGreen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks because it has just shit wheel controlst if you're palying with a wheel buy the Crew motorfest",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Actually amazing concept for a game, but they completely broke steering wheels with recent updates and they no longer work at all. Do not buy the game if you want to play with a wheel you will be disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's broken. It's constantly lagging. Car won't suddenly move, gets stuck in the road for a second. Can't play it man.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cars dont feel great.\nThere are bikes but they dont feel great.\nThere are planes but they dont feel great.\nThere are boats but they dont feel great.\nThe perfect example of a jack of all trades but master of none..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most 5/10 racing game you can think of.\n- ubisoft made (bad thing if you're a bit clueless)\n- character customization with the worst set of clothes you can imagine and a very limited character selection. so bad i'd probably enjoy the game more if they didn't include it or at least chose to not add some cars in favour of adding more character items. primarily irritating because roughly 1/3 of each clothing category is just hogged up by clothing recolours, with no way of choosing colours for the clothing after you buy it, similar to car interiors or rims.\n- \"hybrid mode\" which is a bit of a shabby attempt at an offline mode. it exists but in of itself it is a 5/10 feature. at least it won't get ripped from you completely like the original crew.\n- good car list, but the car pricing is so off that you don't even want to buy cars that you would in any other racing game; for instance, why is an EVO VI 335k and a GTR Nismo is 334k? a stock S2000 is 323k, and a Miura SV is 302k. how do you, for lack of better wording, fuck up pricing that badly?\n- very different from the first crew. if it was still 2018 and you had only played the first crew, i'd probably suggest you to not play this because it's like stepping into an earlier version of the current festival racing genre. fun at times but a complete drag for grinding money, xp, or figuring out what on earth you want to do next because everything just feels dull after you've gotten all the cars you want and completed the current \"weekly challenge set\" and having friends to play it with you doesn't change that\n- story. oh god. complete drag, you have a few... noticeable character traits if you feel like turning your playthrough into an observation activity in a psychology degree. just trust me, if you do get it, go to audio right after booting up the game and set the voices slider to 0. saves your ears from the regular, corny, irritating cut-in line that is absolutely pointless and the regular thing you just respond \"yes i know that already\" or \"oh just shut up\" to.\n\ntl;dr: 5/10, mid, droning experience that babies you too much and feels a bit like GTAO at points.\nunless you're an IGN reviewer in which case it's either a 0/10 or a 10/10 with how badly it babies you at times and is very over-simplified. not the worst but... i mean it regularly goes on sale for like £2, knock yourself out it's fairly worth it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game just will not work right for me. Mouse doesn't work on the map, seems like every button makes me leave the map which is annoying, and I cannot get anything to work properly while using the wheel. Now I remember why I only played this \"3 hours\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game rarely ever fucking launches and when it does it can be incredibly underwhelming due to the lack of vehicles unless willing to pay for pass after pass. L Ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very weak game. low graphics, playing so bad like nfs 3. is not worth !!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not a bad game, but... Good graphics, but the mechanics leave a lot to be desired and it's very difficult to get into the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the thing is, you cannot play offline, because you have to be connected with ubi-pig.\r\nThey call it offline but it is not. So don't buy the game if offline gaming, specially as ubisof closing servers like they do, you loose everything you put in it. \r\nBest to stay away from game developers and publishers who like to have you online with their servers, one day it will close. Offline so called standalone gaming is real ownership. And online should be an additive, not the root of the software. \r\nSo choose wisely! \r\nIt is just racing around like all race games. no biggy!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Such a \"meh' game. There are a million problems with it. I'll make a list:\r\n\r\n1- It's locked to 60fps. Such a letdown.\r\n2- The graphics are fine for its time, but the anti-aliasing is horrifyingly bad.\r\n3- The physics feel like it's a mobile game or something. The cars are too grippy, the turns feel inconsistent etc. It's a HUGE downgrade coming from either recent NFS games or Forzas.\r\n4- There's too much content but barely any depth to them. No one asked for Planes or Boats. Wish it was all cars.\r\n5- The map is great to explore, but sometimes it's so barren. It's got reduced details compared to TC1.\r\n6- The CONSTANT notifications and stuff on your screen. GOD. It's like you're in a TV advertisement. The UI is so cluttered. I've spent 13hrs on this game and understand absolutely NOTHING about what I should do and where I should go.\r\n7- The races are meh. Very very basic.\r\n8- The playerbase is pretty dead. Have seen like 3 player cars so far. And found no PVP matches.\r\nI bought this for $1 or $2 when it was on like 99% sale. It's worth just that much. Not more.\r\n\r\nI really hope Motorfest is better because I'm planning on getting it during the Winter sale. Hope it doesn't disappoint.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "3/10\r\nDon’t waste your time and money on this game.\r\n\r\n-The cars suffer from stiff handling and feel heavy and unresponsive compared to other games.\r\n-The graphics are mediocre at best and dated at worst.\r\n-The vehicles feel extremely slow due to the lack of visual feedback for speed (ignoring the \r\n  speedometer). To make things worse, the developers removed the ability to turn off the awful motion \r\n  blur and TAA (for players like me, for example).\r\n-Activities feel bland and unwarranted at times—like driving a demolition derby car across the country \r\n  with no real stakes.\r\n-You’re forced to grind for hours to get randomly generated loot to upgrade your car, as if this were an \r\n  MMORPG or a Borderlands title instead of an arcade racing game.\r\n-There’s no incentive to get better or cooler cars since performance is determined by loot with numbers \r\n  on it.\r\n-Even the high-end cars suffer from poor control and a lack of speed, feeling like turbocharged bricks of \r\n  misplaced steel and aluminum.\r\n-The offline mode still requires anti-cheat and for me refused to work when my internet was down (great \r\n  one Ubisoft :D)\r\n-Final point: the cars have a terrible lack of customization and feel utterly bland.\r\n\r\nIt’s better to buy a Need for Speed game or find another arcade racing sim (but not Forza Horizon, especially Forza Horizon 5).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not offline. Hybrid requires ubisoft to connect to the Internet even after you have created a local save. Not worth it when you want to play this on a handheld PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't even bother to buy rather than standard package because they don't refund money after buying Golden package or extra cars. They don't provide the cars packages in game. so useless to pay extra money to them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Revoked game ownership after 46hours, game supposeably linked to another email address. Same thing happened with Wildlands, The Division 2 Brooklyn DLC. This company is so corrupt!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking into buying the game to play with a steering wheel dont do it. It doesnt work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kept asking for cd key when launching support cant even help me did everything they said. Ubisoft trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my outlook email was stolen from me (microsoft refused to help me get it back) witch was the email on my ubisoft account i have since made a new ubisoft account but i am forced to buy another copy of this game because ubisoft said they cant change my email for \"security reasons\" (even tho i provided every single detail of the account) and i cant launch this game thru steam because of a \"licence ownership error\" i contacted ubisoft support to get this fix but they said they couldnt do anything (go figure) so now im out 30 bucks because both microsoft an ubisoft refused to do anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Game feels dirty. It is packed with Lootboxes and other special currencies and bs. Even the progressing and unlocking of Events feels bad as they kinda Pop Up like some Slotmachine win or some bs. Also the required ubi launcher always sucks. Overall even 5 dollars for deluxe version feels like a scam. Sad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feels like a 15 year old mobile game. Absolute garbage. \r\n And the FPS is capped at 60, which is laughable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game keeps crashing or won't even open in most cases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even though they have allowed an offline mode, just sail the high seas for the first one, it's infinitely better than this generic festival racer slop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unless you like holding the right trigger or vehicles that feel like wet bar soap, there are a lot of other things you can do with your time than grind away in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Offline mode was added but still cannot start the game without Battleye???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can the anti-cheat can be disabled in single player so I can play the game *I paid for* again? Thanks :)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "my game no longer works....why can't I play my game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft, being Ubisoft, completely half-assed the offline mode everybody was asking for. Amazing.\nHere's hoping the community manages to bring the livery editor to offline mode at some point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mimo że grę kupiłem za 4 zł dalej żałuję pieniędzy nie wiem co tu robić po prostu jeździłem po mapie nie widzę żadnych misji ani nic a w dodatku domyślnie ustawiony język rosyjski nie polecam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game not working becuase of the app Ubisoft+",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}