{
  "positive": [
    {
      "review": "Truly, I cannot recommend this game enough to anyone who is even remotely interested in this sort of genre. Go in blind and DO NOT LOOK UP ANYTHING; it is a treasure of a first play-through and I would sell my soul to be able to do it again.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Very fun and engaging mystery game. The story you discover is interesting and surprising, the mechanism is simple but this game is about the mystery not the mechanics really. It is atmospheric and I found myself thinking about the mystery whenever I wasn't playing too. \r\n\r\nHOWEVER - the graphics, while interesting, make it very difficult to figure out what's happening in many of the deaths. For example, I had trouble knowing that some people had exploded or were on fire since everything is black and white. So that was frustrating. \r\n\r\nI would 100% recommend, however. Fun game and I've never played anything else like it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "easily one of the best games I have ever played. Exceptionally well crafted in every aspect, whilst being extremely  fun, engaging and rewarding. One of the best soundtracks I have ever heard as well!\nIt's the type of game which you can only really play properly once, as once you know all the answers it obviously takes away the mystery and challenge. But its been at least 6 years since my last playthrough and I'm getting close to having forgotten most of the solutions, so it can for sure be played again, it just cant match that first playthrough, which is totally worth it as it is such a stellar experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Interesting lore with great musics, one of best puzzle solving + detective game I would say. Highly recommended :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i yearn for puzzle/exploration games, and this game filled that need. you just have to figure out how each person died, a task that sounds more simple than it is. it's challenging, but not impossible, and you feel genuinely proud when you figure some things out. the artstyle reminds me of puzzle games i played as a kid, like someone plucked the pixels from my nintendo ds and sculpted them around 3d graphics. modern and retro at the same time. the story will stick with me too. if you like figuring out a mystery without hand-holding, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Incredible story, with a stunning atmosphere, deep narrative and smart DA approach that perfectly support the gameplay. All you want is discover more, find the right clues, assemble them and progress through the story and each characters to unveil the most deepest secrets of the ship. Enjoy it, what a chance to play it for the first time!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "An excellent detective story from excellent developers! This game is absolutely worth every penny! I recommend it if you're good at understanding cause and effect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "amazing deduction game, incredibly unique and executed perfectly. i loved everything about it, from the artstyle and music to the gameplay. it doesn't hold your hand and solve the cases for you, rather confirmations are done in threes so you're often unsure whether you guessed correctly and have to keep moving with uncertainty, which i very much enjoyed.\n\nit's quite pedantic or better said scrupulous, attention to detail is needed, which i really liked, but that's probably not everyone's cup of tea.\n\nout of about 60 crew, i had to fully just guess about 5-7 people without any evidence, from which i'm certain only 3 were actually \"undeductable\" and just fully guesses - [spoiler] the 3 chinese people of whom 2 died at once and the third one is a random whose death/escape is unrecorded [/spoiler], which i'd say is a good amount considering how many more i thought i'd have to fully guess at the end earlier in my playthrough.\n\nover all one of the most interesting games i've ever played especially considering it's almost entirely made by ONE person, so dare i say it's a masterpiece.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I wont lie and just say, that this is one of the most unique and atmospheric game I have ever played. This game has left a hole in me cause all I want is more.\r\n\r\nThe concept is simple but it manages to be challenging and complex at the same time. \r\n\r\nThe soundtrack is absolutely beautiful and manages to capture and enhance the entire experience as well as being just really really unique (Seriously, get the Soundtrack on vinyl its such a vibe). The stylised, pixelated black and white look is weirdly pretty and also makes you look twice at everything which is really important for this game in some instances.\r\n\r\nWhile the game itself is built upon not knowing anything about the crew it manages to convey the characters in a realistic manner and somehow makes you feel for their fate.\r\n\r\nI wish there was a game in the same style that had multiple Cases, because I'd literally pay any amount of money for more like this. \r\n\r\nJust play it. You wont regret it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "An amazing game that is immensely satisfying to complete. The art style is immediately striking and wows the whole way through. Despite being just black and white, it works really well in every scene and gives you enough to help solve mysteries. Needing to use almost every little detail from what you see makes you appreciate how well crafted the story is and makes this one of the most fulfilling games I've played. On top of this, the story becomes more interesting and more addicting with every mystery that you solve.\n\nSolving the mysteries is what makes the experience, so I HEAVILY suggest going in completely blind.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fantastic game of deduction where you investigate the fates of a ship with sixty people. The whole thing feels genuinely epic in his ability to convey scenes, especially with the music. The several \"a-ha\" moments I had alone, and the game providing me constant feedback on my deductions was excellent! There were several moments that were genuinely gruesome and horrifying, which felt surprising for a game where you only investigate scenes in a frozen state of time.\r\n\r\nThere are minor hang-ups I have with the game, like the time-waster with [spoiler]the sprites moving from one body to the next[/spoiler], or that the scenes themselves start to lose their panache when you have to revisit them multiple times. These are minor though, and the game itself isn't too long to have to slog through the annoying bits.\r\n\r\nFor context, I played this partially on my Steam Deck offline and on my PC. It was great on both systems, and in reality probably took me about 6hr. This is a game you play ONLY once, but it's a masterpiece in its genre. It really lives up to be another standout title from the developer who made Papers Please. Even having played it for the first time since its release seven years ago, this felt IMMENSELY unique and enjoyable.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "difficult but not impossible. perfect investigation game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A staggering achievement in both deduction puzzle gameplay and non-linear storytelling.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "*Spoiler free review*\r\n\r\nJust finished. Short but sweet is all I can say. It really is a game you can only play once in terms of getting the full impact, but boy what a impact it has. The second you look up from what appears to be a simple accident, or look through a slot in the wall, you realise there is a hell of a story going on. I played it in less than 9 hours to complete the game (savour them in a few sessions rather than speedrunning it), but boy, the retro visuals, the atmosphere built up from a desolate, creaking ship into a walking crime scene filled with intermingling sub plots ,the music that pounds while you put clues together from disparate scenes, it all adds to a simple, but very effective game. That scene with the 'soldiers of the sea' track blaring, thinking this is a simple death, before turning to look through the slot at the chaotic scene in full swing yonder will stay with me for a while. What a memorable and great scene.\r\n\r\nMy only complaint is that towards the end, some of the deductions were more guesswork than based on clues, however this might not be the fault of the game and more of me not picking up on some of the more subtle clues. \r\n\r\nOverall, a fantastic game that I have no regrets playing. I highly advise you play it at least once. Even if the mechanics seem alien or strange at first, they'll become second nature in no time, and the journey is thoroughly worth the price of admission.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent (if not the best) detective system. Makes you feel like a genius once you puzzle things out.\r\n\r\nVery light on settings, and a truly awful final achievement are the only marks against it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really well made, can see why it's so beloved now.\r\n\r\nAn excellent deduction game.\r\n\r\nWas some parts i didn't have the perception to notice so had to bruteforce, won't say what as that would spoil it for others.\r\nJust a tip, if you think something is right then leave it be for later instead of assigning as unknown again.\r\nAnd the picture with the whole crew can be really useful to find out what group someone is in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1. The aesthetics on this game slaps. And only adds to the creepy parts.\n2. Very unique game play. Just play it, don't ruin your discovery of the game play via too descriptive reviews.\n3. If you like logic problems and mysteries and horror themes, play this game.\n4. It's a little short for the money, but honestly, the story and the gameplay and the visuals are worth it. I think it was just a guy who made it. Support that guy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good puzzle game, has an original feel to it thanks to the gameplay and style.\nIt's absolutely possible to complete in a reasonable time, even though some of the stuff can be rather subtle. Good combination of having to use various audio/visual clues and logic to progress through the game. My only gripe is that it's a bit clunky at times, for example navigating the book feels a bit barebones, at some point the only engagement left was actually solving the fates, but it still took more than I wished to navigate around the notes and the boat itself to revisit all the information I already had. The forced wait times present throughout the entire story in one way or another can also be a tad annoying after about halfway through I'd say. Definitely worth your time even at full price; beware if you think you might get frustrated at the inevitable walls you'll face when you think you've exhausted all there is to see and you will inevitably have to revisit stuff here and there looking for more clues, unless you're particularly sharp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Return of the Obra Dinn is a must play puzzle detective game 10/10. For the achievement hunter's you would most likely have to replay the game again and spend 2 hours rewatching cutscenes so it can be tedious. You could do that or download a save file that let's you get the abandon ship and the captain did it achievement in a few minutes. Overall the game is worth playing, so go play what are you doing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The single best deduction-based mystery game I've played in a very, very long time, maybe ever. Never felt stupid or like the game was talking down to me, and I was able to solve the entire thing without a guide or walkthrough. The only things I ever looked up were the languages of phrases I couldn't identify and basic geography that I was unfamiliar with. The game does a wonderful job of basing all the important information in real fact, meaning that I was able to deduce many things based on real sources. It was also insanely approachable. When told that I would need to positively ID 60 different people and also have to accurately deduce what happened to each of them, I was worried about being very overwhelmed. That never happened, though. Instead I was led on a thoroughly engaging adventure where my discoveries were made at my own pace with the games FULL support. A masterclass in mystery games if I've ever seen one, and I cannot recommend enough to any fans of the mystery genera as a whole.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A deadly mixture of hard detective work and the urge any completionist feels when presented with a checklist. Add great visual design and music, and you'll land at perhaps the most captivating and tragic story about a shipwreck you have ever experienced. Unless you are into Titanic, but in that case this game probably isn't your cup of American tea anyways. You get the drift.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely the best puzzle/mystery game I've ever played, can't recommend enough to go in blind and to try and solve the mystery of the Obra Dinn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wonderful game, if maybe a little short. the atmosphere and art style are incredible! highly recommend to anyone looking for a good mystery game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Отличная головоломка чтобы скрасить пару дождливых вечеров, особенно если вам нравятся детективные истории и корабли. Теперь я знаю, что такое такелаж и чем боцман отличается от корабельного стюарда.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic. Played for the first time this year. There really isn't anything like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A compelling mystery.  Interesting Inception like gameplay.  Unique old school C64 like graphics.  I tried it first on my friend's account and then kept thinking about it, so finally bought it - it's really quite unique.  From a narrative standpoint, it's got to have been a challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very novel and well done detective puzzler type game. Visually unique. Highly recommend if you are into this genre. The way the story expands and holes are filled as you open more areas is just perfectly well done. When you work out the connections between people and history through pure deduction and/or context it is very satisfying. The way the story also delves into a sort of madness also makes it hard to predict where it's going, which is pretty nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Return of the Obra Dinn is a fantastic puzzle/mystery game. The only scene ill spoil is the first one because it provides such a great opening to the story. The player walks onto the boat, examines a dead body with a magic pocket watch and gets treated to an audio only reenactment of the scene before appearing in the frozen scene at the instant of the characters death. The first scene is particularly striking because it opens with the player staring down the barrel of the gun that was shot. And then the game gets better from there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story and deduction logic. After seeing everything memory I couldn't believe that I'm supposed to figure out all the fates from that, but it turned out to not only be possible, but also really enjoyable. Absolutely loved all the small details hidden everywhere. My only complaint is that getting some achievements can be quite tedious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would never have never considered what it was like to be an 1800s issurance investigator if it wasn't for this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere and story are amazing. It's an unforgettable masterpiece in this domain.\n\nUnfortunately, the gameplay is not perfect. The first part was very fun but after correctly identifying a couple of people some patterns started to emerge which allowed me to make some very good guesses, without any other information from the game. \nThe anti-bruteforce system works well if you have to try just a few possibilities but it the case described above it completely fails since there are very few options to try. I don't know if this was intended but it made the gameplay shallow in the second half of the game.\n\nOverall, I highly recommend Return of the Obra Dinn mostly as a story/atmospheric game and some cool detective puzzles at the start.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Come for the immersive storytelling and fun puzzles, stay for the monkey and the mermaids with 6 nips.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has to be my favorite game ever! I usually have to wait about a year to play, so that I forget everything. I really wish there was another game just like it. ITS JUST THAT GOOD!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Entertaining and totally worth the time. If you get a chance to pick it up on sale, even better. Don't miss out if you're thinking about it; if you're already here checking reviews you're exactly the type to enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is such a great concept, but it could've been executed so much better.  It's basically a giant game of Clue on a ship from the 1800's. You can view scenes from the timeline and have to piece together who all 60 passengers were and how they died.  You have a convenient book to track details as you figure them out, and you often have to cross-reference a couple scenes to figure out someone's fate. This sounds amazing to me, and sometimes it was!  It was a good difficulty and was really satisfying to slowly piece things together. \r\n\r\nUnfortunately, I left feeling like it could've been so much more.  The storyline and characters are very generic, and almost every person died one of three ways -- shot, stabbed, or killed by a beast. There are plenty of nice subtle clues that you have to find, but almost every one is just noticing something in one scene that reveals an answer.  With ~50 scenes in the timeline, they could've done so much more to create a unique story, develop interesting characters, and create clues that require following someone's actions through a bunch of scenes.\r\n\r\nIn terms of gameplay, every time you want to watch a specific scene you have to find the right body on a map and walk over to it. This gets very tedious and annoying near the end of the game when you just want to search through the timeline for clues.  The ending is underwhelming and feels kind of pointless.  Oh, and getting the final achievement would've been the most boring, tedious, and pointless activity ever.\r\n\r\nAll in all, I found it to be an addicting and fairly fun 13 hr experience, but it didn't live up to my expectations. 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game.  The graphics show a lot more detail than I would have expected, and I rarely felt like I couldn't make a detail out due to them.  The theme is original, and the ambience is spooky without being overly creepy.  The music plays a great part in this, as well as the UI stingers that are present throughout.\r\n\r\nThe fates are IMMENSELY satisfying to solve.  I never felt stuck like I have in many puzzle games; I could always track a different person through the memories and discover details that would let me chip away at the things I was missing.  I definitely figured that I would not be fully solving this game due to how many characters there are, but the excellent pacing kept me moving steadily through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a bloody difficult logic puzzle game with impeccable production value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved this game. The visual style of this game is impeccable - it felt very Early Computer Aesthetics in a delightfully nostalgic way, without making the gameplay harder. The mystery you unravel is incredible, and it's so much fun to have to travel through it in often non-linear pieces. The only bad thing I can think to say about this game is that I am absolutely devastated it's finished because I want to keep playing games like this forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WOW! What a phenomenal game! Do not look anything up, as the mystery is an absolute joy to solve. Amazing music and such a stellar and unique presentation as well, feels like you are looking at a memory. PLAY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Return of the Obra Dinn et fa sentir com l’assegurador més intens de la història… i això és molt més divertit del que sembla. Arribes a un vaixell fantasma on tothom és mort i, a poc a poc, vas reconstruint què ha passat només amb pistes visuals, fragments de diàlegs i molta deducció. Cada escena congelada en el temps és un petit trencaclosques, i quan finalment encaixes qui és qui i com ha mort, la sensació de “ho he resolt jo, no el joc per mi” és brutal. L’estètica en blanc i negre li dóna una personalitat única, com si estiguessis revisant un cas antic en microfilm. Si t’agrada prendre notes, traçar línies mentals entre pistes i sentir-te un detectiu de debò sense que el joc et tracti com si fossis poca cosa, aquest vaixell val molt la pena embarcar-s’hi.\r\n\r\nReturn of the Obra Dinn makes you feel like the most intense insurance inspector in history… and that’s way more fun than it sounds. You board a ghost ship where everyone is dead and slowly piece together what happened using only visual clues, snippets of dialogue, and a lot of deduction. Every frozen moment in time is its own little puzzle, and when you finally nail who is who and how they died, that “I figured this out myself, not the game for me” feeling is incredible. The stark black-and-white style gives it a unique personality, like digging through an old case file on microfilm. If you enjoy taking notes, connecting dots in your head, and feeling like a real detective in a game that actually trusts your brain, this is one voyage absolutely worth taking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, really unique art style. I like that you can change the main colour scheme as well.\nI love games that get you fully invested in the storyline and you figure out what happened as it goes. \nAll of the different things you have to pay attention to in order to figure out everyone's identity is so interesting, and its really satisfying to finally tick off some of the more difficult ones!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible storytelling, sound design and visual style.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lives up to its reputation :)\r\nA very cool and intriguing story. You have to pay attention to every detail and you have to have more deduction skills than Sherlock Holmes. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy heck this game was amazing!\r\n\r\nReturn of the Obra Dinn is a first person detective game, set in the early 19th century. The lost ship Obra Dinn has mysteriously returned to England with no one aboard, and you play an insurance investigator for the East India Company whose task is to identify what happened to all 60 souls that were on board when the ship first set sail.\r\n\r\nThis is accomplished by means of the Memento Mortem, a pocket watch that allows you to travel back and hear the last moments of a corpse's life, and see the very moment of their passing. Sometimes you have to daisy chain using the Memento Mortem to investigate corpses that you can only find in the memory of another corpse.\r\n\r\nThe genius of this game is how well the puzzles of who everyone was and what happened to them is laid out. There is a logical way to work out who everyone is, and some of the solutions are incredibly clever like [spoiler]wedding rings[/spoiler] and [spoiler]shoes[/spoiler], but the game is set up in such a way that you [i]can[/i] brute force solutions, yet as the verification only works on three correct people, you can't just brute force everything.\r\n\r\nThe story itself is decent though probably the weakest part of the game? It's functional, and the slow reveal of what's actually going on is paced out well at first, but once you've seen all of the memories except for Chapter 8's, the remaining story is locked behind solving all the problems and so it will likely be several hours with no story progression.\r\n\r\nAudio is excellent though maybe too absent at times? The voice acting may take a little bit to get used to, but actually works really well, and the general sound effects are on point. The music is good too, but can be overpowering at times compared to voice lines, but usually only if you skipped the voice only parts at the beginning of each memory.\r\n\r\nIt's worth noting that, while I could describe this as being a horror game, both the method of presentation and the low-poly models mean that the game is never too gruesome, and is never actually scary. Inducing fear in the player was never the point of this game, so please don't let that put you off playing this amazing game!\r\n\r\nI honestly can't recommend Return of the Obra Dinn enough, a genuinely stand out game, not only in terms of quality, but as something truly original. It's kind of a shame that this game didn't spawn a bunch of Obra-likes, but I think that's down to how hard it is to balance the puzzles the way Return so successfully has.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The biggest thing missing from the game is a way to erase your own memory, so you can experience it all over again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, very well thought out story and puzzles, and a cool retro artstyle.\r\nall around an amazing blind playthrough experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful story, and challenging puzzle!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best puzzle game I've ever played. Really cool mechanics. This game really makes you use your brain and sometimes you might have to resort to informed guesses, but that is part of the fun. Wish I could play it the first time again. Kinda wish there was more backstory on the mysteries though. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The aesthetics were on point (visuals, sound design, music etc), the game looks really cool and the sound effects and music that play are great.\r\nFun and interesting puzzle solving, I would say this game is very fun to play with friends because it will help piece together the story when more people are there to notice and remember things that others may have missed.\r\nHighly recommend it, we beat it over the course of a few play sessions and it was really fun to solve the mysteries using the different clues the game provided.\r\n\r\nThe one thing that I feel could have been improved is that I managed to complete the whole crew list with my friends, but we were still left somewhat confused about the chain of events and the explanation of what happened on the ship. Maybe it could have provided some kind of summary or explanation at the end of the game, or maybe they left it ambiguous on purpose.\r\n\r\nThe below are some negatives but they're really not a big deal, but maybe reading this will help people understand the game mechanics better:\r\n- Some of the gameplay mechanics are a bit awkward or confusing. Sometimes you need to activate a dead body to access the memories, other times you have to activate things within memories, sometimes new areas get unlocked and it's not always obvious.\r\n- After looking at a memory there's a timer that you need to wait for it to run out before it will show you the face of the person who died and let you try to guess the cause of death, which is a bit awkward.\r\n- It's not always clear what the difference is between 'spiked' and 'speared' so we had to swap those terms sometimes until it worked.\r\n- Sometimes it wasn't super clear who was who (for example part of the crew are seamen and we weren't sure which was which for some of them) and we ended up just guessing by swapping names around until it worked. But maybe there were hints that we missed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Marvelous puzzle game!\n\nIf you have the problem of V-Sync that can't be activated inside the game I recommend you to check your GPU provider software. It should have something to activate it on the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great puzzle game ! Such an adventure to discover step by step the crew's story lines. Great moment !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every detail you need to solve the cases is taken into account. Don't spoil yourself and let the music carry you away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's wild how so many details exist that allow you to piece together the story of the Obra Dinn. What a great deduction game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another masterpiece from Lucas Pope.\n\nWhat an amazing puzzle/deduction game. The puzzle, art,  game design, theme, sound, and music are absolutely chef kiss and well executed. You need to have good deduction, observation skills, and a little bit languages knowledge to solve and achieving 100% achievements without walk-through. I played the game twice to achieve that 100%.\n\nReally enjoy every minutes of it! \nDefinitely this is one of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Love it. It feels so new. It has the right amount of frustrating moments but not too much I give up entirely. I wish there were more similar games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd just been saying how I wished there were more detective/investigative games out there (criminally underrepresented genre in gaming), and was wondering if there were any cool indie projects I haven't heard of because they were very niche, when this game (and a couple of others) came into my view. \r\nThis is the very first from the short list that I've downloaded, and I don't regret it.\r\n\r\nThe game is incredibly charming, well-designed, and immersive as hell. It all follows a very sound logic despite the fact that *spoiler* not all that happens in the game is realistic *spoiler*. No dumb red herrings, no pixel hunting. All the information you need is right there, you just need to actually look.  Very few things are readily obvious, but none are out of the scope of information the game provides. This is something many puzzle and puzzle-adjacent games fail to accomplish, but this one does, and it's incredibly satisfying. It only took me 16 hours to beat it, but I enjoyed every minute of it. By the end of it, even though the time seemed short, I was fully immersed in the lives and destinies of the crew. That is also an incredible feat for a game with very little dialogue, and almost no animation. The comic-book style may deceive you into thinking that it's going to be a flat, two-dimensional experience, but no, it's incredible how much life there's in this simple deduction game.\r\n\r\nAll in all, I really liked it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game just makes me feel so good. The music is brilliant , the story is really nice and the feeling when you were correct about some fates is extremely satisfying. Altogether makes this game an awesome experience.\nThank you Obra Dinn!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A well-crafted and interesting story from start to finish. The mystery, detective, and puzzle genres are more than respected. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the few truly perfect games. There is nothing of note that would make this better than it already is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly incredible puzzle/mystery game. Outstanding setting, music, and characterisation, all wrapped in a really unique puzzle mechanic. Tests your brain, but doesn't try your patience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love playing games that use deductive reasoning. this, Her Story, 12 minutes, Blue Prince. all of them incredible in their own way. this one especially stands out as a game that doesn't hold your hand, and if you're clever enough, helps solve the mystery of the Obra Dinn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had been intrigued by this game for several years before trying it. I kept it on my wishlist after reading some stellar reviews when it released, but did not buy it until recently. I loved it. \n\nThematically, it captures the feel of some of my favorite books (Melville's [u]Typee[/u] and [u]Moby Dick[/u], Poe's [u]Narrative of Arthur Gordon Pym[/u], Sir Arthur Conan Doyle's [u]The Captain of the Pole-Star[/u]) juxtaposed with an art style reminiscent of some floppy disk classics of the early 1990s.\n\nClues are revealed slowly and rarely in sequence, allowing the game to be experienced and pondered slowly. The writing is tasteful and the grim narrative is framed in a way that the player can approach it as an objective third party playing detective, uncovering information and making connections organically. The limited setting had me feeling like I had an intimate knowledge of the ship's layout by the end of the game, as though I personally had spent time aboard.\n\nIf you like a good puzzler that you can savor, this is one of the best I've played. There are no platforming or combat sequences, so there is minimal mechanical skill required to play -- great for gamers who just want to use their noggin. I did not feel like I got stuck on any of the puzzles until I was just about ready to turn in the book; luckily I got a hint that didn't completely spoil the reveal ([spoiler]it was something I had already read at the very start and parsed through without thinking critically[/spoiler]).\n\nIf my review lacks criticism, it is because I don't really have anything negative to say. This is not a game for everyone. As stated, it lacks any test for those who prefer a challenge of skill or ability. This is a puzzler, a detective story, a macabre tale of murder and tragedy at sea [spoiler] with a mysterious curse and terrible beasts[/spoiler]. If that's not your bag, then you're probably not even reading this review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can drag on and feel a little repetitive near the end, especially if you're going for 100%, but overall an incredibly well-executed and unique game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think it's safe to say that [b]The return of the Obra Dinn[/b] is simply a masterpiece.\r\n\r\nIn this game set in the early 19th century an abandoned merchant ship has mysteriously returned after being considered lost. You are tasked to establish the fates of all people originally on board, using a book with sparse but crucial information, and a magical pocketwatch that allows you to scry under certain conditions, seeing a frozen frame of a being's last moment.\r\n\r\nA wide selection of deduction methods needs to be called upon to reach a satisfying end, all while being submerged by the unique monochrome graphics and truly brilliant sound design. Having a strong stomach may be a plus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a fantastic puzzle game. I found the graphics a little hard to parse detail out of at times, and a few of the repetitive animation/musical combinations got repetitive, but in general I really enjoyed every moment of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i wish i could forget this to experience it fully again. but i never could forget this game its gonna stay with me for a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cool innovative mystery/puzzle game. The storyline of the game is similar to Pulp Fiction or the Odyssey, where the chapters of the story are told out of order and you can piece everything together by the end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very stylistic, fantastic sound design. I wish there was a way to jump back into the scenes using the notebook instead of having to walk to each place on the ship but that's only a minor point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a very interesting story game. I loved the graphics used and how you can switch between different styles of computer interface in the menu! Very cool! When starting, it's a little hard to understand what's happening, but it picks up and becomes fun when the main objective/gameplay loop introduces itself. \r\n\r\nThe story is very tragic, but even on my first playthrough, I thought that the smoke trail or whatever that gas cloud was that led you around the ship was very annoying. I think it kind of ruined the immersion for me. \r\n\r\nOverall, it was a fun experience. I would definitely play another game exactly like this one. I would also love to see this style of design and gameplay used for nonfiction stories in history as well. I think I would bulk up my steam library on those alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun mystery game, loved this. Need more games with amazing music and storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun puzzle-solving game where your deductive skills are key to completion. I would definitely buy another game in this style (even if it was another ship-themed one).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great deduction game. Graphics are quite nice but can sometimes lack some clarity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hope this letter finds you well. I write to report that I have completed 100% of the game.\r\n\r\nI have a very important message to deliver for all the newcomers to the Obra Dinn:\r\nAt any price, do not bother looking at the reviews, go purchase the thing! This game was one of the most fantastic experiences in the puzzle genre I've had and I will strongly recommend that you, without further await, get this masterpiece and experience all of it!\r\n\r\nI'll be turning in now. Tea's in the kitchen if you need more.\r\n\r\nBest regards!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a giant brain teaser and you are the detective attempting to make sense of what you see and hear. BUT it is gory in visuals and sounds, though the graphics are quite basic. Everything is in black and white (some gray) and the most detail is people's faces, though those are sometimes difficult to distinguish. But things become clearer the more you investigate. All said, I enjoyed it immensely!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy shit what an exploration of mind and problem solving. Amazing amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the best puzzle detective game I have ever played. The musics are so amazing I can still hear it in my head. \r\n\r\nMy favourite part about this game has to be the inclusion of different languages and accents that adds to the writing of the characters, plus help aid you with solving the fates of the people aboard the Obra Dinn. I enjoyed taking my time to solve everyone's fates because I cared THAT MUCH about getting everyone's fates be known.\r\n\r\nIt's a one of a kind game and you should DEFINITELY play it blind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, original experience, very satisfying to finish (second time in my case, purchased for the switch the first go around).\n\nMy one gripe is the [spoiler] Zungi Sathi [/spoiler] fate is some BS (it feels cheap imo in hindsight)\n\nSingle gripe aside, Pope is a one of a kind dev that puts out top tier titles, check this out. (and Papers Please too)\n\nIf Pope puts anything else out on PC (I hope he does) Imma buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an amazing game of logic and deduction. Fun story, fun revelations, GREAT music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has been sitting in my library since 2018 and I only spent about half an hour with it. I definitely enjoyed my time with it after coming back. It's a very unique sort of story telling, piecing together bits of the past of a cursed sea voyage. However I can't help but wish that some of the detective work was based less on guessing and more about evidence. But perhaps I'm just a brainlet at the end of the day... I had to use a \"nudge\" guide for about 1/3 of my entries and quite a few of those seems like real stretches to connect the dots.\r\nBut, it's still quite good. Visually extremely interesting. A sad tale of a doomed ship. Definitely worth checking out now even almost 10 years after the initial hype.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely perfect in every possible way except that you can't play it for the first time again.\n1000/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not much to say that many others haven't said before. A resounding success. It's amazing how much the game does with such simple presentation. The UI, graphics, and sound design come together incredibly well and create some surprisingly intense scenes. The identification of the crew is constantly satisfying and allows you to feel like a smartie. Finally, the game's structure means you never need feel stuck since you have many different fates you can look into, allowing you to make the trickier ones simpler by reducing the options available due to solving other cases.\n\nThe graphical style can sometimes make identifying cause a mite tricky, but it's a minor point.\n\nI don't understand the purpose of Chapter 8. It's locked until the end of the game and you're waiting for the big reveal, but it just shows you things you already knew from dialogue, or could infer from it. Just a really odd coda in the game.\n\nOverall though this game is a hit and you can why it inspired a subgenre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got frustrated at points, but the presentation of the game is magnificent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RotOB takes a very common overused story plot and makes it brand new again through a very unique AD and narration. The gameplay is not immediately intuitive but very entertaining, the puzzles or not too easy and depending on your observation and deduction skills you may expect to spend quite some time on it. Overhaul a very beautiful game that really worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is engineered like a rocket. It sells the detective fantasy so seamlessly through how it makes deduction almost entirely emergent. Obra Dinn made me realise how much other detective sims hold your hand for you to get that \"ah ha!\" eureka feeling. In this game, you truly have to work for even the easiest clues, and it feels SO GOOD once you solve secrets.\n\nThe UX is just bursting at the seams with flavour. The super old-school 80s era artstyle is so unique and interesting. The way the text syncs with music beats feels so tactile, further adding to that aforementioned SO GOOD feeling in a subtle way. \n\nMy only real gripe is that the atmosphere created by the artstyle and the setting doesn't quite match up with the actual experience. When you first enter this game, it feels like a horror. It's not, and it's not trying to be. Despite this, the entire time I felt like a jumpscare was around every corner. Some would call that a good thing but to me it slightly diminished what was otherwise a fantastic experience. It doesn't feel intentional, which is out of character for a game where it feels like every millimeter was thought out meticulously.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid puzzle game, paced well and not too long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For years, I had convinced myself that this game was not for me. Until I finally stopped dismissing it because I thought it looked weird or something stupid like that and instead gave it a fair chance. And I can say for certain that I am glad I did! The visuals are very unique, yes, but they're honestly very impressive and once you get used to them, you can't get enough of them. Apart from that, this is a fantastic detective game with a lot of charm and care put into it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually chose to refund it because it's not my type of game. But I just have to recommend it because the soundtrack is so good. Big, BIG! respect to Lucas Pope who is also the composer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most well-integrated and engrossing narratives I've ever had the pleasure of becoming a part of. True art. The story of the Obra Dinn will stay with me forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I saw this on some video a while back and just got to playing. This game is a LOT of fun, but I'm a big fan of logic puzzles and the like. Great job! 60/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game. Takes a little getting used to and a little hard to figure out at first, but genuinely gets better as it goes. As others have said, I wish I could forget all about it so I could play it again. If they make a sequel, I am 100% buying it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game, love the story.\r\nGlory to the East India Company and The Crown of England.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was excellent. I am an expert noticer so I had a better time than most figuring out who dun it on most of the accounts. I wish there was more this game was really special.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know if there will be a sequel to this, but I honestly believe this is one of the greatest crafted pieces of art ever made. Front to back.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A marvellous piece of artwork. The story is a 10/10. The music is a 10/10. The voice acting is a 10/10. The artstyle is a 10/10. Henry Brennan is a 10/10.\r\n\r\nTruly a masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Visually striking, and really love the music.\nI grew an initial interest in the storyline but the best part for me was the developing and changing opinions I had towards the characters.\nGameplay wise, it is wholly satisfying to solve each outcome, and I love that it's fairly straight forward deduction (at least to me).\nUnfortunately, I need a sequel desperately. :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an absolute glittering accursed treasure. I loved it. After the initial run-through of the memories I didn't have a lot to go on and felt like a thicko at the foot of an immense learning curve, but it was actually fine. You feel stupid and then you get the knack.\r\n\r\nHaving to traipse around the boat and wade through multiple levels of memory to replay the scene I wanted was tiresome at first, and I can see how it would put people off, but it's for the best in the end because it forces you to put certain things in chronological sequence and look for the right leads. I did admittedly brute-force the final few characters' fates according to their accents and such but that felt like as legitimate gameplay as anything else, albeit not the most legitimate detective work.\r\n\r\nStory, graphics and music commingled perfectly towards this game's heavy, briny atmosphere, and there were a few particularly dramatic tableaux that were thrilling to walk around. It's so cool to have played both this and The Roottrees are Dead and seen such wide variation on essentially the same genre. I want more. More!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "That was enjoyable.\n\nYou're put on a ship, given a tool that allows you to see someone's final moments.\n\nYour job is to figure out who they are and why they died.\n\nThis is a puzzle game, if you don't like puzzles, you will hate this game. If you want a game with replay-ability, this also isn't the game for you.\n\nTowards the end of the game, it gets easier and easier to brute-force answers. I'd suggest against this. I'm not saying that you should wait until you're certain of your guess, just that you shouldn't sit there and change your answer several times. Instead, go look for further clues, and once you find another tidbit, make another guess.\n\nAnyways, great game, super suggest it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "简单的故事，也可以塑造出丰富的角色，设计成纯粹的推理。只需要打乱叙事，把线索缩减到近乎极致，加上颇具特色的画面，以及充满感染力的配乐。怪诞、狡诈、背叛、暴怒、神秘、意外、勇敢、责任、团结、悲壮、唏嘘、残酷、善良、牺牲等等元素都可以随意融合进去",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Captivating story. Absolutely loved every minute and wanted to find out what happened. I need a sequel, prequel, spin-off, whatever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty interesting seeing the event playback contrasting the calm of the ship, identifying passenger one by one using ethnic, facial feature, different language, shipmate rank, relationship can be pretty hard but still really fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I could not get into this game.  I can see why it gets positive reviews based on the obvious care put into it.\n\nBut truth be told \"papers please\" was tedious drudgery disguised as a video game and I should have expected this to be a snooze fest.\n\nIf you are looking for any kind of action in a game skip this one.*\n\n*it's a visual novel.  Maybe this inanimate approach appeals to some people but I like interesting stuff to be going on on the screen that I am watching.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very original and creative game with an awesome art style, but it simply is not for me at all. I tried my best to like it, but after nearly 2 hours I realised the whole central mechanic of the game felt way more burdensome than actually fun and compelling for me. That said, definitely respect the dev for trying something truly unique and think this game deserves all the praise it gets even if I personally didn't vibe with it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I love the look and atmosphere of the game. When you are seeing all of the events for the first time, despite not being able to figure out anything, it is enjoyable. But as soon as you make it to the point you have to backtrack the game plummets for me. some of the crazy leaps in logic you have to do to figure things out along with the developer intended obtuse and tedious way to revisit old chapters makes it a slog to play. I genuinely don't understand how anyone is supposed to figure this whole game out without getting fed up with how annoying it is to revisit a past scene. I've tried this game twice, once around when it came out and I was really interested in it, and a second time recently after I played and really enjoyed case of the golden idol. I thought after that game was so similar, I might be able to finally enjoy Obra Dinn, but no. Both times I couldn't make it past half the fates correct before giving up. Unless you are very stubborn or committed, id say avoid this game. It tests your patience and logic leaps a bit too much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This game has some really cool ideas and some great logic puzzles, unfortunately it is also immensely frustrating in ways that it just doesn't need to be.\n\nFirstly. the elephant in the room, no matter how many people tell you there is no need to guess or rely on stereotypes that simply isn't true.  There are a number of characters where you have to make huge assumptions like, because you've seen them next to each other in one scene they sleep next to each other, this is such a tenuous connection as to be worthless for me.  There are at least two characters with no real identifying info other than the colour of their skin, not that this would be the end of the world if thee graphical style did not obscure this in some scenes.  If you are going to use this as a deduction method then present  the game in a way that shows it consistently.  There is also guesswork involved in several other death methods where people disappear.  Yes last time we see that guy there is a tentacle about to go near him, but does he get crushed? drowned?, struck in the head?  Maybe all of those options will work, who knows, but in a game about logical deductions it is very unsatisfying when such blurred lines exist.\n\nBut for me the worst is the idiotic amount of wasting of players time.  When clicking on a memory and finishing the scene you have to wait 30 seconds before the memory time out and you can progress, which is fine if there's loads to look at but when its a scene with 3 people and nothing else just leaves you sitting waiting.  When you press to reveal the next corpse, you have to go find it and click, fine, then it sends you back to where you started from and you have to follow a sprite moving at 1mph in the wrong direction and  going in circles only to lead you right back to where you already know the body is as you literally just found it.  It might only be a small wait each time but when it happens over 60 times and is completely pointless it is immensely frustrated and a completed boneheaded design choice.\n\nThere is the sound.  The music is great to begin with but its the same 3 or 4 sequences over and over again played at full volume, meanwhile the voice levels in scenes range from loud to near inaudible, both of these types of audio are controlled by a single setting.  At the very least give us the ability to separately control voice and music like literally every other game does.\n\nAnd finally, the special hidden chapter?  Turns out to be nothing special at all.  Nothing there can't be reasonably deduced before you even get there and there's absolutely nothing about it that would give the books owner reason to withold this information from you.  It's literally a massive bait and switch.\n\nI finished this game, but honestly the last 50% of it was pretty much done out of spite rather than enjoyment.  The sad thing is it wouldn't have taken a lot to fix any or all of these issues.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really wanted to like this game, but the interface makes it extremely tedious to navigate the scenes in the order that is needed to solve some puzzles. Traveling back to each body and hoping you remember the order the scenes appear in or even if what you're looking for is in the scene you think you recall is such a shot to the leg to the pacing of the game, in what is otherwise an amazing idea of a game. \r\n\r\nThe execution just falls flat and after a few hours of playtime I realized the immense time requirement it would take to solve an otherwise straightforward puzzle, I decided the reward is not worth the investment. Your movement speed is extremely slow and you there is no way to view a scene without walking to the corpse. For scale, there are 60 people you're trying to identify, so you can imagine how bad of a concept this is.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great idea, poor execution.\n\nThe monochrome color is hard on the eyes (lasting afterimage in my vision after quitting the game to do other stuff) and makes things look too vague to tell what's happening in some scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I could not get into this game.  I can see why it gets positive reviews based on the obvious care put into it.\n\nBut truth be told \"papers please\" was tedious drudgery disguised as a video game and I should have expected this to be a snooze fest.\n\nIf you are looking for any kind of action in a game skip this one.*\n\n*it's a visual novel.  Maybe this inanimate approach appeals to some people but I like interesting stuff to be going on on the screen that I am watching.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very original and creative game with an awesome art style, but it simply is not for me at all. I tried my best to like it, but after nearly 2 hours I realised the whole central mechanic of the game felt way more burdensome than actually fun and compelling for me. That said, definitely respect the dev for trying something truly unique and think this game deserves all the praise it gets even if I personally didn't vibe with it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game has some really cool ideas and some great logic puzzles, unfortunately it is also immensely frustrating in ways that it just doesn't need to be.\n\nFirstly. the elephant in the room, no matter how many people tell you there is no need to guess or rely on stereotypes that simply isn't true.  There are a number of characters where you have to make huge assumptions like, because you've seen them next to each other in one scene they sleep next to each other, this is such a tenuous connection as to be worthless for me.  There are at least two characters with no real identifying info other than the colour of their skin, not that this would be the end of the world if thee graphical style did not obscure this in some scenes.  If you are going to use this as a deduction method then present  the game in a way that shows it consistently.  There is also guesswork involved in several other death methods where people disappear.  Yes last time we see that guy there is a tentacle about to go near him, but does he get crushed? drowned?, struck in the head?  Maybe all of those options will work, who knows, but in a game about logical deductions it is very unsatisfying when such blurred lines exist.\n\nBut for me the worst is the idiotic amount of wasting of players time.  When clicking on a memory and finishing the scene you have to wait 30 seconds before the memory time out and you can progress, which is fine if there's loads to look at but when its a scene with 3 people and nothing else just leaves you sitting waiting.  When you press to reveal the next corpse, you have to go find it and click, fine, then it sends you back to where you started from and you have to follow a sprite moving at 1mph in the wrong direction and  going in circles only to lead you right back to where you already know the body is as you literally just found it.  It might only be a small wait each time but when it happens over 60 times and is completely pointless it is immensely frustrated and a completed boneheaded design choice.\n\nThere is the sound.  The music is great to begin with but its the same 3 or 4 sequences over and over again played at full volume, meanwhile the voice levels in scenes range from loud to near inaudible, both of these types of audio are controlled by a single setting.  At the very least give us the ability to separately control voice and music like literally every other game does.\n\nAnd finally, the special hidden chapter?  Turns out to be nothing special at all.  Nothing there can't be reasonably deduced before you even get there and there's absolutely nothing about it that would give the books owner reason to withold this information from you.  It's literally a massive bait and switch.\n\nI finished this game, but honestly the last 50% of it was pretty much done out of spite rather than enjoyment.  The sad thing is it wouldn't have taken a lot to fix any or all of these issues.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love the look and atmosphere of the game. When you are seeing all of the events for the first time, despite not being able to figure out anything, it is enjoyable. But as soon as you make it to the point you have to backtrack the game plummets for me. some of the crazy leaps in logic you have to do to figure things out along with the developer intended obtuse and tedious way to revisit old chapters makes it a slog to play. I genuinely don't understand how anyone is supposed to figure this whole game out without getting fed up with how annoying it is to revisit a past scene. I've tried this game twice, once around when it came out and I was really interested in it, and a second time recently after I played and really enjoyed case of the golden idol. I thought after that game was so similar, I might be able to finally enjoy Obra Dinn, but no. Both times I couldn't make it past half the fates correct before giving up. Unless you are very stubborn or committed, id say avoid this game. It tests your patience and logic leaps a bit too much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to like this game, but the interface makes it extremely tedious to navigate the scenes in the order that is needed to solve some puzzles. Traveling back to each body and hoping you remember the order the scenes appear in or even if what you're looking for is in the scene you think you recall is such a shot to the leg to the pacing of the game, in what is otherwise an amazing idea of a game. \r\n\r\nThe execution just falls flat and after a few hours of playtime I realized the immense time requirement it would take to solve an otherwise straightforward puzzle, I decided the reward is not worth the investment. Your movement speed is extremely slow and you there is no way to view a scene without walking to the corpse. For scale, there are 60 people you're trying to identify, so you can imagine how bad of a concept this is.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great idea, poor execution.\n\nThe monochrome color is hard on the eyes (lasting afterimage in my vision after quitting the game to do other stuff) and makes things look too vague to tell what's happening in some scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game simply isn't for everyone and after almost 4 hours I realized it was absolutely not for me. It is very repetitive for the time I've played it. You just click and see a memory and then within that memory you click another corpse to see another memory and rinse and repeat until you have enough information to solve someone's fate and how they perished etc.\r\n\r\nI realize this game is highly rated and I appreciate how unique it is; apart from that I prefer other puzzle games and this just wasn't my cup of tea. I'm actually curious if others who finished the game felt the same when they first started or it clicked for them right away and felt interested in the story and crew to keep going?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very original and creative game with an awesome art style, but it simply is not for me at all. I tried my best to like it, but after nearly 2 hours I realised the whole central mechanic of the game felt way more burdensome than actually fun and compelling for me. That said, definitely respect the dev for trying something truly unique and think this game deserves all the praise it gets even if I personally didn't vibe with it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game has some really cool ideas and some great logic puzzles, unfortunately it is also immensely frustrating in ways that it just doesn't need to be.\n\nFirstly. the elephant in the room, no matter how many people tell you there is no need to guess or rely on stereotypes that simply isn't true.  There are a number of characters where you have to make huge assumptions like, because you've seen them next to each other in one scene they sleep next to each other, this is such a tenuous connection as to be worthless for me.  There are at least two characters with no real identifying info other than the colour of their skin, not that this would be the end of the world if thee graphical style did not obscure this in some scenes.  If you are going to use this as a deduction method then present  the game in a way that shows it consistently.  There is also guesswork involved in several other death methods where people disappear.  Yes last time we see that guy there is a tentacle about to go near him, but does he get crushed? drowned?, struck in the head?  Maybe all of those options will work, who knows, but in a game about logical deductions it is very unsatisfying when such blurred lines exist.\n\nBut for me the worst is the idiotic amount of wasting of players time.  When clicking on a memory and finishing the scene you have to wait 30 seconds before the memory time out and you can progress, which is fine if there's loads to look at but when its a scene with 3 people and nothing else just leaves you sitting waiting.  When you press to reveal the next corpse, you have to go find it and click, fine, then it sends you back to where you started from and you have to follow a sprite moving at 1mph in the wrong direction and  going in circles only to lead you right back to where you already know the body is as you literally just found it.  It might only be a small wait each time but when it happens over 60 times and is completely pointless it is immensely frustrated and a completed boneheaded design choice.\n\nThere is the sound.  The music is great to begin with but its the same 3 or 4 sequences over and over again played at full volume, meanwhile the voice levels in scenes range from loud to near inaudible, both of these types of audio are controlled by a single setting.  At the very least give us the ability to separately control voice and music like literally every other game does.\n\nAnd finally, the special hidden chapter?  Turns out to be nothing special at all.  Nothing there can't be reasonably deduced before you even get there and there's absolutely nothing about it that would give the books owner reason to withold this information from you.  It's literally a massive bait and switch.\n\nI finished this game, but honestly the last 50% of it was pretty much done out of spite rather than enjoyment.  The sad thing is it wouldn't have taken a lot to fix any or all of these issues.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love the look and atmosphere of the game. When you are seeing all of the events for the first time, despite not being able to figure out anything, it is enjoyable. But as soon as you make it to the point you have to backtrack the game plummets for me. some of the crazy leaps in logic you have to do to figure things out along with the developer intended obtuse and tedious way to revisit old chapters makes it a slog to play. I genuinely don't understand how anyone is supposed to figure this whole game out without getting fed up with how annoying it is to revisit a past scene. I've tried this game twice, once around when it came out and I was really interested in it, and a second time recently after I played and really enjoyed case of the golden idol. I thought after that game was so similar, I might be able to finally enjoy Obra Dinn, but no. Both times I couldn't make it past half the fates correct before giving up. Unless you are very stubborn or committed, id say avoid this game. It tests your patience and logic leaps a bit too much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to like this game, but the interface makes it extremely tedious to navigate the scenes in the order that is needed to solve some puzzles. Traveling back to each body and hoping you remember the order the scenes appear in or even if what you're looking for is in the scene you think you recall is such a shot to the leg to the pacing of the game, in what is otherwise an amazing idea of a game. \r\n\r\nThe execution just falls flat and after a few hours of playtime I realized the immense time requirement it would take to solve an otherwise straightforward puzzle, I decided the reward is not worth the investment. Your movement speed is extremely slow and you there is no way to view a scene without walking to the corpse. For scale, there are 60 people you're trying to identify, so you can imagine how bad of a concept this is.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great idea, poor execution.\n\nThe monochrome color is hard on the eyes (lasting afterimage in my vision after quitting the game to do other stuff) and makes things look too vague to tell what's happening in some scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game simply isn't for everyone and after almost 4 hours I realized it was absolutely not for me. It is very repetitive for the time I've played it. You just click and see a memory and then within that memory you click another corpse to see another memory and rinse and repeat until you have enough information to solve someone's fate and how they perished etc.\r\n\r\nI realize this game is highly rated and I appreciate how unique it is; apart from that I prefer other puzzle games and this just wasn't my cup of tea. I'm actually curious if others who finished the game felt the same when they first started or it clicked for them right away and felt interested in the story and crew to keep going?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very original and creative game with an awesome art style, but it simply is not for me at all. I tried my best to like it, but after nearly 2 hours I realised the whole central mechanic of the game felt way more burdensome than actually fun and compelling for me. That said, definitely respect the dev for trying something truly unique and think this game deserves all the praise it gets even if I personally didn't vibe with it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game has some really cool ideas and some great logic puzzles, unfortunately it is also immensely frustrating in ways that it just doesn't need to be.\n\nFirstly. the elephant in the room, no matter how many people tell you there is no need to guess or rely on stereotypes that simply isn't true.  There are a number of characters where you have to make huge assumptions like, because you've seen them next to each other in one scene they sleep next to each other, this is such a tenuous connection as to be worthless for me.  There are at least two characters with no real identifying info other than the colour of their skin, not that this would be the end of the world if thee graphical style did not obscure this in some scenes.  If you are going to use this as a deduction method then present  the game in a way that shows it consistently.  There is also guesswork involved in several other death methods where people disappear.  Yes last time we see that guy there is a tentacle about to go near him, but does he get crushed? drowned?, struck in the head?  Maybe all of those options will work, who knows, but in a game about logical deductions it is very unsatisfying when such blurred lines exist.\n\nBut for me the worst is the idiotic amount of wasting of players time.  When clicking on a memory and finishing the scene you have to wait 30 seconds before the memory time out and you can progress, which is fine if there's loads to look at but when its a scene with 3 people and nothing else just leaves you sitting waiting.  When you press to reveal the next corpse, you have to go find it and click, fine, then it sends you back to where you started from and you have to follow a sprite moving at 1mph in the wrong direction and  going in circles only to lead you right back to where you already know the body is as you literally just found it.  It might only be a small wait each time but when it happens over 60 times and is completely pointless it is immensely frustrated and a completed boneheaded design choice.\n\nThere is the sound.  The music is great to begin with but its the same 3 or 4 sequences over and over again played at full volume, meanwhile the voice levels in scenes range from loud to near inaudible, both of these types of audio are controlled by a single setting.  At the very least give us the ability to separately control voice and music like literally every other game does.\n\nAnd finally, the special hidden chapter?  Turns out to be nothing special at all.  Nothing there can't be reasonably deduced before you even get there and there's absolutely nothing about it that would give the books owner reason to withold this information from you.  It's literally a massive bait and switch.\n\nI finished this game, but honestly the last 50% of it was pretty much done out of spite rather than enjoyment.  The sad thing is it wouldn't have taken a lot to fix any or all of these issues.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love the look and atmosphere of the game. When you are seeing all of the events for the first time, despite not being able to figure out anything, it is enjoyable. But as soon as you make it to the point you have to backtrack the game plummets for me. some of the crazy leaps in logic you have to do to figure things out along with the developer intended obtuse and tedious way to revisit old chapters makes it a slog to play. I genuinely don't understand how anyone is supposed to figure this whole game out without getting fed up with how annoying it is to revisit a past scene. I've tried this game twice, once around when it came out and I was really interested in it, and a second time recently after I played and really enjoyed case of the golden idol. I thought after that game was so similar, I might be able to finally enjoy Obra Dinn, but no. Both times I couldn't make it past half the fates correct before giving up. Unless you are very stubborn or committed, id say avoid this game. It tests your patience and logic leaps a bit too much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to like this game, but the interface makes it extremely tedious to navigate the scenes in the order that is needed to solve some puzzles. Traveling back to each body and hoping you remember the order the scenes appear in or even if what you're looking for is in the scene you think you recall is such a shot to the leg to the pacing of the game, in what is otherwise an amazing idea of a game. \r\n\r\nThe execution just falls flat and after a few hours of playtime I realized the immense time requirement it would take to solve an otherwise straightforward puzzle, I decided the reward is not worth the investment. Your movement speed is extremely slow and you there is no way to view a scene without walking to the corpse. For scale, there are 60 people you're trying to identify, so you can imagine how bad of a concept this is.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great idea, poor execution.\n\nThe monochrome color is hard on the eyes (lasting afterimage in my vision after quitting the game to do other stuff) and makes things look too vague to tell what's happening in some scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game simply isn't for everyone and after almost 4 hours I realized it was absolutely not for me. It is very repetitive for the time I've played it. You just click and see a memory and then within that memory you click another corpse to see another memory and rinse and repeat until you have enough information to solve someone's fate and how they perished etc.\r\n\r\nI realize this game is highly rated and I appreciate how unique it is; apart from that I prefer other puzzle games and this just wasn't my cup of tea. I'm actually curious if others who finished the game felt the same when they first started or it clicked for them right away and felt interested in the story and crew to keep going?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very original and creative game with an awesome art style, but it simply is not for me at all. I tried my best to like it, but after nearly 2 hours I realised the whole central mechanic of the game felt way more burdensome than actually fun and compelling for me. That said, definitely respect the dev for trying something truly unique and think this game deserves all the praise it gets even if I personally didn't vibe with it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game has some really cool ideas and some great logic puzzles, unfortunately it is also immensely frustrating in ways that it just doesn't need to be.\n\nFirstly. the elephant in the room, no matter how many people tell you there is no need to guess or rely on stereotypes that simply isn't true.  There are a number of characters where you have to make huge assumptions like, because you've seen them next to each other in one scene they sleep next to each other, this is such a tenuous connection as to be worthless for me.  There are at least two characters with no real identifying info other than the colour of their skin, not that this would be the end of the world if thee graphical style did not obscure this in some scenes.  If you are going to use this as a deduction method then present  the game in a way that shows it consistently.  There is also guesswork involved in several other death methods where people disappear.  Yes last time we see that guy there is a tentacle about to go near him, but does he get crushed? drowned?, struck in the head?  Maybe all of those options will work, who knows, but in a game about logical deductions it is very unsatisfying when such blurred lines exist.\n\nBut for me the worst is the idiotic amount of wasting of players time.  When clicking on a memory and finishing the scene you have to wait 30 seconds before the memory time out and you can progress, which is fine if there's loads to look at but when its a scene with 3 people and nothing else just leaves you sitting waiting.  When you press to reveal the next corpse, you have to go find it and click, fine, then it sends you back to where you started from and you have to follow a sprite moving at 1mph in the wrong direction and  going in circles only to lead you right back to where you already know the body is as you literally just found it.  It might only be a small wait each time but when it happens over 60 times and is completely pointless it is immensely frustrated and a completed boneheaded design choice.\n\nThere is the sound.  The music is great to begin with but its the same 3 or 4 sequences over and over again played at full volume, meanwhile the voice levels in scenes range from loud to near inaudible, both of these types of audio are controlled by a single setting.  At the very least give us the ability to separately control voice and music like literally every other game does.\n\nAnd finally, the special hidden chapter?  Turns out to be nothing special at all.  Nothing there can't be reasonably deduced before you even get there and there's absolutely nothing about it that would give the books owner reason to withold this information from you.  It's literally a massive bait and switch.\n\nI finished this game, but honestly the last 50% of it was pretty much done out of spite rather than enjoyment.  The sad thing is it wouldn't have taken a lot to fix any or all of these issues.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love the look and atmosphere of the game. When you are seeing all of the events for the first time, despite not being able to figure out anything, it is enjoyable. But as soon as you make it to the point you have to backtrack the game plummets for me. some of the crazy leaps in logic you have to do to figure things out along with the developer intended obtuse and tedious way to revisit old chapters makes it a slog to play. I genuinely don't understand how anyone is supposed to figure this whole game out without getting fed up with how annoying it is to revisit a past scene. I've tried this game twice, once around when it came out and I was really interested in it, and a second time recently after I played and really enjoyed case of the golden idol. I thought after that game was so similar, I might be able to finally enjoy Obra Dinn, but no. Both times I couldn't make it past half the fates correct before giving up. Unless you are very stubborn or committed, id say avoid this game. It tests your patience and logic leaps a bit too much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to like this game, but the interface makes it extremely tedious to navigate the scenes in the order that is needed to solve some puzzles. Traveling back to each body and hoping you remember the order the scenes appear in or even if what you're looking for is in the scene you think you recall is such a shot to the leg to the pacing of the game, in what is otherwise an amazing idea of a game. \r\n\r\nThe execution just falls flat and after a few hours of playtime I realized the immense time requirement it would take to solve an otherwise straightforward puzzle, I decided the reward is not worth the investment. Your movement speed is extremely slow and you there is no way to view a scene without walking to the corpse. For scale, there are 60 people you're trying to identify, so you can imagine how bad of a concept this is.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great idea, poor execution.\n\nThe monochrome color is hard on the eyes (lasting afterimage in my vision after quitting the game to do other stuff) and makes things look too vague to tell what's happening in some scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game simply isn't for everyone and after almost 4 hours I realized it was absolutely not for me. It is very repetitive for the time I've played it. You just click and see a memory and then within that memory you click another corpse to see another memory and rinse and repeat until you have enough information to solve someone's fate and how they perished etc.\r\n\r\nI realize this game is highly rated and I appreciate how unique it is; apart from that I prefer other puzzle games and this just wasn't my cup of tea. I'm actually curious if others who finished the game felt the same when they first started or it clicked for them right away and felt interested in the story and crew to keep going?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very original and creative game with an awesome art style, but it simply is not for me at all. I tried my best to like it, but after nearly 2 hours I realised the whole central mechanic of the game felt way more burdensome than actually fun and compelling for me. That said, definitely respect the dev for trying something truly unique and think this game deserves all the praise it gets even if I personally didn't vibe with it.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game has some really cool ideas and some great logic puzzles, unfortunately it is also immensely frustrating in ways that it just doesn't need to be.\n\nFirstly. the elephant in the room, no matter how many people tell you there is no need to guess or rely on stereotypes that simply isn't true.  There are a number of characters where you have to make huge assumptions like, because you've seen them next to each other in one scene they sleep next to each other, this is such a tenuous connection as to be worthless for me.  There are at least two characters with no real identifying info other than the colour of their skin, not that this would be the end of the world if thee graphical style did not obscure this in some scenes.  If you are going to use this as a deduction method then present  the game in a way that shows it consistently.  There is also guesswork involved in several other death methods where people disappear.  Yes last time we see that guy there is a tentacle about to go near him, but does he get crushed? drowned?, struck in the head?  Maybe all of those options will work, who knows, but in a game about logical deductions it is very unsatisfying when such blurred lines exist.\n\nBut for me the worst is the idiotic amount of wasting of players time.  When clicking on a memory and finishing the scene you have to wait 30 seconds before the memory time out and you can progress, which is fine if there's loads to look at but when its a scene with 3 people and nothing else just leaves you sitting waiting.  When you press to reveal the next corpse, you have to go find it and click, fine, then it sends you back to where you started from and you have to follow a sprite moving at 1mph in the wrong direction and  going in circles only to lead you right back to where you already know the body is as you literally just found it.  It might only be a small wait each time but when it happens over 60 times and is completely pointless it is immensely frustrated and a completed boneheaded design choice.\n\nThere is the sound.  The music is great to begin with but its the same 3 or 4 sequences over and over again played at full volume, meanwhile the voice levels in scenes range from loud to near inaudible, both of these types of audio are controlled by a single setting.  At the very least give us the ability to separately control voice and music like literally every other game does.\n\nAnd finally, the special hidden chapter?  Turns out to be nothing special at all.  Nothing there can't be reasonably deduced before you even get there and there's absolutely nothing about it that would give the books owner reason to withold this information from you.  It's literally a massive bait and switch.\n\nI finished this game, but honestly the last 50% of it was pretty much done out of spite rather than enjoyment.  The sad thing is it wouldn't have taken a lot to fix any or all of these issues.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I love the look and atmosphere of the game. When you are seeing all of the events for the first time, despite not being able to figure out anything, it is enjoyable. But as soon as you make it to the point you have to backtrack the game plummets for me. some of the crazy leaps in logic you have to do to figure things out along with the developer intended obtuse and tedious way to revisit old chapters makes it a slog to play. I genuinely don't understand how anyone is supposed to figure this whole game out without getting fed up with how annoying it is to revisit a past scene. I've tried this game twice, once around when it came out and I was really interested in it, and a second time recently after I played and really enjoyed case of the golden idol. I thought after that game was so similar, I might be able to finally enjoy Obra Dinn, but no. Both times I couldn't make it past half the fates correct before giving up. Unless you are very stubborn or committed, id say avoid this game. It tests your patience and logic leaps a bit too much.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really wanted to like this game, but the interface makes it extremely tedious to navigate the scenes in the order that is needed to solve some puzzles. Traveling back to each body and hoping you remember the order the scenes appear in or even if what you're looking for is in the scene you think you recall is such a shot to the leg to the pacing of the game, in what is otherwise an amazing idea of a game. \r\n\r\nThe execution just falls flat and after a few hours of playtime I realized the immense time requirement it would take to solve an otherwise straightforward puzzle, I decided the reward is not worth the investment. Your movement speed is extremely slow and you there is no way to view a scene without walking to the corpse. For scale, there are 60 people you're trying to identify, so you can imagine how bad of a concept this is.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great idea, poor execution.\n\nThe monochrome color is hard on the eyes (lasting afterimage in my vision after quitting the game to do other stuff) and makes things look too vague to tell what's happening in some scenes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game simply isn't for everyone and after almost 4 hours I realized it was absolutely not for me. It is very repetitive for the time I've played it. You just click and see a memory and then within that memory you click another corpse to see another memory and rinse and repeat until you have enough information to solve someone's fate and how they perished etc.\r\n\r\nI realize this game is highly rated and I appreciate how unique it is; apart from that I prefer other puzzle games and this just wasn't my cup of tea. I'm actually curious if others who finished the game felt the same when they first started or it clicked for them right away and felt interested in the story and crew to keep going?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's hard to review this game, as it is undeniably a cool experience when first starting out. I went in expecting similar things to Outer Wilds (it has been compared to it a lot) but left unsatisfied. At a certain point you reach the end game and to unlock the true ending the game expects you to back-track through many slow chapters to deduce crew member fates. It was simply a disappointing realisation that I had already experienced what the game had to offer in terms of lore and gameplay and I still had more than 60% left of \"things\" to do - I am aware though that this may be the enjoyable part for players who want deduction and mystery. It did not personally motivate me to keep going, however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i like puzzles but this was too tedious.\nthe book needs a scene select to save time for the player.\nthe story felt underwhelming in the end and didnt go deeper into the \"exciting\" lore.\n\nto me the artstyle was annoying to decipher. you spend most time exploring scenes, but the artstyle doesnt really make it feel good to be part of those memories.\ni had to take multiple breaks to get to the credits. then took a 2 weeks break or so and solved most leftover cases. \nstill the last bit of end content wasnt worth it to me, to piece some deaths together by going through all scenes over again.\n\nthe music was maybe the most fun part, if it wasnt at the same time frustrating to be locked in slow paced scenes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could have used a tutorial or at least a better introduction as I wondered around aimlessly for ten minutes unsure what to do. My main gripe with this game is the art style. It makes it hard to see things where in later chapters you'll have to rely on process of elimination based on details. The game also moves quickly where it wants you to view scene right after scene and not give you a chance to slow down and think. \r\n\r\nTowards the end I just wanted this game to be over. It started off interesting, then just became a chore. Looked up a guide to finish it because I have zero desire to replay it whatsoever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game frustrated me beyond belief. I work with SEN kids, so it generally takes a lot for something to push me into actually hating it — but this game managed it. The only real satisfaction I got was finally being able to quit. (I’m autistic, I felt like I had to finish it, no matter how miserable it made me.) \r\nIt genuinely caused me more stress than anything that’s supposed to be ‘fun’ ever should.\r\nFucking Brennan!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meticulously posed scenes and emotional voice acting, in stark contrast to: repetitive gameplay, requiring zero lateral thinking; monotonous music that can't be disabled; most notably, a flat plot which surprises by not even trying to. Like its unique 1-bit visual style, this 8-hour long logic puzzle grid almost feels intentionally lacking in depth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The long and short of it is that this 'game' does not respect my time as a player.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}