{
  "positive": [
    {
      "review": "Thanks to deadletteroffice for the gift.\nGenre - Janky Easter European FPS Adventure with optional open world elements\nI think this is 8/10 game\nIt plays similar to Bioshock being an FPS with areas to upgrade and unlock new weapons. These save points are generous, so you don't have to do a lot of replaying old sections, if you find a tricky area. \nI haven't played the training levels or DLC, but all boss fights were perfectly balanced on normal mode for me, if you didn't spot a pattern or weakness early enough. You will die though.\nI do love Eastern European games as they always seem to offer something unique to their western counter parts, they are less copy and paste.\nHowever, they normally come with some jank and odd non-game breaking quirks.\nThe main criticism with the game, which is probably a sign of things to come. Is the use of AI assets in the game. \nI think this is because they have tried to add too much optional lore, that you will probably just ignore anyway.\nif you do the optional open world mode and DLC, this game could be massive. \nI completed the story after 18ish hours, with minimal exploration and no spoilers.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "I came for the sexy twins and stayed for the psycho and horny female machine that want to murder you and/or upgrade your gears, loved every bit of talk i had with her. The game is meh by the way, there is a lot of room for improvement and i hope the sequel will be a better game with even more trash talk and gooning materials.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "The plot/story of the game is great. Perhaps bit gimmicky but the storyline is still great.\nThere seem to be people complaining about games incompleteness, and I think some of it is slightly untested.\n\nHowever, it is not a bad game. Objectively speaking, after watching some youtube videos of the speech in Russian, the demeanor of the protagonist and everyone's speech comes NOT FROM USA but from Russia. People seem to misunderstand their culture perhaps and think the game seems weird. You must have some cultural skills to understand the actions of the characters.\n\nI do have the DLCs but haven't checked it out yet, but the main game story is amazing. Recommended for people who likes story and puzzle and shooter action.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Close to not recommending this one, but it is good enough to still recommend. The story is meh until you get about 2/3 through the game, then it picks up quite a bit and gets interesting. The world is beautiful and fun to play in. Gameplay is what saves this game as it is very satisfying. I just need a good story to keep myself interested and this one almost lost me. 6/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Yes, I wanted to play only cause of the robot, but the story kept my engulfed.\r\n10/10 amazing game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "+ Sci-fi Soviet Union environment, setting\r\n+ Set audio language to Russian for an authentic experience\r\n+ Music, for the first time I set the music volume higher than the effects/dialogue volume\r\n+ \"Nu, pogodi!\" animations\r\n+ Upgrading weapons\r\n+ Conversations with the red and horny fridge\r\n\r\n- Time locks with clicking. At least menu has option \"puzzle auto-solve\", so I had to activate it. Fortunately the description is misleading - this does not solve other puzzles\r\n- Design of robots\r\n- Too many drawers to search and collect\r\n- Boss fights. The first boss stopped me",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I don't know any political context or background about the game or the developer, This review is purely from someone who bought the game because it looked cool\n\nThe game is good ! The world-building and art are great, the writing can be a bit cringy from time to time but i got used to it and if i didn't think too hard about it it could also be funny. \n\nThe ending was certainly something, i didn't expect it and felt probably how P3 felt.\n\nThat being said, the game is sometimes buggy af - random crashes or getting stuck. Played it on armageddon difficulty and it wasn't that hard. The bosses in this game are fine, except the Natasha boss in polygon 12. That sucked ass. \n\nI feel like the bosses feel kinda awkward to fight, they are always in your ass, you can't properly run back and are afraid to turn around. \n\nThe music is cool too.\n\nWill try to 100%, big recommend despite my issues, hoping atomic heart 2 will be as good as it looks\n\nEdit : Spent 67 hours on the game plus the DLC. The game is not hard to 100% per say, but it is frustrating to do so due to achievement bugs. I hope they fix them because missing 3 corpses to 100% the game is ridiculous and frustrating.. Other than that. i consider it 100% in my atomic heart.\n\nOh yeah the ballerinas are sexy btw",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Atomic Heart is a weird game. It's like Bioshock, but it's not. It's like dishonored, but it's not. It's clearly inspired by Bioshock though. It's a good game, really impressive debut project of Mundfish. There are some downsides, such as the open world segment and the infinitely respawning enemies, that actually sucks. If you buy the deluxe edition, only play the third dlc, the first one is meh and the second one is an actual 2 hour roblox obby. Anyways, enough reviewing. This next part is about how much I want Nora. God, this fridge is like the most beautiful lady in existence. I want her to impregnate me and then give me a snack  from her curvy insides. I'd do anything for that sexy ass fridge. Hopefully, with the AI boom. soon there will be a possibility to have a sexy fridge like Nora IRL. Until then, I can only dream.\n\n3/4 stars\n\nbuy it on sale or something",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Words and emotions cannot describe this game. It is literally the best game I can enjoy on any platform about the USSR and its nuclear technologies. Thanks to Mundfish, and especially to Artem Galeev, keep it up!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's alot better then I expected 8/10. Then again, I did not expect to be sexually assaulted by a soviet fridge.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really fun game with lots of inpiration from BioShock. If you liked BioShock there's no reason you won't like to play this game. DLCs are fun as well. All in a soviet retrofuturisc distopian mad and chaotic world with a nice story and a good MC. Overall a great game in my opinion and a bit underestimated.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I cant wait for the 2ed game, very fun and the story was great + metal music slapped!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spectacular. A game that flatters its influences, many as they are. It is an immersive sim leaning towards Bioshock - so much so that I would call this Soviet Shock. There is a little stealth, but gameplay is more about large level traversal and combat with guns, melee and powers. The middle act is a much maligned open world section, which is in actuality a very large funnel-shaped level with optional Portal-esque puzzle dungeons on the way. Bosses were exciting and incredibly animated, though there was one particular boss that was reused a few more times than I would have preferred.\n\nThe story was gripping. The world is pro-communist in the way that Prey could be considered pro-capitalist, and the main character sets out into this world as the attack dog of the most powerful man at the top of this alternate history. You should not like this character from the start, and - without spoilers - I'd say not to take anything that is presented at face value. It's very rare to see a character arc in a video game - especially in a protagonist - and I really liked watching P-3's gradual epiphany unfold. It's hard to imagine him not being affected - this world is horrifying, both implicitly and explicitly. \n\nThe artistic direction is without equal, and the experience is topped off with an excellent score.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "First off Cons\r\nThis is one of the most stuttery games I have ever played. This needs to be fixed for the Sequel and MMO\r\nOpen world parts of the game feel under developed and last minute and poorly balanced\r\nIf they want the Open world to be worthwhile and fun for the sequel they need to go back to the drawing board or leave it out entirely.\r\nMost enemies in the game can knock you down and there is no cool down on knock down so you can end up stun locked with nothing to break you free this part of the combat needs to be heavily reduced or removed entirely its not fun its just annoying and disorienting.\r\nNow the decent\r\nThe weapons and powers feel good to use but the enemies lack combat variety would look at games like doom eternal on how their enemies are designed and interact with the world and combat systems. To come up with more varied and interesting combat encounters.\r\nThe Pros\r\nThe game's art direction and overall visual execution is very well done.\r\nThe Sound and Sound track are very well done has well especially the Sound track\r\nThe World and World building are Great.\r\nNow this next one I really enjoyed the story but I can see people also hating it but for me I thought it was great.\r\nOverall All score 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a pretty solid game \n\nA mix between deus ex mankind divided and bioshock id say. \n\nSolid fluid gunplay. Combat is smooth and responsive even with switching weapons to best counter the current enemy in front of you.\n\nI dont see why so many people complained about the \"puzzles\" in game. Most are minor lockpick minigames with some variations and the major room sized puzzles arent very complicated yet still satisfying to make your way through and are varied enough. Devs seemed to have had some fun building the challenge rooms and it shows. These major puzzle rooms are also completely optional to clear in case you dont feel like doing them. So again.. not sure why so many complained about this. \n\nRuns incredibly smoothly for what i expected it to run like on my system with no noticable hiccups or stutters even with heavy combat. \n\nI do think something needs to be done about the rapid infinite respawns in the overworld/main game land however. I find myself not wanting to bother exploring the main world as you get harassed every 15 feet by enemies that cant be downed for long. Perhaps a way to \"hack\" each sectors hawk to see you as a friendly or a way to destroy/disable the infinite repair drone spawners. Theres no point doing more than jogging through the enemies in the overworld your time and resources are better spent moving on. Theres no unique upgrades you can find in the overworld either theyre all in the sub dungeons anyway so the overworld feels both empty without potential sniffed out unique loot rewards and overly oppressive harassing you if you even want to check out the area. Unfortunately the games weakest point by far. \n\nHowever, the sub dungeons are very well done with varied arenas and exciting bossfights. Many places you can even use objects to take down your enemies which always feels nice in a game interacting with the environment to set off traps for opponents. \n\nPlot is heavily inspired by games like bioshock and deus ex. So if youve played those games youll know where its going and wont be surprised by potential twists and developments. But its done well enough overall and its hardly a bad thing to find inspiration from those classic titles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story and art design are superb! If you want a bioshock-esque game to sink your teeth into for a rainy day, this is it. The combat is fun but by the end you stomp on everything, especially if you're like me and try to kill everything you see to upgrade your abilities. If you like reading logs and finding tapes to listen to, there's a lot here and it reveals a lot of context for the story. The player character P-3, came off as an asshole at first but as more is revealed about him, I came back around on him. There are dialogs that get lost in translation, but it's rare and most of the time you can see what the intent was. Overall, it was a solid and fun game. Worth the full price if you're patient and dig into all of the side content and logs, but if you just want to enjoy some of the pretty scenery and gun your way to the end, get it on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, but can be difficult if you dont manage your rescources properly. as long as you do and you make sure to collect as much as u can or use the machine to upgrade and craft when you can the games not too bad in difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The art department of this game was extraordinary. The visual design, the soundtrack, the characters..everything felt outstanding and crazy (in a good way). If you want to avoid the clichees of most of AAA games nowdays, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually one of the greatest games I've ever played. Amazing graphics, story, music, fighting system, and everything! \"Dude, all the games on your library suck.\" I know. I found this one really great though. Worth the purchase!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that plays within the already exisiting borders of gaming. Nothing special, but it does do the things it does well. Combat, resource gathering etc etc. But the main character is the most basic guy that embodies \"the cool guy who doesnt care\" trope. Be prepared for that, it will give you the \"crispy critters.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the things I love in this game is how focused it keeps you for hours, getting immeresed into it, that's when you know you're gonna like this game and so I did. Incredible and detailed graphics, even more incredible story (that I'm guessing is still not finished since we have Atomic Heart 2 coming), sure maybe repetitive gameplay and combat but don't all games have that? Upgrading and inventory system is very nice, looting is also fun, don't know what I've left outside besides the famous freakish fridge and hawt robots.\r\n\r\n8.5./10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game, though not without a few hiccups.\r\n\r\nIt looks great, runs great, plays great, sounds great, has a storyline so well written I thought it came from a book, has a unique interesting and meaningful visual design, and is very well voice acted blyat.\r\n\r\nThe lows are very minor:\r\n- A bit annoying to chase for achievements.\r\n- Infinitely reviving enemies as you battle them is also quite annoying.\r\n- You need the DLCs to continue the storylines, as the main game endings leave a lot unanswered.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Clearly Bioshock inspired game with quite a bit of jank, some weird open world design and a pretty cool world to explore. \n+ world design and graphics\n+ OST\n+ VA is quite good \n+ weapons and skills feel mostly quite well balanced (besides mass telekenesis)\n+ performance was solid \n\n- open world design is utter bs, didn´t enjoy it at all and made some exploration very tedious\n- story is quite mid and all over the place\n- the dialogue is often kinda bad (biggest offender is our main character)\n- janky gameplay, especially cimbing/platforming sections can be absolute pain \n- puzzles are done in like 2 seconds. I enjoy that there are different ones for lockpicking but they are too easy imo\n\nI´d recommend getting it on decent sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the game, can't wait to see what they are cooking for Atomic Heart 2.\n\nP.S. Trapped in Limbo DLC is annoying af, did grind my teeth while playing it, skip it unless you are going for all achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful visuals and wonderful world building. The game seems good but for that alone I'd would recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As other people have mentioned, the dialogue is a bit aggressive for no reason sometimes, but it's a cool game nontheless.\nThe graphics are quite nice, and I also like the game design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10\r\n\r\nAtomic Heart has top-notch world building - it´s easy to immerse yourself in how the world looks, sounds and feels. Unfortunately, it´s equally easy to lose your immersion due to protagonist, he just talks too much. But I can understand that.\r\n\r\nGame could be a 9 out of 10 if not for questionable decisions regarding the open world. Exploring is such a pain, due to constant respawning of enemies. You can disable it, but ONLY temporarily. Valuable items are locked in testing grounds (bonus levels that are always visible on the open world map), but basically nothing of value awaits you if you are curious want to explore the overworld.\r\n\r\nThese were such flaws for me that I later focused just on the main story and ignored open world parts completely",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A beautiful and stylish debut from Mundfish. Atomic Heart delivers striking visuals, cool and funny characters, and solid, enjoyable gameplay. It doesn’t excel in any area, but it’s good in everything it tries, specially impressive for the studio’s first big game. A unique and entertaining experience worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atomic Heart was a bit of a mixed bag for me at first. When I started playing I felt quite underwhelmed - The voice acting and writing was corny and access to better weapons at first is a bit on the slow side. My god was I happy I kept giving it a chance because this game goes HARD. \r\n\r\nThe soundtrack is absolutely stacked with bangers even to the songs that just play on radios scattered throughout the game, it honestly hightens the experience so much. Not only that, but once you get into the open-world you truly can take in how beautiful this game actually looks, the landscapes are sometimes breathtaking to say the least, especially with ray-tracing on.\r\n\r\nGameplay wise its your run of the mill shooter with plenty of options to pick from gun-wise. I wasn't too much of a fan of the glove abilities as a matter of fact and barely used them, they all felt a bit limiting and none really grabbed my attention so I mostly played this as a shooter with extra stuff you could mix in sometimes if you wanted to. With that being said, the developers also give you the opportunity to carry as many guns as you wanted as long as you could fit it in your inventory - this is a great mechanic and one of the many quality of life features this game has going for it, which is why its worth mentioning.\r\n\r\nAll in all, slow start but great outcome. Cheesy dialogue aside, I need more of this, can't wait for the sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some areas are annoying with the quick reviving enemies and terrible puzzles, and the main character's dialouge is both cringy and janky, but still an enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game ugh. I want to recommend this game to you so bad. I want to, as an appreciator of Jank, be able to confidently tell you that I would have at maximum paid $30 dollars for this game in certain points of my life if I hadn't gotten it bundled with other games for cheaper. There is a certain charm this game has even though I still don't think I could tell you anything with confidence about the story. My partner really enjoyed watching me play, and I (mostly) enjoyed my time playing it, but I am a terrible insomniac and have more time to not be bothered by its shortcomings than a lot of people probably do. \n\nIt has been a month or so since I beat the game, and most of what I remember is a very strong start that sort of tricks you into thinking the story will be more engaging than it is, being completely lost as to what the hell was going on right about midgame, and then being more than 100 percent confident that the dudes working on the game forgot as well by the time I pulled up on the endgame exposition dump. \n\nI think if I had paid full tag price, I would have started with a lot of expectations that I don't know this game lives up to. I don't have space age technology, but it is a new gaming computer and let me tell you, this game made it sweat.\n\n If I didn't let the shaders pre-load every time I played, forget about even moving in the open world parts. \nHonestly, I don't know why the game even let me try to play it without having done that for as much as the whole experience looked like I had been hit in the head with a brick in real life.\n\nThat said, I liked it. I uninstalled it until the dlc goes on an atomic level sale and is like 5 or 10 bucks total, and I will be waiting for the second game to come out and be on a deep enough sale that I can justify getting it. Take that for what you will. If you like cool weird stuff, you will probably find something here, but if you are looking for an infinitely polished masterpiece, this is going to disappoint you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "when i first started this game i had alot of issues getting it to run properly the game wouldnt let me turn on v-sync. i noticed in the settings i had to enable dlss frame and then it worked. but beware you have to do this everytime to turn the game on at least for me anyways. now on to the story i found the story to be very predictable and thats all im going to say about that to avoid spoilers. the main character was very annoying with the stuff he says throughout  the game he says crispy critters so much that i wanted to stop playing. the gameplay feels like games like bioshock you find weapon and melee blueprints then you find resources to build them. the humor in this game was really cringy and felt forced. the enemies was good pretty challenging no complaints there. there was a weird glitch where when you beat a enemy my sensitivity would change which got very annoying. overall the game was just ok nothing special would i recommend it yeah give a play it wouldnt hurt but i would give this game a 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a weird one. It's not bad but it feels kind of generic to me. Nothing in there to really hook you in or make you want to replay it, although I'd still recommend it for the Soviet Sci-Fi spin but maybe not for the full $60.\nPros:\n- Soviet Sci-Fi aesthetic \n- Animations are smooth\n- Sounds and music\n- Combat is okay.\n\nCons: \n- Story is kind of meh but it does come with a twist I guess\n- Puzzles are pretty basic and don't require much thought, mostly serve as a way to prolong the game\n- Lost character control, fell out of the map and even crashed a few times.\n- Voice acting, at least the english version, is not great\n\n6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an interesting game, i played only the part where you leave the complex and start exploring outside.\nI probably will not continue to play the game, even if graphics/sound and setting is interesting.\nSimply for the fact that it has checkpoint saving. Redoing everything you did is no fun.\nIf it would permanently save on a checkpoint basis it would be fine. Instead you have to redo everything from last save. For most it might be fine, but i don't like to redo everything.\n\nI have to recommend it despite my issue with saving mechanic as it is certainly not a bad game because of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The art direction is absolutely stunning,its like a Soviet retro-futuristic nightmare come to life, and I mean that in the best way possible,every environment is dripping with atmosphere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a Perfect game at all but I loved playing every step of it, beating it is just a fantastic feeling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunning visuals, good maps and solid lore. I really enjoyed the hidden aspects of the game, which may unfortunately be missed by many players if they’re not familiar with how things were in the East (like Nu, pogodi!).\n\nThe only real downside for me is the controls and some conflicts in map design and story (some places feel abandoned for years, but the apocalypse has been only a few days old). This could use some more polishing.\n\nHowever, it obviously has to be compared to BioShock, and that’s where I feel a few things are missing. It doesn’t feel as scary or dark, story is not as polished (still good) and that’s something that could really strengthen the overall lore, in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly hard to grade this one.  I didn't hate it, but also didn't love it.  I enjoyed the gunplay, abilities, exploration, enemy variety, and lore...but the narrative and voice acting was nonsense.  So, if you can make it past a heap of cringe dialogue, it's a pretty engaging playthrough.\r\n\r\nDefinitely not worth the full price, but it is worth a sale or bundle offer.  Aggressively mid is my take; Steam needs a 'sideways/maybe' recommendation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "first of all i will starte with the bad things, Atomic Heart has numerous bugs, \nissues such as getting stuck in the environment, \nglitches that require reloading, and frustrating combat problems in the open-world area. \nand It seemed strange to me that they hadn't fixed the bugs \nwhen you consider the game has been out for so long,\nany way i like this game It has some really cool ideas and its fun most of the time.\nThe graphics are really nicely done. and I actually thought the game ran well, \nthe only downside is that in some places in the levels feel a bit empty and dead a bit like a picture.\nand it's not the best English voices used on the main character, but it doesn't \nfeel like a big problem in a game like this, but i think its most fair for you self if you buy this game on sale \nthe 59,99 is a high price for this game, so if you buy it i hope you will enjoy.:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some people have said this game is janky. I didn't have that problem. But then again I love Kenshi. Story and characters were interesting. Ending was a little meh but I think that was to setup for some DLC and I am glad the game has extra content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The setting, visuals, the robots, the artistic design, the puzzles... all amazing. Absolutely top tier. The design team should pat themselves on the back, it's by far the best and most reliable part of the game.\n\nThe storyline is super close to being really interesting, but by doublecross #4 I was feeling pretty uninterested. That was not even halfway through the game! Excellent job on the creepy settings and story elements, but as far as creating a cohesive and linear story it failed. It seemed absolutely disjointed.\n\nCombine those problems with frequent bugs, occasional crashes, and what I thought seemed to be a minimal amount of playtesting, I can't really recommend this game unless it's about $15.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Классная игра, сюжет очень хорошо продуман, интересная, игра оптимизирована.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the game a lot, to me it was a solid 8/10...maybe 7 or 9, but the rating can change. However, the games ending did ruin it completely for me. It felt too fast and rushed, making it feel bland and empty. You don't feel accomplished at all. Genially sad to see a good game ruined by a bad ending.\n\nI both recommend and don't recommend it because of the ending. Everything up to it is a solid 8-9/10, but the ending drops it to a 5-6 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game i've played from recent years.\nThe story, the world, the dynamic between characters (especially if you add back some of the cut content via mods...), just *chef's kiss*!\n\nIf you love BioShock, Prey, Dishonored or any kind of similar Immersive Sim, you'll feel right at home.\n\nNot going to go into details because spoilers.\nAs of writing this, i'm still waiting for the 4th and final DLC to finish the story, but i doubt my opinion will change.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really liked it. The retro-futuristic Soviet aesthetic was unique and interesting and the opening was pretty spectacular. Visuals were stunning, especially the interiors, and ran smooth as silk for me (Core i9 14900K / RTX 5080). Your copilot / hand / narrator provided thorough exposition to a story that was fine enough, although I thought the ending was a little abrupt.\n\nI'm generally not a fan of game bosses coz I hate dying and I hate repetition and they usually deliver lots of both. It was a boss, and frustratingly scarce resources, that prompted me to lower the difficulty and this did improve the game a lot for me. The enemies were pretty creative though.\n\nI was initially concerned about the mandate in the game's description to \"adapt your fighting style to each opponent\" limiting my ability to use whatever weapon felt good. This was a bit of an issue in the beginning when ammo was low but less so as the game progressed, thankfully.\n\nDef Bioshock vibes with a straight out homage at one point, which I enjoyed. Some good puzzle elements too added variation to the gameplay.\n\nThere were a few niggling issues like lots of NPC conversations and exposition emails which seemed to drag on and not offer much more to the story. The narrator character often got chatty when you'd just picked up an audio recording (or visa versa) which meant sitting around and waiting for a bit. The thankfully limited platforming sections felt clunky and unnecessary.\n\nMusic was awesome, especially the Russian tunes. It was actually Mick Gordon's name that hooked me in the first place following his awful treatment at id. Plus, I'm an Aussie so I have a soft spot for him.\n\nNot a hugely long experience, which I didn't mind at all. I like exploring and got this finished inside 30 hours.\n\nOverall, a good fun, intense at times, and polished experience that looks amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i nearly skipped this masterpiece cause of not justified negative reviews lol. \n\nrussian audio is the only way to play this game. so is stalker (ukrainian actually), so is metro.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, great game, great story, until my monitor black screened when I got to the robot twins in the intro.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game... \nIn the beginning it's pretty slow and kinda meh, but the more weapons and abilities you unlock, the more fun the game becomes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting type of game, not AAA quality by any means. Worth to buy when it's on sale. NOT for full price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great setting, great story.\nGreat atmosphere.\nGreat game play dynamics.\nWeapons aren't bad along with the upgrade chains.\nPuzzles are good and nothing is overly complicated.\nTerrible idea to implement enemy re-spawning in the open world sections. Basically makes it so you have to run, without exploring too much, otherwise you will run out of either ammo or health.\nI'd be perfectly fine with the repair robots as long as they never respawned after being killed. Just adds a different dynamic instead of being a weapon and ammo drain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atomic Heart is a funny, chaotic, and strangely charming mess. At first, it throws a bunch of annoying systems and rough edges at you — but after a while, you get used to its weird rhythm. The game mixes vibes from Wolfenstein, BioShock and Fallout, creating a world that feels familiar but still unique in its own bizarre way.\r\n\r\nIt’s definitely not the best game out there, but if you push through the frustrating parts, it slowly grows on you. The story could’ve been stronger, but the music absolutely slaps, the combat is decent, and the abilities, while nothing groundbreaking, get the job done.\r\n\r\nAll in all, it’s a solid, stylish experience with room for improvement.\r\nIGN-style score: 7/10. :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good details and nice storyline. If you have enough space and money for it i recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before. Bioshock had a really cool, unique kid that collects bugs and is autistic and loved iRobot too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game wished it had more explorable places in the first parts would have liked to fly around more to the missing islands. Also when is the space one coming out or is it gonna be dlc?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a mixed bag with a ton of upside, but not worth the full price. There is definitely a lot going for this game, but the story and the voice acting are god awful. Eh, buy on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty much Soviet Bioshock yes. It is better than I expected however, for a long time I thought it could never live up to the visuals in the trailers, and it actually has for the most part.\n\nIt could sorely have used an editor though. Exposition is dumped on you haphazardly and some conversations are overlong. Maybe it works better in the native Russian. You are kinda expected to piece it all together from audiologs and terminals yourself. Yes you will see some things coming a mile off, others maybe less so.\n\nI'm lucky to have a very good system and so it plays pretty well, weapons feel pretty good, especially when you do the optional testing areas to get their upgrades. The only real bugs I suffered were a couple of crashes in the \"overworld\" map and getting stuck on the geometry a few times which forced a reload.\n\nGive it a try at sale price at least if you have a decent gaming PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER MADE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nExcept for one thing... Please optimize the ray-tracing to a playable level and perhaps we can have a mod that allows path-tracing on RTX ray-tracing capable cards just like Cyperpunk 2077? That would be SICK! Thank you for your service, comrade, but really... Incredible work, Mundfish! This game is outstanding!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was just okay. It wasn't anything interestimg that made me want to keep playing.\n\n(The robot twins do not play that big of a role in the game as everyone had hoped.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended 👍 Playtime: 18.7 hours at current completed the game leisurely\n\nAtomic Heart is a wild, visually stunning ride through a retro-futuristic Soviet dystopia. The combat is satisfying, the world is beautifully crafted, and the atmosphere is dripping with style. I genuinely enjoyed my time with it — the story kept me intrigued, and the game’s unique aesthetic really sets it apart from other shooters.\n\nThat said, I often found myself wishing I could explore more. The environments are so rich and detailed, but the game tends to funnel you forward quickly. It feels like there’s a lot left behind — rooms I couldn’t enter, areas I barely got to see. A bit more freedom to roam and soak in the world would’ve made the experience even better.\n\nStill, if you're into immersive worlds, creative design, and intense action, this one's worth checking out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is probably a 6/10 at best. Still decent, but it's not a game that will blow you away. Without a doubt the best part of the game are the Soviet Union era visuals. The architecture, furniture, and other design is very appealing. Some things about this game felt tacked on in order to increase the length of the game. Of course, the characters having American accents is a very big thing that ruins the immersion. I wish they could've sounded like the characters from the Metro games. The game has way too many melee weapons, there probably should've been 2 at most. The puzzles are a good challenge in this game.  My favorite part of the game was that there were save points every minute. The game definitely wants you to progress and not have you redo sections as much as possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it off humble bundle. Would probably thumbs down if I paid full price for this one.\r\n\r\nBioshock fans will enjoy, but all combat and interfacing with the world feels clunky. Story telling was interesting. IDK if i missed it, but it felt like there was a lore reason for \"Comrade\" being pronounced incorrectly by every character. Felt really weird to not have very many Soviet characters in a Soviet controlled world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've been wanting a game like prey ever since i beat it back in the day. this gave me that feeling and more. i don't want to spoil this for anyone. it's just too fun and the story is brilliant. it is definitely worth your time and money. now it's up there with the best single player games i've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really reminds me of Bioshock.  The playstyle is very similar in that you get standard weapons, and can upgrade them.  However, you also get some neat powers that you use to complement the combat.  You need to solve puzzles etc.  You're just fighting robots in a 1950s era Russia instead of freaks under the sea.  Good game tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY forgettable gameplay, BUT the visuals are the best ive seen in any game as of 2025. Get it but only at a discount no more than 30 bucks MAX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10\r\n-1 point for a few too many moments where I got cornered by robots and had to spam jump and dash just to unclip myself. Also, there’s no compass and no way to place a marker and follow it without constantly checking the big map.\r\n\r\nAside from that, it’s an absolute joyride — packed with style, atmosphere, and a strange nostalgia for an era I never lived through. A masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Combat is insanely fun and addicting, and the music is so fire. Dont expect the ability to take back areas, every area is infested till you complete your playthrough. Story starts off amazing and kidna fizzles out, its okay at worst and enjoyable at best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly peak, the bossfights are lackluster but everything else is pretty good, the movement the gameplay all tight and nice, and trust me you dont need the fancy late game guns, run it down with 600 ak ammo and you will be fine. What i have to notice is that there were 2 Kino song which to be honest made my day, if you get it on sale? please buy it is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty great FPS\r\nReally loved the world and the setting in genera;, its very unique\r\nThe overall vibes was fantastic\r\nThe game;ay is also very interesting and mostly like bioshock with some new additions\r\nI found the story pretty interesting albiet a bit confusing at places\r\nIts has some jank in the start but those smooth out as your unlock more skills and weapons\r\nOverall i really enjoyed my time with it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a fine FPS.  It poses as Bioshock, and pays tribute to it in some places, but it pales in comparison.  But, it's still not a bad game.  Combat can be quite hard in places.  \r\n6.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very refreshing game experience. They took some risks in the creativity department, especially with the audio direction. \n\nThere is some jank to the game and questionable design decisions however. The voice acting, while not bad, is completely out of place with the setting. One moment a guy speaks like a redneck, while the other a proper british gentleman, and then a bubbly preteen girl. It will ruin some of the immersion. I tried with the Russian audio, but with all the dialogue during battles, its not easy to read subs and fight at the same time.\n\nThe amount of locks in the game is also too much. Locks on their own are not a bad thing, but when every lock has a tedious minigame attached, plus an extremely long unlock animation, you start dreading every lock you are forced to proceed through. \n\nDespite that, the game is fun and offers something fresh in the audio/visual front. The story is a real banger too! Definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h3][b]Thoughts[/b][/h3]\r\nEver since I first saw the first teaser in 2018, I've been completely sold on this world. I was mindblown with the level of uniqueness and creativity. And I'm happy that Mundfish executed that vision and brought it to life. Atomic Heart has its flaws but it managed to kickstart a whole shared universe. And I'm beyond excited to revisit this setting in a sequel, and The Cube spin-off!\r\n\r\n[h3][b]What I liked[/b][/h3]\r\n🟢 Absolutely mindblowing world design and visual style\r\n🟢 Stunning graphics and incredible technical execution\r\n🟢 Visceral combat complemented with cool abilities\r\n🟢 Quirky arsenal with a meaningful upgrade system\r\n🟢 Twins\r\n\r\n[h3][b]What I didn't like[/b][/h3]\r\n🟠 Repetitive open world with unrewarding exploration\r\n🟠 Narrative often felt confusing and disconnected\r\n🟠 Lack of enemy variety\r\n\r\n[h3][b]My score[/b][/h3]\r\n[b]8.1 / 10[/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite open world games I have ever played. Right there with Skyrim, Borderlands 2, and Cyberpunk 22. This deserved more love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you are a fan of the bioshock, systemshock , or fallout series this is a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Show those fucking clankers who's boss and why God created man and not machine.\r\n\r\nIn the end I enjoyed this game despite quite a lot of ... strange if not bad things/design decisions, and some really annoying bugs.\r\n\r\nThe meat and potatoes of this game is a kind of dumbed down Bioshock with more focus on guns than skills/magic, or Prey (the 2017 game) with a bit better gunplay.\r\n\r\nMany other reviewers are trying to compare this game to Fallout but it has nothing to do with Fallout except the time frame which is some time in the 1950s but the style is completely different and it's just a different type of game and atmosphere.\r\n\r\nWhat I liked:\r\n- destroying endless mobs of stupid clankers and some zombie things;\r\n- cool guns which you can modify;\r\n- the main plot was kind of interesting, at least it made me want to see what happens next;\r\n- some parts of the dialogue were kind of funny;\r\n- graphics are pretty good (but not to the point where it justifies how the game runs ... see below).\r\n\r\nWhat I didn't like:\r\n\r\nRelatively minor things which I could look over:\r\n- some parts of the story and dialogue are pretty campy - the main character is oscillating between russian Duke Nukem and wholesome mc smarty-pants which is just weird. They should have just gone for one or the other. Towards the end of the game it gets a bit better but most people who don't like this won't get that far;\r\n- enemy variety could be a bit better - towards the end the game does get a bit repetitive;\r\n- the MC and guns get to be too overpowered by the end of the game, even at higher difficulties - bosses end up being a joke - even the end boss was not a challenge at all, and I didn't even use a lot of the buffs like vodka and condensed milk (da, comrade, that is a thing);\r\n- the \"magic\" skills you have are not that varied , wish there would be some more stuff there;\r\n- the melee weapons are very same-y and don't feel so different - I just used a single one through the entire playthrough;\r\n- even on latest 2025 hardware the game has areas where it runs poorly (albeit on 4k with RayTracing activated, and DLSS on balanced, but still) and in general the way it looks does not justify how much power it requires;\r\n\r\nSuper annoying things which almost made me not recommend:\r\n\r\n- there are still a lot of bugs related to map geometry which means your character can easily get stuck in places where you can't get out of, or you trip over invisible things when trying to charge at enemies or trying to escape;\r\n\r\n- some quests require you to manipulate physics objects which sometimes bug out and you can't manipulate them anymore - had to reload a save a couple of times because of this;\r\n\r\n- there is a lot of platforming in this game but in places where clearly you can easily jump/vault over something or grab onto something, your character can't do it because the devs decided that's not allowed - yet 5 meters to the right may be a thing which is even bigger or taller than what you just tried and is perfectly vaultable because random ... this is really annoying when navigating the open world and trying to escape from enemies or reach loot boxes or something like that;\r\n\r\n- some platforming puzzles require you to make relatively precise jumps which the game's physics engine tries to make you fail - e.g. if you run too fast into a wall you will kind of \"bump\" away from it, which is a bit realistic I guess but is super ultra annoying when trying to solve some of these puzzles . Also sometimes your MC just doesn't grab onto clearly grabbable ledges from the firs time, or misses jumps even though you smash that stupid space bar into oblivion - crispy critters!!!\r\n\r\nIn the end I did still have fun, and I could get past the campy story and graphics slowdowns but I almost , almost , had the experience ruined by all these mentioned bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After finishing the game and three of the four DLCs, I can say that this game is pretty damn good. It IS an unabashed ripoff of Bioshock, but instead of exploring Ayn Randian objectivism it is explores (with massive dose of humor and straight-up goofiness) the predominant Soviet ideology of 1955. It asks the question of what the Soviet Union would do with the power it wielded upon the discovery of a basically magical element known as \"neuropolymer,\" which allows it to develop advanced weaponry, robotics, and for lack of a better term, \"plasmids.\" And the result is, as you might expect, disastrous. \r\n\r\nSome people have given this game a lot of guff because it's by a Russian studio and claim that it glorifies the soviet union. Well, frankly, it certainly does not. No more than Bioshock glorified Ayn Randian free marketism. It's a fun, pulpy sci-fi story with some memorable characters and really stunningly original enemy design. \r\n\r\nThe gameplay however is not so unique. It is Soviet Bioshock after all (and it lacks the immersive sim DNA of that game, though not its ambition), but the gameplay was never why I kept playing. The gameplay was serviceable enough but the story kept me invested. The ending of the main game had me scratching my head, and not really in a good way, but the DLCs have amended this and I'm excited to see how they conclude this story.\r\n\r\nOne aspect of the game I really enjoyed is the same mechanic I saw many reviewers shitting on it: the way it handles a sandbox. It is does not merely let you clear areas, nor does it arbitrarily respawn enemies. Instead it is built into an interesting system of repair drones connected to a satellite which can be hacked to shut down all robots in its vicinity for a short time. If you're caught on a security cam fighting a robot, reinforcements arrive and you're in for it. But I found I only ended up in a frustrating situation if I wasn't smart about it, and I thought this was a really novel way to handle a semi-open world. \r\n\r\nThere is a lot to explore, and my favorite stuff was running around finding all the Testing grounds to complete my collection of weapon upgrades. The portal-esque puzzles in these levels were challenging at times, but mostly just a fun change of pace from the combat-centric core game. \r\n\r\nAt its core, this game is a real spectacle. It's like watching a Red Army parade in Moscow after WW2, but with crazy sci-fi robots, mutants, and fantastical flying machines. The dialogues with dead people who know they're dead but have to wait until their polymer powered device stopped keeping their thoughts alive, the sex-crazed upgrade machine, the sarcastic AI built into your glove, the female service robot who insists you find her best friend whose limbs have been scattered across an entire facility, the talking dolphins, the visual whiplash of Limbo, and the epic boss battles all make this game something unique and fun enough to want to see everything. I can say without doubt, I quite LIKED this game. It is a bit janky, a bit contrived, and quirky as fuck, but it's interesting (especially if you find the Soviet Union a fascinating setting like I do). I put almost 80 hours into a single playthrough and that says a lot.\r\n\r\nBIG DISCLAIMER: If you can stand playing a game with subtitles, for the love of god play the game in Russian. I saw some footage of the English voice acting and saw immediately why people thought it was stupid and the main character was annoying. In Russian, he's dumb in an endearing way, like an Arnold Schwarzenegger character. It helps that I speak a bit of Russian and this was some extra credit on my language studies (though the etymology behind \"crispy critters\" [yebuchi peregiy] remains an enigma to me.) The Russian voice acting plays it more straight, and immerses you in the world so much more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Woah... Red rulez, Blue droolz?\n\nThe combat was fresh and interesting, the story was amazing, but the real highlight for me was the puzzles. I usually dislike puzzles in games, but these ones had some real thought and creativity put into them!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has a very good story and the gameplay is very polished",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the story very much. Watching clips of people play this made me want to play too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got me questioning if im robosexual\n\n\nThis shit def not open world, more so free roam type shit like dishonored 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine \"SoViEt UtOpIa\" but somehow DOOMish kinda also with a good amount of corny humor and robot ballerina's that are \"THE FUNNY\"  It also runs great on 2023ish mid spec machines with GREAT visuals.  My only complaint is it feels like there is no barrel aiming and instead you get a cross-hair for non ads.  \n\nAnd as a gun nerd the ks-23 is weak affffff compared to what irl it can do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, it’s a fun game, but I do have a couple of issues. The ceiling magnet mechanic is a bit tedious, idk if it's a glitch, but I have to zap them twice each time and it gets old, especially since they're in every underground base. The climbing mechanic can also be frustrating; sometimes my character gets stuck, forcing me to reload the last save. The platforming feels inconsistent too, sometimes I make a jump without issue, but other times, the character won't catch the ledge. These are little things, but they do add up. Still, it's worth playing, and the soundtrack is fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h2]This has spoilers for Bioshock and atomic heart[/h2]\n\n[spoiler]I have a theory if you have played Bioshock infinite it opens the infinite universe but if you look at it as there’s a city there's a man and every Bioshock has the “powers” plasmids in rapture and vigor in infinite then in atomic heart the city is Icarus platform the man is Dr. Dmitry Sergeyevich Sechenov who is your “boss” and the power is Polymer abilities or Polymer Glove abilities which are made from live tissue like plasmids and vigor which are made from slugs from the ocean bottom ya see what I'm putting down [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "7/10, kind of good entertainment.\r\n\r\nGame received for $1 from Humble Bundle choice.\r\n\r\nRussian power trip fantasy simulator where your glove is smarter than you and does everything better than you (well, do they do that left handed in russia)?\r\n\r\nAbout story:\r\nAs this is Russia, research facility robots go haywire and kill people. Player to rescue as he is supa-dupa military guy. Though he gets bonked and starts only with axe and ultra-high tech glove. Player protagonist talks to his hand mostly and his glove trash-talks back. Some reviewers said conversations are infantile but actually most of them are quite good. Though protagonist goes to rage rants for no reason a bit too often but he's mass ax murderer which slops heads off from corpses as he sees fit. This could also be \"lost in translation\"-type of problem though english in the game is... fairly good. I need to shoot better, okay?\r\n\r\nEnvironment is kind of believable as the world characters live in. Though peasants continue to be peasants and russian (research) villages look totally backwards russian villages even robotic labor is widely available. Game plays around with cold war-era propaganda stories as Dollar-NATO is always making war and always threating hard-working peasant serf. You could only wonder what kind war machines has to be on that side as russians have superb Polymer which is goo-ish solution to everything and Soviet Union is still sort of contained in global scale.\r\n\r\nGame also features Mary Sue-style granny right at the start and certain other magical plot devices are just slapped on to get story to go forward. Character actions aren't the most believable but this is FPS game after all. At least player character does not let anyone to push him verbally around but hoo boy he is dumb as sack of bricks without his glove which in turn pushes him then around.\r\n\r\nInterestingly, most of actual gameplay, boss events and combat situations are designed in a way that you can expect and prepare for them. So you usually have opportunity to at least save and probably gear-up for the encounter. Save points are mostly abundant which is a good thing as you cannot save everywhere. Backtracking to save points aren't usually blocked.\r\n\r\nPlaythrough on hardest, after few early enemies which you have to ax with default level ax which is tiresome to Max, game then goes to be super easy. Loot is abundant and as your character \"develops\" (read: you click on skill tab), game starts to be more and more MOUSE1-fest.\r\n\r\nDifficulty spikes on bosses which have funky Elden Ring-style mechanics meaning random spam attacks and large AoE splash areas. Well, probably they cannot damage player otherwise but spamming large AoE is really tiresome. Other enemies have irritating spawn mechanics which could be countered by killing them under some kind of roof. Default mobs aren't much of hazard later on and you'll manage to deal with most of them with your Palpatine lightning and pew-pew electro pistol.\r\n\r\nIn addition of few normal weapons game has several melee's to offer but actually in addition of Steam achievement, you really do not want to use than just one melee and few select guns. Also player has two magic glove skills to boost player even further which on max level gives you enough edge to deal with anything as MOUSE1 fodder.\r\n\r\nThere are some real janky moments which are probably just russian design or plainly by-passing game testing but nothing really serious. Testing ground 11 frozen boiler is broken as it probably relies on janky Unreal Engine behaviour on peasant game consoles but you can actually use second boiler twice. I actually have maxxed settings on NV2080 and over 60FPS natively on 2560x1440 (motion blur, DLSS etc. off), so at least this game is min-maxed on polygon level to give decent performance for target audience on serf consoles.\r\n\r\nUI at least acknowledges the mouse and I can rebind keys to mouse too but I guess that might be just UE default behaviour. Switching weapon slot places is one of the most confusing but working UI design pieces ever.\r\n\r\nGame has Quick Time Events but I CAN DISABLE AND WIN THEM AUTOMATICALLY FROM MENU. Which is total win as I just hate QTE crap though this game seems to have at least same button every time. You absolutely want to turn QTE off as it is insta-death in boss battles.\r\n\r\nMap design is a notch of more interesting than your run-of-the-mill console MOUSE1-fest featuring 60's futu-fantasy setting. Game is \"open-map\" but not open world style. Map (singular) is somewhat spacious but totally free roaming is not possible.\r\n\r\nSoundtrack includes both new and oldies goldies style music including Alla Pugacheva whose songs has also spin-offs in finnish. Game though does not have portable radio so you have to use your Ladas with mono radios to create surround sound system. Song list is a bit too small but maybe that's why player cannot listen them except near radios.\r\n\r\nAlso game features probably real cartoons with wolf and bunny. Usually that is interesting distraction as player just keeps staring inside the game something which is not a game where wolf chases a game (glove makes a joke about that at some point). Also game mimicks or just tries to spin humour from Fallout by having young party-obedient pioneer scout adventuring (similar to Vault Boy) and his nemesis Evil Capitalist Pig. Game does not actually use that design enough so it is more likely nod to Fallout and therefore kind of falls flat.\r\n\r\nWarning: game includes Denuvo. You cannot even remove intro videos.\r\n\r\nWell, time for conclusion. As game was $1 I could recommend this but definitely would not pay full price.\r\n\r\nFinal verdict: Would buy Tereshkova seks bot model as soon as they become available in 3-orifice configuration. I am such a filthy Capitalist Pig. Nora was right about everything after all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "sound track? on point\r\ncombat? pretty neato, like bioshock\r\nstory? pretty good, could do with a better intro into the universe but thats me\r\nacting? pretty good but however repeat use of one liners is a bore and some of the voices for the bots are such a pain\r\ngunplay? pretty decent honestly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought the game cuz hot robot, im a simple man",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a good game. Visually stunning,gameplay spot on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the story took me by suprise and that doesnt happen often for that 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excelent game, cant wait for the all the DLC's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cyberpunk but soviet. absolute peak. get ready to be r@ped by  clankers and your ears blessed by Geoffplaysguitar's  heavenly music",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is heavily influenced thematically by Bioshock 3, albeit it replaces capitalistic themes with soviet era imagery and fringe ideologies. Gameplay is modernised in comparison to the Bioshock series and with much prettier graphics, which, frankly is almost photorealistic at times, whereas other times it remains less so, for immersion's sake. \n\nI've only played it shortly so far, but am really looking forward to finishing the game to see what this story is about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Честно говоря, атомик - одна из немногих игр, которую я не прошел до конца.\r\n\r\nВизуально и атмосферно игра классная. Здесь много продуманных деталей, есть прикольные персонажи, хамство и небольшая быдлячность главного героя хорошо поданы и идут ему, чумовая бабуля и заносчивая перчатка по своему хороши. Правда больше я персонажей толком и не вспомню. Ну ничего. Атмосфера зато классная. Постсоветское технологичное будущее с летающими москвичами... Ляпота!\r\n\r\nВ минусы могу записать геймплей. Очень уж он скучный, а сюжет непонятный. Боссы не простые. Отсюда вопрос - если сюжет и геймплей не очень, то зачем мне преодолевать трудности, побеждать этих боссов и проходить игру? Непонятно.\r\n\r\nТем не менее, игру рекомендую. И когда-нибудь я обязательно вернусь и допройду сие творение! Правда, на DLC меня точно не хватит...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super underrated game, loved it, feels a lot like Bioshock which adds up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Atomic Heart was a great experience. The graphics are stunning, the combat feels very satisfying, and there’s plenty of weapon variety to keep things fun. The optimization is excellent, and the boss fights are creative and exciting. Overall, the whole concept and atmosphere of the game are really well done.\r\n\r\nThe only downside for me was the driving, which felt boring compared to the rest of the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun, mix of puzzles and mini boss battles. Ending isn't great though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. A little annoying at times. But a well done game. Graphically beautiful and the story is nice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The visuals are great, the character models look amazing (the twins… yeah), and the world design is top-notch. The story and twist are okay — not bad, but I feel they could’ve pushed it further. Similar to Control, I think the game would’ve been stronger as a more linear experience.\r\n\r\nThe weapon upgrade system isn’t good. When switching a mod, you have to upgrade it five times again just to reach max level, every single time you change. Because of that, I ended up sticking with only three guns: the shotgun, AK, and bazooka.\r\n\r\nOverall, it's a recommended game. I hope they improve these parts in Atomic Heart 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "+ gameplay, atmosphere, graphics, exploration, world building.\r\n\r\n- puzzles, time wasting, annoying f***ing s***.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This was a fun game albeit lacking. I put it up there with Fallout and Bioshock for unique aesthetic but I wish the story, or more about the execution of it, could've been done much better. P-3 is a bit too much of a d*ck to people, or everyone in general. The open world section was exhausting. The enemies would endlessly respawn and I wouldn't mind if they restored their loot but they don't. I absolutely love the lore, the bots, the whole aesthetic but the story and narrative pacing was extremely weak. As I said, there's good things in here but the execution is a bit lackluster. It's a 7 out of 10. Enjoyed it for what it is but it certainly could've been better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome game. no wonder gay western media outlets downplay it and try to sweep it under the rug.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly loved it. Its basically as if Bioshock and Portal had a Russian baby. Some of the testing facilities will have you use another part of your brain. Amazing graphics too",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "very much like a soviet bioshock but then they tried to release it last christmas\n\nfun game, cool concept, but the execution is really not worth the 60 bucks, maybe 20 at best\n\nEdit: i wanna clarify that on the artistic level i loved this game. the music is really enjoyable, the visuals are of course very pretty. but sadly the development, animation and writing felt very rushed and awkward often. it can be quite buggy at times, and a lot of fun side quests seemed to have been cut, dialogue that seems to not lead anywhere, a lot of filler, [spoiler] not to mention the ending is very unsatisfactory with the \"surprise plot twist\" leaving a very sour aftertaste [/spoiler], not really looking forward to trying out any of the dlc after the ending of the story felt very poorly written. it had the potential to be the bioshock of this generation but it failed to reach the level i feel a lot of passionate people working on this wanted it to be",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I do not, I absolutely do not, want German language voice output. My Steam is set to English, the settings are English and the menus appear in English. I tried all kinds of things Google suggested and nothing works. Mundfish, you can take your forced German language voice output and shove it where the sun doesn't shine. Until you do, I do not want to play your broken game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "- semi-open world that discourages exploration\n- main character is irritating and unlikable\n- endings are not satisfactory\n- main character moves like a paralytic tortoise",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Three crashes in the first two hours. Validating files does not help. While trying to select a skill on a Nora-machine it doesn't allow me to select anything, and I cannot exit the machine with Esc. I have to Alt+F4 out of the game. This has happened three times. The game is unplayable as it is. \n\nWill edit my review if they fix this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I quite like the look of this game and, despite the rather poor English voice acting for the protagonist, find it quite compelling, and would like to be able to get into it to see where the story goes. However, after less than three hours, I found myself uninstalling the game due to how generally poor it feels to play.\n\nThe combat, while serviceable, does not feel particularly good. Which, on its own, would not be the worst thing - many games have poor combat and are still enjoyable. Fallout 3 comes to mind. However, what drove me to uninstall the game after such a short time was the first-person platforming. While I'm sure it can be used, it is an exercise in frustration. After ten minutes in the seed-bank level doing my best to climb my way out of a hole, doing my best to find the correct buttons to leap from a climbable pipe to a nearby ledge, I decided to give up.\n\nSkill issue? Maybe. But I really have no desire to take the time to develop the skill of fighting the game's control scheme. I only have so much time, and such a thing is not what I am interested in doing.\n\nPerhaps I will try again later, or seek out some mods that may improve the controls to remove the frustration. I can not, however, recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game constantly resets the settings, and it builds shaders almost all the time when launching the game.\r\nOne time it just totally froze the whole PC.\r\n\r\nBesides that the combat is floaty and not exactly satisfying. Voice acting goes from alright to crazy cringe at times. Art direction is a big plus, same with the animations and world building. Overall the game has huge potential but ended up being mostly boring and confusing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very important - if here would be an option to rate game in the middle between suggest or not, I would definitely choose it for this game. It is not like such good to recommend, but also not so bad.\r\nGame, actually, is interesting. Action takes place in a theoretical parallel reality, where after WWII Soviet Union has incredible level of science, and built utopic floating city in the sky. I must say, that very strong feeling of Bioshock Infinite here takes place. But also strong influence of such games as Singularity, Fallout and Half Life.\r\nStrong Soviet era feeling in the game will be very interesting for people, who have that nostalgy for of SU. Some authentic music tracks (unfortunately, playlist is a bit too short and songs are getting annoying at some moment, as all the time same songs are being played), a lot of soviet like symbols and heritage. Actually, big work is done to create that SU feeling.\r\nWhat for me makes this game less enjoyable.\r\n1) There is no option to run.\r\n2) There is no stealth.\r\n3) Quiet strange saving system. You can save progress only at some specific places and sometimes, there is autosave before some events. You can' t run around in the game without often visiting saving spots or all progress will be lost.\r\n4) There are some places, where character stuck and you cant move or jump out.\r\n5) Sometimes main character annoys with his useless chatting and especially swearing. I find this quiet stupid.\r\n6) Somehow key remapping isn't working on vehicles. Maybe, it is only me.\r\n7) Really annoying is that during some boss fight you must push some random key, which is indicated on the screen. Hate games, which are doing like this. I never understand - should I push it once or should push multiple times like crazy... IMHO this denounces game to some playstation adoption level.\r\n8) There is no fast travel option between unlocked locations in open world map.\r\n9) And here we are have reached open world map topic.\r\nI must say, that actually great idea, that there is open wold between missions. Open world with some bonuses, with some scavenging, fighting some enemies, finding some loot and secrets. Great idea. Especially, when open world is so great. A lot to see and to explore. But everything is spoiled by infinite all the time re-spawning enemies. There is no time to search for secrets, to enjoy beautiful view - all the time you must run or fight enemies, which are endless. There is no fun in exploration despite very beautiful landscapes and views. If I would be the DEV of this game, I would make some change - when player loots destroyed enemy, it is not possible for wasps to repair it. I guess, such mechanism could make some balance.\r\nAlso hard for me was to understand, how works hiding, when the \"heat\" level is at max - I found cave in a very quiet place, where I hid, but heat level wasn't decreasing despite there was no enemies around for minutes.\r\n10) When you open map, somehow I expect to have more explanation on indicated spots. Right now there are a lot of dots.\r\n\r\nBut I see a very big potential in this game. It can be upgraded to a brand new level.\r\n\r\nAnd for people, who is reading this - just remember, that all we are with specific taste in games. Maybe, this game is exactly for You :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was a huge let down. The world and the ambience was very well made but the story was very good but castrated so you had to buy the 4 DLCs they were gonna release and the gameplay is so boring, the bots are too many and too strong so you have to sneak around all the time trying to not get caught or u will be smoked. My gameplay was just to rush from point A to point B to follow the storyline. Could have been a 10/10 game if they did a TLOU kinda game, with an open map following the story instead of a open world just to dilute the game and make it longer. I bought the gold edition for like 25€, give it a try for this or less",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Damn, this game really does водка my товарищ!\n\nIn an alternate universe where the Soviet Union won at everything so hard that they managed to make a fully autonomous robotic workforce by the year 1955, Major Sergey Alekseyevich Nechayev has to stop this same robotic workforce that suddenly became hostile and turned on its human overlords.\n\nThe fact that this is game studio Mundfish's first game is nothing short of extraordinary. The vibes, graphic quality, and optimisation are through the roof. The enemy encounters are sufficiently varied. The looting mechanic where you just suck up loot like a vacuum cleaner should be a thing in way more games. And the game itself just has a level of presentation that would make you think this was a game made by an established AAA studio and not some indie dev studio out of Cyprus. That entire opening sequence, from when you arrive at this seeming communist utopia on a boat to your first steps in the open world, is excellent.\n\nUnfortunately, those first steps in the open world also tend to be where the game begins to lose its steam and never fully recovers. In fact, the longer you proceed in this game, the worse it gets, in my opinion.\n\nThe story of this game is extremely predictable, which in and of itself isn't necessarily a bad thing, but when the main protagonist of the game constantly plays catch-up to their surroundings and never takes any sort of hint to the true state of the world, no matter how much the people in said world are screaming exposition at him, it's hard to feel invested. This is outright ignoring the fact that Sergey is just annoyingly written, with him being portrayed as this no-nonsense hunk whose tagline of \"Crispy Critters\" has to be said 10 thousand times. This just leaves him as a seriously unlikeable and dumb protagonist, which is not someone I personally want to be in control of. He's the male equivalent of Aloy from the Horizon games. Just plain annoying.\n\nThe open world itself feels confused. There is just a severe lack of anything to find and do in it. It is heavily implied that you should sneak past enemy encounters, with cameras that call for reinforcements and robot repair stations being scattered around its world that constantly repair almost any and all robots you've killed. But then the game spams dozens of these robots in and around your quest markers, which makes it borderline impossible to actually sneak past, so most of your time will be spent running past them or just ramming them with a Lada Niva™. However, when you spend most of your time running past enemies and the game doesn't even have a sprint button, let alone any other movement abilities, it just becomes a chore to do.\n\nMany sections of this game feel like they drag on for too long. Giving me a quest where you have to go through the bureaucracy of finding a train ticket so that the dumb robot would start the train is kind of funny and endearing. When essentially every quest and puzzle is designed in this way, it feels like the game is just padding its runtime.\n\nI actually felt that the combat of this game was its best part, but when you spam me with as many enemies as this game does, especially in its later stages, it just becomes far too simple to find mind-numbingly boring tactics to kill all of the enemies on screen. Standing on top of a staircase and just spamming the fully charged spin-to-win axe attack, anyone?\n\nIn short: a great first attempt at a game which will hopefully lead to the developers listening to feedback, learning from their \"mistakes\" and making a banger sequel. One that, unlike this game, I would recommend with all my кровавый heart.\n\n4/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While artistically pleasing, gameplay wise, not so much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I originally posted a pretty scathing review, which didn't really do much in the way of helping the developer, nor was it very effective at communicating my thoughts to possible purchasers.\n\nI did not enjoy the two hours I played of Atomic Heart. I found the main character unlikeable; he was rude and unpleasant to everyone he interacted with, and I did not find his quips entertaining. The world, while interesting, was introduced through far too much cutscene, and not enough experience as a player. Of the two hours spent, almost half of it was locked into uninteractable cutscenes, or 'walking cutscenes' where I directed my character forward with no additional content beyond pausing occasionally to listen to two or three lines of dialogue shared between NPCs. There was an attempt to show instead of telling, with the most egregious example of 'telling' being a series of informative history posts on a series of signs, while the \"current day\" state of the world was presented through people acting as people, but the switch from 'normal' to 'incredible violence' was somewhat underwhelming. I think part of the issue was that there was over an hour of setting build-up, and then 'suddenly robots attacked!' It was a radical tone-shift that should have re-engaged me with the story, finally let me engage in gameplay with consequences beyond pressing forward on my joystick...\n\n..,but I didn't find the combat terribly engaging, either. The chunk I experienced was fairly standard gameplay; I picked up a gun, I shot enemies. I could switch to a melee weapon, and hit the enemies. I was introduced to looting the environmental objects, and then immediately taught to use the 'auto-loot all when I press the button' function, so that the looting doesn't actually feel like anything more than poking highlighted background objects to have a random amount of money/health/etc. fall out. I reached the first mini-boss, and it was another generic enemy, but faster and with a ranged attack.\n\nAt that point, I was actively displeased with the main character, vaguely interested in the main story, but not really engaged with the gameplay. Perhaps if I got further in, things would change, but based off of my experience with the game, I cannot recommend it, as my opinion is that the interesting worldbuilding was undercut by the uninspired combat and actual RPG elements and actively poisoned by being irritated every time the main character opened his mouth to insult, sass, or sarcastically respond to everyone interacting with him, including the AI(?) inside his own body.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cannot recommend any game that takes over half an hour to get to actual gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Basically \"Meh the video game\".\r\nApart from the setting everything else feels unfinished, unrefined or just bad.\r\n\r\nNot much variety for weapons, skills, enemies, puzzles or environments.\r\nPacing is bad, characters are boring, dialog feels off and so on...\r\n\r\nWould not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have been curious about this game for a long time and when I finally started playing it I was blown away by the setting. The world building is top-notch and the introductory mission shows an interesting world and setting that begs to be discovered. Unfortunately I soon got bored by the gameplay, the characters and the voice acting. I really don't care for the voice acting of the protagonist or the way he reacts to the AI/Robots in the world, it is just annoying to have to listen to. The gameplay issue boils down to every weapon feeling like it hits like a wet noodle. Nothing I swing or fire at an enemy feels like it actually makes an impact, even if it kills them in 2 or 3 shots it just does not feel rewarding to destroy the enemy. This makes every mission feel tedious and I only \"enjoyed\" finishing a mission because I would get to see a bit more of the interesting setting. In the end I don't hate the game, but I just feel like there are better games to spend my time on. If the sequel is set in the same world, but has better pacing and more satisfying combat I would enjoy it, so I will still keep my eye on part 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Imagine a shooter, where shooting isn't fun.\nImagine a companion you hate, but you can't just mute and git rid of.\nImagine getting stuck on evironment objects all the time.\nImagine being able to save only in specific locations.\nImagine having to load saves and backtrack every time you get stuck.\nImagine having infinitly respawning enemy waves all the time.\nImagine being forced to do meele combat in a shooter.\nImagine said combat being boring.\nImagine all enemies beeing bullet sponges.\nImaging having to solve annoying puzzles to unlock every door.\n\nAt least the game looks nice.\nNot playing is more fun than playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Leaving this as a reminder to myself--it's just not a lot of fun to play.  I don't like combat or exploration here.  It feels like a bad combination of the Bethesda Fallout series and Bioshock.  \n\nCombat: no weight to it.  That's not fully it--movement feels way too flighty (melee enemies will constantly swing and miss past you, and dodging similarly throws you about the room), but gunplay feels heavy.  I'm not a programmer and I can't tell you why I have a visceral dislike to the combat, but I do.  It's very much a \"feel\" sort of thing. \n\nExploration: I've played for a few hours and it's been very on the rails.  That's fine, early hours on a big game tend to be pretty railroaded, but I'm not even seeing alternate paths.  There are side rooms (rarely!) but as befitting the sanded-off version of Fallout, very little loot that is actually valuable.  It's just some of the 6 crafting resources. As far as I've seen, there are not multiple paths through things, either.  Not a \"crawl through this vent OR go through this door\", from what I've seen it's just a lot of \"go through this door, now go through this door\".\n\nI will add a note here that I really don't like the dialogue or narrative.  It's an incredibly interesting concept that is, frankly, ruined by the early 2000s-era dialogue.  Even sidestepping the gratuitous sexualized comments, the main character just keeps cursing.  It distracts from the gameplay, all the more so because no one else in the game world does it!  I don't need a wordless protagonist but it comes across so juvenile that I can't bear to keep playing when combined with the above. \n\nI can imagine someone liking this, but I cannot imagine myself liking it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "45 Minutes from watching shaders build to walking simulator to get to the beginning of the actual game. Got bored switched it off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything other than the shooting is obnoxious. Melee on even normal mode has spongey enemies that take too long to kill. Platforming is inconsistent. Dialogue is sophomoric and all too often has the main character express annoyance at the gameplay mechanic at hand as if it somehow makes it better that the mechanic is, in fact, annoying. Boring puzzles, bad controls, inability to properly remap controls in game\r\nMy complaints are endless.\r\nBioshock, this is not",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still has a lots of bugs, got stuck in two different places and had to load very old saves to get past them. The controller didn't work for selecting cameras or to load cartridges on guns, had to use the mouse to get them to work.\r\nOpen map isn't great and the gameplay in the open world is a bit repetitive and frustrating.\r\nThe puzzles were fun in the testing grounds",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think the biggest problem is the games introduction alone takes 2 hours, so once you actually start to see the problems, its too late to ask for a refund.\nThe story's interesting enough I'll admit. There's a lot of alternate history and worldbuilding if you look for it, nothing seems explicitly spelled out which is both a positive and negative, often leading to jumps in logic that the player is left trying to keep up with until; you get a mission update telling you what to do next.\nWorld design is really interesting but becomes a little repeptitive after youve visited a few bunkers and realize they all feel like carbon copies. Enemies are really cool to look at though, and most of the bosses have a real good feel to their designs.\nCombat feels spread to thin, and I'll elaborate. It feels like nothing is super built upon itself. Melee weapons and guns are fine and there's an upgrade tree, but it feels very minimal to me at least. Your \"powers seem cool, but I found them to be finicky, like fire and ice never aiming right, or the shield not really working. Certain enemies are health soaks and you'll spend an insane amount of resources just trying to get through zones. There are \"stealth\" segments but no good tools to help you resolve them efficiently, and I found most of them devolving into combat.\nFinally the dialogue. Your main character sounds cheesy half the time, with an inordinate amount of cursing and sudden catchphrases. Other characters appear lazily written with dialogue serving to hastily establish their chracter in a sentence or two or just to resolve not knowing their name. That may be on the voice acting more than the script but I'm not really certain. And finally there's an overly sexual vending machine which started as an extremely dumb bit which I could brush off if it w3as a one time thing, but every time you interact with one, its the same overly sexual dialogue that feels extremely uncomfortable to witness, and out of place with the tone of the game.\n\nLong story short, its a really mediocre RPG shooter imo, its can be fun but also extremely frustrating. I wouldnt spend more than $20-30 total on this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game looks wonderful. I love the characters. That's all the positive praise possible.\r\nThis game is absolute dogshit, the controls and bugs are nearly unbearable. I actually uninstalled this after just the first mission but decided to power through because well I have the time and the characters are fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game look great and the vibe. However, when you actually play the game, it's just not fun. Very low start. Main character just rude for no reason and seem like he tries to be edgy. Combat not even fun. Climbing and POV just suck ahh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game barely works, constantlly getting stuck in wall puzzles and the melee combat is so clunky. Glad i got it on humble bundle. ID give it a middle score if i could",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The main character and slow sections of the game really test the limit of my patience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing a lot of Atomic Heart lately. I’m not having fun. It’s a fine enough game, though the writing and tone are so antithetical to what I come to games for. I’m so thirsty for something good, but I feel like I’m trying to squeeze water from a cactus. Every time I find something that is sustaining me in the game—the interesting powers, the incredible design, the unique concepts—the game pokes me, reminding me it’s more Borderlands or Duke Nukem than Bioshock. So it goes.\n\nMore than anything, Atomic Heart is reminding me of those grim weekends when I’d shoot my shot with a game that looked and sounded cool, only to end up disappointed. I’m a cat, playing with a mouse I’ve already killed, batting it around, hoping it’ll do something and bring back the joy I felt in the chase. But it’s dead, the excitement on the box, the pull quotes, and the manual can only bring so much. Now that I’ve got a controller in hand, it’s not working.\n\nWhich is fine. If there’s one thing I’ve learned in playing, writing, and talking about games, it’s that not everything is for everyone. That doesn’t quiet the twelve-year-old in the back of my mind, though. That voice is still haranguing me to squeeze all I can out of this game, to find the fun, to see why people love it. To make it worth it. I spent my allowance on this game; not playing it is not an option…right?\n\nThis is my great lesson with Atomic Heart, something I’m slowly learning with all forms of media: it’s fine to quit. This stuff is only ever worth it if you make it so. There’s no amount of time that you’ll hit that magically validates your money and time spent. It’s up to you to make that call, to have the conversation with yourself. It’s okay to quit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll make this a list:\n\nGood:\n\n1) Game is visually nice, \n\n2) it runs very well on my rtx 3060 laptop (the most important thing about this game. I think you can even play it on a 1050 ti)\n\n3) Interesting story\n\n4) The MC blabbering did not annoy me at all\n\n5) It is late in the game, but when you find out about the MC's story it is very well made\n\n6) The world's story and the character's stories are very well made as well, you don't see much of those NPC's but the glove and the MC talk a lot about them so you make a mental image of how things are run in that world and the chain of power + politics + the enemies reasoning for what they do. \n\nBad:\n\n1) Enemy units get revived by the blue drones way too often, it makes the game repetitive (I am almost 30 years old, I ain't got much time to play, maybe that is why I could not stand this type of gameplay)\n\n2) Even the security cameras get respawned and it is very difficult to pay attention to them as well, why do I have to always be stealthy in open world ?\n\n3) The game has 2 endings, but the ending its chosen right at the end, there is not much RPG to this game. The world is big, full of lore and story, there are many interactions with npcs, and even so, it feels like a linear story in an open world map.\n\n4) I heard there are many research facilities you can explore, but it is so tedious \n\n5) THE BLOODY PUZZLES ARE SUCH A HEADACHE, LIKE , I GO FROM PUZZLE TO PUZZLE TO SOME COMBAT AND THEN ANOTHER PUZZLE.\n\n6) Sometimes the dialogue does not resume when entering an event zone or combat. The main character sometimes speaks to the glove, and if you interrupt by triggering another dialogue or combat, you will lose some important details about the story\n\n7) it feels so slow to get from mission to mission, the character does not have a sprint, just dash. I think this was made to keep the framerate consistent when loading assets and LOD, but I just wish there was a sprint, to at least get the false feeling of going faster. The cars are not so fast either, and can hit various debris on the road very easy.\n\nSPOILER ALERT: \n8) At some point in the story you get to ... some sort of Bioshock's Rapture, the MC even refers to it as \"rapture\" stuff, even the music changes and resembles Bioshock's, but that is about it, the time spent there is short and you find so much info in the archive there, but by that point I don't even want to read it all (maybe they added some more \"rapture\" content in the DLC's but I can't buy those).\n\n\nThere are a lot more good things about the game, but the bad things stood out to me more and could not concentrate on the good things. I can't recommend this game, as much as I want to. I was so hyped about this game... . It felt tedious, and I just wanted it to be over already. The sequel is in the makings and the devs surely seen all the reviews and will do better next time. \n\nNOTE:\n\nTHIS GAME MIGHT NOT BE FOR ME BUT IT MIGHT BE FORE YOU, CHECK OTHER REVIEWS AS WELL\n\nand\n\nThere are vulvas Everywhere you look: the doors, the door locks, and some architectural elements. This ain't bad nor good, it is what it is. The glove's 2 tentacles lockpicking the doors gives me the creeps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's hard to pinpoint exactly what it is about Atomic Heart that makes me not like it.  Individually, the components of the game are generally solid.  The guns feel good.  The movement, environments, the story, the voice acting, it's hard to say that on their own that there is anything particularly wrong with them.  But as a whole product, things are just ever so slightly off.  I wouldn't even call it jank.  It's just puzzle pieces that don't always fit together like they should.\r\n\r\nYou have a game that both wants to be like Bioshock and Metro: 2033, but also wants open world environments like Far Cry and Metro: Exodus mashed together in a not always good way.  You have combat that wants to be stealthy and horror, but late game you have moments and battle environments (and music) that feel like the game is trying to be Doom (2016).\r\n\r\nIt is just a weird monstrosity of a game.  I can see why some will come away liking it for the exact reasons I do not.  But for me, I don't think it's a good enough sum of it's parts.\r\n\r\nThat the story is entirely sequel bait with it's ending was probably the final nail in the coffin for me.  If it stood well on it's own, perhaps I'd be more forgiving, but to have an 18 hour run end on that note is not a positive stepping away point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i cannot play a game where the voice acting not done right and  you get lost  a lot in this game and doesn't tell you where to go i got lost on one level i rage quit the game show you find your  way out like other games. i will not be buying atomic heart 2 because just like outer worlds 2 it was the same thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Several core game mechanic choices ruined an otherwise pleasant experience, having enemies infinitely respawn but only provide loot once was the most egregious for an otherwise exploring game was the worst. There were others everyone else figured out was bad 30 years ago and some janky bugs took a solid experience down to an \"I don't feel like bothering.\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The dialogue between your character and his AI companion is some of the worst writing I've ever heard. It's actually astonishing how cringe it is; so much so that it takes me out of the game and makes me not want to play despite the positive aspects of the rest of the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If i hear the phrase crispy critters one more time, i can't promise i won't get violent...\r\n\r\nSo the overall vibe of this game is...meh, visuals are good, some of the powers and effects were cool, some of the puzzles were ok, but that's where the good things end.\r\n\r\nThe protagonist is annoying, constantly whining, the story kind of predictable, too linear, the whole game you get one choice and it's kinda dumb. Driving cars was atrocious, the climbing was clunky and buggy af, also gotten stuck on a ledge a few times. Then there was the annoying horny robot that you can't even avoid cos you have to upgrade your stuff and tbh the devs could have saved the time they spent posing the robots in pervy positions and instead invest that time in making that game less mediocre, but i supposed that was more important than everything else. \r\n\r\nI did get this from a humble bundle subscription so i didn't pay the full price, was it worth it? No but the sub came with a few other games that were worth it so i guess if it's like that you could get it, if you hate yourself enough to subject yourself to this game.\r\n\r\nNow you maybe asking, if you hate it so much why did you finish it? Good question, my partner predicted that i would ragequit after 7hrs, so i did it out of spite.\r\n\r\nOh and the first hour was a snoozefest, maybe watch a let's play of it before committing to buying it, at least for the beginning, but if against my advice and your good judgement you do buy it, don't say i didn't warn you. Also elevator rides are long and boring, a quick loading screen would be nice there too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Atomic Heart is an amalgamation of other games:\n\nBioShock, Fallout 3, BioShock: Infinite, Metal Gear Solid V: Phantom Pain, Portal, BioShock, Five Nights At Freddy's, Yandere Sim, BioShock, BioShock, Gears of War, Drakengard, Bubsy 3D \n\nDespite this abundant variety of influences, Atomic Heart fails to feel like itself at any point: the seam of every single influence is clearly visible, jaggedly stitched together into a patchwork tapestry that doesn't really do anything on its own. Unfortunately, the narrative also suffers from this: Atomic Heart features an incoherent story that's badly told, up to and including a major plot item being acquired during a loading screen and remaining in your possession for less than two minutes.\n\nAside from a single scene of some extremely unhinged hot robot yuri featuring a man made out of blood, Atomic Heart has nothing to offer. Watch a YouTube Let's Play and save yourself the trouble.\n\nEdit made Nov 20 \nATTN: THIS REVIEW NOW CONTAINS MAJOR SPOILERS.\n\nI do want to be a bit clearer with my grievances, since the fact that the developer responded  shows that they're paying attention. I don't mean to be overly harsh in my critique, but I do admit that I was very frustrated with how close Atomic Heart came to being good and yet fell short of delivering every single time it neared brilliance. I'll boil it down into three main problems:\n\n1. [b]Melee is completely superfluous.[/b] The primary function of melee in a game like this is to conserve ammunition: a risk vs reward situation where you have to risk melee combat for the reward of defeating an enemy without spending resources. And it's obvious that you wanted the player to engage in some level of melee, given that you gave the player five different melee weapons to play with, but all of that goes out the window the instant that [spoiler]the player gets the infinite ammo lightning gun[/spoiler]. Now the cost of defeating enemies without spending resources is simply patience, which trivializes the game even on the hardest difficulty.\n\n\n2. [b]The narrative's immersion and presentation clash with each other constantly.[/b] Atomic Heart goes out of its way to ask the player to participate in certain scenes, but also frequently forces the player to simply witness events. Why am I given dialogue options if they don't matter? Why are some scenes done in the style of Half-Life where I retain control and can interact with the environment, but others are done in a more traditional style where input is taken away as specific events happen? It feels like there's no commitment to one method of storytelling, which makes the story feel inconsistent and makes it difficult to connect to the player character. \n\n[spoiler]It was especially frustrating to be repeatedly told that the protagonist is being manipulated and the only meaningful choice you're given in the entire game is to either stop letting that happen (which gives you a joke ending that's literally a slideshow) or just go with it (which leads to your character begging for a peaceful dialogue that's withheld for no reason, causing a bad ending after a series of twists that had zero foreshadowing).[/spoiler]\n\n\n3. [b]Arguably the most important plot point is resolved badly and with no warning.[/b] [spoiler]There is no scene where the player obtains the rings. You just suddenly [i]have[/i] them after an elevator ride, and the only reason I know that is because Charles started telling me about them. No explanation, no reason, no nothing - they're just in your pocket. I looked around, frantically searching the internet to see if I had just managed to bug the game or miss a scene or something, but no: that's apparently the same experience everyone else has had. By all indications, that is the story that Atomic Heart meant to tell.\n\nAnd then you just toss 'em. Hell, you don't just toss 'em, you toss 'em in the shallows of a beach where all it would take to find them is an afternoon and a can-do attitude. Less than that if you happen to have a metal detector, or are some kind of hyper-intelligent gestalt entity that can shift into any form it pleases.[/spoiler]\n\n\nI wanted to like Atomic Heart. I really did. The art direction is gorgeous, the conflict raises all kinds of fun and interesting moral and philosophical conundrums, and it was really refreshing to experience a story that was not deeply steeped in the stereotypical western tropes. However, it fumbled at least one key element of every major aspect of the experience, and those issue just... ruined it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a whole lot going on, mostly visuals with rather poor gameplay loop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games fun most of the time but honestly, the story is too much of a roller coaster and just doesn't have too great of an ending. It seems like it is trying to be bioshock/any game without a \"good\" ending, you gotta choose the ending you think is less bad. Its also incredibly glitchy at times and the gameplay gets a little stale after you beat the game once. I was going to continue onto the dlc but I honestly bet it isn't going to be anything worth my time. Also, it seems like the devs have abandoned the game completely. Its worth the money if its like, 10 bucks but anything past that, forget about it. P.S to game devs, we want to see good endings with our characters surviving and the world being a lot more happy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, the banter, the setting the concept love it.\n\nI have spent an outrageous amount of time being stuck between boxes or algae or knocked somewhere that clips you into something and its time to restart from the last autosave. \n\nI dont want to spend time avoiding tester missed traps.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game starts interesting, the art design is amazing and the whole concept has potential but here comes the cons:\n- no explanation for simple stuff so you get stuck and have to google how to pass simple things in the story\n- hardest puzzles ever made in a game\n- takes all the fun and pacing out of the action.\n\nIN MY 6 HOURS OF GAMEPLAY I GOOGLED MORE THAN 4-5 TIMES HOW TO PASS SHIT and to add extra salt to this game even the main character complains about the puzzles which are everywhere. hard pass from me on this game. I will not spend half of my gameplay time on youtube videos on how to pass puzzles just to finish a story that also feels kinda cliche.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most fun I had with this game was when I called it \"Atomic Farts\" and then chuckled to myself like Butt-Head. \n\nA lot of people compare Atomic Farts to BioShock and System Shock, from where it clearly draws its inspiration, and I think that's fair -- think Bioshock if Bioshock didn't respect your time at all, took 15 minutes to loot every room, and lacked a manual save feature like a mid-00's console game. \n\nIf that sounds appealing to you, have at it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It looks great but that's about it, the game itself is tedious and has a ton of bugs, there is little action.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game feels unfinishedand and the protagonist is cringe asf\nbuy it if it's under 5 euros.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "everything about this game is so buggy. controller support is abysmal. i thought everyone was overreacting about the voice acting, but it is horrible. this game has potential but is not worth the price. buy it in a decade when everything is patched and it's on sale for $10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The visuals are great but everything else just feels like an unsatisfying plate of bland chicken and rice. Great prologue that really hooks you in but after 5 hours or so the game loses its appeal. I couldn't go further than about 50% of the game when I realised it felt more like a chore than anything else. I counted my loss and uninstalled. \n\nWould not recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The introduction was really cool and felt like I was in Bioshock infinite 2, but after playing for a couple of hours, I realized, that it´s to bland for me. The Combat feels really sluggish and annoying, the leveldesign in the first section lost me really quickly and the world building and story got indifferent too fast.\nI started only playing towards those looney-tunes-like cartoons in the saferoom.\n\nI dont know, maybe if I didnt experience Bioshock beforehand and could not compare it to this game it could be called good, but it feels to bland and stiff to hook me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: I encountered a lot of bugs, It requires an active internet connection to start, Combat is exciting at first, but feels half-baked on harder difficulties.\r\n\r\nI have had to reinstall this game repeatedly. I keep encountering weird issues that cause performance degradation (related to shader caching I think), I clip through walls and pipes sometimes when using the scanner, and sometimes it jsut refuses to start.\r\n\r\nIt has to have an internet connection to start. I like to game at work before we turn the wifi on, and personal devices are not allowed on the wired network. I don't know what kind of stupid DRM they are using, but I was told that it's easily circumventable. but due to the possible legal issues with that, I've had to temporarily hotspot my phone to my laptop every time I play.\r\n\r\nThe gameplay overall feels half-baked. Stealth is encouraged but seemingly the only thing that has a mild difficulty to it. I can run and gun with no penalties as long as I do it outside certain areas. The lack of an evolving strategy over 9 hours is concerning. I feel more like the plan for this game fell apart early on.\r\n\r\nThe story is not that interesting. I have yet to hear what I assume is the twist though, so it might be like Bioshock where the real story comes together after the twist and flowing into the climax. Unfortunately without more engaging gameplay, I'm inclined to give up before the climax. \r\n\r\nOverall, I'm glad I didn't waste money on the DLCs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It looks like a game with a nice theme I’d love to finish it, if it would just stop crashing and kicking me out all the time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant force myself to continue, it is bland, shooting and overall fighting feels clanky, not sure why there is open world, audio (english) overlaps. I would love hardcore soviet-era vibe, but this is not it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The opening of Atomic Heart felt like a Soviet Bioshock or Soviet Fallout, but it lacks that kind of originality or spirit.  In a hundred small ways, everything in Atomic Heart feels like I've seen it done elsewhere, but better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not, I absolutely do not, want German language voice output. My Steam is set to English, the settings are English and the menus appear in English. I tried all kinds of things Google suggested and nothing works. Mundfish, you can take your forced German language voice output and shove it where the sun doesn't shine. Until you do, I do not want to play your broken game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "tried the game when it came out, ended up un-installing from the insane amount of bugs. updated and re-installed now (late 2025) and its almost worse in some areas, so much potential but really not enjoyable due to being so unpolished sadly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is noticeably buggy — that’s its biggest flaw. The save system doesn’t help at all, since you can get stuck almost anywhere and the save points feel randomly placed.\r\n\r\nAs for the story… it’s primitive and pointlessly edgy. There is an interesting concept buried in there, but the execution is poor. The developers had an idea, they just didn’t manage to deliver it well.\r\n\r\nThere’s also some fanservice involving ballerina robots, which just feels weird. The main character even comments on the sexualization of the robots and finds it disgusting, yet the game still leans into it.\r\n[spoiler]And you only encounter them twice in the entire game, with one of the final boss fights being optional — which makes the trailers feel misleading.[/spoiler]\r\n\r\nThe game mechanics are frustratingly drawn out, clearly designed to pad the playtime by forcing you to perform mundane tasks accompanied by overly long animations.\r\n\r\nThe art and overall design are genuinely good, especially the techno-Soviet aesthetic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wish I could like this game, I really do. I've heard great things about it, and the music goes hard. But god, the MC talks too much and is some sort of macho asshole that I can't tolerate. The start of the game, which I don't think I even technically finished, was just a slogfest of the guy and his glove very brutishly trying to drag me into the world. Hell, we go on a tour of this world's modern inventions and tech history! Wow! Let me learn about the game through story and observing, not through minute long boring cutscenes. I was just prayingggggg that something interesting would happen, and it never really came. Even when the instigating event hit, I was interested for maybe 3 minutes and then back to the vapid slog. \n\nI'd also like to add that I am disabled, and for those of you who are also disabled or even just a little slower to react- this game is not gonna be fun for you. I got stuck on one of the lock sequences for over 5 minutes before I nearly gave up and refunded the game. There does appear to be an \"automatic solve\" and \"automatic qte\" setting, which is awesome since most games don't have those kinds of features, and I'm sure the automatic solve setting would have helped with the locks. But it really all just emphasizes how bipolar this game is in terms of pacing. Long, boring cutscene, a fight where you need to have fast reflexes to survive (which like, whatever, I went into this game knowing it'd be like that. I like play Ultrakill, I know what I'm getting into lol), and then stopping again to listen to the two flattest characters in existence painfully drag you through some game mechanic. It's stop and go and stop and go etc etc.\n\nThe combat also just... it's weird. I'm not terribly picky about combat, not the kinda guy who complains that I played a walking sim and didn't fight something or whatever. But this game made me have opinions about combat. None of the weapons feel organic. You randomly get an axe (????) and a shotgun and they're both just... weird. Sometimes they oneshot, sometimes they don't. Sometimes all you have is the axe and you still get hit even if you dodge. Then there's glove powers. I managed to get two, and the hotkeys are Q and V. I don't know who called that a good idea but good gracious. \n\nBut yeah. I couldn't even handle an hour and a half of this, and I am the kind of person who makes excuses for the crappiest games. Maybe it would have picked up later, but I sat through this whole first part and felt like they were gonna drag me along for 2 hours so I couldn't refund before putting me in anything vaguely interesting. I get that people would like this, sure, but it just feels like some weird power fantasy that I legitimately just can't stand.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Atomic Heart – Gorgeous but Feels Like a Malfunctioning Robot[/h1]\n\n[b]★★★★☆☆☆☆☆☆ (4/10)[/b]\nNot recommended, especially not at full price.\n\nThe game somehow triggered my [b]motion sickness[/b], which no other game has ever done, that’s already a bad sign. The [b]combat feels clunky[/b] at the start, and the [b]framerate is bizarre[/b]: cutscenes or random animations sometimes run at [b]30 FPS[/b] while the rest of the game is flying at [b]250FPS[/b], making everything look jarringly off.\n\n[b]Combat and movement[/b] feel stiff yet overly fast, like everything is on caffeine but still lagging. That said, the [b]aesthetic and world design[/b] are fantastic. Visually, the game nails its retro-futuristic vibe. There’s also [b]lots of voice acting[/b], which I genuinely enjoyed.\n\nUnfortunately, the [b]story is bland and unengaging[/b], and the [b]ending felt empty and confusing[/b]. It’s a good-looking machine with bad wiring. Stylish, but not satisfying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The only nice thing I can mention is the setting/visuals. Very well done sense of place.\r\n\r\nAfter that, the rest is really bogged down by a predictable story, a miserable main character, seemingly random enemy placement, a terrible mechanic that resurrects downed enemies constantly, an open world that was clearly an afterthought as a way to link together the actually tolerable parts.\r\n\r\nWas severely disappointed in this game and then to make things worse, it bugged at the very end. After beating a major enemy towards the end, the game just would not let me progress. Repeated it 5 times each time going back to a later save and it would not go further. Oh well! Wasn't enjoying the game anyway.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game contains the same amount of fun as Dead Island. For the fans of this series you will get CCCP flavored bot smacker.\n\nFor other people:\n- not enough ammo is not fun\n- enemies randomly attacking you silently without camera shake from behind is not fun\n- controls are horrendous; controller is somewhat better than keyboard, but autoaim simply does not work\n\nCannot recommend, nobody who's done the technical side of this game has apparently attention to detail OR production team has their sights on boring gameplay with communist jokes here and there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "whole game is oversexualized and game is also buggy mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The dialogue between your character and his AI companion is some of the worst writing I've ever heard. It's actually astonishing how cringe it is; so much so that it takes me out of the game and makes me not want to play despite the positive aspects of the rest of the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks. The voice acting is shit, the story line is some weird ass Russian propaganda, and all of that I could live with if it wasn't for the shittiest combat system I've had the misfortune of playing in a long time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "controls are clunky and buttons can't be mapped. \"V\" is the worst button to use in an FPS for a combat ability I literally always miss and hit the wrong button. \"V\" is too far from wasd",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Major, did you know the circle object goes into the cricle shaped hole? It is that way because circlish things fit better in circlish holes than squareish things in circlish holes.\"\r\n\"Charlie- Chuck- whatever yous, damn robot glvove *lights a cigarette* fucking squares and fucking circles fuckingly fuck shit!\"\r\nThere I summarized the first 5 hours of the game. I'l play it more just... without audio.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashing all the time, total glitchy mess. Avoid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "constant bugs, ended up getting one that softlocked my save.\nHad to go in and out of fullscreen to make enemies, puzzle elements and my character lockpicking move step by step.\nAlso acheivements popping at random times for things I hadnt done yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is just boring  \n\nWeapons: Don’t feel cool to use, fun to shoot and don't have unique enough upgrades. There feels like there is just 1 upgrade per gun that is “right”. Normally you just get the upgrade that does more damage to robots or gives more energy. Zvezdochka is by far the best weapon in the game and you are just wasting your time by using anything else. It’s actually criminal how unbalanced all the weapons compared to each other.  \n \nCombat: Is mostly just walking backwards while shooting and using abilities. If you aren’t doing this, you are often getting punished for it. Mostly because alot of enemy's attack animation are so fast it’s basically teleportation. Melee is portrayed to save ammo but getting hit while trying to do melee is common and unavoidable, so all you’re really doing is trading ammo for healing. Even during boss fights the combat wasn’t particularly hard. Most bosses are bullet sponges and so the only real difficulty is if you brought in enough ammo into the fight. i only died in combat a handful number of times and that’s while playing on armageddon. Most of my deaths were to fall dmg, falling through the map or getting stuck on the terrain.  \n \nUpgrades: These are somewhat interesting. I loved the mechanic that i can’t lose resources  while upgrading and can change my playstyle at any moment. However again like weapons it often felt like there was just a “correct” option. On top of that, again, the upgrades just weren’t very interesting or changed the playstyle of that ability at all.  \n \nArt: Textures, setting, environment, music, robot designs were all phenomenal. Whoever oversaw the art direction in the game was doing their job well. Particularly the limbo sections were visually very interesting and usually told a story through it’s environment.  \n \nStory: It was just ok. The ending was somewhat interesting but i was snoring through most of the story. I even went out of my way to interact with every audio log, dead person, and terminal i came across. Most of the dialog was pretty flat and lacking any amount of character. \"crispy critters\" is not an interesting character trait.   \n \nPuzzles: They reused the same door puzzles constantly and it’s soooo boring. Especially the rhythm finger snapping 1, you can't hardly call that a “puzzle” but the circle with matching colors 1 was ok depending on how easy or hard it was. The larger puzzles in the actual puzzle sections weren’t particularly challenging and were just kinda going through the motions. The only puzzle i give top marks to is the one with the ballerina shadows, that was actually interesting and unique.  No puzzle actually uses the abilities or powers of your character in any interesting way, that was pretty disappointing. \n \nBugs: I usually don’t care much about bugs but i had some pretty large ones. I lost 2 hours of progress from the game not saving consistently, i fell through the for map 5 mins straight losing 30 mins of progress, enemies shooting from underground, enemies insta killed me while a character was talking to me. Bugs are a little too common in a game of this caliber and especially since I’m playing it almost a year after launch.  \n \nMy biggest problem with the game is I’d play for an hour or 2 and after my play session I'd ask myself, “did i have fun?” usually the answer was no. I played the game 35 hours and maybe 5 of those hours were notable. I think this game suffers from being an open world but it’s basically not even “open world.” It's as if it’s an open world but on a 2d plane. I always felt constricted when and where i could go. The overworld was the weakest points to the game but the actual “dungeon” type areas could be fun but the rest was just filler.  Considering the most fun moments i remember having off the top of my head were an audio log and talking to vending machine, that's pretty sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Didn't even finish the first part. Pointless long dialogues, awful and annoying platforming and so much more that it just ain't worth my time (play around 3 hours).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pro: It looks great. \n\nCon: Gameplay doesn't feel nice. It also starts very slow, which would be fine if it was interesting but I don't think it is. Looking good is not enough to carry it. Also, the dude you're playing as is just annoying. Rude for no reason at all, saying lame goofy shit. If I didn't have to spend so much time waiting for shaders I'd still be in my refund window.\n\nI might revisit, it might get good later, and I might change my mind. But I don't think so.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The ledge grabbing is broken. The first time I got softlocked for grabbing an edge, I just reset. The second time I gave up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Guy won't STFU. Glove won't STFU. \"Erm, did I just do that with my friggin glove?! Okay, I shoot lightning now. That is a thing I do now\" \n\nGot this cause I wanted something akin to Bioshock. But Bioshock is leagues better than this game. Your character doesnt talk. Atlas isnt an annoying glove that constantly talks. Even Booker and Elizabeth combined in Infinite weren't as chatty as this Russian dude. I turned the dialogue to 0 cause it got annoying. But then I was just following objectives the moment they popped up.  Oh yeah, and there's also music that doesn't fit the mood at all. Terrible game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No hold to crouch. \n\nAlso, the worst most Pathetic script for the worst most annoying character I've ever heard in my life. It's so bad I play it in Spanish.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sketchy russian funding sources of the game linked to anti-ukrainian stuff that caused a lack of a ukrainian dub. little to no replayability, even on hardware like a 3080 and ryzen 5600 the game is still very unoptomized on even low settings. it's just more tedious doom and the DLCs are done weird as like seperate games as opposed to a continuation of your main save, and not that good. The \"open world\" is just filler areas with no purpose other than to get you to different dungeons underground. The english localization dub is just eh... (\"crispy critters\" really?). The map design is confusing in alot of dungeons, as well as your objectives, i remember getting softlocked a ton but that was when the game released. also it's got unreal engine jank and the crappy denuvo anti-piracy, because they know their ruskies are a buncha pirates\n\nThe good that i liked:\nThe eastern-european nostalgia-jerking and the cartoony UI stuff taken heavily from nu-pagadi was cool, I was chilling by a tv for 5 min watching that. Hard difficulty is actually hard but suffers from most game's assumption of \"hard\" just making enemies more bullet spongey and you being more frail as opposed to extra factors like resource management. So much eye-candy, so many mosaics. i cannot tell what the exact message of the game was but what i got from it was overreliance on tech bad, and individuality is good because the kolektiv was portrayed as bad thing (Ironic, given what the companies that funded the game and their oligarch ties)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can not recommend the game but I cant really give reasons why...\n\nSo here is the story: It took me 4 sessions to get past the 2 hour mark in this game\n\nFirst session / Intro: Looks great, sounds interesting\nSecond session: Well its OK, fighting is decent, puzzles are OKish\nThird session: Its kinda repetitive\nFourth session: WTF am I doing here? Did I miss parts of the story? Why is there only like 2 or 3 enemy types? Why ... a lot of things\n\nTo conclude: Even taking aside the enormous price tag of 60 bucks, its just not ... fun?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "movement sucks, loot is even worse. dlcs are riddled with softlocks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If the combat designers had their way you'd spend half the game being repeatedly knocked down on you ass. \n\nIt's a real shame that they did have their way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dear developers,\n\nthe voice acting makes me want to pursue the German culture and disregard the Soviet Union.\n\nLove,\na concerned citizen of the that place.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was willing to give the soviet propaganda a pass, to see what's been cooked with it. It was as fun as unseasoned porridge, and not even as filling. The puzzles require twitchy reflexes, or are far from obvious, until you stumble on the solutions, regular robots were both too fast, and designed goofy. Then we have the wonderful gruffman protagonist, a cliche of anger issues, that gets angry at having to solve puzzles, and at things not going his way. The nail in the coffin was the Plot-driven door, that cannot be opened in any way, except by a series of intricate, and increasingly more convoluted tasks Angery McGruffman needs to fulfill. At some point my time is not worth this, I'm happy for the people that liked it, and sticked to the end, I guess.\n\nI appreciated the originality of the puzzles, even if I did not like them. Also the nymphomaniac upgrade station, its introduction was a chef's kiss moment",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it had some good ideas but none of them were enough \r\nguns feel weak\r\ncombat a chore \r\ngraphics are not very good\r\nand the main caracter ,,,,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wish I knew who produced it. I wouldn't have bought it if I had noticed. \n\nSlava Ukaraini\n\nAs for the game itself: Jesus Christ it takes ages to get to the start of the actual gameplay. This is just such bad game design. Hello, Russkis, I'm trying to play a game, not watch a boring movie glorifying a society that failed and collapsed in 1991. Also, the game relies on quick-time events and deprives you of control at every opportunity. \n\nIt seems Russian game development is as bad as Russian weapon development.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's like if you copied Bioshock and made it extremely boring and cringe",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do yourself a favour and get something like bioshock or generation zero instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just enough to keep me playing yet also making me mad and wanting to rush the main story just to say \"its over\". No one ever stops talking and too fast at that. Its open world Bio Shock and please buy this on sale.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game but controller movement alone killed it for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ">ride in a lil boat thing for 1937 minutes\n>walk around a bit\n>ride in a car for 9274391 more minutes\n>cutscene time\n\nyeah, fuck you dude. not tryina watch a movie here.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played 20 hours and realized it wasnt getting any better. Save your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jesus fckin Christ... what a crappy game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game barely works, constantlly getting stuck in wall puzzles and the melee combat is so clunky. Glad i got it on humble bundle. ID give it a middle score if i could",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cluncky controls and the robot voices are just annoying after some time.\nThe intro mission is also WAY too long.\nI'll check the sequel and hope its more polished",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game literally will not open. i have been trying for MONTHS now to play this game and i can not get past the opening dev credits before the game black screens and boots me off it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is... [i]fine[/i]. The story is somewhat interesting, the world is cool, but for me the gameplay got stale after a while:\r\n\r\n* Combat got boring. I'm fighting the same enemies over and over with little variation. When I get into a larger fight, it's mostly backpedaling while I try to shoot the enemy and dodge attacks.\r\n* The game runs ok on a great machine, but I scaled down to 1080p in order for it to actually be smooth.\r\n* The game is rather buggy, especially with achievements.\r\n* Menus and other systems aren't intuitive to me. Kinda clunky.\r\n\r\nOverall, I don't regret buying or playing the game, but it's hard for me to recommend to anyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "5/10 - Its not a bad game, in some areas its average, good in others. The setting is awesome, I like the visual style too. Combat is kinda average. But I cannot fucking stand the guy we are playing as. The constant fucking unbearable talking. \"Crispy critter\" fucking cringe nonsense, every single conversation is insanely bad. There is way too much dialog too, sometimes even in the middle of combat and it just drags on and on for no reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the few games I would give a middling review to.  The combat is fun, but the puzzles are off-putting (the tree canister is just so...odd), the main character is unlikable, but not in a well written way (continuously saying \"crispy critters\" is annoying) and the open world segments feel half-baked.  Not much to make me want to keep going.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont leave a lot of reviews, but:\nI don't think im gonna finish this. I spent 5 buckaroos on it and im still debating whether it was worth that. The intro segment is relatively solid (although way too long), but as soon as you are dropped into the open world, you have to engage with respawning enemies nearly immediately, with minimal resources to do so.\nI've heard it gets better once you get more ammo/upgrades, but i just dont see myself engaging with the \"just okay\" combat for long enough to get there, and the story is borderline non-existent. Theres only about 4 powers, and one of them is a block.\nOutside of it being a pretty game, and being a pretty neat universe, 6 hours in I'm struggling to find anything redeeming about this title.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Man, I really wanted to like this game. It is very difficult for it not to be compared to Bioshock, but having a weapon in one hand and powers in the other, the comparison is apparent, but it fails short in every conceivable way. If I were to describe this game in one word, it would be awkward. From movement to gameplay to interacting with the world to the uncomfortably over-sexual robot upgrade machine with tentacles that moans for your upgrade materials (yes, really). The underlying game design is also confusing, with seemingly labrynthian dungeons separated by \"open world\" with literally infinitely respawning enemies (google claims that you can later disable this, but it only lasts 40 minutes, what a joke).\r\n\r\nI played enough to know that it is ultimately not for me, and it's a shame, because I find the aesthetic and concepts to be interesting and different (alternative WW2 history with Utopian Soviet Union Communism TM), but the voice actor and writing is atrocious. I have seen other reviewers call it cheesy - no, the dialogue in not cheesy, it is immature and amateurish. Music was awesome at least!\r\n\r\nI got this game in a Humble Choice Bundle and was very excited to play it, but honestly, I would skip it. Not worth your time unless you are extremely patient and particularly interested in the aesthetic.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nice setting, graphics and music.\nThe rest ... meh ...\nWeapons are weak, enemies can be plentiful, storytelling isn't great, BOTH endings are disappointing, [b][i]basic enemies can one-shot you[/i][/b] if you don't do shitty QTE, enemies in open world repop constantly and weapons drops are basically random which mean that I got the Kalash, a pretty basic gun, litterally just before the door leading to the final boss.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The developers need to spend less time jerking each other off over how cinematic their game is and more time making the game playable.   At it's heart it's just another FPS, nothing special.  The overly detailed graphics make it slow, klunky, and jerky.\n\nThis ain't no Half Life, baby.  Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really tried to like it but it feels like someones video game dev class homework.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do all that stuff for nothing \r\nWTF was that ending",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I couldn't get past the main character extremely obnoxious",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gets old pretty fast i dont think this game should have been an open world",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No HDR but they cut 200 voice lines from game???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I couldn't get past the terrible writing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its alright, kinda boring fr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls suck major weenie",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lands closer to Borat than Dostoevsky.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}