{
  "positive": [
    {
      "review": "Very good autobattler with many interesting units, tactics, and good balancing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It isn't nearly as chill and relaxing as you might expect. It's a proper competitive PvP with very in-depth gameplay that is surprisingly adrenaline-heavy\n\nAnd the best part is that every single match is vastly different. Seriously, too many games are designed to be safe and predictable. Nah. No stress-free environment for you. Hard counters everywhere, memorized builds won't save you. There are countless annoying things you can do to each other. Cheesy tactics are also allowed, which is rare these days\n\nToo bad I don't have enough time or energy to fully dive into it after a long busy day",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h3]It always starts innocent: [i]\"Just one more game …\"[/i][/h3]\n\nSuddenly it is 02:30 in the night and I am convincing my friend (who isn't unemployed like me) to join a 2v2 tournament since one was about to start. We obviously get completely demolished, and he ends up with 30 minutes of sleep left before leaving for work.\n\nMechabellum is not just a game.\nIt is a [b]perfectly engineered time vacuum[/b] disguised as tactical warfare.\n\n[hr][/hr]\n[h2]🐺 Rating: [b]9/10[/b] [i]would ruin our sleep schedule again.[/i][/h2]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Excellent game of strategy; a game of counters and counter-counters, with many viable strategies to pursue. Has a fun single-player component ('survival') in addition to the main multiplayer focus.\r\n\r\nI really appreciate this game allowing me to competitively stretch my brain, while not involving the micro inherent in a true RTS.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is for people that:\r\n\r\n- like to learn\r\n- like to think\r\n- own their mistakes and learn from them\r\n\r\nso in that regard this is as real and honest as an auto chess game can be.\r\nDeep gameplay, countless strategies to learn and to explore and a game substance that shows the devs care for nuance and details. Highly recommend! Its worth the price.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Truly amazing adrenaline fun game. \nThis autobattler stands out with mature, high-quality graphics—no childish animations or goofy monsters here. It blends elements of deck-building, war strategy, autobattling, and light economy management into a unique experience.\nThe best part? There’s minimal RNG. When I lose, I can review the replay, replay the turn, and clearly see what I did wrong. I never feel like defeat comes down to luck. If I lose, it’s because the other player was stronger or because I made a mistake—or a series of mistakes—that led to my downfall.\n\nI played a similar game called Minion Masters (more TCG) for years, even though I never really enjoyed the graphics—the colors felt too bright and the UI too childish for my taste. What kept me hooked was the core concept of deck-building combined with autobattler.\nMechabellum takes that foundation and adds a fascinating twist: turns and an economy system that force you to make strategic choices between units and tactics. \n\nYou can win a game even if you lost 3 rounds in a row. There are some snowball tactics, but if you know how to deal with them, there is always the hope of a glorious come back. \n\nIt’s an excellent game, and I truly hope the developers find a sustainable way to monetize it in the long run. £12 is a complete bargain for what you get, even if you play only vs AI or the one turn puzzle games. \n\nUnlike other titles that overwhelm you with hundreds of units, Mechabellum focuses on a smaller roster. The design encourages you to upgrade and adapt units to fulfill different roles, which makes matches less predictable and pushes you to adjust your strategies dynamically. \n\nPROS: \n-\tGraphics and sound design.\n-\tWar strategy with cold calculations between turns and adrenaline rushes viewing the results of your choices in a beautiful and desructive battle.\n-\tDevelopers constantly working on the game, adding units, balancing the game and expanding the ways to play.\n-\tGreat Youtubers to learn startegies and enjoy watching them like RoosterPB, Oddz, Stoney, Yuban…\n-\tThere is a solo game mode to learn how to play before playing online and puzzles to solve.\n-\tAs far as it gets from a pay to win game.\nCONS:\n-\tNot a game to play after a stressful day at work or before going to bed.\n-\tIt takes time to learn the basic strategies, the functions of each unit and the counters to them, but in the long run is what makes the game amazing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Simple to pick up yet deep round based strategy game.  Buy and place your units on the board and then sit back and see if your strategy works.  Am still very much learning 40 hours in.  A wide roster of units and customizable upgrades to these units helps with the depth.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Deep and addicting autobattler, while still being fun as hell to watch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mechabellum is one the few new games that makes your clicks feel like they matter.  The game play feels familiar yet original.   The animations are great.  The game play is reasonably well balanced with consistant updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it! Better than Teamfight Tactics if you want a tactical autobattler.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty simple concept for a game - lay out the pieces and watch the game play out; not a significant learning curve and doesn't require a demanding system. Can lose yourself in the detail and work out exact pros/cons of placement and unit strengths/weaknesses, but (for me) stay within the low tiers and just enjoy the games win or lose.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game!\r\n\r\nFor me it's Go+Poker+Starcraft\r\nGo: positioning on board turn-by-turn as response on your opponent placements.\r\nPoker: Dealing cards between rounds which can significant impact on matchup.\r\nStarcraft: setting and some gameplay principles, like importance of economy, units composition, counters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This one was suggested by a friend, and I've been enjoying playing together (especially for the weekend tournaments!) and on my own sometimes too. At first look it wasn't the sort of game I'd go for by myself, but I've surprisingly enjoyed it so far. There are options for casual players and those who want to play more seriously and competitively now which is nice! \r\n\r\nThere are plenty of units that are better and worse at different things. You'll probably have your favourites. Some are strong/weak against the others, like a more expansive game of rock paper scissors. Then throw in unit placement (as this is an autobattler), unit speeds, unit/spell drops between rounds, and there's plenty of strategy to mess with. It's something you pick up over time, and I've been enjoying the learning process. There's a free battlepass with little rewards to earn just by playing (combat power) and I think you can still get stuff later even if you missed it. So you've not 'missed out' by joining now if you're thinking to pick up the game :).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like auto-battlers where you have to think about which units to get and where to place them each turn, then you'll like this game. It can be frustrating at times, but I still find myself coming back and playing every day for a few matches. Well worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, Mechabellum is one of the best auto-battlers on the market right now.\nThe gameplay feels fresh and addictive, especially when experimenting with unit synergies and new tactics. However, once you climb to higher MMRs, the experience starts to feel more frustrating than fun. \n\nThe game has some serious balance issues. if you don’t play the meta, you’re almost guaranteed to lose rank. Instead of balancing the units, the developers tend to add even more unbalanced units and stupid map obstacles (those buildings that most of the community, myself included, hate!).\n\nAnyway, if you’re looking for a unique auto-battler, it's still worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A autobattler that's a bit overwhelming at first glance but a friend helped me learn the basics and now I'm really enjoying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game, a combination of chess and star craft. with a very interesting and fun pvp map layout(s) \r\nif you like starcraft and battle tactics, its a very well worth game to buy and play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mechabellum is a hidden gem that blends strategy and mech combat in the most satisfying way. The tactical depth is insane building and customizing your army of mechs, choosing the right units for the right situation, and outsmarting your opponents feels so rewarding.\r\nThe fast-paced matches keep you on your toes, and the progression system offers a lot of room for experimentation with different strategies. Plus, the mech designs? Absolutely awesome.\r\nIf you love games that challenge your strategic thinking and let you unleash epic robot battles, Mechabellum is a must-play. Every match is different, and it’s always a blast to watch your mechs obliterate everything in their path. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Starting, but first impressions are great. Easy game to get into, (quite a bit) hard to master.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unique and utterly satisfying auto-battler. Enough tactical approach mixed with tech to top your usual auto-battler. I'm just going to keep sinking hours, Devs deserve it with constant updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. I have throughly enjoyed the asymetrical chess match appeal. Fun when you can make a great comeback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took me 100 hours to feel like an intermediate player and fundamentally understand the purpose of each unit. Great game, and has lots of depth in the ways you can strategize. Countering your opponent's army with good tactical choices is very satisfying, while losing to your opponents can serve as important learning experiences. The game has a good balance of composing your own army, predicting your opponent's next move, and choosing (or skipping) the right 'wildcards' that appear every round. If you like strategy games like this, this game is a steal for the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely satisfying game, though, with around a hundred players online. Thankfully, region and ping means nothing as it is an autobattler. I just hope developers make another game like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to this day the game is good and updates making it even better .. if you like autobattle game you would like this one for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and fast to get in on the action. This game has a surprising amount of depth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive fun game, easy to pick up and play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cool little autobattler with a lot of depth to its tactical choices. Survival mode is really fun and addictive with a dash of roguelite feel!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun little autobattler, addicting as hell. All my hours are offline with bots, i've played maybe 3 multiplayer matches total.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I see a lot of negative reviews coming from older players. I can't speak to how the game may how degraded it's experience. But as someone that came in after all those changes happened, I am still finding the game to be massively enjoyable as a casual.\r\n\r\n I think the peak experience with this game is playing it at the same time with a friend so you can both learn at the same time and counter each other's strategies. \r\n\r\nHonestly, most fun I've had with a game in a good long while. If you can pick it up with a friend to play 1v1s, do it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard for first hour of play, Watched a couple of YT videos and learned a bunch.  Made game very engaging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hell yeah! No pay to win. Pay once and play the full game, Devs are constantly working. Easy to play, and incredible hard to master. The best autobattler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bounced off it at first, but then it got under my skin once I figured out what the different units actually do. Highly recommend for anyone looking for some strategy with quick and fair matches.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I defeinitely prefer more low stakes gaming these days... Mechabellum has a pretty busy and dedicated competitive scene but Ive really only played one 1v1 match and that was enough stress for me. There are single player modes that are fun and fresh. like good turn your brain off fun and theres even a 4 person ffa mode if i feel the need for some low stakes pvp chaos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is hot and horny. a mix of endless skill, matchups, and luck op",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been a frustrating few months for the game but it looks like they're about to start making some good updates in the future so I'm changing my review back to a positive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very enjoyable.  Does have a steep learning curve to get started, but with a casual mode that gives rewards, it's still good.\n\nLots of negative reviews are either bashing dev's for:\nA)  Building updates.  Change is good, it keeps things interesting so you can't play the same strat everytime \nor \nB)  RNG.  This is the only thing that keeps games like this from being rock/paper/scissors.  I wish there was more RNG so every game required adaptation instead of forcing popular builds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really scratched an itch I didn’t even realize I had. It’s a lot of fun to play and constantly makes me think about new ideas and strategies to defeat my opponents. I love that the developers continue to add new units—it keeps things fresh and exciting. It’s also great that I can watch something on the side while playing, kind of like a more in-depth version of auto chess, in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I made a game called \"terminal\" that was a simultaneous-turn pvp tower defense with some similarities to this game, but it was for a company that used it to test coding ability by making people code algorithms to play the game.\n\nIt came out very good, so I thought \"Should I make a pure human vs human version of my game\"?\n\nNow I don't have to. This game is so great I feel I have no need to make my own version myself! Which is good because I have too many other projects I could work on instead.\n\nWell balanced. No artificial \"counters\". Lots of tactics and depth. Easy to understand controls and mechanics. Constantly evolving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an auto battler where its best to know whats good against what pretty standard but its alot of fun.  The unit diversity makes things interesting and I like the RNG for keeping things interesting although it can be a bit of a turn off for some.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible auto-battler, so much to learn, can only get better as the user base grows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun auto battler. Tons of strategy and choice all without it being unbalanced. If you lose, it's because the other person beat you, not some random RNG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't think I've ever put in so many hours and still been this bad at a game.  I do love it, but haven't played in a long time because I just don't have what it takes to git gud at it.  I've heard the buildings are pretty divisive and the player count is tapering down as a result, but I hope they turn it around.  I'd like to see the game survive, I really do think it's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Spiritual successor of Desert Strike/Direct Strike from the starcraft arcade maps.\r\nIt's different, it's chill, it's good. Design is lame in my opinion lol, but the game mechanics are great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was really fun up to about 1000-1200 elo. At which point you need to start playing pretty specific units that are strong in this particular patch and doing constant meta homework. Unfortunately the AI bot is really boring to play against too. Still a lot of fun for the price, might go back one day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Introduction\n\nA very well-made game about battles between units of the future, mechs and robots.\n\nGameplay : 4/5\nGraphics : 5/5\nMusic : 4/5\nSound Effects : 5/5\nVoice Over Narrations : -\nStoryline: 1/5\n\nOveral Note : 4/5\n\nPositive :\n\nA wide selection of units, refined graphics, sounds, and special effects. \nAbility to add technological attributes to units.\n\nNegative :\n\nFor me, I was hoping for quick 3-5 rounds of player-to-player duels, but unfortunately, they're just a grind over 10 rounds to finish.\nAfter round 10, it's hard to control everything; there's no time for unit promotions, and it's less about strategy and more about fast-clicking, arcade-style gameplay.\n\nThe game plays differently, with shorter and more satisfying fights.\n\nOveral Review :\n\nIt was interesting to play.\n\nThe ability to customize units creates interesting configurations. Unfortunately, aside from the gameplay, the game also consumes the player's time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "oyun güzel mekanikler iyi herşey çok güzel bayram havasıda şu ANASININ AMINI SİKTİĞİMİN SOLO MODUNDA BAŞLANGIÇDA BANA KÜRTÜN EŞEĞİNİ VERMEK YERİNE NEYLE BAŞLIYCAMI SEÇEBİLİRMİYİM AMINIDA YUMURTA ÇIRPTIKLARIM karşıma başlangıç ordusu olarak herif rokeçileri olan hem tek hedefe iyi vurabilen askerleri olan hemde piyadesi olan ordu koyuyo karşıma BENDE NE VAR AMINAKOYUM PİYADE DIŞINDA BİŞEYLE KARŞILAŞINCA SİKİ İNEN BÜYÜK ŞEHİR BELEDİYESİ ÇÖP TENEKESİYLE AWPYLE MİDİ KESEN TESLA BOT ANAYIN AMI",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a big fan of autobattlers, or PvP, but I love mechabellum. Probably an unpopular opinion but I think some more PvE modes would be great!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun learning how to counter different mechs and strategies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"YES, that worked exactly how I thought it would! :D \"\r\n\"OOF, that didn't work at all how I thought it would! D: \" \r\nBoth are enjoyable, and this game is great for giving instant feedback on your ideas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much deeper and more strategic than I realized at first. Still learning.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imho, the only autobattler even worth bothering with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got invited to play in a tournament hosted by MAG1 with a bunch of other newer players and had a blast.\r\n\r\nThis reminds me of the tug of war style games from Starcraft 2 Arcade \"Direct Strike\" I think it was called.\r\n\r\nI only have a few hours into the game but have enjoyed every hour so far. If you enjoy these \"auto battle\" types of games or you come from SC2 Arcade, you will most likely love this game.\r\n\r\nIt does have a bit of RNG at the start of rounds but other than that it's great fun, especially with friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Like an old UMS from Starcraft.  Quick matches that take a few minutes and you can do without sinking huge amounts of time into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun mech based auto-battler with a fun variety",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starcraft, but people with human reaction times can play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is like The Modern chess of our century!\n\namazingly strategic.\ni like how u can plan every movement and understand how each unit will move.\nthe developers is very genius too! and lack greed - they are not trying to milk you of all your money.\nbest use of my money - money well spent! \n\ni cant wait to see how this game will be like in 2-3 more years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice and bomby battlesimulater",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best competitive autobattler game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "149 hours played and i'm still learning.  it's a nice auto battler with plenty of strategy. Everything has a counter and you can even customize your unit's perks. I recommend it for sure.\r\nSpecially if you like to lose a lot and learn through losing and won't give up no matter what then it's a perfect game. this one packs a challenge. somehow takes so long time to get any good. usually such games are simple winfest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been hooked ever since my friend introduced me. A great blend of autobattler, RTS and turn-based gameplay, a deep meta with lots of weird builds to assemble, and no two games are ever the same.,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun, loads of strategies. Great ways to come come back when behind. Non predatory game mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unique Autobattler with just enough depth to keep it interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent game, im glad i had a chance to get back in after a year hiatus!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game to play when you have time for a short round or two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill autobattle mech game is cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good, shame more people do not play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, lots of fun if you like auto chess games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, worth the cost imo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "mechs fighting mechs, good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best robot game I have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun lots of updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool autobattler with robots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well designed and balanced game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New update with buildings is cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Auto-battler masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good auto battler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RTS for old people",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of fun, quick games!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Laser + robots = good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "robots are cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect casual mayhem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can fight robots, that's kinda cool.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best autobattler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bobots heck yeah love the mech feet",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lllllllllove it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best auto battler out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "y eah sick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baldej",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Hi, 2k mmr tons of hours, active player and member of community, former streamer here. Core gaemplay is one of the best I've ever seen. Game is very hard to understand, but it is very additcive and satisfying. Now the only reason this review is negative is because of lack of trust into developers team. Game has issues, like any other does, but any feedback regarding these said issues is blatanly ignored. I was an active player since the chaos patch in beta, season 1 and season 2, posted numerous feedback reports about game balance an QoL, possible solutions, even was a part of a team that beta-tested upcoming big patches. My main complaints were card duplications, involvment of true RNG (not pseudo RNG, like in most other games), round 0 mulligan system (or rather, absense of), UI being crap and glaring lack of QoL (WE DON'T EVEN HAVE HOTKEYS, CAN YOU BELIEVE THAT?). Any time that I've pinpointed exact issues that could've been solved in a day, a week at worst, I've been told that \"devs do not have time to fix that right now, because there are some new units in development, they've been busy!\". Fine. I'll wait for all new units to be developed and then come back to see what's up. For that reason, skipped season 3 entirely, season 4 was supposed to be a \"QoL and balance fixing\" season, but I've skipped that too and came back in current season, season 5, which is also was supposed to be all about \"QoL and balance\". After half of year, I see players complain about very same issues I was talking about half a year ago, and NONE OF THEM GOT FIXED. \nNOT. A. SINGLE. ONE!\nNow comes the question, if devs had any time in the world to fix their crap and put it together, wth were they doing? Honestly, no idea, but probably new cool and awesome and epic 100 emoji buildings feature ate all work hours. Buildings were supposed to fix early game problems, except they do not, but created new glaring issues instead, like restricting player's freedom in early rounds and dictating what you suppose to do and what units to play to not be bailed out of the match in next 10 minutes with negative HP. So now on top of old issues, that were not even remotely fixed, we have new issues that came up with buildings patch, but devs can't say that \"buildings bad\" because they (maybe) worked hard on them and it will create a bad picture of them for everyone around. Result of this absolute clownfiesta and festival of incompetence is a 35-45% decline of player base since september. Feedback is still being constantly ignored, there was a promise to fix whopping one issue, namely starting packs, in season 6, but come on now. You had 6 months to do that and achieved nothing. Every time I see once-in-a-eon devs Q&A sessions, or developer streams, I feel like my intellegence and critical thinking are being questioned. Oh and once again we are promised with two new units, so I guess the \"developers are busy now\" argument will come up once again and I hate it. Honestly it feels like developers took 6-month break from the game too, then came up with buildings \"solution\" in last hour, plop it in game client and of course it flopped. \n\nI am tired of waiting for easy and obvious solutions to be made, and every time when it feels like that current patch is great and the game is very close to be great, devs find a way to screw everything up with yet another stupid decision. It is a neverending loop of \"we have an issue\" -> \"we do not have enough time to fix an issue\" -> \"we implement a thing noone asked for to supposedly fix that issue\" -> \"now that new thing has an issue\". Game itself is great, but decisions been made about the game are awful, feedback is ignored, changes are either slow or straight up harmful. Mechabellum is like a very delicious chocolate brownie, but when you take a big bite to taste that chocolate inside you realise, that it's actually not chocolate, but some other organic brown substance instead.",
      "voted_up": false,
      "votes_helpful": 122
    },
    {
      "review": "After playing this game for years and even though it was a really good game which i thought would have a bright future, I changed my mind on this. It's still a good game for what it is and you will probably get your money worth in hours played, but unfortunately the devs are completely deaf to what the community is asking for.\r\n\r\nIt took them 2 years to put an undo button into the game. 2 Years to add the functionality of finding your steam friends. 1 Year to put in a speed up button so you don't have to watch a pack of phoenix shoot a pack of crawler for 1 minute straight, cause your opponent doesn't have anti air left in an early round.\r\n\r\nNow they added buildings and most people hate them. What's the developers response? Adding more buildings.\r\n\r\nDon't get me wrong, they also added a bunch of new cool units to the game. But that's it. The new units are the only good addition.\r\nGameplaywise the game has been completely stagnant and QoL improvements are extremely slowly being implemented.\r\n\r\nI hope that the devs will realise that the current direction and focus is not very well received.\r\nAt the moment I cannot recommend the game. Not because of the game itself, but because of the devs.",
      "voted_up": false,
      "votes_helpful": 73
    },
    {
      "review": "I've played, streamed, and been involved in the Mechabellum since release. I always thought the game would eventually get all the QOL, features, and hype it deserved for being such an awesome game! \r\n\r\nUnfortunately, 2.5 years after release, it doesn't seem like that is ever going to be the case. QOL additions to the game have been single digit, developer stance towards community feedback after major milestones like Unit Drop & Buildings release has ranged from empty words & promises at best to completely tone deaf at worst. \r\n\r\nI myself and almost no one I know in the community believes the developer is listening to and believes in the community's feedback around new features (or lack thereof). One only has to look as far as the daily average users on Steam to see how many people clearly feel the same about the future of the game after Buildings release. \r\n\r\nI would love to see Mechabellum succeed and think its an awesome game at its core that I've enjoyed greatly for a long time but I cannot recommend it to any new or returning players. Not because of the game itself, but because of the deplorable attitude & inaction displayed by the developer.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I’ve played Mechabellum for over 2.5 years and poured more than 3,000 hours into it. At its best, this game was one of the most competitive and rewarding experiences I’ve ever had. Every win and loss felt earned, every decision mattered, and the only person you could blame for defeat was yourself. Along the way, I met an incredible community of players who shared that same passion and respect for the game’s depth.\n\nUnfortunately, it’s hard to say the same about the developer’s approach to the community. From the start, it’s been clear that player feedback hasn’t carried much weight. The most recent updates, particularly the introduction of buildings, highlight this disconnect. It was an extremely polarizing change that could have benefited from proper testing on the public test server before going live. Instead, it feels like we’re watching a great game slowly lose its identity in real time.\n\nMany long-requested quality-of-life improvements and creative additions  have been ignored. Instead, the game’s direction seems to focus on “fixing” problems nobody asked to be fixed, while removing the strategic freedom that made Mechabellum special in the first place.\n\nI’m disappointed because I still believe Mechabellum could thrive again with the right priorities: respect for the community’s insight, proper testing, and a focus on the core experience that made it great. But until then, it’s hard to recommend the game in its current state.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "You'll play this game to a point, before everything boils down to building specifc teams suich as Marksman + Mountain, As if the game has been \"solved\".\n\nThe variation for me has lost it's novelty/",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has a good core, but the devs don't listen to the community and feel they need to constantly add new features and units even if those features are unwanted and undercooked. New units even though they slowly but surely make balance more difficult and the new player experience less approachable. New features like buildings, which I think are redeemable, but currently lackluster... and that all comes at the cost of that core gameplay which I enjoy remaining unpolished and slowly disappearing underneath titans, spells, poorly balanced starting packs, etc.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Originally was  a very neat concept but after my playtime and questionable updates this game is broke and people don't wanna aknowledge it, they pretend its skillful and just a skill issue for a unit that has such high dmg, health and range for something with 15 meters of splash is somehow balenced. i have never been so annoyed at a game dev team then this mongrels from china bruh, they even mention \"it seems to do better at lower MMR\" yet i was mid grade and every ground match is shut down by one of these busted units only to be spammed more and more with upgrades and whatever unit u maybe thinking to counter is already countered by the rest of the army comp. even if you go air its no go because these guys get to put one other busted unit ( AA marks men) and ur entire comps cooked these guys have no idea what their doing anymore just another slop filled game that only blesses meta players with RNG and completely removes the concept of free unit choice that may or may not work this games awful and everyone that plays it is egotistical how 2 play garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The buildings have been making the game less enjoyable, less varied, and less interesting even to watch.  they have been in the game for a long time and it has become painfully obvious to everyone else that keeping them in is not healthy for the game and development needs to cut their losses.  They are personally making me want to quit the game.  please remove buildings and bring back the other 70% of the game.  possibly bring a reworked version back for testing in the PTB, but they need to not be in the base game in their current state. I will update this to a positive review when this is resolved and the game becomes any amount more enjoyable or interesting. i used to really enjoy this game and have faith that they can learn from this mistake and make good decisions moving forward, they have made plenty of good decisions in the past and shown that they are capable, they just have to be willing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "What started out as a thoughtful, positional chess game has turned in to a dismal card drop game.\nIt's really sad - it had so much promise.\n\nAlso - they use disguised bots/Ai everywhere....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is supposed to be a strategy auto-battler, yet the thing that has the greatest impact in the game is RNG. In literally every part of the game too.\n\nIt starts with the character and your starting units packs, both of which you pick at the start of the match. Both are picked blindly, i.e. what your opponent has is pretty much random, and have very one sided match ups. Then there's the initial positioning of your units, which is also blind, i.e. what positioning you're up against is basically random too. From there the game usually just snowballs. The only thing that can then save your opponent or yourself, is usually getting the right Unit drops or Spells to salvage the situation. Both of those are up to your choice, but are picked out of a, surprise, randomised subset of what's available in the game overall. Didn't roll the right options to choose from with respect to the current game state? Guess that's a loss then!\n\nSo, aside from learning some basic things, like not putting your vulnerable DPS units in front of your cannon fodder and what unit counters what other unit, there isn't much you can do that actually seems to matter. Because of this wins usually feel like you [i]didn't[/i] do anything and losses feel like you [i]couldn't[/i] do anything.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "received this game for free to participate in a private tournament, 12 people were rug-pulled when the terms of the prize pool were changed after the winner had been determined, who was also allowed to determine payouts for all participants\r\n\r\nthe game itself is moderately fun though lacks a comprehensive tutorial and is not beginner friendly",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: They reinvented \"chess\" and made \"fancy chess\". But then they added a nerfed game breaking unit that converts units almost instantly,  and keep buffing it.  They also seem to be trying to turn a 20-30minute match into an hour long match by adding more and more tiers of units. They had a good \"fancy chess\" game, but it is quickly spiraling into a convoluted mess that requires the use of units that are no fun to play that counter literally every strategy simply by stealing all their opponents units. And the way the math works out, you \"can't\" steal your unit back.  \n\nThis game seems to be suffering from \"exponential power\"; I started at the end of season 1, and i think its on season 5 now (id look, but i just uninstalled). As they add units, the new units are \"over-tuned\" to get players to use them (i don't like it, but it's a necessary evil) and the devs are pretty good about balancing after a couple weeks. Even with the unneeded class of \"titan\" units (tier 5), there are tier 4 (giant) units that can be used to counter them.  But this is kind of where the issue starts to show its teeth. Instead of being a \"chess like\" or \"rock-paper-scissors\" style game, the added units make it a \"rock-paper-scissors-dynamite\" game, but dynamite is OP for winning 2* battles, so they make it \"rock-paper-scissors-dynamite-water\", but water also defeats paper, so now they tune \"paper\" to \"laminated paper\" but now scissors struggles to win against paper, so they add a new unit called paper weight, but then it has its problems and throws the balance out even further, and so on. \n\nBut the main reason I uninstalled was the over tuning of a previously unused unit: the hacker. It used to be an unused unit because it would take forever to \"hack\" a unit, and it had fairly limited range and very little HP, and was generally countered \"naturally\" while countering other units. At some point around season 3? (i remember reading the patch notes, but dk when) they started trying to make it a relevant unit. in doing so, they made it one of the single most powerful units in the game. Its whole thing is that it can \"hack\" a unit and make it permanently* switch sides(unless it is hacked back) and for a few credits more, it will not only hack, but instantly heal that unit back to full health. Either one of those is kind of OP, but add the affect of causing all your units (that are close enough to fire on the hacked unit) to break contact with w/e they are currently shooting, to stop, turn, and then start shooting at the hacked unit.  And with the tuning of the \"hacker\" they made it so a Level 3 hacker can hack t5 units in about 4 seconds, t4 in about 1.5, t3 in less than 1.   The ONLY* way to counter this is to also add your own hackers, however, there are certain starting cards (each side gets different ones) and round cards (each side gets the same) that can cause one side to have an un-countereable advantage, and this isn't a \"if the stars align\" scenario, this is a \"1 in 5 matches\" scenario, if not more.  Air units were a potential counter, however, there are so many units that counter air,  that they might as well not be considered be a counter.  And the way the math works out, if they hack your unit, you \"can't\" hack it back because it will turn and obliterate your hacker before it can be hacked back. And setting up your hacker to recapture your own units requires you to spend a whole turn focused on that, which sets off an unstoppable chain-reaction spiral.\n\nIn summary, I liked the game, and liked the way that it was headed. However, one side being able to deploy an over tuned unit significantly earlier than the other side, and that unit keeps getting buffed, or supporting units that make it literally un-counterable made this game not fun.  IDC about the Titan unit that can be dropped on round 2 that can stand in the back and kill both chaff/swarm units and heavy units, anywhere on the map, without moving.  But having a unit that can capture/convert equal tier or higher units to full heath in less 2 seconds completely breaks the game because unless you are prepared for that strategy ahead of time, there is no way to counter it. (and by preparing for that one strategy, it leaves you wide open to several other strategies.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "half assed structures and unit cards ruined what was once a solid auto battler.  I guess i cant complain.  I got my moneys worth when it was fun lol.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Skip this game, If you want to hate your life in \"stratagy\" PVP just play league of legends, you don't need this addiction. Full of BS cheese abilities, RNG, and hidden mechanics that aren't clear in tool tips. I regret all 478.8 hrs I've played this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "0 Balanced.\nIts not about difficulty when you make the AI in Survival go from full ground to full air in 1 round with literally OP stuff that cant be beaten. you can and will get completely countered and loose everything in 1 round just because the ai felt like you loose now. unless u follow the 1-5 meta units for that mode.\nI keep beating the \"insane\" ai in a normal match no problems.\nfrustration and draw a lucky one in \"survival\" is no survival. its gamba and hopeium\nSo i did try now for multiple hours again, different comps,upgrades etc. tried to do what people did b4. devs apparently tuned it into dogshit oblivon. i played alot of games in my life but i never ran into a brick wall like that. its retarded. round 8-12 its over. holy jesus what a trash game this is when u make a mode and only 1-2 comps (if even) seem to work in survival then why bother making this mode? 0 satisfaction from beating lower difficultys.\nwell 20~ hours 10 bucks its ok i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck your stupid game hiding MMR in 2 v2 almost always i get a team with 500 mmr less vs a team with 500 more then me usually i would leave que cause its dogshit match making but now you hide mmr in game and i just lose because your dog shit mmr match making how about fix that before you hide mmr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was a lot fun.  Now there's so many strategies that are annoying and tedious to play against with is the opposite reason for why I play games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really unbalance and luck depended. dev don't care.\nafter 30 round in a row of the game hating me and giving the enemy perfect counters (for example giving a sabertooth tank spamer 3 30% upgrade cards + 1 fortified mustang card so i will not be able to counter with air units) and losing 800 MMR (in game rating) i can not say this game and my luck are not after me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "On my PC it works great! but when im traveling I have my Macbook and for some reason it does not run. I am constantly getting an error. It says its able to be played of MacOs but it doesnt seem like it in reality.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A friend introduced me to this game about a year ago. Would I recommend it today? Hell no. Save your money and look for your mech fix somewhere else",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game had potential. Developers don't care at all about the player base. They push a half baked building patch that adds no value to the game but ruins a lot of the dynamic elements. Overwhelmingly unliked by current player base. Shedding players like crazy and they do nothing to update or improve the situation 2 patches later.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game at low levels is luck, and three units. \r\nIt is already dying\r\nJust find something else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was a great game with a certain dose of problems (like any game) that sadly thru the years was becoming worse and worse. Right now do not bother with it if u want to feel any agency in the game as everything is just rng simulator:\n- what units u start with? - random (you pick one of 4 starting packs out of set pool of them at the start of the match and you have no control which ones you get, no ability to set preference or ban units u dont like. You can also have the same unit offered in all 4 options so if you dont like it - tough life, enjoy playing entire match from behind)\n- what is the layout of buildings you start with? - random\n- what cards and reinforcments you get during the game? -random \n- unit's movement and attacking pattern? - random (No, I am not making this up, if both you and your enemy have the same unit with the same upgrades, lets say phoenix or rhino, met on the battlefield they will not kill each other, one will attack before the other and you can lose PERFECT mirror match bc devs thought it is \"fun\" to have random delay in units attacks)\n\nAnd unfortunately this is all by design, balancing of the game is done mostly on the basics of some mythical statistics, which developers refuse to share with the community, that are very unreliable in a game with so much rng so it takes takes literal months to get even most obvious balancing issues addressed. (unit can be so op it has 100% playrate in most competitive tournament in the game and devs are like \"nah this is fine, our stats show this unit is not op, best we can do is 5% hp \"nerf\" so people stop complaining\")",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fuck this fucking game, everyone who plays it is a bastard. I am only because I still play it. I hope the devs shit their pants while giving a public presentation. I hope the opponent to whom I just lost gets every vertebrae plucked out one at a time by a flamingo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-esc key doesn't work, doesn't work for ANYTHING, its a completely wasted key, you have to ACTUALLY click on the settings button to open the settings window like were back in 1995 using windows 0 home vista PS1, nonfunction ESC key edition\n\n-bad controls with no remapping available, they have rotating unit placements with the \"T\" key instead of the obvious \"R\" key, im trying not to be disrespectful but come on guys... T key? you got to be joking... R key is widely known as \"rotate\" and is a key MUCH closer to your WASD resting position\n\n-once you hit the \"speed up\": time button, it breaks and you can't slow time back down\n\n-constant nonstop loading screens during tutorial missions for what should be just a easy match reset\n\n-with music turned off game is deadly silent, not even foot steps of your metal million pound heavy mechs, they tip toe with cat feet, until a explosion occurs and your speakers explode with it (bad auido)\n\nthe game is SO CLOSE to being cool, but once again its as if devs are overly rigid in their vision and destroy a game's potential, the units and combat all seem awesome but the UI/controls with pretty much ZERO in-game settings to fine tune your user preferences and definitely ZERO remapping available to just so painful. The bad audio i can forgive, but the back controls just hurts to much to operate with\n\nill give it a few tries maybe i'll change my mind and im not being open minded enough myself, but idk\n\nwas going to do a positive review for trying, and giving us the option to disable edge panning, which im thankful for, but making the rotate formation key be T when its begging to be R is just unforgivable\n\n2nd time trying, guess what ESC key STILL doesn't work\n\nvirtually no player base, no coop vs ai potential, almost no solo vs ai available, game is set up for multiplayer and doesn't care at all about basic PVE\n\n- ten thumbs down the game is SOOOO SILENT!, literally zero foot steps, zero mechanical sounds NOTHING, at least 50% of gamers automatically turn off music for game by default, its a normal action, but when your game has no effects volume it is so unbareable \n\n\"only newly recuited units can be moved\" is just a awful color and pencil thin font size you can barely see the text, and even if you can see it, it shows up for only .5 seconds, not even know time to read it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After a while of playing this game, the devs have decided to ruin the game by adding static buildings which force your hand to a great extent. The reasoning behind the buildings was to slow down the first round. But all it's done is make the game static and boring. Not worth buying in it's current state",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the meta is stale as all fuck, its so easy to get utterly steam rolled.......do not recomend at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this latest patch on the 29th broke the game, its not fun now. gg's was fun while it lasted",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a good game but i get disconnected trying to play single player practice skirmishes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's pretty but the balancing needs work",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot connect to server.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Despise Buildings.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Garbage..very unbalanced",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ";ajlksj;klasdlk",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hi, 2k mmr tons of hours, active player and member of community, former streamer here. Core gaemplay is one of the best I've ever seen. Game is very hard to understand, but it is very additcive and satisfying. Now the only reason this review is negative is because of lack of trust into developers team. Game has issues, like any other does, but any feedback regarding these said issues is blatanly ignored. I was an active player since the chaos patch in beta, season 1 and season 2, posted numerous feedback reports about game balance an QoL, possible solutions, even was a part of a team that beta-tested upcoming big patches. My main complaints were card duplications, involvment of true RNG (not pseudo RNG, like in most other games), round 0 mulligan system (or rather, absense of), UI being crap and glaring lack of QoL (WE DON'T EVEN HAVE HOTKEYS, CAN YOU BELIEVE THAT?). Any time that I've pinpointed exact issues that could've been solved in a day, a week at worst, I've been told that \"devs do not have time to fix that right now, because there are some new units in development, they've been busy!\". Fine. I'll wait for all new units to be developed and then come back to see what's up. For that reason, skipped season 3 entirely, season 4 was supposed to be a \"QoL and balance fixing\" season, but I've skipped that too and came back in current season, season 5, which is also was supposed to be all about \"QoL and balance\". After half of year, I see players complain about very same issues I was talking about half a year ago, and NONE OF THEM GOT FIXED. \nNOT. A. SINGLE. ONE!\nNow comes the question, if devs had any time in the world to fix their crap and put it together, wth were they doing? Honestly, no idea, but probably new cool and awesome and epic 100 emoji buildings feature ate all work hours. Buildings were supposed to fix early game problems, except they do not, but created new glaring issues instead, like restricting player's freedom in early rounds and dictating what you suppose to do and what units to play to not be bailed out of the match in next 10 minutes with negative HP. So now on top of old issues, that were not even remotely fixed, we have new issues that came up with buildings patch, but devs can't say that \"buildings bad\" because they (maybe) worked hard on them and it will create a bad picture of them for everyone around. Result of this absolute clownfiesta and festival of incompetence is a 35-45% decline of player base since september. Feedback is still being constantly ignored, there was a promise to fix whopping one issue, namely starting packs, in season 6, but come on now. You had 6 months to do that and achieved nothing. Every time I see once-in-a-eon devs Q&A sessions, or developer streams, I feel like my intellegence and critical thinking are being questioned. Oh and once again we are promised with two new units, so I guess the \"developers are busy now\" argument will come up once again and I hate it. Honestly it feels like developers took 6-month break from the game too, then came up with buildings \"solution\" in last hour, plop it in game client and of course it flopped. \n\nI am tired of waiting for easy and obvious solutions to be made, and every time when it feels like that current patch is great and the game is very close to be great, devs find a way to screw everything up with yet another stupid decision. It is a neverending loop of \"we have an issue\" -> \"we do not have enough time to fix an issue\" -> \"we implement a thing noone asked for to supposedly fix that issue\" -> \"now that new thing has an issue\". Game itself is great, but decisions been made about the game are awful, feedback is ignored, changes are either slow or straight up harmful. Mechabellum is like a very delicious chocolate brownie, but when you take a big bite to taste that chocolate inside you realise, that it's actually not chocolate, but some other organic brown substance instead.",
      "voted_up": false,
      "votes_helpful": 148
    },
    {
      "review": "After playing this game for years and even though it was a really good game which i thought would have a bright future, I changed my mind on this. It's still a good game for what it is and you will probably get your money worth in hours played, but unfortunately the devs are completely deaf to what the community is asking for.\r\n\r\nIt took them 2 years to put an undo button into the game. 2 Years to add the functionality of finding your steam friends. 1 Year to put in a speed up button so you don't have to watch a pack of phoenix shoot a pack of crawler for 1 minute straight, cause your opponent doesn't have anti air left in an early round.\r\n\r\nNow they added buildings and most people hate them. What's the developers response? Adding more buildings.\r\n\r\nDon't get me wrong, they also added a bunch of new cool units to the game. But that's it. The new units are the only good addition.\r\nGameplaywise the game has been completely stagnant and QoL improvements are extremely slowly being implemented.\r\n\r\nI hope that the devs will realise that the current direction and focus is not very well received.\r\nAt the moment I cannot recommend the game. Not because of the game itself, but because of the devs.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Game was very good but it feels like they've lost their way. The addition of buildings really feels like unnecessary noise on the battlefield. I think with the apparent pressure to keep adding stuff to the game a certain elegance has been lost. Seems like an example of a game that didn't need to keep changing -- or maybe needed some kind of systemic refresh -- seasonal units or battlefield modifiers or some way to shake things up that doesn't just add noise to an already very deep system.\n\nA bit heartbreaking to be honest -- was very fun watching robots go boom.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Once a great game, ruined by devs who made random updates that introduced pointless RNG that killed the entire population of the game.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "I do not review much.\n\nPlay this is the background while I do other things.\n\nGet too around masters each season,\n\nComeback after a bit of a break and hiatus. This \"update\" with buildings and turrets? Absolutely gutted the game-play flow that made this enticing.\n\nThey are forced training wheels that absolutely prevent any strategy or flow momentum. Horrible implementation and addition which only favours SLOW clunky game play. Eliminated 80% of all strategy and build orders.\n\nThis HAD a beautiful rogue-like element and counter system now is completely gutted, with most games early round are won or lost with marginal exchanges. ONE missile ONE shield ONE attack / counter. Now your units and abilities will waste attacks and DPS.\n\nBUT; it felt AMAZING countering and coming back from opponent decisions and surprise upgrades.\n\nFlanking, sideline pressure, decisive concave, melee units, many upgrades all worthless. Just play ranged, slow methodical game-play every time right?\n\nIf these are going core game-play. They need to be placed and purchased just like everything else and reworked.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "I liked this game way more than I expected, but I really can't recommend it to anyone anymore.  I feel like the last few updates have been slowly making it less fun.  Mountains, the walls/turrets, making a casual mode but still using the same queue that competitive games use.  I just find myself getting off after a game or two now or not starting up the game at all.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Prime example of how to ruin an amazing game in a single patch. I'll be back when they get rid of the turrets and walls. Until then, avoid the game.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I played Mechabellum pretty regularly until the second patch for the building update came out and have put it down for now due to frustrating design decisions. You'll see a lot of people complaining about buildings in the reviews. Many of these will be dismissed by the community as those who love to play \"aggro\" (essentially a very aggressive playstyle on one side of the board making many matches feel like a coin toss) but I don't play aggro and I'm still unhappy with the state of the game. Buildings were supposed to help fix issues related to early game problems to try and make it a bit more balanced specifically against aggro players and other early game issues but they have not.\n\nWhile the goal was commendable it hasn't made the game more enjoyable. There are still many issues and the recent announcements push further in this direction where the game feels too unpredictable or out of control as it progresses per match. It's just not that much fun to play right now and is often more frustrating than enjoyable. I'm sure if people could comment many of them would say \"get good\" but realistically the game is just less fun since I don't mind losing as long as things feel fair and like I was outplayed. So why a negative review after nearly 90 hours? The game is fairly priced, the anti-cheat works great, and the gameplay has a lot to offer. It just isn't fun any more.\n\nAs I noted above the buildings update was a big problem and the number of players has been steadily dropping since. The devs will say this is because they stopped doing marketing or whatever but in the long run it doesn't really matter why it is happening but it is happening and I'm one of those people. Buildings added more annoyances to the game. Why do my air units which are unaffected by walls and turrets even target them to begin with? Air units are already in a pretty weak spot based on top performing players yet they have more silly actions like this. Units also attack walls even while getting hammered on by other units. The logic doesn't really make sense and this is the problem with buildings in general. They add more annoyances and nuances. The game is already quite difficult to learn and many mechanics are hidden or not properly explained and buildings add even more of that. It's not fun to watch your units attack a wall or tiny turret when there is an enemy destroying them because that's just how the game logic works.\n\nIn addition to the frustration added by buildings unit drops (this is where between certain rounds you get to choose from a selection of units to receive) were recently modified. I started playing after those and spells were introduced (more on them later) so I didn't hate them even though I thought they were kind of lame but when the best decision even after tweaking them is to pick the most expensive unit (which the UI doesn't note when picking a unit drop) and sell it that makes you think there might be a bigger problem with how that is designed yet it is still in the game.\n\nThen you have castable spells as they are called in the game. The majority of these aren't a big deal or that game breaking yet a few late game ones (specifically the nuke and storm cloud) can be devastating and remove choices as you essentially have to pick them or spend a ton of resources on countering them since they do so much damage in such a wide area. Sure you can counter this by spreading out your board more but it makes the later rounds feel so swingy and contributes very little. It's like the desire is to just see a big explosion of units rather than balance because it looks cool while harming the strategic layer of the game.\n\nRecently more titan units (really big and expensive but potentially game changing units) were added to 1V1. I don't like titan units. I think they're kind of cheesy and lame gut punch attempts that detract from the game especially in a 1V1 scenario. It was recently announced that they're going to add a titan unit which is centered around fire, essentially either an AoE on the ground that does damage over time, or straight damage over time. This is dismaying to hear because dealing with fire is already quite annoying and not very fun. Only one unit can counter fire that is on the ground and adding a titan that specializes in creating fire instead of dealing with it in other ways makes me really wonder what is going on design wise. The devs said they were going to stop adding units for a while to focus on QoL but immediately after they say a new titan is coming.\n\nQoL issues also abound and while the devs have been improving this lately it's still a problem. You can't automatically mute all the chats every time you start the game and have to mute some every time. Why? You have to reset the camera to your preferred position every game. You have to select which queue you want to play (ranked versus unranked) every time. Having to click \"speed up\" every round instead of toggling it is especially annoying and has been a problem for a long time. The list of these issues goes on and on and is especially present in game where information is simply lacking around exactly what units do, what type of weapon they fire, how much they cost during drops, what techs you have on them before you buy them, etc. Thankfully some of these issues were fixed thanks to the undo button that was recently implemented but is it really a positive when the best course of action is to do something, see information, then undo it? I don't think so. Performance has also been pretty bad recently even on higher end machines in the later rounds because so much is happening on screen.\n\nOverall the game feels like it isn't in a great place right now. Buildings didn't create the problem but they were the straw that broke the camel's back for many players as it introduced one more annoyance and frustration to the game and while the devs did introduce some changes buildings still exist and didn't fix the underlying problem they were meant to.\n\nRight now I can't recommend Mechabellum. Maybe in the future it will be in a better place but I'm done for now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I would love to recommend this awesome game, but there are several factors that prevent me from doing so.\n\nI appreciate the variety of units available and the ability to choose their upgrades and technologies. The randomness of selecting a starting hero is enjoyable, but the random starting units can be quite disappointing. I’ll elaborate on this point later.\n\nThe random items, units, and upgrades add an interesting layer to the gameplay, but there are a few problematic ones in the mix. Overall, it’s a fun auto-battler, but it has its flaws.\n\nUnit balance is challenging due to the sheer number of units and their upgrades and technologies. This negatively impacts starting units and makes hybrid units, like sledgehammers, a nightmare to balance. They straddle the line between small and medium, single-target and area-of-effect, as well as damage and tanking capabilities.\n\nIn the late game, the introduction of Nukes and Storms creates a massive disparity in army sizes, often determining the winner based on who executes their spells better. While these spells have the potential for dramatic moments, their impact can feel rushed in a game that already has a slow pace. This mechanic disrupts the pacing and feels like a way to force an end to the match, preventing longer games.\n\nAdditionally, the game speed is quite slow, and there is no option to auto-speed up matches. This can lead to fights lasting up to 30 minutes unless one player snowballs and dominates the opponent, making each match a significant time commitment.\n\nLastly, there is no true 2vs2 mode; instead, it’s essentially two 1vs1 matches happening simultaneously. The winning sides then meet in the middle to battle with their remaining units. The game would greatly benefit from a dedicated 2vs2 mode where players can build in the same area for a genuine co-op experience.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I've played, streamed, and been involved in the Mechabellum since release. I always thought the game would eventually get all the QOL, features, and hype it deserved for being such an awesome game! \r\n\r\nUnfortunately, 2.5 years after release, it doesn't seem like that is ever going to be the case. QOL additions to the game have been single digit, developer stance towards community feedback after major milestones like Unit Drop & Buildings release has ranged from empty words & promises at best to completely tone deaf at worst. \r\n\r\nI myself and almost no one I know in the community believes the developer is listening to and believes in the community's feedback around new features (or lack thereof). One only has to look as far as the daily average users on Steam to see how many people clearly feel the same about the future of the game after Buildings release. \r\n\r\nI would love to see Mechabellum succeed and think its an awesome game at its core that I've enjoyed greatly for a long time but I cannot recommend it to any new or returning players. Not because of the game itself, but because of the deplorable attitude & inaction displayed by the developer.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I used to love this game, but the recent development changes are making it difficult to enjoy. The game has lost it's elegance / charm. Yes I still play the game but not to the same level of enjoyment.\n\nThe introduction of building layouts has made the game feel stale. You rarely see aggressive strategies making unit placement predictable. Sometimes you even see units going out of their way to target buildings > closer units. Buildings should be changed to deployable devices (i.e. shields, missiles, buildings) and remove layouts.\n\nPre their introduction it was common to place chaff units first in the early rounds and then slot in big things behind or around them to support them.\n\nHowever, now it’s the opposite, you only go medium units or higher because the turrets are so strong at the start. Then late game you spam chaff. I get that Devs wanted to mix things up but previously the game felt like it was in a perfect state.\n\nIn addition, each balance adjustment gives the impression that the Devs aren't play testing their game. Instead, they focus on unit analytics and in particular how popular a unit has become rather than it's win rate or unique role on the battlefield.\n\nCasual Mode should never have been added especially since Casual Mode and Ranked Mode use the same matchmaking queue. Those playing Ranked get matched with Casual players making it less of a challenge.\n\nFinally, Titan units are way to overtuned for 1v1 or 2v2 game modes. You can easily drop a titan round 3 and by the end of the match it’s dealt close to 1M damage when the next highest is 200K. In my opinion Titans should be unique to 4v4 where it feels right for those units to be.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I’ve played Mechabellum for over 2.5 years and poured more than 3,000 hours into it. At its best, this game was one of the most competitive and rewarding experiences I’ve ever had. Every win and loss felt earned, every decision mattered, and the only person you could blame for defeat was yourself. Along the way, I met an incredible community of players who shared that same passion and respect for the game’s depth.\n\nUnfortunately, it’s hard to say the same about the developer’s approach to the community. From the start, it’s been clear that player feedback hasn’t carried much weight. The most recent updates, particularly the introduction of buildings, highlight this disconnect. It was an extremely polarizing change that could have benefited from proper testing on the public test server before going live. Instead, it feels like we’re watching a great game slowly lose its identity in real time.\n\nMany long-requested quality-of-life improvements and creative additions  have been ignored. Instead, the game’s direction seems to focus on “fixing” problems nobody asked to be fixed, while removing the strategic freedom that made Mechabellum special in the first place.\n\nI’m disappointed because I still believe Mechabellum could thrive again with the right priorities: respect for the community’s insight, proper testing, and a focus on the core experience that made it great. But until then, it’s hard to recommend the game in its current state.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "the new patch has ruined the game, reduced the variety of possible tactics, it has become boring to play. Overall the game is great, I am leaving a review for the developer, so that they would pay attention to the choice of further development of the game",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "They made new patch where \"Chessboard\" have random blocked tiles.(walls and turrets)\nI hope you can make it as game mode not the main ranked game. \nWill come back later this year to check out if this poorly planned add is removed.\n\nNot recommending this game anymore!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Mechabellum was best when it was purely two army compositions facing one against another. You could play either long-con strategy, or quick pressure. Sometimes, some interesting flanks or plays were involved.\n\nWAS, because devs keep introducing unnecessary content and randomization that is supposed to keep the game \"fresh\", but instead just makes it muddy. Titans, Buildings, unit drop cards - none of them feel like they belong, and instead of purely playing vs opponents now we have to contest against the game's own randomization, too. I really dislike this direction, and it seems like the introduction of buildings was generally negatively received too, but devs somehow appear as if they're not noticing feedback. I will have to rate this game negatively at least to feel heard; if this continues, the game might not interest me any more.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I’ve really enjoyed this game, however, the recent changes—especially the new buildings, walls, and revised Discord rules—have made the experience feel less engaging than before. I hope future updates bring back some of the excitement that originally made this game so enjoyable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is game is AWESOME. Or... it WAS awesome. The newest series of updates have added static buildings which ruin a lot of the fun variety and direct counter-plays that were available. Despite the devs saying the buildings add variety, I actually feel pinholed into the same strategies every round.\n\nUnfortunately, I can't recommend the game after the building update. As soon as the buildings are removed from the game I will switch this to a positive review.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "When I first started playing Mechabellum, I was instantly hooked. It was the promise of a pure auto-battler where victory hinged on meticulous positioning, economic scaling, and anticipating my opponent’s next unit—a clean, skill-based puzzle. Unfortunately, recent design decisions have steadily pulled the game away from this tight core, burying high-level strategy under layers of unnecessary randomness and map clutter.\n\nMechabellum used to be about decisive, focused decisions. Now, it often feels like a messy affair where strategic losses can be negated by a lucky drop, or strategic wins prevented by impenetrable static defenses. If you loved this game for its promise of a pure, competitive strategic experience, be warned: the current design trajectory is reducing skill expression in favor of spectacle and chance. This injects volatility that undermines the cumulative strategic and economic effort of the preceding rounds.\n\nIn summary: Initially it's fun to figure out what works, the stage after that you mostly play the games' mechanics and not the opponent. Making wins and losses not feel like you earned them.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "You'll play this game to a point, before everything boils down to building specifc teams suich as Marksman + Mountain, As if the game has been \"solved\".\n\nThe variation for me has lost it's novelty/",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has a good core, but the devs don't listen to the community and feel they need to constantly add new features and units even if those features are unwanted and undercooked. New units even though they slowly but surely make balance more difficult and the new player experience less approachable. New features like buildings, which I think are redeemable, but currently lackluster... and that all comes at the cost of that core gameplay which I enjoy remaining unpolished and slowly disappearing underneath titans, spells, poorly balanced starting packs, etc.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Single player content almost non-existent. Survival mdoe is quite fun until introduction of experimental units.\r\n\r\nFun for a few hours, only buy if on sale.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really enjoyed this game and there was a lot of viable strategies to learn with Aggro and standard, but the recent patches have made the game... very awkward to play. Certain units keep becoming overly powerful compared to others, strategies feel alot more boxxed(fixed to certain optimal comps) now and flanks aren't as powerful anymore. Games are going much higher rounds but results in singular unit types scalling much better than earlier, tech-ing into giants don't feel like a power spike and tech-ing into titans don't feel viable anymore. \n\nMaybe I'm just bad at the game and I can't adapt, but really I'm just not having fun anymore everything I do feels wrong. \n\nI understand the devs want to balance the game in the next few patches, but after 2-3 patches I'm done and uninstalling. Thanks for the games it was great.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Originally was  a very neat concept but after my playtime and questionable updates this game is broke and people don't wanna aknowledge it, they pretend its skillful and just a skill issue for a unit that has such high dmg, health and range for something with 15 meters of splash is somehow balenced. i have never been so annoyed at a game dev team then this mongrels from china bruh, they even mention \"it seems to do better at lower MMR\" yet i was mid grade and every ground match is shut down by one of these busted units only to be spammed more and more with upgrades and whatever unit u maybe thinking to counter is already countered by the rest of the army comp. even if you go air its no go because these guys get to put one other busted unit ( AA marks men) and ur entire comps cooked these guys have no idea what their doing anymore just another slop filled game that only blesses meta players with RNG and completely removes the concept of free unit choice that may or may not work this games awful and everyone that plays it is egotistical how 2 play garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Please remove buildings. Loved this game but the latest patches have taken what I enjoyed. Taking a break until there are some major changes",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Aimless developers and toxic community. Nothing of value here. Which is a shame because it's a good concept for a game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The buildings have been making the game less enjoyable, less varied, and less interesting even to watch.  they have been in the game for a long time and it has become painfully obvious to everyone else that keeping them in is not healthy for the game and development needs to cut their losses.  They are personally making me want to quit the game.  please remove buildings and bring back the other 70% of the game.  possibly bring a reworked version back for testing in the PTB, but they need to not be in the base game in their current state. I will update this to a positive review when this is resolved and the game becomes any amount more enjoyable or interesting. i used to really enjoy this game and have faith that they can learn from this mistake and make good decisions moving forward, they have made plenty of good decisions in the past and shown that they are capable, they just have to be willing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Somehow in the process of balancing their game they managed to unbalance their game.... I have been playing for half a year. \n\nThe devs are very active and that's awesome. However, if an active dev team can bring a game down so hard over just a couple months, it may be worth slowing down... Too many changes too often too fast leading to a very unenjoyable experience.\n\n  There is a lot more to say but I don't want to spend the time to type it all out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Devs need to make it so when you select compact 2v2 you only get compact 2v2.. i dont want to play standard or siege or i would have selected them....... these modes are completly different game play..\n\n.... devs still ignore players asking for this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you play solo survival or solo in general and lose Internet connection it will kick you from the game.\nOther than that the game is fine.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unbalanced units make stale onedimensional boring gameplay. Sadly it had potential before. This game is getting developed backwards. \r\nDoubt I'll ever get back to this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "What started out as a thoughtful, positional chess game has turned in to a dismal card drop game.\nIt's really sad - it had so much promise.\n\nAlso - they use disguised bots/Ai everywhere....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im really struggling to have fun in the game now that the buildings have been introduced. its like being forced to play a certain way because i cant put my units where i want them due to buildings being there or having a bunch of my forces wiped by turrets during debuff that the opponent didnt have to buy or position correctly. the game was fine before this, i do not know what the devs were thinking",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is supposed to be a strategy auto-battler, yet the thing that has the greatest impact in the game is RNG. In literally every part of the game too.\n\nIt starts with the character and your starting units packs, both of which you pick at the start of the match. Both are picked blindly, i.e. what your opponent has is pretty much random, and have very one sided match ups. Then there's the initial positioning of your units, which is also blind, i.e. what positioning you're up against is basically random too. From there the game usually just snowballs. The only thing that can then save your opponent or yourself, is usually getting the right Unit drops or Spells to salvage the situation. Both of those are up to your choice, but are picked out of a, surprise, randomised subset of what's available in the game overall. Didn't roll the right options to choose from with respect to the current game state? Guess that's a loss then!\n\nSo, aside from learning some basic things, like not putting your vulnerable DPS units in front of your cannon fodder and what unit counters what other unit, there isn't much you can do that actually seems to matter. Because of this wins usually feel like you [i]didn't[/i] do anything and losses feel like you [i]couldn't[/i] do anything.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "received this game for free to participate in a private tournament, 12 people were rug-pulled when the terms of the prize pool were changed after the winner had been determined, who was also allowed to determine payouts for all participants\r\n\r\nthe game itself is moderately fun though lacks a comprehensive tutorial and is not beginner friendly",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Half a -basic- RTS worth of units, a single faction (player) and lackluster game modes (PVP or Shuffle AI). I'm not sure why this game is positive rated because it feels like a mobile game. At least it's pretty.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really like the game. The addition of walls and turrets really killed the game for me. I'll give it a try every few days, but I feel less and less motivated.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TLDR: They reinvented \"chess\" and made \"fancy chess\". But then they added a nerfed game breaking unit that converts units almost instantly,  and keep buffing it.  They also seem to be trying to turn a 20-30minute match into an hour long match by adding more and more tiers of units. They had a good \"fancy chess\" game, but it is quickly spiraling into a convoluted mess that requires the use of units that are no fun to play that counter literally every strategy simply by stealing all their opponents units. And the way the math works out, you \"can't\" steal your unit back.  \n\nThis game seems to be suffering from \"exponential power\"; I started at the end of season 1, and i think its on season 5 now (id look, but i just uninstalled). As they add units, the new units are \"over-tuned\" to get players to use them (i don't like it, but it's a necessary evil) and the devs are pretty good about balancing after a couple weeks. Even with the unneeded class of \"titan\" units (tier 5), there are tier 4 (giant) units that can be used to counter them.  But this is kind of where the issue starts to show its teeth. Instead of being a \"chess like\" or \"rock-paper-scissors\" style game, the added units make it a \"rock-paper-scissors-dynamite\" game, but dynamite is OP for winning 2* battles, so they make it \"rock-paper-scissors-dynamite-water\", but water also defeats paper, so now they tune \"paper\" to \"laminated paper\" but now scissors struggles to win against paper, so they add a new unit called paper weight, but then it has its problems and throws the balance out even further, and so on. \n\nBut the main reason I uninstalled was the over tuning of a previously unused unit: the hacker. It used to be an unused unit because it would take forever to \"hack\" a unit, and it had fairly limited range and very little HP, and was generally countered \"naturally\" while countering other units. At some point around season 3? (i remember reading the patch notes, but dk when) they started trying to make it a relevant unit. in doing so, they made it one of the single most powerful units in the game. Its whole thing is that it can \"hack\" a unit and make it permanently* switch sides(unless it is hacked back) and for a few credits more, it will not only hack, but instantly heal that unit back to full health. Either one of those is kind of OP, but add the affect of causing all your units (that are close enough to fire on the hacked unit) to break contact with w/e they are currently shooting, to stop, turn, and then start shooting at the hacked unit.  And with the tuning of the \"hacker\" they made it so a Level 3 hacker can hack t5 units in about 4 seconds, t4 in about 1.5, t3 in less than 1.   The ONLY* way to counter this is to also add your own hackers, however, there are certain starting cards (each side gets different ones) and round cards (each side gets the same) that can cause one side to have an un-countereable advantage, and this isn't a \"if the stars align\" scenario, this is a \"1 in 5 matches\" scenario, if not more.  Air units were a potential counter, however, there are so many units that counter air,  that they might as well not be considered be a counter.  And the way the math works out, if they hack your unit, you \"can't\" hack it back because it will turn and obliterate your hacker before it can be hacked back. And setting up your hacker to recapture your own units requires you to spend a whole turn focused on that, which sets off an unstoppable chain-reaction spiral.\n\nIn summary, I liked the game, and liked the way that it was headed. However, one side being able to deploy an over tuned unit significantly earlier than the other side, and that unit keeps getting buffed, or supporting units that make it literally un-counterable made this game not fun.  IDC about the Titan unit that can be dropped on round 2 that can stand in the back and kill both chaff/swarm units and heavy units, anywhere on the map, without moving.  But having a unit that can capture/convert equal tier or higher units to full heath in less 2 seconds completely breaks the game because unless you are prepared for that strategy ahead of time, there is no way to counter it. (and by preparing for that one strategy, it leaves you wide open to several other strategies.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "这游戏里头全是爬虫。爬虫的数量有点失控了。颇使人反感。\n\n部分原因：\n1. 出爬虫收益高。能低成本吸收海量伤害。\n2. 清杂速度有上限。清杂单位再多收益也有限。对付爬虫的最好办法就是自己也出爬虫。\n\n导致的结果\n1. 观赏性差。前期的交火时间，就是两边比赛谁清理爬虫更快，这非常无聊。\n2. 可玩性差。清理爬虫成了首要任务， 这也非常无聊。乐趣性大大下降。\n\n错误的解决办法：\n官方解决爬虫泛滥的方法就是加强弧光，狼蛛，这类 AOE清杂单位。\n也就是水多了加面，面多了加水的平衡方式。在一个纬度的两端反复横跳。\n\n正确的解决办法：\n修改游戏的索敌机制。\n单位会按照优先级去攻击地方单位。这样子才能更加突出兵种的克制关系，增加兵种选择的多样化。而不是无论出什么兵种都要先看爬虫的脸色。这会导致整个游戏的决策围绕着爬虫转，导致兵种选择单一化。\n具体来说比如熔点就不该傻乎乎地老盯着爬虫滋，应该会按照优先级攻击其他大型单位才更加合理。\n而且现实战场不也这样嘛。谁会用大炮打蚊子的。",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "newest patch is as bad as the unit drop patch, it just gets worse and worse",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Target acquisition is an absolute rng joke.\n\nI hate this game but I keep reinstalling it. I hate you. I hate myself.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "half assed structures and unit cards ruined what was once a solid auto battler.  I guess i cant complain.  I got my moneys worth when it was fun lol.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The devs put a lot of time and thought into this game, but every update just brings more and more crashing. At what point does new content just not matter? I crash almost every single game at this point, depending on when you crash it's an automatic lose assuming it's an even match. After the last 3 back to back crashes it's just ruining the fun. I really like this game, and the balance efforts are just so much more sensible than other games where you see wild swings of power. One possibility for a bandaid solution until they can reduce the amount of crashes; where when someone disconnects it stops the timer for a bit. It would be easy to abuse and grief so i imagine it could do more harm than good. It's worth giving this game a try if you like what you see and just test for crashes, you will either find your fair share in 2 hours and can refund it or they don't effect you and you are in the clear.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After playing since Alpha, Beta and the full release, and spending around $100 on skins and about 1,500 hours in the game, I stopped doing ranked matches and tournaments. I used to care, but constant patches changed the game so much that I don’t enjoy it anymore. I’m currently at about 1600 MMR and that feels fine to me, but I’ve been stuck playing against the same 800–1,000 players for the last three years — the community is extremely toxic and full of racism. I have screenshots as examples, but the developers don’t ban these people.\n\nPeople ragequit or troll as soon as they see they will lose. Until recently you couldn’t even kick AFK players from lobbies; they would stay, rejoin the same lobby and ruin the match by being idle. That wastes everyone’s time and destroys the fun. Custom games are possible, but they became ridiculous: matches with 20,000 HP units instead of the usual 8,000 are unbalanced and silly. Veteran players know how to win those setups and don’t enter to have fun — they come with meta builds that crush you in late game (round 18). The damage and HP scale exponentially, so the longer a game stretches, the more you lose if you fall behind. That’s fine for ranked and tournaments, but it ruins custom games.\n\nI never understood the FFA mode. The scoring and flow are odd: you can lose most rounds but still win by taking the right late rounds. When you win a round and lead, the game responds by spawning boss NPCs that crush you the next round. If you survive a loss but barely have one more point than others, you can still get punished with boss units and get stuck. Units don’t earn experience the way they should, and leveling is important — but poor balancing makes it frustrating.\n\nWhat finally broke it for me was players intentionally wasting others’ time: running strategies that drag matches 45–50 minutes, fleeing mid-round, or leaving to turn 2v2 into 2v1. They do it to annoy people. I’ve played other games like Robocraft for many hours and watched them fall apart for the same reason — devs who don’t listen. Big games like COD have the same issues. For now I can’t recommend investing time in this game — it’s complex like chess, with every unit having 4–7 upgrades plus elite levels and many units to track. It’s exhausting and not fun anymore.\n\nMy Critisism:\n\nModeration: The devs need more active moderation tools and faster enforcement against racist and toxic players or who fleeing constantly games. Player reports should lead to meaningful action.\n\nLobby controls: Add host kick/replace for AFK/trolls, and stronger AFK detection that prevents rejoining to grief the same lobby.\n\nCustom-game balance: Keep custom rules realistic or provide clear templates (normal HP limits, no exponential scaling) so casual players can enjoy custom modes.\n\nFFA tuning: Review boss/NPC spawn logic and scoring to avoid punishing players who play strategically across rounds.\n\nMatch length: Introduce timers or options to limit match length in custom modes to stop 45–50 minute grief games.\nPeople actually start with 50.000HP and 99999 Second timer. They wrote to you: ‘Good luck, let’s see which PC crashes first\n\nCommunication: The devs should explain balance changes and provide rollback or testing options for big scaling shifts before they go live. like on Testservers. They got linked Discord so they could interact with the active Community.\n\nPersonal closing word\n\nI still care about the game — I invested time and money — but I’m burned out by endless patches, toxicity, and poor moderation. I’m taking a break, not because I’m sulking, but because the current experience isn’t worth my time and i care about the game. I might come back in Future Patches..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Standard game of started out with a good idea and progressively made the game worse.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Used to be fun, then they added buildings that heavily favoured defensive play and long range battles. Matches have become boring artillery slug fests instead of fostering multiple different playstyles like aggro or one sided pushes.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Skip this game, If you want to hate your life in \"stratagy\" PVP just play league of legends, you don't need this addiction. Full of BS cheese abilities, RNG, and hidden mechanics that aren't clear in tool tips. I regret all 478.8 hrs I've played this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I love this game, but there's one thing i just cannot get over. Please, remove the buildings. It killed the game. I've tried my damnedest to keep trying to keep enjoying it, work around it - but i just cannot work with this (often unpopular) addition to the game. The game has become incredibly stale. Manoeuvring doesn't pay off anymore. Aggressive playstyles are disincentivized. I have yet to meet a single person that thinks it's been a good addition to the game, but i've heard hundreds that hate it. The player retention statistics reflect this unpopularity. There are people continuously complaining about this in the review section and on Discord.\n\nI will consider coming back and re-adjusting my review if it's ever changed, but until then - i'm out.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Naw, poor game, poor balance, not enough players, don't bother.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started as my biggest obsession and got boring shockingly fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck your stupid game hiding MMR in 2 v2 almost always i get a team with 500 mmr less vs a team with 500 more then me usually i would leave que cause its dogshit match making but now you hide mmr in game and i just lose because your dog shit mmr match making how about fix that before you hide mmr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was a lot fun.  Now there's so many strategies that are annoying and tedious to play against with is the opposite reason for why I play games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really unbalance and luck depended. dev don't care.\nafter 30 round in a row of the game hating me and giving the enemy perfect counters (for example giving a sabertooth tank spamer 3 30% upgrade cards + 1 fortified mustang card so i will not be able to counter with air units) and losing 800 MMR (in game rating) i can not say this game and my luck are not after me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game at low levels is luck, and three units. \r\nIt is already dying\r\nJust find something else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was a great game with a certain dose of problems (like any game) that sadly thru the years was becoming worse and worse. Right now do not bother with it if u want to feel any agency in the game as everything is just rng simulator:\n- what units u start with? - random (you pick one of 4 starting packs out of set pool of them at the start of the match and you have no control which ones you get, no ability to set preference or ban units u dont like. You can also have the same unit offered in all 4 options so if you dont like it - tough life, enjoy playing entire match from behind)\n- what is the layout of buildings you start with? - random\n- what cards and reinforcments you get during the game? -random \n- unit's movement and attacking pattern? - random (No, I am not making this up, if both you and your enemy have the same unit with the same upgrades, lets say phoenix or rhino, met on the battlefield they will not kill each other, one will attack before the other and you can lose PERFECT mirror match bc devs thought it is \"fun\" to have random delay in units attacks)\n\nAnd unfortunately this is all by design, balancing of the game is done mostly on the basics of some mythical statistics, which developers refuse to share with the community, that are very unreliable in a game with so much rng so it takes takes literal months to get even most obvious balancing issues addressed. (unit can be so op it has 100% playrate in most competitive tournament in the game and devs are like \"nah this is fine, our stats show this unit is not op, best we can do is 5% hp \"nerf\" so people stop complaining\")",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fuck this fucking game, everyone who plays it is a bastard. I am only because I still play it. I hope the devs shit their pants while giving a public presentation. I hope the opponent to whom I just lost gets every vertebrae plucked out one at a time by a flamingo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-esc key doesn't work, doesn't work for ANYTHING, its a completely wasted key, you have to ACTUALLY click on the settings button to open the settings window like were back in 1995 using windows 0 home vista PS1, nonfunction ESC key edition\n\n-bad controls with no remapping available, they have rotating unit placements with the \"T\" key instead of the obvious \"R\" key, im trying not to be disrespectful but come on guys... T key? you got to be joking... R key is widely known as \"rotate\" and is a key MUCH closer to your WASD resting position\n\n-once you hit the \"speed up\": time button, it breaks and you can't slow time back down\n\n-constant nonstop loading screens during tutorial missions for what should be just a easy match reset\n\n-with music turned off game is deadly silent, not even foot steps of your metal million pound heavy mechs, they tip toe with cat feet, until a explosion occurs and your speakers explode with it (bad auido)\n\nthe game is SO CLOSE to being cool, but once again its as if devs are overly rigid in their vision and destroy a game's potential, the units and combat all seem awesome but the UI/controls with pretty much ZERO in-game settings to fine tune your user preferences and definitely ZERO remapping available to just so painful. The bad audio i can forgive, but the back controls just hurts to much to operate with\n\nill give it a few tries maybe i'll change my mind and im not being open minded enough myself, but idk\n\nwas going to do a positive review for trying, and giving us the option to disable edge panning, which im thankful for, but making the rotate formation key be T when its begging to be R is just unforgivable\n\n2nd time trying, guess what ESC key STILL doesn't work\n\nvirtually no player base, no coop vs ai potential, almost no solo vs ai available, game is set up for multiplayer and doesn't care at all about basic PVE\n\n- ten thumbs down the game is SOOOO SILENT!, literally zero foot steps, zero mechanical sounds NOTHING, at least 50% of gamers automatically turn off music for game by default, its a normal action, but when your game has no effects volume it is so unbareable \n\n\"only newly recuited units can be moved\" is just a awful color and pencil thin font size you can barely see the text, and even if you can see it, it shows up for only .5 seconds, not even know time to read it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After a while of playing this game, the devs have decided to ruin the game by adding static buildings which force your hand to a great extent. The reasoning behind the buildings was to slow down the first round. But all it's done is make the game static and boring. Not worth buying in it's current state",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "On my PC it works great! but when im traveling I have my Macbook and for some reason it does not run. I am constantly getting an error. It says its able to be played of MacOs but it doesnt seem like it in reality.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "laggie, unnecessarly overly complicated, unblanced.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never listen to the customer, because you already know what is best for them.\nWhen the costumer ignores you they just cannot comprehend how great it actually is.\nIf you go bankrupt the customer didn't deserve good anyway anyway.\n\nThis is what happens when blue haired nose rings take over your management KEKW",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the meta is stale as all fuck, its so easy to get utterly steam rolled.......do not recomend at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's pretty but the balancing needs work",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot connect to server.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Despise Buildings.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Garbage..very unbalanced",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}