{
  "positive": [
    {
      "review": "Code Vein turned out to be a fun and interesting soulslike. I had my eye on it for a long time but never really got around to playing it. Now that I finally did, I had a good time with it.\n\n[h3]What I liked[/h3]\n\n[b]Character editor[/b]\nMy huge respect. So many options, details and ways to customize your character. You can easily spend hours in it, and that's what I did.\n\n[b]Controls[/b]\nFeel responsive and comfortable. They are a bit overloaded with functions, but everything works nicely once you get used to it. Keybinds are customizable, and comfortable for keyboard players. The only annoying thing is having to scroll through consumables manually.\n\n[b]Locations[/b]\nThey are great both visually and in terms of structure. They feel well thought out and atmospheric.\n\n[b]Bosses[/b]\nI played through all bosses solo, without a partner, and it was fun. Learning their attacks and beating them fair and square was super satisfying.\n\n[b]Music[/b]\nReally nice. Some tracks are incredibly beautiful and fit the game perfectly.\n\n[h3]What I did not like that much[/h3]\n\n[b]Bugs and technical issues[/b]\nEven years after release, the game feels underpolished. I ran into a lot of hitbox problems where attacks just pass through enemies. The target lock can break randomly and send your character swinging in the wrong direction. Also, I had some issues with elevators.\n\n[b]Too many cutscenes[/b]\nSome of them feel slow and boring. The characters often say really cliche things. If you have watched at least a couple of teen anime, you have definitely heard it all before.\n\n[b]Enemy variety[/b]\nPretty limited. In the second half of the game they start repeating constantly, and the later areas don't introduce any new enemies at all.\n\n[h3]Final thoughts[/h3]\n\nOverall, the game is good. But it has its flaws. I would rate the game 7 out of 10. I hope the sequel will be even better!",
      "voted_up": true,
      "votes_helpful": 41
    },
    {
      "review": "It was a nice game ngl, sure the game's basis is not like Soulsborn games and the combat's kinda easy, and you can first try most bosses, but it was fun, and I wasn't expecting this game to be a good experience for me. It kinda surprised me and I believe it's a waaaay more underrated title than other soulslikes. Other than that, the story was nice, and the atmosphere was cool, the characters were OK, and the main character creation was good, but I kinda wanted more clothing options, but the armors u find throught the game was cool, so it was OK. You better try it at least.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "6.5/10 \r\n\r\nPerformance wasn't good\r\nCombat was ok, but needs improvements. \r\nStory was a little interesting\r\nlevel design was meh\r\nBoss fights weren't the greatest I've seen.\r\nBig swords? Oh they have it in this game :D",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "You have option play single or with a companion.\r\nBy design, playing single is significantly difficult. It is challenging. \r\nPlaying with a companion is done well. Your partner is really supportive and not blocking game play or behaving strange to destroy atmosphere. I really don't like play games with companions, but this game does well and I enjoyed. \r\nLevel design is ok. People complain about it but didn't bother me. Levels are better than Nioh's...\r\nStory and story telling is ok. I like cut scenes and to know actually what is going on. \r\nIn other words I love to see my character on cut scenes with related story. So all the time spending on character creation make sense and means something.\r\nI did NOT see any technical issues or crashes. A few times FPS dropped but didn't effect much my progress.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Anime, Souls-like, Gore, Dystopian, Big ass swords! From the sounds of that, what’s not to love. \nHours of gameplay to enjoy, while yes limited in directions to take as you can either follow the story or grind. Still left me satisfied and still leaves a huge aspect of self imposed challenges. \nCan’t wait to get back into this game, replay it, then purchase and play the heck out of the sequel!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very strong candidate for \"neither recommend nor discommend\" category. It's got some good ideas but the game is pretty low-budget and it shows in many aspects. A good pick up when you crave that soulslike action\n\n+ class/ability system\n+ stronger focus on story compared to other soulslikes I've played (the story itself being rather good)\n+ game theme is very edgy but it's well-executed \n\n+- forgettable music (with notable exceptions)\n+- weapon and armor variety is nothing to write home about\n+- has a level of jank that takes getting used to, especially if you've only played the Souls series\n\n- generally too easy\n- most bosses are pretty boring\n- extremely low enemy variety\n- boring to awful location design\n- infamously bad DLC (that being said Hellfire Knight is a decent boss fight)\n\nA lot of things to improve on but if the studio behind the game DOES improve most (all?) of these things, CV2 might actually end up a really good game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Edgy? Check\r\nAnime vampires? Check\r\nTime spent in Character customization more than an hour? Big Check\r\n\r\nIf you like the Soul series and anime, you will like this game. My only gripe is that I was there was more fashion. Not a lot of options to chose from.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the game itself is really nice.\r\nthe story is interesting and binds you.\r\nand i had a lot of fun playing it through several times\r\n\r\nbig negative point though is that there is an achievement which is \"online\" bound...\r\nyes there is a possibiliy to gain it via solo play but this takes boring repetive hours since the item drops by chance ....\r\nI hate when achievements exist in a game and are multiplayer bound....they cannot be achieved anymore if you play the game years later...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it was a great game i enjoyed it , it was a bit clunky at some places , but  that didnt bother me that much , i like how we go out of the barrier( CODE VEIN 2 LETS GOOO)and i didnt know that its in the God eater universe , i jumped when  i saw the iconic monster from God eater",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No other souls-like really scratches this itch. It's not the hardest, but it's so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game I have played in quite awhile! I actually want to get 100% achievements for this game, it's so fun whacking a ton of shit around HAHA It reminds me of tokyo ghoul a lot which i lovveeee. AND THE CHARACTER CUSTOMISATION. oh my god. its like the sims but it has all of the CC. i'm drooooling. also, call me nerdy or whatever but i made rize from tokyo ghoul. she actually looked so sick in the cutscenes LOL\n\nI am now in love with souls games. I legit cannot wait for Code Vein II. \n\n[spoiler] don't even talk to me about the blade bearer and cannoneer boss fight... EVER! i'm getting vietnam flashbacks thinking about it bro [/spoiler]\nPS: Yakumo is the goat.\n\n⢸⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⡷⠀⠀\n⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀\n⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇ Are ya winning son?\n⢸⠀⠀⠀⠀⠀⠖⠒⠒⠒⢤⠀⠀⠀⡇ \n⢸⠀⠀⣀⢤⣼⣀⡠⠤⠤⠼⠤⡄⠀⡇⠀\n⢸⠀⠀⠑⡤⠤⡒⠒⠒⡊⠙⡏⠀⢀⡇⠀\n⢸⠀⠀⠀⠇⠀⣀⣀⣀⣀⢀⠧⠟⠁⡇\n⢸⠀⠀⠀⠸⣀⠀⠀⠈⢉⠟⠓⠀⠀⡇\n⢸⠀⠀⠀⠀⠈⢱⡖⠋⠁⠀⠀⠀⠀⡇\n⢸⠀⠀⠀⠀⣠⢺⠧⢄⣀⠀⠀⣀⣀⡇\n⢸⠀⠀⠀⣠⠃⢸⠀⠀⠈⠉⡽⠿⠯⡆\n⢸⠀⠀⣰⠁⠀⢸⠀⠀⠀⠀⠉⠉⠉⡇\n⢸⠀⠀⠣⠀⠀⢸⢄⠀⠀⠀⠀⠀⠀⡇\n⢸⠀⠀⠀⠀⠀⢸⠀⢇⠀⠀⠀⠀⠀⡇",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool souls like overall. Kinda clunky but good enough if you like souls like games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far I like the game, a definite yes indeed, it can be challenging if you are new to the soulslike game genre. It's mostly your OC/Character having a story in a world that is wrapped in a dark souls-like world, tells a great story as well. Feels a little off sometimes but that is quite rare. I'd definitely recommend this game for players that love a good game that has an excellent character customization and also likes soulslike games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game honestly feels really easy compared to many other soulslikes, with the revive system and the extra lives it doesn't give to much of an challenge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game overall. Only downsides would be the occasional freezing that happens. \nI'd say it's easier than other souls games, but it takes some skill for you to learn the combat and get better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been eyeing the game up for ages and finally bought it for under £10. It's quickly become one of my favourite games. The anime style grabbed me straight away, it's not stupidly difficult aside from a few sections, and it's overall very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics - 7.8/10\r\nStory - 9/10\r\nSoundtrack - 10/10\r\nGameplay - 10.1/10\r\nControls - 7.2/10\r\nCharacter Customization - 9989/10\r\nDifficulty - Learnyourblood/10\r\nAmbience - Hopefulbutmelancholic/10\r\n\r\nYou could spend 1+ Hour just creating your perfect player character. Up to 10 accessories. \r\n\r\nTakes place in a destroyed city. Main objective of the game is to restore memories of characters by collecting them in the overworld or by defeating bosses. A comfort game for action game enjoyers. The NPC patterns are highly reliable and can help you make the game easier. I recommend a quick or normal mobility weight tier for the harder bosses. Mix and match different skills to see what feels more comfortable to use in a fight for you.\r\n\r\nThe game plays like a soulslike. You can equip a vail from 4 different types which changes how you parry. You can change your class/stat distribution at anytime from the menu. Mana can be regained by attacking or using vail.  4 Passives can be equipped at any time and 8 active skills can be use at any time. Customizable from hundreds of different gifts you unlock by playing through the game and using different classes. You get 14 Areas and 1 Homebase in the main game. You get 3 dungeons (depths) in the DLC. The most memorable area was a sacred cathedral that had a mind testing maze with multiple layers.\r\n\r\nVampires (Revenants) need to eat too. I have never seen a game with more detailed character creator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a Souls-like fan per say but I have played a few in the past and managed to beat Dark Souls 1 and this game. I would say it isn't as difficult as the other ones I've played but I like it all the same and it still has challenge there if that's your cup of tea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it years ago in Xbox and i absolutely love it.\r\n\r\nI decided to replay it again years after before Code Vein 2 comes out and it's still as good as i remember the combat and build system is amazing it gives a new taste to the souls-like genre \r\n\r\nnot to mention Go Shiina amazing work on music and thankfully he is working on the second one as well\r\n\r\nIt is my favorite souls-like game outside FromSoftware games and i can't wait for Code Vein 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "anime dark souls\r\nwish it was more popular, the multiplayer features are practically non-existent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent story, likeable characters, good range of gameplay styles and good boss design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had fun overall also Io is great, but the voice acting and parts of the story were pretty cringey at times esp. onigiri made me die inside.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "400 marks of honor for the final achievement, but the game is great, looking forward to code vein 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Demo was an amazing thing. Can't play main game because of issues at the moment but it is a great souls-like with an amazing character customizer. Recommend buy if on sale, it is not worth full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I kinda regret only playing it now (cz of Code Vein 2) eventho I've bought this back then, this game is pretty dank anime souls-like. Kinda like Dark Souls but with storyline and anime flashbacks. Also fun mixed class building in an emo-goth-baroque-vampire design. Lovely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "launch the game via steam with following command\n-notexturestreaming -useallavailablecores\nthen you can cheese the hardest tutorial\n-----------------------------------------------\nStory: Mediocre anime.\nCombat: If you insist to not carried by emo boy or big tits waifu, you gonna get ganked by 3-4 enemies through entire dungeon.\nI beat the whole game including DLC without waifu/hasbando and I suffered a lot.\nIt's challenging.\nGraphic: Good.\nPerformance: Bad, there's fatal issue like crashing during tutorial, stuck in elevator, invisible boss etc...\nOverall 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting, souls-like game, but with anime characters. I like how you can customize your character at any point of time. IMO, its better to play on the controller than keyboard, but you decide! The co-op part is weird and limited. You cant move across locations, the game just says nuh-uh and kicks you out. Still, it work flawless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is OK, didn't expect to actually enjoy the game, \r\n\r\nfirst about the story , It’s emotional, dark, and despair , absolutely awesome \r\n\r\nCombat , just a right amount of challenge because of partner system, but that's a choice, we can go without partner for increasing the challenge, personally i hate louis for reckless shit partner\r\n\r\nBoss Battle, not too hard, easy pattern, but enjoyable\r\n\r\nAlso all weapon and armor are cool.\r\n\r\nCharacter creation is next level , there's so many option for your character.\r\n\r\nFor me this game is solid 8/10.\r\n-2 because there's 1 achivement that you need to HARD grind,  and it's VERY.WASTING.TIME.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was... interesting. For a souls like game it wasn't awful just, unmemorable. I originally bought this game on a really good sale that i still don't regret buying and playing. It just felt awkward and the Mechanics didn't really matter much to me because i play like a caveman. Now that I finished an ending I'm hesitant to play the dlc i bought as well.\n\n7.5/10 Maybe I'll pick up again someday.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some areas get repetitive, and having to walk \"a lot\" in some areas without any enemies or anything to do looks like a cheap and artificial way of extending the gameplay. Other than that, the anime aesthetics are nice, and the gameplay is fun. It would fall into the \"easier\" soulslike out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good story all the way through, some tough bosses but pretty easy for the most part",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a vet fro PS4 got this game day one back in the day I FUCKING LOVE code vein, it just clicked with me ive beaten the game well over 10x. the combat is very addictive to me, unless you play with a fool that wants to charge in without thinking or checking surroundings these are the people that rage at the game cause they get swarmed and stop caring about story assuming they did at all cause they are so mad they couldn't possibly care. OST or BGM whatever you want to call it was amazing,the characters are very easy to get attached to & the lore is very rich & thick. the maps are a little confusing in some locations but as long as you pace yourself you should be fine. the character creation is very detailed & fun even if the options of clothes are lacking sadly cause some that we were meant to get through DLC was canceled for being too revealing. i got friends that are souls vets & they love the game as much as me to a degree strongly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is very fun and and challenging game. The story is nothing ground breaking but enjoyable with just enough good dialogue to make up for the mediocre dialogue but nothing horrible. The story telling on the other hand is awesome with the mix of great cutscene and immersive almost opara feeling  memory walk through. The stats and fighting seemed plenty complex to me despite some people saying the game was to easy i struggled many times in the game.  Put the game and came back many time before deciding hey this games actually pretty good . when i dont know what to play i usally go back to this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relatively easy if you played games like Dark Souls or Elden Ring but very fun nonetheless.\r\n\r\nA bit lackluster when it comes to stat scaling, very repetitive when it comes to that.\r\n\r\nGreat charakter creator.\r\n\r\nThe story and the different endings are well made and can draw you in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a Dark Souls fan and I never played it, but this game is really good. The fighting, someone can join you and help you out fighting. The weapons and armor are very cool, the story is very interesting... I love this game BUT sad to say I will not finish this game at all. I cant beat the mini boss and its a very headache game. I dont like playing a game that makes me angry or sad or useless. Too bad I wouldnt have the experience to know the story and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game highly deserving of a mixed review score, tbh. While I did enjoy my overall experience with the game, I find the later bosses to be incredibly infuriating to the point I almost flipped a coin on whether or not I'd recommend the game. I do think the good outweighs the bad, but as somebody who's been playing soulslikes since 2014, the bad is *bad*. I'm far from the best soulslike player in the world, mind you, but there's a fine line between a skill issue and bad boss design.\n\n     Leaving the boss gripes for a second, I've gotta talk about something I like or the ghost of Juzo Mido's gonna send me to the Cloud District. First off, the Blood Codes. I can't even begin to express how much I enjoy the Blood Code system, which is Code Vein's take on classes. Instead of leveling individual stats like in other soulslikes, your attributes and scaling are determined by your Blood Code. Atlas, for example, focuses on heavier armor and weapons, letting you tank some serious damage. The Prometheus Blood Code, on the other hand, is a glass cannon that hits hard, hits fast, and lets you move fast enough to not get flattened by the frightening abundance of large format women. Each Blood Code also comes with its own abilities, called Gifts, that range from devastating elemental magic to fast and furious melee combos. I do have to gripe about the melee Gifts a little, as there seems to be no added stagger resistance, or enough stagger caused to really justify using them on less durable Blood Codes, but I tend to run light, so that's probably just a skill issue on my end.\n\n     As for more petty gripes, enemy variety is fairly lackluster, and general performance seems to be a little unstable. Not unplayable, but I refuse to believe the FPS counter reading 60 when I'm in particle heavy areas. Weapon and fashion variety is also a bit slim, but the latter is alleviated by the game's character creator. I also personally find destroyed urban environments to be a bit boring as a setting, and there's no escape from crumbling buildings and shattered ruins at any point.\n\n     My last petty gripe, since it's more an issue of my own impatience, but still worth noting - the spike traps in the final area. Let me tell you how much I have come to hate the spike traps since I entered the Provisional Government Center. There are one hundred trillion nerve cells laid in intricate channels throughout the human body. If the word hate was inscribed on each nanoangstrom of those hundred trillion cells, it would not equal one one-billionth of the hate I feel for those spike traps at this micro-instant. hate. HATE.\n\n     As for the major gripe I have with the game, its that the bosses starting with the Successor of the Ribcage about halfway through the game are just not fun to fight. Ribby's second phase has an instakill* attack that she always opens with and sweeps the arena twice, as well as at least two other attacks that can hit you anywhere in the arena. Successor of the Throat has an attack that feels impossible to dodge. The Blade Bearer and Cannoneer are the first and only duo boss in the main path, and I feel like I can say for certainty that Ornstein and Smough doesn't work when Smough has the ability to make you explode from a mile away while Ornstein is freezing you to death with an icy rapier. Juzo FUCKING Mido is not only a boss with a whole laundry list of issues that I could write a whole essay about (for the love of God, ignore that I've already written one), including a distance closing dash with no actual attack that still deals damage, he's voiced by Keith Silverstein, who I'm sure is a very nice man, but I swear to fucking Talos, getting roflstomped by Nazeem for a fucking hour had to be the most infuriated I've been by any boss - no, any SECTION - in any game EVER, and I've played Too Human.\n\n     Bosses after Mido still have all the same issues as previous bosses. Random instakill attacks, attacks with little to no windup (or too much windup for attacks that hit at Mach Jesus), incredibly dodgy hitboxes**, seemingly endless attacks with short cooldowns between different combos, undodgeable AOEs, nearly unpredictable attack patterns, and probably more bullshit that I've already repressed in the couple hours since I've completed my first playthrough.\n\nAt the end of the day though, coin flip or no, I'd still lean more towards recommending Code Vein than not. Despite my earlier petty gripe about not liking urban ruins as a setting, the game is still beautiful with a well-defined style, and even the lackluster enemy and equipment variety still provides enough substance to have a good time. Also, Io is best girl, and I will not be accepting any argument, THAT'S THE BOTTOM LINE BECAUSE STONE COLD SAID SO.\n\n*Ribcage's exploding fire laser is an instakill against the Prometheus Blood Code, which is a glass cannon as previously stated. Your mileage may vary, but 2k damage is still 2k damage.\n**I have no footage to back this up or I'd be plugging my (dead) YouTube channel, but I swear that the penultimate boss, as well as a few others, were hitting me from at least a foot away with non-AOE attacks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thoroughly enjoyed this game and news of a sequel has me very excited.\nIn my ~70ish hours, I have managed to 100% this game, and once you do, there's not much left.\nMy biggest gripe is The Cathedral, after 5+ runs you would think I would remember its layout, but it always stumped me with the drop that's hard to see unless you're really looking for it.\nHighly recommend if you have a friend to play with or if you just want another decent souls-like.\n10/10, would be a vampire again.\n\nOh, also, the DLC isn't worth it, they're essentially small dungeons with repeatable challenge bosses, only get them if it or the bundle is on a good sale. Honestly with the amount of content you get in them, they could've been free updates. I doubt they  made much off of the DLC sales. I hope they learn from this and don't release similar DLC for CV2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly what a deal I got with it being 85% off, I bought the deluxe edition but I haven't played the DLCs yet as I've just started like four or so days ago. It's genuinely a great game. It's basically an anime souls like that is mostly focused on the story and give a lot of freedom to do character customization AND combat builds. I've heard it's supposedly easier than others souls like(?) but I'm not sure cause this is my first souls like game. You should give the demo a try before deciding at the very least (yes character customization from the demo is transferable to the actual game).\n\nAnd just to put this out there, I LOATHE THE CATHEDRAL.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Three hours in and this game is really good, the graphics are awesome and the game runs really smooth, the only thing that i have noticed that is kinda glitch is if you can see an enemy that is near the end of the render distance it kinda glitches around on its route though this is not something that bothers the game play since the minute you close the distance slightly it fixes itself. Would def recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like Astral Chain characters with Stranger of Paradise level design and Nier:Automata UI/itemization. Except instead of Evangelion, it's Angel Beats. I dunno, it's no Sekiro, but it's definitely better than SoP imo, especially if you like designing your character and cute NPCs. So, worth the $9 on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game that really doesn't do anything too compelling, I sure did love it. I bought it at launch on my PS4, bought it again when I got a Series X, then finally landed on the PC version. It is unabashedly anime in a genre that definitely leans into the gritty Western aesthetic, so it stands out in that regard. More than that, it wears its vampire fiction inspirations on its sleeves. The environments aren't great, but the character design is immaculate and sits comfortably between \"I wouldn't be shocked to see someone dressed like that in public\" and tacti-cool military buff. Given the weird trend of Castlevania cross-over content, I wouldn't be shocked to see Castlevania DLC in the sequel.\n\nBut honestly, I can't really tell you that you HAVE to play it. If this is your jam, you already know that by looking at it. The actual substance of the game is a solid Souls-like (even with the jank typical of the genre), but it's a stylish game above all else. The story exists, and there's some cool scenes, but I really couldn't tell you what's going on besides \"Not-vampires that are good guys prevent not-vampires that have gone insane from destroying the world.\" Not that the world is all that great to begin with.\n\nThe character progression system, while serviceable, is also not something I would consider a highlight. In the interest of not locking players into a particular build, the game's build system is based primarily around equipment. You do pick up these peculiar little \"classes\" that tell you what you can and can't equip and grant you skills, and you can master those skills to use with other \"classes.\" But those skills are going to be useless if you don't have the equipment to back them up. You don't assign skill points, you equip cool jackets that buff certain attributes and weaken others. Even if you have a class that will let you use certain skills, the difference between a violent tickle and 2/3rds of an enemy's health bar is whether you equipped the church hoodie or the desert wanderer duster. It's still worth your time to research building your character, and the jackets are pretty slick, so it's not something I'd throw out entirely in the sequel.\n\nAs with any game, I'd say wait for a sale. Don't be like me and buy it three times. This one goes on a pretty steep sale, and fairly regularly to boot. As I'm typing this, you can pick it up for $9 as opposed to $60. It's a no brainer for a Souls fan at that price. Don't get the DLC though. It's just copy pasted filler dungeons with slightly different equipment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Here's my thoughts on this game:\nIf you are coming from Souls Games you are going to feel right at home.\nThere is a lot of variety in terms of builds in this game; you can play as a caster, range, strength, dexterity , etc\nIf you like stacking buffs to do big damage this game is for you too.\nThe character creation is also pretty cool.\n\n\nBut of course every game is not perfect, so is this game,\n1)The enemies AI is absolutely dogs*t omfg, you are going to fight enemies that target your ally and randomly target you for no reason even though they're getting bash in the head repeatedly.\n2)When you do a challenge, enemies love to spawn/teleport behind you.\n2)The final boss...is an experience that you will not forget.\nIt's basically  Meteorite of Astel + Bayle.\nIf you are a spell spamming enjoyer I HIGHLY recommend switching to a strength build to beat this boss\nBecause you TRUST ME YOU WILL SUFFER.\nSo reject magic return back Gigachad Strength High Protein Diet Build.\n\n\nIn conclusion,\nThis game is for me the best souls like imo, because there's everything that a souls game has that this game has.\nI had a lot of fun playing overall and some bosses are enjoyable to fight except Asuna and Kirito after eating too much burger and the final boss.\n\nAlso Yakumo is the G.O.A.T",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is easily my favorite souls-like. Over the years, I've developed a disliked over souls-like as a whole as they not only tend to take after Dark Souls, they copy it wholly. That includes incredibly vague dialogue, zero story, and a structure that makes care more about your wall over what is actually going on in the game. So I was absolutely loving it when there was not only a story in this game, the story telling was the focal point of it. Along with characters reacting to events and giving you actual information instead of having to watch videos on youtube to read you texts scattered across a million items. Because let's be real, we don't go around pausing our experience to stand still so we can read random item descriptions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brief Overview at the bottom! SPOILER FREE\r\n- DIFFICULTY -\r\n\r\n🔲 Not difficulty based\r\n🔲 Easy\r\n☑️ Normal\r\n🔲 Hard\r\n🔲 Insanity\r\n🔲 Varying\r\n\r\n- GRAPHICS -\r\n\r\n🔲 Pixels\r\n☑️ Bad\r\n🔲 Graphics don't matter in this game\r\n🔲 Good\r\n🔲 Beautiful\r\n🔲 Masterpiece\r\n\r\n- MUSIC -\r\n\r\n🔲 Bad\r\n🔲 Music\r\n☑️ Good\r\n🔲 Beautiful\r\n\r\n- STORY -\r\n\r\n🔲 This game has no story\r\n🔲 Very mind numbing\r\n🔲 Available if people want it\r\n☑️ Well written\r\n🔲 Epic story\r\n\r\n- PRICE -\r\n\r\n🔲 N/A\r\n🔲 Underpriced\r\n🔲 Perfect price\r\n☑️ Could be cheaper\r\n🔲 Overpriced\r\n🔲 Stupidly priced\r\n\r\n- REQUIREMENTS -\r\n\r\n🔲 You can run it on a phone\r\n☑️ Mid Spec\r\n☑️ High end\r\n🔲 Top of the Range\r\n\r\n- LENGTH -\r\n\r\n🔲 Very short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n☑️ Average (15 - 50 hours)\r\n🔲 Long (50 - 90 hours)\r\n🔲 Extremely long (90 - 110 hours)\r\n🔲 Continuous\r\n\r\n- FUN -\r\n\r\n🔲 Dead\r\n🔲 Hard to enjoy\r\n🔲 Repetitive\r\n☑️ Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n- REPLAYABILITY -\r\n\r\n🔲 None\r\n☑️ Only for achievements\r\n🔲 If you wait a few months\r\n🔲 Definitely\r\n🔲 Infinitely replayable\r\n\r\n- WORTH BUYING -\r\n\r\n🔲 No\r\n🔲 Wait for sale\r\n☑️ Yes\r\n🔲 Free\r\n\r\n⭕ - Conclusion -:\r\nAt first I was a bit sceptical about this game, I disliked the general vibe and it felt very slow paced. Overtime as I improved it was a lot easier to get into and find the interest of. Worth Playing just expect an initial bit of boredom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Positives: Hot vampire-ish guys, boobies, insanely cool visuals.\nNegatives: Overwhelmingly hard (I really just suck at this).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obnoxious Anime OC Dark Souls is good. Embrace your cringe and play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b]It feels more like \"Souls\" than Eldensh*t. In fact, better than Eldensh*t. [/b]\r\n\r\nDiversity, an ordinary yet intense approach to entertainment, straightforward yet well thought out enough to warrant multiple playstyle, stylish weapons and abilities; a few plots designed around these weapons and abilities. And of course few plot holes that you could let'em slip.\r\nFun, short, diverted, cliché.\r\n\r\nI really don't want to use the term of \"Souls\" however this game actually understand the meaning of it, and approach it as a genre.\r\n\r\n\r\n[i] I have spoken.[/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enemy hitboxes can become a little cheap, but the story, the ost, the customization, the builds and the love the devs put in their characters and the interactions and connections made my heart flutter. I loved the lore and collecting all these memories. Big fan of the franchise from now on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall: 6/10 - Worth Beating\n\nStory: 6/10\nWorld: 5/10\nBosses: 6/10\nGameplay: 5/10\nDifficulty: 7/10\n\nThe best thing about this game is definitely the gift system. It felt good to use and was fun to mix and match skills. I think the story was unique in its setting and context, but it really just boiled down to the contrived \"save the world from the bad guys influence\". Visuals were hit or miss. Some great visuals and levels, but there were a lot more bland ones that took me out of the vibes. Cutscenes were ridiculously numbered and over-expository. As for combat, if getting hit did not stun lock you into death, it would have actually been very good. However, for a game balanced around co-op, the multi-enemy fights are all complete BS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was good, fun. Can't wait for next installment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very unbalanced, but still very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yo, I just sank my fangs into Code Vein: Ever Darkness & the Secret Hideout, and it's like Dark Souls crashed a vampire anime convention—waifus, blood codes, and bosses that laugh at your face!  Rocking my over-the-top character creator waifu (thanks, sliders from hell), I teamed with AI partners who either clutch like pros or yeet me off cliffs mid-fight, turning every labyrinth into a hilarious blame-fest. Combat's a flashy frenzy: swap blood codes for spells, drain fools for buffs, then gift 'em back in explosive glory—feels like Souls on steroids, if steroids made you dodge-roll into walls.\nPost-apoc ruins are moody eye-candy, story unravels via memory shards (no more cryptic BS), and that \"ever darkness\" hideout vibes hit with secret base upgrades and bromance waifu drama. Bosses? Gigantic nightmares that had me raging, then cheesing with drone summons. 8.5/10. Addictive vamp grind—more bloodthirsty than my coffee addiction!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "souls-like with indie feel. \nRuns on Steamdeck.\nGood enough to pick up the Code Vein 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plays like your average souls-like. The story is easy to follow and combat is fun. Maybe a bit too many enemies in some levels, but definitely worth the purchase when on sale!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun to play and have fun with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, I am very impressed how fantastic the battles are and weapons choices along with it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of good soulslike game with great storytelling, the lore is also great. there is actually 4 ending, the last one is ending 3 + little scene that become true ending and also required to get all achievement. Mannnn really this is more like code pain or code of depression...... :(\n\nthe char customization is amazing, for the gameplay is a bit unique, the parry sistem & timing is varies depends on the armor you equip which is nice ( atleast for me ). the good thing is you can change to many variable build in the middle progress without resetting you char to lvl 1 to distribute stat like usual souls game. the one that this game is lacking is boss design and map level design, but other than that this game is good, worth to try.\n\nthe most important is BGM GOD TIER!!, GOAT SHIINA BGM NEVER FAIL TO  IMPRESS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pros :\n-Good Graphic\n-Good Story Line\n-Fully Optimize\n-Save the World\n\nCons :\n-Non So Far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game had a good time.  A decent soulslike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A weeb hack'n'slash souls like. Kinda enjoyable, especially if you love titties.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Io has very big personality\ngood game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The music is too good for a game like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vampires are so overrated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its Ultra Fun , i will finish the game soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Anime dark souls but more clunky. 6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An underrated gem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good. Just do it. Right Meow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elden Ring but better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great souls like i would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bem legal o jogo !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark Souls feels like a Anime Style Hacks and Slash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anime Dark Souls. In a good way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like these story and characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dark souls but anime... that's all I can say.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dark Souls versão anime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Life Could Be A Dream",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE YOU IO!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There sure are veins",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its great, thank you for this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anime dork souls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "power of friendship / 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome title",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak souls-like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game for gooners",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "decent enough RPG from Japan",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "eva can fix me",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Extremely unsatisfying, mid game throughout, a disgraceful soulslike with tiresome ungratifying combat mechanics, repeated enemies throughout that do not react well to your attacks, and bosses that end up being push overs or borderline unfair; plus various problems and bugs especially if you run the game above 60 FPS\r\n\r\nThe game is designed to be played with an AI partner which ends up making it too chill, if you decide to go solo you end up with an unbalanced mess of areas/bosses, the areas being overall uninspired with little incentive to explore carefully, with repeated enemies, swarms of them at time due to the invasion mechanics\r\n\r\nBosses have no middle ground between push overs and borderline unfair, usually spamming AoE moves when played solo, so you end up with an unrewarding and forgettable experience (or rather very memorable due to the overall frustration, especially around the end bosses)\r\n\r\nThe build variety is OK but towards the end you will be forced to switch due to later bosses having insane elemental resistances and being immune to most status effects\r\n\r\nCode Vein also has no Ultrawide support and various problems if you play above 60 FPS (the main problems I experienced were elevators do not function and a certain boss going invisible during it's second phase)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Recommend the game for solo experience, highly AVOID IT if you want to play coop with a friend.\n\nHopefully the second game is way better and the combat isn't outdated when compared to AI limit and Khazan.\n\nI just wanna say, few years ago I enjoyed the game. Have not finished it and made my friend buy it a few years later to play coop. We can't. What happened? We've been searching for solutions end on end and it is insane none of them worked for us so far. This is the only way I know I can reach out to you guys, please fix this. Patch this up. I know the second game is going to come out but don't leave this behind because of it. Just fix it.\n\nPerhaps I am in the minority and you won't care for it. Though if the base of the game is about coop, how come that is just broken??",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Code Vein … wow, where to start. This is a game that seems to be equally loved and hated in the souls community, and after spending over 30 hours slogging down its long, repetitive corridors and fighting against the same reskinned enemies over and over again, I came away completely befuddled as to why some people find this game so interesting.\r\n\r\nMaybe it’s the story, which comes off as a ten season anime stuffed into a four-hour info-dump so thick with lore it’s almost indecipherable to all but the most attentive of players. Anime aficionados might enjoy this, and I certainly like a bit of worldbuilding myself, but when the only way to get most of the exposition is to walk very very slowly through an NPCs memories, it soon becomes boring, especially when you have to do it for the fourteenth or fifteenth time.\r\n\r\nThe basic premise, if you are interested, is that you are a sexy androgynous vampire that can gain the powers or “Blood Codes” of others by reliving their memories. The enemies in the game are known as “The Lost”, undead that have gone without blood for so long it has driven them mad. Several years ago, a large number of Lost were killed by a woman vampire named Cruz, although the effort drove her into a frenzy and she was consequently killed in turn by her own father.\r\n\r\nThings get increasingly complicated from there onwards, with not one by two amnesic characters, a sister with a half-frenzied brother, the obligatory mad-scientist, and, as I’m sure you can guess, the suspicion Cruz is not quite as dead as everyone thinks (hint : she’s a vampire).\r\n\r\nThe game mechanics themselves are incredibly similar to Dark Souls. You go from one zone to the next, finding bonfires and unlocking shortcuts. The only real innovation here is that while you do level up through conventional means, your stats are actually governed by what “Blood Code” you have picked as these determine things like poise, weapon scaling, and encumbrance among other things. You can switch between these on the fly which allows for a certain amount of flexibility, but, while some players will certainly enjoy its simplicity, I found it far too restrictive. One of the joys of games like Dark Souls is that you can fine-tune your build to fit your playstyle and I never really found a way to do that effectively here.\r\n\r\nFor example, as a fan of strength builds, I quickly gravitated towards the Atlas Code that allowed me to wear heavy armour and wield big swords at the cost of movement and dodge speed. Thing is, I like having a great sword and being able to dodge, which is impossible from the get-go here, I had to learn all the skills from the Atlas Code, then switch to a different Code and learn all the skills from there, none of which was fun.\r\n\r\nI wouldn’t mind suffering through all that if the combat was fast and addictive. Unfortunately, it’s neither, with an over-reliance of you getting swarmed by enemies that stun-lock you or knock you out of your attack animation mid-swing. I found the moveset to be really finicky too, especially the running attack which sometimes ended with an overhead swing and sometimes with a thrust attack, and I’m still not sure why. Your heavy attacks do the most amount of damage, but I ended up abandoning these entirely after realising they are constantly interrupted and that two or three light attacks do as much damage and fill my ichor (magic points) roughly the same amount.\r\n\r\nFinally, I’ve carefully avoided talking about the jiggle physics here, but even without diving into the waifu aspect of the game, you have to admit that having characters run through the snow fields and ice lakes of one of the levels dressed in what basically amounts to a bra and panties is maybe a little underdressed. Or I guess vampires just don’t feel the cold?\r\n\r\nI don’t despise anime by any stretch of the imagination, I just don’t think it’s a great fit for a soulslike, and the cumbersome way Bandai Namco has chosen to doll out its story beats just doesn’t work. The Blood Code system was an interesting idea that failed to grip me either, as I disliked not having sufficient control over my character’s growth. If neither of these things bother you then maybe give Code Vein a try, but I myself find it difficult to recommend.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pros:\n\n- Sims 5 Weebshit character creator\n- THE game where you want to spend hours in photo mode\n\nCons:\n\n- Unpolished overall (gameplay, combat, animations). It feels very stiff and rigid overall\n- Mid story\n- The game places you in the middle of everything and constantly uses fancy words as if expecting you to know everything off the get-go\n\n\nDefinitely NOT worth the full price.\nOn sale it's worth alone strictly for the character creator.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Review after playing through the game, which took about 30 hours.  There's stuff in this game about anime vampires that some people will like.  But I think its overall pretty mid and your time would be better spent playing something else.\n\n[h2] The Good [/h2]\nThe callout nice feature of this game is how easy it is to switch between builds.  You collect 'blood codes' of other characters in the game which give you their move-set while equipped.  After spending enough time with those abilities you unlock them permanently and can apply them while using other codes to make a really diverse set of builds.  Swapping between codes is a really quick process, technically you could swap builds for every fight.  Going from full caster to a full strength build takes a few seconds, and that is really neat.  Its also a bit tiring trying to level and manage all of that, but I'm sure some people are really into that.\n\nExploration is also pretty well done.  This isn't open world but it is still satisfying.  \n\nThe story is entertaining enough.  The game does stop every time you get or try to upgrade a blood code to force you to walk through someone's memory.  That's sort of a pace killer imo, but yeah the story is present and not quite what I was expecting from the premise.\n\n[h2] The Rest of It [/h2]\nI didn't enjoy the combat, it felt too loose for me.  And that is kind of the focus of the game.  They did try some things around, like having your parry timing change based on the armor you are wearing.  I applaud the attempt, but I found the parry window ranges from \"Early\" to \"Really Really Early\" so I just didn't engage with that system after a while.\n\nIt feels like they designed this game to be a multiplayer game, but then backed down to giving you a companion all the time.  So a lot of the time it felt like they maybe should have put more effort into balancing out enemy attack windows and such, but instead just band-aided the problem with an AI buddy.  \n\nAnd that laziness extends to a feature I was looking forward to, the Depths.  Which is a repeatable dungeon with a farmable boss at the end.  Those unfortunately feel like a reskin/copy&paste job that I just lost interest in after doing about 5 of them.\n\nI also encountered at least 3 game ending bugs.  2 were freeze ups and one was a hard crash during a memory.  It was weird because I didn't notice small glitches, other than my AI companion dodge rolling nothing over and over again in a corner.\n\n[h2] So in Conclusion [/h2]\nThe game is okay, but IMO you may enjoy yourself more playing something else.  I think the thing I enjoyed most about this was the really big sale I bought it on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pls fix the GAME, game takes forever to load up after switching to Windows 11, already tried reinstalling the Steam and this game, still NOT Fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I might return to this one someday, but a few hours in I decided to drop it. The world was interesting in concept but the story in it was painfully generic and the gameplay didn't have any sort of feeling to it. It felt like smashing two action figures together rather than a proper soulslike.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In my opinion, Code Vein is a decent game with good innovation that sets it apart from other \"souls-likes\". \r\n\r\nIs it a good soulslike, tho? No.\r\n\r\nIt will probably be the only valid opinon on the topic of answering that second question, but if you want a more engaging experience, buy the Dark Souls games and the othter FromSoftware games like Bloodborne, Elden Ring, and Sekiro.\r\n\r\nThose games are masterpieces compared to this one, and while this game attempts to copy those games, it never lives up to the same hype.\r\n\r\nI actually bought this game because of YouTubers hyping it up when it first released and it feels like a chore everytime I put it on to play, because I'd much rather be playing the original games that it clearly spun off of.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I want to like but its just not very good, even on a deep sale I dont think its worth anyones time. I remembered liking it alot more on release but the bar is just much higher now and the problems are just unending. Hopefully CV2 is alot better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not particularly endearing or creative and has one of the most annoying grindy achievements I have seen in such a game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a decent game, but there are some problems that make me not want to recommend it.\r\n\r\nBalance: Getting my weapon skills stopped by EVERY F*ING MINOR ATTACK FROM ANY F*ING ENEMY, even tho i'm wearining one of the tankiest loadout i could use, MAKES NO F*ING SENSE! I have to hit the enemies 3+ times for them to stagger for 1s, but anything f*s me over, seriously, what a s*tty a** system;\r\n\r\nMaps: The maps in this game are some of the worst i ever saw in any game. Almost all of them have are just a narrow path with pits on both side that are there just to f* u over and kill u for no reason. Cause of that u are almost forced to play with 2-hand sword and block every attack, otherwise u will be killed by gravity more than by enemies;\r\n\r\nBlock: U have like 3 weapons u can fully block attacks, so u are very limited, and u still get status effects from blocked attacks, which MAKES NO F*ING SENSE!;\r\n\r\nMastering gifts: This system is kinda interesting, till u notice how many classes and skills there are in this game, then it becomes a stupid a** idea and just an annoying af system;\r\n\r\nLast boss: Just... a joke... probably the esiest boss in the game, i dont understand why so many devs dont understand the concept of a 'last boss'...;\r\n\r\nI bought this game cause of the 2* one that is coming, but after playing this one, i dont care about the 2* anymore 🤮🤡",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So awesome literally unplayable because of an issue with 12th gen intel cpus.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this game some time ago and i remember liking it, I'd like to play this game again but it is in an unplayable state right now. For some reason the game takes 10+ minutes to launch on my pc that can handle heavily modded Skyrim, the game also keeps crashing when switching tabs and lags the computer. \nIf these issues are not solved I wouldn't recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it had some nice ideas, and was decent to play. ultimately it just never fully clicked for me, with some frustrating level design choices, and just overall being a bit repetitive. neutral.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute dogshit combat, everything you do animation locks you for way to long. Dodge has a delay, healing takes 7-10 business days and boss attacks are badly telegraphed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "another shitty soulslike that counts on unblockable enemies and animation locks rather than actual challenging combat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone who came to this game from God Eater(same universe) and Dark Souls 3(same gameplay), it is VERY hard to give this game a positive review.\n\n[h2] PROS: [/h2]\n\n- This game is basically just anime dark souls... but that's it. After 10+ hours of playtime that is genuinely the only thing keeping me playing this game because I like souls gameplay. I'm metaphorically hanging by a thread and the souls-like gameplay is that thread. \n\n- The character customizer is also where a lot of my playtime came from. This game has one of the best character customizers I've ever seen. Most customizers out there focus on weird niche adjustments to your face and body (that you'll never notice in gameplay), which never interested me, but Code Vein has so many cosmetics and colors it's insane.\n\n- There's a playable piano, which arguably is better than actually playing the game.\n\n[h2] CONS: [/h2]\n\n- The voice acting in this game is so dry it's equivalent to the way the monkeys talk in Bloons TD... \n\n- The story imo isn't very interesting... \n\n- The music is just whatever... \n\n- The characters themselves are extremely boring and thus far I've been given no reason to care about them. \n\n- The difficulty honestly seems to be a bit all over the place, rather than the more gradual difficulty jumps I'm used to from Dark Souls 3. \n\n- There is a bug (or perhaps intentional feature) where, sometimes, when locked onto an enemy you will try to roll away from them but instead the game forces you to roll straight towards them. This bug has gotten me comboed to death so many times it's not even funny.\n\n- As far as boss fight design goes, I would confidently say that they focused more on sexualizing the bosses rather than making bosses that are actually satisfying to learn to fight. Seriously, the very first major boss pole dances in her cutscene half-naked before proceeding to have some of the worst hit registration and most troll-ish moveset imaginable. \n\nIf you're thinking of getting this game, literally do not buy it unless it's on a massive sale. That's what I did, and I guess I don't regret my purchase with how little I spent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing character creator and has a good style and identity. Everything not so good, the combat and enemy design is terrible to put it plainly. The levels also need some serious work, I couldn't keep going just with how bad the combat feels compared to other games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad level design. Reminded  me of the 1st Halo game where the entire level is nothing but a repetitive environment. Code Vein is in the same mold. The Cathedral is probably the work of a lazy team of devs who kept recycling the same polygons as they had no idea what else to do for a level and created a long looping maze. Its basically a loop trap maze. If you like moving inside a maze to waste hours seeing the same are then this game is for boring humans like you.\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Taking 15 min to boot up. Why do devs keep getting away with shit ports? Also, UE.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I saw this game through to the end, and I can't summarize it any other way than that, for five bucks, I felt like I ultimately had wasted my time.\n\n[h2] We have Dark Souls at home[/h2] \nLet's get the obvious one out of the way. Yeah, the Dark Souls DNA is in there, but more reminiscent of a disappointment of a child. Everything that's borrowed from the genre is done Okay at best, and frustratingly poor at worst.\n\nIn fact, I had to ask myself this question: Would this game even pass 'mediocre' if it didn't have all the Dark Souls stuff? The answer's no. This slap-dash attempt at it really is what's keeping this game from truly falling into the abyss, and it's not even doing a good job at it.\n\nThis is where the character limit for steam reviews really hurts, because I could spend the next hour going through the list. So instead I'll summarize it as this: If this is your first entry in Soulslikes, turn back and get a refund. There are only attempts at copying the genius that took place in the legendary series, and none of them are done with any understanding of why they worked.\n\n[h2]I fear the Anime fan who's okay with swallowing this quality of storytelling[/h2]\n\nCan... can I speak plainly to you for a second? You know that stereotypical anime vibe, with those stereotypical beats of \"I'm with you!\" \"You'll never get away with this, bad guy!\" \"Thank you for being there for me\" while being literally a silent protagonist for 99.8% of the game? Just imagine the most trite stuff, stereotypical villains with evil laughs that don't sound good. It's just so... stereotypical japanese tripe. There is nothing new, ingenious or worthwhile here. If I watched this as a cutscene movie to save myself the 24 hours, I'd still feel like I'd wasted my time.\n\n[h3]Alright, here goes.[/h3]\n\nYou are special Vampy McVampire, in a world of mostly vampires (read: Revenants) who need blood beads (glass blood... thingies, because biting people is yucky!). There once was a really, really strong and evil vampire called the Queen! So strong that they couldn't kill her, so they just split up her heart in pieces, and put them in Successors.\nBut these Successors will eventually give into frenzy within their self-imposed prison, and hurt everybody! Luckily, you can eat the Queen's pieces with no repercussion! You even get classes out of it! So let's go kill/save all the Successors, beat the badguy who has such a stereotypical evolution monologue, it made me genuinely wish for Albert Wesker's sultry voice.\n\nReally, it's the endings that bother me the greatest in this. Or rather, the mechanics regarding your choice of them. There's three endings, good/normal/bad. You get the good ending by finding all the... 'vessel pieces' of the relevant Successor, beating them, and then instead of letting them turn to ash you 'save' them by giving them their sanity back or something.\n\n[b]Fun fact[/b]: The game never explains any of this. You're never told that you have to turn every map inside out for all the pieces and merge them for memories (read: forced walking Fallout 4 memory lane setpieces) with the Successor's attendant BEFORE you ever start the fight. Attendants are... big titted white hair girls that all look the same and the one that's assigned to you has an existential crisis, but nobody cares about that.\n\nAnyway, if you mess up saving even ONE Successor, the Good ending's locked out. Yeah, get rekt, idiot. Save none of them, and you get the bad ending. So if you're unaware of this system and accidentally saved one and didn't another, guess what: You're locked in the 'normal' ending. Remember how in the Souls games you had to go out of your way to 'earn' the endings? Code Vein missed that tidbit, and is so much worse for it. All these successors have emotional connections to your companions, and you've failed them, but they still thank you for trying, because you're the protag!\n\nThat's where I give up.\n\n[h2]Unsurprisingly, it's the builds that kept me interested[/h2]\n\nClasses are called Blood Codes, and there's a heaping helping of them that you can freely switch between at any time outside of combat. They all sit somewhere on a venn diagram that governs combat styles, the most prominent stats, gift power (read: skills, like spells and special attacks that require ichor (read: mana points)) and so on.\n\nThey all also have their own set of skills unique to them, most of which you have to unlock by finding their relevant vessel pieces and then purchasing them with the currency that's like souls but I forgot the name of. You've got 8 active slots and 4 passive slots, and when you beat enough enemies with them equipped, they become 'mastered' and usable on any of the other classes.\n\nHonestly? Great idea. It's a very different (maybe even unique?) take on spells and attack skills and I'm here for it. Making builds is one of my favorite delights in gaming, and you're going to have a huge load of them to choose from as you go.\n\nDownside though: If a particular blood code does not jive for you in how it (doesn't) compliments your combat, you're either going to annoy yourself enough to level it up, ignore it, or use a currency + souls to unlock the skill immediately. Said currency is rather unreliable to farm and has an absolutely uninspired name. Like Awake MJ018 and Awake MJ212. What's that even supposed to mean? You couldn't have just given it a name like, Small Awakening Stone, Medium, etc. or something? So dumb.\n\n[h2]The combat's there, I guess[/h2]\n\nThe combat constantly flows between \"I've done this a million times\", and constant annoyance. There's five weapon classes, with movesets differing within the class, from slightly to completely. Not a terrible idea, be boring if there was no variety. I'm partial towards the one halberd that's all spear thrusts. Quick and damaging. The greatswords're good fun too.\n\nThe 1h swords felt... spammy and underpowered, the 'bayonet' (which is actually the gun AND the bayonet attached to the front) is your quickest and dash-iest 'long dagger' with a pinch of using Ichor to shoot a moderately powerful bullet as a heavy attack. And the hammer is... like a slower, less interesting greatsword, honestly.\n\nWhere it rattles apart is when you go up against enemies that are relentless and love exploiting their moveset.\nA mist-dash that closest the gap immediately, even across the map, AND ignores block? You bet they'll pressure you with it!\nTake full damage on the end of a wide swing while sitting behind the enemy.\nGet stunlocked when ganged up by monkeys, taking you from full to zero in mere seconds.\n\nIt feels like, just because you're given the option of an AI companion, that the game has the A-Ok to pound you into the ground at any moment.\n\nSpeaking of which, you bet the AI companions swim between 'useless b*stard' and Unga Bunga. Yakumo's great because he can spam a skill on you that soaks up the next hit you take for 95%, and unga bunga's his greatsword onto the enemy. Great for bosses. Everyone else is kind of situational, based on how much ranged support you need in your map traversal.\n\n[h2]I'm tired, man.[/h2]\n\nWe're sitting at this frustrating situation where the potential is there with a few good ideas, only to be marred by a series of either bad choices or low effort. You can't argue that the game's not wasting my time when one of the ways you have me transition to the next area is literally a 5 minute uneventful concrete hallway with the occasional ladder and nothing else to look at, not even enemies! And one of the sidequest NPCs has her smack dab in it! Because yes, I love spending minutes looking at my stamina bar drop to zero as I sprint through.\n\nFor as much as I complained about them, at least Evil West had [i]some[/i] satisfying combat, and Remnant 1&2 took a shot at the genre by trying to fit mostly shooting into it. And those games still sucked!\n\nI paid 5 bucks for the entire dealio, and I don't think I got my money's worth. So please, save yours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got stuck to an elevator which not working after defeating Butterfly of Delirium, and can't proceed anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "go back to your communism, americunt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i forgot my cup",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate that maze",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "clunky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shut the fuck up Louis",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Ну и дерьмо.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "code mid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS MADE FOR MASCHOISTS AND THE GAME DELVELOLPS ARE SHITTY ANDF HA VEE NO LIFERE akjlwDJHOIkawHUIODV ahuioWVDOHIMunaWHUNKVDAHUIMNHKMVAVadhjlkm DVaLHJKM VEDhimnulHUNIMLEIMJLVEWVUHIMEEMHUFIVEFHUIMOVEFSUIMHOVUIHSHUIVSRHUIOVSEVHUIMSEFHUIMVVWSFHEUIMOHVIMANUDSWIHUNWDA CWDIANUHOWDIAUNODWUNANWDAWADY GNUIWDGAN PHUIFH UISFEHUIMPOFESB",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm sure the game on it's own is fine, I've liked everything so far. But this game was bought with the intention of multiplayer with my husband. Learning that multiplayer is just having to play the game twice instead of progressing together really just defeats the purpose for us. So based on that, I don't recommend if you're looking for a multiplayer experience.",
      "voted_up": false,
      "votes_helpful": 183
    },
    {
      "review": "likely a good game, but as of my review there is some sort of odd bug on newer hardware (windows 11, 5080 card) that makes it so the game takes 10 minutes to launch after you hit play on steam, all loading times are WAY longer than they are supposed to be, and multiplayer just doesn't seem to function at all.\n\nmy friends on slightly older hardware all can run the game perfectly fine and even enjoy it but do your research, if your stuff is too new the game might just fail to function",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Bandai, plz do a quick fix for this game. Something happened this couple of years and now the game take too long to boot.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Gameplay just feels bland and boring. I tried playing this with a friend in coop and realised quickly that the coop-design is a joke. No way to restore healing while in coop, if you die you get instant disconnected. If you want to play this coop be prepared for the joiner to spend half his time looking at loading screens when rejoining.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "It's rough.\n\nI feel like I'm getting punished for parrying, it's way too easy to get put in damage loops, Regeneration just doesn't recover enough, and dodging just doesn't work.  Nothing feels effective other than the gun and it gets so boring when you're forced to just run and shoot, but it's not worth frustrating yourself and getting yourself killed constantly trying to melee fight.\n\nlooks flashy and cool but is absolutely infuriating to play.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Code Vein tries to blend the challenge of Souls-like gameplay with an anime-inspired aesthetic, but it struggles to find its own identity. While the character customization is impressive and the art style appealing, the combat often feels clunky and inconsistent, lacking the precision and satisfaction expected from the genre. Level design is repetitive, enemy AI is erratic, and the story, despite some interesting ideas, quickly loses momentum. The result is a game that looks stylish but rarely feels engaging, more imitation than innovation.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Crashes on LInux and Denuvo is preventing the game from launching on Windows because I tried running it on LInux. Remove the useless DRM and please allow me to play the game that I bought.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game was amazing until the Cathedral area. That maze was just too much of a pain to keep me playing. The level itself was more of a pain than the enemies.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Extremely unsatisfying, mid game throughout, a disgraceful soulslike with tiresome ungratifying combat mechanics, repeated enemies throughout that do not react well to your attacks, and bosses that end up being push overs or borderline unfair; plus various problems and bugs especially if you run the game above 60 FPS\r\n\r\nThe game is designed to be played with an AI partner which ends up making it too chill, if you decide to go solo you end up with an unbalanced mess of areas/bosses, the areas being overall uninspired with little incentive to explore carefully, with repeated enemies, swarms of them at time due to the invasion mechanics\r\n\r\nBosses have no middle ground between push overs and borderline unfair, usually spamming AoE moves when played solo, so you end up with an unrewarding and forgettable experience (or rather very memorable due to the overall frustration, especially around the end bosses)\r\n\r\nThe build variety is OK but towards the end you will be forced to switch due to later bosses having insane elemental resistances and being immune to most status effects\r\n\r\nCode Vein also has no Ultrawide support and various problems if you play above 60 FPS (the main problems I experienced were elevators do not function and a certain boss going invisible during it's second phase)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Came for anime dark souls left because of the abyssmal story and EXTREMELY clunky unfun combat. I couldn't even bring myself to finish this game sadly. I feel like I should like it but I just do not vibe with the gameplay at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is boring and soulless. combat was clunky. second game looks promising tho",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Buggy and not interesting, very anime-like game about \"cool vampires\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For a few bucks I can’t complain but game is mediocre at best and overall not very engaging. Coming from playing all the fromsoft games and other popular souls likes I’ve found this one to be unengaging and had me getting bored pretty quick. Worth a shot if you have nothing else to play but overall wouldn’t recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This fucking game has preorder and version exclusive stuff that you cant get anywherey anymore.\n\nLike a Blood Code, that granted isnt that good, but still is something you cabt get without having preordered the game. For those unknowing, Blood Codes are a class system that affect your stats, abbilities and playstyle.\n\nI dont quite remember the other things anymore but i do know that there was even more exclusive stuff.\n\nYou also cant upgrade to the deluxe edition once you bought the normal edition, meaning you will also miss out on deluxe stuff. And no the deluxe exclusive stuff isnt contained in the season pass.\n\nOh and guess what, there is actualy a preorder bonus unlock dlc… on console ! Yup, not on steam or anywhere else just on console ! And it doesnt even give you everything ! Like the Blood Code i mentioned, is still not there !\n\nThese business practices need to stop, dont waste your money on a prodect that doesnt give you the entire product.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Recommend the game for solo experience, highly AVOID IT if you want to play coop with a friend.\n\nHopefully the second game is way better and the combat isn't outdated when compared to AI limit and Khazan.\n\nI just wanna say, few years ago I enjoyed the game. Have not finished it and made my friend buy it a few years later to play coop. We can't. What happened? We've been searching for solutions end on end and it is insane none of them worked for us so far. This is the only way I know I can reach out to you guys, please fix this. Patch this up. I know the second game is going to come out but don't leave this behind because of it. Just fix it.\n\nPerhaps I am in the minority and you won't care for it. Though if the base of the game is about coop, how come that is just broken??",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Code Vein … wow, where to start. This is a game that seems to be equally loved and hated in the souls community, and after spending over 30 hours slogging down its long, repetitive corridors and fighting against the same reskinned enemies over and over again, I came away completely befuddled as to why some people find this game so interesting.\r\n\r\nMaybe it’s the story, which comes off as a ten season anime stuffed into a four-hour info-dump so thick with lore it’s almost indecipherable to all but the most attentive of players. Anime aficionados might enjoy this, and I certainly like a bit of worldbuilding myself, but when the only way to get most of the exposition is to walk very very slowly through an NPCs memories, it soon becomes boring, especially when you have to do it for the fourteenth or fifteenth time.\r\n\r\nThe basic premise, if you are interested, is that you are a sexy androgynous vampire that can gain the powers or “Blood Codes” of others by reliving their memories. The enemies in the game are known as “The Lost”, undead that have gone without blood for so long it has driven them mad. Several years ago, a large number of Lost were killed by a woman vampire named Cruz, although the effort drove her into a frenzy and she was consequently killed in turn by her own father.\r\n\r\nThings get increasingly complicated from there onwards, with not one by two amnesic characters, a sister with a half-frenzied brother, the obligatory mad-scientist, and, as I’m sure you can guess, the suspicion Cruz is not quite as dead as everyone thinks (hint : she’s a vampire).\r\n\r\nThe game mechanics themselves are incredibly similar to Dark Souls. You go from one zone to the next, finding bonfires and unlocking shortcuts. The only real innovation here is that while you do level up through conventional means, your stats are actually governed by what “Blood Code” you have picked as these determine things like poise, weapon scaling, and encumbrance among other things. You can switch between these on the fly which allows for a certain amount of flexibility, but, while some players will certainly enjoy its simplicity, I found it far too restrictive. One of the joys of games like Dark Souls is that you can fine-tune your build to fit your playstyle and I never really found a way to do that effectively here.\r\n\r\nFor example, as a fan of strength builds, I quickly gravitated towards the Atlas Code that allowed me to wear heavy armour and wield big swords at the cost of movement and dodge speed. Thing is, I like having a great sword and being able to dodge, which is impossible from the get-go here, I had to learn all the skills from the Atlas Code, then switch to a different Code and learn all the skills from there, none of which was fun.\r\n\r\nI wouldn’t mind suffering through all that if the combat was fast and addictive. Unfortunately, it’s neither, with an over-reliance of you getting swarmed by enemies that stun-lock you or knock you out of your attack animation mid-swing. I found the moveset to be really finicky too, especially the running attack which sometimes ended with an overhead swing and sometimes with a thrust attack, and I’m still not sure why. Your heavy attacks do the most amount of damage, but I ended up abandoning these entirely after realising they are constantly interrupted and that two or three light attacks do as much damage and fill my ichor (magic points) roughly the same amount.\r\n\r\nFinally, I’ve carefully avoided talking about the jiggle physics here, but even without diving into the waifu aspect of the game, you have to admit that having characters run through the snow fields and ice lakes of one of the levels dressed in what basically amounts to a bra and panties is maybe a little underdressed. Or I guess vampires just don’t feel the cold?\r\n\r\nI don’t despise anime by any stretch of the imagination, I just don’t think it’s a great fit for a soulslike, and the cumbersome way Bandai Namco has chosen to doll out its story beats just doesn’t work. The Blood Code system was an interesting idea that failed to grip me either, as I disliked not having sufficient control over my character’s growth. If neither of these things bother you then maybe give Code Vein a try, but I myself find it difficult to recommend.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Not particularly endearing or creative and has one of the most annoying grindy achievements I have seen in such a game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pros:\n\n- Sims 5 Weebshit character creator\n- THE game where you want to spend hours in photo mode\n\nCons:\n\n- Unpolished overall (gameplay, combat, animations). It feels very stiff and rigid overall\n- Mid story\n- The game places you in the middle of everything and constantly uses fancy words as if expecting you to know everything off the get-go\n\n\nDefinitely NOT worth the full price.\nOn sale it's worth alone strictly for the character creator.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is good, and I'm going to finish it, but a multiplayer bug has persisted since launch where Person A can join Person B but Person B can't join Person A. It's awful, it ruined the plan to playthrough with a friend and it's never been fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What an unoptimized compilation of garbage if I must say and yes I am speaking of the embedded denuvo distribution. I can't really speak regarding the actual gameplay of the game as  it will literally not launch due to how denuvo views proton/vulcan as malware which will state \"Currently your game purchase cannot be re-validated successfully, please wait 24 hours and try again\" after luanching the game yet even after waiting 24 hours this same error will be displayed. This means playing this game on a steam deck or any linux distro for that matter can be a real dead end. Even on windows,  the game can be unplayable due to denuvo listing certain sound driver hardware as malware. I almost never write bad reviews for games that I have been gifted/received for free even if they are bad games but the terrible optimization and awful practices enacted by capcom have forced my hand on this one. Save your money and walk away. The frustration involved in trying to get a broken game with bloatware to work is not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanted to try it out before 2 comes out but insane launch/start-up times(10-15mins), apparently cant have hypethreading enabled in bios or else it takes ages. No other game has issues but this, not worth to change anything just for this one, due it being shitty coded or whatever the devs didnt get done right. No other fix possible according to reddit/steam posts. No high hope for 2 if they cant even maintain the first code vein in a playable state for modern systems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Review after playing through the game, which took about 30 hours.  There's stuff in this game about anime vampires that some people will like.  But I think its overall pretty mid and your time would be better spent playing something else.\n\n[h2] The Good [/h2]\nThe callout nice feature of this game is how easy it is to switch between builds.  You collect 'blood codes' of other characters in the game which give you their move-set while equipped.  After spending enough time with those abilities you unlock them permanently and can apply them while using other codes to make a really diverse set of builds.  Swapping between codes is a really quick process, technically you could swap builds for every fight.  Going from full caster to a full strength build takes a few seconds, and that is really neat.  Its also a bit tiring trying to level and manage all of that, but I'm sure some people are really into that.\n\nExploration is also pretty well done.  This isn't open world but it is still satisfying.  \n\nThe story is entertaining enough.  The game does stop every time you get or try to upgrade a blood code to force you to walk through someone's memory.  That's sort of a pace killer imo, but yeah the story is present and not quite what I was expecting from the premise.\n\n[h2] The Rest of It [/h2]\nI didn't enjoy the combat, it felt too loose for me.  And that is kind of the focus of the game.  They did try some things around, like having your parry timing change based on the armor you are wearing.  I applaud the attempt, but I found the parry window ranges from \"Early\" to \"Really Really Early\" so I just didn't engage with that system after a while.\n\nIt feels like they designed this game to be a multiplayer game, but then backed down to giving you a companion all the time.  So a lot of the time it felt like they maybe should have put more effort into balancing out enemy attack windows and such, but instead just band-aided the problem with an AI buddy.  \n\nAnd that laziness extends to a feature I was looking forward to, the Depths.  Which is a repeatable dungeon with a farmable boss at the end.  Those unfortunately feel like a reskin/copy&paste job that I just lost interest in after doing about 5 of them.\n\nI also encountered at least 3 game ending bugs.  2 were freeze ups and one was a hard crash during a memory.  It was weird because I didn't notice small glitches, other than my AI companion dodge rolling nothing over and over again in a corner.\n\n[h2] So in Conclusion [/h2]\nThe game is okay, but IMO you may enjoy yourself more playing something else.  I think the thing I enjoyed most about this was the really big sale I bought it on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unfortunate review for Intel-based users on **Linux**. (Specifically, this was tested on Nobara KDE 42.)\n\nThis appears to run fine if you're using an AMD CPU, however on Intel the game will fail to launch. As there's no native Linux port, you're forced to deal with the compatibility issues, unfortunately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pls fix the GAME, game takes forever to load up after switching to Windows 11, already tried reinstalling the Steam and this game, still NOT Fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "uninstalled a while ago and reinstalled recently, game crashes every time i try to load into any of my saves",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In order for a soulslike to really stand out it needs to match at the very least the quality of fromsoft games. This game, while being produced in 2019, has less QoL options than even dark souls 1. The attack and dodge animations are super clunky to work with, more so than even ds1 imo. The leveling system is very bland. The control scheme is extremely weird, I'm not a fan of it. \n\nBy far my worst issue with it though is that this game advertises itself as being a 'coop' game but the coop sucks ass, you can't save while in coop unless you discover a new save point location but you can't 'rest' during the entirety of the multiplayer thing either so it's really easy to have your progress reset. When you die your 'helper' gets kicked out. And your coop partner's progress doesn't save so you would have to complete everything twice. What we have here isn't a \"Coop\" system as that would imply the multiplayer is somehow built for full cooperation. This is somehow a worse summoning system than what exists in fromsoft games. I bought this game pretty much for the multiplayer because it was advertised as a coop game in the store page. Advertising this game as coop is dishonest.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It takes 10 minutes to launch the game on my RTX 4080 PC, but it runs perfectly on my Steam Deck with no issues at all. Are modern PCs just not compatible with this game?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Code Vein feels like a hack and slash JRPG that wants to be a souls-like. \r\nUnfortunately nothing lands. \r\nIt isn't Devil May Cry or Final Fantasy or a decent souls-like. \r\nCombat is extremely brutal and also extremely simple. Attacks don't have gravity, back stabs and parries are so floaty I stopped even trying to use them. \r\n\r\n6/10 at its best.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "!THIS GAME IS A SCAM IN ITS CURRENT STATE IF YOU HAVE A WINDOWS 11 MACHINE!\n\nIf you have a windows 11 machine, the game takes anywhere between 7 - 10 minutes to load from pressing play on Steam to seeing the Bandai logo splash and, even after that, the online will not work for you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Aside from its amazing character creator, has pretty much nothing else going for it.\nEven for guys playing normal builds, it feels way 2 ez, with outdated level design and combat that has zero impact. Oh, and don’t even get me started on the janky achievement tracking—so many of the progression-based ones are just broken. Take the \"Determiner of Fate\": in \"Dweller in the Dark\" endings picking the Queen’s code route doesn’t even count toward completion! I had to dig up an old save snapshot from git cause of that nonsense. And guess what? Progression doesn’t carry over between saves! Yeah, I unlocked the all achievement badge in Save A, but had to grind out the \"Weaver of Wills\" code collection in Save B. So weird.\n+ Partner system is legit awesome (Yakumo carried me no cap\n+ Swap builds freely without respec\n- One of the most poorly designed maps in Souls-like history: Cathedral of the Sacred Blood\n- Highly homogenized enemy types\n- Awful attack registration and input delay\n- A χρύσεον γένος quirk where elevators only work at 60fps, ladders require 30 to move\n[hr][/hr]\n[h3]Reviews: 3/10[/h3]",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I might return to this one someday, but a few hours in I decided to drop it. The world was interesting in concept but the story in it was painfully generic and the gameplay didn't have any sort of feeling to it. It felt like smashing two action figures together rather than a proper soulslike.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it's a great game but it won't start up, there's like some bug that makes you wait like 10+ minutes just for it to start",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In my opinion, Code Vein is a decent game with good innovation that sets it apart from other \"souls-likes\". \r\n\r\nIs it a good soulslike, tho? No.\r\n\r\nIt will probably be the only valid opinon on the topic of answering that second question, but if you want a more engaging experience, buy the Dark Souls games and the othter FromSoftware games like Bloodborne, Elden Ring, and Sekiro.\r\n\r\nThose games are masterpieces compared to this one, and while this game attempts to copy those games, it never lives up to the same hype.\r\n\r\nI actually bought this game because of YouTubers hyping it up when it first released and it feels like a chore everytime I put it on to play, because I'd much rather be playing the original games that it clearly spun off of.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I want to like but its just not very good, even on a deep sale I dont think its worth anyones time. I remembered liking it alot more on release but the bar is just much higher now and the problems are just unending. Hopefully CV2 is alot better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a decent game, but there are some problems that make me not want to recommend it.\r\n\r\nBalance: Getting my weapon skills stopped by EVERY F*ING MINOR ATTACK FROM ANY F*ING ENEMY, even tho i'm wearining one of the tankiest loadout i could use, MAKES NO F*ING SENSE! I have to hit the enemies 3+ times for them to stagger for 1s, but anything f*s me over, seriously, what a s*tty a** system;\r\n\r\nMaps: The maps in this game are some of the worst i ever saw in any game. Almost all of them have are just a narrow path with pits on both side that are there just to f* u over and kill u for no reason. Cause of that u are almost forced to play with 2-hand sword and block every attack, otherwise u will be killed by gravity more than by enemies;\r\n\r\nBlock: U have like 3 weapons u can fully block attacks, so u are very limited, and u still get status effects from blocked attacks, which MAKES NO F*ING SENSE!;\r\n\r\nMastering gifts: This system is kinda interesting, till u notice how many classes and skills there are in this game, then it becomes a stupid a** idea and just an annoying af system;\r\n\r\nLast boss: Just... a joke... probably the esiest boss in the game, i dont understand why so many devs dont understand the concept of a 'last boss'...;\r\n\r\nI bought this game cause of the 2* one that is coming, but after playing this one, i dont care about the 2* anymore 🤮🤡",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So awesome literally unplayable because of an issue with 12th gen intel cpus.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this game some time ago and i remember liking it, I'd like to play this game again but it is in an unplayable state right now. For some reason the game takes 10+ minutes to launch on my pc that can handle heavily modded Skyrim, the game also keeps crashing when switching tabs and lags the computer. \nIf these issues are not solved I wouldn't recommend this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it had some nice ideas, and was decent to play. ultimately it just never fully clicked for me, with some frustrating level design choices, and just overall being a bit repetitive. neutral.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Temu version of dark souls\r\nOnly good thing about it is Mia and Murasame\r\n\r\nnot even worth buying in discount",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolute dogshit combat, everything you do animation locks you for way to long. Dodge has a delay, healing takes 7-10 business days and boss attacks are badly telegraphed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "another shitty soulslike that counts on unblockable enemies and animation locks rather than actual challenging combat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As someone who came to this game from God Eater(same universe) and Dark Souls 3(same gameplay), it is VERY hard to give this game a positive review.\n\n[h2] PROS: [/h2]\n\n- This game is basically just anime dark souls... but that's it. After 10+ hours of playtime that is genuinely the only thing keeping me playing this game because I like souls gameplay. I'm metaphorically hanging by a thread and the souls-like gameplay is that thread. \n\n- The character customizer is also where a lot of my playtime came from. This game has one of the best character customizers I've ever seen. Most customizers out there focus on weird niche adjustments to your face and body (that you'll never notice in gameplay), which never interested me, but Code Vein has so many cosmetics and colors it's insane.\n\n- There's a playable piano, which arguably is better than actually playing the game.\n\n[h2] CONS: [/h2]\n\n- The voice acting in this game is so dry it's equivalent to the way the monkeys talk in Bloons TD... \n\n- The story imo isn't very interesting... \n\n- The music is just whatever... \n\n- The characters themselves are extremely boring and thus far I've been given no reason to care about them. \n\n- The difficulty honestly seems to be a bit all over the place, rather than the more gradual difficulty jumps I'm used to from Dark Souls 3. \n\n- There is a bug (or perhaps intentional feature) where, sometimes, when locked onto an enemy you will try to roll away from them but instead the game forces you to roll straight towards them. This bug has gotten me comboed to death so many times it's not even funny.\n\n- As far as boss fight design goes, I would confidently say that they focused more on sexualizing the bosses rather than making bosses that are actually satisfying to learn to fight. Seriously, the very first major boss pole dances in her cutscene half-naked before proceeding to have some of the worst hit registration and most troll-ish moveset imaginable. \n\nIf you're thinking of getting this game, literally do not buy it unless it's on a massive sale. That's what I did, and I guess I don't regret my purchase with how little I spent.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Amazing character creator and has a good style and identity. Everything not so good, the combat and enemy design is terrible to put it plainly. The levels also need some serious work, I couldn't keep going just with how bad the combat feels compared to other games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad level design. Reminded  me of the 1st Halo game where the entire level is nothing but a repetitive environment. Code Vein is in the same mold. The Cathedral is probably the work of a lazy team of devs who kept recycling the same polygons as they had no idea what else to do for a level and created a long looping maze. Its basically a loop trap maze. If you like moving inside a maze to waste hours seeing the same are then this game is for boring humans like you.\nNot recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Taking 15 min to boot up. Why do devs keep getting away with shit ports? Also, UE.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I saw this game through to the end, and I can't summarize it any other way than that, for five bucks, I felt like I ultimately had wasted my time.\n\n[h2] We have Dark Souls at home[/h2] \nLet's get the obvious one out of the way. Yeah, the Dark Souls DNA is in there, but more reminiscent of a disappointment of a child. Everything that's borrowed from the genre is done Okay at best, and frustratingly poor at worst.\n\nIn fact, I had to ask myself this question: Would this game even pass 'mediocre' if it didn't have all the Dark Souls stuff? The answer's no. This slap-dash attempt at it really is what's keeping this game from truly falling into the abyss, and it's not even doing a good job at it.\n\nThis is where the character limit for steam reviews really hurts, because I could spend the next hour going through the list. So instead I'll summarize it as this: If this is your first entry in Soulslikes, turn back and get a refund. There are only attempts at copying the genius that took place in the legendary series, and none of them are done with any understanding of why they worked.\n\n[h2]I fear the Anime fan who's okay with swallowing this quality of storytelling[/h2]\n\nCan... can I speak plainly to you for a second? You know that stereotypical anime vibe, with those stereotypical beats of \"I'm with you!\" \"You'll never get away with this, bad guy!\" \"Thank you for being there for me\" while being literally a silent protagonist for 99.8% of the game? Just imagine the most trite stuff, stereotypical villains with evil laughs that don't sound good. It's just so... stereotypical japanese tripe. There is nothing new, ingenious or worthwhile here. If I watched this as a cutscene movie to save myself the 24 hours, I'd still feel like I'd wasted my time.\n\n[h3]Alright, here goes.[/h3]\n\nYou are special Vampy McVampire, in a world of mostly vampires (read: Revenants) who need blood beads (glass blood... thingies, because biting people is yucky!). There once was a really, really strong and evil vampire called the Queen! So strong that they couldn't kill her, so they just split up her heart in pieces, and put them in Successors.\nBut these Successors will eventually give into frenzy within their self-imposed prison, and hurt everybody! Luckily, you can eat the Queen's pieces with no repercussion! You even get classes out of it! So let's go kill/save all the Successors, beat the badguy who has such a stereotypical evolution monologue, it made me genuinely wish for Albert Wesker's sultry voice.\n\nReally, it's the endings that bother me the greatest in this. Or rather, the mechanics regarding your choice of them. There's three endings, good/normal/bad. You get the good ending by finding all the... 'vessel pieces' of the relevant Successor, beating them, and then instead of letting them turn to ash you 'save' them by giving them their sanity back or something.\n\n[b]Fun fact[/b]: The game never explains any of this. You're never told that you have to turn every map inside out for all the pieces and merge them for memories (read: forced walking Fallout 4 memory lane setpieces) with the Successor's attendant BEFORE you ever start the fight. Attendants are... big titted white hair girls that all look the same and the one that's assigned to you has an existential crisis, but nobody cares about that.\n\nAnyway, if you mess up saving even ONE Successor, the Good ending's locked out. Yeah, get rekt, idiot. Save none of them, and you get the bad ending. So if you're unaware of this system and accidentally saved one and didn't another, guess what: You're locked in the 'normal' ending. Remember how in the Souls games you had to go out of your way to 'earn' the endings? Code Vein missed that tidbit, and is so much worse for it. All these successors have emotional connections to your companions, and you've failed them, but they still thank you for trying, because you're the protag!\n\nThat's where I give up.\n\n[h2]Unsurprisingly, it's the builds that kept me interested[/h2]\n\nClasses are called Blood Codes, and there's a heaping helping of them that you can freely switch between at any time outside of combat. They all sit somewhere on a venn diagram that governs combat styles, the most prominent stats, gift power (read: skills, like spells and special attacks that require ichor (read: mana points)) and so on.\n\nThey all also have their own set of skills unique to them, most of which you have to unlock by finding their relevant vessel pieces and then purchasing them with the currency that's like souls but I forgot the name of. You've got 8 active slots and 4 passive slots, and when you beat enough enemies with them equipped, they become 'mastered' and usable on any of the other classes.\n\nHonestly? Great idea. It's a very different (maybe even unique?) take on spells and attack skills and I'm here for it. Making builds is one of my favorite delights in gaming, and you're going to have a huge load of them to choose from as you go.\n\nDownside though: If a particular blood code does not jive for you in how it (doesn't) compliments your combat, you're either going to annoy yourself enough to level it up, ignore it, or use a currency + souls to unlock the skill immediately. Said currency is rather unreliable to farm and has an absolutely uninspired name. Like Awake MJ018 and Awake MJ212. What's that even supposed to mean? You couldn't have just given it a name like, Small Awakening Stone, Medium, etc. or something? So dumb.\n\n[h2]The combat's there, I guess[/h2]\n\nThe combat constantly flows between \"I've done this a million times\", and constant annoyance. There's five weapon classes, with movesets differing within the class, from slightly to completely. Not a terrible idea, be boring if there was no variety. I'm partial towards the one halberd that's all spear thrusts. Quick and damaging. The greatswords're good fun too.\n\nThe 1h swords felt... spammy and underpowered, the 'bayonet' (which is actually the gun AND the bayonet attached to the front) is your quickest and dash-iest 'long dagger' with a pinch of using Ichor to shoot a moderately powerful bullet as a heavy attack. And the hammer is... like a slower, less interesting greatsword, honestly.\n\nWhere it rattles apart is when you go up against enemies that are relentless and love exploiting their moveset.\nA mist-dash that closest the gap immediately, even across the map, AND ignores block? You bet they'll pressure you with it!\nTake full damage on the end of a wide swing while sitting behind the enemy.\nGet stunlocked when ganged up by monkeys, taking you from full to zero in mere seconds.\n\nIt feels like, just because you're given the option of an AI companion, that the game has the A-Ok to pound you into the ground at any moment.\n\nSpeaking of which, you bet the AI companions swim between 'useless b*stard' and Unga Bunga. Yakumo's great because he can spam a skill on you that soaks up the next hit you take for 95%, and unga bunga's his greatsword onto the enemy. Great for bosses. Everyone else is kind of situational, based on how much ranged support you need in your map traversal.\n\n[h2]I'm tired, man.[/h2]\n\nWe're sitting at this frustrating situation where the potential is there with a few good ideas, only to be marred by a series of either bad choices or low effort. You can't argue that the game's not wasting my time when one of the ways you have me transition to the next area is literally a 5 minute uneventful concrete hallway with the occasional ladder and nothing else to look at, not even enemies! And one of the sidequest NPCs has her smack dab in it! Because yes, I love spending minutes looking at my stamina bar drop to zero as I sprint through.\n\nFor as much as I complained about them, at least Evil West had [i]some[/i] satisfying combat, and Remnant 1&2 took a shot at the genre by trying to fit mostly shooting into it. And those games still sucked!\n\nI paid 5 bucks for the entire dealio, and I don't think I got my money's worth. So please, save yours.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Got stuck to an elevator which not working after defeating Butterfly of Delirium, and can't proceed anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "go back to your communism, americunt",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i forgot my cup",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate that maze",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "clunky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shut the fuck up Louis",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Ну и дерьмо.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "code mid",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS MADE FOR MASCHOISTS AND THE GAME DELVELOLPS ARE SHITTY ANDF HA VEE NO LIFERE akjlwDJHOIkawHUIODV ahuioWVDOHIMunaWHUNKVDAHUIMNHKMVAVadhjlkm DVaLHJKM VEDhimnulHUNIMLEIMJLVEWVUHIMEEMHUFIVEFHUIMOVEFSUIMHOVUIHSHUIVSRHUIOVSEVHUIMSEFHUIMVVWSFHEUIMOHVIMANUDSWIHUNWDA CWDIANUHOWDIAUNODWUNANWDAWADY GNUIWDGAN PHUIFH UISFEHUIMPOFESB",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm sure the game on it's own is fine, I've liked everything so far. But this game was bought with the intention of multiplayer with my husband. Learning that multiplayer is just having to play the game twice instead of progressing together really just defeats the purpose for us. So based on that, I don't recommend if you're looking for a multiplayer experience.",
      "voted_up": false,
      "votes_helpful": 183
    },
    {
      "review": "likely a good game, but as of my review there is some sort of odd bug on newer hardware (windows 11, 5080 card) that makes it so the game takes 10 minutes to launch after you hit play on steam, all loading times are WAY longer than they are supposed to be, and multiplayer just doesn't seem to function at all.\n\nmy friends on slightly older hardware all can run the game perfectly fine and even enjoy it but do your research, if your stuff is too new the game might just fail to function",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Bandai, plz do a quick fix for this game. Something happened this couple of years and now the game take too long to boot.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Gameplay just feels bland and boring. I tried playing this with a friend in coop and realised quickly that the coop-design is a joke. No way to restore healing while in coop, if you die you get instant disconnected. If you want to play this coop be prepared for the joiner to spend half his time looking at loading screens when rejoining.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "It's rough.\n\nI feel like I'm getting punished for parrying, it's way too easy to get put in damage loops, Regeneration just doesn't recover enough, and dodging just doesn't work.  Nothing feels effective other than the gun and it gets so boring when you're forced to just run and shoot, but it's not worth frustrating yourself and getting yourself killed constantly trying to melee fight.\n\nlooks flashy and cool but is absolutely infuriating to play.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Code Vein tries to blend the challenge of Souls-like gameplay with an anime-inspired aesthetic, but it struggles to find its own identity. While the character customization is impressive and the art style appealing, the combat often feels clunky and inconsistent, lacking the precision and satisfaction expected from the genre. Level design is repetitive, enemy AI is erratic, and the story, despite some interesting ideas, quickly loses momentum. The result is a game that looks stylish but rarely feels engaging, more imitation than innovation.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Crashes on LInux and Denuvo is preventing the game from launching on Windows because I tried running it on LInux. Remove the useless DRM and please allow me to play the game that I bought.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game was amazing until the Cathedral area. That maze was just too much of a pain to keep me playing. The level itself was more of a pain than the enemies.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Extremely unsatisfying, mid game throughout, a disgraceful soulslike with tiresome ungratifying combat mechanics, repeated enemies throughout that do not react well to your attacks, and bosses that end up being push overs or borderline unfair; plus various problems and bugs especially if you run the game above 60 FPS\r\n\r\nThe game is designed to be played with an AI partner which ends up making it too chill, if you decide to go solo you end up with an unbalanced mess of areas/bosses, the areas being overall uninspired with little incentive to explore carefully, with repeated enemies, swarms of them at time due to the invasion mechanics\r\n\r\nBosses have no middle ground between push overs and borderline unfair, usually spamming AoE moves when played solo, so you end up with an unrewarding and forgettable experience (or rather very memorable due to the overall frustration, especially around the end bosses)\r\n\r\nThe build variety is OK but towards the end you will be forced to switch due to later bosses having insane elemental resistances and being immune to most status effects\r\n\r\nCode Vein also has no Ultrawide support and various problems if you play above 60 FPS (the main problems I experienced were elevators do not function and a certain boss going invisible during it's second phase)",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Came for anime dark souls left because of the abyssmal story and EXTREMELY clunky unfun combat. I couldn't even bring myself to finish this game sadly. I feel like I should like it but I just do not vibe with the gameplay at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is boring and soulless. combat was clunky. second game looks promising tho",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Buggy and not interesting, very anime-like game about \"cool vampires\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For a few bucks I can’t complain but game is mediocre at best and overall not very engaging. Coming from playing all the fromsoft games and other popular souls likes I’ve found this one to be unengaging and had me getting bored pretty quick. Worth a shot if you have nothing else to play but overall wouldn’t recommend.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}